{"authors":["Ekin Karasin For Mailonline"],"date_download":"2018-10-23 02:33:38","date_modify":"2018-10-23 02:33:38","date_publish":"2017-04-26 13:39:23","description":"Chiranut Trairat, 21, said she was 'not angry' at Facebook for showing the video of her husband Wuttisan Wongtalay, 20, killing his baby Natalie and then himself in Thailand.","filename":"data/vaneerConsumption/ThaiwomandefendsFacebookovervideoofbabybeinghung.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3FA0056D00000578-0-image-a-2_1493214484286.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447686_Thai-woman-not-angry-Facebook-video-husband-killing-baby-himself_1540262018.html","title":"Thai woman defends Facebook over video of baby being hung","title_page":"Thai woman defends Facebook over video of baby being hung | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The wife of a man who hanged their 11-month-old baby on Facebook Live has defended the social media site - saying her husband is the only person to blame.\nThe sickening four-minute clip of Wuttisan Wongtalay, 20, killing his daughter Natalie and then himself was broadcast to hundreds of thousands of viewers on Monday evening.\nBut Chiranut Trairat said she was 'not angry' at Facebook and understood that people shared the video because they were 'outraged' by what they saw.\nThe distraught mother, 21, saw the harrowing footage 45 minutes after it was posted and told police.\nChiranut Trairat, whose husband hanged their 11-month-old baby on Facebook Live, has said she doesn't blame the social media site (pictured holding her daughter's body)\nThe mother stands next a decorated and framed picture of her little girl, at the child's funeral service\nThe sickening four-minute clip of Wuttisan Wongtalay (left), 20, killing his daughter Natalie (pictured right, in her mother's arms) and then himself was broadcast to hundreds of thousands of viewers on Monday\nIn an astonishing show of forgiveness, she said: 'I understand that people shared the video because they were outraged and saddened by what happened.\n'I am not angry at Facebook or blaming them on this.'\nUsing a smartphone, Wongtalay recorded himself putting a rope around his daughter’s neck and hanging her. He then killed himself.\nThe footage showing the child’s unbearable final moments were online for 24 hours before being removed.\nTwo video clips were accessible on the father's page for a day. The first clip was watched 112,000 times and the second 258,000 times.\nFacebook admitted last week that it had ‘to do better’ to prevent such horror being uploaded after it took over two hours to delete footage of an American killing a stranger.\nJiranuch Trirat's family gather around her as she bids an emotional goodbye to her 11-month-old daughter Natalee\nThe 21-year-old is comforted by her father following an emotional service at a temple in Phuket\nChiranut Trairat sits in front of her daughter's coffin at Si Sunthon temple\nThe footage was also uploaded on to Facebook-owned YouTube, where it was watched 2,351 times. It was taken down within 15 minutes. It is understood the videos were removed after Thailand’s ministry of digital economy contacted Facebook.\nShe said her husband had been abusive in the past and spent two years in prison before they started dating.\nPolice found the bodies of Wuttisan and the baby in an abandoned hotel in Phuket province after receiving reports of the video.\nPolice colonel Jirasak Siemsak said Wuttisan and his wife had been arguing.\nLocal media reported that Wongtalay, suspected his wife Jiranuch Trirat, 21, of having an affair and had threatened to kill her in a jealous rage earlier that day.\nHe is then said to have stormed out of the house with their baby, Natalie.\nWongtalay killed himself and his daughter after a row with girlfriend Jiranuch Trirat\nFacebook admitted last week that it had ‘to do better’ to prevent such horror being uploaded after it took over two hours to delete footage of an American killing a stranger (pictured, founder Mark Zuckerberg)\nMs Trirat had previously told the Phuket News: 'At 3am yesterday he checked my phone and threatened to kill me.\n'I was very afraid and ran away from the house and left Beta with him.\n'I returned home late in the afternoon and they were not there. I called him to bring Beta back to the house, but I could not get in touch with him. That's when I saw the video clip and called the police.'\nShe said he had checked her phone at 3am and he accused her of having an affair before flying into a jealous rage.\nLt Col Sanit Nookhong of the Thai Royal Police said the murder-suicide was an act of jealousy.\nFacebook has been seeking ways to block videos as quickly as possible after a series of gruesome images, including murder and sexual assault, were broadcast or posted.\nCharge sheet against internet giant grows Steve Stephens posted a video of himself shooting dead 74-year-old foundry worker Robert Godwin Three men were sent to prison yesterday for gang-raping a woman in Sweden and broadcasting the attack over Facebook. Police were alerted after it was posted to a private group on the site with 60,000 members.\nIn the US earlier this month, Steve Stephens posted a video of himself shooting dead 74-year-old foundry worker Robert Godwin in the street. It could be viewed for two hours before being taken down.\nThe assault of a 15-year-old girl by six men was broadcast on Facebook Live last month – with none of the 40 viewers reporting it to police. Officers learned of the attack on the girl, from Chicago, only when her mother went to a police station with images from the video.\nA man in Chicago was shown being tortured in January, with the 30-minute video viewed 16,000 times before it was taken down.\nFacebook has also been criticised for failing to remove images of child abuse, including a video appearing to show a young girl being sexually abused.\nVideos of public amputations and Islamic State propaganda can also be found on Facebook. One group with almost 4,000 followers showed a 30-minute video of mass executions.\nFounder Mark Zuckerberg said last week that his company has 'a lot of work' to do on the problem.\nThe murder in Phuket came less than two weeks after a man in Cleveland, Ohio, in the US posted on Facebook footage of himself fatally shooting another man.\nIn Thailand, the potential for problems with Facebook Live became an issue last May when local media used the platform to broadcast live video of a university lecturer who was locked in a six-hour stand-off with police who were seeking him over the shooting deaths of two colleagues.\nAfter negotiations for his surrender failed, he fatally shot himself, a moment that was shown live.\nFor confidential support call the Samaritans on 116123, visit a local Samaritans branch, or visit www.samaritans.org","url":"https://www.dailymail.co.uk/news/article-4447686/Thai-woman-not-angry-Facebook-video-husband-killing-baby-himself.html"}
