{"authors":["Michelle Moons"],"date_download":"2018-10-30 20:15:31","date_modify":"2018-10-30 20:15:31","date_publish":"2015-08-04 02:01:36","description":"Sarah Palin on Donald Trump: ‘Thank God That He’s Running’","filename":"data/vaneerConsumption/ThankGodThatTrumpsRunning.json","image_url":"https://media.breitbart.com/media/2015/07/trump-palin-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_03__1540930531.html","title":"‘Thank God That Trump's Running’","title_page":"Sarah Palin: ‘Thank God That Trump's Running’","title_rss":"NULL","source_domain":"breitbart.com","text":"Sarah Palin herself joined the Palin Update with Kevin Scholla radio program this week responding to 2016 Presidential candidate Donald Trump’s glowing statements about the former Alaska governor made on the show just last week that went viral within hours.\nWhat started it all? Trump had simply said he would “love” to have former Alaska Governor Sarah Palin serve in an “official capacity” in the event of a Trump Presidency and this week the Governor herself joined the radio program.\nTrump’s praise for Palin made its way across national and international media and entertainment outlets including CNN, Fox, MSNBC, NBC, CBS, Fortune, Time, Washington Times, Washington Post, New York Daily News, local outlets, TMZ, E! and Cosmopolitan to name some as the comments went viral.\n“I absolutely respected even more his boldness for being so candid about his opinion of me,” Palin said of Trump’s candidacy and comments as someone who says she does know Trump well.\nPalin remarked on the overwhelming reaction to Trump’s comments in agreement with Scholla, “Heads exploded, other things exploded and across the U.S. as a result of your interview. I certainly heard from a lot of people, a lot of new people even that I hadn’t been in contact with before, wanting reaction.”\nI do have great respect for him, I have respect for anyone who’s gone through the fire or is going through the fire because I can relate to that. I know it takes guts and tenacity and perseverance to kind of rise above. Some of the constructive criticism is great, but the hate, the haters which is so unnecessary to have to face in my opinion, but those who go through that it makes me respect them even more. Especially when they come out stronger.\nShe said Trump is “calling it like it is” as he is “not a politician.”\nHe’s gonna tell the truth and not couch all of his answers with some poll-tested, kind of namby pamby, vanilla flavored answer to anything. He’s going to be candid and he’s going to be candid and tell you what he thinks, what his solutions are and that’s so refreshing in politics.\nHe’s bringing issues that need to be talked about to the forefront of national debate Palin said.\n“You’re never going to find a perfect candidate,” Palin told Scholla and Palin Update listeners before pointing out that just because she is speaking well of Trump doesn’t mean he’s the only candidate that she could support.\nI thank God that he’s running. He’s stirring it up. He’s coaching, he’s educating the other candidates, letting them know this is how you tap into the good part of a populist movement, these are the issues that the people are talking about, jobs, industry, the competition for our jobs via illegal aliens coming over open borders. All those things that Donald Trump has taken on, well the other candidates now, they have to step up their game.\n“[Trump] literally knows the art of the deal and here in America we’re losing deals left and right. We’re losing, well we’ve lost our industrial state; we’re losing our friends, our allies, we’re losing obviously respect around the globe. We’re losing morale in the United States military with the troops and we so much respect and love and we want them to be able to respect and love their Commander-in-Chief and organization, all these things that we’re losing deals on, Donald Trump is one who’s saying, well here, here’s how you fix the problems, here’s how you seal the deal to win,” Palin said, calling Trump “a real success story.”\nShe remarked that candidates for office need to speak to and listen to average, everyday, hard working American people about the issues they care about. Donald Trump will be able to reveal, “what other attributes are in other candidates.”\nPalin has often spoken positively of Trump publicly and in the wake of Trump’s comments responded to dumfounded media kingmakers’ reactions in an exclusive article for Breitbart News.\n“I have good things to say about [Trump], I have good things to say about all the GOP candidates,” Palin told the Palin Update audience. “I’m have appreciated having the opportunity to speak personally and on a professional level on Mr. Trump’s attributes.”\nPalin went on to speak on the push to defund Planned Parenthood in light of recent undercover video revelations and she spoke on defense of second amendment rights.\nThe entire interview with Governor Palin and the rest of the Palin Update program can be found on MammaGrizzlyRadio.com.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2015/08/03/sarah-palin-on-donald-trump-thank-god-that-hes-running/"}
