{"authors":["Npr Staff"],"date_download":"2018-10-23 01:00:39","date_modify":"2018-10-23 01:00:39","date_publish":"2016-11-25 00:00:00","description":"After an especially brutal election season, many dreaded — or even evaded — the difficult family conversations at Thanksgiving. Now, with the holiday in the books, listeners tell us their stories.","filename":"data/vaneerConsumption/ThanksgivingMiraclesAndMishapsYourDispatchesFromTheDinnerTable.json","image_url":"https://media.npr.org/assets/img/2016/11/25/20161124_181122_wide-f719a7a17f85db53c03ebfe1b1300aeaad6e4963.png?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_11_25_503336497_thanksgiving-miracles-and-mishaps-your-dispatches-from-the-dinner-table_1540256439.html","title":"Thanksgiving Miracles And Mishaps: Your Dispatches From The Dinner Table","title_page":"Thanksgiving Miracles And Mishaps: Your Dispatches From The Dinner Table : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Thanksgiving Miracles And Mishaps: Your Dispatches From The Dinner Table\nEnlarge this image CSA Images/Printstock Collection/Getty Images/CSA Images RF CSA Images/Printstock Collection/Getty Images/CSA Images RF\nSome people had been girding for battle for weeks; others, meanwhile, had been practicing their evasive maneuvers. Some even gave up on the looming fights entirely, heading for safer shores — alone, with takeout, or a good book.\nIt's tough to blame them.\nAfter a particularly brutal election season, Thanksgiving this year had many people feeling nervous about family conversations around the table. In a year riven by a deep partisan divide, the holiday promised more than a little friction with the feasts.\nBut did it really pan out that way?\nThat's the question we posed to you, our listeners, on Facebook. You wrote back with plenty of great stories from the Thanksgiving that was. And from what it sounds like, it was an eventful day for many of you.\nHere's a smorgasbord of our favorite stories, edited only minimally for style. Let's call them our Thanksgiving leftovers, shall we?\nEmily Levine: \"My Thanksgiving consisted of 12 white, Jewish, liberal family members. (I'm 23 and the oldest, and only female, grandchild — the youngest grandchild just began his first year of college). We were doing pretty well avoiding political conversations, as I was hoping we would, since my dad, while someone who voted for Hillary, can be opinionated and loves to play devil's advocate, usually resulting in some awkward moments and negative emotions.\n\"About two-thirds of the way through dessert, the conversation starts to drift toward politics and my dad starts to get a bit riled up. Without realizing what I was really doing, I found myself standing up and very loudly singing 'O Come All Ye Faithful' until the entire family became thoroughly confused and distracted and the conversation halted entirely.\n\"Mission accomplished.\"\nTaylor Smith: \"Earlier this year I came out as bisexual to my ultraconservative, Trump-supporting father. This year, our get-together was small, as usual, with a few 'strays.' We joked about politics; I was a hardcore Bernie supporter, everyone else was for Trump from the beginning of the primaries. Everyone remained loving and light-hearted. At a time with so much backlash and controversy over politics, my family chose to be supportive and loving towards each other. And I think that's what everyone needs this holiday season.\"\nKendall Patterson: \"Knowing that there would be a divided house at Thanksgiving, my aunt printed signs and hung them throughout the house, reminding us to give thanks and leave politics at the door. ...\nEnlarge this image toggle caption Courtesy of Kendall Patterson Courtesy of Kendall Patterson\n\"It was a huge sigh of relief to walk in and see the signs; it felt like a weight had been lifted. Everyone honored this request and it made for a happy, comfortable Thanksgiving. I'm hoping this will be a tradition that sticks for years to come.\"\nCai Hadfield: \"We went to have dinner with my husband's former in-laws (the 'outlaws,' as he calls them). I've always been more observer than member of the layers of that family, but I knew at least two family members in the 65+ layer might want to voice their political views. But no — the new babies in the family kept everyone's mouth clean and tongue civil.\"\nMaris Bosquet: \"I feel sorry for anyone who had Thanksgiving dinner with their family but couldn't get through it because they let a difference of opinion ruin everything.\n\"I didn't have Thanksgiving dinner with my family. I have no family. I didn't have Thanksgiving dinner, either. I couldn't afford it.\n\"Whoever walked away from their family dinner with heartburn or a migraine has no idea how lucky they are.\"\nChristy Eschenbacher: \"I'm currently working in Djibouti, Africa, on a Navy base. Thanksgiving dinner was a great spread put on by our galley with about 3,500 of America's finest. I sat at the table with some of those with whom I have shared a few weeks — up to a nearly a year — in one of the hottest places in the world.\n\"Topics ranged about families and the traditions we have at home, like playing Charades and how his grandparents always win card games. The biggest, most controversial topic was: Have we really been to the moon!? One friend, Eric, and I have been having this debate for several weeks, but this was the first time we have pulled others into our conversation.\n\"Never got heated, but now I think Eric has pulled people to 'the dark side' and got their minds thinking maybe we didn't. I'm still convinced we have really put our feet there. He still holds to it was done in a Hollywood basement.\"","url":"https://www.npr.org/2016/11/25/503336497/thanksgiving-miracles-and-mishaps-your-dispatches-from-the-dinner-table"}
