{"authors":["Jennifer Brett"],"date_download":"2018-10-30 18:57:22","date_modify":"2018-10-30 18:57:22","date_publish":"2016-02-03 07:53:33","description":"\"Thank You For Your Service,\" a movie based on the nonfiction book by David Finkel that examines the...","filename":"data/vaneerConsumption/ThankYouForYourServicefilminginAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/02/03/Images/WPIMAGE_cmgajcbuzz_8541.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_thank-you-for-your-service-filming-atlanta__1540925842.html","title":"\"Thank You For Your Service\" filming in Atlanta","title_page":"\"Thank You For Your Service\" filming in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"\"Thank You For Your Service,\" a movie based on the nonfiction book by David Finkel that examines the effects of PTSD on returning military personnel, is filming in Atlanta. Directed by Jason Hall, it stars Miles Teller, Haley Bennett, Joe Cole and Scott Haze, who all cheered on the Hawks at Monday's game.\nIn related movie news, Vin Diesel saluted veterans and gave a sneak peek at “Billy Lynn’s Long Halftime Walk,” which filmed in Atlanta this year and is due for a November release. He plays a serviceman.\nc9781922070708\nFrom a New York Times review of the book:\nFinkel refuses to pathologize soldiers, even as he concentrates on the 20 to 30 percent who have been psychologically damaged to some degree by their service in Iraq or Afghanistan: “Most are O.K.,” he says, “and others are not.” This is not — nor should it be — an easy book. But it is an essential one. Finkel refuses to gild the misery and ugliness of the last decade and the unpoetic aftermath of war with the kind of sentimentality that has so often clouded our thinking, not only about our military commitments but also about the veterans they produce.\nhttp://link.brightcove.com/services/player/bcpid1496419233001?bctid=4770794074001","url":"https://www.ajc.com/blog/buzz/thank-you-for-your-service-filming-atlanta/GpXV6B4cqx4kgT1hi7AjKM/"}
