{"authors":[],"date_download":"2018-10-30 00:57:19","date_modify":"2018-10-30 00:57:19","date_publish":"2017-01-27 13:21:03","description":null,"filename":"data/vaneerConsumption/ThatWastheWeekThatWas.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/01/TrumpOO.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861039.html","title":"That Was the Week That Was","title_page":"That Was the Week That WasThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"That Was the Week That Was was the name of an old BBC review of the news. It’s also an apt summary of the last week in America, of the first week of the new Trump administration. It’s also the first time the Trump election really hit home for me.\nDon’t get me wrong. I was thrilled as anyone by the November 8 election and since then have discovered a new guilty pleasure: Election Porn. I look up on YouTube what the networks were saying that night and enjoy all the liberal meltdowns. Can’t get enough of Rachel Maddow!\nBut somehow the reality of what had happened didn’t take hold, even after the inauguration. Maybe that’s because I watched it at the Canadian embassy, beside an unemotional crowd of polite folks from the Great White North. And maybe I didn’t expect that things would really change, as they are.\nWho could have expected it? What we’ve seen in the last week is a historical moment, a period that historians will remember 100 years from now. Trump is simply doing what he promised to do. But now he’s doing it, and for friend and foe, it’s sinking in.\nOver the last week we’ve announced our withdrawal from the Trans Pacific Partnership (TPP) and suggested we’re going to tax Mexican goods shipped to America. We’d do that to pay for the Wall, but after all, it’s simply a reasonable way to eliminate the effect of the 20 percent Mexican VAT tax.\nWe’re planning to declare Obama’s friends, the Moslem Brotherhood, a terrorist organization, and Secretary Mattis has plans to eliminate ISIS and establish a safe zone for refugees in Syria. Not America, to be sure, because we’re abandoning our refugee program for people from that country and other dangerous places. Our existing refugee program brought in 15,000 Syrian refugees, nearly 100 percent of whom were Moslems in spite of the fact that the Christian community was the most threatened by ISIS.\nWe’re signaling a willingness to recast the foundations of American foreign policy since 1948, with an opening to Russia and a more realistic understanding of the NATO alliance.\nWe’ve got a nominee for the Secretary of Education who believes in school choice and an NSC staff that combines operational ability and the highest degree of strategic and political smarts.\nI could go on, but so much has happened that the mainstream media can’t keep up with it. Idiots that they are, they’re focusing not on policies but on tweets about crowd size. Can’t they see they’re being toyed with? I guess not. Years from now, it’ll sink in that Trump was smarter than them and has outfoxed them.\nI happen to be reading Stephen Ambrose’s Band of Brothers and watching the excellent HBO series based on the book, and the last week has reminded me of American paratroopers who parachute into enemy territory with foes all around them. And here’s what Ambrose’s Easy Company thought: “Excellent! We’ve got them surrounded.”","url":"https://spectator.org/that-was-the-week-that-was/"}
