{"authors":["A.B. Sanderson"],"date_download":"2018-10-30 18:32:52","date_modify":"2018-10-30 18:32:52","date_publish":"2014-12-28 08:00:10","description":"Margaret Thatcher feared an Asian uprising if Irish nationalists were granted changes in the way Northern Ireland and its institutions were run. In talks |","filename":"data/vaneerConsumption/ThatcherExpressedFearsofAsianUprisingatAngloIrishSummit.json","image_url":"https://media.breitbart.com/media/2014/12/Thatcher_FitzGerald.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_12_28__1540924372.html","title":"Thatcher Expressed Fears of 'Asian Uprising' at Anglo-Irish Summit","title_page":"Thatcher Expressed Fears of 'Asian Uprising' at Anglo-Irish Summit | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Margaret Thatcher feared an Asian uprising if Irish nationalists were granted changes in the way Northern Ireland and its institutions were run.\nIn talks with the then Irish Taoiseach Garret Fitzgerald in the run up to the 1984 Anglo-Irish agreement, Mrs Thatcher said she failed to understand why Catholics in the six counties were calling for reforms in policing, justice and government, the Independent reports.\nAccording to newly declassified government files, she said to Mr FitzGerald, “if these things were done, the next question would be what comes next? Were the Sikhs in Southall to be allowed to fly their own flag?”\nThe documents reveal the Iron Lady feared the consequences of dealing with the alienation felt by Catholics in Northern Ireland in relation to Great Britain’s other ethnic minorities.\nDuring the exchange, which took place at the Prime Minister’s official residence at Chequers, also reveal she thought that granting the Irish government in Dublin an official role in the running of Northern Ireland would lead to civil war in the already violent and divided nation.\nThe now declassified files, released by Dublin’s National Archives, demonstrate Mrs Thatchers’ “incomprehension” at the requests by Irish nationalists when Mr FitzGerald said the Catholic minority felt Irish, not British, and cut off from the country they felt part of “by an arbitrary act”.\nHe insisted to the British Prime Minister that there was “hard evidence” of bias in Ulster institutions such as the PSNI and that bullying of Catholics was a regular occurrence.\nAt one point Mrs Thatcher suggested redrawing the boundary between North and South, which had originally been decided in 1920 and made law by the Government of Ireland Act, but this was immediately rejected as a “fatal mistake”.\nBut the concept of a Belgium style system with a federal government under a monarchy like Wallonia and Flanders, was not rejected outright. The documents say she “had not ruled it out, even though it would be attacked by unionists as an effective repartition.”\nWhat was taken off the negotiating table immediately was a power sharing agreement where decisions were taken by both ministers from the British and Irish governments.\nMrs Thatcher responded to such a proposal saying it amounted to “joint authority” which was not a possibility. But she did admit that Catholics in certain areas such as Lisburn, which still proudly fly the Union Flag and paint kerb stones red, white and blue, “would not accept Catholics.”\nThe defiance was evident on both sides, with Mr FitzGerald saying that EIRE could not give up its territorial claim over Northern Ireland without such a deal.\nIn the end, the Anglo-Irish Agreement gave the Irish government an advisory role in the running of Northern Ireland but stipulated there would be no change in the constitutional position of Northern Ireland unless a majority wished to join the Republic.\nThe Treaty was signed on 15 November 1985 at Hillborough Castle after MPs voted in favour by 473 to 47 with unionists opposing the proposal alongside Labour MPs including Tony Benn and Ken Livingstone who wanted Westminster to abandon the Protestants in Ulster and have a united Ireland.","url":"https://www.breitbart.com/europe/2014/12/28/thatcher-expressed-fears-of-asian-uprising-at-anglo-irish-summit/"}
