{"authors":[],"date_download":"2018-10-23 05:51:53","date_modify":"2018-10-23 05:51:53","date_publish":"2014-12-09 00:00:00","description":"You don't know how long you'll live, which makes it hard to know how much money you'll need to retire. But several approaches can help people nearing retirement make their money last.","filename":"data/vaneerConsumption/ThatNestEggNeedsToLastAsLongAsYouDoSoHowDoYouStart.json","image_url":"https://media.npr.org/assets/img/2014/12/08/173291516_wide-b19b6112cd84e0ec6688dd1a5ffe1176355c06d5.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=369372003_1540273913.html","title":"That Nest Egg Needs To Last As Long As You Do. So How Do You Start?","title_page":"That Nest Egg Needs To Last As Long As You Do. So How Do You Start? : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nPeople nearing retirement face simple and brutal math.\nRENEE MONTAGNE, HOST:\nHere's one part of the equation - Americans are living longer, meaning more years in retirement for many.\nINSKEEP: And here's another part of the equation - Americans are also having trouble saving as much as many work-related pension plans disappear. On top of that, health care often costs more.\nMONTAGNE: And that leads to the brutal question - how to make less money last longer. Reporter Steve Tripoli asked experts for strategies to make retirement savings last.\nSTEVE TRIPOLI, BYLINE: A good strategy starts with how long you work and when you claim Social Security. Those two go together because most people ignore one of Social Security's best deals. You can greatly boost your payments by waiting longer to claim them. Alicia Munnell, who heads the Center for Retirement Research at Boston College, says waiting's often worth it, even if you work longer or spend some savings to get there.\nALICIA MUNNELL: And then get a nice, big, fat Social Security check at 70, which is wonderful money. It is inflation-adjusted, and it goes on for as long as you live.\nTRIPOLI: The benefits of waiting are eye-opening. If you're eligible for a $1,300 monthly check at age 62, you'd get about $440 more at 66. Wait until 70, and it's a thousand extra dollars each month. Living longer adds another twist. Robert Pozen, a senior lecturer at Harvard who once headed Fidelity investments, says most people can get a pretty good fix on the income they'll draw from Social Security and savings for 10 or 15 years.\nROBERT POZEN: But for most people if I said to you, well, you're going to live for 30 years more, it's very hard to project. Then I think it's that uncertainty that makes it very complicated to figure out what it is that you need for your retirement income.\nTRIPOLI: A recent federal tax ruling is changing the calculus for some. Basically the Treasury Department eliminated the penalty for using tax-sheltered retirement savings to buy what's known as a deferred annuity. You buy one near retirement, but it doesn't start paying until you're 75, 80, even 85. Munnell says that adds a late cushion to Social Security and even frees up earlier spending.\nMUNNELL: It means that if you live longer than 85, you're sure you're going to have some income. It also fixes the period over which you can spend your resources. You can enjoy your money during the 20 years before this deferred annuity kicks in.\nTRIPOLI: Munnell and Pozen both see that ruling triggering a new wave of these products, but caution's in order. These products come in many different forms, fees can be high and if you die early, you may never see a penny. The final big piece of the nest egg puzzle is your home. Alicia Munnell says it's OK for cash-strapped retirees to use it.\nMUNNELL: I am a big fan of tapping home equity, and you can do that in one of two ways.\nTRIPOLI: The first is to downsize and not just to a smaller house.\nMUNNELL: If you actually get to a cheaper house, you can take equity out and use that or the interest on that as a source of income. It also dramatically reduces your expenses.\nTRIPOLI: The second way is through a cash-producing reverse mortgage. A disclosure - Munnell sees such strong future demand for these mortgages that she's invested in a reverse mortgage company herself. Homeowners considering this option should be sure they can also keep up with tax and insurance payments on the home. Finally a caution for anyone feeling pressure to stretch their nest egg.\nJOHN HIXSON: One thing I would not do would be to take on undue risk.\nTRIPOLI: Independent financial planner John Hixson in Lake Charles, Louisiana, sees that temptation often.\nHIXSON: Some people get to retirement, they think they don't have enough money; they can't maintain their lifestyle. And their answer is, well, I just need to take more risk so I can earn a higher rate of return, and that's generally big mistake. I just - I don't recommend that to clients. And I just won't do it for a client that wants to do it because situations like that don't end well.\nTRIPOLI: Hixson believes most people with small nest eggs should first wait longer for that bigger Social Security check. He's not a fan of annuities. But those two options plus working longer and tapping your home's value can form the base of a strategy to not outlive your money. For NPR News, I'm Steve Tripoli.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=369372003"}
