{"authors":["Leanna Garfield"],"date_download":"2018-10-30 20:48:59","date_modify":"2018-10-30 20:48:59","date_publish":"2016-12-27 00:00:00","description":"The Passport Index tells you how many countries can you travel to without a visa. But the ranking may change for Americans under the Trump administration.","filename":"data/vaneerConsumption/The16countrieswiththemostpowerfulpassports.json","image_url":"https://amp.businessinsider.com/images/57e0156b077dcc7e128b69e5-640-320.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_countries-most-powerful-passports-travel-2016-12_1540932539.html","title":"The 16 countries with the most powerful passports","title_page":"    Countries with the most powerful passports for traveling - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The Passport Index If you have citizenship in Sweden, you have a great deal of traveling power — Swedes can fly to 158 countries without ever showing a visa. This makes international travel cheaper and easier than it is for citizens of many other countries, like those of Afghanistan, who can enter just 24 countries without a visa.\nThese stark differences are revealed in the Passport Index, which ranks countries based on the number of nations where residents can go without purchasing a visa in advance or on arrival. The global financial advisory firm Arton Capital compiled government data from 193 countries and six territories to create the 2016 ranking.\nThe US makes the top 16, but that could change over the next four years under the Trump administration, according to Arton Capital CEO John Hanafin. If US foreign-policy relations sour with other countries, like Mexico and Germany, visa-free agreements could freeze or break, which would damage the passport power for Americans.\nHere are the 16 highest-ranking countries.","url":"https://www.businessinsider.com/countries-most-powerful-passports-travel-2016-12"}
