{"authors":["Lianna Brinded"],"date_download":"2018-10-30 21:05:08","date_modify":"2018-10-30 21:05:08","date_publish":"2016-12-22 00:00:00","description":"London features in the list.","filename":"data/vaneerConsumption/The12mostunsafecitiesinEurope.json","image_url":"https://amp.businessinsider.com/images/585b7a2fdd089531208b4870-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_mercer-2016-quality-of-living-country-rankings-personal-safety-terrorism-crime-2016-12_1540933508.html","title":"The 12 most unsafe cities in Europe","title_page":"    Mercer 2016 Quality of Living country rankings: Personal Safety - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters The quality of life in any country significantly drops when personal safety is at risk.\nThis is whether it is living somewhere that is rife with crime, to being under threat of terrorist acts.\nAnd so Mercer, one of the world's largest HR consultancy firms, releases its Quality of Living Index each year, part of which ranks the safest cities to live and work in.\nIt looked at data for the whole of 2015 so any recent terrorist attacks in Europe have not been accounted for. These will be taken into consideration for next year's ranking.\nHowever, the list is one of the most comprehensive of its kind and is carried out annually to help multinational companies and other employers to compensate employees fairly when placing them on international assignments, according to Mercer.\nMercer says the personal-safety ranking is based on the cities' \"relationship with other countries, internal stability, crime, and law enforcement.\" In other words, it should come as no surprise that war-torn cities or those rife with crime rank the lowest.\nMercer looked at 450 cities and then made a list of 230 cities that are the safest for workers. While a host of European cities are listed as being among the safest in the world, others surprisingly rank very low in the index.\nThis may come as a surprise that some of Western Europe's biggest and most affluent cities are not leading the list for being the safest cities on earth but this is mainly due to a number of terrorist attacks and threats over the last year that have dragged them down the rankings.\nOther issues like petty crime or threats to national security have also made an impact on some of the cities.\nBusiness Insider went to the bottom of the list to find the 12 most unsafe cities in Europe:","url":"https://www.businessinsider.com/mercer-2016-quality-of-living-country-rankings-personal-safety-terrorism-crime-2016-12"}
