{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 21:49:16","date_modify":"2018-10-30 21:49:16","date_publish":"2016-12-17 00:00:00","description":"You might want to avoid these 10 airports.","filename":"data/vaneerConsumption/The10airportsinAmericapeopledislikedthemost.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_10-least-satisfying-airports-in-america-2016-12_1540936156.html","title":"The 10 airports in America people disliked the most","title_page":"    The 10 least satisfying airports in America according to J.D. Power - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A rendering of LaGuardia Airport after renovations. governorandrewcuomo/Flickr As Americans take to the skies in record numbers, our nation's airports are bursting at the seams. Released this week, the J.D. Power 2016 North American Airport Satisfaction Study found that America's airports are simply not designed to handle the sheer volume of people and planes they are forced to support. In spite of that, the study found that overall customer satisfaction is actually improving.\nAccording to the J.D. Power study, overall traveler satisfaction increased six points over the past year to 731 out of a possible 1,000 points.\n\"Many airports, especially the nation's largest airports, were never built to handle the current volume of traveler traffic, often exceeding their design limits by many millions of travelers,\" J.D. Power's airport practice director Michael Taylor said in a statement. \"Yet airports are overcoming infrastructure limits by affecting the things they can influence.\"\n\"Airports are successfully applying technology to improve check-in (+5 points year-over-year), security screening (+3 points) and the food, beverage and retail shopping (+10 points) experiences,\" Taylor added.\nThe J.D. Power study, now in its 11th year, measures overall traveler satisfaction with large and medium-sized airports in North America.\nThe study takes into consideration six factors — in order of importance — 1) terminal facilities, 2) airport accessibility, 3) security check, 4) baggage claim, 5) check-in/baggage check, and 6) food, beverage and retail.\nThe rankings are compiled from responses gathered from 38,931 travelers who have flow into or out of a North American airport over the past year.\nIn the study, travelers found Portland International and Tampa International to be the two most satisfying large airports in North America with scores of 786 and 775 respectively.\nLas Vegas McCarran International and Orlando International finished third and fourth in the study of large airports with 759 and 751 points respectively.\nWith more than 100 million people passing through every year, Hartsfield-Jackson Atlanta International is the busiest airport in the world. It managed to finish in the middle of the pack with a respectable score of 733.\n\"If you think about it, that's putting about one-third of the U.S. population through a few buildings in Georgia over the course of a year,\" Taylor said. \"Yet, everything runs fairly efficiently.\"\nHowever, some airports didn't fare so well. In fact, 10 of the 31 large airports featured in the study finished below the industry average of 724 points for large airports.\nAs expected, these are the some of America's most prominent and busiest airports.\nAt the bottom of the list is New York's LaGuardia Airport with a score of 649 points. But, things may be getting better for travelers making their way through LaGuardia.\nThe facility is undergoing a multi-billion dollar revamp that will see LaGuardia's small, aging terminals replaced with new state-of-the-art buildings.\n\"Those current terminals handle more than 13 million travelers a year. They were designed to handle only 8 million travelers,\" Taylor said. \"This improvement has been needed for a long time. The new design is going to create major short-term headaches for LaGuardia travelers, but the results will be worth it. The design solves two major problems for the airport: overcrowding and the ability to move aircraft more efficiently on and off runways.\"\nUnfortunately, the construction process of the new terminals has caused LaGuardia's already poor satisfaction score to fall even further. In 2016, LaGuardia's satisfaction score fell six-points over the previous year.\nClose behind LaGuardia, Newark Liberty International also scored poorly on all factors included in the survey including terminal facilities, available shopping, baggage claim, check-in/baggage claim process, security check, and airport accessibility.\nHere's a look at the 10 airports that fared the worst in the J.D. Power 2016 North American Airport Satisfaction Study.","url":"https://www.businessinsider.com/10-least-satisfying-airports-in-america-2016-12"}
