{"authors":["Peter Over"],"date_download":"2018-10-23 05:50:47","date_modify":"2018-10-23 05:50:47","date_publish":"2015-09-24 00:00:00","description":"The pope spoke for 51 minutes before Congress and read his speech verbatim from prepared remarks. That is, except for one line he omitted about politics not being \"a slave to the economy and finance.\"","filename":"data/vaneerConsumption/The1LinePopeFrancisLeftOutOfHisSpeech.json","image_url":"https://media.npr.org/assets/img/2015/09/24/ap_183225538302_wide-5b868b1848ad3c036482aada6cfad103bc24fc43.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_itsallpolitics_2015_09_24_443156872_the-1-line-pope-francis-left-out-of-his-speech_1540273847.html","title":"The 1 Line Pope Francis Left Out Of His Speech","title_page":"The 1 Line Pope Francis Left Out Of His Speech : It's All Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"The 1 Line Pope Francis Left Out Of His Speech\nEnlarge this image toggle caption Evan Vucci/AP Evan Vucci/AP\nA potentially controversial sentence in the prepared text of Pope Francis' address went unspoken when he delivered the speech to Congress.\nThe line appears to challenge the dominant role of money in American politics.\nA paragraph in the prepared text quotes briefly from the Declaration of Independence — the passage on self-evident truths — and then says, \"If politics must truly be at the service of the human person, it follows that it cannot be a slave to the economy and finance.\"\nThe paragraph defines politics in terms of the \"compelling need to live as one\" and building a common good that \"sacrifices particular interests in order to share, in justice and peace, its goods, its interests, its social life.\"\nThat passage would have come up 20 minutes into the speech, but Francis omitted it. It's unclear whether that was purposeful or he inadvertently skipped it. Francis, who has said English is difficult for him, spoke verbatim from his prepared remarks for the entirety of the rest of his speech.\nThe message would have fit other remarks he made — and has made previously — about economic and political inequality. Last March, the Crux reported on an interview in which Francis criticized political money in Argentina, his home country.\n\"In the financing of electoral campaigns, many interests get into the mix, and then they send you the bill,\" Francis was quoted as saying.\nHe added, \"Everything needs to be transparent and clean.\"\nHe also and spoke approvingly of public financing: \"Perhaps public financing would allow for me, the citizen, to know that I'm financing each candidate with a given amount of money.\"","url":"https://www.npr.org/sections/itsallpolitics/2015/09/24/443156872/the-1-line-pope-francis-left-out-of-his-speech"}
