{"authors":["Daniel Lefferts"],"date_download":"2018-10-30 22:46:27","date_modify":"2018-10-30 22:46:27","date_publish":"2014-08-14 18:59:13","description":"Now that summer’s winding down, many of us are scrambling to check off the remaining items on our bucket lists: Did you not bake a peach pie? Hurry up! Have you not gone camping like your promised? Failure! If, in addition to other classic…","filename":"data/vaneerConsumption/The10BestMiniGolfCoursesinAmericaBecauseWhoSaidItsNotaSport.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e473d300-98cc-410f-b503-3de781ac95a9.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35719-the-10-best-mini-golf-courses-in-america-because-who-said-its-not-a-sport_1540939587.html","title":"The 10 Best Mini Golf Courses in America, Because Who Said It's Not a Sport","title_page":"The 10 Best Mini Golf Courses in America, Because Who Said It's Not a Sport","title_rss":"NULL","source_domain":"bustle.com","text":"Now that summer’s winding down, many of us are scrambling to check off the remaining items on our bucket lists: Did you not bake a peach pie? Hurry up! Have you not gone camping like your promised? Failure! If, in addition to other classic summertime pursuits, you haven’t made the time yet to go mini golfing … well, then, frankly, I don’t know what’s wrong with you.\nMini golf has the distinction of being one of those non-sports that elicits World Series-grade feelings of rage and victory. How many family vacations have been ruined, if only momentarily, when the competitive sibling finished with the highest stroke count? How many awkward first dates have derailed when an awesome girl didn’t let the boy win?\nIf mini golf inspires big feelings, it’s because it usually provides big excitement. In lieu of the suicidal boredom that pro golf serves up, mini golf gives us camp in extreme: ball-swallowing walruses, shot-ruining waterfalls, unbeatably quick windmill blades, and Styrofoam castles that spit balls in all directions.\nOf course, some mini golf courses take the essential mini-golf-ness of mini golf — the surreal shrinking and cheapening of real life buildings and figures; the conversion of sand boxes and chlorinated fountains into trenches of hazard — to new levels. Here, we nod to the best mini golf courses in the country, from the gaudiest and most difficult to the scariest, and most 20-something-friendly.\nPar-King, Lincolnshire, Illinois\nBilled as the “World’s Most Unusual Golf Course,” Par-King began life as a side attraction for the families of golfers practicing their swing at the driving range next door, “but quickly took on a life of its own,” according to Mental Floss. Each of holes at the course (which according to its website was once called “Minigolf’s Taj Mahal”) features a different attraction; including a roller coaster, a space shuttle, a facsimile of Mount Rushmore, another of the Sears Tower, and, at the center of it all, a great big pink castle straight out of a Barbie fantasyland. Sign us up.\nEast Potomac Mini Golf, Washington D.C.\nThis mini golf course in Washington, D.C. is less for kids seeking animatronic animals at the end of each green than it is for fans of history. Built in 1931, the course is one of the oldest in the country, earning a historical designation by the National Parks Service.\nPirate Island, New Jersey\nThree years may have passed since the last Pirates of the Caribbean movie, but pirate-mania is an inextinguishable force. Fans of treasure maps and starboard duels can indulge their fantasies at Pirate Island Golf, whose entirely pirate-themed mini golf course has three locations in southern New Jersey. Palm trees, waterfalls, nautical paraphernalia, and a large replica of a sailing ship offer visitors a rich thematic experience, and critics as well as crowds have taken note: the course has been named the best mini golf course by the press of Atlantic City (one of Pirate Island’s locations, and a place with no shortage of mini golf courses) for nine of the last 10 years.\nMayday Golf, Myrtle Beach, South Carolina\nMini golf is as distinct a beachside attraction as the swimsuit shop. In Myrtle Beach, one of the most popular vacation destinations on the East Coast, you can’t hit a bright-colored ball far without it falling into a hole beneath a miniature windmill or giant fiberglass animal. The best course in Myrtle is Mayday Golf, which brings the concept of the “theme course” to a new level. Here, visitors enter a remote tropical island, where a “plane crash” leads to all sorts of Lost-like (or Gilligan’s Island-like, depending on your generation) pursuits.\nGlowing Greens, Oregon\nGlow-in-the-dark mini golf sounds like just the kind of weird, off-putting (har) thing that could end up being really fun. And it is fun —especially at Glowing Greens in Oregon. With locations in Portland and Beaverton, the courses raise the bar for black-lit family fun, featuring creepy wall murals, Martian rock formations, and psychedelic paraphernalia. The result is a truly unique, if slightly druggy, vision of miniature golf. It’s Oregon through and through.\nAround the World in 18 Holes, Lake George, New York\nAround the World in 18 Holes, located in one of the country’s most diverse states, takes players through a range of cultures and ethnicities, offering facsimiles of international landmarks at each hole. These include the Tower Bridge in London, the Pyramids at Giza, the Rocky Mountains, and even a Brooklyn subway car. While the course partakes of enough tack to make even the most kitsch-resistant player queasy, we laud the educational effort. Plus, the course is avowedly difficult (as circling the globe should be, of course).\nAhlgrim Acres, Palantine, Illinois\nVeering slightly afield of the family friendly territory that mini golf typically inhabits is Ahlgrim Acres in Palantine, Illinois, which has the distinction of being the scariest putt-putt course in the country. The nine-hole course is located in the basement of a funeral home, and, instead of hitting balls around fountains and miniature buildings, players have headstones, coffins, and spooky audio to contend with.\nKnolls and Holes, Connecticut\nMini golf is often dismissed as a time-killer activity undeserving of the kind of attention and dedication paid to real sports, so it’s refreshing to see a course like Knolls and Holes in Bozrah, Connecticut taking putt-putt seriously. The course, challenging enough on its own, hosts a United States ProMiniGolf Association tournament, and the Odetah Fall Classic for professional mini golfers.\nH Street Country Club, Washington, D.C.\nAdult mini golf? Yes! No one under 21 is allowed at this putt-putt course, and drinks are part of the menu at H Street Country Club in D.C. (literally: mini golf here comes with dinner). While the course doesn’t offer the kind of loony features that others on this list do, we have to give them props for forging the connection (it seems so natural now) between drinking and mini golf.\nLexington Ice Center, Kentucky\nI’ll be as inoffensive as possible here and say that the Lexington Ice Center in Kentucky offers mini-golf fun for everyone. But exactly what kind of fun you have — spiritual or sarcastic, moralistic or mocking — may depend on your religious persuasion. The Christian sports complex three courses: Old Testament, New Testament, and Miracles. The website explains it best: “So are your ready to try out Mount Sinai, or maybe Jonah and the Whale? If you think you are, you need to come play the best miniature golf course in Kentucky…. Each hole is represented by a biblical verse that explains where the idea for each hole came from.”\nImages: ryan pikkel; TrailVoice; @stuski76; @ecparrish; @sassymcfresh; omgponies2; @marisaover; @thedanidavis; @jdtower; Bill/Flickr","url":"https://www.bustle.com/articles/35719-the-10-best-mini-golf-courses-in-america-because-who-said-its-not-a-sport"}
