{"authors":["Hannah Orenstein"],"date_download":"2018-10-30 22:52:41","date_modify":"2018-10-30 22:52:41","date_publish":"2014-08-14 17:07:19","description":"A semester studying abroad is a beautiful thing. It's an incredible opportunity to explore another culture, learn a new language, travel, and meet new people. If you're going to study abroad this semester without any friends in tow, don't worry —…","filename":"data/vaneerConsumption/The11TypesofPeopleYouMeetStudyingAbroadYouObnoxiousAmericanYou.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/20453bf6-967b-45dd-8d3d-5334e3fc5cd4.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_33065-the-11-types-of-people-you-meet-studying-abroad-you-obnoxious-american-you_1540939961.html","title":"The 11 Types of People You Meet Studying Abroad, You Obnoxious American You","title_page":"The 11 Types of People You Meet Studying Abroad, You Obnoxious American You","title_rss":"NULL","source_domain":"bustle.com","text":"A semester studying abroad is a beautiful thing. It's an incredible opportunity to explore another culture, learn a new language, travel, and meet new people. If you're going to study abroad this semester without any friends in tow, don't worry — you'll make friends soon.\nAs you search for a group of friends during your first few days and weeks abroad, you're bound to run into a few different types of study abroad students. Your classic college stereotypes still ring true — yes, there are frat bros in Florence, band geeks in Berlin, and partiers in Paris — but for better or for worse, traveling brings out another side of people.\nWe bet you meet a handful of the following stereotypes, and even find yourself turning into one of them, too. Just please, whatever you do, stay as far away as you can from The Obnoxious American. (Just because you might find Starbucks and McDonald's overseas doesn't mean you have to visit them...)\nHere are the 11 types of fellow students you're bound to run into while studying abroad.\nThe Energizer Bunny\nTraveling every weekend, scoping out the latest museum exhibits, and sampling every native dish can be exhausting for some, but the Energizer Bunny keeps on going. This is the person who insists on taking 6 a.m. flights in order to maximize the amount of time you have on weekend trips, encourages you to pose for photos in front of every monument you see, and is never the first one in bed on a Friday night. This person loves study abroad.\nThe One Having The Time Of Her Life... Online\nThis girl participates in the “100 Happy Days” project by posting envy-inducing photos of her drinking sangria in Barcelona or digging into crêpes in Paris every day. Even if she mostly hangs out with her American besties and speaks English instead of meeting locals, she loves her new city. To procrastinate for finals, she took the \"Where Should You Have Actually Studied Abroad?\" quiz a couple of times until she got her study abroad city, then posted the results on Facebook with the hashtag #blessed.\nThe One Who Blends In\nThis person loves study abroad so much, they consider moving back after graduation. They met their significant other abroad, and tend to be a natural with languages. (Pillow talk tends to be the best way to learn another language, or so they've heard.) This person might be aware there's a Starbucks in their new city, but staunchly refuses to drink it — it's locally-made espresso or bust. Don't expect to see them much.\nThe Homesick One\nThis person hates study abroad and spends most of their time FaceTiming their significant other back home. They miss all things American: peanut butter, Game of Thrones, J. Crew, and using 4G without roaming charges. Unless this person's your roommate, you might not even know she even goes to your school. As soon as class is over, she'll run back to her apartment to watch Netflix under the covers.\nThe Future AA Member\nThis person doesn't speak a word of their country's language, but is instantly friends with three local bartenders. They've blacked out in at least four different European cities. Their favorite word is “epic,” and they wouldn't be caught dead without their trademark snapback.\nThe Obnoxious American\nFor The Obnoxious American, the study abroad site is just an extension of their college campus — only it's surrounded by “weird” new traditions and lots of smelly cheeses. This person frequently cites their new country's lower drinking age as one of the best perks of going abroad, and hangs out at Starbucks or McDonald's in between classes. They make zero effort to speak the local language. They could either love or hate their semester abroad, but one thing is sure either way: they're not getting much out of the experience.\nThe Travel Blogger\n“I can't wait to share all my adventures with you! Check back daily for new posts,” The Travel Blogger writes on day one. They might continue to update their blog for about a week, but soon, they'll post less and less. Every entry will begin with, “So sorry I haven't written in forever! I have so much to tell you.” There's a 70 percent chance this person read Eat, Pray, Love in high school and wants to be the next Elizabeth Gilbert.\nThe Serious One\nIt's easy to forget that your classes abroad still count towards your GPA, but The Serious One has never forgotten it. They take diligent notes during every class, would never skip Monday classes to extend their weekend travel plans, and always know when assignments are due. Don't think this person's no fun, though; when it comes time to travel, you can count on them to have thoroughly researched the best sightseeing spots and scoped out how to navigate the public transportation system.\nThe Local Lover\nThis local guy or girl isn't actually part of your study abroad program, but you'll find them tagging along with your friend on nights out. The Local Lover is usually born and raised in the city you're studying in, speaks English with an adorable (but thick) accent, and can direct you to all the coolest hole-in-the-wall restaurants and bars. Think of this person as your personal Frommer's guide. (Bonus: Ask if he or she has any cute friends for you.)\nThe Dedicated Stoner\nHang around a study abroad campus for the first few weeks of the semester and you'll hear whispers of, “Do you know any dealers?” This person does. Even Miley would be impressed with how quickly this person found a weed connect in a foreign country. Amsterdam is number one on this person's weekend travel wishlist.\nThe Selfie Addict\nSelfies in front of Big Ben. Selfies in front of the Brandenburg Gate. Selfies in front of the Mona Lisa. This person's Facebook album, Instagram, travel blog, and Snapchats are composed entirely of selfies in front of famous monuments. While we have nothing against a selfie or two, once this person starts planning her itineraries around selfie options, it begs the question ... has this person actually seen anything with their own eyes? Or just from their front-facing camera?\nImage: Moyan_Brenn, whatshouldmyroomiescallme, only-gossip-girl, stylio-pl, Loyola Phoenix/Tumblr, Giphy (2), Bustle, life-as-godsk, my-life-as-a-butterface, Her Campus","url":"https://www.bustle.com/articles/33065-the-11-types-of-people-you-meet-studying-abroad-you-obnoxious-american-you"}
