{"authors":["Will Martin"],"date_download":"2018-10-30 22:51:30","date_modify":"2018-10-30 22:51:30","date_publish":"2016-12-11 00:00:00","description":"The FT released its 2016 ranking of the best business schools in Europe, ranking the continent's most prestigious universities. Here are the UK's top schools.","filename":"data/vaneerConsumption/The13bestbusinessschoolsintheUKaccordingtotheFinancialTimes.json","image_url":"https://amp.businessinsider.com/images/5708aa54dd089502178b494c-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_best-business-schools-in-the-uk-financial-times-ranking-2016-12_1540939890.html","title":"The 13 best business schools in the UK, according to the Financial Times","title_page":"    Financial Times European Business School ranking: Best British universities - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"London Business School keeps the top spot in this year's list. Wikimedia Commons Getting a degree in business, management, or finance can springboard you into a lucrative career in banking, financial services, or the hedge fund industry.\nThis week, the Financial Times released its final 2016 ranking of the best business schools in Europe, ranking the most prestigious universities with the highest levels of academic rigour and best job prospects.\nThe FT took loads of data from business schools, including average salaries, the increase in salary its graduates see three years after finishing their degree, and the percentage of grads in work three months after finishing school. It then collated that data to create a great list of all the best schools in Europe for aspiring bankers, hedge funders, and business people.\nWe've already taken a look at the best schools across the whole of the continent, but given that more are located in the UK than in any other country, Business Insider decided to pull out all the UK schools that feature in Europe's top 50. The numbers in brackets are overall rankings.","url":"https://www.businessinsider.com/best-business-schools-in-the-uk-financial-times-ranking-2016-12"}
