{"authors":["Lianna Brinded"],"date_download":"2018-10-30 22:51:34","date_modify":"2018-10-30 22:51:34","date_publish":"2016-12-11 00:00:00","description":"The Sunday Times Rich List shows that the 1,000 wealthiest individuals and families now have a combined fortune of just over £547 billion.","filename":"data/vaneerConsumption/The23richestpeopleinBritain.json","image_url":"https://amp.businessinsider.com/images/584126f9dd089539448b4772-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_sunday-times-rich-list-richest-people-uk-2016-12_1540939894.html","title":"The 23 richest people in Britain","title_page":"    Sunday Times Rich List 2016: Richest people in Britain - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"John Grayken. Getty The richest people in Britain suffered from the worst fall in fortune since the credit crunch in 2007, according to The Sunday Times Rich List 2016.\nAnd next year's numbers are likely to cause more pain for the super-rich considering the country voted for Brexit and oil prices still remain low.\nThe newspaper, which lists the 1,000 wealthiest individuals and families in the UK, said that the commodities-market crash has had such a pronounced effect on some of Britain's most wealthy people that they've seen their fortunes crater by over 50% over the last few years.\nRegular rich list member and steel magnate Lakshmi Mittal has seen his wealth crash by around 75% since 2008 — he used to be worth £27.7 billion but now he's worth £7.12 billion. Len Blavatnik, the London-based, Ukrainian-born US citizen who is the owner of Warner Music Group, dropped from the No. 1 spot this year. And the Queen has failed to make the top 300 for the second consecutive year.\nOnly those who have significant property investments have seen their fortunes grow due to the housing boom.\nTake a look at who made the top 23 spots this year below:\n(All the ages of the people who made the list correspond to the time their fortunes were calculated, which was as of April 24, this year. Since the data was released, the Duke of Westminster died and so the slide has been updated to reflect his heir's claim to his wealth):","url":"https://www.businessinsider.com/sunday-times-rich-list-richest-people-uk-2016-12"}
ople-uk-britain-2016-12"}
