{"authors":["Tori Telfer"],"date_download":"2018-10-30 23:47:23","date_modify":"2018-10-30 23:47:23","date_publish":"2014-08-13 11:30:04","description":"If you're reading the Books section of any given website, you've probably written a novel, thought about writing a novel, or sat through one too many brunches with friends who are working on their novels. (Unless you're just a voracious reader who…","filename":"data/vaneerConsumption/The21StagesofWritingaNovelFromCrazedInspirationtoPrematurelyQuittingYourJob.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/6/29/11e46bc0-6513-4ba9-b6d6-a4e6b14d239d-getty-939576462.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35277-the-21-stages-of-writing-a-novel-from-crazed-inspiration-to-prematurely-quitting-your-job_1540943243.html","title":"The 21 Stages of Writing a Novel, From Crazed Inspiration to Prematurely Quitting Your Job","title_page":"The 21 Stages of Writing a Novel, From Crazed Inspiration to Prematurely Quitting Your Job","title_rss":"NULL","source_domain":"bustle.com","text":"If you're reading the Books section of any given website, you've probably written a novel, thought about writing a novel, or sat through one too many brunches with friends who are working on their novels. (Unless you're just a voracious reader who doesn't bother with the whole pretentious writing thing. In that case, I love you.)\nNovel-writing may sound terribly elite, but it's actually a pretty popular — and populist — hobby. Take National Novel Writing Month, for example, where thousands of (often unpublished) writers crank out a novel in 30 days flat, or the hilarious new book Working on My Novel, which collects Tweets containing the phrase \"working on my novel\" (the irony is, of course, that those people often aren't).\nIt's easy to start a novel, and easier still to claim you're working on a novel. But whether you're just doing it for the whiskey and Brooklyn-cred, or busily revising a future New York Times bestseller, this is what it feels like almost every time.\n1. You're walking down the street, loving the way the sunlight plays against the leaves, when it hits you: An Idea For a Novel\n2. You sprint to the nearest coffee shop and sit down to tell your Internet friends. #amwriting, you know?\n3. You spend a leisurely weekend planning the title. Infinite Moonlight? American Chaos? What We Talk About When We Talk About Speaking? After all, everybody knows the title is the hardest part\n4. You waste an hour writing an inspirational quote onto a Post-It and sticking it above your desk\n5. You begin to write. Wow, this first paragraph is beautiful. It's just beautiful. You could describe the apple trees in springtime forever, all \"clothed in white, like a bride on Sunday morning.\" Pretty good, huh? Pretty, pretty good\n5. Wait. How long is a novel, again?\n6. Maybe this should be a short story\n7. You get distracted for a few hours by drafting an author's note. It'll go in the front of the hardcover version, of course\n8. Weeks pass. Your word count stays the same\n9. You regret telling your friends you were \"this close\" to quitting your day job\n10. Inspiration returns in the form of imagining which celebrities will play your characters in the movie version\n11. Uh, who came up with that whole \"kill your darlings\" idea? You're NEVER taking out this metaphor. Ever.\n12. Does 50 pages count as an \"early draft\"?\n13. For one misguided hour, you turn the whole thing into a poem\n14. 10K words. Better draft a query letter. \"Dear agent, why should you pick me? Well, I'm ridiculously good-looking. But enough about my prose!\"\n15. Your computer crashes\n16. You backed up your files\n17. Time to ask for feedback. Maybe you should ask your best friend — better yet, ask your mom\n18. WHAT DOES SHE MEAN YOU SHOULD CUT THE EXTENDED METAPHOR ABOUT THE MOON?\n19. You hire a proofreader who turns out to be a total sham\n20. But somehow, you manage something that kinda looks like a final draft, and an agent is interested in \"taking a peek\" at it. You did it. You're a writer. You're a Pushcart-nominated, Pulitzer-winning writ — sorry, that's the celebratory whiskey talking\n21. Feeling great, you prematurely quit your day job #lifedecisionsftw\nImages: Tumblr (15), Giphy (2) Gifsoup (2), Imgur (2)","url":"https://www.bustle.com/articles/35277-the-21-stages-of-writing-a-novel-from-crazed-inspiration-to-prematurely-quitting-your-job"}
