{"authors":["James Zumwalt"],"date_download":"2018-10-30 19:44:30","date_modify":"2018-10-30 19:44:30","date_publish":"2015-04-15 16:55:06","description":"If anyone understands the Iranian mullahs’ mindset better than most, it is Alireza Jafarzadeh. If anyone misunderstands that mindset better than most, it is President Obama. |","filename":"data/vaneerConsumption/The3DViewofIranViableMilitaryOptionaMustinNuclearDeal.json","image_url":"https://media.breitbart.com/media/2015/04/Iran-President-Hassan-Rouhani-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_15__1540928670.html","title":"The 3D View of Iran: Viable Military Option a Must in Nuclear Deal","title_page":"The 3D View of Iran: Viable Military Option a Must in Nuclear Deal | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"If anyone understands the Iranian mullahs’ mindset better than most, it is Alireza Jafarzadeh.\nIf anyone misunderstands that mindset better than most, it is President Obama.\nJafarzadeh is an Iranian dissident who first revealed the existence of Tehran’s secret nuclear facilities in 2002. For three-plus decades, he has studied an Iranian mindset that thrives on the “3Ds”—denial, deception and duplicity—not only on its nuclear program but just about everything else concerning its intentions on establishing a new world order subject to Shia Islam.\nIn a recent article, Jafarzadeh noted the two foundations of the nuclear framework agreement Obama had been promoting—gradual sanctions relief and intrusive inspections—had been debunked by Iranian Supreme Leader Ali Khamenei. The Iranian position is sanctions must be lifted immediately when an agreement is executed and that inspections of military sites are prohibited.\nKhamenei’s statement greatly contrasted with Obama’s Rose Garden declaration the deal represented “the most robust and intrusive inspections and transparency regime ever negotiated for any nuclear program in history,” claiming “Iran will be required to grant access to the IAEA to investigate suspicious sites or allegations…anywhere in the country.”\nViewing Iranian actions through 3D glasses, Jafarzadeh draws two conclusions: (1) sanctions—which remain as the West’s only leverage against Iran—are hurting Tehran and (2) the mullahs have no intention to ever abandon their nuclear weapons program.\nPutting on Jafarzadeh’s 3D glasses to view Obama’s actions, two other conclusions can be drawn: (1) Obama, who already has embraced one enemy (Muslim Brotherhood) after it declared war against us– and remains at war with us according to its no-longer-secret war plan— seeks an agreement, at any price, with another enemy at war with us for 36 years that is willing to fight in perpetuity to win—and (2) Obama is willing to apply the 3Ds against the American public to achieve a meaningless—as far as preventing Iran from getting the bomb goes—nuclear deal.\nSince coming to power in 1979, the mullahs have only toned down their aggressive behavior on two occasions.\nThe first occurred as soon as Ronald Reagan was sworn into office on January 20, 1981. The Iranians perceived Reagan as a man of action, fully capable of launching a strike against Iran for failing to release 52 U.S. Embassy personnel held hostage for 444 days.\nIt was the perception of a weak President Jimmy Carter that emboldened the mullahs to take the hostages. That perception changed overnight as U.S. presidential leadership did—prompting their release.\nThe second occasion occurred in 2003 as U.S. forces invaded Iraq to topple Saddam Hussein. The mullahs’ perceived the threat U.S. forces, already in the ‘hood, might turn their focus towards Iran.\nThis makes it clear only the use, or perceived threat of using, U.S. military force will intimidate Iran into behaving.\nThe mullahs’ perceive Obama to be another spineless Jimmy Carter. It is a perception Obama has brought upon himself.\nIn 2008, still a presidential candidate, Obama reportedly had the audacity to dispatch Ambassador William Miller as an emissary to Iran to advise the mullahs once elected he would negotiate with their interests in mind. Thus, after Obama’s election, his occasional reference to “all” options being on the table concerning Iran ran hollow.\nThe mullahs have never felt threatened Obama would order a military strike against them. This has given them great confidence at the negotiating table to demand what they wanted while denying the West the assurances it needed.\nObama’s Neville Chamberlainesque approach to Iran has earned him nothing but the mullahs’ disdain. They recognize he wants a deal so bad he is willing to deceive his own people.\nObama needs to ratchet things up. He needs to inform Iran all previous offers are withdrawn, demanding agreement terms that give the West the assurances it needs and issuing a date certain by which a deal needs to be consummated.\nSimultaneously, Obama needs to make serious noise about a possible U.S.-led coalition strike should Tehran continue to delay. He could start by making our new and improved “Massive Ordnance Penetrator” (deep bunker-busting) bomb available to our allies, ratcheting the noise up from there.\nObama does not have much time to act. Tehran recognizes the clock is ticking on a number of fronts, putting it at greater risk from an attack coming sooner rather than later.\nMoscow announced this month it would sell Iran its highly regarded S-300 surface-to-air missile defense system. Once installed, an air attack against Iran becomes a lot more dangerous. Tehran will undoubtedly seek additional negotiation delays to allow for its installation.\nAdditionally, the mullahs realize their assets are now spread out over several theaters of operation—Iraq, Syria, Yemen, Lebanon. This leaves fewer assets available to handle domestic unrest. Such unrest is of concern as economic sanctions against Iran continue to take their toll on a restless population.\nTehran’s 36-year long pattern of denial, deception and duplicity, revealing the mullahs’ ultimate evil intentions, immediately pops out when viewed through 3D glasses. Obama needs to throw away his rose-colored ones and get a pair.\nLt. Colonel James G. Zumwalt, USMC (Ret.), is a retired Marine infantry officer who served in the Vietnam war, the U.S. invasion of Panama and the first Gulf war. He is the author of “Bare Feet, Iron Will–Stories from the Other Side of Vietnam’s Battlefields,” “Living the Juche Lie: North Korea’s Kim Dynasty” and “Doomsday: Iran–The Clock is Ticking.” He frequently writes on foreign policy and defense issues.","url":"https://www.breitbart.com/national-security/2015/04/15/the-3d-view-of-iran-viable-military-option-a-must-in-nuclear-deal/"}
