{"authors":["Kara Mcgrath"],"date_download":"2018-10-30 22:33:47","date_modify":"2018-10-30 22:33:47","date_publish":"2014-08-15 11:00:04","description":"My childhood was a little screwed up. The closest mall was over an hour away. I never got the experience of being one of those mall rat kids who just hung out at the mall terrorizing the pretzel stand employees and stealing studded bracelets from…","filename":"data/vaneerConsumption/The34ThoughtsYouHadWhileShoppingAtClairesTheGummyEarringMallParadiseOfYourPreTeenYears.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/7bb964ae-42f8-4e8a-89bc-911d1a522fa1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_29629-the-34-thoughts-you-had-while-shopping-at-claires-the-gummy-earring-mall-paradise-of-your_1540938827.html","title":"The 34 Thoughts You Had While Shopping At Claire's, The Gummy Earring Mall Paradise Of Your Pre-Teen Years","title_page":"The 34 Thoughts You Had While Shopping At Claire's, The Gummy Earring Mall Paradise Of Your Pre-Teen Years","title_rss":"NULL","source_domain":"bustle.com","text":"My childhood was a little screwed up. The closest mall was over an hour away. I never got the experience of being one of those mall rat kids who just hung out at the mall terrorizing the pretzel stand employees and stealing studded bracelets from Hot Topic. Actually, I don't even know if that's a real thing! Maybe it just happened in the movies! Like boys who hold radios over their heads to declare their love for you, and having good eyebrows.\nBut the two times a year my family made the schlep to the mall, nothing got my adolescent heart beating faster than stepping into the white and purple accessory haven that was Claire's. I would set aside a dollar a week from my allowance into a little box so I could blow it all on friendship bracelets and hoop earrings right before I went back to school in September. The $2 charms weren't as high-end as the Tiffany Heart Tags all the popular girls were wearing, but dang, all those silver accessories still made me feel pretty cool.\nSo, in honor of '90s nostalgia and keychains with \"witty\" sayings, let's reflect on all the feels that went into a Claire's shopping trip. Bless your glittery purple heart.\n1. YES. Buy One, Get One On Earrings.\n2. Should I buy the gummy earrings?\n3. LOL JK that's not a real question. Of course I should.\n4. Hmm, free piercing\n5. Oh my gosh I would look so cute with a lil cartilage stud\n6. But Mom would cry and Dad would ground me, so . . .\n7. More gummy earrings it is\n8. Wait, but if I'm going to be cool this year I need hoops\n9. These are as big as my hand\n10. They're perfect\n11. Are these front-and-back frog earrings too childish for seventh grade?\n12. Whatever, I'll wear them on the weekends\n13. Ugh, it's so unfair I'm not allowed to pierce my bellybutton\n14. I mean, this dangly diamond cherry gem is honestly adorable\n15. Parents are so lame\n16. Whatever, more hoops!\n17. Crap, it's Sally's birthday party this weekend\n18. I'll get her this adorable BFF necklace set!\n19. But she never really wears the one I got her last year . . .\n20. I wonder if it's because she has boobs now?\n21. Maybe I should put these frog earrings back\n22. I know sandal season is basically over, but I should get more toe rings, right?\n23. Guys dig toe rings, I think\n24. And paired with this butterfly/peace sign ankle charm bracelet? Nick won't be able to ignore me anymore\n26. Plus if I get enough of these keychains, he might think I already have a car\n27. Even though we're 13. Am I being crazy?\n28. More hoops!\n29. These spider comb headbands hurt so much\n30. But this set is all glitter, so I'm getting them\n31. Wow these studded bracelets are kind of edgy . . . but would look great at Warped Tour\n32. OK, Mom's probably done at Coldwater Creek, so I'd better pay\n33. LATER, ALLOWANCE! Worth It, For All This Awesome Stuff That Definitely Won't Break In A Month\n34. Time for Auntie Anne's\nImages: astoldbylaura.wordpress.com, Giphy (18); Blingee; claires.com; trips-and-tits.tumblr.com; Liz Mc/Flickr","url":"https://www.bustle.com/articles/29629-the-34-thoughts-you-had-while-shopping-at-claires-the-gummy-earring-mall-paradise-of-your"}
