{"authors":["Matthew Debord","Benjamin Zhang"],"date_download":"2018-10-30 22:28:26","date_modify":"2018-10-30 22:28:26","date_publish":"2016-12-13 00:00:00","description":"Business Insider has selected the Honda/Acura NSX as its 2016 Car of the Year.","filename":"data/vaneerConsumption/TheAcuraNSXisBusinessInsiders2016CaroftheYear.json","image_url":"https://amp.businessinsider.com/images/58500bd1ca7f0c1b008b546d-1136-568.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_honda-acura-nsx-business-insider-car-of-the-year-2016-12_1540938506.html","title":"The Acura NSX is Business Insider's 2016 Car of the Year","title_page":"    Honda's Acura NSX is Business Insider's 2016 Car of the Year - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Hollis Johnson/Skye Gould\nThe wait is over! Business Insider's 2016 Car of the Year is the Acura NSX.\nThe new NSX beat out the fiercest competition in the three-year history of our award. It is a worthy, exciting winner and a triumph for Honda, Acura's parent company. But the NSX also revived one of the greatest stories in the history of the automobile. And by the way, this mid-engine supercar from a Japanese brand is actually an all-American machine, designed in California and proudly built in Ohio.\nHere's the backstory. In the 1990s, Honda was on top of the world. Its Accord and Civic sedans were selling like hotcakes, while the brand as a whole had established a reputation for building technologically advanced cars with rock-solid reliability. On the performance front, Honda-powered Formula One race cars had reeled off six straight World Constructors' Championships.\nIt was time for a halo product — a crown jewel in Honda's lineup.\nIn 1990, that's exactly what happened with introduction of the New Sportscar eXperimental, or NSX. The first-generation Honda NSX, sold under the Acura luxury brand name in the US, was a true game changer. It proved that Honda could build a state-of-the-art supercar capable of taking on the best Europe had to offer, but with Japanese reliability. Many industry observers point to the original NSX as one of the driving forces behind the quality and performance of modern-day Ferraris, Porsches, and Lamborghinis. In fact, the NSX even served as the benchmark for McLaren's groundbreaking 240 mph F1 hypercar.\nEnd of the road?\nIn 2005, Honda ended the original NSX's 15-year tour of duty, and the wait for a successor commenced.\nFirst, Honda planned to replace the NSX with a front-engined V-10 supercar, but the financial crisis put an end to that. Then the successor was reincarnated as a mid-engine V-6 show car. However, when the decision was made to add turbochargers and a hybrid system for more power, the car was once again redesigned because the orientation of the engine had to change for cooling purposes.\nAfter a decade of waiting, a new NSX finally arrived, and we got our hands on one of Honda/Acura's preproduction prototypes.\nThe process\nAt Business Insider, we don't have extensively scientific criteria for selecting what we feel were the best cars of 2016 — we currently lack the testing facilities for anything like that. But we do consider each finalist in terms of three important questions: Was the vehicle compelling to drive? Did it stand apart from the competition? And did it involve a strong business case for the automaker that created it?\nAt first we were skeptical. After all, movies requiring this many reshoots rarely take home Oscars. In addition, we were concerned that the new car had abandoned the original NSX's lightweight simplicity in favor of a complex hybrid drive system.\nFurthermore, the automotive landscape has changed considerably since 2015. In 1990, 300 horsepower and the ability to hit 60 mph from a standstill in five seconds meant you had enough chips to play with the big boys. But these days, we live in an era of 700-horsepower family-hauling muscle sedans and 6,000-pound SUVs capable of ripping off 0-6o runs in four seconds.\nOver the years, Honda and Acura have changed as well. The company, still an industry leader, has had a few more misses than hits as of late. The company's bread-and-butter Accord and Civic sedans are no longer sure bets, while its once niche CR-V crossover has become the company's new breadwinner.\nAcura has endured its share of troubles. The brand has struggled to keep up with rivals from Japan and Germany in terms of sales, performance, and prestige.\nAt the end of the day, none of those concerns materialized — the NSX proved to be stunningly good to look at, joyful to drive, and easy to live with. We also sampled the NSX in three distinct settings: on the road, on the race track with transportation reporter and longtime NSX enthusiast Benjamin Zhang behind the wheel, and on another track with a pro driver at the controls while Senior Correspondent Matt DeBord hung on for dear life in the passenger seat.\nSimply glorious\nSet eyes on the NSX's sheet metal once, and you can't help but look again. The design isn't classically beautiful like a vintage Pininfarina-designed Ferrari, but its striking aesthetic is attractive in its own right. In a year when we've had Ferraris, Porsches, Rolls-Royces, and Teslas roll through our suburban New Jersey auto test center, no car generated as much attention from the general public as the NSX.\nBehind the wheel, Acura's decision to go with hybrid tech was a stroke of genius. Generating 573 horsepower, the twin-turbocharged V-6 offered on-demand power with little complaint. With traction going to all four wheels, the NSX proved to highly forgiving, offering endless grip around corners.\nIn addition, the NSX's advanced hybrid drive unit represents the first time we've seen such a system in a supercar with a price tag south of $1 million.\nOnce again, Honda and Acura will have a halo product — a stunning, eye-catching supercar to get buyers in the showroom and to stroke the egos of the brand's owners. It's a car that will set the pace and the tone for Honda and Acura in the coming years.\nA great car — from a great year\nIt's been a great year for the auto industry. Audi's new MLB Evo platform hit its stride with the world-class A4 sedan and Q7 SUV, while Ferrari's turbocharging revolution arrived with the new 488 GTB. Meanwhile, Cadillac was revitalized with a new high-tech flagship sedan and a crossover in the CT6 and XT5. Jaguar and Maserati rolled out the first SUVs in their companies' histories, while McLaren's new Sports Series is expected to double the company's sales total in a few short years.\nBut when all was said and done, Honda/Acura's NSX supercar stood victorious. We are proud to announce the 2017 Honda/Acura NSX as Business Insider's 2016 Car of the Year. Congratulations!\nBelow, we present Matt's original review of the NSX. What a car!\nPhotos by Hollis Johnson.Graphic by Skye Gould.","url":"https://www.businessinsider.com/honda-acura-nsx-business-insider-car-of-the-year-2016-12"}
