{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:52:21","date_modify":"2018-10-30 19:52:21","date_publish":"2016-11-08 03:01:21","description":"MANCHESTER, New Hampshire — Donald Trump returned Monday night to a state that he hopes to carry on Election Day to win the presidency.","filename":"data/vaneerConsumption/TheAmericanWorkingClassStrikesBack.json","image_url":"https://media.breitbart.com/media/2016/11/Donald-Trump-New-Hampshire-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_07__1540929141.html","title":"'The American Working Class Strikes Back'","title_page":"Trump to New Hampshire: 'The American Working Class Strikes Back'","title_rss":"NULL","source_domain":"breitbart.com","text":"MANCHESTER, New Hampshire — Donald Trump returned Monday night to the site of his early triumph in the Republican presidential primary, and to a state that he hopes to carry on Election Day to win the presidency.\nAnd he did it in grand style, arriving onstage at the Southern New Hampshire University Arena in front of a packed house of nearly 12,000 frenzied supporters, with his entire family onstage, and many more supporters outside.\nHe joined his running mate, Indiana Gov. Mike Pence, who spoke earlier,.\n“Tomorrow, the American working class will strike back,” Trump announced to raucous cheers.\nHe also sent the arena into loud cheers by announcing the support of New England Patriots star quarterback Tom Brady, and head coach Bill Belichick.\nHe read a letter from Belichick, praising Trump for fighting a tough campaign against relentless pressure from the media, and closing with the hope that Trump would win and “make America great again.”\nIn addition, Trump informed the audience about the latest poll numbers, including polls showing Trump leading in Michigan, where the Trump campaign would make its last stop of 2016 later Monday evening.\nTrump began his remarks by talking about drugs in New Hampshire, reiterating his promise to get rid of them.\n“You were the first ones who told me how bad the drug problem really is,” he said, praising New Hampshire and going on to explain the impact that had on him later in the campaign, where he has mentioned the issue frequently in other states.\nTrump also touched on his major campaign messages of the last several weeks.\n“Real change begins by resorting honesty in government. Let’s start by getting rid of Clinton. That’s the best,” he said, prompting chants of “Lock her up!”\n“Her campaign, as revealed by Wikileaks, has spoken horribly about Catholics and evangelicals,” he reminded them.\nHe cited yet another debate question that Hillary Clinton had received, and drove the point home by implying she was unfit to be commander-in-chief because of her cheating.\n“You know, if you go to West Point, or Annapolis, or the Air Force Academy, and you get the questions, and you don’t report yourself, they throw you out.”\nTrump also spoke about repealing Obamacare, ending the Syrian refugee program, ad rebuilding the military, mentioning the naval shipyard at Portsmouth.\nAnd he welcomed supporters who drove up from Massachusetts: “Massachusetts is represented by Pocahontas,” he said, referring to Sen. Elizabeth Warren (D-MA), who allegedly faked Native American heritage to advance her legal academic career.\n“You can have Pocahontas. I’ll take Tom Brady and Bill Belichick,” he said, to cheers.\nTrump took command of the Republican primary with a win in New Hampshire in February. On Oct. 28, Trump had been in New Hampshire when the FBI announced that it was re-opening its investigation into Hillary Cliinton’s email server. The news sent a jolt of electricity through the campaign, and sent the packed crowd in the Armory Ballroom into pandemonium.\nTrump visited New Hampshire again last week, as polls showed him surging in the state. No Republican presidential candidate has won New Hampshire, and its four Electoral College votes, in several cycles. However, Democrats are spending time in the state, with Hillary Clinton’s campaign scheduling several events there in the final week.\nIvanka Trump also spoke briefly before her father, marveling at the campaign he had built and telling the audience that the real work would begin tomorrow, on Election Day — and afterwards.\nDavid Gotthardt and his son, Ryan, of Manchester, told Breitbart News that they were impressed with the rally and believed Trump could win New Hampshire.\nCharlie Watson drove up from Massachusetts for the rally. He said he has been holding up signs at intersections for Trump in his home state, even though Clinton is certain to win that state.\n“He’s a man of his word. He knows what he’s doing,” Watson said.\nAfter the rally, Trump sped to the airport — with throngs of supporters cheering the motorcade in the streets of Manchester — to head to Michigan to join Pence for the final rally of the campaign, in Grand Rapids.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. His new book, See No Evil: 19 Hard Truths the Left Can’t Handle, is available from Regnery through Amazon. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/politics/2016/11/07/trump-new-hampshire-tomorrow-american-working-class-strikes-back/"}
