{"authors":[],"date_download":"2018-10-22 21:01:10","date_modify":"2018-10-22 21:01:10","date_publish":"2016-01-21 00:00:00","description":"Born in South Korea, raised in Oklahoma, Danny Bowien was an adult when he taught himself to make Chinese food. That DIY vibe to his cooking has made him a rising star. Now he's written a cookbook.","filename":"data/vaneerConsumption/TheAudaciousKoreanAmericanChefWhoMasteredMissionChineseFood.json","image_url":"https://media.npr.org/assets/img/2016/01/21/mcf---chongqing-chicken-wings_wide-8d9d209a1e6684726e557c85ce81a9036cbd3416.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thesalt_2016_01_21_462150071_the-audacious-korean-american-chef-who-mastered-mission-chinese-food_1540242070.html","title":"The Audacious Korean-American Chef Who Mastered 'Mission Chinese Food'","title_page":"The Audacious Korean-American Chef Who Mastered 'Mission Chinese Food' : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"The Audacious Korean-American Chef Who Mastered 'Mission Chinese Food'\nEnlarge this image toggle caption Anthony Bourdain/Ecco Anthony Bourdain/Ecco\nDanny Bowien, the founder of the Mission Chinese Food restaurants, didn't grow up cooking Chinese cuisine. Born in South Korea, then adopted by a family in Oklahoma, Bowien was already an adult living in San Francisco when he decided to learn how to cook Sichuanese fare, known for its bold, pungent, spicy flavors.\nBurned out from working in fine dining establishments, Bowien considered applying to work in a Sichuanese restaurant as a line cook. But since he couldn't speak Chinese, he realized he would have a hard time. Plus, many of the restaurant owners he approached viewed him with suspicion. \"They thought I was crazy,\" Bowien tells Fresh Air's Sam Briger. \"They thought I was trying to steal recipes.\"\nUltimately, Bowien wound up teaching himself how to cook Chinese food. Later, he opened the first Mission Chinese Food — a pop-up restaurant with a punk-rock, DIY attitude. Located inside an existing Chinese restaurant in San Francisco's Mission District, it was a hole-in-the-wall takeout joint that drew long lines and rave reviews: Both Bon Appetit and GQ magazines named it one of the best new restaurants of 2001.\nLooking back at his efforts to master his own brand of Chinese cooking, Bowien says, \"It [was] audacious, but at the same time, the whole feeling behind what we were doing just felt very organic, and for me there was no risk.\"\nBowien took that audacious attitude with him when he opened the first Mission Chinese in New York City in a tiny space in the Lower East Side. It, too, earned accolades — one reviewer said Bowien did to Chinese food what Led Zeppelin had done to the blues.\nBut it broke too many rules: In 2013, the New York restaurant was shut down for various violations. Bowien describes it as a devastating blow. But he recovered. Indeed, later that same year, the James Beard Foundation bestowed Bowien with its prestigious Rising Star Chef award. And last year, Bowien reopened Mission Chinese Food in a new New York location.\nBowien is now the co-author, with Chris Ying, of The Mission Chinese Food Cookbook. Highlights from his Fresh Air interview are below.\nInterview Highlights\nOn the allure of Sichuanese cuisine, and what drove him to learn to cook it\nSichuanese cuisine was something crazy for me, out of left field, because some of the traits and characteristics of that are like flavor profiles, such as numbing. Like, you eat Sichuan peppercorns and Sichuan peppercorn oil, which causes your mouth to literally — your tongue goes numb, it almost tastes like you've licked a battery. Which doesn't sound pleasant, but it really is. It's really interesting how that combines with the dry heat in Sichuan cooking. ... As a cook who thought I knew everything at the time, I never experienced that flavor profile.\nA lot of super-fermented flavor profiles ... are really popular now in fine dining. But at the time, eating a piece of tofu that had been fermented for a couple of months was really crazy for me. I hadn't seen that. So I think very pungent, very spicy, very numbing, really loud flavors are what Sichuanese cooking [was] to me. When I first discovered it, I thought that was what the backbone of it was. And the more I dove into Sichuanese cooking, it's really about balance and restraint and not having things be over-the-top spicy, which I learned after my first trip to Chengdu, to the Sichuan province.\nOn how the original Mission Chinese Food started in San Francisco\ntoggle caption Anthony Bourdain/Ecco\nIt was just a pop-up inside of Lung Shan, and then it slowly took over, over time. You could order off two menus — I loved that about it — but the problem was that we'd be running our menu alongside their menu, and their chef was responsible for cooking 154 dishes off their takeout menu, just one guy on this little station. If they got really busy for delivery, which they would, and someone ordered something from their menu, I didn't know how to make their food. ...\nThen eventually, I think they saw Mission Chinese Food, which was becoming very popular, and we were running out of storage space for two full-sized menus. So they actually were the ones that said, \"Look, we're just going to change it and you guys just do everything, and our chef will work for you and we'll make your food. Just show them how to do it.\"\nOn opening a Mission Chinese Food in New York that closed — despite its many accolades — because of structural issues and a sanitary violation\nIn retrospect, should we have [had] a structural engineer go through the building with us and everything else? Yeah, probably. We just let our emotions get the best of us. We felt an energy in that space when we walked through it. ... It wasn't legally supposed to even be a restaurant. ... The basement wasn't even legally zoned to be used for any sort of kitchen prep or preparation at all; it was supposed to be a cellar. We opened the restaurant three months after we moved here. ... We didn't do any major construction, nothing structural — we just opened. ...\nWe didn't even have time to actually reflect on and really appreciate all the accolades we had gotten, because when you're working that much, things are just flying back. I didn't even know what \"Restaurant of the Year\" meant. I didn't even know there was an end of the year, restaurant of the year section in The New York Times. So when people said, \"You won this 'Restaurant of the Year' thing,\" I was like, \"That's amazing! What does that even mean?\" And then I kept cooking. ...\n[Then] all of the sudden it came to a complete halt, a screeching halt. The restaurant closed. We could've tried to reopen it again, but we knew just as much as everyone else did, we looked into doing it the right way, \"OK, how much would it cost to level the whole entire [building], structurally rebuild it to where it is zoned [so] it will actually pass inspection and be up to code?\" And that costs like three-quarters of a million dollars for a 1,000-square-foot space. It just didn't make sense.\nOn a bad experience he had working at an upscale Japanese-French restaurant\nIt was like a hazing period that never ended. ... There was a lot of physical abuse. There were pans thrown at my head while I was working. I had to dodge that. ... They would hit me. They would force me to do push-ups in the basement while sitting on my back. ... [The chef and sous-chef] would be doing massive amounts of cocaine and drinking beer the whole time. And I was just trying my hardest to keep up with these amazing cooks that were highly stimulated and drunk and super obnoxious.\nThat, to me, was really a proving ground for myself. I was like, \"Gosh, is this really what I'm going to be doing?\" I wanted to get better. It made me better in a sense of knowing how far I could be pushed. ... That experience, for me, taught me, really, mostly how not to treat other people.","url":"https://www.npr.org/sections/thesalt/2016/01/21/462150071/the-audacious-korean-american-chef-who-mastered-mission-chinese-food"}
