{"authors":[],"date_download":"2018-10-30 00:59:07","date_modify":"2018-10-30 00:59:07","date_publish":"2016-06-22 00:00:00","description":null,"filename":"data/vaneerConsumption/TheAR15isNotanAssaultWeapon.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_06_the_ar15_is_not_an_assault_weapon_comments_1540861147.html","title":"The AR15 is Not an Assault Weapon","title_page":"Articles: The AR15 is Not an Assault Weapon","title_rss":"NULL","source_domain":"americanthinker.com","text":"When you consider the Oklahoma office worker whose head was hacked off with a knife, the New York cops attacked with an axe, and the Paris assault with a knife, it begins to dawn on one that assault is a behavior and not a weapon. Ever since Cain slew Able, it has been possible to kill people without using an AR15. I once saw a movie depicting a time and place and place where only police and the military had guns. It was called Schindler’s List. Only the Nazis had guns. One wonders hoe history would have been different had Germany had a Second Amendment and every Stormtrooper knocking on the door at midnight had met a Jew with a gun. It is a common practice amongst liberals to demonize objects and attribute to them all sorts of magical powers over us. Nuclear weapons are a threat, not the tyrants and dictators who would use them against us. Guns are the threat, not the criminals who would use them to kill us. The AR15 is an “assault” weapon, not the gun... (Read Full Article)","url":"https://www.americanthinker.com/articles/2016/06/the_ar15_is_not_an_assault_weapon_comments.html"}
u have nothing to shoot back with.\nFormer Navy SEAL Dean Raso is quoted in The Federalist as describing the AR15 as in fact the ideal defensive weapon against heavily armed predators:\nIn the wake of the Orlando terrorist attack, the deadliest strike on U.S. soil since 9/11, Democratic lawmakers and progressive activists have responded by attempting to limit access to firearms — particularly the AR-15, which was incorrectly reported as the weapon the terrorist used to kill at least 49 people and injure another 53. In a new video, former Navy SEAL Dom Raso explains why the AR-15, the most popular rifle in the country, gives Americans the best chance of surviving in an age of terror. Choosing to defend one’s home with an AR-15 is a commonsense choice, as it is powerful, accurate, and easy to shoot, Raso said. Gun control legislation doesn’t stop terror attacks, he explained, citing the two terrorists who weren’t deterred by California’s assault weapons ban when they killed 14 people in San Bernardino last year. Nor would any gun ban have stopped the Boston Bombers when they detonated a bomb at the Boston Marathon, killing three and wounding at least 260 others. Ironically, both of those incidents of terror were brought to a stop by armed police officers responding to the scene with AR-15s -- the same weapon legislators are trying to ban. “Why would you want to ban the gun you pray for police to show up with?” Raso asked.\nIndeed, why would you? As one wag put it, a gun in the hand is betters than a cop on a phone and the response time for a bullet from an AR15 fired in self-defense is a lot quicker than calling 911. As Investors Business Daily editorialized: In 2014, as California Sen. Diane Feinstein was trying to revive the expired assault weapons ban, banning “scary” weapons like the AR15, based on its appearance is nonsense. Other non-scary weapons are just as lethal and the AR15 has been chosen by popular demanded as the defensive weapon of choice, despite a nonsensical ruling by one federal judge:\nAs the Ferguson riots raged, U.S. District Judge Catherine C. Blake, appointed by President Clinton, issued a ruling that upheld the Maryland law, saying, \"the court seriously doubts that the banned assault long guns are commonly possessed for lawful purposes... and is inclined to find the weapons fall outside Second Amendment protection as dangerous and unusual.\" Now the Second Amendment, written in the era of muskets, does not mention what arms we have the right to keep and bear. But we have an idea, based on how they were used: to protect their owners' homes, businesses, farms and families, and to fight the tyranny of the British crown. It's been said that the Second Amendment was put in the Bill of Rights to protect the other nine. Gun control advocates say, with some snarkiness, that the Second Amendment doesn't allow one to own nuclear weapons or tanks, so it's merely a question of where we draw the line. They would draw the line at the AR-15 and its counterparts -- which, despite the judge's claim, are commonly used for legal, defensive purposes. The AR-15 is among the guns that must be registered. They've made up 50%-60% of U.S. rifle sales in recent years, federal figures show. The New York Times recently called the AR-15 \"The Most Wanted Gun In America.\" Sen. Dianne Feinstein, D-Calif., has been pushing a bill to reintroduce the ineffective assault weapons 1994 ban that expired in 2004 with no impact on the crime rate. Feinstein's legislation would outlaw more than 150 types of weapons, from rifles to pistols to shotguns. They include the Streetsweeper and Striker-12, which, again, have frightening appearances yet chamber the same 12-gauge shells that are used to hunt birds. While used in several high-profile mass shootings, the AR-15 is favored among homeowners, hunters and sport shooters. It's popular for both sport and self-defense among women, who find it easy to carry and handle. Crime rates and homicides have dropped as concealed-carry laws spread nationwide. As more citizens are armed, predators find it harder to find unarmed victims except in gun-free zones such as the school in Newtown, Conn., or the theater in Aurora, Colo.\nCritics of the Second Amendment say that they are not going after guns used for legitimate activities such as hunting. But when the Founders wrote the Second Amendment it was because the British were coming, not because it was the start of deer season. As Fox News contributor Judge Andrew Napolitano notes:\nThe historical reality of the Second Amendment's protection of the right to keep and bear arms is not that it protects the right to shoot deer,\" wrote Judge Andrew Napolitano recently in the Washington Times. \"It protects the right to shoot tyrants, and it protects the right to shoot at them effectively, with the same instruments they would use upon us. If the Jews in the Warsaw ghetto had had the firepower and ammunition that the Nazis had, some of Poland might have stayed free and more persons would have survived the Holocaust.\"\nThe AR15 is a defensive weapon, such as when it was used by a 15-year-old who grabbed his father’s AR15 and used it to ward off home invaders:\nNot only did this brave 15-year-old defend his home against 2 burglars, but also his 12-year-old sister who was in the house with him. He grabbed his father’s AR15 and shot one of the burglars multiple times. They got away but had to go right to the hospital where the minor was arrested and the adult who was shot was flown to a different hospital.\nIn the hands of British redcoats, the musket was an assault weapon. In the hands of a law-abiding American, an AR15 is what the Second Amendment is all about.\nDaniel John Sobieski is a freelance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/articles/2016/06/the_ar15_is_not_an_assault_weapon.html"}
