{"authors":["Stephen K. Bannon","Alexander Marlow"],"date_download":"2018-10-30 17:59:17","date_modify":"2018-10-30 17:59:17","date_publish":"2015-08-12 01:21:39","description":"Was Megyn Kelly’s performance “good journalism”? Here are her questions, evaluated one by one.","filename":"data/vaneerConsumption/TheArroganceofPowerMegynKellysGoodJournalism.json","image_url":"https://media.breitbart.com/media/2015/08/AP_709244509971.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_11__1540922357.html","title":"The Arrogance of Power: Megyn Kelly's 'Good Journalism'","title_page":"The Arrogance of Power: Megyn Kelly's 'Good Journalism' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Monday night, Fox News host Megyn Kelly doubled down in defense of her questions during Thursday night’s inaugural Republican presidential debate. She explained:\nYou may have heard that there was a dustup between yours truly and presidential contender Donald Trump. Mr. Trump was upset with a question I asked him at the debate last week about his electability and specifically comments he had made in the past about women. A few words on that: Apparently Mr. Trump thought the question I asked was unfair and felt I was attacking him. I felt he was asked a tough but fair question. We agreed to disagree. Mr. Trump gave interviews over the weekend that attacked me personally. I have decided not to respond. Mr. Trump is an interesting man who has captured the attention of the electorate. That’s why he’s leading in the polls. Trump, who is now the frontrunner, will not apologize. And I certainly will not apologize for doing good journalism. So, I’ll continue doing my job—without fear or favor. And Mr. Trump, I expect, will continue with what has been a successful campaign thus far. This is a tough business, and it’s time now to move forward.\nBut was Kelly’s performance “good journalism”?\nFirst, what is “good journalism”? Has it come to mean asking gotcha questions designed to catch politicians off guard, pushing them off their talking points? After all, that is why Edward R. Murrow, Walter Cronkite, Sam Donaldson, and Dan Rather were considered “good journalists,” even though all were partisan egotists. By that definition, Kelly’s performance was admirable.\nIf by “good journalism,” however, we mean questions designed to elicit informational responses that will be helpful to viewers, Kelly failed in her duties on Thursday night.\nKelly asked fifteen questions during the debate. A huge majority of those questions targeted Republicans in ways that would have pleased Clintonista George Stephanopoulos. There is a reason Jorge Ramos of Fusion praised Fox News, as did anchors on MSNBC and CNN. As did the New York Times opinion page. And, of course, as did Hillary Clinton.\nHere were Kelly’s questions, one by one. As the debate went on, her quotient of informational questions to headline-grabbing ones went up. But early on, during the highly anticipated beginning of the first debate of this presidential news cycle, it was a ratings-garnering fireworks show:\nBen Carson’s Qualifications. Kelly began the debate by asking Dr. Ben Carson about his screw-ups on NATO, the governmental parties in Israel, and Alan Greenspan’s position as chairman of the Fed. She concluded, “Aren’t these basic mistakes, and don’t they raise legitimate questions about whether you are ready to be president?” The question itself isn’t unfair, but the way in which it was posed certainly was: a list of specifics to which Carson had no opportunity to respond, followed by a broader question about leading designed to cast Carson negatively.\nOut of the gate, Fox News anchor Kelly condescended to a man who became the director of pediatric neurosurgery at the world-renowned Johns Hopkins Hospital when he was just 33 years old.\nBold.\nTrump on Women. Kelly’s most controversial question of the night was directed toward Donald Trump. She essentially labeled him a general in the “war on women” because he says nasty things on his Twitter account and on reality television:\nMr. Trump, one of the things people love about you is you speak your mind and you don’t use a politician’s filter. However, that is not without its downsides, in particular, when it comes to women. You’ve called women you don’t like “fat pigs, dogs, slobs, and disgusting animals.” Your Twitter account has several disparaging comments about women’s looks. You once told a contestant on Celebrity Apprentice it would be a pretty picture to see her on her knees. Does that sound to you like the temperament of a man we should elect as president, and how will you answer the charge from Hillary Clinton, who was likely to be the Democratic nominee, that you are part of the war on women?\nTrump rightly objected to this question. Of all the problems women face on planet Earth in the year 2015, is Donald Trump’s Twitter account the most noteworthy for viewers of a presidential primary debate? And if not his Twitter feed, is it his Apprentice board room — from eight seasons ago? As it turns out, his supposed victim said she didn’t remember the comment and eventually defended The Donald.\nKelly, of course, didn’t provide the staggering audience of 24 million the context from the episode of The View that prompted Trump to disparage comic and host Rosie O’Donnell. O’Donnell, as it happens, provoked Trump’s ire by mocking women who participated in his pageants as well as women in his family, past and present.\n#War.\nHillary Clinton, predictably, has seized the battle between Trump and Kelly to slam Republicans as sexist monsters. She said that Trump’s comments about Kelly, in which he said that Kelly had “blood coming out of her eyes, blood coming out of her…wherever” during the debate, were “outrageous.” She added:\nI just want to remind us that what they say about women — not one woman who is perfectly capable and incredibly impressive, able to take care of herself, but all these women that I have fought for, worked for, stood up for, advocated for and want to be a president for, who may not have the opportunity to defend themselves, who may lose the right to exercise a personal choice if certain of the Republicans were to be successful, I don’t want that forgotten.\nShe then launched into an attack on Senator Marco Rubio’s (R-FL) pro-life position, stating, “what Marco Rubio said has as much of an impact in terms of where the Republican party is today as anybody else on that stage.”\nKelly provided this opening with a foolish question. The true war on women is happening in the Middle East, with the help of cowardly Democrats; it’s happening in Europe, where genital mutilation is reaching nearly every corner of the continent; and it’s happening in the United States, where Democrats back sex-selective abortion and a record 56 million women are out of the work force during this Democratic administration. Hillary Clinton herself has been labeled the “war on women” by alleged sexual harassment victim Kathleen Willey. But Trump said Rosie O’Donnell’s fat, and that makes it to the top of a 2016 Republican presidential debate.\nAll in the name of “good journalism.”\nBlasting Walker on Abortion. Kelly didn’t just ask Wisconsin Governor Scott Walker about his abortion position. She phrased it in language that would have made Cecile Richards of Planned Parenthood proud: “Would you really let a mother die rather than have an abortion, and with 83 percent of the American public in favor of a life exception, are you too out of the mainstream on this issue to win the general election?” She asked no questions about the Democrats’ abortion-after-birth position.\nSmacking Kasich on Medicaid. Kelly asked Governor John Kasich of Ohio about his expansion of Medicaid in the state, and his justification by way of the Bible. The question was hard-hitting and logical:\nYou defended your Medicaid expansion by invoking God, saying to skeptics that when they arrive in heaven, Saint Peter isn’t going to ask them how small they’ve kept government, but what they have done for the poor. Why should Republican voters, who generally want to shrink government, believe that you won’t use your Saint Peter rationale to expand every government program?\nEven this question, however, smacked of anti-religious eye-rolling. Kasich may be misusing the Bible, but questioning his sincerity seems misplaced.\nFacing Off Christie and Paul. Kelly looked to start a chair-throwing Jerry Springer fight between Governor Chris Christie (R-NJ) and Senator Rand Paul (R-KY) over surveillance. She didn’t just ask them about their policies – she explicitly attempted to start a fracas between the two, and succeeded by asking Christie this:\nDo you really believe you can assign blame to Senator Paul just for opposing the bulk collection of people’s phone records in the event of a terrorist attack?\nThe battle that ensued was quite entertaining. It also didn’t add any additional informational content of the debate.\nQuizzing Cruz on ISIS. Kelly asked Cruz about his position on ISIS in straightforward manner; Cruz answered in straightforward manner. It was one of the best moments of the debate for any candidate.\nSlamming Bush Over Iraq. Before we even analyze the question, the main takeaway from this exchange is that Megyn Kelly branded Operation Iraqi Freedom Jeb’s “brother’s war.” She didn’t just ask Bush about his position on the war in Iraq, she specifically posed Bush’s position as in opposition to troops that died. Kelly originally caught Bush in the Iraq war question back in May, when she asked, “Knowing what we know now, would you have authorized the invasion?… You don’t think it was a mistake?” After Bush received blowback about his answer and said he wouldn’t have invaded Iraq, Kelly now flipped the tables: “To the families of those who died in that war who say they liberated and deposed a ruthless dictator, how do you look at them now and say that your brother’s war was a mistake?” It’s fair to say that Iraq was not George W. Bush’s war any more than it was Hillary Clinton’s war. Iraq was a war voted for by the United States Congress to enforce United Nations resolutions, with a coalition of dozens of countries.\nAsking Walker About The Middle East. Another good question from Kelly here, in which she asked Walker about cultivating partners in the Arab world. The question gave Walker an opportunity to demonstrate knowledge about the Middle East situation.\nAsking Carson About Enhanced Interrogation Techniques. Another good question from Kelly, straightforwardly posed and answered.\nSlamming Bush on Planned Parenthood. Governor Jeb Bush (R-FL) is deeply pro-life and always has been. That didn’t stop Kelly from digging for paydirt on Bush and abortion:\nGovernor Bush, let’s start with you. Many Republicans have been outraged recently by a series of videos on Planned Parenthood. You now say that you support ending federal funding for this organization. However, until late 2014, right before you started your campaign, you sat on the board of a Bloomberg charity that quite publicly gave tens of millions of dollars to Planned Parenthood while you were a director. How could you not know about these well publicized donations, and if you did know, how could you help a charity so openly committed to abortion rights?\nA gotcha question if ever there was one.\nBlowing It On Rubio’s Abortion Record. Kelly asked Senator Marco Rubio (R-FL) why he is in favor of an exception to his pro-life stance with regard to rape and abortion. Rubio isn’t. She got that one wrong.\nHitting Trump on His Transformation Into a Republican. Kelly bashed Trump over his policy evolutions – a legitimate question, except in the phraseology:\nMr. Trump, in 1999, you said you were, quote, “very pro- choice.” Even supporting partial-birth abortion. You favored an assault weapons ban as well. In 2004, you said in most cases you identified as a Democrat. Even in this campaign, your critics say you often sound more like a Democrat than a Republican, calling several of your opponents on the stage things like clowns and puppets. When did you actually become a Republican?\nCould this question possibly be more dismissive? But because this was the most straightforward question Trump received, it actually prompted his best answer: his transformation on the pro-life issue.\nTrying to Start Another Fight Between Bush and Trump. After having precipitated the slugfest between Christie and Paul, Kelly now turned to starting a food fight between Trump and Bush, one in which Bush declined to participate:\nGovernor Bush, I want to ask you, on the subject of name calling of your fellow candidates, a story appeared today quoting an anonymous GOP donor who said you called Mr. Trump a clown, a buffoon, something else that cannot be repeated on television.\nDropping Same-Sex Marriage on Kasich. Republicans can never be asked about their positions on same-sex marriage; it’s apparently a sort of media rule. They can only be asked questions that seem to imply that opposition to same-sex marriage mirrors dislike of gays and lesbians. That was the premise of Kelly’s question to Kasich on the subject: “The subject of gay marriage and religious liberty. Governor Kasich, if you had a son or daughter who was gay or lesbian, how would you explain to them your opposition to same-sex marriage?” This is another example of a reasonable debate topic where Kelly framed the issue using the language of the left.\nKelly’s Odd God Question. Kelly went into commercial break with one of the most awkward TV news segues in memory: “we’re going to let the candidates make their closing statements, their final thoughts, and God. Stay tuned for that.” God was apparently double-booked and unable to appear, but a sneering question about the role of God did:\nIn our final moments here together, we’re going to allow the candidates to offer their final thoughts. But first, we want to ask them an interesting closing question from Chase Norton on Facebook, who wants to know this of the candidates: “I want to know if any of them have received a word from God on what they should do and take care of first.” Senator Cruz, start from you. Any word from God?\n“Any word from God”? Seriously?\nOverall, Kelly’s debate performance was not just “good journalism” by mainstream media standards – it was “great journalism.” She put multiple candidates on the end of her skewer, and grilled them like kebab. In terms of asking fair questions, however – questions designed to elicit information of value to GOP primary voters without demonizing the person being asked – Kelly’s journalism wasn’t journalism at all, but attention-grabbing of the highest order.","url":"https://www.breitbart.com/politics/2015/08/11/the-arrogance-of-power-megyn-kellys-good-journalism/"}
