{"authors":["Lia Beck"],"date_download":"2018-10-31 01:48:37","date_modify":"2018-10-31 01:48:37","date_publish":"2018-09-13 23:34:52","description":"Major spoilers ahead. Whether you've seen A Simple Favor and just can't stop thinking about it or are one of those people who love reading spoilers before seeing a movie, welcome! You are at the right place. The ending of A Simple Favor is, simply,…","filename":"data/vaneerConsumption/TheASimpleFavorEndingIsBonkersSoLetsBreakDownEveryDetail.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/12/a2a60d77-5d3b-4d60-afc1-2fdf6b137ac4-screen-shot-2018-09-12-at-125101-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-a-simple-favor-ending-is-bonkers-so-lets-break-down-every-detail-11889435_1540950517.html","title":"The 'A Simple Favor' Ending Is Bonkers, So Let's Break Down Every Detail","title_page":"The 'A Simple Favor' Ending Is Bonkers, So Let's Break Down Every Detail","title_rss":"NULL","source_domain":"bustle.com","text":"Major spoilers ahead. Whether you've seen A Simple Favor and just can't stop thinking about it or are one of those people who love reading spoilers before seeing a movie, welcome! You are at the right place. The ending of A Simple Favor is, simply, bonkers. As is the entire movie. From Blake Lively's first suit to Andrew Rannells hitting her with his car, this movie never slows down — there are truly so many twists in A Simple Favor.\nBefore we get into the ending, here are the basics of the plot: Stephanie (Anna Kendrick) is a mommy vlogger whose kid attends school with the son of Emily (Blake Lively), a publicist who loves martinis and three-piece suits, and her husband Sean (Henry Golding), a novelist/college professor. Stephanie and Emily become friends and exchange secrets, like the fact that Emily and Sean had a threesome with his teaching assistant, and that Stephanie had sex with her half-brother on the day of their father's funeral. Normal things you share with someone you've hung out with just a few times. Soon, though, Emily goes missing and Stephanie ends up becoming an investigator to track her down. This involves lot of other wild stuff like Stephanie and Sean having sex on the day of Emily's funeral (yes, this movie involves two inappropriate funeral hookups), \"Emily\" showing up dead in a lake, and the reveal that Stephanie's brother is really her son's father.\nLionsgate Movies on YouTube\nSo, the ending. It's hard to know where to start because this movie has about 40 twists and they start when there's still a good chunk of time left. First of all, Emily has a secret twin, Emily's real name isn't even Emily (I'll keep calling her that for convenience sake), and Emily drowns her twin when the twin tries to extort her. This is how Emily's insurance fraud scheme ends up happening, because, obviously the twin looks exactly like Emily and shares her DNA. The twin reveal is the main and very easy to see coming twist, but a lot more happens after that.\nIt seems like Emily and Stephanie are going to start working together after Emily backs Stephanie into a corner and tries to con her into thinking Sean is the bad guy. Turns out, Sean and Stephanie decide to work together. Their plan? Stephanie shows up at Sean and Emily's house with a gun, threatening to kill them both. But, she shoots Sean while he's wearing one of those fake blood pack things, in the hopes that Emily will confess she was the one who killed her twin and that Sean wasn't in on it — of course, this is all while they are secretly recording her. Emily does confess, but then she reveals she destroyed the microphones they'd planted. Emily ends up shooting Sean to show how little she cares about him, and while she's threatening to do the same to Stephanie, Stephanie reveals that she's been wearing a camera and is live streaming the entire thing to her followers.\nLionsgate\nBut it's not over yet! Police are about to arrive, but Emily runs out of the house in the hopes of escaping and Andrew Rannells hits her with his car. (Rannells plays one of the other parents from the kids' school and is a viewer of Stephanie's vlog.) Emily doesn't die, but she can't escape the police because she's just been hit by a car Mean Girls-style, so she gets arrested — finally.\nAt the very end, Stephanie records a vlog and announces that she's reached 1 million followers and that she now is offering her investigative services; Emily is shown playing basketball in prison. (Guess that car accident didn't impede her too much.) Text then appears on screen that lets us know Stephanie has helped hunt down 30 criminals, Sean has moved with his son to California and teaches at UC Berkeley, and Emily is serving a 20-year prison sentence.\nWhile, surely, what is described here sounds like a lot, those who have seen the movie know this isn't the half of it. There's arson. There's Emily giving herself a black eye with a wrench. There's what should have been Henry Golding's audition tape for Fifty Shades of Grey. There's Linda Cardellini showing up as a Fireball-chugging artist. If you already saw the movie, hopefully this helped you get your thoughts together, and if you're a pre-movie spoiler-reader, you still might find yourself surprised when you do see the film.","url":"https://www.bustle.com/p/the-a-simple-favor-ending-is-bonkers-so-lets-break-down-every-detail-11889435"}
