{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:56:56","date_modify":"2018-10-30 19:56:56","date_publish":"2016-02-12 19:14:06","description":"A uniformed Sheriff's Deputy was denied entrance to the Fox Theater complex in downtown Atlanta because the deputy was carrying his service weapon on his hip. |","filename":"data/vaneerConsumption/TheaterDeniesEntranceToArmedSheriffsDeputy.json","image_url":"https://media.breitbart.com/media/2016/02/FOX-theater-ATL-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_12__1540929416.html","title":"Theater Denies Entrance To Armed Sheriff's Deputy","title_page":"Theater Denies Entrance To Armed Sheriff's Deputy | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A uniformed Sheriff’s Deputy was denied entrance to the Fox Theater complex in downtown Atlanta because the deputy was carrying his service weapon on his hip.\nThe Butts County deputy–Sergeant Jack Gilroy–was escorting “60 fifth-grade students and their teachers” to the theater as part of a Feb. 8 field trip.\nAccording to WSBtv, Gilroy said a Fox Theater security team member “asked him to leave the building or store his service weapon in his vehicle.”\nGilroy refused to remove his gun from its holster, and instead stood “outside the theater for nearly three hours.”\nButts County Sheriff Gary Long found Fox Theater’s actions unacceptable. He stressed that “it’s standard procedure for an on-duty deputy to escort kids on all sporting events and field trips.” He said doing so “gives a sense of security to parents at work or home.”\nLong asked the public to consider how the scenario might have played out if Deputy Gilroy had taken his pistol to the car and locked it away as asked, and then a shooting had happened and children were harmed while the man who could have saved them was denied entrance because he was armed.\nLong asked, “How would he owner of the Fox” explain that to parents?\nParents were shocked to learn Deputy Gilroy was denied entrance. A Fox Theater spokesperson said the venue plans to review its gun policies.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/02/12/theater-denies-entrance-to-armed-sheriffs-deputy/"}
