{"authors":["Kipp Jones"],"date_download":"2018-10-30 19:38:21","date_modify":"2018-10-30 19:38:21","date_publish":"2014-12-24 16:31:02","description":"Sony’s decision to offer a limited release of The Interview on Christmas Day reportedly has exhibitors upset at the logistical nightmare.","filename":"data/vaneerConsumption/TheaterExhibitorsUpsetwithwithSonysHandlingofTheInterview.json","image_url":"https://media.breitbart.com/media/2014/12/the-interview-billboard-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2014_12_24__1540928301.html","title":"Theater Exhibitors Upset with with Sony's Handling of 'The Interview'","title_page":"Theater Exhibitors Upset with with Sony's Handling of 'The Interview'","title_rss":"NULL","source_domain":"breitbart.com","text":"Sony’s last-minute decision to offer a limited release of The Interview on Christmas Day reportedly has exhibitors upset at the logistical nightmare picking up the film will create.\nSony CEO Michael Lynton and President Barack Obama are chocking up the decision as a victory against terrorism, despite the fact that the film will only be offered to roughly one-tenth of the original theaters originally planned.\nMost theatre heads feel that Sony’s handling of this crisis has been shaky, and the decision to change course again has reportedly the left heads of the major chains frustrated.\nMany theaters do not want to offer the film at this point and the ones who do, and we hear that the little guys who do are agitated that Sony came back to them with aggressive terms, with exhibitors on their own if they want to add security, according to the Hollywood Reporter.\nTHR reports that Sony was already on the last nerve of these theater executives, who were infuriated that the studio didn’t cancel the film when it received bomb threats by hackers already brought Sony to its figurative knees.\nThe Landmark Theatres chain released a message regarding the go-ahead decision to offer the film on Christmas:\nLandmark Theatres has no plans to play The Interview… Our theaters have been fully booked for months as there is an enormous amount of film already in the marketplace in addition to six new films opening on Christmas Day. It would never occur to us not to honor our existing commitments to our distribution partners during one of the busiest times in the year.\nAnother theater source told Deadline, saying ”this is another misstep for Sony.”\nTheater owners had asked for a delay in the premiere so that they could address the security issues that accompanied the film, when Sony pulled the release and blamed the exhibitors.\nBill Barstow, whose Main Street Theatres originally planned to make room for the film, is now leaning against showing it, citing the importance of security: “How do we get security on Christmas Day on such short notice?”\nHe said that showing the film the at the last minute creates a “logistical nightmare.”\n“On such late notice, that creates problems for other distributors,” he said.\nThere is also speculation that Sony will accompany the film’s limited release with a video on demand rollout, possibly on the same day. THR suspects that possibility might destroy the film’s theatrical viability and would further infuriate NATO and major theater owners, who don’t participate in that part of the program.\nThe Interview will begin showing at an estimated 100 theaters nationwide, starting Christmas Day.","url":"https://www.breitbart.com/entertainment/2014/12/24/theater-chains-upset-with-with-sonys-handling-of-the-interview-release/"}
