{"authors":["Richard Gray For Mailonline"],"date_download":"2018-10-23 01:46:10","date_modify":"2018-10-23 01:46:10","date_publish":"2016-01-28 16:10:19","description":"An exhibition at the Royal Institute of British Architects in London has revealed how England's capital city could have looked very different as it was rebuilt after being destroyed in the blaze.","filename":"data/vaneerConsumption/TheabandonedplanstoraiseLondonfromtheashesafterGreatFireof1666.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC45B500000578-0-image-a-51_1453997885142.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3421136_The-masterplans-raise-London-ashes-Abandoned-proposals-rebuild-city-Great-Fire-1666-show_1540259170.html","title":"The abandoned plans to raise London from the ashes after Great Fire of 1666","title_page":"The abandoned plans to raise London from the ashes after Great Fire of 1666 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It started in a bakery on Pudding Lane in the early hours of a Sunday morning and over the course of five days destroyed a third of the city of London.\nWith more than 13,200 houses, 87 churches, many official buildings and St Paul's Cathedral consumed by the flames, the authorities faced a daunting task to rebuild after the Great Fire of London.\nYet there were some who saw the destruction wrought by the blaze in 1666 as an opportunity to create a gleaming new city from the ashes.\nFollowing the Great Fire of London, King Charles II encouraged architects to put forward plans for rebuilding the city. Among those to be considered was one by Christopher Wren, which proposed building Parisian style boulevards and piazzas (pictured)\nMasterplans drawn up by several architects at the time have now gone on display which reveal how the capital city of London could have been a very different place if they had been implemented.\nAmong them is the ambitious re-organisation of the city's streets put forward by Christopher Wren, which drew heavily on influences of Paris.\nHe proposed remodelling London with grand formal streets, classical buildings and sweeping plazas.\nUnder the encouragement of King Charles II, other schemes put forward include John Evelyn's proposals to adopt Italian-style piazzas and broad avenues.\nRichard Newcourt put forward an even more radical plan to use a grid system, which was later used to construct US cities like Philadelphia.\nOne of the most radical plans to rebuilt London after the Great Fire was to introduce a grid system (pictured), put forward by Richard Newcourt. A similar scheme was eventually later used to construct Philadelphia\nJohn Evelyn's masterplan for rebuilding the City of London after the Great Fire (pictured), proposed a more Italian design with large piazzas and broad avenues. Sadly squabbles over money and who owned the land meant few of the designs put forward were ever realised\nCaptain Valentine Knight put forward a rather unusual pattern for London that would have left the city looking a very different place. He proposed building two main streets running east to west and eight running north to south (pictured), with smaller lands connecting them to blocks of houses. He also put forward the idea of introducing a canal loop to the River Fleet\nElsewhere, scientist and architect Robert Hooke proposed a grid pattern with wide boulevards which was later used in the renovation of Paris and Liverpool.\nCaptain Valentine Knight suggested building two main streets running east to west and eight running north to south, between which there would be narrow blocks of houses connected by smaller lanes.\nHe also introduced a canal loop to the River Fleet.\nUltimately none of the masterplans were implemented due to a lack of finances and squabbles over ownership of the land.\nEventually a special Fire Court heard the competing claims and the city was left largely as it had been, although streets were widened, straightened and bottlenecks eased.\nThe Great Fire of London (illustrated) destroyed a third of the city, including 13,200 houses, 87 churches and St Paul's Cathedral\nThe scientist Robert Hooke proposed using a grid pattern with wide boulevards (pictured) as the best way to reconstruct the devastated city. His scheme was later used in the renovation of Paris and Liverpool\nChristopher Wren eventually was made responsible for rebuilding St Paul's Cathedral. His design is pictured above from the Parentalia, a book on the famed architect's life\nThe city was eventually rebuilt in much the same way as it had been with some streets being widened and one new street being introduced. The 18th century map above shows how the city would eventually look\nOne new street - King Street – was built, and special market halls were created to house those that had previously been on the streets.\nA scheme to turn the fleet into a canal, as proposed by Captain Knight, was started, but failed after a few decades while a plan to build a new Quay from Blackfriars also failed.\nOne thing is clear, if any of the proposed plans had been implemented, London would have been a very different place from the one seen today.\nThe plans appear in a new exhibition at the Royal Institute of British Architects in London called 'Creation from Catastrophe: How Architecture rebuilds Communities.\nAlso included in the exhibition at the Royal Institute of British Architects in London is a painting by Jules Geurin of plans to rebuild post-fire Chicago (pictured) following the city's own Great Fire in 1871\nThis exhibition also includes plans for rebuilding Chicago after the Great Fire of 1871 and Lisbon after the Portugese city was destroyed by an earthquake in 1755.\nThe exhibition also includes more modern solutions including attempts to build bamboo homes in Pakistan and floating buildings to overcome flooding in Lagos, Nigeria.\nA statement about the exhibition released by the Institute said: 'Starting with the five alternative plans for London produced after the Great Fire of 1666, the exhibition takes the viewer on a journey through 18th century Lisbon, 19th century Chicago, 20th century Skopje, ending up in current day Nepal, Nigeria, Japan, Chile, Pakistan and USA.\nAnother of the designs to feature in the exhibition is this for a floating school to tackle flooding in Lagos, Nigeria (pictured)\n'Key historical works from the RIBA Collection will be on display for the first time, including the five original plans for rebuilding London after the Great Fire of London, which has its 350th anniversary in 2016.\n'The exhibition will weave a narrative about the shift from a tabula rasa approach (blank slate) created by a sole author, to a more collaborative way of working that relies on local expertise, materials and community spirit.","url":"https://www.dailymail.co.uk/sciencetech/article-3421136/The-masterplans-raise-London-ashes-Abandoned-proposals-rebuild-city-Great-Fire-1666-show.html"}
