{"authors":["Angelica Florio"],"date_download":"2018-10-31 01:41:47","date_modify":"2018-10-31 01:41:47","date_publish":"2018-09-14 18:50:56","description":"Spoilers ahead. In A Simple Favor, Anna Kendrick and Blake Lively play two upper class women whose lives intersect in the most unexpected ways. First, they become friends due to their kids going to the same school, then Lively's character, Emily,…","filename":"data/vaneerConsumption/TheASimpleFavorTwistIsSoWildItllLeaveYourHeadSpinning.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/50d1c42f-582c-498c-a697-4ed4b3e33eec-screen-shot-2018-09-14-at-23200-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-a-simple-favor-twist-is-so-wild-itll-leave-your-head-spinning-11920460_1540950107.html","title":"The 'A Simple Favor' Twist Is So Wild It'll Leave Your Head Spinning","title_page":"The 'A Simple Favor' Twist Is So Wild It'll Leave Your Head Spinning","title_rss":"NULL","source_domain":"bustle.com","text":"Spoilers ahead. In A Simple Favor, Anna Kendrick and Blake Lively play two upper class women whose lives intersect in the most unexpected ways. First, they become friends due to their kids going to the same school, then Lively's character, Emily, disappears and Kendrick's character, Stephanie, attempts to figure out what happened to her pal. Yet the twist in A Simple Favor is one that no one will expect, even if you read the book, because not only does it involve faked deaths and love affairs, but there's also fake blood and live-streamed attempted murder.\nSee, Stephanie vlogs her life on a mommy blog, and when Emily goes missing, she turns to her viewers, which includes another parent from the kids' school named Darrel (Andrew Rannells) — more on that later. It turns out that Emily didn't die, but she's drowned her identical twin in a lake (cue the Instagram Stories \"big reveal\" sound clip) in order to fake her own death so she can live off of the life insurance payout with her husband Sean (Henry Golding) and their son in Europe.\nSean and Stephanie have begun an affair during Emily's disappearance, though, and that throws a wrench in Emily's plan to get her husband to play along with the big plot to run off to Europe. What ends up happening, then, leads to twist after twist after twist.\nLionsgate Movies on YouTube\nEmily returns to Stephanie's life and tries to distance her faux friend and her husband by turning Stephanie against Sean. As a certified murderer, you can imagine that Emily's tale of Sean's wrongs are pretty convincing, because Emily has proven that she basically has no remorse for any of her actions. The fact that Emily has information about Stephanie's sexual relationship with the latter's own brother in law — told you it's twisty — doesn't help things either, as Stephanie has reason to try to keep Emily on her good side. With Sean framed for murdering Emily's sister and Stephanie seemingly wrapped around Emily's finger, it seemed like everything is in place for Sean to take the blame for murder after the two women team up.\nHowever, Emily has underestimated Stephanie and Sean's bond, because those two have already planned to reveal Emily as the murderer that she is. That is probably the biggest twist of the movie, and it is revealed only after Stephanie barges into Emily and Sean's house to shoot Sean. Emily does shoot him, but only because she and Sean have already planned that Sean will wear a fake blood pack to make Emily think that her husband is dead. Sean and Emily set up microphones in hopes that after seeing Stephanie shoot Sean, the murderer will admit that Sean has nothing to do with Emily's twin's deaths.\nThen, another twist: Emily has known about Sean and Stephanie's microphones, and she's destroyed them. Out of anger over her husband and pseudo friend's betrayal, Emily shoots Sean — yeah, her own husband — which leads to another big reveal: Stephanie is wearing a camera and live-streaming the entire thing to her followers online. That is obviously a major gotcha, seeing as Emily has shot someone and threatened to murder Stephanie all on tape, but it isn't even the end of the movie's surprises.\nWith the police on their way, Emily runs out of her home to escape, but Darrel — told you he'd come back — hits her with his car. The deceitful Emily is sent to prison for 20 years and Stephanie continues both her vlogging and her investigative services.\nThe twist of Emily having known about Stephanie and Sean's microphones would have been enough to send audiences in a tailspin, but the fact that two major surprises follow it secures A Simple Favor as one of the most plot-twisty movies of the year.","url":"https://www.bustle.com/p/the-a-simple-favor-twist-is-so-wild-itll-leave-your-head-spinning-11920460"}
