{"authors":[],"date_download":"2018-10-30 01:10:19","date_modify":"2018-10-30 01:10:19","date_publish":"2015-11-26 00:00:00","description":null,"filename":"data/vaneerConsumption/TheAlienNationonItsWay.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_11_the_alien_nation_on_its_way_1540861819.html","title":"The Alien Nation on Its Way","title_page":"The Alien Nation on Its Way","title_rss":"NULL","source_domain":"americanthinker.com","text":"The Alien Nation on Its Way\nThe Obama administration wants to let in a large number of Syrian refugees. It varies from 10,000 to 100,000, but since the truth is not in our president, those are probably just waypoints to an unlimited migration from the Middle East – i.e., the numbers are gruberfacts, chum for the chumps. Liberals, which means the Democratic Party, are wailing about the responsibility America has to welcome these refugees, driven from their homes by the winds of war. We are a nation of immigrants, and it is our duty to welcome this next wave. If we don't, we are bigots.\nWe know a lot about liberals. They give things away. They are so concerned with whatever problem they identify that they are passionate about giving away what you have built to, as they think, deal with it. It is not that they are simply misguided. If that were the case, they would welcome these refugees into their homes and neighborhoods. Where their kids played pick-up football, there would now be a mosque, with the muezzin calling the faithful to prayer five times a day, every day. Their girls would be attacked if they go scootering uncovered from head to toe or walking in their bathing suits to somebody's swimming pool. Their kids' schools would be disrupted for Muslim foot-washing, closed for Muslim holidays, and attacked for observing Christian and traditional American holidays. This would all be part of the gorgeous mosaic in which they would gladly participate. Not. They never expect to see any of these refugees. They are going to be somewhere else while they congratulate themselves on their open-mindedness. Liberalism can liquidate a society. It cannot build one. The Syrian refugees are an opportunity for liberals to push further toward liquidation of the American Experiment. That is the result, but we still have to articulate the conservative argument: why is it a bad idea to welcome a migration of Muslims into America? Conservative resistance to this is characterized by liberals as bigotry. We know it isn't that. So what is it? The problem is that Islam is a culture alien to the culture of America. Ours is a culture that has been built up: over 3,500 years in terms of Judaism – i.e., the Ten Commandments;\nover 2,000 years in terms of Christianity;\nover 500 years in terms of Protestantism;\nover 300 years in terms of the Scottish Enlightenment – i.e., the primacy of the individual over the state;\nover 250 years in terms of America itself, of liberty and constitutional republicanism, of the rights of minorities in the face of the majority. We are the heirs: of very specific conceptions of mankind and our unalienable rights;\nof very specific relationships between the individual and the state;\nof very specific Christian ideas of what we owe each other and how we treat each other – the golden rule, love thy neighbor as thyself;\nof very specific ideas of the separation of church and state. The Enlightenment split into two streams of thought. In the Scottish Enlightenment, to which the Founding Fathers were heirs, the individual comes before the state. In the French Enlightenment, the state is the highest expression of humanity and comes before the individual. This is the wellspring of fascism and, really, communism. So, while America is part of Western civilization, we are a unique part. We have a distinct heritage and a distinct culture. Islam is alien to that culture. It is based on dominance, not equality, within society and aggression toward and death for nonbelievers. It is a philosophy of constant war, of jihad against the infidel. It is a political philosophy that guides every aspect of society and the state. There is no right of the individual and no separation of church and state. Because it is based on a divine and perfect revelation – the Koran – organizing a society upon the desires of its members – democracy – is blasphemy. So the question for conservatives, who expect to live with the consequences of our decisions as liberals do not, becomes…is it wise to bring in huge numbers, or really any number, of people from an alien culture whose allegiance is to that culture? Conservatives say \"no.\" Why? Let's examine the modality of a Muslim in America, a Muslim with allegiance to Islam. We are engaged in a war with Arab Islam. Our president refuses to accept this, but as Leon Trotsky said, \"you may not be interested in war; but war is interested in you.\" And that is where we find ourselves, even if Obama chooses to, or pretends to, live in fantasyland. When did that war start? In 1996, with Osama bin Laden's fatwa \"Declaration of War against the Americans Occupying the Land of the Two Holy Places.\" This was followed in 1998 by a second fatwa, \"Jihad Against Jews and Crusaders,\" signed by the World Islamic Front, of which bin Laden was a member. So we have been warned by Arabs in proper Muslim fashion. The courtesies have been observed. We in the West are used to dealing in terms of nation-states, to which their citizens owe allegiance. Nation-states are divided into religions, or religious sects. Islam is not that way. Islam consists of the collective of believers, the ummah, which may be divided into nation-states but for whom the primary identity is Islam itself. No one person speaks for Islam, but we cannot be befuddled by that. We have to understand the claim to universality that Islam has on its adherents. The Muslim owes allegiance to Islam, not to a nation-state. And he is proud of this fact; it is his identity. So the situation we face in this country is that Arab Islam in the Middle East, which is where Islam began, is conducting jihad against America; that the refugees are part of the Arab Islamic ummah; and that their religion tells them that it is permissible, even admired, to lie to enemies – us – in order to advance the Muslim jihad. In terms of the ummah, we are being asked to open our doors to soldiers of jihad, not to civilians who seek a better life on American terms. Liberals talk in terms of moderate Muslims. But what does that mean in the context of embracing our society? It is liberals transferring their values on another culture. It is – there is no other word for it – racism at its starkest. It is seeing another people as so inferior that we should not take their openly expressed ideas and objectives seriously. Conservatives, on the other hand, treat Muslims with the respect of believing what they say. We can say that all other immigrants before the current era came to America to join our culture, to join themselves to the American adventure. They may have kept their own traditions at home and in their neighborhoods, but in the larger world, they came to be part of America. But what would that process be for a Muslim? Sayyid Qutb, the theoretician of the Muslim Brotherhood, in his extremely influential book Signposts on the Way, wrote of the corruption of American society in 1949(!), when he lived for a time in Colorado. The mores of teenagers dancing and the music they were dancing to were unbearably degenerate to Qutb, when for us that was a halcyon time in a halcyon place. How would a Muslim see American culture today? As the abominations of… men marrying men and women marrying women\nsex in our entertainment\nobservance of a hated religion\nwomen acting like harlots by going out disrobed in public\nslaughtering of animals in an unclean way\nequality and independence of women\nfreedom of thought and action America is the Great Satan. In Islam, Satan is a seducer. That is what American, Western culture represents to Islam: a seduction away from the true path to Paradise. By being refugees, they are coming with their culture intact. They are not, as have other immigrants, deciding that their culture, their society, is inferior, is failing, and consequently, at great personal risk and effort, abandoning that society, all that is familiar, to make their way in the New World. This wave of refugees is coming expecting not to make its way, but to be served. Muslims are coming not to join our culture; they disdain it. They don't admire us; they are disgusted by us. And let's not confuse ourselves. To the extent that we are at war with Islam, it is the Islam of Arabia. Even in Iran, Islam is layered on the native culture, not a part of it. There may be 1.5 billion Muslims, but they are not at war with us, nor we with them. Lastly, as we seek to preserve our own culture, which we have every right, even a duty to do, from this unique episode of our attempted colonization by an alien nation that seeks to dominate us, not be schooled by us and join us; and as liberals engage us with, as they imagine it, a superior moral tone, ask the question that Rush Limbaugh asked on the air last week. If it were the case that these immigrants always voted overwhelmingly Republican, what would the position of the liberals be?","url":"https://www.americanthinker.com/articles/2015/11/the_alien_nation_on_its_way.html"}
