{"authors":["Ashley Rey"],"date_download":"2018-10-31 00:00:06","date_modify":"2018-10-31 00:00:06","date_publish":"2018-10-30 23:47:08","description":"Hold onto your hats, because the trailer for black-ish's Prince tribute is on the way and it looks amazing. Sure, it's been a little more than two years since Prince's passing and his conversion to \"world of never-ending happiness.\" But after…","filename":"data/vaneerConsumption/TheblackishPrinceEpisodesTrailerShowsHowPerfectlyTheSeriesWillPayTributeToTheMusicLegendEXCLUSIVEVIDEO.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/30/6937aec5-0c85-454e-afb3-9dfb43f7ec34-d4fe40a4-864d-411e-80a4-185fca15a2c1.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-black-ish-prince-episodes-trailer-shows-how-perfectly-the-series-will-pay-tribute-to-the-music-legend-exclusive-video-13042296_1540944006.html","title":"The 'black-ish' Prince Episode's Trailer Shows How Perfectly The Series Will Pay Tribute To The Music Legend - EXCLUSIVE VIDEO","title_page":"The 'black-ish' Prince Episode's Trailer Shows How Perfectly The Series Will Pay Tribute To The Music Legend — EXCLUSIVE VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Hold onto your hats, because the trailer for black-ish's Prince tribute is on the way and it looks amazing. Sure, it's been a little more than two years since Prince's passing and his conversion to \"world of never-ending happiness.\" But after looking at the exclusive clip for the ABC hit's 100th episode, you'll agree that the Johnson crew is right on time.\nAccording to ABC, the official Prince tribute is scheduled to premiere Nov. 13, and as aforementioned, the trailer definitely shows that it's one not to miss. The episode is centered around the Johnson twins, Jack and Diane (played by Miles Brown and Marsai Martin, respectively), and their unfamiliarity with the \"Purple One.\" Of course, once the Johnson family patriarch Dre (played by Anthony Anderson) learns that his children know the least bit about Prince's impact on pop culture, as well as the entire free world, he goes to extremes to give them the ultimate crash course in everything Paisley Park.\nOh, and it's quite the family affair, too. Everyone from Tracee Ellis Ross' character Rainbow, to the twin's older sibling Zoey (Yara Shahidi) put on their best purple gear to give Prince one of the greatest tributes hitting primetime television to-date. And from the exclusive clip below (as provided by ABC), you'll see that the entire cast meant business.\nABC on YouTube\nMore to come...","url":"https://www.bustle.com/p/the-black-ish-prince-episodes-trailer-shows-how-perfectly-the-series-will-pay-tribute-to-the-music-legend-exclusive-video-13042296"}
