{"authors":["Chris Tognotti"],"date_download":"2018-10-30 23:27:22","date_modify":"2018-10-30 23:27:22","date_publish":"2014-08-13 18:11:18","description":"The clash of money and politics is a huge presence in American life. And despite major corporations having vastly greater resources than all but a few individuals ever will, the barriers stopping them influencing major party politics are flimsy at…","filename":"data/vaneerConsumption/TheBuyPartisanAppRevealedThePoliticsOfMyFridgeAndItWasDisturbing.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/bd19ce44-a093-46b3-843e-081678b4f5f6.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35619-the-buypartisan-app-revealed-the-politics-of-my-fridge-and-it-was-disturbing_1540942042.html","title":"The BuyPartisan App Revealed The Politics Of My Fridge, And It Was Disturbing","title_page":"The BuyPartisan App Revealed The Politics Of My Fridge, And It Was Disturbing","title_rss":"NULL","source_domain":"bustle.com","text":"The clash of money and politics is a huge presence in American life. And despite major corporations having vastly greater resources than all but a few individuals ever will, the barriers stopping them influencing major party politics are flimsy at best. Which is why, at the very least, it's nice to keep track of where your money might be going. That's the concept behind BuyPartisan, a new app that reveals the political contributions behind your favorite products, letting you know which party — Democrats or Republicans — are most likely to reap the reward of your purchase.\nIt's a clever idea, and one that's bound to get a lot of play. Beyond even the political aspect of the app, the simple act of scanning a product and finding out the company that's producing it is a liberating perk. Moreover, the information you get goes beyond simple, total political donations — you get a breakdown of the donations of the company's CEO, as well as its employees.\nAccording to InTheCapital, the data is culled from the Sunlight Foundation, the Institute for State Money in Politics, and the Center for Responsive Politics. The entire thing is the brainchild of former Capitol Hill staffer Matthew Colbert.\nEven better, the app is free to download, and if you've got any kind of consumer goods lying around your house, you can start scanning right away. All it needs is a barcode. Some products may not have information available, but a surprisingly diverse array do — won't you come look through my refrigerator?\nCoca-Cola: Republican\nThis was the first things I scanned, and honestly, it didn't come as much of a surprise. Coca-Cola is a huge, transnational corporation, and for some reason I sort of assumed there'd be a whole lotta red on their donation history. (For the record, I don't drink the stuff, myself.)\nAs you can see, however, Coca-Cola CEO Muhtar Kent is somewhat more equitable with his personal donations — just one percent more to the GOP than the Democrats.\nTofutti Vegan Cream Cheese: Democratic\nWell, that's a relief. It would've been a potentially fatal shock to my system to learn that my preferred brand of tofu-based cream cheese, of all things, was secretly a majority money-funnel to the Republican Party. This is an interesting distribution, though — only four percent more to Democrats than Republicans, but a big 20 percent chunk paid out to \"other.\"\nThis is echoed curiously in the donations of Tofutime, Inc. CEO David Mintz — no donations to Democrats, a smidge to Republicans, and a whopping 80 percent to \"other.\" This is OK with me.\nCasa Sanchez Salsa Roja: Republican\nNO! Not the salsa! This came as something of a surprise, though I can't rightly say why — I had no real insight into the political leanings of the Casa Sanchez company, owned and operated by the same Sanchez family that founded it in San Francisco back in 1924.\nI guess I was suckered by some of the stated selling points of their products, which I typically associate with liberalism — light on preservatives, and free from gluten and GMOs.\nBut it just goes to show you that business is business, and politics are politics. Casa Sanchez donates 20 percent more to the Republicans than the Democrats. And, in a way, this highlights the conflict inherent to this exercise — am I really going to change my favorite brand of salsa over this? Should I? Maybe I should — vote with your dollar, the free market conservatives always say — but I'm not sure if I will.\nSan Pellegrino Aranciata Rossa: Democratic\nAnother welcome relief, because really, this is the only soda-type drink I'm partial to. Call me a snob if you will, but there's nothing like blood orange mixed with a little carbonation. San Pellegrino donates five percent more to the Democrats than the Republicans.\nThough, if you take their employees' habits into account, things get a little more red — they donate to the GOP nearly twice as much as the Democrats.\nNear East Rice Pilaf: REALLY Republican\nWell, damn. I guess I was asking for it — it's better to make these things from scratch anyways, but I'm so lazy. Near East gives generously both to Republicans, as well as \"other,\" but Democrats shouldn't expect too much.\nJust 11 percent of Near East's donations end up with the Democrats, compared to a staggering 64 percent to the Republicans.\nImages: Chris Tognotti/Buy Partisan App","url":"https://www.bustle.com/articles/35619-the-buypartisan-app-revealed-the-politics-of-my-fridge-and-it-was-disturbing"}
