{"authors":["David Gorn","Julie Cart","Felicia Mello"],"date_download":"2018-10-30 23:28:00","date_modify":"2018-10-30 23:28:00","date_publish":"2018-06-20 18:32:00","description":"On the same day President Trump ordered an end to the practice of separating migrant families at the U.S. border, court action commenced in the federal lawsuit over California's \"sanctuary\" policy.","filename":"data/vaneerConsumption/ThebattleoverCaliforniassanctuarylaws.json","image_url":"https://calmatters.org/wp-content/uploads/banners-2-e1529540685624.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_trump_california__1540942080.html","title":"The battle over California's 'sanctuary' laws","title_page":"The battle over California's 'sanctuary' laws | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Speaking against the backdrop of a busy morning freeway, California officials this morning reaffirmed their opposition to a Trump administration proposal to roll back automobile fuel efficiency standards—noting the state had just filed 415 pages of comment strenuously objecting to the federal plan.\nThat plan would unravel two instruments critical to California’s climate change policies: The previously-agreed upon benchmarks for car makers to roll out vehicles that consume less gas, and the legal right of the state to set its own auto emissions standards.\nThe federal rules change, which is not yet finalized, calls for freezing fuel-efficiency standards in 2020 at an average 35 miles per gallon. California had led negotiations that established more ambitious cuts and those rules were formalized in the waning days of the Obama administration.\nThe officials—Gov. Jerry Brown, Attorney General Xavier Becerra and Air Board chairwoman Mary Nichols—were equally dismissive of the decision to eliminate California’s longstanding waiver, which allows state officials to set car emissions standards that are more stringent that those imposed by federal regulators.\nNichols provided the morning’s most comprehensive takedown of the federal government’s justification for changing course, saying, “What they are proposing not only doesn’t make sense from its own logic, it’s poorly argued, poorly organized, not based in fact and illegal.”\nIn announcing the rules changes, the federal Environmental Protection Administration and the National Highway Transportation Administration argued that, among other things, the lighter vehicles required to meet the fuel standards would make American drivers less safe. That analysis has been widely criticized, and runs counter to California’s own review.\nGov. Brown noted that even as American automobile manufacturers are seeking to arrest the steady march toward cleaner cars, China is growing its market for electric cars and battery technology. He said that the administration’s policy will negatively impact “jobs and American power in the world.”\nBrown chided Trump for rollbacks that he said “jeopardizes the health of millions and will cost billions at the pump. Wrong way to go Donald. Get with it. Bad.”","url":"https://calmatters.org/articles/trump_california/the-battle-over-californias-sanctuary-laws/"}
