{"authors":[],"date_download":"2018-10-30 00:55:13","date_modify":"2018-10-30 00:55:13","date_publish":"2017-01-19 00:04:30","description":null,"filename":"data/vaneerConsumption/TheBenjaminLobbyBarandLoungeatWashingtonsTrumpInternationalHotel.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/01/Atrium.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860913.html","title":"The Benjamin Lobby Bar and Lounge at Washington’s Trump International Hotel","title_page":"The Benjamin Lobby Bar and Lounge at Washington’s Trump International HotelThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"All too many hotel bars are little more than shoddy afterthoughts, soulless spaces where hotel guests, and almost no one else, may grab a quick drink or two before setting off for — or after returning from — somewhere more interesting. Lobby bars in particular often seem to have been hurriedly plunked down in the middle of a space never intended for them, the alcohol equivalent of slapdash seasonal produce stands set up along a busy roadside. There are, however, happy exceptions.\nOne thinks of the Oak Bar, in palmier days, at New York’s Plaza Hotel or the St. George Bar at Brown’s Hotel in London before that noble old hostelry was “renovated” almost beyond recognition. Then there’s the more contemporary éclat of the bar at the Prince de Galles hotel in Paris, although, somehow, the latter doesn’t seem quite itself minus the permanent cloud of cigarette smoke that hovered over it before France’s smoking ban went into effect. Washington, D.C. has at least two long-established hotel bars of character, the Off the Record at the Hay-Adams, just across Lafayette Square from the White House, and the Round Robin bar at the Willard Intercontinental a few blocks away, both of which I have described in past issues of The American Spectator.\nNow, a short distance down Pennsylvania Avenue from the Willard, there’s a new landmark hotel bar in town. It is a lot bigger, brasher, and less traditionally clubby than my usual hotel bar ideal, but it’s very much in step with the times: thoroughly in keeping with what could be a dawning, Trump-era revival of America’s Gilded Age, with an accent on conspicuous consumption and not-necessarily-vulgar excess.\nThe recently opened Trump International Hotel is housed in a structure I happen to be very familiar with: the Old Post Office Building. Originally dedicated to the memory of Benjamin Franklin, who served as America’s first Postmaster General and whose statue still stands in front of it, the building is an outstanding example of one of Victorian architecture’s less-than-outstanding genres: a nine-story-high tribute to the bulky, gloomy Romanesque Revival style. Without getting too technical, let’s just say that, from the outside, it looks a little like the Addams Family mansion writ large and built out of stone rather than wood, topped off with a rather awesome clock tower, in this case mercifully free of bats.\nBut don’t let the grimly imposing facade fool you. Once inside, the Victorian gloom is dispelled by a son-et-lumière burst of light, color, and bustle. The building is a vast, hollow square and the Benjamin Bar & Lounge fills most of the resultant atrium space, with polished marble floors, well-arranged clusters of plush, very comfortable lounge chairs, and an enormous bar that can handle big crowds without making you feel like a very small part of a very large mob. This is thanks to the symmetrical design of the bar which uses right-angle indentations to break up the space into segments on a human scale, while the nine-story-high ceiling absorbs noise rather than bouncing it back. Even when the space is filled to capacity, you don’t have to shout to be heard by your guests, and the rather nondescript piped-in music is kept to a non-intrusive level.\nEnormous crystal chandeliers hang from white-painted steel support girders that predate the building’s reincarnation as a luxury hotel and are preserved for historical as well as structural reasons. The contrast of the starkly functional girders and the showy chandeliers actually works, lending an idiosyncratic charm to the space. There’s no place else quite like it in town.\nBack in the 1980s, long after the building had been shut down as a post office, the government was leasing most of it as office space to the National Endowment for the Arts and the National Endowment for the Humanities. It was dingy and run-down but picturesque and, as a member of the Humanities Council — in effect the board of directors for the Humanities Endowment — I was a frequent visitor. The Humanities Council in those years did some very good, very responsible work. To cite only one example, the committee I served on authorized the initial grant that made it possible for Ken Burns to start work on his magnificent documentary series on the Civil War. Meanwhile, on the other side of the atrium, the Arts Endowment subsidized such dubious masterpieces as “Piss Christ” and the like. Gazing across the atrium at the Arts Endowment offices during one of my visits for a Humanities Council meeting, I remember feeling like a monk in a monastery overlooking a particularly louche Club Med location.\nIn those days the atrium was occupied by a rather grubby food court with a few tatty little souvenir and variety concessions encircling it. It struck me more than once that the building, and particularly the atrium space, had great potential if only somebody with enough confidence, capital, and clout would take it over. At the time that seemed highly unlikely and not long afterward the endowments both packed up and moved to more conventional, practical quarters elsewhere. The building itself went comatose, and stayed that way for years. Phantom projects were proposed only to evaporate or to be strangled in government red tape. Walking by the melancholy old pile, its darkened windows like a dead man’s eyes, one hoped — without really believing — that somehow, someone could bring it back to life.\nAnd someone finally did. While Donald Trump had never struck me as the knight-in-shining-armor or Prince Charming type, he outbid all competitors and hammered out a costly, painstakingly-detailed long-term leasing agreement with the government’s General Services Administration. He then proceeded to come in on schedule and at cost with a massive renovation that has preserved the historical integrity of the building while converting it into an over-the-top luxury hotel. Though never an uncritical fan of The Donald — flamboyance just isn’t my thing — I can’t think of anybody else who could have cut the deal, got the job done, and put together a smoothly professional staff and management team that landed running — all while campaigning for president during much of the same time.\nPrices are high but so are the standards. And your servers seem to take genuine pride in their work, which is always performed with a welcoming smile. On a recent evening I enjoyed several scotch and sodas and some clams from the raw bar menu while engaged in a pleasant conversation with AmSpec founder and editor-in-chief Bob Tyrrell and his delightful wife, without question the most charming and beautiful former prosecuting attorney I have ever had the good fortune to know. The place was packed but we were able to chat without any strain thanks to the excellent acoustics.\nBe warned. You won’t find any bargain basement prices at the Benjamin Bar and Lounge: a bottle of Tokai Essencia from Hungary, admittedly one of the noblest dessert wines in the world, will put you back $2,250. But some of the simpler cocktails start at about $20. And anyway, as somebody once said, if you have to ask what it costs you probably can’t afford it. On the other hand, if you can afford it, it’s a unique Washington experience you won’t want to miss out on.\nI’m also pretty sure that Ben Franklin, ever the savvy entrepreneur — among other things, he was the first American to promote vodka as a healthy, happy addition to our national liquor list — would appreciate the splashy way his new namesake bar has brought a moribund Pennsylvania Avenue landmark bubbling back to life.","url":"https://spectator.org/the-benjamin-lobby-bar-and-lounge-at-washingtons-trump-international-hotel/"}
