{"authors":[],"date_download":"2018-10-30 14:17:22","date_modify":"2018-10-30 14:17:22","date_publish":"2016-10-31 00:00:00","description":null,"filename":"data/vaneerConsumption/TheBillandLorettaShow.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_10_the_bill_and_loretta_show__1540909042.html","title":"The Bill and Loretta Show","title_page":"The Bill and Loretta Show","title_rss":"NULL","source_domain":"americanthinker.com","text":"The Bill and Loretta Show\nWho is responsible for politicizing the FBI investigation into Hillary Clinton's off-the-books email server? Bill Clinton. The moment he bullied his way onto Loretta Lynch's plane in Phoenix and she allowed him to stay, the investigation was tainted. Clinton most likely promised Attorney General Lynch that if she chose not to convene a grand jury, Hillary would keep her on as attorney general. Lynch presumably capitulated. Thinking back to Comey's July press conference, it is clear that he had concluded that Clinton had indeed broken numerous laws regarding the handling of classified material and national security. He laid out so many violations that his decision not to recommend she be charged shocked the nation. He said he could not prove \"intent.\" Hmmm. It was obvious from the outset that her private server was set up to shield from any official oversight her scheme of selling access to State Department favors for huge sums of money via her Foundation. Republicans were furious that she was not being held to the same standards as others who have been prosecuted for far less. Democrats were relieved that their chosen presidential candidate would no longer have a possible indictment hanging over their party. Republicans accused Comey of partisanship. Democrats praised his lack of it. But Comey seemed almost angry at the time, as though he had been ordered by someone to do what he did. Had Lynch told him that no matter what he found, she was not going to move forward with a recommendation to indict? Perhaps. Did Obama tell him to do what he did because he knew he would be found to have lied when he said he did not know she used a private server? Maybe.\nThe more people looked into the machinations of the investigation, the more it seemed like a sham from the start. Immunity was granted to far too many people involved. At least one of Clinton's aides pleaded the Fifth. Devices were allegedly destroyed. Clinton herself was never interviewed at all until a few days before Comey gave his press conference. It was a short interview, and she was not put under oath! No legal scholars could explain or defend these apparent facts. Rumors are that many of the agents who actually investigated were enraged at Comey's decision not to recommend she be indicted, that they are about to revolt, to leak, or to resign. Truth or gossip? Then came all the WikiLeaks revelations and the news that Hillary raised $675K that Terry McAuliffe then gave to the \"campaign\" of Andrew McCabe's wife. McCabe was the deputy FBI agent supervising the investigation into Clinton's email scandal. The Clintons like to cover their bases. If their Lynch-pin failed, they had McCabe in their pocket. The Clintons have a long history of playing hardball without concern for who gets hurt as long as they retain their power and wealth. Many reputations have been sullied throughout this entire episode so far, some deservedly, some probably not. Comey's letter to Congress on Friday to notify them the investigation was being reopened was a shock to everyone. Then the news that it was due to thousands of \"pertinent\" emails on Anthony Weiner's computer gleaned during the investigation into his perversions seemed a second shock. That computer had not been turned over previously? Six hundred and fifty thousand \"pertinent\" emails on Weiner's computer! Aside from the insertion of Anthony Weiner into the big picture, there are the thousands of WikiLeaked emails of John Podesta and the undercover videos of James O'Keefe, all of which prove beyond a shadow of a doubt that the Clinton machine is as sleazy as any criminal enterprise ever brought to light. The Democrats can howl all they want about how these emails and videos were obtained, but that does not change the facts revealed. These are people who should never again get close to the White House. And more is coming, say Julian Assange and James O'Keefe. We know that the DOJ is staffed almost entirely with Democrats and that the poltical leadership put their politics above the law. Eric Holder did, and so does Lynch (she pleaded the 5th this past week when asked about the administration's cash payment to Iran). This is a Justice Department that does not seek justice; it seeks only to protect the president and his radical agenda. Knowing this, and knowing that the fix was in with Lynch after Bill Clinton corrupted the investigation, Comey perhaps felt he had no choice but to go public with the news of a revitalized case. What if the FBI really is as non-partisan as it is meant to be and, to best serve justice and the law, Comey's only choice was to do what he did on Friday? What if Comey believes the DOJ to be so compromised that he had to go around it? What if he knows something about Clinton's behavior that is so serious that he knows she will be impeached if elected? Is it possible that Comey is risking his reputation in order to save the country another years-long Clinton-induced legal nightmare? This just might be the case. More news seems to break by the hour, but Comey, disparaged first by the Republicans and now by the Democrats, may just be the hero of the day if Hillary Clinton is defeated and the country is spared years of grim political misery.","url":"https://www.americanthinker.com/blog/2016/10/the_bill_and_loretta_show_.html"}
