{"authors":["Jack O'Keeffe"],"date_download":"2018-10-31 01:48:20","date_modify":"2018-10-31 01:48:20","date_publish":"2018-09-14 07:00:52","description":"BoJack Horseman is a show about the entertainment industry, so it makes sense that the show's supporting cast is brought to life by some of film and television's most recognizable voices. Season 5's focus on BoJack's new gritty crime drama Philbert…","filename":"data/vaneerConsumption/TheBoJackHorsemanSeason5GuestsStarsAreAllOverTheMapLikeYoudHaveItAnyOtherWay.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/6f4749e2-8461-400c-9a23-9dddd4f37864-bojack_horseman_s05e03_6m19s9087f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-bojack-horseman-season-5-guests-stars-are-all-over-the-map-like-youd-have-it-any-other-way-11903920_1540950500.html","title":"The ‘BoJack Horseman’ Season 5 Guests Stars Are All Over The Map, Like You’d Have It Any Other Way","title_page":"The ‘BoJack Horseman’ Season 5 Guests Stars Are All Over The Map, Like You’d Have It Any Other Way","title_rss":"NULL","source_domain":"bustle.com","text":"BoJack Horseman is a show about the entertainment industry, so it makes sense that the show's supporting cast is brought to life by some of film and television's most recognizable voices. Season 5's focus on BoJack's new gritty crime drama Philbert introduce a variety of new cast members to the show, allowing audiences to play a fun game of \"Whose Voice Is That? Is That Their Voice?? Let's Find Out!\" as they watch the continued self-destruction of television's saddest horse. The guest stars of BoJack Horseman Season 5 are more varied than ever, and feature some popular television stars taking on major season-long roles, and the return of arguably the most popular BoJack Horseman celebrity cameo of all time.\nWhile most guests stars on sitcoms would be unable to stick around to an entire season of a show due to other television or film roles, the fact that BoJack guest stars don't have to appear on set for filming means that the show can feature notable acts that already have a regular television gig. This explains how performers like Brooklyn Nine-Nine's Stephanie Beatriz and Mr. Robot's Rami Malek are able to perform roles that are given a full season-long arc, and showcase the dramatic and comedic chops that may not be associated with the performer's most recognizable roles. Here's who you'll hear in BoJack Horseman Season 5, besides the returning main cast. Spoilers ahead.\nStephanie Beatriz Phillip Faraone/Getty Images Entertainment/Getty Images Stephanie Beatriz plays Gina, BoJack's co-star/love interest who plays BoJack's co-star/love interest on the fictional television show Philbert. The thin line between fiction and real life may be iffy in this relationship, but it also allows BoJack the opprotunity to be a better partner to her than he's been to his past partners. Beatriz is no stranger to comedy, but her role in Bojack shows that she can handle dramatic material just as well.\nRami Malek Emma McIntyre/Getty Images Entertainment/Getty Images Rami Malek plays Philbert Showrunner Flip Mcvicker, who is so blinded by his artistic vision that he seems to be the only person who can't see that Philbert isn't a great show. Malek is most associated with the no-nonsense role of Elliot Alderson on Mr. Robot, making this goofy caricature a welcome change of pace for the Emmy-winning actor.\nHong Chau Matt Winkelmeyer/Getty Images Entertainment/Getty Images Hong Chau, known for her Golden Globe-nominated role in Downsizing, takes one of the largest guest-starring roles of the season, portraying Pickles, Mr. Peanutbutter's new girlfriend. A young, enthusiastic waitress and \"aspiring social media influencer,\" Pickles represents a stark change from Mr. Peanutbutter's last partner, Diane — but is this change for better or worse?\nWhoopi Goldberg Brad Barket/Getty Images Entertainment/Getty Images Whoopi Goldberg, certified EGOT recipient, makes a small appearence in the series as Mikayla, a stork that works for an adoption agency — get it? — and sells Princess Carolyn on their adoption agency before handing her off to someone who is less enthusiastic and is not voiced by EGOT recipient Whoopi Goldberg.\nNatalie Morales Alberto E. Rodriguez/Getty Images Entertainment/Getty Images Star of The Grinder and Santa Clarita Diet Natalie Morales plays Yolanda Buenaventura, Asexual Axolotl and Todd's girlfriend. The two form a bond over their shared identity and the fact that they are asexual but not aromantic, but the jobless, directionless Todd may need to get his life in shape if he wants to find a way to make their relationship work.\nLaura Linney Matt Winkelmeyer/Getty Images Entertainment/Getty Images Following in the footsteps of Jessica Biel, who played a fictionalized version of herself on BoJack Horseman starting in Season 3, Laura Linney stops by the show to portray and exageratted version of herself as she films a new movie in Vietnam and ends up running into Diane while she's visiting the country.\nIssa Rae Theo Wargo/Getty Images Entertainment/Getty Images Insecure's creator and star Issa Rae lends her voice to the role of Diane's therapist, who attempts to help Diane find ways to life a better life following the dissolution of her marriage to Mr. Peanutbutter. Rae has expressed her love of the show in the past, telling The Los Angeles Times, \"It’s supposed to be a cartoon, but it draws you in. It’s dark and so good.\"\nWanda Sykes Rodin Eckenroth/Getty Images Entertainment/Getty Images Comedian extraordinaire Wanda Sykes makes an appearance as the wife of Diane's therapist, a lawyer who works in corporate mediation and enjoys sharing confidential stories of all the famous celebrities they work with. While they have a lot to say about Princess Carolyn, they're forced to speak in codenames as to not break confidentiality.\nJohn Leguizamo Theo Wargo/Getty Images Entertainment/Getty Images Star of stage and screen John Leguizamo plays the role of Yolanda the Asexual Axlotol’s father, who grills his daughter and her boyfriend, Todd, during a family dinner. While Todd may imagine that it won't be heard to relate to his partner's father, the fact that Yolanda's father is an esteemed erotic novelist who wants to talk about sexuality complicates the mater.\nEva Longoria Matt Winkelmeyer/Getty Images Entertainment/Getty Images If Yolanda's erotic novelist father may prove to be difficult for an asexual couple to relate to, Yolanda's mother will prove to be even more cumbersome. Yolanda's mother, voiced by Eva Longoria, is an esteemed star of adult films, a role that Eva Longoria may be familiar with judging by her 2007 video for FunnyOrDie.com, EVA LONGORIA SEX TAPE.\nBobby Cannavale Donald Bowers/Getty Images Entertainment/Getty Images Ant-Man and Will & Grace star Bobby Cannavale plays Vance Waggoner, a movie star whose behavior ranges from the violent to the unexcusable, spouting of sexist and anti-Semitic language and threatening his own daughter with death over voicemail. Naturally, he attempts to stage a comeback and tries to put his past behind him — almost as if Vance Waggoner were a continuation of Cannavale's Master Of None character who was discovered to be harassing women.\nAngela Bassett Frederick M. Brown/Getty Images Entertainment/Getty Images Angela Bassett returns to BoJack as Ana Spanikopita, BoJack's former publicist and romantic partner from Season 3. In Season 5 she takes on the role of publicist for another man with a problematic past, Vance Waggoner. Spanikopita's calculated approach to Waggoner's public rehabilitation doesn't reunite her with BoJack, but it does lead to some confrontations with Diane.\nBrian Tyree Henry Earl Gibson III/Getty Images Entertainment/Getty Images Atlanta star Brian Tyree Henry appears as Cooper, who plays a crucial role in Princess Carolyn's past. Princess Caroline's history comes back to haunt her when she visits her hometown. As a child, she has an affair with Cooper Thomas Rogers Wallace, the son of the family she is a maid for, and ends up pregnant.\nDaveed Diggs Jamie McCarthy/Getty Images Entertainment/Getty Images Daveed Diggs, Tony-winning star of Hamilton, and his distinctive voice appear for a brief scene during Princess Caroline's return to her hometown. He gives voice to Cooper Thomas Rogers Wallace's father, who is also named Cooper Thomas Rogers Wallace, as he attempts to introduce Princess Carolyn into their life and make a plan for his grandchild.","url":"https://www.bustle.com/p/the-bojack-horseman-season-5-guests-stars-are-all-over-the-map-like-youd-have-it-any-other-way-11903920"}
