{"authors":[],"date_download":"2018-10-30 01:10:57","date_modify":"2018-10-30 01:10:57","date_publish":"2018-10-29 00:05:56","description":"The only thing more certain than death and taxes is that, every election cycle, the Democrats will accuse Republicans of “voter suppression.” They inevitably insist that requiring individuals to possess photo identification in order to cast a ballot is a sinister right-wing conspiracy to prevent minorities from exercising the franchise. For black conservatives like Candace Owens, this claim is incredibly patronizing.","filename":"data/vaneerConsumption/TheBiannualVoterSuppressionScam.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/10/1024px-Maggie_Hassan_15510483350-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861857.html","title":"The Biannual ‘Voter Suppression’ Scam","title_page":"The Biannual ‘Voter Suppression’ ScamThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The only thing more certain than death and taxes is that, every election cycle, the Democrats will accuse Republicans of “voter suppression.” They inevitably insist that requiring individuals to possess photo identification in order to cast a ballot is a sinister right-wing conspiracy to prevent minorities from exercising the franchise. For black conservatives like Candace Owens, this claim is incredibly patronizing. It implies that, as she recently put it, “Black people are too stupid to figure out how to get identification.” She is right, of course, but the Democrats dislike voter ID laws for another reason: They depend on fraud to remain viable.\nThe obvious purpose of asking voters to prove who they are and where they live is to prevent fraud. The Democrats claim that voter ID laws are unnecessary because fraud is uncommon. This is nonsense. As Thomas Sowell once put it, “One of the biggest voter frauds may be the idea… that there is no voter fraud.” Yet the Democrats make this claim every election cycle while filing sham lawsuits alleging voter suppression, which is quite rare. Last week, for example, they convinced a New Hampshire judge to halt enforcement of Senate Bill 3 (SB3), a law requiring voters to provide proof of residency. The New Hampshire Union Leader reports:\nThe lawsuit to block the law [SB3] from taking effect was filed last year by the New Hampshire Democratic Party, the League of Women Voters of New Hampshire and individual voters who claim the new registration requirements are onerous and an unnecessary obstacle to exercising their constitutional rights.… The DOJ simultaneously filed an emergency motion with the state Supreme Court.\nIf lily white New Hampshire seems an unlikely location for the suppression of minority voting, it is no illusion. SB3 was passed to prevent fraud by Massachusetts residents who vote in the Bay State and the Granite State. These “Massholes,” as New Hampshirites have long since dubbed them, vote in Massachusetts and are then bused by the Democrats across the state line to exploit New Hampshire’s same-day voter registration law by voting a second time. In 2016, this produced about 5,000 fraudulent ballots, enough to decide the Granite State’s Senate race. Democrat Maggie Hassan “defeated” incumbent Kelly Ayotte by 1,017 votes.\nFortunately, the New Hampshire Supreme Court reversed the lower court’s ruling on SB3, which will make it more difficult for the Democrats to commit fraud in the upcoming midterms. Not that they limit their fraudulent voting schemes to New Hampshire. Another example can be found in Texas, where state AG Ken Paxton is pursuing 30 counts of felony voter fraud against a group funded by a Democratic Party official. The Heritage Foundation maintains a voter fraud database detailing 1,132 proven instances of fraud in 47 states. And no discussion of voter fraud can omit California, where many counties boast more voters than citizens.\nAnd yet the left insists that serious election fraud is negligible and sporadic. In reality, the kind of skulduggery committed in New Hampshire, Texas, California, and the rest of the country has a venerable history in the Democratic Party. In fact, without election fraud, it’s likely that the party would soon go the way of the Whigs. This is, of course, why they scream “voter suppression” every time a state passes a voter ID law or removes dead people from the voter rolls. It is also why the Democrats encourage their allies in academia to produce “research” that supports the party line and ensure that the “news” media give it plenty of coverage.\nA typical example is a study produced by a team of researchers led by Zoltan Hajnal, a political scientist from the University of California. Hajnal et al. were inevitably invited to write about it in the Washington Post. The article assures us that “the science” supports the Democratic Party’s talking points, but is remarkably tendentious for a piece written by disinterested academics. Their first paragraph, for example, questions the integrity of Attorney General Jeff Sessions and his commitment to enforcing the Voting Rights Act. This doesn’t instill confidence that their conclusion about voter ID laws was reached by unbiased research.\nThese laws have a disproportionate effect on minorities, which is exactly what you would expect given that members of racial and ethnic minorities the white-black turnout gap grows from 2.5 to 11.6 when a state adds strict ID laws. The racial imbalance in U.S. voting expands.… Because minority voters tend to be Democrats, strict voter ID laws tilt the primary electorate dramatically.\nAs a rule, researchers tend to be skeptical of studies that fit seamlessly with the claims of politicians. This is presumably what led to a more recent study, “Obstacles to Estimating Voter ID Laws’ Effect on Turnout,” conducted by a team of researchers led by Justin Grimmer from the University of Chicago. They found that the data used by Hajnal et al. were so flawed that they can’t credibly be used to support their conclusions: “These data errors are sufficiently pervasive — across states and over time — that standard techniques cannot recover plausible effect estimates.” In other words, Zoltan Hajnal is the Michael Avenatti of political science.\nWhen the implausible voter ID claims leveled by Democrats and their accomplices meet with an unfriendly reception, their fallback position is that voter rolls are being systematically “purged” of blacks and Hispanics by the states. After the Supreme Court ruled in 2013 that the states no longer had to seek federal permission to do so, many began removing dead, incarcerated, and inactive registrants from their voter rolls. The Democrats insist this is about voter suppression, disregarding the awkward reality that much of it has occurred in states like Maine, New York, and most recently Ohio — not exactly bastions of the old Confederacy.\nThe real issue here isn’t voter suppression. Historically, it is the Democrats who have denied voting rights to minorities. Their major objection to voter ID laws, with its racist implication that minorities can’t figure out how to acquire photo identification, is that they depend on fraud to remain viable. This is why Georgia’s Democratic gubernatorial candidate, Stacey Abrams, openly invites illegal aliens to vote for her. It is why New Hampshire’s Maggie Hassan required double voters from a neighboring state to get her into the U.S. Senate. It was behind the Felons for Franken farce. The Democratic Party is, and always has been, the party of vote fraud.","url":"https://spectator.org/the-biannual-voter-suppression-scam/"}
