{"authors":["Alisha Buaya For Daily Mail Australia"],"date_download":"2018-10-22 23:38:07","date_modify":"2018-10-22 23:38:07","date_publish":"2017-03-10 03:53:38","description":"Tiffany Scanlon has been busy reinventing herself and getting her mind off of her now ex-girlfriend Megan Marx ahead of her upcoming trip to Europe.","filename":"data/vaneerConsumption/TheBachelorsTiffanyScanlonshowsoffRottnestIsland.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/02/3E1F3E6800000578-0-image-a-41_1489113554329.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299576_The-Bachelor-s-Tiffany-Scanlon-shows-Rottnest-Island_1540251487.html","title":"The Bachelor's Tiffany Scanlon shows off Rottnest Island","title_page":"The Bachelor's Tiffany Scanlon shows off Rottnest Island | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"While her breakup with ex-girlfriend and fellow Bachelor contestant Megan Marx was confirmed only days ago week.\nIt seems Tiffany Scanlon, 30, has been busy reinventing herself and getting her mind off of Megan ahead of her upcoming trip to Denmark.\nTiffany took to Instagram to share a saucy bikini picture of herself walking barefoot down a rock formation in Rottnest Island on Western Australia, on Friday.\nScroll down for video\n'Just me in my adventure hat': The Bachelor's Tiffany Scanlon has shared a saucy bikini picture of herself as part of a series to be an ambassador for youth travel company Busabout Tours\nWearing a in a tiny red two piece, The former Bachelor hopeful also donned what she called an 'Indiana Janes' hat, with a pair of dark round sunglasses and holding her mobile phone.\nThe picture is part of a series of bikini snaps recently posted on her social media for her application to be an ambassador for youth travel company Busabout Tours.\nWishing her 105, 000 followers a happy Friday, the Perth-born stunner captioned the post: 'Indiana Janes. Just me in my adventure hat,' and directed them to watch her video submission on YouTube.\nMoving on! Megan (left) confirmed that she a Tiffany (right) had broken gone their separate ways with the latter returning to Perth after announcing she would be travelling to Denmark and around Europe\nLooking trim! The recently single blonde appears to have been busy reinventing herself for the travel gig, while getting her mind off of Megan\nFans of the blonde beauty commented on her post, with many of the complimenting her trim figure.\nOne wrote: 'I like that Indiana Janes!'\nWhile another said: 'Amazing shot & love the texture of the cliff.'\nFan love: She captioned her post 'Indiana Janes. Just me in my adventure hat,' and directed them to watch her video submission for Busabout Tours on YouTube\nForgetting the past? In the video for the ambassador job, the reality TV star failed to mention her quest for love on last year's season of The Bachelor as part of her background\nBut in the video for the ambassador job, the reality TV star failed to mention her quest for love on last year's season of The Bachelor as part of her background.\nIn a bid of shed distance herself from the show, she instead talked about her love of travel and previous experiences as a high school teacher, a safety adviser on a mining site, and as an Emirates air hostess.\nTiffany also showed off the beautiful scenery of Rottnest Island, promoting it as one of Western Australia's best kept secrets.\nHello sea!The picture is part of a series of bikini snaps recently posted on her social media for her application to be an ambassador for youth travel company Busabout Tours\nEarlier in the week Megan Marx finally confirmed that she is no longer with Tiffany.\nIn her reply to a fan who ask the status of their relationship, after followers demanded to know what was going on following weeks of speculation.\n'Tiffany and I have broken up,' she wrote on Wednesday.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299576/The-Bachelor-s-Tiffany-Scanlon-shows-Rottnest-Island.html"}
