{"authors":[],"date_download":"2018-10-30 01:05:17","date_modify":"2018-10-30 01:05:17","date_publish":"2015-09-19 00:00:00","description":null,"filename":"data/vaneerConsumption/TheBuckleyVidaldebatesalloveragain.json","image_url":"https://www.americanthinker.com/images/bucket/2015-09/195252.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_09_the_buckley__vidal_debates_all_over_again_1540861517.html","title":"The Buckley - Vidal debates all over again","title_page":"The Buckley - Vidal debates all over again","title_rss":"NULL","source_domain":"americanthinker.com","text":"The Buckley - Vidal debates all over again\nThe Buckley - Vidal debates in 1968, captured in the new film Best Of Enemies, could have been staged in 2015. The same issues -- sexuality, race, law and order, unpopular wars -- dominated the often contentious confrontations between William F. Buckley on the right and Gore Vidal representing the Left. The age of argument on TV was born with these two extreme individuals, serendipitously joined together by the third rated and financially strapped ABC-TV that took an innovative, chancy -- and potentially disastrous -- move to compete with NBC and CBS, both touting gavel-to-gavel coverage of the Republican and Democratic conventions of 1968.\nABC, in their struggle for audience against the big dogs in convention coverage, ignored conventional wisdom, that TV audiences were to be treated like grown-up morons, by producing ten 90-minute conversations of intellectual banter between two upper crust intellectuals. Buckley was the icon of the conservative movement, as founder and editor of National Review magazine and host of the public television program Firing Line. Vidal, author, playwright and open homosexual, authored the controversial book and movie Myra Breckenbridge featuring the sexual exploits of a flamboyant transsexual. Bill Buckley abhorred the book and movie. Gore Vidal abhorred Buckley's conservative magazine, never referring to National Review by name. The stage was set for fireworks; what ensued was war to the death. The battle lines drawn, the warring parties in top form, the debates were a smash. ABC's ratings soared. Buckley and Vidal rose from being fairly well known to mass media superstars. And passionate television debate was born. Though manifested today in the cacophony of television news emanating from the modern marvels of cable, satellite and online delivery, there is a huge difference. With the proliferation of channels and networks, American viewership of heated debate has been torn asunder, unlike 1968 when viewers were tuned to only one of three channels. The film omitted that understanding Bill Buckley's brand of conservatism required knowledge of his Catholicism, a dimension of his political view of the world. It also elected not to present one of Buckley's wittiest replies. When asked by Dick Cavett what he would have done had he won the Republican nomination for mayor of New York City, Buckley replied: demand a recount. Coincidentally, Vidal ran for office too, and failed. While Buckley offered a witticism in defeat, Vidal demonstrated his bitchy side by developing a life-long grudge against Bobby Kennedy for losing, though it is not clear why. Vidal was a prolific writer, as was Buckley, yet the film fails to mention Buckley's tomes, including the seminal God And Man At Yale, while displaying and touting several of Vidal's. But he directors compensated by briefly showing Buckley playing the harpsichord. I witnessed his performance in 1990 and dined with him beforehand. I feel his obsession with the ancient instrument, the forerunner to the piano, is symbolic of his political philosophy: stay with what works.","url":"https://www.americanthinker.com/blog/2015/09/the_buckley__vidal_debates_all_over_again.html"}
