{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-23 02:35:48","date_modify":"2018-10-23 02:35:48","date_publish":"2016-01-11 14:57:17","description":"He popped the question just last month and it seems wedding planning will soon be on the agenda for former Bachelor Sam Wood, 35, and his new fiancée Snezana Markoski, 35","filename":"data/vaneerConsumption/TheBachelorsSamWoodsaysheandfianceSnezanaMarkoskiwillwedwithin2years.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300AA2C600000578-0-image-a-63_1452519563586.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393899_Sam-Wood-reveals-fianc-e-Snezana-Markoski-planning-immediate-wedding-two-years_1540262148.html","title":"The Bachelor's Sam Wood says he and fiancée Snezana Markoski will wed within 2 years","title_page":"The Bachelor's Sam Wood says he and fiancée Snezana Markoski will wed within 2 years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He popped the question just last month and it seems wedding planning will soon be on the agenda for former Bachelor Sam Wood and his new fiancée Snezana Markoski.\nThe gym owner, 35, revealed to The Daily Telegraph this week that he and his Macedonian-bron girlfriend, also 35, want to tie the knot sooner rather than later.\n'I don't want to have a five-year engagement,' Sam explained to the publication, adding it would be in the next two years.\nScroll down for video\nKeen to seal the deal! Former Bachelor Sam Wood has revealed he and fiancée Snezana Markoski want to tie the knot pretty soon and within the next two years\nTalking about how hard it is to endure a long distance relationship, the fitness fanatic revealed he wants the wedding to take place as soon as possible, saying: 'The whole thing has been a whirlwind so I don't want to wait.'\n'It would be in the next 12-18 months I'd think.'\nSam proposed with a $50,000 diamond sparkler in Tasmania four weeks ago, while the pair were holidaying with her ten-year-old daughter Eve visiting his family.\nAt that stage, they had been together for a six months and the pair shared the happy news on their respective Instagram accounts.\nHis comments conflict with those he told The Sydney Morning Herald at the weekend, with him saying he had 'no idea' when they would tie the knot but would be planning 'later this year.'\nThat's some rock! Sam proposed with a $50,000 diamond sparkler in Tasmania just four weeks ago\nSweet: The pair were holidaying with her ten-year-old daughter Eve and visiting his family\nWhat's the go? His comments conflict with those he told The Sydney Morning Herald at the weekend, with him saying he had 'no idea' when they would tie the knot but would be planning 'later this year'\nThere has been speculation the pair will have a televised wedding, with Sam once again saying they were considering it.\n'I don't know, maybe,' he told the Sydney Morning Herald.\n'It would have to be under the right circumstances, but really it's Snez's decision,' he said of his wife-to-be.\nHe also recently told New Idea his thoughts on letting cameras into their special day.\n'If anyone had asked me three years ago, I would go \"That's the most ridiculous thing I've ever heard,\" but because of what we've been through in the last six months, I don't know, maybe,' he said.\nFor the fans? He also recently told New Idea his thoughts on letting cameras into their special day\n'If it was to be on TV it would have to be done right,' he added.\nSnezana last week, meanwhile, gave their fans a glimpse at the moment Sam proposed, sharing a sweet video of them embracing shortly afterwards to Instagram.\nIn the clip that was set to Jason Mraz's song I'm Yours, the pair cuddle and kiss as she looks shocked and flashes her ring.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393899/Sam-Wood-reveals-fianc-e-Snezana-Markoski-planning-immediate-wedding-two-years.html"}
