{"authors":["Rebecca Patton"],"date_download":"2018-10-31 01:42:24","date_modify":"2018-10-31 01:42:24","date_publish":"2018-09-14 17:10:52","description":"Anyone who's watched BoJack Horseman knows it's a pop culture sponge, with references to everything from Jessica Biel's acting career to Diane's NPR ringtones. And the pop culture references in BoJack Horseman Season 5 are no exception. There are…","filename":"data/vaneerConsumption/TheBestPopCultureReferencesInBoJackHorsemanSeason5SkewerHollywoodPeakTVActorsWithConfusinglySimilarNames.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/f8bad3d4-5723-4ec0-ba85-030f7ec7432c-bojack_horseman_s05e03_15m47s22708f-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-best-pop-culture-references-in-bojack-horseman-season-5-skewer-hollywood-peak-tv-actors-with-confusingly-similar-names-11899479_1540950144.html","title":"The Best Pop Culture References In ‘BoJack Horseman’ Season 5 Skewer Hollywood, Peak TV & Actors With Confusingly Similar Names","title_page":"The Best Pop Culture References In ‘BoJack Horseman’ Season 5 Skewer Hollywood, Peak TV & Actors With Confusingly Similar Names","title_rss":"NULL","source_domain":"bustle.com","text":"Anyone who's watched BoJack Horseman knows it's a pop culture sponge, with references to everything from Jessica Biel's acting career to Diane's NPR ringtones. And the pop culture references in BoJack Horseman Season 5 are no exception. There are television deep cuts and celebrity jabs galore — not to mention all the sight gags. Spoilers ahead!\nAs a primer, Season 5 follows BoJack (Will Arnett) as he stars in the What Time Is It Right Now? show, Philbert, where he plays the titular antihero. However, he realizes as the series goes on that he's terrifyingly similar to his character and consequently develops an opioid addiction. The actor also becomes entangled with his costar, Gina (Stephanie Beatriz), which goes south along with his mental state. Mr. Peanutbutter (Paul F. Tompkins) and Diane (Alison Brie), meanwhile, are dealing with their divorce and subsequent lives. Diane continues writing listicles for Girl Croosh, while her ex-husband begins a relationship with a young, enthusiastic pug named Pickles (Hong Chau).\nAnd then there's Todd (Aaron Paul), who stumbles into a cushy office job at What Time Is It Right Now?, breaks up with his asexual girlfriend, Yolanda, and continues to fail up. Princess Caroline (Amy Sedaris) pursues adoption, and tries to juggle her personal and professional lives. But timely pop culture references are sprinkled throughout these storylines, giving some extra added flavor to already savory plot points. Here are the best ones from Season 5:\nEpisode 1 Netflix On the side of the Warbler Brothers building, where BoJack's new show is being filmed, there are movie posters for anthropomorphic versions of Wonder Woman and Crazy Ex-Girlfriend.\nIn his job interview at What Time Is It Right Now?, Todd tells the armadillo who's interviewing him, \"I was also the director of a Star Wars movie, but they fired me over 'creative differences.'\"\nBoJack learns that he has to do a nude scene for Philbert, and he calls Todd to try and convince the show creator to change his mind. Todd tells BoJack, \"In my experience, I've found it's best to shoot straight — in the boardroom and on the driving range.\" While it's not a straight translation, the syntax is similar to Crooked Media's Jon Lovett, who often says that he's \"a straight shooter, widely respected on both sides.\"\nAt a party at BoJack's house, the horse tells the following joke: \"So then Aaron Eckhart says, 'If that's Ansel Elgort, then who's Alden Ehrenreich?' And then I said, 'Gesundheit!'\"\nEpisode 2 Netflix Each season, Diane has a new NPR-themed ringtone. This time, it's from Wait Wait... Don't Tell Me! \"I'm Peter Sagal!\" her phone chimes happily. \"Don't wait wait — do answer your phone!\"\nDiane goes to Vietnam, but she accidentally stumbles onto the set of Laura Linney's new movie. \"It's about a recently divorced woman who comes to Vietnam to find herself!\" the hotel clerk tells her. At the end of the episode, Diane returns home on AmeriCrane airlines and finds she's sitting next to none other than Linney herself.\nEpisode 3 Netflix Mr. Peanutbutter and his new girlfriend, Pickles, have a good rapport and ask each other questions like: \"Are you the umlaut in Chloë Sevigny's name right now? Because I don't know why you're here, but I'm glad you are.\"\nPickles and Mr. Peanutbutter are listening to a podcast in the car when they realize Diane is the host. They change to a radio station, where the announcer says, \"Coming up, we've got a brand new single from Twenty One Pilots!\" \"Ew, back to the podcast,\" Mr. Peanutbutter says.\nTodd meets his girlfriend Yolanda's parents for the first time, but they don't realize that the couple are asexual. To make things more awkward, Yolanda's father is an erotic novelist, and her mom is a porn star. Audiences learn that she was in every porn version of a John Hughes movie, including Sixteen Cans, Titty in Pink, and Penis Bueller Gets Off.\nYolanda's mom realizes Todd's secret and comes into his room to ask more about his lifestyle. \"Asexualize me like one of your French girls, Todd!\" she begs him.\nEpisode 4 Netflix A celebrity named Vance Waggoner (Bobby Cannavale) is exposed as being an anti-Semite and domestic abuser. On his apology tour, he has his \"good friend\" Stellan Skarsgård stand with him at the podium for support.\nThe We Forgive You Awards take place, where Megyn Kelly and Mark Wahlberg are being pardoned. Arnold Schwarzenegger also appears as a four-time honoree.\n\"People do listen to me all the time,\" BoJack tells Princess Caroline. \"One time I tweeted, 'RIP David Bowie,' and now everyone still thinks he's dead.\"\nIn an attempt to prove he's tough enough to co-star in Philbert, Mr. Peanutbutter attacks two photographers. However, in doing so, the actor accidentally fixes one of the photog's crossed eyes. \"My depth perception is so much better now!\" he exclaims. \"I'm going to go watch a Wes Anderson movie and see if I can perceive any depth in it!\"\nEpisode 5 Netflix \"How the hell do they expect me to learn five pages of dialogue in one day?\" BoJack asks Princess Caroline. \"What am I, Young Sheldon?\"\nPrincess Caroline returns to North Carolina to meet with a pregnant woman who's putting her baby up for adoption. In a flashback, audiences see the leg lamp from A Christmas Story in the corner of her childhood living room.\nEpisode 6 Netflix This episode-long monologue takes place as BoJack gives a eulogy for his mother. The celebrity compares his relationship with his parents to the Ted Danson sitcom, Becker. \"I watched the entire run of that show, hoping that it would get better, and it never did,\" he says. \"It had all the right pieces, but it couldn't put them together! And when it got cancelled, I was really bummed out. Not because I liked the show, but because I knew it could be so much better, and now it never would be.\"\nEpisode 7 Netflix The bulk of this episode takes place with Diane's therapist, Dr. Endira (Issa Rae), and her wife, Mary Beth, talking in code about their jobs. \"I'm a therapist!\" Endira tells her spouse. \"A doctor heals, a DJ spins, Jessica Chastain takes whatever gig Amy Adams says no to.\"\nMary Beth, a corporate mediator, repeats this sentiment while she's on the phone with Todd. \"A doctor heals, a DJ spins, Bryce Dallas Howard takes the gigs Jessica Chastain says no to,\" she echoes.\nEpisode 8 Netflix This episode is a pop culture sensory overload, with four different Halloween parties at BoJack's house during four different years and topical costumes from each. 1993 Halloween Party Mr. Peanutbutter goes with his first wife, Katrina. She dresses up like Blossom, complete with a flower hat. Other costumes included Garth and Wayne from Wayne's World, The X-Files, Velma Dinkley from Scooby-Doo, and more. Katrina ends up getting into a conversation with Ben Stein and Tim Allen and becomes fiscally conservative by the party's end. 2004 Halloween Party Mr. Peanutbutter and current wife Jessica Biel are supposed to dress up like Ryan Gosling and Rachel McAdams from The Notebook, but he accidentally dresses up like an actual notebook. The writers get in a few jabs at Biel's career, with lines like: \"Everyone at this party is going to be like, 'Hey, is that Jessica Biel from the upcoming Blade: Trinity? And I'll say my famous Blade: Trinity catch phrase, 'Stop goofing around, Blade!'\" Other costumes at the party included Cast Away, Shrek, Mrs. Incredible, and Space Jam. 2009 Halloween Party Mr. Peanutbutter is dressed up like Zach Galifianakis from The Hangover, and Diane is Baby Björn Borg (a mixture of the baby from The Hangover, the tennis player Björn Borg, and Borg from Star Trek). Costumes from this year include characters from Glee and sexy football players. 2018 Halloween Party This year was punctuated with costumes like a sexy handmaiden from The Handmaid's Tale, Alison Brie's character from GLOW, Jon Snow from Game of Thrones, and Wonder Woman.\nEpisode 9 Netflix \"You look like you've just seen a Ghost in the Shell screening, and you're Scarlett Johansson's publicist!\" BoJack tells his half-sister, Hollyhock (Aparna Nancherla).\n\"This looks super sketchy,\" Hollyhock tells BoJack. \"It looks like where they did the drag race in Grease.\" \"Yeah, it is where they did the drag race in Grease,\" her half-brother responds. \"Where do you think they make movies?\"\nEpisode 11 Netflix \"This case is like the movie Love, Actually,\" Gina's character says in Philbert. \"No leads.\"\n\"Pickles, about dinner tonight,\" Mr. Peanutbutter says. \"Am I any show starring Kyle Bornheimer? Because I have to cancel.\"","url":"https://www.bustle.com/p/the-best-pop-culture-references-in-bojack-horseman-season-5-skewer-hollywood-peak-tv-actors-with-confusingly-similar-names-11899479"}
