{"authors":["Will Martin"],"date_download":"2018-10-30 20:32:16","date_modify":"2018-10-30 20:32:16","date_publish":"2016-12-30 00:00:00","description":"UK stocks have taken off since the vote for Brexit, gaining more than 15% since the days before the referendum.","filename":"data/vaneerConsumption/ThebestperformingsharesontheFTSE100in2016.json","image_url":"https://amp.businessinsider.com/images/563c8b99dd089515498b46e0-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_best-performing-shares-on-the-ftse-100-in-2016-2015-12_1540931536.html","title":"The best performing shares on the FTSE 100 in 2016","title_page":"    The best performing shares on the FTSE 100 in 2016 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"It has been a good year for oil and mining companies. AP Every year, people make and lose vast amounts of money playing the stock markets. Predicting what will happen is notoriously difficult, and this year things were made even harder by the crazy uncertainty that dominated global markets and politics.\nHowever, despite — and in some ways, because of — events like the UK's vote to leave the EU, British stocks had a great year, with the blue-chip FTSE 100 breaking new records for both intraday and closing highs.\nThe index hit a new closing high for three consecutive days to end the year, and finished with a new intraday on Friday, the year's final trading day.\nUK stocks have taken off since the vote for Brexit, gaining more than 15% since the days before the referendum. This may seem like fantastic news for the British economy, but it has largely been driven by the weakness of the sterling since June 23rd.\nThough a weaker pound might seem like bad news for UK stocks, about 70% of the revenue earned by the companies that make up the FTSE 100 is derived abroad, meaning they make more money when sterling is weak. The index is full of mining companies, oil firms, and pharmaceutical giants that use the UK as a base but tend to denominate their assets in dollars.\nIt is largely these miners and oil companies that dominate the apex of the FTSE 100's performance charts in 2016. You can check out the best performers — all of which have gained more than 45% this year — below:\nFigures are accurate as of 9.00 a.m. GMT (4.00 a.m. ET) on Friday, December 30.","url":"https://www.businessinsider.com/best-performing-shares-on-the-ftse-100-in-2016-2015-12"}
