{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-22 23:00:43","date_modify":"2018-10-22 23:00:43","date_publish":"2017-03-16 05:34:45","description":"The Bachelor's Olena Khamula has said it was 'unfortunate' Alex Nation and Richie Strahan's fight 'was captured on camera'.","filename":"data/vaneerConsumption/TheBachelorsOlenahasseenAlexandRichiefightpics.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/03/3E509A6B00000578-0-image-a-10_1489635001509.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318478_The-Bachelor-s-Olena-seen-Alex-Richie-fight-pics_1540249243.html","title":"The Bachelor's Olena has seen Alex and Richie fight pics","title_page":"The Bachelor's Olena has seen Alex and Richie fight pics | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bachelor couple Richie Strahan and Alex Nation are rumoured to be on the rocks after being seen having a public 'argument,' that left the mother of one in tears.\nAnd former Bachelor contestant Olena Khamula has admitted she saw the pictures, although she defended the pair, saying 'every couple fights.'\nThe blonde beauty told Daily Mail Australia about their public spat: 'That was just a little bump along the road.'\nScroll down for video\nWeighing in: Former Bachelor contestant Olena Khamula (pictured) has admitted she saw the pictures of Alex and Richie's fight, but defended the pair, saying 'every couple fights'\n'I saw the pictures come out. Every couple has a fight and unfortunately theirs was captured on camera,' Olena said.\n'But I'm pretty sure that was just a little bump along the road and I think everything is fine with them.'\nThe Ukrainian model added that she still speaks to Alex over social media, but chuckled as she admitted that she doesn't speak to Richie, as it would be 'awkward.'\nClearing the air: The blonde beauty told Daily Mail Australia about their public spat: 'That was just a little bump along the road' (Pictured are Alex and Richie)\nFriends: The Ukrainian model added that she still speaks to Alex over social media, but chuckled as she admitted that she doesn't speak to Richie (pictured on The Bachelor), as it would be 'awkward'\nIn recent weeks, rumours of a split have flamed as since their feud in Perth, Alex and Richie haven't shared any images of one another on social media.\nNW Magazine reported the couple were having a 'huge fight' in public before Alex broke down in front of the cameras.\nNew Idea claims the pair are spending more and more time apart, as they go long-distance with their relationship, with Alex based in Melbourne and Richie based in Perth.\n'Alex's little boy Elijah had spent the weekend with his dad. Usually when this happens, she makes most of her time and heads straight to Perth to see Richie,' a source said.\nNew role! Olena - who is currently dating Rodney Maroun - has just signed on as the face of the Heineken Formula 1 campaign\n'The fact that they both spent the weekend alone is unusual,' the friend claimed.\nOlena - who is currently dating Rodney Maroun - has just signed on as the face of the Heineken Formula 1 campaign.\nThe personality is appearing live on interactive billboards in various cities - including Sydney and Melbourne - to find lucky winners to win a spot at Heineken Saturday at the Australian Grand Prix next week.\nRudimental is set to perform on the day at the Heineken event.\n'I'm definitely very excited to see who the winner will be,' Olena told Daily Mail Australia.\nHelping to chose a winner, she said: 'I'm looking for someone that has a really big and bubbly personality...and we're going to find some talented people.'\nShe added it will be her first racing experience and that she was looking forward to the day.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318478/The-Bachelor-s-Olena-seen-Alex-Richie-fight-pics.html"}
