{"authors":["Bianca La Cioppa For Daily Mail Australia"],"date_download":"2018-10-23 00:13:51","date_modify":"2018-10-23 00:13:51","date_publish":"2016-01-28 13:56:15","description":"Shannan Ponton spent some quality time with his wife Kyle and two children on Wednesday as they arrived in Bali for a family getaway.","filename":"data/vaneerConsumption/TheBiggestLoserAustraliasShannanarrivesinBaliwithwifeKylieandtheirkids.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB0A6800000578-0-image-a-21_1453992099830.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420896_The-Biggest-Loser-Australia-star-Shannan-arrives-Bali-wife-Kylie-two-children_1540253631.html","title":"The Biggest Loser Australia's Shannan arrives in Bali with wife Kylie and their kids","title_page":"The Biggest Loser Australia's Shannan arrives in Bali with wife Kylie and their kids | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He is due to return to the cameras in the coming weeks to commence filming The Biggest Loser Australia.\nBut on Wednesday trainer Shannan Ponton spent some quality time with his wife Kyle and two children - Milla, one, and Maximus, three - as they arrived in Bali for a family getaway.\nWhile walking through Ngurah Rai international airport the 42-year-old showed off his muscular figure as he dressed in a tight-fitting T-shirt.\nGoing on a trip: Shannan Ponton spent some quality time with his wife Kyle and two children on Wednesday as they arrived in Bali for a family getaway\nHe matched his plain choice of clothing with a pair of black ripped denim shorts, which gave onlookers view of his never-ending leg tattoos.\nShannan displayed a large smile as he covered his eyes with a pair of sunglasses.\nThe reality TV star put his superb fitness to good use as he pushed the family's luggage in front of him while Maximus comfortably sat on the handle bar.\nReady to relax: The 42-year-old showed off his muscular figure as he dressed in a tight-fitting T-shirt and black denim shorts\nSuperstar style: He hid his eyes beneath a pair of sunglasses as he made his way through the airport\nPut to work: The reality TV star was seen putting his superb fitness to good use as he pushed the family's luggage in front of him while Maximus comfortably sat on the handle bar\nHis wife Kylie stunned as she also opted for a black and white outfit for the getaway.\nThe mother-of-two showed off her already sun-kissed skin as she slipped into a baggy black tank top and white knee-length shorts.\nWhile pushing her daughter's pram, the tied her blonde hair back into a messy ponytail, showing off her minimal make-up look.\nFriendly: They were then pictured chatting to local staff members\nMatching: Kylie mimicked her husbands look and also opted for a black and white outfit for their holiday\nCasual: She showed off her minimal make-up look as she tied her blonde hair back into a messy ponytail\nThe family-of-four were later pictured entering an awaiting vehicle as they made their way to their awaiting destination.\nLast year Kylie spoke to the Daily Telegraph about the possibility of expanding her family stating she would 'love a third child' within the next five years.\nThe beauty tied the knot with Shannan in 2010 in a private Sydney ceremony.\nOn the move: The family-of-four were later pictured entering an awaiting vehicle as they made their way to their awaiting destination","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420896/The-Biggest-Loser-Australia-star-Shannan-arrives-Bali-wife-Kylie-two-children.html"}
