{"authors":["Krisanne Fordham","Travel"],"date_download":"2018-10-30 23:52:41","date_modify":"2018-10-30 23:52:41","date_publish":"2016-12-05 00:00:00","description":"From Singapore to Cartagena, these cities take street food to the next level of deliciousness. Here’s where to go and what to order.","filename":"data/vaneerConsumption/Thebestcitiesforstreetfood.json","image_url":"https://amp.businessinsider.com/images/5845e481dd089536448b4a45-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-best-cities-for-street-food-2016-12_1540943561.html","title":"The best cities for street food","title_page":"    The best cities for street food - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Arancini is a traditional street food in Palermo. Shutterstock\nThe INSIDER Summary:\n• Street food is the best way to immerse yourself in a destination.• Rio has Nutella-filled tapioca crêpes, Sydney has beachfront burgers, and Cartagena serves up chicharron-topped bollos.\nYou haven't experienced New York City 'til you've wolfed down a curbside hot dog doused in ketchup, mustard, and relish. Similarly, a trip to Bangkok isn't complete without slurping a bowl of spicy boat noodles, dished out by a hawker on Boat Noodle Alley. Street food isn't just a fast, cheap, and delicious way to fill your stomach—it's a way of truly experiencing and immersing yourself in a destination.\nThough almost every city in the world offers its own unique kind of street food, a handful of cities simply take it to the next level. We're talking about the kind of deliciousness you feel at your core with each bite—the feeling you get when tucking into a soulful Moroccan tagine, for example, or a freshly made banh mi—and with so many available options that you could go an entire trip without ever setting foot inside a restaurant.\nClassic street food cities like New York and Singapore immediately come to mind, with their established street food culture and centralized hawker and food truck areas. But then there are those under-the-radar foodie cities that are slowly becoming the world's next street food capitals: Rio with its Nutella-filled tapioca crêpes, Sydney with its beachfront burgers, and Cartagena with its chicharron-topped bollos. Who needs Michelin stars when you have street eats this good?\nHere, we've put together a list of where to find the world's most delicious street food, with insider tips on where to eat, what to order, and what to avoid.","url":"https://www.businessinsider.com/the-best-cities-for-street-food-2016-12"}
