{"authors":["David Scutt","Business Insider Australia"],"date_download":"2018-10-30 22:34:43","date_modify":"2018-10-30 22:34:43","date_publish":"2018-07-31 00:00:00","description":"The Bank of Japan made several small tweaks to policy settings at its July meeting. However, none were major, keeping market moves relatively contained.","filename":"data/vaneerConsumption/TheBankofJapantweakspolicy.json","image_url":"https://amp.businessinsider.com/images/5b603e407daf6d1d008b491a-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bank-of-japan-tweaks-policy-at-july-meeting-2018-7_1540938883.html","title":"The Bank of Japan tweaks policy","title_page":"    Bank of Japan tweaks policy at July meeting - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bank of Japan (BOJ) Governor Haruhiko Kuroda attends a news conference at the BOJ headquarters in Tokyo, Japan. Reuters/Toru Hanai\nThe Bank of Japan (BoJ) made a raft of small tweaks to monetary policy settings at the conclusion of its July meeting, introducing a forward guidance on policy rates, more flexibility in bond purchases and tweaks to its stock ETF purchases.\nHowever, none have led to a substantial move in Japanese stocks, bonds or the Japanese yen, indicating markets don't believe they will make any substantial difference when it comes to the BoJ achieving its inflation target.\nImportantly, the BoJ made no change to official interest rates or its quantitative easing (QQE) program, keeping its key policy rate at -0.1% while pledging to keep 10-year Japanese government bonds (JGBs) yields \"around\" 0%.\nThe latter is known as yield curve control, or YCC for short, which essentially buying sufficient bonds to keep longer-dated yields depressed at low levels.\nHowever, it said that it would adopt a more flexible approach to bond purchases, suggesting that \"yields may move upward and downward to some extent mainly depending on developments in economic activity and inflation\".\nIt also retained the pledge to buy JGBs an at annual pace of about 80 trillion yen to anchor 10-year yields at its target.\nAlong with promising more flexibility with asset purchases, it also introduced a forward guidance on policy rates, noting that it \"intends to maintain the current extremely low levels of short and long-term interest rates for an extended period of time\".\nThat was new, if not a given with inflation still stuck well below its 2% annual target.\nIt also made small changes to its purchases of stock exchange traded funds, although it kept the size of annual purchases unchanged at 6 trillion yen per annum.\nIt made no changes to ETF purchases for Japanese real estate investment trusts nor annual corporate purchases.\nIn response to criticism that its negative interest rate policy was eroding profitability at Japanese banks, the BoJ also announced that it would reduce the amount of reserve balances attracting negative rates from the average level of 10 trillion yen currently.\nWhile the bank introduced a few changes, none signals a definitive shift in policy direction.\nThe BoJ's latest inflation forecasts explain why.\nHere they are, comparing them to those offered three months ago.\nBank of Japan\nAll of its core inflation forecasts out to the end of the 2020 financial year were revised lower, leaving them entrenched below the bank's 2% target.\nGiven that outlook, it said it will continue with its QQE with YCC policy for \"as long as it is necessary for maintaining [its inflation target] in a stable manner\".\nGiven core inflation currently sits at 0.8%, it looks like it will be buying plenty of bonds in the years ahead, be it in a flexible manner or otherwise.","url":"https://www.businessinsider.com/bank-of-japan-tweaks-policy-at-july-meeting-2018-7"}
