{"authors":["Danielle Gusmaroli For Daily Mail Australia"],"date_download":"2018-10-22 20:45:43","date_modify":"2018-10-22 20:45:43","date_publish":"2016-01-28 03:33:46","description":"Sam Wood ensured he was the centre of attention when he was seen sporting a lion-esque mane of hair in Sydney on Thursday.","filename":"data/vaneerConsumption/TheBachelorAustraliasSamWoodteaseshishairintoavoluminousbouffant.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/03/30A65DC700000578-0-image-a-4_1453950332380.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420316_Sam-Wood-teases-hair-voluminous-bouffant_1540241143.html","title":"The Bachelor Australia's Sam Wood teases his hair into a voluminous bouffant","title_page":"The Bachelor Australia's Sam Wood teases his hair into a voluminous bouffant | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He always sports a healthy mane of hair but on Thursday Bachelor Sam Wood ensured he turned heads.\nThe 35-year-old gym owner put on a hair-raising display as he raced around Sydney being interviewed by varying radio hosts about his impending nuptials with fiancée Snezana Markoski.\nSporting a lion-esque mane of hair combed to one side, the fitness fanatic struck a jovial figure as he espoused his love for the 35-year-old Macedonian-born beauty whom he met on the reality show.\nScroll down for video\nTurning heads: Sam Wood ensured he was the centre of attention when he was seen sporting a lion-esque mane of hair in Sydney on Thursday\nHair-raising: The 35-year-old gym owner paraded a voluminous head of hair\nThe reality star normally wears his hair big but the latest styling looked more puffed up than usual.\nHis luscious locks were coiffed upwards and worn parted to one side and showed a few rogue grey strands.\nThe Tasmanian-born star was heard being interviewed earlier that morning by Kyle and Jackie O Henderson on KiisFM when he revealed his dreams for an outdoor wedding, perhaps at a winery.\nCoiffed: The reality star normally wears his hair big but the latest styling looked more puffed up than usual. Pictured in September last year\nSleek: The Tasmanian-born star was heard being interviewed by Kyle and Jackie O Henderson on KiisFM when he revealed his dreams for an outdoor wedding\nWhat's the rush? He put on a hair-raising display as he raced around Sydney being interviewed about his forthcoming wedding by varying radio hosts\nThe couple's first televised date was held in a vineyard when the two famously doused each other in flour.\n'Outdoors – something in a winery,' Sam told the radio hosts when quizzed about wedding details.\n'We want to get married maybe in a run-down church and...straight away you go into a big party,' he added.\nPlanning: The Tasmanian born reality star told radio interviewers Snezana his betrothed wants a big white wedding before having children\nHis luscious locks were coiffed upwards and worn parted to one side ad showed a few rogue grey strands.\nFor their first date on the Channel Ten show filmed last year, Sam whisked the scientific sales rep off for a hot air balloon ride, followed by a romantic picnic in a winery.\nThe luscious green surroundings of the secluded vineyard added to the romance and proved to be the perfect location for the pair's first kiss.\nIn early December Sam and Snezana announced their engagement on social media while holidaying in Tasmania.\nLove is in the air: The romantic surroundings of the secluded vineyard proved to be the perfect location for the pair's first kiss on TV\nBig news: Early December they announced their engagement on social media whilst holidaying in Tasmania\nThe personal trainer shared a close-up shot of a square cut halo diamond ring ensconced on Snezana's hand when he shared the news on Instagram writing: 'She said YES!'\n'When you know, you know. I love you Snezana,' he added, with hashtags including 'Can't wipe the smile off my face' and 'Tasmania engagement'.\nMeanwhile, the 35-year-old mother-of-one also posted the photo of the couple holding hands, telling fans: 'Happiest girl in the World'.\nSam lives in Melbourne and Snezana with her daughter Eve, ten, in Perth.\nThey recently purchased a home together in Melbourne.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420316/Sam-Wood-teases-hair-voluminous-bouffant.html"}
