{"authors":[],"date_download":"2018-10-30 01:12:46","date_modify":"2018-10-30 01:12:46","date_publish":"2016-04-19 00:00:00","description":null,"filename":"data/vaneerConsumption/TheBernieonepercentlife.json","image_url":"https://www.americanthinker.com/images/bucket/2016-04/196387.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_04_the_bernie_one_percent_life_1540861966.html","title":"The Bernie one percent life","title_page":"The Bernie one percent life","title_rss":"NULL","source_domain":"americanthinker.com","text":"These insights come to mind wondering, how did poor old Bernie make all those choices on his quickie trip to Rome on a chartered jumbo jet in the midst of his supposed poor-boy campaign against a monstrous Wall Street creature financed by evil corporations? And didn't greenie Bernie leave a large carbon footprint with such an extravagant trip? The enquiring minds at Twitchy also wanted to know.\nHypocrisy, thy name is Democrat. Or Socialist. It takes a lot of small donations to quickly transform socialist Bernie Sanders into a one-percenter while he condemns wealth.\nBernie Sanders had a quick turnaround trip to the Vatican in Rome where he attended a conference on Friday. Not long after Sanders issued a dire warning about the grave threat posed by climate change, the income inequality crusader chartered a private 767 for the long trip to Italy: As the British Daily Mail helpfully calculated On average, an American flies only 7,500 miles per year, according to AmericanForests.org, 1,360 fewer miles than Sanders's round-trip Rome travel. Thus, an average American releases less carbon emissions via aircraft each year than Sanders did in 24 hours.\nAnd also the average American eats less in a day than did Bernie and his private Berning entourage of 50 in their nine-hour or so flight in a plane capable of carrying 250 people. They definitely did not consume typical airline food on their flight; it was first-class, one-percent dining coming and going.\nAll these choices for dessert sauces and cheeses for a man who feels that people have too many choices in deodorants. With food like that, who needed in-flight entertainment? If this man can't make a decision on his deodorant, how can he choose among the multiple choices available when he must make decisions affecting millions nationally and internationally every day?\nOh, and by the way, what did Sanders speak about while in Rome? Wait for it...\n\"The Urgency of a Moral Economy: Reflections on the 25th Anniversary of Centesimus Annus.\"\nOh well – he probably received less than Hillary Rodham Clinton's standard speaking fee of $250,000, give or take $50,000. He doesn't want his income to be too unequal to his supporters', does he?","url":"https://www.americanthinker.com/blog/2016/04/the_bernie_one_percent_life.html"}
