{"authors":["Faye James For Daily Mail Australia"],"date_download":"2018-10-22 22:30:36","date_modify":"2018-10-22 22:30:36","date_publish":"2017-03-16 04:04:43","description":"At 78kg, contestant Nikki has been criticized by viewers for not being 'fat enough' for the reality TV show The Biggest Loser: Transformed.","filename":"data/vaneerConsumption/TheBiggestLoserTransformedtrainerdefendsNikki.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/04/3E50DB4D00000578-0-image-a-38_1489638523554.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318762_The-Biggest-Loser-trainer-defends-contestant-Nikki_1540247436.html","title":"The Biggest Loser: Transformed trainer defends Nikki","title_page":"The Biggest Loser: Transformed trainer defends Nikki | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"At 78kg, she has been criticized by viewers for not being 'fat enough' for the reality TV show The Biggest Loser: Transformed.\nBut contestant Nikki, 25, is apparently considered not 'healthy for her height', according to the TV show's trainer Libby Babet.\n'She wasn't healthy for her height,' Libby told news.com.au.\n'I'm sorry but 78kg?!?' The Biggest Loser viewers voiced their confusion on Twitter, over Nikki's entry weight of 78kg, on Tuesday's premiere episode\n'We do break down [the contestants'] body fat scan and see where the fat is positioned on their bodies and what I think the public will see is that Nikki was quite unhealthy.\n'She did have some issues going on and she is very short, she is not a tall girl. She is actually below the average in terms of height, and ultimately she's on TBL because she wants to lose weight,' Libby added.\nLibby went on to say that although Nikki is not considered obese she is in the 'overweight category' for those looking to improve their overall health.\nNot healthy: Contestant Nikki is apparently considered not 'healthy or her height', according to the TV show's trainer Libby Babet\nAccording to the most recent figures published by the Australian Bureau of Statistics, covering 2011 to 2012, Nikki is just seven kilos heavier than the weight of the average Australian woman.\nThe statistics revealed that the average woman weighs in at 71.1kg with a height of 161.8cm.\nFigures for men revealed an average of 85.9kg at a height of 175.6cm.\nAVERAGE HEIGHT AND WEIGHT OF MEN AND WOMEN ACCORDING TO THE AUSTRALIAN BUREAU OF STATISTICS MEN WOMEN 85.9KG AT 175.6CM 71.1KG AT 161.8CM\nBaring all: The episode saw Nikki revealing her starting weight, alongside an image of her in nothing but underwear\nLibby states that even if you are just 10kg overweight you can suffer from a range of symptons including tiredness, anxiety and sluggishness.\nDaily Mail Australia contacted Channel Ten to ascertain Nikki's exact height.\nThe criticism came from Tuesday's premiere episode, when viewers took to Twitter to voice their confusion over 25-year-old Nikki's entry weight.\n'I'm sorry but 78kg?!? No,' commented one viewer, while another Tweeted: '78kg isn't that fat.'\nScroll down for video\nBaffling: One viewer found it absurd that producers would cast an entrant weighing in at 78kg\n'What I'm confused about #TBLAU this year is why are there so many contestants who aren't even that fat on the show? 78kg isn't that fat,' Tweeted another one.\nAnother shared: 'Remember the days when you had to be 100kgs+ to be on this program.'\n'While one posted: 'I don't think that Nikki chick on the Biggest Loser needs to lose much weight it is more a mental thing.'\nConfusion: Other viewers were quick to voice their comments over Nikki's entry weigh-in\nChange of pace: Another viewer brought to light how in past seasons of the show contestants weighed a more significant amount\nOpinionated: One social media user considered Nikki's place on the show to be more a mental improvement than a physical\nThe online comments come shortly after Nikki, a full-time mother, revealed that being confident in a bikini is what she's striving for.\nNikki also revealed that her partner, who she has been with for three years, still hasn't seen her naked.\n'I've been with my partner for three years and he still hasn't seen me naked,' the brunette told to the other 15 contestants.\n'My partner hasn't even seen my body exposed, let alone a room of strangers,' she added.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318762/The-Biggest-Loser-trainer-defends-contestant-Nikki.html"}
