{"authors":["Jacques Peterson For Daily Mail Australia"],"date_download":"2018-10-22 22:08:31","date_modify":"2018-10-22 22:08:31","date_publish":"2016-01-11 02:24:57","description":"It looks like the elegant Laurina Fleure also has a bit of a secret wild side, with the star flaunting her incredible body in an extremely high-cut swimsuit that left little to the imagination.","filename":"data/vaneerConsumption/TheBachelorsLaurinaFleureshowsoffherincrediblebody.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001E98300000578-0-image-a-27_1452476997217.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393250_The-Bachelor-s-Laurina-Fleure-shows-incredible-body-high-cut-swimsuit-reveals-small-bow-tattoo-hip_1540246111.html","title":"The Bachelor's Laurina Fleure shows off her incredible body","title_page":"The Bachelor's Laurina Fleure shows off her incredible body | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the high-maintenance star of The Bachelor best known for her sophisticated style and luxurious lifestyle.\nBut it looks like the elegant Laurina Fleure also has a bit of a secret wild side, with the Pialia Boutique owner flaunting her incredible body on Sunday in an extremely high-cut swimsuit that left little to the imagination.\nHowever, it wasn't just her revealing choice of swimwear that caught the eye - it was also a noticeable tattoo of a bow on her hip.\nScroll down for video\nThe Tatt-chelorette! Laurina Fleure showcased her incredible physique in a VERY high-cut swimsuit, but all eyes were on the small bow tattoo on her hip\nAlthough small, the artistic ink was hard to miss against the brunette beauty's bronze tan.\nThe swimsuit, which Laurina picked up at a pop-up store on Melbourne's Chapel Street, featured a bright green topical design.\nThe one-piece was cut so high that it showcased the former model's crotch, bare hips, and the sides of her torso.\nLater that night, the stunner slipped her famous curves into a slinky, low-cut nightie to prepare a chicken dinner for a special someone.\n'Scuze the mess - Just being a domestic goddess!,' wrote the reality TV star, who had a glass of white wine in one hand.\nSee the latest on The Bachelor stars as Laurina Fleure dons a daring swimsuit\n'Just being a domestic goddess!' Later that night The Bachelor star slipped into a slinky nightie with a plunging neckline to cook a delicious chicken dinner\nInked up: The stunning 31-year-old also has another small tattoo on her lower back\nAlthough it's unknown who the meal was for, the likely answer is Laurina's handsome beau, Lewis Romano.\nThe jet-setting duo fell in love last year after meeting through friends on a European getaway.\n'We ran off to Rome and fell in love,' she told NW magazine.\nShe added: 'Ending up with Blake [Garvey] would have been soul destroying. He had lots of ideas as to what a woman should be, and it's perfect that he ended up with Louise, because she is the cookie-cutter ideal of what a woman and a wife should be.'\n'We ran off to Rome and fell in love:' The online boutique owner has been dating 28-year-old businessman Lewis Romano since last year\n'Ending up with Blake [Garvey] would have been soul destroying. He had lots of ideas as to what a woman should be, and it's perfect that he ended up with Louise, because she is the cookie-cutter ideal of what a woman and a wife should be,' Laurina told NW magazine last year\nAlthough Laurina has stayed away from reality TV since The Bachelor, she was recently rumoured to join a future season of The Real Housewives of Melbourne after being spotted out and about with Pettifleur Berenger on multiple occasions.\nHowever, Pettifleur refuted those rumours in an exclusive interview with the Daily Mail Australia last month.\n'She and I get along really well,' the 51-year-old said. 'We hang out and she's a fun girl, but like I said, Real Housewives, no. She would be eaten alive!'\nAnother Housewife, Gamble Breaux, also had nothing but positive things to say about Laurina when previously contacted by DMA about the possibility of the model joining the hit series.\n'Laurina is awesome,' said Gamble. 'She has a great attitude. I really like her!'\nThe blonde bombshell added: 'I think it will be too early to say who will be asked back. We will have to wait until after the third season goes to air.'\n'She would be eaten alive!' Pettifleur Berenger shot down rumours that good friend Laurina Fleure might join The Real Housewives of Melbourne","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393250/The-Bachelor-s-Laurina-Fleure-shows-incredible-body-high-cut-swimsuit-reveals-small-bow-tattoo-hip.html"}
