{"authors":["Kevin Scholla"],"date_download":"2018-10-30 21:30:30","date_modify":"2018-10-30 21:30:30","date_publish":"2015-02-02 15:47:33","description":"Perhaps the Seahawks balls were too inflated. Unlikely. Seattle simply dialed up a horrible call at the worst time possible and changed the course of NFL history in the process. |","filename":"data/vaneerConsumption/TheButlerDidItNotCockinessJustaHorriblePlayCallBurnsSeahawks.json","image_url":"https://media.breitbart.com/media/2015/02/Russell-Wilson-Losing-Super-Bowl-49.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_02_02__1540935030.html","title":"The Butler Did It: Not Cockiness, Just a Horrible Play Call Burns Seahawks","title_page":"The Butler Did It: Not Cockiness, Just a Horrible Play Call Burns Seahawks | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Seattle Seahawks did a lot of things right on Sunday in Glendale, Arizona.\nTheir vaunted defense came up with multiple interceptions. The offense built a lead behind Marshawn Lynch, as expected, and surprise weapon Chris Matthews. Instead of eating the playbook up ten points in the 4th quarter, Pete Carroll went for the kill. Things looked promising for a rare Super Bowl title repeat.\nOne big problem: the champs were playing the de facto champs. Putting away the New England Patriots stands as no easy task. Bill Belichick’s club stormed back, scoring late to take the lead in the NFL’s annual grand finale. Seattle however to their credit didn’t fold, at least not right away.\nDown by four late, Seattle crossed into New England territory after a nifty play call in which Lynch, split wide, made a nice grab on a Russell Wilson throw. Then…an amazing play: Jermaine Wilson made a circus catch for the ages giving the Seahawks a first and goal in the closing moments of regulation. The only thing more shocking than the reception itself was that Al Michaels did not give us the 2.0 version of the memorable Antonio Freeman “He did what?!” call.\nAfter a shocked stadium and two stunned sidelines realized Kearse did in fact make the grab, the Seahawks were poised to punch the ball in and win another championship. Instead, one of the most curious calls in all of sports history forever put a stain on Seattle’s otherwise tremendous effort.\nInstead of pounding Lynch, who looked to be in “beast mode,” Carroll’s club called for a pass on 2nd down. With just 20 seconds left, rookie Malcolm Butler intercepted Wilson at the goal line. The Butler did it.\nThe undrafted rookie out of West Alabama picked a heck of a time for his first career pick. The play ended Seattle’s repeat hopes and turned Kearse into the Endy Chavez of football. One of the top two most remarkable grabs in Super Bowl history will now, like Chavez’s 2006 NLCS over-the-wall catch at Shea Stadium for the Mets, become a footnote because the man who reeled in the ball ultimately ended up on the losing side.\nBelichick and Brady have made history. Four Super Bowl titles together for the all-world coach/quarterback tandem. The Patriots persevered through a long season, injuries, and two weeks of Deflate-gate. New England deserves all the accolades in the world and they will get them in the weeks, months, and years to come. For now though the wound is too fresh. Seattle lost the game on a call that Hall of Famer and three-time Super Bowl champion Emmitt Smith called “the worst play call I’ve seen in the history of football.”\nEveryone scratches their heads today after Seattle’s failure to feed the Beast. Pete Carroll was seconds away from becoming the first coach to win multiple college and NFL titles. Instead he is now saddled with the end result of a call no one could have imagined. Was this a case of things finally catching up with a coach who had the Midas touch for so long?\nAfter the replacement referee primetime win in 2012, the fake field goal and miraculous comeback in the NFC Championship just weeks ago, and Sunday’s successful late first half call to go for a touchdown instead of settling for three despite just six seconds on the clock, the coach perhaps felt his team was invincible. Could they do no wrong? Perhaps the Seahawks balls were too inflated. Unlikely. Seattle simply dialed up a horrible call at the worst time possible and changed the course of NFL history in the process.","url":"https://www.breitbart.com/sports/2015/02/02/the-butler-did-it-not-cockiness-just-a-horrible-play-call-burns-seahawks/"}
