{"authors":["Carolyn Steber"],"date_download":"2018-10-31 01:42:17","date_modify":"2018-10-31 01:42:17","date_publish":"2018-09-14 17:44:19","description":"If at some point in your relationship your partner seems unhappy — for whatever reason — they might start giving off vibes that seem different from their usual personality. You might notice that they're more introverted, or emotionally distant, or…","filename":"data/vaneerConsumption/TheBiggestSignYourPartnerIsntHappyInYourRelationshipBasedOnTheirZodiacSign.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/a49f2ff4-199d-4672-bc8a-7374f2401072-zaeh_bustle_apr2016-140.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-biggest-sign-your-partner-isnt-happy-in-your-relationship-based-on-their-zodiac-sign-11772754_1540950137.html","title":"The Biggest Sign Your Partner Isn’t Happy In Your Relationship, Based On Their Zodiac Sign","title_page":"The Biggest Sign Your Partner Isn’t Happy In Your Relationship, Based On Their Zodiac Sign","title_rss":"NULL","source_domain":"bustle.com","text":"If at some point in your relationship your partner seems unhappy — for whatever reason — they might start giving off vibes that seem different from their usual personality. You might notice that they're more introverted, or emotionally distant, or irritable. And these changes can serve as clues that something's up, and that it may be a good idea to talk about the state of your relationship.\nWhile everyone's unique, this is especially true when you take astrological signs into consideration, since each zodiac sign tends to show signs of unhappiness in a similar way. For example, \"Water signs are more likely to retreat when they are unhappy, [and] fire signs are more likely to act out when they are unhappy,\" astrologer Amy Tripp tells Bustle. But, of course, the only way to know if your partner's unhappiness has anything to do with the relationship, is to ask.\nPart of being a good partner is keeping an eye on your significant other. So it can help to store these signs in the back of your head, should they seem unhappy in the future. Of course, it's on them to approach you, as well, if they're feeling unfilled or distant. But knowing the signs — as they pertain to astrology — can give you the extra edge, and help keep your relationship healthy. Here is the biggest indicator your partner is unhappy, based on their zodiac sign.\n1 Aries (March 21 - April 19): They're Less Interested In Sex Tina Gong/Bustle When an Aries isn't feeling fulfilled or happy, they may show it by taking a step back from the relationship. \"The ruler of Aries is Mars, the planet of action, assertion, [and] sex,\" Tripp says. \"When an Aries is unhappy they may lose their self-motivation, be less interested in sex, and pursue activities solo.\" While all relationships experience lulls in their sex life, if your Aries partner seems to be toning down their intimate side, it may be a good idea to ask them what's up.\n2 Taurus (April 20 - May 20): They Turn Down Dinner Dates Tina Gong/Bustle Since Taurus is all about creating a comfortable life, and sharing that comfort with loved ones, it may be a sign they aren't feeling 100 percent if they no longer want to wine and dine you. \"You can tell a Taurus is unhappy when they stop wanting to eat, relax, and take in life’s simple pleasures,\" Tripp says. \"Taurus loves luxury and comfort. When they start turning down nice dinners you can bet they aren’t happy in the relationship.\"\n3 Gemini (May 21 - June 20): They Stop Talking Tina Gong/Bustle If your Gemini partner stops talking, you know something's up. \"This curious sign loves to connect with new people and circulate,\" Tripp says. And they love to share ideas. If that side of them comes screeching to a halt, it may be because something's on their mind. It might not have anything to do with your relationship, but you won't know until you ask and get a healthy conversation going.\n4 Cancer (June 21 - July 22): They're No Longer Nurturing Tina Gong/Bustle As a loving and caring sign, \"you can tell a Cancer is unhappy when they stop nurturing you,\" Tripp says. Maybe they used to make you coffee in the morning, but haven't done so in a while. Or maybe they no longer want to cook dinner together. If this seems out of character for them, it may be time to talk.\n5 Leo (July 23 - August 22): They Don't Want To Go Out Tina Gong/Bustle Leo is an incredibly social sign, which is why something might be bothering them if they suddenly want to stay in. \"Leo, ruled by the Sun, loves to shine their light and display their unique talents,\" Tripp says. \"When they are no longer creatively expressing themselves or wanting to go out and have some fun they’re likely not happy.\" Of course, their unhappiness could be stemming from an issue outside the relationship, so don't jump to conclusions or assume the worst. But it never hurts to be there for them, point out that they don't seem like themselves, and offer to talk.\n6 Virgo (August 23 - September 22): They're Super Critical Tina Gong/Bustle When a Virgo is unhappy, they might let others know it by being super critical and judgmental. \"Whatever is done will not be good enough for them,\" Tripp says. So take note if your usually kind and loving partner is suddenly picking on every little thing.\n7 Libra (September 23 - October 22): They've Become Introverted Tina Gong/Bustle Libra will make an effort to put on a happy face, Tripp says, even when they're not feeling 100 percent fulfilled. You may notice, however, that they start to tune out and socialize less, which can be your clue that something's wrong. Once you spot them turning inward, that's a great time to reach out and ask what's up. By being there for them, you may be able to sort out relationship problems before they get out of hand.\n8 Scorpio (October 23 - November 21): They Seek Revenge Tina Gong/Bustle When a Scorpio is unhappy, they tend to try to \"get back\" at their partner by seeking revenge in some way, Tripp says. So if you notice that your Scorpio partner seems spiteful or irritable, the best thing to do is sit down together, have a chat, and sort out what's wrong.\n9 Sagittarius (November 22 - December 21): They Stop Making Jokes Tina Gong/Bustle If your Sagittarius partner stops joking around, Tripp says it's a big sign they're not happy. Same goes for a sudden onslaught of pessimism, which is often out of character for them and shows they're dealing with something personal.\n10 Capricorn (December 22 - January 19): They're Very Cold Tina Gong/Bustle \"You can tell a Capricorn is unhappy when they ice you out,\" Tripp says. \"They will remove you completely from their sphere.\" You might receive fewer invites to go out or fewer texts. And when that happens, you should definitely ask what's wrong. Sometimes, people just need a little space, and that's OK. But if you think your partner isn't happy, the sooner you can talk about it the better.\n11 Aquarius (January 20 - February 18): They Spend More Time Alone Tina Gong/Bustle Aquarius is another sign that may begin to turn inward, away from loved ones, when they're feeling unhappy. As Tripp says, \"You can tell they're unhappy when they stop wanting to hang out with friends.\" They just won't seem like themselves.","url":"https://www.bustle.com/p/the-biggest-sign-your-partner-isnt-happy-in-your-relationship-based-on-their-zodiac-sign-11772754"}
