{"authors":["Jade Watkins For Daily Mail Australia"],"date_download":"2018-10-22 23:55:41","date_modify":"2018-10-22 23:55:41","date_publish":"2017-03-10 05:02:44","description":"Channel Ten have gone to great lengths to keep the identity of the ladies vying for The Bachelor Matty J's heart in the next series a secret.","filename":"data/vaneerConsumption/TheBachelorgirlswearbinbagsastheyentermansion.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/05/3E2023A600000578-0-image-a-48_1489122905160.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300042_The-Bachelor-girls-wear-bin-bags-enter-mansion_1540252541.html","title":"The Bachelor girls wear bin bags as they enter mansion","title_page":"The Bachelor girls wear bin bags as they enter mansion | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Channel Ten have gone to great lengths to keep the identity of the ladies vying for The Bachelor Matty J's heart in the next series a secret.\nBut the girls were probably not quite expecting to be draped in bin bags as they made their way into the Bachie mansion earlier this month.\nThe women were seen covered up in the black plastic kitchen bags as they were ferried to the multi-million dollar abode, in an attempt to hide their identities from photographers.\nNot so glamorous after all? The Bachelor contestants were taken into the Bachie mansion with plastic BIN BAGS over their heads in attempt to hide their identity earlier this month\nIt perhaps wasn't the most glamorous beginning to their first night in the mansion, which would see the contestants introduced to Matty.\nThe girls were being shuttled to the mansion under the cover of plastic bags while in their glitzy ball gowns, after having their hair and makeup done for the first episode.\nAfter being put under bin bags and arriving at the mansion in the minivan, the women would then have been transferred to a limo to make a more stylish entrance.\nUnder the cover of darkness? The girls were being shuttled to the mansion under the cover of plastic bags while in their glitzy ball gowns\nThe iconic ride up the driveway of the Bachelor mansion via luxury car often provides some of the most memorable scenes of the series.\nFirst impressions count a lot during the initial meeting, with previous mansion entrants bringing a gift, a poem or even a song for the waiting Bachelor.\nBut many of the girls arriving under the cover of bin bags seemed to be set on maxmising their good looks, sporting perfectly coiffed hair and spray tans.\nLook away Matty J! After being put under bin bags and arriving at the mansion in the minivan, the women would then have been transferred to a limo to make a more stylish entrance\nBefore making their clandestine shuttle to the reality TV set, the girls could be seen getting their hair and makeup done at an offsite location.\nOne animated blonde wore a pink hair clip as she nursed her hair in curlers while getting ready.\nMore photos of the mystery contestant showed she was wearing a striking royal blue dress, with an elegant low back.\nShe's excited! One animated blonde wore a pink hair clip as she nursed her hair in curlers while getting ready to meet Matty J\nDressed to impress! More photos of the mystery contestant showed she was wearing a striking royal blue dress, with an elegant low back\nA dark-haired singleton could be seen her hair styled poker straight and sporting red lipstick.\nThe woman, who bore a striking resemblance to Kim Kardashian, wore a sombre expression and appeared nervous to be meeting Matty.\nShe could also be seen adjusting her dress, which was also rouge to match her lips, as she waited to be taken to the mansion.\nNervous? A dark-haired singleton could be seen her hair styled poker straight and sporting red lipstick\nMaking sure she looked her best! She could be seen adjusting her dress, which was also rouge to match her lips, as she waited to be taken to the mansion\nLending a hand: She later got some help from a crew member who helped her further adjust the ensemble\nAnother striking brunette hoping to win Matty's heart went for a more understated look, wearing her hair in a chic twisted top knot.\nShe also appeared to be wearing little to no makeup, and seemed to be chatting animatedly to a member of crew helping her get ready.\nHer slicked up do was in stark contrast to the look favoured by most of the girls that night who went for a more wavy look.\nKeeping it simple? Another striking brunette hoping to win Matty's heart went for a more understated look, wearing her hair in a chic twisted top knot\nRelaxed: She also appeared to be wearing little to no makeup, and seemed to be chatting animatedly to a member of crew helping her get ready\nThe majority of women seen having their hair and makeup done arrived with their hair in curlers.\nOne went for a cute retro twist by wearing a black scarf around her head, which was piled high with curlers.\nAnother girl who had her hair curled seemed to leave the hair stylists perplexed with what to do next, with the hairdressers appearing to study her before making a decision.\nWhat's next? Another girl who had her hair curled seemed to leave the hair stylists perplexed with what to do next\nWho copied who? The majority of women seen having their hair and makeup done arrived with their hair in curlers","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300042/The-Bachelor-girls-wear-bin-bags-enter-mansion.html"}
