{"authors":["Bruce Warren"],"date_download":"2018-10-22 20:18:33","date_modify":"2018-10-22 20:18:33","date_publish":"2018-09-17 00:00:00","description":"Five great minds in public radio talk about standout events and artists across the six-day celebration.","filename":"data/vaneerConsumption/TheBestActsWeSawAtAmericanaFest.json","image_url":"https://media.npr.org/assets/img/2018/09/17/lrg_dsc02616.jpg_wide-81b4bdd55dea4a6b958775a48354a6f193e6fdc5.jpeg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_world-cafe_2018_09_17_648698917_the-best-acts-we-saw-at-americanafest_1540239513.html","title":"The Best Acts We Saw At AmericanaFest","title_page":"The Best Acts We Saw At AmericanaFest  : World Cafe : NPR","title_rss":"NULL","source_domain":"npr.org","text":"The Best Acts We Saw At AmericanaFest\nEnlarge this image toggle caption Bob Boilen/NPR Bob Boilen/NPR\nThe Americana Music Association's 19th annual AmericanaFest in Nashville came to a close after six days of music showcases featuring over 225 performers, various panels including the keynote interview with k.d. lang, dozens of off-campus events and parties and the 17th annual Americana Music Honors and Awards ceremony.\nWhile the awards and honors show was in a category all by its amazing self, some of street buzz highlights of the week included sets by Ruston Kelly, Sam Morrow, Ben Dickey, Richard Thompson, The Band of Heathens, Devon Gilfillian, The Suffers, Lilly Hiatt, Mike Farris, Sunny War, Amythyst Kiah and Leah Blevins.\nWith the festival fresh on their minds, five festival attendees share for some of their highlights below.\nThe Nude Party played a late Thursday set on the Third Man Records Stage. I'd been on the move since 8 a.m. that day. I was tired, things were running late. Then The Nude Party hit the stage and jolted me like a triple espresso. I felt schoolboy joy when they tore it up with a sizzling set of Stones/Animals/Nuggets-box styled 60's rock! - Bill DeVille, KCMP, The Current DJ and Host of United States of Americana.\nWilliam Prince started his one Americana Fest show with a tuneful plea. \"I flew all the way here to play for this 45 minutes,\" he sang, improvising, \"so please listen.\" He needn't have asked. The Manitoba-based musician, who's already a Juno Award-winning star in Canada, enchanted the crowd at City Winery with his warmly enveloping baritone and songs that simply glowed with vulnerability and a sense of resilience. Some, like his Canadian breakthrough, \"Breathless,\" were sweepingly romantic, while others, like the hardscrabble \"Carny,\" recalled the drifters' diaries of Kris Kristofferson. Playing solo while sipping bourbon, Prince was a self-deprecating storyteller mixing unfussy wisdom with gentle wit. This intimate show belied his burgeoning success: He's been working with Nashville's favorite producer, Dave Cobb, and occasionally opening for Neil Young. For this evening, though, he was that stranger on the bar stool who bends your ear with unexpected profundity. He made every listener in the room feel like a confidant. – Ann Powers, NPR Music\nTo say that AmericanaFest Week in Nashville is an embarrassment of riches misses the point. I am of the belief that too much of a good thing is still a good thing. It is hard to pick just one performance, but here goes. Wednesday at 1 p.m. at a dive bar named The Local, Amy Helm and her band put on a stunning set, filled with everything one hopes for in a live show. Her vocals were delivered with remarkable control and power as they played songs from her stellar new album This Too Shall Light. It was one of those moments of illumination, where everything comes together to elevate the room in the pure joy of music. - Jessie Scott, Program Director, WMOT Roots Radio\nWith a house band led by Nashville multiple-places-at-once drummer Jerry Pentecost (also in the house band of the Ryman's Awards Show), a who's who of current Americana favorites took the stage for a song or two each of Creedence Clearwater Revival hits. Aaron Lee Tasjan, Jason Isbell, Amanda Shires, Courtney Marie Andrews, Israel Nash, The War & Treaty, Nicki Bluhm, Lukas Nelson and others came and went in rapid-fire succession. I was so impressed with how tight every arrangement was considering how little time they must have had to put it all together. And let's face it, John Fogerty is one of Americana's, and America's, most under-recognized songwriters. – Martin Anderson, WNCW Music Director and Host\nThe best thing I saw: Cordovas at the High Watt. Band leader Joe Firstman kicked off the final late-night performance saying, \"We're gonna take you home.\" Did they ever. Cordovas unleashed a non-stop 50-minute country rock whirlwind, blending three-part harmony with burning guitar, dancing keys and a steady rhythm section that showed everyone exactly why the band's live shows are renown. It capped off the gig with Nashville singer-songwriter Steve Poltz and Austin's King Corduroy joining them on stage for a crowd-pleasing rendition of the Grateful Dead's \"Truckin'.\" – Jason Samuel, General Manager & Program Director WGCS","url":"https://www.npr.org/sections/world-cafe/2018/09/17/648698917/the-best-acts-we-saw-at-americanafest"}
