{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:57:59","date_modify":"2018-10-30 22:57:59","date_publish":"2016-07-05 20:59:52","description":"What is cap and trade? California’s cap and trade program is a tool for putting a price on pollution, specifically carbon dioxide and other greenhouse","filename":"data/vaneerConsumption/TheBasicsofCapandTrade.json","image_url":"https://calmatters.org/wp-content/uploads/favicon-150x150.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940279.html","title":"The Basics of Cap and Trade","title_page":"The Basics of Cap and Trade | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"What is cap and trade?\nCalifornia’s cap and trade program is a tool for putting a price on pollution, specifically carbon dioxide and other greenhouse gases, that businesses discharge into the atmosphere.\nThe state sets limits—caps—on the volume of greenhouse gas that oil refineries, electricity providers, food-processing plants, paper mills, cement manufacturers and other companies can legally emit.\nCompanies that pollute above their limits, which are lowered each year, can either reduce their emissions or buy allowances from businesses that operate below their caps and have credits to sell. The credits are bought and sold at quarterly auctions managed by the state.\nAlthough the names of the companies that are qualified to participate in the auctions are made public, information about which firms actually place bids, and at what price, is kept secret, as is the location where the online trading is managed.\nThe state estimates that the entities subject to cap and trade regulations are responsible for about 85 percent of California’s greenhouse gas emissions.\nCap and trade was authorized by landmark California legislation, signed in 2006 by then-Gov. Arnold Schwarzenegger, that helped make the state a leader in the fight against global warming. But legal, political and financial questions have created uncertainty about the future of the program.\nHow do the auctions work?\nCalifornia conducts its auctions online, with the Canadian province of Quebec. They will soon include Ontario.\nCarbon credits are sold per metric ton. For the most part, they have sold for the “floor” price, $12.73.\nIn addition to purchasing credits, companies may buy “offsets” separately by helping to pay for projects that reduce greenhouse gas emissions: preserving forestland, capturing methane from pigs and cows, destroying chlorofluorocarbons that might otherwise deplete the ozone layer, and reducing methane in mining operations and rice cultivation.\nBillions of dollars from the auctions have gone into a fund, the Greenhouse Gas Reduction Fund, dedicated to “green” projects in California.\nWhat projects are the auction proceeds paying for?\nMoney generated by the auctions is intended to be spent on projects that help reduce greenhouse gas emissions or assist disadvantaged communities. More than $4 billion has gone into the Greenhouse Gas Reduction Fund so far.\nDifferent entities bid for the available funds, and their operations and carbon-reduction claims are reviewed. The non-partisan Legislative Analyst’s Office has noted that some of the projects are not cost-efficient, in some cases costing many times more than the carbon-reduction prices at auction.\nThe projects include home weatherproofing, high-density and affordable housing, public transportation infrustructure, and to promote the adoption of clean vehicles.\nThe most controversial project has been the state’s ambitious high-speed rail project, championed by Gov. Jerry Brown, which has been granted $850 million from the fund.\nHow much has California lowered its emissions?\nIn the past few years, the state’s emissions have been declining about 3 percent annually, officials say.\nThe California Air Resources Board, which runs the cap and trade program, pegs the peak emissions at 496 million metric tons in 2004. When the law signed by Schwarzenegger took effect in 2007, annual emissions were 484 million metric tons. In 2014, the latest year for which state figures are available, emissions were 441 million metric tons. In a law passed in late 2016, California has pledged to cut emissions by 40 percent by 2030.\nState officials cannot precisely say how much of the decline is because of cap and trade; there are dozens of other climate-change policies that contribute. The officials say, however, that emissions caps are critical to achieving California’s carbon-reduction goals.","url":"https://calmatters.org/articles/the-basics-of-cap-and-trade/"}
