{"authors":["Hannah Paine For Daily Mail Australia"],"date_download":"2018-10-22 23:26:10","date_modify":"2018-10-22 23:26:10","date_publish":"2017-03-16 06:51:08","description":"Alison Braun, 43,  has had plenty to smile about in her life lately taking to Instagram to gush about her new romance with Perth native Alan Taylor.","filename":"data/vaneerConsumption/TheBiggestLosersAlisonBraunpraiseshernewboyfriend.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E52255600000578-0-image-a-148_1489643857267.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318876_The-Biggest-Loser-s-Alison-Braun-gushes-new-man_1540250770.html","title":"The Biggest Loser's Alison Braun praises her new boyfriend","title_page":"The Biggest Loser's Alison Braun praises her new boyfriend | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She faced a series of hardships after shedding 66 kilos on The Biggest Loser in 2008.\nBut Alison Braun, 43, has had plenty to smile about in her life lately, taking to Instagram to gush about her new romance with Perth native Alan Taylor.\nThe relationship comes after the mother-of-three tragically lost her husband Robert to suicide in 2009 following her appearance on the show.\nScroll down for video\n'My love, my world': The Biggest Loser's Alison Braun gushes about new relationship after tragically losing her husband to suicide in 2009\nNews Corp Australia reported at the time that Robert's death followed a lifelong struggle with depression.\nAt the time, Robert had a new job as a mining operations manager and Alison had spoken to him earlier in the evening when he missed a flight.\nBut hours later, Alison's mother phoned her with the sad news that her husband had taken his own life.\nLoved up: The mother of three has been flaunting her new love on Instagram since December\nAlison has been sharing photos her new love on Instagram since December, posting updates as they enjoy intimate dates, even going to Adele's concert together.\nLast week, Alison wrote a loving tribute for Alan's birthday on Instagram, declaring that he was 'my love, my world'.\n'You are what makes the sun shine brighter, the rain feel softer and the cold warmer,' she wrote.\nTransformation: Alison shed 66 kilos on The Biggest Loser in 2008, maintaining a 55 kilo figure ever since\n'You make me smile like I have never smiled before. You are everything I need, you are everything I had hoped.'\nDaily Mail Australia has contacted Alison for comment.\nThe new romance comes after Alison faced a health emergency when she had a defective breast implant removed last September.\nGood news: The new romance comes after Alison faced a health emergency last year when she had a defective breast implant removed last September\n'It had ruptured by the time I got to surgery,' the former reality TV starlet told New Idea.\nBy the time she went under the knife, the 43-year-old's left implant had started to decay and ruptured.\n'I was very angry at myself because I had left it so long, out of the fear of going under anaesthetic, that I made have potentially placed myself in an even worse position.'\nThe season three Biggest Loser contestant had the infamous PIP implants - made by a French manufacturer, using an unapproved silicone gel, which can cause deformities in women if the gel leaks.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318876/The-Biggest-Loser-s-Alison-Braun-gushes-new-man.html"}
