{"authors":["Alicia Vrajlal","Bianca La Cioppa For Daily Mail Australia"],"date_download":"2018-10-22 20:04:56","date_modify":"2018-10-22 20:04:56","date_publish":"2016-01-28 00:12:47","description":"She's kept all the roses he gave her on The Bachelor Australia last year.","filename":"data/vaneerConsumption/TheBachelorsSamWoodistakenabackbyHeatherMaltmankeepingeveryrose.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/03/30A5D8CC00000578-0-image-a-34_1453950082500.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420092_Sam-Wood-taken-aback-Heather-Maltman-reveals-kept-rose-gave-Bachelor_1540238696.html","title":"The Bachelor's Sam Wood is taken aback by Heather Maltman keeping every rose","title_page":"The Bachelor's Sam Wood is taken aback by Heather Maltman keeping every rose | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's recently revealed she has kept all the roses he gave her on The Bachelor Australia last year.\nBut it seems Heather Maltman's thoughtful sentiment has left Sam Wood rather taken aback.\nAppearing on KIIS 106.5 FM's Kyle And Jackie O show on Thursday morning, the 35-year-old personal trainer said: 'That’s a bit strange but anyway, each to their own'.\nScroll down for video\nSay what? Heather Maltman recently revealed that she has kept all the roses she received from Sam Wood while on The Bachelor Australia last year\nSam kept Heather on the Channel Ten reality show until the tail end, the brunette beauty finishing fourth on the program.\nHe ultimately chose Snezana Markoski, whom he recently proposed to, and on Thursday admitted she has kept only one of the roses he presented to her during filming.\n'She’s kept the last one that she ever received and well she’s upgraded it to an engagement ring now so...' he drifted off.\nEarlier this week it was revealed that Heather had kept all the roses she received from Sam on show.\nOver: The brunette was sent home by Sam after she reached the final four on the show\nTrue love: Sam says winner of the show Snezana Markoski has kept the final rose he gave her\nSpeaking in an interview inside the latest issue of NW magazine, she added that she has also had the floral pieces pressed.\n'I'm that sad,' she told the publication while pleading: 'don't judge me'.\nSam sent Heather home after she reached the final four on the show, claiming the only connection the pair had was on a friendship level.\nAt the time of eliminating her from the dating show he said: 'The connection we had was great. I will never forget our date. I’ve been wanting and hoping that what I’ve felt is this amazing friendship would become more.'\nSam sent social media into a frenzy when he sent Heather packing, with many fans shocked by his decision and labeling him 'Australia's most hated man'.\nLoved up: He has since proposed to final rose receiver Snezana\nSpecial bling: Sam said Snezana has kept the last rose she received from him on the show, but has since 'upgraded it to an engagement ring'\nHeather stood up for the former Bachelor at the time, stating she felt sorry for him because of all the backlash he coped for not sending her through to the final three.\n'I feel pretty bad for Sam. I think he has coped it pretty hard today with the whole situation,' she said while appearing on The Project.\n'At the end of the day he had to do what was right for him and I completely respect that and I think everyone should.'\nHappy times: Heather has also found happiness with her new man, Andrew Steele\nSam has since asked final rose receiver Snezana to marry him, only months after the pair went public with their romance.\nBut while the personal trainer prepares to walk down the aisle with the mother-of-one, Heather has also found happiness and moved on after finding herself a new man, Andrew Steele.\nSince going public with their relationship in October, the pair regularly gush about each other across social media with the brunette beauty constantly referring to him as her 'man friend'.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420092/Sam-Wood-taken-aback-Heather-Maltman-reveals-kept-rose-gave-Bachelor.html"}
