{"authors":["Brad Witter"],"date_download":"2018-10-31 00:01:52","date_modify":"2018-10-31 00:01:52","date_publish":"2018-10-28 21:45:50","description":"Black-ish forever. Giving a Wakanda salute to the Marvel blockbuster smash, the black-ish Halloween episode will pay homage to Black Panther, as seen in preview images released by both ABC and the cast on social media. In the episode titled \"Scarred…","filename":"data/vaneerConsumption/TheblackishHalloweenEpisodeWillPayHomageToBlackPantherInTheCoolestWayPHOTOS.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/28/cd43fc2e-b0ec-4b16-85b5-843296d5e89f-150299_0470.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-black-ish-halloween-episode-will-pay-homage-to-black-panther-in-the-coolest-way-photos-13010892_1540944112.html","title":"The 'black-ish' Halloween Episode Will Pay Homage To 'Black Panther' In The Coolest Way - PHOTOS","title_page":"The 'black-ish' Halloween Episode Will Pay Homage To 'Black Panther' In The Coolest Way — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"Black-ish forever. Giving a Wakanda salute to the Marvel blockbuster smash, the black-ish Halloween episode will pay homage to Black Panther, as seen in preview images released by both ABC and the cast on social media. In the episode titled \"Scarred for Life,\" which will air on Tuesday, Oct. 30 at 9 p.m. ET, the Johnson family gives one of the best examples of TV stars channeling the film's iconic characters. And they're doing it all for the culture.\nThe upcoming Season 5 episode of the ABC family comedy will include Bo (Tracee Ellis Ross) taking on Lupita Nyong'o's Nakia, Dre (Anthony Anderson) dressing as Chadwick Boseman's King T'Challa, and Junior (Marcus Scribner) doing his best impression of Michael B. Jordan as Killmonger. (Would it be too much to ask for Jenifer Lewis' Grandma Ruby to get decked out in the Queen Ramonda costume made famous by Angela Bassett, too? Just asking.)\nNoticeably absent from the Johnson family pics are twins Jack (Miles Brown) and Diane (Marsai Martin). An explanation, however, is given in the official \"Scarred for Life\" episode description:\n\"The twins opt out of the family Halloween costume for fear it will hurt their social status in middle school. Dre and Bow take it upon themselves to protect them from bullies by putting together the best haunted house and invite the whole seventh grade. Meanwhile, Junior starts spending time with a girl from Ruby’s choir and Ruby doesn’t know how to feel about it.\"\nThe award-winning cast really scared up some Halloween fun in a behind-the-scenes video posted on the official black-ish Instagram page on Saturday, Oct. 27. Brown attempted to answer the question posed in the video's caption — Which #BlackPanther character is your favorite? — only to be hilariously interrupted by onscreen dad Anderson.\n\"My favorite Black Panther character...\" began Brown, before Anderson (in full T'Challa garb) blurted out: \"He's lying!\" Anderson, who also referred to himself as \"thick T’Challa,\" then, took the opportunity to mug for the camera, wondering aloud, \"Why is my widow's peak crooked and off-center?\"\nBrown was finally able to give his answer, however, pointing to onscreen big bro Scribner, joking that the actor could work as a Killmonger stunt double. Not to be outdone, Ross also popped into the frame as Nakia, giving a shout out to Nyong'o, saying: \"I love you, Lupita\" and that she's \"only trying to aspire to be like her.\"\nAfter Ross shared an Instagram photo of herself and Scribner together all dressed up, their costumes got the ultimate seal of approval — from Jordan himself. Re-posting Ross' image hours later, the OG Killmonger captioned the shot: \"Amazing.\"\nThe following day, ABC also posted a boomerang video of Ross as Nakia on set, wielding her character's famous ring blades. \"Oh, hey Nakia,\" read the caption.\nAnd, you know, since Halloween is supposed to be about the kids, Anderson also posed for an adorable pic holding the Johnson's youngest, Devante (played by Austin and Berlin Gross). The snap, also posted to the official black-ish account, called the tot the \"cutest Wakanda baby.\"\nThis isn't Ross' first experience with the film, as the actor shared an embarrassing Black Panther story during an appearance on NBC's Late Night with Seth Meyers earlier this year. To ease her nerves before giving her first TED Talk in Vancouver, Ross encouraged several attendees to join her in a \"Wakanda Forever\" salute in order to give her some \"Wakanda juice,\" she recounted to Meyers.\nIn a moment she called a \"little awkward,\" she specifically asked an attractive bearded man to do the crossed arm gesture for her. Ross recalled a conversation she had later with a friend: \"She's like 'Oh My God.' I'm like 'What?' She was like 'I cannot believe that I just met Ryan Coogler, the director of Black Panther.' I was like 'Where was he?!' 'She was like 'what are you talking about? That's who you just asked to Wakanda Forever.'\" Oops.\nKevin Winter/Getty Images Entertainment/Getty Images\nRoss was never able to find Coogler again, and joked to Meyers that he must have \"disappeared into Wakanda.\"\nIs it any wonder that fans are almost as excited for the black-ish Halloween episode as they are for a Black Panther sequel?","url":"https://www.bustle.com/p/the-black-ish-halloween-episode-will-pay-homage-to-black-panther-in-the-coolest-way-photos-13010892"}
