{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:22:45","date_modify":"2018-10-30 21:22:45","date_publish":"2015-03-13 13:36:10","description":"The House Committee for Juvenile Justice & Family Issues heard testimony at the state Capitol in Austin on bills that either eased or ended truancy as a juvenile crime in the state of Texas.","filename":"data/vaneerConsumption/TheCasetoEndTruancyGetsFirstHearingatTexasCapitol.json","image_url":"https://media.breitbart.com/media/2015/03/Truancy-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_03_13__1540934565.html","title":"The Case to End ‘Truancy’ Gets First Hearing at Texas Capitol","title_page":"The Case to End ‘Truancy’ Gets First Hearing at Texas Capitol","title_rss":"NULL","source_domain":"breitbart.com","text":"The House Committee for Juvenile Justice & Family Issues heard testimony at the state Capitol in Austin on bills that either eased or ended truancy as a juvenile crime in the state of Texas. More than 200 people signed up to speak before the committee to air their opinions on the hotly contested topic on Wednesday, March 11.\nAt least 20 bills have been filed by Texas House Republicans and Democrats so far during the 84th Legislative Session that aim to decriminalize truancy. Ten were heard by the committee.\nRepresentatives from the non-profit advocacy group Texas Appleseed, which has been on the forefront of the efforts to decriminalize truancy, testified on behalf of four proposed House Bills — HB 1490 of which Dan Huberty (R-Houston) is listed as the main author; HB 110 from James White (R-Woodville) and was co-authored by Matt Rinaldi (R-Irving); HB 297 by Gene Wu (D-Houston); and HB 378, also from James White (R-Woodville).\n“We support bills that have two elements—(1) school prevention and intervention measures and (2) decriminalization. We think that the four bills that we testified for address those two elements,” Texas Appleseed Staff Attorney Morgan Craven told Breitbart Texas in an email.\nFOX-7 reported that the Committee’s Chair, Rep. Harold Dutton (D-Houston), said that truancy should be civil. He wanted the records to be thrown out once the child finished with what the court has ordered.\nAs a topic, truancy is more than controversial – it can be divided. Some want to keep in place the punitive damages that continue to criminalize minors’ behavior to “teach them a lesson” while others want to see the archaic laws either relaxed or removed from the books completely.\nBreitbart Texas reported that the state prosecutes children for ditching classes at double the rate of all other 49 states. Texas Appleseed cited over 115,000 truancy cases were sent to adult criminal courts. Only about 1,000 truancy cases were handled in Texas juvenile courts that year. Fewer than 50,000 of truancy cases were filed in the juvenile courts of all other states combined.\nTruancy is a Class C Misdemeanor juvenile crime that still lingers from the 83rd Legislature when other behavioral infractions were decriminalized and replaced with at-risk and remediation measures, Breitbart Texas reported.\nThree unexcused absences in four weeks can land a child in court. Schools must file charges against minors who have more than 10 unexcused absences in six months. The resulting charges and fines for truancy can have far reaching consequences as the gateway to the “school-to-prison pipeline,” where truancy introduces youth to the juvenile and criminal justice systems, although it does nothing to correct the absenteeism problem.\nAt the Capitol, child defense attorney Mani Nezami told KXAN-TV that too many Texans start out as criminals early on because of truancy charges.\nTruancy cuts across all demographics. It can affect suburban students, their parents and homeschoolers, too. Once charges are filed they can have long lasting repercussions. They create a criminal paper trail and, if those documents are visible, they can wreak havoc on college and job applications. It often requires the paid services of an attorney to seal and later expunge the records. Underprivileged juvenile violators cannot always afford the fines nor the lawyer. They do not pay them. This can turn into arrest and jail time once those youths turn 17 years-old.\nMany, like Dallas County, continue to defend the practice of prosecuting children for truancy as Breitbart Texas reported. In 2013, the Atlantic Monthly exposed the cottage industry of criminalizing childhood in Texas truancy courts. The article pointed to a money-making machine that from 2005 to 2009 saw truancy cases filed by public schools explode from 85,000 to 120,000.\n“Truancy courts are the traffic courts of public education, processing hundreds of parents and students daily in assembly-line fashion–even during summer months,” the article stated, highlighting that the Dallas courts alone handled an average of 35,000 cases a year, and their revenue was “eye-popping” — just over $2 million in FY 2009 and nearly $1.8 million in FY 2011. Truancy court was founded in 2003 because the problem of unexcused absences was overwhelming the juvenile court system; now Dallas has five truancy courts, each with its own judge and staff,” according to the Atlantic Monthly.\nAt the House committee meeting, a kinder gentler tale of truancy was told by 18-year-old single mom Emily Arroyo. KXAN-TV also reported that the teen mother was truant but her judge, Bill Gravell, did not dole out a $592 fine for her missing high school to tend to her infant son. Instead, he gave her daycare so she could go back to school.\nArroyo was in Austin to testify on behalf of keeping truancy laws in place based on her experience; however, according to Texas Appleseed’s searing new report, Arroyo’s case quite atypical from the vast majority of Texas truancy cases.\nAustin area truant officer Efrain Davila also wanted to keep the arcane practice. He told FOX-7 that he oversees a public school district with 10,000 students; however, he was cognizant of the criminally devastating consequences of the practice evidenced in his comments that truancy records should be expunged “where you wash the records every year.”\nHe said, “If there’s no long term effect, I think I’ll be happy.”\nNezami pointed out that the current harsh criminal punishments do not get to the root cause of the why children are getting truancy tickets or why they are absent in the first place.\nDespite differing opinions, it was a very promising day. Craven told Breitbart Texas, “I am generally very optimistic about the hearing —–it was great to see so many people engaged and interested. The members of the committee are obviously very interested in the issue and we look forward to working with everyone to come up with the best solution for Texas youth and families. We are hopeful that we will see the legislature take action this session.”\nOther than Texas, only Wyoming criminalizes truancy.\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2015/03/13/hold-ready-the-case-to-end-truancy-gets-first-hearing-at-texas-capitol/"}
