{"authors":["Chris Deerin","Scottish Daily Mail Columnist"],"date_download":"2018-10-22 22:01:10","date_modify":"2018-10-22 22:01:10","date_publish":"2016-01-11 02:09:16","description":"Chris Deerin says: By normal political calculation, the looming EU referendum should be the End of Days for the Conservative Party.","filename":"data/vaneerConsumption/TheConservatieEUcivilwaraffectsthemleastsaysCHRISDEERIN.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/02/28FB329A00000578-0-image-a-120_1452477918376.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-3393267_CHRIS-DEERIN-Tory-EU-civil-war-affects-rest-lose_1540245670.html","title":"The Conservatie EU civil war affects them least says CHRIS DEERIN","title_page":"The Conservatie EU civil war affects them least says CHRIS DEERIN | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"By normal political calculation, the looming EU referendum should be the End of Days for the Conservative Party. It is a voluntary mass leap from a high cliff onto jagged rocks, where unspeakable monsters wait to gobble up any unlucky survivors.\nIt is the moment in the Bond movie when the villain’s plot is finally foiled and his hollowed-out volcano collapses with all the evil henchmen still inside. It is the 19th-century missionary liberally seasoning himself before cheerfully climbing into the cannibal’s bubbling pot.\nIn Tory HQ right now, every red light should be flashing, every siren sounding, a recorded voice repeating ‘Please leave the building immediately’ (or perhaps just ‘RUUUUUNNNNNN’) on a loop.\nThe police, the ambulance service, the fire brigade, the Army, the IMF, the UN and Medecins Sans Frontieres should be racing towards Central Office, accompanied by a pack of St Bernards.\nHere’s why: the Tories are a party overwhelmingly for Out, led by a small elite who are for In. According to one report yesterday, nearly two-thirds of their 330 MPs support Britain’s exit, an estimate which seems, if anything, a little low.\nTheir leader, the Prime Minister, wants the opposite. David Cameron has reluctantly announced his Cabinet ministers can back either side, but is putting the squeeze on the most credible and influential of them to support his position.\nDavid Cameron has reluctantly announced his Cabinet ministers can back either side\nEmbarrassed\nWe may end up in a situation where noted sceptics such as Michael Gove, Theresa May and Boris Johnson are forced into a public war with the Out campaign, despite privately sharing its ambitions. On a matter of personal principle and reputation, that is not a recipe for a happy conscience, good relations or longer-term stability.\nIt has become increasingly difficult to find even a moderate minister or backbench Conservative MP who supports membership. I always like to make a point of asking, and in recent years had grown used to a wrinkling of the nose, followed by a slightly embarrassed smile and a softly spoken confession that they want to leave. Now, it’s the few remaining Inners who speak in hushed tones.\nThe momentum is for Out; the parliamentarians are for Out; the membership is for Out; the columnists are for Out; the bloggers are for Out. A groupthink is descending on the Conservative movement and it is one I recognise from last year’s Scottish referendum.\nThose who were for Yes were very, very, very for Yes. Their fervency left them exposed as little more than camp-followers, willing to believe in the absurd land of post-UK milk and honey projected by the SNP’s oracles. There was no reasoning with them – they weren’t interested in inconvenient facts or nuance and would merely repeat back to you the central mantras. If you hadn’t drunk the Kool-Aid, you were a non person.\nAs with Yes, so with Out. Out is cool – or what passes for cool in Toryland. Inevitably, there is a desire to be seen to be on the ‘right’ side of the argument, a concern about isolating yourself from your friends, a heady attraction to being on the radical, more energised side of the debate. Few in the salons of the Right willingly make the case for staying in the EU.\nThe Conservatives should be wobbling on the precipice. The EU is one of their very few catnip issues: it drives them, but almost no one else, batty. It leads this usually most rational and power-hungry of institutions to chase its tail.\nMany of Brexit’s advocates bring an unnervingly religious posture to their cause, an off-putting certainty that could never be matched by those thoughtfully supporting a reformed version of the status quo. Brexit aligns most of our governing party with the extremists of Ukip and the hard Left, and alienates the decisive, moderate voters of the centre ground.\nFurther, few have yet picked up on the risks the referendum poses to the economy. As the vote draws closer, and if the result is too close to call – which seems a likely scenario – companies at home and abroad will begin to cancel or delay investment; uncertainty will play havoc with the markets; the housing market, especially at the top end, will freeze. This will have consequences for growth, jobs and tax revenues in an already fragile climate.\nHe might currently argue otherwise, but if Cameron loses the referendum he will almost certainly have to resign. Those who dispute this fail to appreciate just how bitter things are about to get. As the campaign hots up the argument will become ever more polarised.\nNext, as William Hague has pointed out, Scotland, which will have voted to stay in the EU, will hold another independence referendum and in those circumstances is much more likely to choose to leave the UK. Outers clearly view this as a price worth paying.\nChaos\nThe public will be well aware that all this chaos has stemmed from a desire simply to get the Tories out of an internal party dispute. So if the EU crisis is to dominate 2016 in British politics, it stands to reason the Conservatives should pay the price.\nFor any half-decent opposition the referendum would offer a potential free pass back to government.\nAnd yet, for as long as Jeremy Corbyn remains Labour leader, the Right are safe to do whatever they want – there is nothing they could devise that would frighten the electorate more than Corbyn and his hard-Left crew already do.\nEven yesterday, as Cameron faced questions about his future on the Andrew Marr show, the ludicrous shadow chancellor John McDonnell gave an interview from his constituency office – ‘plastered with murals of a united Ireland and cards declaring: “Behind every fortune lies a crime”’ – in which he called for talks with Argentina over the Falklands and refused to dismiss calls for Tony Blair to be tried for war crimes. Corbyn has anyway made it clear he is ambiguous about whether we retain EU membership.\nThe failure of Labour MPs to abort the appalling Corbyn experiment is bad enough for their own party’s future prospects.\nBut at a time when Britain faces an important existential choice and desperately needs a vibrant, robust opposition to head off the danger of Brexit and the subsequent break-up of the UK, their inaction is verging on treasonous.\nIn September Iain Pears released Arcadia, a novel in which a time machine’s creator goes back to the mid-20th century and pretends her invention is an abstract work of art. ‘I called it Momentum and told anyone who saw it that it was a biting critique of modernity, representing how the culture of the past was overwhelmed by the detritus of consumerist industrialism that was covering over the elegance of civilisation with mass-produced conformity,’ she says. ‘It was thus a radical critique of capitalism and a nostalgic vision of traditional society.’\nIn October, the Corbynites set up a group intent on dragging Labour back to the political dark ages. It’s called Momentum. Just saying.\nLOCKED IN AN UNWINABLE WAR Perhaps the closest we get to real-life Bond villains are the Central American drug lords.Joaquín Guzmán Loera Joaquín Guzmán Loera The actor and film-maker Sean Penn has just published an extra-ordinary interview with Joaquín Guzmán Loera, better known as El Chapo, the world’s biggest trafficker of cocaine, heroin, methamphetamine and marijuana. The Mexican, pictured right, has a fortune estimated at $1billion and a fleet of submarines, airplanes, trucks and boats to prosecute his grim trade. He was recently recaptured after escaping from prison through a hole beneath his cell that led to a mile-long tunnel estimated to have taken more than a year and $1million to build. In the interview, conducted in a jungle clearing shortly before his rearrest, Guzmán argues that the war on drugs will never succeed. ‘The day I don’t exist, [drug trafficking is] not going to decrease in any way at all. As time goes by, we are more people, and this will never end. If there was no consumption, there would be no sales. ‘It is true that consumption, day after day, becomes bigger and bigger. So it sells and sells.’ Depressingly, I suspect he’s right.","url":"https://www.dailymail.co.uk/debate/article-3393267/CHRIS-DEERIN-Tory-EU-civil-war-affects-rest-lose.html"}
