{"authors":["Ligaya Figueras"],"date_download":"2018-10-30 21:27:30","date_modify":"2018-10-30 21:27:30","date_publish":"2016-09-27 13:34:38","description":"DISH OF THE WEEK: Tostada de ceviche at De...","filename":"data/vaneerConsumption/ThecevicheatthisBufordHighwayrestaurantwillleaveyousmiling.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_th_da12f595b7390b224d3ce606beacfb79__1540934850.html","title":"The ceviche at this Buford Highway restaurant will leave you smiling","title_page":"The ceviche at this Buford Highway restaurant will leave you smiling","title_rss":"NULL","source_domain":"ajc.com","text":"img_6606\nDISH OF THE WEEK: Tostada de ceviche at De...Mar Cevicheria\nPlaza Fiesta, a strip mall on Buford Highway near the intersection of Clairmont Road, is such a happy place. There is its cheery logo – a smiley faced mosaic tile sun – that greets you at every entrance. There are the multicolor papel picado streamers that hang from the ceiling. There is the indoor kiddie play area and arcade games to boot. And then there’s the food court.\nThe day of my most recent visit was a scorcher, so I was in the mood for something cooling. I found it in the form of a tostada de ceviche from De...Mar Cevicheria, which focuses on all things fish and seafood. A crispy round corn tortilla was stacked with lime-cured shrimp, crab and octopus, fresh fixings like red onion, tomato, lettuce, cilantro and thick slices of avocado – all waiting to be doctored up with hot sauce, lime and salt.\nThat ceviche tostada is as vibrant as anything in Plaza Fiesta – brighter still when you order it with a cup of house-made tepache (a fermented pineapple drink). And it’ll give you just the energy you need to keep browsing among the shops and kiosks for perfume, suitcases, soccer paraphernalia and other flea market-type finds.\nDe...Mar Cevicheria, Plaza Fiesta, 4166 Buford Highway, Atlanta. 404-633-2110, demaratlanta.com\n>>Read about some of our other favorite dishes from Atlanta restaurants\nMORE BUFORD HIGHWAY DINING COVERAGE\n>>5 dishes worth the drive on Buford Highway\n>>You’re going to have to pass up a lot of good food to get to this Buford Highway restaurant. You should.\n>>Mariscos el Malecon to open on Buford Highway in mid-August\n>>Dish of the Week: This Buford Highway okra dish might make you ditch the fried okra","url":"https://www.ajc.com/blog/atlanta-restaurants/the-ceviche-this-buford-highway-restaurant-will-leave-you-smiling/MgGMj5kPFv2qzDWu3fqaYM/"}
