{"authors":["John Hayward"],"date_download":"2018-10-30 18:52:31","date_modify":"2018-10-30 18:52:31","date_publish":"2015-02-24 23:51:50","description":"These are times of panic for the Church of Global Warming. Science has failed them.","filename":"data/vaneerConsumption/TheChurchofGlobalWarmingCanStillBurnaHereticOrTwo.json","image_url":"https://media.breitbart.com/media/2015/02/Global-Warming.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_24__1540925551.html","title":"The Church of Global Warming Can Still Burn a Heretic Or Two","title_page":"The Church of Global Warming Can Still Burn a Heretic Or Two","title_rss":"NULL","source_domain":"breitbart.com","text":"To appreciate the psychology of the global-warming cult, one must understand a few contextual details. Most importantly, these are times of panic for the Church of Global Warming. Science has failed them. The global warming they predicted is going into its third decade of not happening. Polar ice and sea levels aren’t doing what they predicted. Much of their seminal research has been exposed as academic fraud, based on cute little games like ignoring large periods of history that don’t conform to their man-made climate change models, fudging temperature measurements, and changing the methodology for recording and estimating global temperatures at during different historical periods. Their recent attempts to scare up a few headlines favorable to the movement, such as the big media fuss about 2014 being the “hottest year in history,” have collapsed under scrutiny as exaggerations or outright falsifications.\nSecondly, this is a movement about social status and pseudo-intellectual culture, as much as it’s ever been about science. That’s why so much of Big Climate’s behavior is cultish in nature, including its conspiracy-theory paranoia, and its savage treatment of heretics and blasphemers — they’re not shy about comparing skeptics to Holocaust deniers or 9/11 truthers, as seen in the Daily Beast’s hyperventilation over the story of skeptic Wei-Hock Soon’s corporate funding. Belief in global warming is a cultural marker, an aspect of the same vapid credentialism that gives leftists the vapors when someone who doesn’t have an Ivy League degree considers running for President.\nOf course, this obsession with credentials evaporates when it comes to global-warming believers. From the Daily Beast:\nWillie Soon, for example, should never have been given much credence in the first place. Like nearly all of the Climate Truthers’ scientists, he is not a climate expert. He’s not even an astrophysicist, as he is often presented. As The New York Times revealed, “He is a part-time employee of the Smithsonian Institution with a doctoral degree in aerospace engineering.” This is par for the course. The Heartland Institute, one of the leading Climate Truther think-tanks, put together a poster of “58 experts [who] don’t believe global warming is a crisis.” But a review of those “experts” by The Daily Beast found that only three of the 58 actually have any credentials in climatology or atmospheric science. (16 are conservative political pundits, 11 are meteorologists, six are conservative economists, and the rest a hodgepodge.) What’s not par for the course is Soon’s history of non-disclosure regarding his funding from the fossil-fuel industry, which was only revealed because, as an employee of the Smithsonian, the funding documents were covered by the Freedom of Information Act. Greenpeace obtained those documents and made them public. To his funders, Soon called his scientific papers “deliverables.” To the scientific community, in violation of professional standards, he said nothing about having been paid to produce the “deliverables” by fossil-fuel interests, including the Southern Company (a utility holding company) and the Charles G. Koch Foundation.\nAlso not “climatologists:” Leonardo di Caprio, Robert Kennedy Jr., Al Gore, Barack Obama, and Rajenda Pachauri, the U.N. climate honcho currently sliding down the global-warmist memory hole due to sexual harassment allegations. Before that, Pachauri was noted for straight-up science denialism and making hilariously inaccurate doomsday predictions, but nobody in the Church of Global Warming seemed concerned about his lack of climatology credentials. Incidentally, Pachauri described climate change as his “religion” on his way out the door.\nFinally, there’s the intimate connection between the global-warming cult and its patrons in collectivist politics, who view climate change as an indispensable opportunity to seize money and power — a claim in which politicians get to represent the Earth itself against the grubby little people they’re not terribly fond of, even when they’re not trying to promote a scary story about aerosol deodorant, cow farts, air conditioners, and automobiles unleashing the apocalypse.\nThis is reflected in the climate-change movement’s belief that their money is clean and pure, while the funding of skeptics is pure concentrated evil, especially if it comes from the hated fossil-fuel profiteers. A dollar from environmental activist Tom Steyer is as sacred as a communion wafer, while a buck from the (gasp!) Koch Brothers is supercharged with world-destroying menace, like the little piece of David Warner sitting in the microwave at the end of “Time Bandits.” Don’t you dare even ask about how much money Al Gore has made off climate alarmism.\nMost pure and luminous of all are compulsory tax dollars extracted from the rubes and poured into Big Climate, a funding stream so transcendent that it’s supposed to be invisible – that’s how climate change, one of the biggest industries on the planet, pretends to be an order of selfless monks living hand-to-mouth while they mount a brave resistance against the well-tailored minions of Big Oil.\nDisclosure standards are matters of fact, set by each publication and made known to its contributors; it is fair enough to complain about violations, as Soon is accused of doing in at least 11 cases over the past six years, according to the New York Times. Of course, the Church of Global Warming gives itself unlimited discretion to violate academic standards, and has been known to endorse all sorts of hoopla (such as Hollywood fantasies about climate apocalypse) that it knows are ridiculous, because it’s considered worthwhile to “raise public awareness” by any means necessary. It’s also interesting to note how the Times tap-dances around the fact that everyone in the climate change movement knew perfectly well where Dr. Soon got his money from, and incessantly complained about it. The amount in question, $1.2 million, is chump change by the standards of Big Climate. There seems to be a good deal of revulsion about how he viewed himself as a contractor with a job to do.\nWhile we enjoy the spectacle of those who blew off the Climategate revelations of academic fraud shrieking that Soon didn’t properly disclose the corporate funding they always knew he had, we might reflect on the funny thing about actual science: it doesn’t really care who funds you, or how noble your intentions supposedly are. Science welcomes skepticism from all sources; what does not kill a good theory makes it stronger. The Church of Global Warming is reduced to blaming corporate saboteurs for tricking the public into doubting a sacred “scientific consensus” that was never even remotely true, because that illusion of faith is all they have left. But then, faith in collective judgment — and submission to collectivist politics — is what this was always about. Meanwhile, climate change still isn’t happening, and the true believers still can’t explain why it’s not.","url":"https://www.breitbart.com/politics/2015/02/24/betrayed-by-science-the-church-of-global-warming-can-still-burn-a-heretic-or-two/"}
