{"authors":["Will Martin"],"date_download":"2018-10-30 22:46:24","date_modify":"2018-10-30 22:46:24","date_publish":"2016-12-12 00:00:00","description":"The Italian government is ready and willing to step in to help stricken lender Monte dei Paschi di Siena if a private recapitalisation plan fails.","filename":"data/vaneerConsumption/Thecrisisattheworldsoldestbankisedgingclosertoasolution.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_italy-monte-dei-paschi-bailout-approaching-2016-12_1540939584.html","title":"The crisis at the world's oldest bank is edging closer to a solution","title_page":"    Italian Treasury ready to bail out Monte dei Paschi if private recapitalisation fails - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters/Stefano Rellandini The Italian government is ready and willing to step in to help stricken lender Monte dei Paschi di Siena if a private recapitalisation plan fails, according to a source within the country's Treasury, as first reported by Reuters.\nEfforts to ensure that a €5 billion (£4.2 billion, $5.2 billion) recapitalisation plan for the bank accelerated over the weekend, after the European Central Bank rejected Monte dei Paschi's request for an extension\nThe bank's deadline to raise new capital is the end of the year, but if it does not reach that target, the Italian Treasury is now ready to step in.\n\"There is confidence at the economy ministry that Monte dei Paschi's cash call can succeed. If the operation failed, the state would carry out a precautionary recapitalisation,\" a Treasury source told Reuters on Monday morning.\n\"The bank's existence and its clients' savings will be preserved under any circumstances,\" the source added.\nTechnically speaking, if the Italian Treasury did end up stepping in, it would be breaking EU-mandated rules surrounding government interventions in banks, and the Italian government could face sanctions from Brussels.\nSome certainty returned to the Italian political climate on Sunday, after President Sergio Mattarella appointed foreign minister Paolo Gentiloni to be the country's next prime minister and tasked him with forming a technocratic government. Pier Carlo Padoan, the country's finance minister, was the favourite to become PM, but he has been left in his position, ostensibly to help deal more directly with the Monte dei Paschi issue.\nNew Italian Prime Minister Paolo Gentiloni Reuters/Remo Casilli\nThe already difficult problem of Monte dei Paschi looked to be made even more complicated last week when Matteo Renzi stepped down as prime minister after his referendum loss. After his resignation, fears hit the markets that a long period of instability could occur in the Italy, but the swift resolution of the prime minister issue could boost confidence.\nReuters reports that with a new government in place Qatar's sovereign wealth fund could invest €1 billion in Monte dei Paschi, something that would have been unlikely if the political vacuum remained.\nThe bank will look to raise more capital by reopening a so-called debt-to-equity swap offer — where shareholders are given the chance to exchange their stock for a predetermined amount of debt — that raised €1 billion last week. The upper limit on the new swap will be €2.4 billion.\nMonte dei Paschi is the world's oldest bank, but has hit trouble in recent years thanks to the huge amount of bad debt on its books. There are €360 billion in impaired loans in the entire Italian system, according to the Bank of Italy, of which €200 billion are of the worst sort, non-performing \"sofferenze.\" Monte dei Paschi holds a disproportionately high number of those loans.","url":"https://www.businessinsider.com/italy-monte-dei-paschi-bailout-approaching-2016-12"}
