{"authors":["Sara Tan"],"date_download":"2018-10-30 23:24:20","date_modify":"2018-10-30 23:24:20","date_publish":"2014-08-13 19:30:03","description":"It seems like you can't say DKNY without thinking of Cara Delevingne these days. Over the last two years, the cheeky \"It\" girl has appeared in four campaigns for DKNY. It's safe to say that she is Donna Karan's chosen one. Because it makes complete…","filename":"data/vaneerConsumption/TheCaraDelevingnexDKNYCollectionisHereAndIWantAllOfIt.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/668b0c7e-956f-4983-9dfe-ec62bd6c50c4.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35651-the-cara-delevingne-x-dkny-collection-is-here-and-i-want-all-of-it_1540941860.html","title":"The Cara Delevingne x DKNY Collection is Here And I Want All Of It","title_page":"The Cara Delevingne x DKNY Collection is Here And I Want All Of It","title_rss":"NULL","source_domain":"bustle.com","text":"It seems like you can't say DKNY without thinking of Cara Delevingne these days. Over the last two years, the cheeky \"It\" girl has appeared in four campaigns for DKNY. It's safe to say that she is Donna Karan's chosen one. Because it makes complete sense to capitalize on their popular partnership, the two decided to collaborate on a line for the fashion house. Although it is not being released until October, the 24-piece Cara Delevingne for DKNY Collection has leaked. And as expected, it's pretty incredible.\nThe capsule collection has a very '90s/athletic/tomboy feel to it, including everything from tank tops and track pants to beanies and jumpsuits. The jackets, which feature a leather, bomber and blazer, are perfect for fall. The tees, some of which have her face on it, look chic and comfy, a perfect match dressed down with a pair of boyfriend jeans or up with a leather mini. Perhaps my favorite pieces from the entire line are her sports bras — they're stylish enough to wear outside the gym, further feeding into the year's biggest trend: athleisure wear.\nUnlike other celebrity fashion collabs I've seen before, I think that this collection is a truly honest representation of Delevingne's real and personal style. All the pieces look like something she would totally be snapped wearing on the street or would take a selfie of for her millions of followers on Instagram. To make things even cuter and more personal, it appears as though Delevingne penned the press release herself, expressing how excited she is about the collection. She also gives tips on how she thinks you should style her collection, suggesting you should layer her pieces, starting with the crop top. Check out the press release below.\nDKNY.com\nAccording to Fashonista, the prices for the collection will range from $70 to $370 and will be available at DKNY's Madison Avenue store, Bloomingdale's 59th St. store, DKNY.com and Shopbop starting October 15. Check out some of the best pieces below!\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com\nDKNY.com","url":"https://www.bustle.com/articles/35651-the-cara-delevingne-x-dkny-collection-is-here-and-i-want-all-of-it"}
