{"authors":["Taylor Maple"],"date_download":"2018-10-31 01:50:29","date_modify":"2018-10-31 01:50:29","date_publish":"2018-09-06 13:00:52","description":"You might think that after so many seasons of living in the same house with one another, the cast of Jersey Shore would know each other's personalities like the back of their perfectly tanned, fist-pumping hands. And, as evidenced by their recent…","filename":"data/vaneerConsumption/TheCastOfJerseyShoreShowsJustHowWellTheyKnowEachOtherVIDEO.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/5/754bbeab-e1f2-43f2-9665-f206c1207381-sp007_jshore_nologo2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-cast-of-jersey-shore-shows-just-how-well-they-know-each-other-video-11717332_1540950629.html","title":"The Cast Of 'Jersey Shore' Shows Just How Well They Know Each Other - VIDEO","title_page":"The Cast Of 'Jersey Shore' Shows Just How Well They Know Each Other — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"You might think that after so many seasons of living in the same house with one another, the cast of Jersey Shore would know each other's personalities like the back of their perfectly tanned, fist-pumping hands. And, as evidenced by their recent visit to Bustle's New York offices, you'd probably be right. We turned the camera on them to find out how well the Jersey Shore cast knows each other, and some of their answers might surprise you.\nThe gang was (mostly) all there — Pauly D, Vinny, Deena, Nicole, JWoww, Mike and Angelina sat down in Bustle Studios, and we asked them a series of questions designed to showcase some juicy insider details. Among them — who had the most hook-ups in the house throughout the seasons of Jersey Shore? Who is the most well-read of the bunch? Who spends the most money on clothes? Out of the group, who would everyone vote for for President? Conversely, who would they deem unpresidential, and impeach from office?\nLongtime fans can speculate on what the cast might say to each of these questions, and the others we asked, but there are some shockers and squabbles to be had as they discuss their choices. Listening to them explain their reasoning is equal parts adorable and hilarious, and it's totally obvious that they've become a family, just like they always say.\nSee for yourself:\nNow fans know the cold, hard facts — Ronnie would be lovingly impeached by his housemates should he ever ascend to office, while all the rest of them could quickly hire a campaign manager from within the cast. Jenni's cooking vs. Mike's is incredibly controversial, though Vinny's mom's probably takes the cake. And Pauly D brought the most girls home from the club, as one might have expected.\nHonestly, we'll take as many little tidbits of information from this cast as we can get. After six seasons of the original show on MTV, and now the reunion Family Vacation has given viewers recently, the band of pals has been welcomed into viewers' living rooms more times than we can count. And with a second season already airing, they're not slowing down any time soon.\nMTV on YouTube\nVinny recently told TVInsider that he knows the show is basically one giant meme, and that's what he thinks keeps Jersey Shore so fresh and engaging. \"Things go viral so quickly now. We have so many catchphrases and all the GIFs and memes,\" he said. \"It keeps spreading awareness of what is going on. It’s like one old school AOL chatroom when you would talk and see who was online. Now it’s like the entire world is watching it together and making each other laugh. So that’s my favorite part of doing it now.\"\nThe reality show's reboot has received largely rave reviews that both praise the cast's more grown-up personas, and celebrate the mayhem that still sticks around. Uproxx's Pilot Viruet called Season 1 of Family Vacation \"a fascinating text in watching a reality show cast grow up on screen, showing how much people can grow and change,\" despite the partying they still partake in.\nAnd that's what makes Family Vacation so enjoyable — the cast isn't pretending to be their younger, wilder selves, but they haven't lost their edge, and remain just as entertaining — and tight — as ever.","url":"https://www.bustle.com/p/the-cast-of-jersey-shore-shows-just-how-well-they-know-each-other-video-11717332"}
