{"authors":["Abc News","More David"],"date_download":"2018-10-30 00:52:26","date_modify":"2018-10-30 00:52:26","date_publish":"2018-10-28 12:32:54","description":"Even for an institution that measures its milestones by the millennium, the Roman Catholic Church is now wrestling with an urgent moment of truth.","filename":"data/vaneerConsumption/TheCatholicChurchreachesaturningpointANALYSIS.json","image_url":"https://s.abcnews.com/images/International/pope-gty-er-181028_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/International_catholic-church-reaches-turning-point-analysis_story_id=58807508_1540860746.html","title":"The Catholic Church reaches a turning point: ANALYSIS","title_page":"The Catholic Church reaches a turning point: ANALYSIS - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Even for an institution that measures its milestones by the millennium, the Roman Catholic Church is now wrestling with an urgent, some would say epochal, moment of truth.\nIt’s an existential crisis brought on by two threats from within: the worldwide sexual abuse scandal and deep internal divisions over the core message of the faith. The last time the Vatican faced a crisis this big, according to some respected church scholars, was 500 years ago during the Protestant Reformation.\nFilippo Monteforte/AFP/Getty Images\nThe battle lines in the church mirror the divisions of Trump’s America. The partisan infighting, just as bitter. And what makes it more than just the standard squabbling among the curia is the larger sexual abuse scandal looming in the background. This is what reformation looks like in the #MeToo era.\nThe Martin Luther of the new rebellion is the archbishop who dared to call on the pope to resign for turning a blind eye to the sexual misconduct of an American cardinal. Archbishop Carlo Vigano, former papal nuncio to the U.S., has faced serious pushback from the pope’s defenders for calling out Francis over his handling of disgraced former Cardinal Theodore McCarrick. Vigano is in hiding, saying he fears for his life. But he’s not backing down.\nVigano’s new letter denounces what he calls the \"scourge of homosexuality\" in the clergy which he now flat-out claims is to blame for the broader sexual abuse scandal rocking the church Vigano urges his fellow bishops to back him up.\n\"You too are faced with a choice,\" writes Vigano. \"You can choose to withdraw from the battle, to prop up the conspiracy of silence and avert your eyes from the spreading of corruption. You can make excuses, compromises and justification that put off the day of reckoning. You can console yourselves with the falsehood and the delusion that it will be easier to tell the truth tomorrow, and then the following day, and so on. On the other hand, you can choose to speak. You can trust Him who told us, 'the truth will set you free.'\"\nVigano enjoys strong support particularly among U.S. conservative Catholics who are not big fans of Francis. For instance, there’s this op-ed from Monsignor Charles Pope who, writing in the National Catholic Register, calls Vigano’s latest missive \"courageous.\"\nRadogna/Giacomino/Ropi via ZUMA Press\n\"Some will surely bristle at the Archbishop’s 'strong language,'\" writes Pope. \"But I ask you, is it really so different from the way the Lord Jesus spoke? Perhaps the bristling is more emblematic of our dainty and thin-skinned times -- times marked by identity politics, cries of victimization, and every form of shock and outrage over the slightest reproach. In my estimation this letter of Archbishop Vigano will go down in history as one of the great moments of pastoral exhortation and integrity. It will shine forth as a clarion call in an age of timid silence from too many other prelates and priests.\"\nFrancis’s critics are appealing to the public’s disgust with the institutional corruption that enabled the epidemic of sexual abuse to fester for decades. But in calling out Francis, they also draw attention to the failures of his predecessors.\nMatt Rourke/AP, FILE\nThe full horrors of the sexual abuse scandal are only now starting to come into focus. More than a decade after the Boston Globe Spotlight series, there’s a new wave of abuse allegations in this country, led by the Pennsylvania grand jury report. That report this past summer accused more than 300 predator priests of molesting more than 1,000 victims going back 70 years and implicating dozens of bishops in the cover-up. The vast majority of those cases are well beyond the statute of limitations, but the report has already caused major fallout in the church. One of the nation’s most prominent Catholic leaders, Cardinal Donald Wuerl, lost his job as Archbishop of Washington, DC.\nThe Pennsylvania report covered just one state. More than a dozen others are now starting investigations of their own. The Justice Department has launched a federal probe too. This pattern is being repeated worldwide -- in Ireland, Germany, Australia, the list goes on and on.\nIt’s one big reason the pews are thinning out. In the U.S. alone, a recent study found that for every new person who joins the faith, six people are leaving. That’s unsustainable. For every new convert, there are now 6.5 million former Catholics. Catholicism is still the world’s largest Christian denomination, but Evangelical churches are winning more converts, and the world’s fastest growing religion by far is Islam.\nBefore this new onslaught of abuse allegations, Francis sought to fight those unsustainable demographics with what he calls the \"New Evangelization.\" He changed the focus of the Catholic message, offering a more friendly face to the millions of people the Church has alienated over the years. On his first overseas trip as pope, a reporter asked his thoughts about homosexuality and the priesthood. He famously answered: \"Who am I to judge?\" He has set a softer tone on divorce and remarriage. And he’s emphasized social justice, immigration, and concern for the environment to a degree that he has sometimes put him at odds with the proponents of unfettered capitalism.\nSpencer Platt/Getty Images\nBut that shift in focus is not so popular with Catholics who kept the faith through the papacies of Pope John Paul II and Pope Benedict XVI. And that’s partly what gives Archbishop Vigano a receptive audience.\nThe coming year is likely to bring new potential flash points, as more law enforcement agencies focus on the sexual abuse issue and the pope’s critics continue their campaign to undermine him.\nThe next big test here in the U.S. may be the appointment of Cardinal Wuerl’s successor as Archbishop of D.C. That man’s politics and pedigree are liable to face tough scrutiny because of the bigger issues roiling the church.\nIt could well be the Catholic equivalent of the Kavanaugh nomination.","url":"https://abcnews.go.com/International/catholic-church-reaches-turning-point-analysis/story?id=58807508"}
