{"authors":["Jo Tweedy For Mailonline"],"date_download":"2018-10-23 02:59:10","date_modify":"2018-10-23 02:59:10","date_publish":"2017-04-26 14:13:54","description":"Far from being a ticket to happiness, winning a fortune can wreak havoc. This week it was revealed that Gareth and Catherine Bull, who pocketed a £40.6million in 2012, are leading separate lives.","filename":"data/vaneerConsumption/ThecoupleswhosplitafterwinningtheLOTTERY.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F98607500000578-0-image-a-53_1493207018847.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4443958_The-couples-split-winning-LOTTERY_1540263550.html","title":"The couples who split after winning the LOTTERY","title_page":"The couples who split after winning the LOTTERY | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For most of us, it's the stuff of idle daydreams; scooping enough cash to never worry about money again.\nHowever, while swimming in lottery readies might pay off the mortgage, it can also send life off the rails in spectacular fashion.\nThis week it was revealed that Gareth and Catherine Bull, who pocketed a cool £40.6million EuroMillions jackpot in 2012 are leading separate lives.\nScroll down for video\nCan't buy me love: Gareth and Catherine Bull became millionaires overnight following their big win in 2012 but have now said to have split\nMr Bull, a self-employed builder, bought the ticket in 2012 on a whim after he was unable to work one day because it was raining - the couple then scooped a whopping £40.6million\nBuilder Gareth, 45, is now living in a three-bedroom cottage just over a mile away from the family home and the couple are no longer Facebook friends, a sure sign of a relationship in crisis.\nWhile the pair may be building gilded lives apart, they can console themselves that they're not the first - and probably won't be the last - winners to fall foul of the lottery curse.\nHaving pots of cash is a game-changer that throws aspirations off course; from lottery jailbirds to broken relationships and social media mishaps, here's some of the ordinary people who've found that winning the lottery and winning at life are very different things.\nTHE MARRIAGES LEFT IN TATTERS BY A LOTTERY WIN\nThe Bulls split follows a pattern similar to many couples before them, including Les and Samantha Scadding (pictured), who scooped £45.5million in 2009, and divorced in 2013\nAdrian and Gillian Bayford (pictured), who won £148million in 2012, split just a year later\nIf the Bulls are heading to the divorce courts, they're not the first. Les and Samantha Scadding, who scooped £45.5million in 2009, divorced in 2013 and Adrian and Gillian Bayford, who won £148million in 2012, split just a year later.\nGillian Bayford also admitted that last year that she has not spoken to her 'greedy' family for nearly one year, despite giving them £20m after the windfall.\nShe claims her mother, father and brother - who all live in plush houses and drive flash cars thanks to her fortune - 'disowned' her last May, but still expect her to bail them out when they need money.\nElsewhere, Jason and Victoria Jones had been married for only a month when they scooped £2.3million on the lottery in 2004.\nHowever, the pair announced they were to divorce in August last year after Mrs Jones met a businessman one hundred times richer than her husband.\nTHE YOUNGEST EVER WINNER - WHO WANTED TO SUE CAMELOT\nJane Park, the youngest ever EuroMillions winner at 17, claimed she considered legal action against Camelot, claiming her life would have been '10 times better' had she not won £1million\nThe 17-year-old took home £1million from EuroMillions after getting lucky on her first ticket\nJane Park, the youngest ever EuroMillions winner at 17, once considered legal action against Camelot, saying her life would have been '10 times better' had she not won £1million.\nNow 21, she has since retracted the comments, saying: 'I feel like I have been listened to now and people are actually listening to the difficulties.'\nAfter collecting her prize, she splashed out on 34FF breasts and designer clothes but hasn't found life in the public eye easy, with angry rants on social media commonplace.\nA high profile relationship with X Factor contestant Sam Callahan came to an abrupt end after Hibs fan Park posted an image of herself in bed with another man.\nThis week it was revealed Park has hired two bodyguards to protect her after social media trolls threatened her with an acid attack.\nTHE 'LOTTO LOUT' WHO SQUANDERED HIS FORTUNE ON DRUGS\nMichael Carroll declared himself the 'king of chavs' after winning nearly £10million in 2002. However, he became known as the 'lotto lout' after serving time for drug crimes\nAfter squandering his winnings on drugs and prostitutes, Carroll was eventually declared bankrupt in 2010...and returned to his job as a binman\nNorfolk lottery winner Micheal Carroll declared himself the self-styled 'King of Chavs' when he won nearly £10million on the lottery in 2003. Despite his sudden vast wealth, Carroll soon began frittering it away on drugs and gambling.\nHe was given an ASBO for anti-social behaviour towards his parents and was eventually jailed in 2004 for cocaine possession. He served a further nine months for affray in 2009.\nBy 2010, he'd lost all of his fortune and was declared bankrupt. He returned to his job as a binman.\nHe said at the time: 'The party has ended and it's back to reality. I haven't got two pennies to rub together and that's the way I like it. I find it easier to live off £42 dole than a million.'\nLast year, Carroll's aunt and uncle died in a murder-suicide. Stephen, 47, and Allison Muncaster, 48, were both found dead at their home in Magdalen, Norfolk. At the time, nephew Carroll was said to be 'sad' at the news and didn't understand his uncle's motive.\nTHE WINNER WHO GOT SO BORED HE WENT BACK TO WORK\nSheet metal worker Roy Gibney, from Grimsby, won £7.5million on the lottery in 1998 and enjoyed a lavish life...before starting his own business because he was 'bored'\nGibney, who won his fortune at 44, now divides his time between Cyprus and his home near Grimsby\nDespite enjoying all the trappings of a millionaire lifestyle, the Grimsby local admitted that he was bored and enjoyed working long hours after setting up his own business\nWhen Roy Gibney, from Grimsby, picked up a cheque for £7.5million in 1998, it hurtled him from a life of just getting by to complete luxury.\nThe now 63-year-old promptly gave up work and splashed out on a luxury lifestyle including a home with a swimming pool that bore his name - and lottery numbers - on the bottom. A string of younger girlfriends followed and his status as a local celebrity was confirmed.\nHowever, 14 years after giving up work for the good life, he took a job as a fitter and says he's never been happier. In 2014, he told the Grimsby Evening Telegraph: 'I gave up work for 14 years, but I got bored.\n'I started a sheet metal business, and some nights I work from 7 in the evening until 7 in the morning, and I'm fitter and happier than I've been for years.'\nHe added: 'I only own one car – you can only drive one at a time, so there's no point in owning ten.'\nThe winner now spends much of his time in Cyprus with his wife and son.\nTHE BEGGING LETTERS THAT LED TO A MOVE ABROAD\nJohn Noakes, pictured far left, was part of a group of bus drivers who shared £38million in 2012...but the lottery winner was besieged by begging letters and lost track of his old friends\nNoakes and his wife Jean eventually moved to Cyprus for a quiet life and admitted it was hard trying to please all of his family with his new-found wealth\nAfter John Noakes scooped part of a £38million jackpot with his colleagues in 2012, he assumed his days of hardship were over.\nHowever, the Corby one-time bus driver found that fortune brought new problems including a constant stream of strangers asking for money.\nNoakes eventually made the decision to opt for a quiet life, moving to Cyprus with his second wife Jean.\nThe former Stagecoach driver said he has had to learn to keep track of his money to ensure it lasts, and that many of his old friends now 'don't want to know'.\nHe said after news of his win broke, he was approached by strangers in the street who ask him for money, and claims his former employers snubbed his offer to help out free of charge during the Olympic Games.\nMr Noakes added that it was 'tough' trying to be 'equally fair' to members of his family without upsetting anybody.","url":"https://www.dailymail.co.uk/femail/article-4443958/The-couples-split-winning-LOTTERY.html"}
