{"authors":[],"date_download":"2018-10-30 01:26:26","date_modify":"2018-10-30 01:26:26","date_publish":"2015-09-21 14:09:59","description":null,"filename":"data/vaneerConsumption/TheClimateHasBeenChangingSinceGenesis11SoWhyIsPopeFrancisSuddenlySoConcerned.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/themes/amspec-v1/_img/favicon.ico?v=2","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862786.html","title":"The Climate Has Been Changing Since Genesis 1:1, So Why Is Pope Francis Suddenly So Concerned?","title_page":"The Climate Has Been Changing Since Genesis 1:1, So Why Is Pope Francis Suddenly So Concerned?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Rep. Paul Gosar (R-Ariz.) tells Townhall.com that he is planning to boycott the Congressional address of Pope Francis this week. The reason? The Congressman is concerned that the speech is going to be completely politically correct, not traditionally Christian in focus. He also is outraged that the secular progressives at U.S. Environmental Protection Agency (EPA) helped co-write His Holiness’ environmental encyclical earlier this year, and does not want to offer even tacit support for that ideological document.\n“Media reports indicate His Holiness instead intends to focus the brunt of his speech on climate change–a climate that has been changing since first created in Genesis. More troubling is the fact that this climate change talk has adopted all of the socialist talking points, wrapped false science and ideology into climate justice and is being presented to guilt people into leftist policies. If the Pope stuck to standard Christian theology, I would be the first in line,” wrote Rep. Gosar. “If the Pope spoke out with moral authority against violent Islam, I would be there cheering him on. If the Pope urged the Western nations to rescue persecuted Christians in the Middle East, I would back him wholeheartedly. But when the Pope chooses to act and talk like a leftist politician, then he can expect to be treated like one. Artist and columnist Maureen Mullarkey effectively communicated this fallacy stating, ‘When papal preferences, masked in a Christian idiom, align themselves with ideological agendas (e.g. radical environmentalism) [they] impinge on democratic freedoms and the sanctity of the individual.’”\nConcluded the Congressman, “the earth’s climate has been changing since God created it, with or without man. On that, we should all agree. In Pope Francis’ encyclical on the environment (written with the consultation of that great seminary the EPA and its embattled head Gina McCarthy), he condemned anyone skeptical of the link between human activity and climate change and adopted the false science being propagated by the Left. If the Pope wants to devote his life to fighting climate change then he can do so in his personal time. But to promote questionable science as Catholic dogma is ridiculous.”\nThis item first appeared on Somewhat Reasonable, the policy and commentary blog of the Heartland Institute.","url":"https://spectator.org/64124_climate-has-been-changing-genesis-11-so-why-pope-francis-suddenly-so-concerned/"}
