{"authors":["Will Martin"],"date_download":"2018-10-31 00:10:49","date_modify":"2018-10-31 00:10:49","date_publish":"2018-07-12 00:00:00","description":"The City of London Corporation described the government's white paper as \"a real blow for the UK’s financial and related professional services sector.\"","filename":"data/vaneerConsumption/TheCityofLondonisfuriouswiththegovernmentsBrexitplanforfinance.json","image_url":"https://amp.businessinsider.com/images/5447d5c2ecad04bb128b4569-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_city-of-london-government-brexit-plan-for-finance-2018-7_1540944649.html","title":"The City of London is furious with the government's Brexit plan for finance","title_page":"    The City of London is furious with the government's Brexit plan for finance - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"REUTERS/Eddie Keogh\nMajor City of London lobbying groups are unhappy with the government's plans for the UK's financial services sector after Brexit, following the release of Prime Minister Theresa May's white paper on exiting the EU.\nUnder current rules, the UK uses the financial passport— a set of rules and regulations which allow UK-based finance firms to trade with and sell their services into Europe — but stands to lose those rights after Brexit. As such, a new plan for the financial services sector must be created.\nTwo groups — the City of London Corporation, and The City UK — have expressed their displeasure at new plans from May's government, which will seek a system of regulatory equivalence, rather than the previously mooted mutual recognition arrangement.\n\"Today's Brexit white paper is a real blow for the UK's financial and related professional services sector,\" the City of London's policy chairman Catherine McGuinness said in a statement.\n\"With looser trade ties to Europe, the financial and related professional services sector will be less able to create jobs, generate tax and support growth across the wider economy. It's that simple,\" McGuinness continued.\n\"The sector has been clear since the referendum: Equivalence in its current form is not fit for purpose so any 'enhancements' to this regime would have to be substantial.\"\nMcGuinness' thoughts were backed up by Miles Celic, the head of The City UK, which represents the whole of the UK financial services industry. Celic described the government's plans as \"regrettable and frustrating\" in a statement.\n\"The overriding issue for financial and related professional services firms is the ability to continue serving customers and clients,\" he said.\n\"Mutual recognition would have been the best way to achieve this. It's therefore regrettable and frustrating that this approach has been dropped before even making it to the negotiating table.\"\nUnder the plans in the white paper, the government said it will seek to improve on existing requirements for equivalence of rules between the EU and outside countries.\nEquivalence is a framework whereby the EU acknowledges that the legal, regulatory and supervisory regime of a non-EU country is as good as its own, and therefore allows that state access to the financial services sector within the bloc.\nThose rules, however, in the government's eyes, are \"not sufficient to deal with a third country whose financial markets are as deeply interconnected with the EU's as those of the UK are.\" Therefore, the white paper seeks to use those rules as a basis for a deeper arrangement between the two countries.\nSuch an arrangement, the white paper says would \"maintain the economic benefits of cross-border provision of the most important international financial services traded between the UK and the EU - those that generate the greatest economies of scale and scope - while preserving regulatory and supervisory cooperation, and maintaining financial stability, market integrity and consumer protection.\"\nThis, however, is not the City of London's favoured approach to post-Brexit financial services regulation. Finance groups favour the mutual recognition model, whereby the UK recognises EU regulations around the financial services industry, and the EU does the same with the UK, with both sets of rules closely aligned.\nDespite the anger of the City of London Corporation and The City UK, some groups are positive about the white paper's position.\nThe Association for Financial Markets in Europe, for example, said it welcomes the plans set out.\n\"We hope that this will form the basis for negotiations to progress, recognising the importance of minimising fragmentation, maintaining financial stability and close supervisory cooperation,\" a statement from chief executive Simon Lewis said.","url":"https://www.businessinsider.com/city-of-london-government-brexit-plan-for-finance-2018-7"}
