{"authors":["Isaac Meng"],"date_download":"2018-10-30 23:29:29","date_modify":"2018-10-30 23:29:29","date_publish":"2018-07-18 00:00:00","description":"The yuan has plunged 5% versus the dollar over the past three weeks. This has drawn comparisons to 2015 when China let its currency fall sharply, which roiled global markets. But markets seem more comfortable with yuan depreciation this time around.","filename":"data/vaneerConsumption/TheChineseyuansslideisconcerningbutnotsystemic.json","image_url":"https://amp.businessinsider.com/images/5b4f867f260a2927008b46c0-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-chinese-yuans-slide-is-concerning-but-not-systemic-2018-7_1540942169.html","title":"The Chinese yuan's slide is concerning but not systemic","title_page":"    The Chinese yuan's slide is concerning but not systemic - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Monetary signs are seen at a currency exchange in Hong Kong Thomson Reuters\nAmid fears of escalating trade tensions, the yuan's sharp depreciation against the dollar last month has spooked some investors who see similarities with China's currency devaluation in 2015, an episode that prompted capital outflows and roiled markets worldwide. Yet despite the similarities, differences in the macroeconomic backdrop suggest the global repercussions will be more limited this time.\nSimilarities\nBoth episodes shocked markets. Over the past 12 months, the yuan had fallen against the dollar but at a relatively stable pace. Yet in the three-week span following the Federal Reserve's 13 June interest rate hike and subsequent dovish moves from the People's Bank of China (PBOC), the yuan plunged as much as 5.0%. The devaluation on 11 August 2015 was even more abrupt: The yuan dropped by 2% in a single day as markets reacted to the unexpected de-pegging of the Chinese currency from the U.S. dollar (see chart).\nThe yuan's decline in both cases also reflected worsening macroeconomic pressures. Three years ago, it was the crash of China's A share market and cascading margin liquidation that compounded acute growth-deflation pressure. The recent move reflects escalating trade tensions with the U.S. and policy-induced domestic debt deleveraging.\nFinally, both episodes occurred when the yuan was slightly overvalued. Interest rate differentials between the yuan and dollar were narrowing when the PBOC eased policy on 25 June by cutting banks' required reserve ratio. Meanwhile, the Federal Reserve remains on its tightening path.\nDifferences\nThe key difference between the episodes, of course, is trade relations with the U.S. On 5 July, Washington imposed 25% tariffs on an initial $34 billion of merchandise, prompting an immediate tit-for-tat response from Beijing. We estimate U.S. tariffs will trim 10-20 basis points off Chinese GDP. The threat of 10% tariffs on an additional $200 billion of Chinese goods could inflict further damage.\nAlthough the PBOC has categorically ruled out using foreign exchange policy as a trade tactic, a more market-driven exchange rate will inevitably reflect negative fundamentals. For instance, a trade compromise between Beijing and Washington, should we see one, would almost certainly entail a sizable reduction in China's $300 billion surplus. (China's current account has shrunk to near zero, a sharp drop from 2.7% of GDP in 2015.)\nGoing forward, we expect moderate depreciation of the yuan, which may help offset the impact of U.S. tariffs. Indeed, the central bank has shown willingness to tolerate higher volatility and to let the currency act as a shock absorber - as long as the moves are driven by fundamentals and there's no big spillover to financial stability.\nMarkets also seem more comfortable with yuan volatility. Whereas the devaluations in 2015 and 2016 triggered a surge of capital outflows, today many Chinese households and companies have sizable foreign assets and foreign exchange hedges. Indeed, despite the yuan's weakening in June, there were strong inflows into China's government bond market.\nThis likely reflects a perception of restored credibility in China's currency regime. PBOC policy communications have become quite effective and likely helped prevent overshooting last month. Thus, so long as the yuan's depreciation is driven by cyclical policy divergence and reflects the negative impact of protectionist pressures, we don't think Beijing will draw any lines in the sand for the yuan-dollar exchange rate.","url":"https://www.businessinsider.com/the-chinese-yuans-slide-is-concerning-but-not-systemic-2018-7"}
