{"authors":[],"date_download":"2018-10-30 01:26:16","date_modify":"2018-10-30 01:26:16","date_publish":"2015-09-22 08:00:00","description":null,"filename":"data/vaneerConsumption/TheClimateLeftsBeliefinPapalInfallibility.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/09/Screen20Shot202015-09-2120at203.38.2720PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862776.html","title":"The Climate Left’s Belief in Papal Infallibility","title_page":"The Climate Left’s Belief in Papal InfallibilityThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Pope Francis has yet to invoke the doctrine of papal infallibility for his environmental encyclical, Laudato si’. That would require the agreement of all of his bishops. Not all of the world’s leading Catholic clerics have concurred on the secular doctrine of environmental alarmism.\nBut an unconventional ecumenical ally has. The U.S. Environmental Protection Agency co-wrote the encyclical, according to an op/ed by Rep. Paul Gosar (R-Ariz.), a Catholic congressman who is boycotting the pope’s planned address to the Congress this week.\n“In Pope Francis’ encyclical on the environment — written with the consultation of that great seminary the EPA and its embattled head Gina McCarthy — he condemned anyone skeptical of the link between human activity and climate change and adopted the false science being propagated by the Left. If the Pope wants to devote his life to fighting climate change then he can do so in his personal time,” wrote Rep. Gosar. “But to promote questionable science as Catholic dogma is ridiculous.”\nAmerica’s high priests of pollution policy have admitted they influenced the content of the encyclical, which some say placed the church in the middle of a divisive political, rather than moral, debate. Not many in the media have noticed, however, thinking the environmental encyclical, as contrasted with church teaching on abortion, for instance, is a divine revelation with demands on the conscience of all Catholics.\nGina McCarthy, the controversial head of the EPA, known for dodging Congressional subpoenas, earlier this year met with Vatican officials and told reporters her goal there was to “show the Vatican how aligned President Barack Obama and Francis are on climate change.”\nMcCarthy claims that global warming isn’t just an “environmental issue,” but also a public health threat for the planet.\n“I think the most important thing we can do, working with the pope, is to try to remind ourselves that this is really about protecting natural resources that human beings rely on, and that those folks are most vulnerable, that the church has always been focused on, those in poverty and low income, are the first that are going to be hit and impacted by a changing climate,” said McCarthy.\nMcCarthy sees much more public policy potential with the encyclical than even the head of the U.S. Conference of Catholic Bishops (USCCB). “The Holy Father calls all people to consider our deep and intertwined relationships with God, our brothers and sisters, and the gifts that our Creator has provided for our stewardship,” writes Archbishop Joseph Kurtz, of Louisville, and president of the USCCB, in a very traditionalist, Roman Catholic tone.\nBut the archbishop of Chicago, Blase J. Cupich, this summer responded to the papal encyclical by ordering all 2,700 buildings owned by the church in Chicago be made “energy efficient.”\nThat may well reflect the heightened right-left divide in the church today, which began emerging in the 1960s after the reforms of Vatican II. The liberal Catholic clergy and their lay counterparts want to see the church in a more activist role in the secular world, but conservative clergy and their lay followers would like things to remain the same, with the church being a moral, rather than a politically correct public policy, voice.\nThis week’s U.S. tour by Pope Francis will test the church’s bonds further. The pope seems to be something of a secular star in the American media and in U.S. pop culture and the bobble-head dolls and even more kitschy items on sale in anticipation of his visit to Philadelphia, Washington, D.C., New York City, and Philadelphia this week attest to that. But that still does not mean that the environmental encyclical is infallible for Catholics, no matter what the mainstream media and the EPA may say, or believe.","url":"https://spectator.org/64131_climate-lefts-belief-papal-infallibility/"}
