{"authors":["Bustle Studios"],"date_download":"2018-10-31 01:38:24","date_modify":"2018-10-31 01:38:24","date_publish":"2018-08-28 15:41:37","description":"If you're like us, you're always looking for a new reality show to sink your drama-thirsty teeth into. Lucky for you, MTV has yet another glossy, aspirational-yet-guilty pleasure show to satiate you. (What would we do without them?)\nMTV's Pretty…","filename":"data/vaneerConsumption/TheCastOfMTVsPrettyLittleMamasIsYourNextNewObsession.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/22/e33a399f-e2e0-420c-85ac-82b94d9fb9c0-pretty-little-mamas-1-2000.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-cast-of-mtvs-pretty-little-mamas-is-your-next-new-obsession-10200858_1540949904.html","title":"The Cast Of MTV’s 'Pretty Little Mamas' Is Your Next New Obsession","title_page":"The Cast Of MTV’s 'Pretty Little Mamas' Is Your Next New Obsession","title_rss":"NULL","source_domain":"bustle.com","text":"If you're like us, you're always looking for a new reality show to sink your drama-thirsty teeth into. Lucky for you, MTV has yet another glossy, aspirational-yet-guilty pleasure show to satiate you. (What would we do without them?)\nMTV's Pretty Little Mamas (premiering Thursday, August 30th at 9/8c) follows a group of five BFF's living their best lives in Southern California. A typical day for any one of these young ladies may consist of shopping, brunching, lounging by the beach, and taking their kids to school. Yep! The cast members are all young moms with pretty enviable IG-worthy lives. They have great kids, great friendships, and live in a gorgeous place. But in the midst of a balancing act of taking care of their little ones, pursuing their ambitions, romance, and finding themselves, things can get hectic. And, of course, there's some drama that's bound to go down. It wouldn't be fun without a little ~intrigue~. Also, thank GOD for nannies.\nIf you're anything like us here at Bustle, this classic reality TV show is sure to become your next new obsession. When you're at the bottom of a Instagram rabbit hole consisting of the cast's social media presence, you will have us to thank. So to save you some of that trouble, 'cause we're here to acquaint you with the cast of MTV's Pretty Little Mamas. And don't miss the premiere of this must-see show on Thursday, August 30th at 9/8c.\nNicole Is The Hilarious Queen Bee\nEvery group has that one friend — the social coordinator, the one who brings everyone together. In this group, that's Nicole, the bubbly, blonde, rosé-loving CEO of this gang of mamas. You know you're gonna have a great time when she comes out. Not to mention, you'll have the perfect Insta to show for it.\nHer adorable daughter Noelle is the undisputed center of her life, but that doesn't stop her from pursuing her dreams. She's entering her second year San Diego State University's Communications Grad Program. Living with her parents and dating around (most notably is recent debatably eye-roll worthy boyfriend Michael), she's still figuring herself out like any twenty-something. And be warned, if you're part of the crew, you fall in line with what she wants to do.\nNikki Is The New-ish Girl\nDon't get it twisted — it's Nikki, not Nicole. (This group isn't big enough for two Nicoles). This Singaporean-born burgeoning model is a more recent addition to the group. She came over for college, and ended up setting up shop after getting pregnant with her gorgeous only daughter Alaia. When it comes to her relationship with Alaia's father Ryan, things are still a work in progress. And in between navigating that, her bookings, and her growing Vlog career, this girl's got a lot on her plate. Also, shameless photo of Alaia alert — we can't with how adorable she is.\nChandlar Is The Prodigal Returning Friend\nThey say people come into your life at certain times, and leave at certain times for a reason. Chandlar, the other blonde cast member and mother of two has recently come back into the fold of the group after falling out with Nicole years ago. With her eldest Aubrey from an ex-relationship with a BMX biker, and her youngest from a different ex who's currently battling addiction, this resilient lady can seriously use the support of the people that knew her when. But will old tensions bubble up? I mean, probs.\nAlyssa Is The Personality Plus\nIf there's a sweetheart of the group, it's definitely Alyssa. One look at her feed full of gals showing up to celebrate her engagement, and that's clear. She apparently has the perfect life, and gets along with everyone. Having just graduated nursing school, and with a wedding on the horizon to her little boy Kayden's father Brandon, her life is starting to happen. But with her mother's failing health, she might be losing the very person who's been there for her all along.\nOn a lighter note, Kayden. Need we say more?\nCheyenne Is The Goofy Wifey\nOf the group, Cheyenne is the only married little mama. But as a mother of two, with a full family, she doesn't let this hold her back from having a great time. Her Instagram is full of pictures like the above, showing off her goofy personality. Living at home with the whole family and her husband Teli, things can get tense. Luckily, she has a great sense of humor and is capable of laughing anything off. Also, surprise, surprise: Her babies are gorgeous.\nThis article is sponsored by MTV's Pretty Little Mamas, premiering Thursday, August 30th at 9/8c.","url":"https://www.bustle.com/p/the-cast-of-mtvs-pretty-little-mamas-is-your-next-new-obsession-10200858"}
