{"authors":[],"date_download":"2018-10-23 05:47:08","date_modify":"2018-10-23 05:47:08","date_publish":"2016-03-06 00:00:00","description":"President Obama recently announced a plan to close the prison at Guantanamo Bay, Cuba. Three people with close ties to the issue share their views on whether or not to close the detention center.","filename":"data/vaneerConsumption/TheCaseForClosing.json","image_url":"https://media.npr.org/assets/img/2016/03/06/gettyimages-171666554_wide-ed02196082356d69671f7cc483a979620e51ae27.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=469370724_1540273628.html","title":"The Case For Closing","title_page":"The Case For Closing — And Keeping Open — Guantanamo : NPR","title_rss":"NULL","source_domain":"npr.org","text":"RACHEL MARTIN, HOST:\nThis is WEEKEND EDITION from NPR News. I'm Rachel Martin.\n(SOUNDBITE OF MUSIC)\nMARTIN: And this is For the Record.\n(SOUNDBITE OF MUSIC)\nMARTIN: President Obama has been talking about closing the prison at Guantanamo Bay, Cuba, since he ran for president in 2008. Here he is on \"60 Minutes\" two weeks after that election.\n(SOUNDBITE OF TV SHOW, \"60 MINUTES\")\nPRESIDENT BARACK OBAMA: I have said repeatedly that I intend to close Guantanamo, and I will follow through on that.\nMARTIN: Now, eight years later, his administration has put out a plan to make it happen. Here's the president announcing it last month.\n(SOUNDBITE OF ARCHIVED RECORDING)\nOBAMA: With this plan, we have the opportunity, finally, to eliminate a terrorist propaganda tool, strengthen relationships with allies and partners, enhance our national security and, most importantly, uphold the values that define us as Americans.\nMARTIN: The plan is to transfer some of the remaining detainees to other countries. And those who can't be transferred would be moved to a facility in the U.S. And that's the part of the plan many in Congress are railing against.\n(SOUNDBITE OF ARCHIVED RECORDING)\nPAUL RYAN: The president should rule out taking unilateral action to transfer Guantanamo Bay detainees to our shores.\nTIM SCOTT: We're afraid that those terrorists will bring their friends to our neighborhoods.\nUNIDENTIFIED MAN #1: It's dangerous, irresponsible.\nUNIDENTIFIED WOMAN: I just really think that we must continue to detain prisoners there at Guantanamo...\nMARTIN: It's not just lawmakers who don't like the president's plan. On Friday, a new CNN ORC poll found that 56 percent of Americans surveyed opposed shutting down the U.S. prison at Guantanamo Bay.\nFor the Record today, closing Gitmo. We're going to bring you two different perspectives on the U.S. prison at Guantanamo Bay, Cuba - President Obama's top envoy on the issue and the Marine Corps general who just retired after overseeing the facility. But first...\n(SOUNDBITE OF ARCHIVED BROADCAST)\nOMAR DEGHAYES: My name is Omar Deghayes. I'm a lawyer. I graduated from law school here in the U.K. And I was locked up in Guantanamo for about five years, several months - from 2002 to 2007.\nMARTIN: Omar Deghayes is one of hundreds of detainees who've been released from the U.S. prison at Guantanamo Bay over the years. Deghayes was apprehended in Pakistan in 2002.\n(SOUNDBITE OF ARCHIVED BROADCAST)\nDEGHAYES: In my case, there was a mistaken identity. They had a photograph of a Chechen rebel, and they thought that was me.\nMARTIN: I spoke with Deghayes back into 2013, and he described several hunger strikes he participated in while he was detained. I asked him how they got started.\n(SOUNDBITE OF ARCHIVED BROADCAST)\nDEGHAYES: Usually, it's a small incident - not small, but something grave takes place inside the camp. But that triggers other feelings - thinking about why we've been there for many, many years inside those prisons without any chance to look at the evidence, or there is no hope. All that - it comes together. And then it's a cry of help to the outside world. Usually, is that - it's the last resort.\nMARTIN: A last resort to get his case heard.\n(SOUNDBITE OF ARCHIVED BROADCAST)\nDEGHAYES: We want our imprisonment to come to an end. We want proper courts to have our cases listened to in courts so that a final decision is made. And those who've committed anything can be convicted and imprisoned. And those who haven't committed anything should be released.\nMARTIN: That was the experience of one detainee more than a decade ago in the early years of U.S. wars in Iraq and Afghanistan. During that time, the U.S. government was using so-called enhanced interrogation techniques at Gitmo, including sleep deprivation, slapping and nudity. After the abuses came to light, President George W. Bush signed something called the Detainee Treatment Act in 2005, which prevents, quote, \"cruel, inhuman or degrading treatment or punishment\" of any prisoner of the U.S. government, including those at Guantanamo Bay. Today, there are 91 detainees left.\nJOHN KELLY: And the facilities they live in today are pretty good. Again, I wouldn't want to be a detainee, but if you have to be a detainee somewhere, Gitmo's the place to be.\nMARTIN: This is General John Kelly. He's the retired four-star Marine Corps general who oversaw the prison at Guantanamo Bay from 2012 until this past January. General Kelly insists that the detainees hold a lot of power because they can provoke their guards, and the guards can't retaliate. He described something called splashing. And just a note here, this is a graphic discussion.\nKELLY: Detainees frequently will mix up a concoction - typically of feces, urine and - for some reason, sperm is the special treat, I guess, from their perspective. And they put that into a concoction. And then when the guards will go and either give them their food or open the door to bring them out, they get splashed. And so they get a face full of feces and urine and all the rest of it. You know that, by law, is an assault. Nothing we can do to them. The only way we could control them in any way is to either give them privileges or take privileges away. But the point is, when they've been in our custody, they've been taken care of because the law requires it, and we're the good guys. They're not, but we are. But the...\nMARTIN: You know that about all of them?\nKELLY: Yeah.\nMARTIN: You don't have any doubts that any of them have been detained...\nKELLY: I can tell you there is a dossier on every one of them. We can quibble over what they were doing on the battlefield when we took them, but every one of them is a bad guy.\nMARTIN: Our second view on Gitmo comes from Lee Wolosky. He's the State Department's top envoy for closing the prison.\nHave you been there?\nLEE WOLOSKY: Yes.\nMARTIN: Are there images that stand out to you? What was it like the first time you went?\nWOLOSKY: Well, there are images in all of our minds about what Guantanamo was. We have images of men in open cages, exposed to the elements in orange jumpsuits. That is not at all what Guantanamo is today. It is a facility that is better - I'm a lawyer by training - better than any - certainly any state or local correctional facility or prison that I've been to. It's better than many of the federal facilities.\nMARTIN: So why close it?\nWOLOSKY: Well, I think part of the reason why we need to close it, as the president has said, is that it is a recruiting tool. It is because of what the world believes that it is. It doesn't matter what it actually is in certain respects. We've all seen images of hostages in the desert wearing orange jumpsuits as they are executed by Islamic State. This is an image that, unfortunately, has proven to be indelible, and it has proven to be a recruiting tool for Islamic State.\nMARTIN: General John Kelly doesn't buy that argument.\nKELLY: I have three tours in Iraq, a lot of interaction with detainees. None of them ever said to me, you know the reason I picked up a rifle to kill you people? - it's because of, you know, Guantanamo Bay.\nMARTIN: So when ISIS beheads people...\nKELLY: Yeah.\nMARTIN: ...Who wear orange jumpsuits...\nKELLY: Yeah.\nMARTIN: You don't see a parallel?\nKELLY: No, no. I mean, I would say that our actions against the extremists - bombing them and killing them - would kind of be more of a reason to hate us than keeping some of their colleagues in a great detention facility at Guantanamo Bay.\nMARTIN: So based on the threats that the United States faces now, do you think that the U.S. should have a detention facility like Guantanamo, whether in Cuba or on U.S. soil?\nKELLY: We need a place - in any conflict - to hold people that are captured on the battlefield. Prisoners are better than dead bodies because they talk. And you don't have to waterboard them. You don't have to - they talk. And we find out a wealth of knowledge, so you need to have a place to keep them somewhere. And certainly the care - the, you know, dignified and humane care they receive in Guantanamo Bay right now is very, very, very good.\nMARTIN: Lee Wolosky says there are 36 detainees who've been approved for transfer, and he's confident he can find countries to take them in by this summer. That leaves 55 detainees. Some of them are still being tried in military commissions. And the remaining detainees are waiting for review boards that will decide if they'll be sent home or resettled somewhere else. Any other detainees will need to be kept somewhere, and the Pentagon has identified 13 sites on U.S. soil that could house them. The administration has tried this before. In 2009, they explored the idea of moving detainees to U.S. facilities in states including Kansas, Illinois and Michigan.\n(SOUNDBITE OF ARCHIVED RECORDING)\nUNIDENTIFIED MAN #2: The administration is considering a plan to move all of the detainees currently held at the Guantanamo Bay prison to the maximum security lockup in Standish. It would turn that town into what some are calling Gitmo North.\nMARTIN: In the end, many residents in those states didn't want that to happen, and Congress wouldn't change the law to allow the detainees to move to the U.S. I asked Lee Wolosky what has changed since then. Why is he any more confident that Congress will change its mind on one of the most contentious issues of our time?\nWOLOSKY: As the president said last week, the issue of closing Guantanamo had been a bipartisan issue. There had been bipartisan consensus at the beginning of this administration to close Guantanamo.\nPresident Bush said he wanted to close Guantanamo, and he set in motion the closure of Guantanamo. On President Bush's watch, over 500 detainees, as part of a closure plan, were transferred to other countries. So if there is an interest and a willingness to close Guantanamo and there is an interest and willingness in not releasing certain detainees who cannot be safely released, then the alternative is to bring that small number of detainees to the United States.\nMARTIN: You think it'll happen before the end of the administration?\nWOLOSKY: I certainly do.\n(SOUNDBITE OF MUSIC)\nMARTIN: Lee Wolosky is the top U.S. envoy for closing the prison at Guantanamo Bay. We also heard from retired Marine Corps General John Kelly and former Guantanamo Bay detainee Omar Deghayes.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=469370724"}
