{"authors":["Matt Black","Trymaine Lee"],"date_download":"2018-10-22 20:01:09","date_modify":"2018-10-22 20:01:09","date_publish":"2016-05-07 04:00:00","description":"Geography of Poverty - The City: Prison’s Grip on the Black Family. The spirals of poverty and mass incarceration upend urban communities by Matt Black and Trymaine Lee","filename":"data/vaneerConsumption/TheCityPrisonsGripontheBlackFamily.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/big-city-social.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/specials_geographyofpoverty-big-city_1540238469.html","title":"The City: Prison’s Grip on the Black Family","title_page":"The City: Prison’s Grip on the Black Family\n     - NBCNews\n    \n  ","title_rss":"NULL","source_domain":"nbcnews.com","text":"PHILADELPHIA — They used to pray together before school each morning. Dawn Hawkins would take her son’s hands, and with clenched eyes she’d ask for safe passage from their home through the hard streets of North Philadelphia, a sometimes-dangerous maze of gang lines, drug corners and police dragnets.\n“Be a shield of protection for my baby,” she’d say as part of their daily ritual.\nThough she prayed to God for a shield, she served as protector, marching him to and from school like a drum major. Her baby, Khyrie, was 13 then, a quiet, lanky boy with soft features and penetrating eyes. As much as she tried to buffer him from danger, he’d already seen too much. A cousin had recently been murdered. He’d witnessed a host of relatives cycle in and out of prison for drugs, violence or a combination of the two. And many of his friends, without drum majors of their own, seemed to be finding their own beat in the streets.\nDawn knew she didn’t have much longer before that beat got too loud for Khyrie to ignore, or before the cops would begin to see her baby-faced boy as a man. Black men don’t always fare well in neighborhoods like theirs, where trapdoors lay in abundance, ready to snatch them from city blocks and toss them straight to cell blocks, or worse, a grave.\nPhiladelphia, Pa. has a population of 1,526,006 and 26.7% live below the poverty level. Here, Dawn Hawkins cooks at home.\n“Worrying is an everyday thing,” Hawkins told me back in 2013, on Khyrie’s first day of 8th grade.\nYears later, on a warm afternoon this past spring, Hawkins sat alone in a folding chair behind her rowhome, overlooking the small garden she’s coaxed to life through a dry patch of pebbles and weeds. Her golden brown locks swayed across her face as she shook her head, thinking back on those stressful but hopeful days.\n“Every single day I wake up and all I can think about is, ‘Am I going to lose my son today?’ ” she said. “I have a creator that I pray to and I worship, but we talking about reality. Like, people wake up, and they losing they loved ones each and every day to police brutality, death by the neighborhood, death by the police, just basically the streets and the system.”\nIn the years since Khyrie moved from middle school into high school, he began to change. He yearned for more freedom and for his mother to loosen her iron grip. She extended his curfew and let him wander farther from home. With more freedom came more problems. Khyrie started getting in trouble at school, fighting and smoking weed. At 14 he stopped coming home for stretches of a week at a time. Hawkins’ only hope was to put out missing person reports, fearing the worst.\n“I used to go out in the streets looking for him and I’d knock the crap out of him because I wanted to let him know that he was going the wrong direction,” Hawkins lamented. “What else could I do?”\nHawkins certainly fears for her son’s safety, but also that he’ll somehow find himself fodder for cops and the criminal justice system, and that he’ll end up with a record that will haunt him for the rest of his life.\n“He’s a young black man in Philadelphia,” she said. “He’s a target.”\nHawkins knows the agony brought on by the system, and the difficulty of scrubbing the stains handcuffs can leave long after they’ve been removed. She knows because she has stains of her own.\n“I was a mother that was incarcerated,” Hawkins said. “It breaks families. It breaks homes. It breaks communities, especially mothers and fathers. Because our young men need a father figure in they life. And most definitely as a mother being incarcerated, I had to come out and I had to start all over. I lost some things I’ll never get back.”\nThe World’s Leading Jailer\nPhiladelphia is the poorest big city in America and has the nation’s highest incarceration rate. As of last week, more than 7,300 of its citizens were locked up.\nA whopping 60 percent of Philadelphia’s jail population is made up of non-violent suspects who are still awaiting trial, and 72 percent are African American, according to the MacArthur Foundation’s Safety and Justice Challenge, which recently awarded the city a $3.5 million grant to cut its bloated jail population.\nDowntown Philadelphia, Pa.\nBut by no means is Philadelphia an outlier. There are prisoners under lockdown in more than 6,000 facilities, including 3,283 local jails, 1,719 state prisons, 942 juvenile correctional facilities, 102 federal prisons and 79 Indian country jails across the country, according to the Prison Policy Initiative. Those numbers don’t include a robust private prison industry that houses tens of thousands of other inmates at dozens of for-profit facilities.\nThe rate at which America locks up its people is startling, even compared to some of the most violent, repressive nations on the planet. With a prison population rate of 716 per 100,000 citizens, the United States is far above the likes of Cuba (510 per 100,000), Rwanda (492 per 100,000) and Russia (475 per 100,000), according to the International Centre for Prison Studies. What of other prosperous developed nations with similar criminal justice systems? Canada has a prison rate of 188 per 100,000, Australia is at 130 per 100,000 and Japan is at 51 per 100,000. The U.S. rate also exceeds the aggregated European rate – by three times.\nDespite being home to less than five percent of earth’s population, the U.S. houses nearly 25 percent of the world’s prison population, making it the world’s leading jailer.\nOf the 2.3 million Americans currently incarcerated by the country’s sprawling criminal justice system, more than 40 percent are black and overwhelmingly poor. Mass incarceration has been an extremely disruptive force that has upended many black communities and left generations of black families hobbled. It has taken an especially damaging toll on black men, criminalized throughout history, marginalized by public policy and widely excluded from the American labor market.\nThe roots of modern mass incarceration are insidious, stretching back to the earliest days of Reconstruction, when whites tried to push blacks as far back into slavery as they could through a series of laws and practices known as Jim Crow, which experts have described as “slavery by another name.” More than 100 years later, those shackles remain.\nBeginning in the 1970s, the U.S. experienced an explosion in its prison population, as federal and state law enforcement began targeting the black, urban poor as part of the so-called “War on Drugs.” Over the past 40 years, the number of people incarcerated in the U.S. has not just grown, but exploded by 700 percent.\nThe confluence of race, poverty and constant contact with the criminal justice system has helped keep poor families poor through civil forfeiture, a menagerie of fines, fees and court costs, and limited access to steady employment, college or business loans. It makes it more difficult to secure housing and easier to fall into debt, which can trigger exorbitant interest rates on loans, if a person is able to secure one.\nIn so many ways, those who are convicted of felonies or who have spent time in prison continue to be punished time and again long after their release.\nA criminal sentence is “no longer a singular penalty pronounced by a judge as a proportionate response to a criminal conviction,” Larry Schwartztol, executive director of the Criminal Justice Policy Program at Harvard Law School, wrote in Slate this October. “These convictions often spark a cascade of economic consequences that persist for years after the formal sentence is over and threaten a person’s ability to successfully and self-sufficiently re-enter society.”\nUrban black communities have been hit particularly hard. For the better part of the last century industrial northern cities have swelled with African American bodies and bloodlines that fled the violence of the Jim Crow South for greater opportunities in cities like Baltimore, Chicago, Detroit and Philadelphia. They sought the good pay and the relative stability of auto, meat packing and manufacturing jobs. These were overwhelmingly segregated cities that, when industrial jobs disappeared, felt the pangs on almost every level. Segregation, racism and economic starvation, left historically black communities depleted and imperiled.\nViolence Fills the Void\nIn places where there are too few jobs and too many men and women being touched by the criminal justice system, the voids are often filled with bloodshed. Mass incarceration, poverty and violence go hand-in-hand, and nowhere is that relationship more striking than in our country’s most segregated cities. In Chicago, many African-American families have struggled beneath the crush of that damned trio. The young are being removed to prisons or being taken out by bullets, leaving their families to mourn the calamity of being poor and black in America.\nDeeTreena Perteet, 50, massages her son’s back where the bullet that entered his face became lodged, leaving him paralyzed since age 14. “I was 14 when I was shot. They told me to plan life in a wheelchair, that I’d never move my arms and legs again. It took me two years to stand up again. If people understood what violence does to families, and to people personally, I don’t think they would do it.” – Ondolee Perteet, 21 “We want to be able to have a Sisterhood in every state, where mothers will go and talk to these guys, and let them know the hurt and the darkness that they create in our lives when they take our children away.” – Gwendolyn Baxter, 55 “The kids that are dying are not kids who are in the streets gangbanging. These are innocent kids.” – Tangela Jones, 38 “It can happen to anyone, at any time, anywhere. When there’s gun violence, you take away someone’s life, you take away from their family, from their parents, their grandparents, their friends, their siblings – it’s a trickle-down effect, and it is the worst pain in the world.” – Bouschelle Stokes, 52 “There is no name for a parent that’s lost a child. If you lose a spouse, you’re a widow. If a child loses their parent, they’re an orphan. But if you lose a child, there’s no name. So I call it Pain With No Name.” – Shundra Robinson, 43 “He was 24. I miss seeing his face, I miss him calling and texting me. It’s the little things that you miss. Without God and the Sisterhood, I don’t know where I’d be right now, because this is a hard walk.” – Antoinette Hill, 45 “It’s easy to get guns. It’s so easy to get so many things that don’t need to happen to young people. I think poverty has a lot to do with it. It has a lot to do with generations. My generation, my parents always wanted me to do better than them. I wanted my sons to do better than I did. I made sure that they both went to college.” – Barbara Alfred, 71 “People think it’s normal. You hear about it, somebody got shot, and the reaction is nothing.” – Toneya McIntosh, 46 “Why are we celebrating Memorial Day when here we have a war? And it’s a philosophical war, as well as a war with our concept of what is fair in our society. We keep attaching the Bible to the gun, and believing, because the NRA has made sure that in the past 30 years, if you don’t protect your family with a gun, we aren’t following the Scriptures, when in reality that is not what we want.” – Maria Pike-Davies, 62 “Demarius was 20 years old when he was murdered. He was in his third year of school. He was the first person in my family to go away to school.” – Tanesha Reed, 43\nToday, these same continually segregated urban metropolises have been the ongoing theater for the War on Drugs, which has functioned as a proxy war on the poor. Some communities have suffered the virtual disappearance of entire demographics of black men by the criminal justice system.\nMore than 1.5 million black men, or “more than one out of every six black men who today should be between 25 and 54 years old have disappeared from daily life,” according to a New York Times analysis, due to incarceration and early death. In Philadelphia, some 36,000 black men are missing, placing Philly third behind New York and Chicago on the list of cities in which the highest number of black men have been taken off the streets.\n‘This is What it is’\nThe summer sun sat high above a bustling, tattered block in North Philly, and Ken Murray was doing his best to tamp down his brewing anxiety. He winced in the glare as he watched an orbit of young bucks and old folks oscillating from corner to corner, stoop to stoop.\nHe looked down at his cell phone and back up to the action on the block. Then back to his phone. He’d been let go from his umpteenth temp job a couple days earlier, this one at a cardboard recycling plant. He was hoping for a call from the temp agency with a new placement. It was nearly 4 o’clock and he was going on his third day without making a dime. His easy smile and laugh belied his worry. He needed the money but was getting used to the high hopes and letdowns of life on the outside.\nKen Murray wakes up at 4:00 AM to get to a minimum-wage job by 7:00 AM. \"The only thing I can control is me.\" Jailed as a young man for a drug related offense, he has been out of prison for nearly two years, but has difficulty finding steady work due to this history. “I'm 48 years old. Time is not my friend,” said Murray. “The way I feel is I will never have the American Dream. I will never have a normal life.\"\n“This is what it is now,” Murray said, throwing up his hands.\nSince getting out of prison nearly two years ago, this has been the drill. In the past year alone he’s worked at and been let go from nearly a dozen low-paying temp jobs. There was the scrapyard gig separating metal, the one separating books in the school district basement, jobs building porch furniture and others that required putting things together or taking them apart.\nNothing is ever permanent in his world. Nothing is ever solid. But of all the fleeting things, it’s the elusive hunt for a job that vexes him most.\n“Employment over housing. Employment over health care. Employment over getting reacquainted with family and getting adjusted to society again,” Murray said. “Being a felon and not having a higher education. You know what I mean? That’s two strikes.”\nMurray ran down the typical interaction with an employer this way: “What are you certified in? Where’s your degree? Where’s your certification? Where you been? I see you got a gap for five, six, years. What happened?”\nWhen he is employed he usually makes a little more than minimum wage and is at the whim of sometimes fickle employers.\nHe was let go from a nut and bolt factory the same day he started because he asked to leave 30 minutes early due to car trouble. Another time, after a month of working as a gravedigger, he was let go after his background check finally made its way to the boss’ desk. He even got fired from parking vehicles for an airport rental car company after a co-worker with a criminal record was shot and killed by the cops.\nThe hours at many of these jobs begin at the crack of dawn. Murray often rises before the sun does, heading to the bus stop for a mission that can take hours and requires two or three transfers on public transportation.\nThe cost of a bus pass alone chips deep into his meager paycheck. He can’t help but laugh as he runs down how nickled-and-dimed he is.\n“If I work 40 hours at $7.25, I make $290. After taxes, I walk away with $247. Now, how am I gonna make this work? Well, I give my daughter $50, my bus pass is $24, my laundry is $6. That’s $80. The rest, I try to save. That ain’t much,” he said, adding the cost of his cell phone bill, food and maybe a $5.50 movie with his girlfriend on discount day.\n“Lord, if I can save $20 here, $30 here, it’s coming,” he said.\nHis woes began years ago when Murray hit the ripe age of 14 or so. He started drinking a little beer. Then smoking a little weed. Soon he was selling it to make some spending money. It was the late 1970s and southwest Philadelphia was humming. Weed money was okay, but when crack hit in the 80s it set the city mad.\nThe hustle, he said, became a full-time job.\nKen Murray waits for a bus. He wakes up at 4:00 AM to get to a minimum-wage job by 7:00 AM.\n“It just swarmed you, you know? Those late ‘80s, drugs was available, and they was easy to obtain, and easy to sell and you’re seeing enormous profits like never before. And you can pay your mom’s bills, buy your dad something, buy you a car, take care of your children, buy your girlfriend something nice. It was very enticing,” he said. “We used to say, ‘Why should I go to school for four years just to make $60,000 a year when I can make $60,000 if I just hustle hard this summer?’ I don’t mean to laugh. But, that was just our motto.”\nFast money is “the worst thing to happen,” said Murray.\n“Worse come to worst, before you end up in a shelter, homeless on the street, sleeping on the steam pit or whatever. You probably will go back to selling them drugs.”\nBut the trade came with dangers. Rivals lurked around every corner, sometimes even in your own crew. And police ran roughshod through the neighborhoods, rounding up the hustlers and “squares” alike. It didn’t matter, Murray said.\nMurray began catching drug charges, and then charges for assault, aggravated assault and then a murder charge, for which he was eventually acquitted. Murray said that on paper he looks like a violent criminal when it was the selling and using of drugs that led to the violence.\nThe Big Bang\nThe acceleration of mass incarceration was kicked up during the Clinton administration with the passage of the Violent Crime Control Act, known as the 1994 crime bill. While the prison population was already expanding, the bill fueled a surge in incarceration. Looking to address the social pangs wrought during the crack era, in which the craze of cooked-up powder cocaine swamped inner cities across the country, Bill Clinton pushed his aggressive policy through Congress.\nThe bill expanded the death penalty, provided funding to build prisons and put tens of thousands more cops on the street. It added money for police training and imposed tougher prison sentences for convicts, offered money for drug courts and banned certain assault weapons. It also set up three-strikes provisions, which mandated life sentences for people who committed a violent felony after two prior convictions.\n“Gangs and drugs have taken over our streets and undermined our schools,” Clinton said at the time. “Every day we read about somebody else who has literally gotten away with murder.”\nWhat emerged during that era was a blend of legitimate concerns over rampant violent crime and pure mythology, tinged with racism and racial hysteria.\n“A superpredator is a young, juvenile criminal who is so impulsive, so remorseless that he can kill, rape and maim without giving it a second thought.” John DiIulio Jr.\nIn 1995, a Princeton political scientist named John DiIulio Jr. coined the term “superpredators” to describe a new breed of young urban criminal, born to crack-addicted mothers and absent fathers, that was rising to terrorize America.\n“A superpredator is a young, juvenile criminal who is so impulsive, so remorseless that he can kill, rape and maim without giving it a second thought,” Dilulio said at the time.\nHe predicted that “a new generation of street criminals is upon us – the youngest, biggest and baddest generation any society has ever known.”\nThese crack-baby monsters were presumed to be black, and black faces were a routine part of the media’s depiction of unchecked chaos and depravity.\nThis is the backdrop to which Clinton’s crime bill emerged with support from black politicians, leaders and lay folks. As Leon Neyfakh wrote in Slate in February, many African Americans saw the bill as “an imperfect but necessary measure to combat pervasive violence in poor black urban neighborhoods.”\nStill others warned against the perils of this punitive approach. As crime and violent offenses began to drop following their peak in 1993, Dilulio’s predictions proved to be unfounded. Yet the hysteria they sparked, and the “tough on crime” position taken by law enforcement and politicians on both sides of the aisle, would have a dramatic impact on the lives of the millions who were cycled through local jails, state and federal prisons, especially African Americans.\nDuring a speech in New Hampshire in 1996, in which Hillary Clinton praised the Crime Bill, she said there was a need to take the fight to criminals.\n“They are not just gangs of kids anymore. They are often the kinds of kids that are called superpredators — no conscience, no empathy,” she said in her speech. “We can talk about why they ended up that way, but first, we have to bring them to heel.”\nClinton would apologize years later.\nThe number of non-violent drug offenders behind bars grew exponentially, from 41,000 in 1980 to nearly 500,000 in 2014, according to the Sentencing Project.\nBy the time the bill was passed, crime had already started to decline, a trend that would continue for more than two decades. But as crime rates dropped, incarceration rates continued to climb. Safer streets didn’t mean safety from being sucked into the prison and jail pipeline.\nFor too many, the heartache was entering a new stage. The punishing nature of the bill and the seeds it lay, coupled with a long history of criminalizing black people along every step of the system, filled America’s prisons with black bodies. Mandatory minimum sentences and a trend toward paroling fewer inmates meant fewer people were being released as more people were being locked up.\n‘Trying to Survive’\nIt was 1991 and Dawn Hawkins was a young, single mother. Without much education or specialized training, finding work was a struggle. Feeling trapped by her circumstance and desperate to provide for her baby girl, Mikelia, she turned to the quickest money she could get.\n“I was a young mom trying survive. I wouldn’t have to wait on a welfare check every two weeks and food stamps to feed my child,” she said. “I bought Pampers with that drug money. Wipes with that drug money. Food with that drug money. It was fast money. So it supported what I had to do. But it was also consequences with it.”\nIt was the height of the crack epidemic and communities across the country were flooded with the drug and the addicts who smoked it.\nBut the streets were also flooded with police who were given the greenlight to use whatever means necessary to crack down on dealers, users and the communities besieged by them.\nDawn Hawkins at church.\nHawkins ended up getting arrested, charged and convicted of relatively minor drug charges. As a first-time offender she served just a few months in jail, but it felt like an eternity away from her baby..\n“My daughter didn’t recognize me. I missed her first footsteps. The teething. I missed all that. And it was a great hurt,” Hawkins said.\nFor a time, life carried on. She was on probation and house arrest. Every day, every meal and every bill was a struggle.\nWith no support system and easy access to cocaine outside of her door, Hawkins slowly found herself back in business. She cut her ankle bracelet and set off into the streets, gambling with her freedom.\nYears passed and Hawkins had another child, a boy, Khyrie. Then, déjà vu. Her probation officer finally tracked her down and sent her back to jail for violating parole. Around the same time, police raided her home and found her drug stash. Hawkins was sentenced to 18 months.\nMikelia was sent to live with her father’s family. Khyrie was sent to live with his aunt, Hawkins’ sister. It was a cold reckoning to see the only thing she cared about, her family, slipping through her fingers.\nThings came to a head one day when her sister brought Khyrie, then two years old, to visit her in prison. He was fussy, teething and sick with a fever. The child hadn’t slept all night.\n“I rubbed him, held him and he quieted down,” Hawkins recalled. “At the end of the visit I had to give my baby back to my sister. That tore me up. My baby was sick and I couldn’t do anything about it. I couldn’t be there for him. I made the decision right then to do the time, do what I had to do and never come back.”\nOnce she got out she said she retired her old ways, but the real struggle was just beginning. She picked up side jobs here and there, selling seafood during the day and working as a bar maid at night.\n“I really didn’t have nobody really in my corner to support me,” she said. “Living from pillow to post with your children, it was hard. It wasn’t that I chose that, it was just hard for me to find a job because I was a convicted felon.”\nIn the coming years she’d fight hard, buoyed between poverty and comfort, the system and the streets. The cycle of consequences that would roil her family are common ones, like the hundreds of thousands of formerly incarcerated people who step from behind the cold prison walls and into the often frigid world beyond.\nPoverty’s Grip\nOne of the more insidious ways law enforcement separates the poor from what little resources they have is through civil forfeiture laws, which allow the government to seize and confiscate property they suspect might be involved in criminal activity. That includes cars, homes and cash. All police need is suspicion in order to take a person’s property. The owners don’t have to be charged or even convicted of a crime to have their possessions taken under civil forfeiture laws, which differ from criminal forfeiture laws that require a crime to be committed.\nWhat happens to the property after law enforcement takes it? It’s sold off for the direct benefit of the agencies involved.\nBetween 2002 and 2012, Philadelphia took over $64 million in forfeiture funds, according to the Institute for Justice. The city’s District Attorney’s office then used more than a third of that haul, $25 million, to pay the salaries of the very prosecutors who filed the forfeiture petitions.\nThe process to fight for your belongings can be long and complicated, so many simply give up.\nNo amount of window dressing can obscure America’s dual dilemma of poverty and prisons.\nA wide-ranging Washington Post investigation in 2014 found that police across the country had seized $2.5 billion in cash alone without warrants or indictments since 2001.\nThere are other financial burdens on the formerly incarcerated. Being arrested comes with a range of costs from the outset including various fines, fees and court costs. Jails across the country charge inmates for being booked and released, and for time spent housed inside. Some charge for toilet paper, medical copays and for any substance abuse treatment inmates might receive.\nAs of now, 43 states and Washington, D.C. allow people to be charged for using public defenders, and 44 states charge people for using probation services. These come with relatively low fees that can bury the chronically poor.\nSome cities have used arrests, fines and fees to balance their budgets. A Department of Justice report released in 2015 found that police and court officials in Ferguson, Missouri, where unarmed black teen Michael Brown Jr. was killed by a then police officer, colluded to arrest and detain African American residents to fill the city’s coffers.\nWilliamsville, Mo. has a population of 342 and 31.5% live below the poverty level.\n‘Life’s Going By’\nAfter spending more than a third of his life behind the walls of prisons across the state, Murray, now 48, is trying to find his footing in middle age.\n“There’s just so many different things coming at you, that can make someone feel like, I don’t have as many chances to survive, to create other opportunities so you can turn your life around,” Murray said.\nHis twisting journey from freedom to incarceration and back could be described as a decades-long sleepwalk. One day the lights came on, he opened his eyes, and 18 years of his life were gone, snapped up in clips of a few years at a time. Those years, forlorn and fleeting, have left him an unfinished man.\n“When you commit a crime, they say, all right, you’re sentenced to five years. You do five years. But it’s more than that,” he said, hunched and peering through a pair of thick-rimmed eyeglasses. “It’s long-term. It’s a dark cloud over you forever.”\nKen Murray waits at a laundromat.\nHis wife left him years ago. The arrests, the stress, the insecurity on a loop were all too much. She found a new man while he was behind bars. His children, in the shadow of his absence, grew like weeds. Over the years he missed many of the milestones and mishaps, the big and small calamities and celebrations that are rites of passage when coming of age.\nNow, his children have children and lives they’ve set up, mostly in his absence.\n“Life’s goin’ by and I’m stuck in this one place, in this one cycle. And I’m seein’ my children grow, with jobs, and careers, and cars and houses,” Murray said. “They’re progressing and I’m not a part of that.”\nSlowly, he’s rebuilding the bonds burned between them.\n“Some days a little better than others,” he said.\nDays of living high on drugs and high on the hog are specks of a past life. It isn’t always easy, but he says he’s committed to being a better man and beating the system weighted against him.\n“We gotta try to make something out of nothing, you know, turn 15 cents into a dollar,” Murray said, sitting behind several piles of papers at his daughter’s dining room table. “It’s just my reality. And it’s sad because you say I paid my debt to society. All right, when do I live a normal life? When do I get an opportunity to live the American dream?”\nThe papers, hundreds of them, in piles spread across the table in front of him, chronicle every appointment, job lead, interview and hiring manager who’s called in the past two years. He pulled them out by the handful from an accordion folder and detailed the contents of each note, filled from margin to margin in his surprisingly neat penmanship. His attention to even the slightest details of his life helps him stay out of his head and keeps him from ruminating too much on bad habits.\nKen Murray in his grandson’s bedroom along with a “to-do” list of his.\n“I know I could go around that corner and get a gun and around that corner and get some drugs,” Murray said. “But I know that’s going to put me right back where I don’t want to be.”\nMurray’s fall from grace was long and slow, ending with him struggling to make ends meet and to make amends. After coming home from prison, one of his daughters opened her doors to him. It was a humbling moment.\nShe has three children, all under the age of 14. Without a room of his own Murray shares one The walls are decorated with cartoon racecars with his 13-year-old grandson. The walls are decorated with cartoon racecars. He’s about the same age Murray was when he first started dabbling in the streets.\nEach night, as the boy begins to doze, Murray rolls out two quilts on the floor like a pallet and hunkers down.\n“I just want to stop going in and out. That’s number one for me. Number two, for my family. Just like, when you do something wrong it trickles down and it hurts your family,” he said. “When you do something right, it’ll trickle down and your family benefits from it.”\nFrom Slavery to Superpredators\nIn her latest film, “13th,” director Ava DuVernay draws a direct line from the 13th Amendment, which essentially abolished slavery, to the rise of mass incarceration of blacks. The 13th Amendment, as DuVernay explores, has a loophole: “Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States.”\nThe amendment “makes it unconstitutional for someone to be held as a slave. In other words, it grants freedom to all Americans. There are exceptions, including criminals,” Kevin Gannon, a professor at Grand View University, says in the film. “There’s a clause, a loophole. If you have that embedded in the structure, in this constitutional language, then it’s there to be used as a tool for whichever purposes one wants to use it.”\nOver the past 40 years the sheer number of people who’ve been imprisoned has spiked dramatically, even as American crime rates have continued to fall precipitously from highs in the early 1990s. Experts offer varied explanations for the troubling growth of the American prison industrial complex, including the War on Drugs, harsh mandatory minimum sentences and a system largely incapable of handling suspects with mental health issues.\nThe War on Drugs launched by Richard Nixon in 1971, widely viewed now with a mix of cynicism, condemnation and outrage, played a critical role in accelerating the phenomenon broadly described as mass incarceration.\nNixon at the time described drug abuse as “public enemy number one” and announced the creation of a special office that would get funding to help prevent addiction and treat those succumbing to it. Nixon cited a slew of negative social impacts of illegal drugs as a means of setting the stage for the expansion of federal drug control agencies and, ultimately, decades of catastrophic policy that would further upend many among America’s most vulnerable populations.\n“You end up spending so much more on prison than you would with these kids being in school or even going to college that it’s counterproductive.” President Barack Obama\nIt was the beginning of an assault, not just on an intricate web of global drug traffickers, but on the wide domestic ecosystem of addicts, small-time peddlers and resource-starved black and Hispanic communities already hemmed in by vast structural, systemic and racial inequality.\nDespite data that shows similar rates of drug use and sale across racial lines, blacks and black neighborhoods have been widely targeted with heavy-handed drug enforcement. Misguided drug sentencing laws, the militarization of local police and drug enforcement officers and ineffective policing policy have destabilized huge swaths of the black population.\nIn her book “Marked: Race, Crime, and Finding Work in an Era of Mass Incarceration,” Harvard sociologist Devah Pager, wrote that “High levels of incarceration cast a shadow of criminality over all black men, implicating even those (in the majority) who have remained crime free,” and that “Prison is no longer a rare or extreme event among our nation’s most marginalized groups… Rather it has now become a normal and anticipated marker in the transition to adulthood.”\n“What drugs don’t destroy, the war against them is ripping apart,” David Simon, the journalist and creator of HBO’s “The Wire” said last year during an interview with President Obama.\n“You end up spending so much more on prison than you would with these kids being in school or even going to college that it’s counterproductive,” Obama responded. “And it means everyone’s taxes are going up, or at least services that everybody uses are being squeezed, or we can’t hire cops to deal with violent crime as you talked about.”\nTargeting blacks may have been part of the impetus for the War on Drugs in the first place.\nIn a story published in Harper’s Magazine in April, writer Dan Baum explains how John Ehrlichman, a former top aide to President Nixon, revealed the true motivation behind Nixon’s drug war: a proxy war aimed at African Americans.\n“You want to know what this was really all about?” Ehrlichman asked Baum. “The Nixon campaign in 1968, and the Nixon White House after that, had two enemies: the antiwar left and black people. You understand what I’m saying? We knew we couldn’t make it illegal to be either against the war or black, but by getting the public to associate the hippies with marijuana and blacks with heroin, and then criminalizing both heavily, we could disrupt those communities. We could arrest their leaders, raid their homes, break up their meetings and vilify them night after night on the evening news. Did we know we were lying about the drugs? Of course we did.”\nFormer colleagues of Ehrlichman, who died in 1999, have since questioned the authenticity of the quotes attributed to him by Baum, but the quote accurately described the outcomes suffered in the black community on the heels of Nixon’s efforts and those that followed.\nPolitical Parties and Prison\nDuring the Democratic Convention in Philadelphia this summer, activists and protesters gathered in the city. They marched downtown calling attention to the many chasms that divide people in the city, including inadequate healthcare, the closing of dozens of schools in black and brown neighborhoods, killings by police and the prison industrial complex.\nTensions between police and protesters reach a fever pitch as the two groups square off outside the Democratic National Convention.\n“It’s frustrating,” said Hiram Rivera, a community organizer. “You have the DNC here and the entire world is watching as they select who will be the next leader of the so-called free world inside of a city that is crippled with poverty, mass incarceration, gentrification that is out of control, and where our schools continue to be bankrupt and closed down.\n“I believe that this system was not created to benefit or to ensure the well-being of non-white people or poor people in this country,” Rivera said. “So I don’t support Donald Trump. And I don’t support Hillary Clinton. Her positions have been horrible, the policies of her husband still negatively impact the black and Latino community to this day.”\nWhile campaigning for his wife in Philadelphia in April, Bill Clinton got into a prolonged exchange with protesters who repeatedly hurled barbs over his support of the Crime Bill. At times he seemed dismissive, other times he tried to drown out the chants.\n“I don’t know how you would characterize the gang leaders who got 13-year-old kids hopped up on crack and sent them out onto the street to murder other African-American children,” Clinton said. “Maybe you thought they were good citizens … You are defending the people who kill the lives you say matter. Tell the truth. You are defending the people who cause young people to go out and take guns.”\nThe next day Clinton said he regretted his handling of the situation.\nIn a letter sent to both RNC and DNC leadership ahead of their respective conventions, The Brennan Center for Justice and eight other advocacy organizations asked that the committees make criminal justice reform a priority in the official party platforms.\n“Our current system has led to excessive incarceration rates; imposed disproportionately long prison sentences that serve little rehabilitative purpose and often increase recidivism; and crippled communities while dampening economic opportunity… The effects are stark and will linger for generations to come, unless there is a concerted effort from policymakers to choose a wiser course.”\nThe group also called for what it described as a reversal of the harmful financial incentives created by the 1994 Crime Bill and the tearing down of barriers to reentry that so many formerly incarcerated people face when released back to their communities.\nOver the past decade, 27 states have brought down rates of both crime and incarceration simultaneously, according to the letter. Over-incarceration does not reduce crime, instead it “takes a deleterious toll on our country – fiscally, socially, and morally.”\nThe Democratic Party Platform ultimately included some fairly ambitious calls for criminal justice reform, including commitments to “reforming our criminal justice system and ending mass incarceration” and to “reform mandatory minimum sentences and close private prisons and detention centers.”\nStopped, Frisked and Fed Up\nDonald Trump has made so-called “law and order” a central component to his campaign. As such, he’s called for the expansion of stop-and-frisk, the controversial police tactic in which mostly minority men were randomly accosted in the streets of New York City. Stop-and-frisk was deemed unconstitutional by a federal judge in 2013 and has been roundly criticized for being not only ineffective but little more than racial profiling.\nBetween 2004 and 2012, 4.4 million people were stopped. A weapon was found in less than 1 percent of cases. Of those stopped, about 83 percent were black or Hispanic, though the two groups make up just over half of the city’s population.\nDespite black and Hispanic men being the overwhelming targets of the random, largely unprovoked stops, a report commissioned by the city found that the NYPD discovered a weapon in one out of every 49 stops of whites in the city in 2012, compared to one in every 71 stops of Latinos and one in every 93 stops of African Americans.\nStop-and-frisk continues to be practiced in various forms in cities across the country, where police primarily focus their efforts on poorer communities. Philadelphia is among them.\nDark clouds loom over Philadelphia, a troubled city wrestling with poverty and mass incarceration.\nIn 2010, the ACLU of Pennsylvania filed a federal lawsuit against the city alleging that police were unconstitutionally stopping minority pedestrians. A year later the city settled the case and agreed to collect data on all stop-and-frisks and offer training to its officers. But according to a 2015 report by the ACLU, the police have not fixed their stop-and-frisk problems.\n“Philadelphia’s communities of color disproportionately bear the brunt of these unconstitutional policing practices,” Reggie Shuford said earlier this year. “They are understandably fed up and demand an immediate stop to being treated like second-class citizens.”\nMore than a quarter of the Philadelphia’s population, 26.3 percent, or about 407,500, are living below the poverty level. For the city’s children, the poverty rate is even higher at 36 percent. The city also has the highest deep poverty rate in America at 12.2 percent, twice the national rate of deep of 6.3 percent, according to 2013 census data.\nPhiladelphia is also extremely segregated, one of only five major American cities considered “hyper-segregated,” meaning the vast majority of black residents live packed and isolated far from their white counterparts. These hyper-segregated neighborhoods are not just isolated from people of other races, but from economic resources, quality schools, jobs and healthcare. Hawkins’ Strawberry Mansion neighborhood, with a poverty rate at 42 percent, tops the list of densely populated African American neighborhoods, with 98 percent of the residents being black.\nIn that void of resources, safety and stability, many struggle beneath the weight of failed systems on almost every level, including by the crush of law enforcement and the criminal justice system.\nThe impact of this contact with the criminal justice system has hit a relatively small number of neighborhoods particularly hard. In Philadelphia, much like in other cities, many of the poorest neighborhoods experience the highest incarceration rates and, in turn, are the costliest. The myriad non-dollar costs of even a short stay in jail – just days – can include the loss of child custody, jobs and property confiscated by the police. But other costs are spread across society, to taxpayers who bear the financial burden of mass incarceration and the residual costs associated with release and re-entry.\nPennsylvania taxpayers spend over $40 million a year to imprison 288 residents of a single Philadelphia zip code, 19132, which includes Strawberry Mansion, where 38 percent of households have an income of less than $25,000 a year according to the Justice Mapping Center, based on 2008 rates. In the six Philadelphia zip codes with the highest incarceration rates, taxpayers spend $206.4 million on related costs.\nNationally, the money we spend on incarceration continue to rise. In 1995, state expenditures on corrections were $26.1 billion according to the National Association of State Budget Offices. In 2005 that number rose to $42.3 billion. By 2013, states were spending $51.9 billion to incarcerate their citizens.\nNow, one in 100 Americans is currently incarcerated. Many more are under some sort of government supervision. Altogether, the costs are estimated at $80 billion a year.\nBreak the Cycle\nWhen he turned 14, Khyrie started to change, his mother said. He started to hang with an older group of kids and his demeanor became a silent storm, brooding and erupting in fits of rage.\nThings got so bad at home that Khyrie even started to buck-up at his mother. She called his school counselor and asked her to talk to the boy. Hawkins thought that perhaps Khyrie needed therapy or someone to talk to that wasn’t his overprotective mom. Instead, Hawkins said the counselor contacted the Department of Human Services. A case was opened and somehow, Hawkins said, their report stated that at some point she’d hit Khyrie with a hammer. It’s a claim she vehemently denies and isn’t sure who conjured up. DHS removed Khyrie from the home and placed him with his aunt in a different part of the city.\nIn some ways it was a relief, she said. Despite the fact that her initial call landed her in family court and that her son was removed from her custody based on what she described as ludicrous accusations, Khyrie would be out of the neighborhood.\nHe’s home schooled now, logging onto a computer for several hours a day to get his lessons online. His anger has waned and he’s kept out of trouble, Hawkins said.\nReading from a card that Khyrie sent last Mother’s Day, Hawkins let out a warm laugh.\n“Mom, we had our ups and downs but I wouldn’t be here if it wasn’t for you and I wouldn’t be the man that I am today by you being so hard on me. I am grateful that I have you as a mother.\n“I cried! Oh my God, I cried,” Hawkins said. “I said my son finally got the picture.”\nThe plan had always been for Khyrie to stay with his aunt until he graduated, which should be in two years. But now he wants to come home. And she wants him to be happy. They go to court in December to petition for custody to be handed back to Hawkins.\nBut she’s worried.\nKhyrie is older now, 16, and will likely be hanging with older boys. Their neighborhood has gone through waves of unrelenting violence and the cops are doing what they’ve always done – rounding up young boys that look like Khyrie.\n“I don’t know,” she said. “I just pray.”\nShe’s optimistic Khyrie will break the cycle.\n“The cops target boys like him because of the color of their skin and where they live,” Hawkins said, lamenting how trouble can so easily find those trying to escape it.\nHawkins, who now works as a community organizer with a group called Action United, not only lives the struggle every day but also sees it up-close in others.\n“You have to have the right type of people around you to encourage you not to fall for the traps,” she said. “We’re not perfect, we all make mistakes. That’s what I try to show my son. Look where mommy came from. I went to jail and had to leave y’all, but I’m fighting my way back.”\nHawkins hasn’t spent another night in prison in 15 years. Her daughter Mikelia recently graduated from Elizabeth City State University in North Carolina and started a job in social work. And Khyrie, though he was held back one year, is in his junior year of high school.\nShe has become, with few exceptions, a model citizen. Yet the less than two years she served has stretched into a life sentence despite her positive efforts in the right direction.\n“Yes, I sold drugs. But I was just trying to survive to take care of my children,” Hawkins pleaded all these years later. “No matter what we do, no matter how hard we try, it’s like the system was built for us to fail.”","url":"https://www.nbcnews.com/specials/geographyofpoverty-big-city"}
