{"authors":["Amita Sharma","Guest Commentary","Dan Morain"],"date_download":"2018-10-31 00:01:51","date_modify":"2018-10-31 00:01:51","date_publish":"2018-10-29 13:39:00","description":"The state’s affordability crisis prompts vows from Gavin Newsom and John Cox, the 2018 candidates for California governor, to revive the California Dream.","filename":"data/vaneerConsumption/TheCaliforniaDreamtakescenterstageingovernorsrace.json","image_url":"https://calmatters.org/wp-content/uploads/100518govdebatenewsomcox-p.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944111.html","title":"The California Dream takes center stage in governor’s race","title_page":"The California Dream takes center stage in governor’s race | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Skyscraping home prices and rent coupled with the notoriety that comes with being the richest state in the nation while having the highest poverty rate have prompted vows from two men vying to be California’s next governor.\nBehind the pledges from Democratic Lt. Gov. Gavin Newsom and Republican businessman John Cox to restore the California Dream, is an acknowledgement that the state’s long-treasured promise of homeownership and economic mobility is in danger. “The reality is the American Dream and increasingly the California Dream is a lie for too many people,” Newsom said.\nCox said growing up in Illinois, he viewed the California Dream as one that enabled people to rise from the bottom. “Now that dream is almost gone for a lot of people,” Cox said.\nMore than a half of the state’s renters and more than a third of its homeowners are burdened by housing costs, according to the California Budget & Policy Center. They spend over a third of their paycheck on housing.\nA recent survey by the nonpartisan, DC-based Public Religion Research Institute found that almost half of working Californians grapple with poverty. Many delay medical treatment and cut meals to save money.\n“The one long-term trend we’ve seen for the past 50 years in California is that we’re a rich state but we’re an increasingly unequal state,” said Thad Kousser, UC San Diego political science professor.\n“The California Dream is working great in La Jolla,” Kousser said. “It’s working great in Santa Monica. It’s working great in Palo Alto. It’s not working for Central California. The region is still struggling with high unemployment. It’s not working in El Centro. It’s not working in most parts of San Diego.”\nMeteoric housing costs are at the core of California’s affordability crisis.\nNewsom’s fix is to get more than 3.5 million homes built in California over the next decade by encouraging private investment. “That’s why we laid out 15 specific strategies on land-use fiscalization, zoning around transit quarters, enhanced infrastructure, financing districts, taking affordable housing tax credits from $85 (million) to $500 million, focusing on the workforce housing,” Newsom said.\nCox said he builds apartments in other states for a fraction of what it costs in California. “California has the worst business climate in the country, the highest taxes,” he said.\nHe said he would streamline regulations, end the “frivolous litigation and lawsuits,” and shorten the approval process as a way to boost housing construction.\nOnce housing supply meets demand and the expense of doing business is lowered, Cox said California’s cost of living will fall and the state will no longer have the highest poverty rate: “The reason that people are living in poverty is because of the cost of living. A dozen eggs is $4 in San Diego. It’s $2 in Phoenix. It’s all about the cost of doing business here.”\nNewsom called the state’s 19 percent poverty rate, that includes 2 million children, the ultimate expression of failure. “I’ve made ending childhood poverty my North Star,” he said. “You’ve got to begin at the beginning. Prenatal care. Early Head Start. Reading to our kids.”\nPolitical scientist Kousser said he has seen Newsom speaking more about the California Dream on the campaign trail than Cox. “He’s someone who naturally flows toward lyrical and poetic ways to wrap up his policy specifics,” Kousser said. “But I think John Cox has effectively been pushing at failures of the California Dream and really trying to critique where we are right now in California.”\nThe state’s 134,000 homeless people are a big part of the critique for both candidates. Cox said the state needs more transition centers that offer mental health, drug addiction treatment to the homeless, and job training. Newsom wants to hire a statewide director to help coordinate services that treat each homeless person from a “whole person care” perspective.\n“I was successful as a former mayor of getting over 10,000 people off the streets, quite literally 10,000 people,” he said.\nNewsom said he will also push for portable benefits, earned income tax credits and child tax credits to make up for the instability that comes with the gig economy. Gig workers are employed in temporary jobs, sometimes multiple ones simultaneously, without benefits.\nNewsom also has a plan to revive California’s middle class by dividing the state into 14 economic regions.\n“We call it rising together,” Newsom said. “Each economic region is unique and distinctive from one another and our goal is that the vision for economic growth can’t be realized from Sacramento. It’s a bottom-up vision that will be realized at the local level.”\nCox said if the state’s regulations get cut, businesses that pay middle-income wages will come to California.\nKousser said Newsom’s prescription for reviving the California Dream is consistent with how the state has been governed for more than a century.\n“It is essentially, we’re going to have a government that’s bigger,” Kousser said. “It’s going to spend more but it’s going to give you more. It’s going to be an engine of social mobility, the sort of investments that have been part of what’s built this state. What John Cox is proposing is really more the Texas and the Florida strategy. Let’s grow and make this an affordable state, but by trimming government.”\nDespite both candidates’ focus on the waning California Dream, each expressed hope for the future.\n“We have the lowest unemployment rate in history,” Newsom said. We’ve got 100 consecutive months of net job growth. “We have more scientists, more researchers, more engineers, more Nobel Laureates, more patents emanating out of California, more startups emanating out of California than any other place on the globe. California’s best days will not be behind it, they will absolutely be in front of it.”\nCox says the California Dream can be saved if there’s a change in leadership. “I’m going to be that change agent because I know what it’s like to struggle,” Cox said. “I started at the bottom. I want to make sure that other people don’t have to struggle.”\nNewsom’s double-digit lead over Cox may be hard to overcome.\n“Gavin Newsom is clearly the dynamic candidate here who could be equally at home at a Hollywood Hills party or in the governor’s mansion,” Kousser said. “He brings the glamour that California has liked with Ronald Reagan and Arnold Schwarzenegger. John Cox has that businessman ethos. Right now that image is more like Donald Trump and that doesn’t play well in this state.”\nThe California Dream series is a statewide media collaboration of CALmatters, KPBS, KPCC, KQED and Capital Public Radio with support from the Corporation for Public Broadcasting and the James Irvine Foundation.","url":"https://calmatters.org/articles/2018-california-governor-election-candidates-california-dream/"}
