{"authors":["Sarkis Zeronian"],"date_download":"2018-10-30 22:08:20","date_modify":"2018-10-30 22:08:20","date_publish":"2016-04-18 17:32:20","description":"It's almost two weeks since the rejection of the the European Union (EU)-Ukraine Association Agreement by Dutch voters, but what happens next remains | London / Europe","filename":"data/vaneerConsumption/TheDutchRejectionOfTheEUUkraineAssociationAgreement.json","image_url":"https://media.breitbart.com/media/2016/04/A-Ukrainian-flag-mixed-with-the-flag-of-the-European-Union-stands-among-flags-for-sale-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_04_18__1540937300.html","title":"The Dutch Rejection Of The EU-Ukraine Association Agreement","title_page":"The Dutch Rejection Of The EU-Ukraine Association Agreement — What Happens Next?","title_rss":"NULL","source_domain":"breitbart.com","text":"It’s almost two weeks since the rejection of the the European Union (EU)-Ukraine Association Agreement by Dutch voters, but what happens next remains unknown.\nObservers and interested parties are beginning to wonder when the Dutch government will finally decide how it will handle its electorate’s rejection of the EU-Ukraine Association Agreement in the citizen-initiative referendum of 6 April.\nIn the public vote prompted by the activist organisation GeenPeil, 61 per cent voted against the EU’s expansionist policy towards Ukraine. As Breitbart London previously reported, the referendum was on a technical issue to do with the politico-trading bloc’s relationship with Ukraine, and probably long-term membership for the Eastern European country. Despite that, Dutch voters are understood to have treated the plebiscite as a vote on their confidence in the EU and, to some extent, their own country’s membership of it.\nAs such, the Dutch government’s reaction to the non-binding “consultative” referendum is particularly sensitive and it shows no signs of rushing that response.\nOn 19 May an EU-Ukraine summit is due to be held in Brussels. The date was set back in March, before the Dutch referendum, but at the moment is set to go ahead. When announcing the date, Ukraine’s President Petro Poroshenko said he hoped that such EU-Ukraine summits would be held on a regular basis.\nIt is unlikely that Dutch Prime Minister Mark Rutte or any of his ministers, finding themselves caught between the rock of their own referendum and the hard place of Britain’s forthcoming one, will bring anything of much use to that event.\nDiplomatic sources referred to by Politico’s Playbook suggest that total paralysis will rule the day this side of the UK’s In/Out referendum on 23 June, with no moves likely until after Slovakia takes over from the Dutch EU presidency at the beginning of July.\nThe sight of a national government rejecting its electorate’s stated position following a referendum is not something the British government and its friends in the EU will want on display while the UK’s referendum campaign is in full swing.\nAs such, the very earliest anyone expects an indication of how the Dutch government will react to its voters’ inconvenient move is at the meeting of EU heads of state or government at the European Council meeting on 28 and 29 June.","url":"https://www.breitbart.com/europe/2016/04/18/eu-ukraine-agreement-what-happens-next/"}
