{"authors":["Elizabeth Tandy Shermer","Elizabeth Tandy Shermer Is An Assistant Professor Of History At Loyola University Chicago","Author Of"],"date_download":"2018-10-21 03:29:20","date_modify":"2018-10-21 03:29:20","date_publish":"2018-06-27 15:47:09","description":"The liberal justices recognized the value of unions — which hasn't always been the case.","filename":"data/vaneerConsumption/ThedissentinJanusshowsthatliberaljusticesarefinallyonthesideoftheworkingclass.json","image_url":"https://www.washingtonpost.com/resizer/gNSqoFCS4xyny0xRQG5IOJpGOS0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OVJGWW3Z2IZRPFD7G6INJ3U6M4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_made-by-history_wp_2018_06_27__1540092560.html","title":"The dissent in Janus shows that liberal justices are finally on the side of the working class","title_page":"The dissent in Janus shows that liberal justices are finally on the side of the working class - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"A union member attends a rally outside San Francisco City Hall on Feb. 26 as the U.S. Supreme Court began to hear oral arguments in Janus v. AFSCME. (Justin Sullivan/Getty Images)\nElizabeth Tandy Shermer is an assistant professor of history at Loyola University Chicago and author of \" Sunbelt Capitalism: Phoenix and the Transformation of American Politics .\"\nThe Supreme Court has once again upheld Americans’ right to work for less. Today’s decision in Janus v. AFSCME should not surprise anyone. Judges have been undermining labor rights and protections for 70 years. Yet this 5-to-4 decision also indicates a break with tradition. The court’s liberal justices finally seem to be uniformly on the side of working people, their unions and the larger labor movement.\nLiberals have not always been reliable defenders of the 99 percent. They earned their worker-friendly reputation during the Great Depression by supporting a variety of reforms intended to create economic stability and opportunity for individual Americans and the country as a whole. At the heart of these reforms were new labor rights, most notably those contained in the storied 1935 National Labor Relations Act, known as the Wagner Act, which gave workers the right to organize unions and elect leaders in free and open elections overseen by the federal government. The court upheld the law in the 1937 case of National Labor Relations Board v. Jones & Laughlin Steel Corporation.\nThat historic 5-to-4 decision, however, did not stop conservatives from trying to limit working people’s rights. Southern Democrats, right-wing Steel Belt Republicans and rural Westerners in both parties failed to block the Wagner Act, but they succeeded in limiting its scope. It did not cover agriculture, domestic or public-sector workers, which prevented many women, minorities and immigrants from getting anything close to a New Deal.\nBut the crowning conservative antilabor achievement was the 1947 Taft-Hartley Act. Liberals and union members considered it a “slave-labor bill” because it included numerous punitive amendments to the Wagner Act that have continued to hamstring the labor movement, limit democracy on the job and ensure Americans have to work longer hours for less pay than anyone else in the Western world.\nFew remember, however, that it was liberal justices on the Supreme Court who aided and abetted this conservative push.\nLabor leaders first challenged right-to-work legislation and the section of Taft-Hartley that permitted states to pass it in 1948. They argued that prohibiting contract clauses that helped maintain membership violated both the freedom of contract and the freedom to assemble (in this case: with only union workers). Yet the court not only upheld that pivotal provision of Taft-Hartley but also undermined Wagner’s insistence that unions were crucial to ensuring fair and free contracts in the 1949 American Federation of Labor v. American Sash & Door Co. decision.\nIn the majority opinion, liberal Roosevelt-appointee Hugo Black deemed the right-to-work provision constitutional because it “prohibits employment discrimination against nonunion workers.” In a concurrence, Justice Felix Frankfurter, who earned a reputation as a conservative jurist but who had been a top Roosevelt adviser concerned about economic inequality before joining the court, declared that the quandary between what was good for the union and better for an individual was a decision best left up to the states.\nOver the coming decades, the court would continue to reflect liberal ambivalence — even hostility — toward labor rights. Liberals still proclaimed themselves the defenders of working Americans. But unions continually found that they could not count on liberals for support as they faced political challenges from the left and right. Civil rights activists rightly pointed out how some unions helped perpetuate racism and sexism at the same time that conservatives wrongly denounced the entire labor movement as corrupt, bad for business and an un-American affront to freedom.\nThe court likewise offered mixed support for the labor movement from the 1950s through the 1970s, even as the Warren Court gained a liberal reputation for protecting individuals’ civil rights and civil liberties. Despite the presumption that liberals dominated the bench in those years, conservatives and businesses prevailed in many of the cases pushed by the well-funded National Right to Work Legal Defense Foundation, which was also involved in Janus.\nThe contradictory record of liberal Supreme Court justices can be traced through the court’s handling of the agency-shop issue central to Janus. In the 1950s, unions started negotiating for fair-share, or agency shop, fees in contracts to try to stanch a growing decline in membership rates and dues. The money charged to nonmembers amounted to just a small fraction of what unionists paid to belong to organizations that were legally bound to bargain and enforce contracts for everyone — union and nonunion members alike.\nJustices weighed in on the legality of fair-share fees several times over decades. The court initially upheld private-sector unions’ ability to bargain for them in 1956. But in 1963, the justices both unanimously protected the agency shop and expanded the scope of right-to-work statutes in two separate cases, from which former secretary of labor and Kennedy appointee Arthur Goldberg abstained. Another Kennedy appointee, Byron White (a Democrat whose votes never neatly fell on the left or right) wrote the majority opinions. One rejected the argument that fair-share fees were an unfair labor practice, whereas the other asserted that fair-share fees had implicitly been banned in right-to-work states unless statutes included explicit permission for such agreements between unions and employers.\nThose decrees did not stop the war on labor rights. In the 1977 case Abood v. Detroit Board of Education, the court ruled that public employees in non-right-to-work states could bargain for fair-share fees. This money could be used only to bargain and enforce the contract from which everyone benefited. None of that revenue could go toward political organizing, which nonmembers might oppose.\nDecisions such as Abood contributed to the simultaneous steady rise of public-sector unions not protected under the Wagner Act and the decline of private-sector unions, which began in the 1950s but really picked up steam in the 1970s.\nOn the surface, then, there is nothing new about Janus. Many experts warned it would overturn Abood, and it did — with Justice Samuel Alito’s majority opinion dismissing Abood as a “poorly reasoned” decision that “led to practical problems and abuse.” That all-too-common, erroneous damnation highlights how Janus simply continues the 50-year battle over fair-share fees, a part of the much longer war on Americans’ basic rights on the job.\nYet the ruling highlights just how partisan right-to-work laws, fair-share fees and workers’ rights have become in recent years. Republican governors and legislatures have made headlines for quickly passing these punitive laws as they gained more control of state governments, particularly in the heavily gerrymandered Midwest. Unlike the first right-to-work campaigns, lawmakers never placed these statutes before voters, who have remained supportive of trade unionism and protested their passage even though the Midwestern labor movement has shrunk dramatically in size and strength since the 1950s. Janus, for example, originated in Illinois, where unpopular Republican Gov. Bruce Rauner has struggled to pass laws and budgets that restrict unions and benefit wealthy business interests.\nThis partisan divide also now extends to the court. While liberal jurists may have once aided and abetted the drive to crush unions, the Janus decision saw the five Republican-appointed justices aligned on the anti-union side against the four Democratic-appointed justices. While Justice Elena Kagan’s minority opinion was hardly the kind of strident rebuke of anti-unionism that Justice Ruth Bader Ginsberg delivered a few weeks ago in Epic Systems Corp. v. Lewis, the dissent still recognized the soundness of Abood and its importance to both public employees and employers across the country.\nThis and other recent party-line decisions show encouraging signs that liberals, after decades of equivocating on their support for working people, may finally be willing to stand up against the right’s insistence that Americans only have the right to starve, regardless of how much they work.","url":"https://www.washingtonpost.com/news/made-by-history/wp/2018/06/27/the-dissent-in-janus-shows-that-liberal-justices-are-finally-on-the-side-of-the-working-class/"}
