{"authors":[],"date_download":"2018-10-30 14:28:03","date_modify":"2018-10-30 14:28:03","date_publish":"2014-06-23 00:00:00","description":null,"filename":"data/vaneerConsumption/TheDeliciousIronyofHillarysPotentialPoliticalDemise.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2014_06_the_delicious_irony_of_hillarys_potential_political_demise__1540909683.html","title":"The Delicious Irony of Hillary's Potential Political Demise","title_page":"The Delicious Irony of Hillary's Potential Political Demise","title_rss":"NULL","source_domain":"americanthinker.com","text":"Back in 1975, Thomas Alfred Taylor lured a 12-year-old girl into his car and raped her. At the time, Yale Law School graduate Hillary Rodham knew Taylor was guilty, but as a favor to a prosecutor friend she provided the rapist a legal defense, pleaded him down, and years later was taped laughingly recalling her clever courtroom strategy.\nIn what may turn out to be the most delicious irony in the history of politics, an archived tape recently resurfaced featuring Hillary Clinton chuckling about defending a lowlife rapist named Thomas Alfred Taylor. That dusty old tape may be what finally halts Hillary Clinton’s decades-long climb to what she had hoped would be the top of the political power heap.\nIn pursuit of her long-term goal to become the first female president of the United States, besides carpet-bagging and pretending to be the better half of a sham marriage, forbearing Hillary Clinton has spent most of her married life regularly defending her cigar-smoking husband’s sexual improprieties.\nMr. Clinton’s extracurricular activities have included groping married women in the Oval Office, introducing Little Willy to frightened registration clerks at governors’ conventions, and messing up blue Gap dresses.\nIt’s also common knowledge that notorious Lothario Bill Clinton once had an ongoing affair with a cabaret singer, not to mention one-night stands with various actresses, politicians, and ex-beauty pageant winners. Besides Monica there were names like Markie Post, Sally Perdue, Elizabeth Gracen, Dolly Kyle Browning, and last but certainly not the last, Clinton campaign volunteer Juanita Broaddrick.\nSometime in 1978, just three years after Hillary got Thomas off the hook, Ms. Broaddrick alleged that then- Arkansas attorney general Bill Clinton raped her in a Little Rock hotel room. Bloodied, stunned and violated, Broaddrick said, “I tried to get away from him. I told him 'no’… He wouldn't listen to me.”\nBy the time the Broaddrick accusation surfaced, Hillary had already successfully defended Thomas Alfred Taylor. That’s why Mrs. Clinton certainly wasn’t going to let a lowly nursing home administrator from Arkansas get in the way of her political ambitions.\nTwo weeks after the alleged crime, during which Broaddrick claimed Bill Clinton assured her that she needn’t worry about pregnancy because he was rendered sterile from the mumps, women’s advocate Hillary thanked her for ‘all she’s done for Bill,’ which Juanita understood to be a veiled threat.\nIn an accurate assessment of Hillary’s ongoing defense of the indefensible, years later Broaddrick accused the inventor of the “vast right wing conspiracy” of spending her entire life ‘covering up’ Slick Willy’s actions for “power and money.”\nFast-forward to the Washington Free Beacon recently gaining access to a recorded interview that was archived at the University of Arkansas in Fayetteville, now dubbed the Hillary Tapes.\nOn those tapes, the woman in pursuit of the ultimate power can be heard giggling about how she singlehandedly managed to get the rapist of a 12-year-old child a lesser charge of unlawful fondling of a minor under the age of 14. Self-professed women’s advocate Hillary Clinton’s defense effectively lowered a five-year prison sentence to four years of probation with one year in county jail, which was then reduced to 10 months for time already served.\nDuring the trial,a little girl was put through what she now, at age 52, describes as “hell” by none other than Hillary Clinton, whose defense strategy was to “impugn the credibility of the victim,” a skill Mrs. Clinton has continued to honeover the years. Case in point: Hillary calling Monica Lewinsky “a narcissistic loony toon.”\nHillary had zero compunction about exploiting the tried-and-true “putting the victim on trial” technique on a young girl. After accusing the 12-year-old rape victim of seeking out older men, Hillary, who Bill once called “smartest woman in the world,” deceitfully used that allegation to request that the injured child undergo a psychiatric evaluation.\nThat despicable strategy leaves rape victims, even as adults, still feeling they need to defend themselves, which is what Taylor’s victim recently did when she said, “I never sought out older men. I was raped.” Having been traumatized by both Taylor and Clinton, after hearing the tape the victim courageously challenged Mrs. Clinton’s feminist credentials, asking, “You call that [being] for women, what you done to me? [sic]”\nHillary, who more recently lied that a judge appointed her to defend the rapist – thus implying that she had no choice but to take the case – is neither for women, children, nor men being sodomized and murdered in Benghazi, for that matter. As Juanita Broaddrick correctly discerned, Hillary Clinton has proven that the only woman she is for is herself.\nOn the tapes, Hillary can be overheard confessing, “I had [Taylor] take a polygraph, which he passed, which forever destroyed my faith in polygraphs.” That admission, in effect, confirmed that Hillary revictimized the child, knowing full well the attacker was guilty.\nMrs. Clinton was also overheard laughing when discussing the crime lab’s unintentional destruction of DNA evidence tying the rapist to the crime.The ability to discredit the DNA evidence during the rape trial was what, in her 2003 autobiography Living History, Hillary claimed inspired her to set up Arkansas’ first rape hotline, which must have come in handy for at least some of Bill’s alleged victims.\nJudging from her track record of defending a sexual predator to benefit personal political aspirations, from what can be overheard on the tape apparently Hillary was rather amused that she managed to elevate her own status by putting a child rapist back on the street.\nThat’s why, after spending decades protecting her professional aspirations at the expense of women victimized by her philandering husband, it would be deliciously ironic for Hillary to be publicly disgraced for having defended a fiend who had raped a 12-year-old child while knowing full well he was guilty.\nMoreover, after subjecting America to the ongoing Clinton charade and now being caught snickering about a child rape case, it’s time Bill’s victims finally get to see Hillary ‘What Difference Does it Make’ Clinton exposed for the deceitful, ruthless opportunist she really is.\nJeannie hosts a blog at www.jeannie-ology.com","url":"https://www.americanthinker.com/articles/2014/06/the_delicious_irony_of_hillarys_potential_political_demise_.html"}
