{"authors":["Jennifer Brett"],"date_download":"2018-10-30 21:41:43","date_modify":"2018-10-30 21:41:43","date_publish":"2015-03-03 11:22:16","description":"Teen movie \"The Duff,\" in theaters now, chronicles the travails of a brainy high school student stru...","filename":"data/vaneerConsumption/TheDuffexecssaluteAtlantasfilmingcommunity.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_the-duff-execs-salute-atlanta-filming-community__1540935703.html","title":"\"The Duff\" execs salute Atlanta's filming community","title_page":"\"The Duff\" execs salute Atlanta's filming community","title_rss":"NULL","source_domain":"ajc.com","text":"Teen movie \"The Duff,\" in theaters now, chronicles the travails of a brainy high school student struggling to find her place amid a sea of more beautiful, more popular young creatures.\nMae Whitman stars as Bianca in \"The Duff,\" which filmed in metro Atlanta. Photo credit: Guy D’Alema\nUnlike the exclusive cliques and vicious social media campaigns plaguing heroine Bianca (Mae Whitman), the filmmakers found Atlanta to be a welcoming, friendly place.\n\"This was the first time I’ve ever shot in Atlanta,\" said director Ari Sandel. \"It was an overall great experience. The only thing that was rough was coming to the hot Atlanta humidity. I was nothing but amazed at how vibrant and how complex the (film) industry was in Atlanta.\"\nIn fact, the growing moviemaking community was almost too vibrant.\n\"It was hard to find crew because everybody was working,\" he said.\nBella Thorne, right, plays Bianca's chief tormentor in \"The Duff.\" Photo credit: Guy D’Alema\nArea filming locations included Grady High School and Marietta High School, along with homes in the Kirkwood area and Perimeter Mall.\n\"The filming experience in Atlanta was fantastic,\" said producer Susan Cartsonis. \"It can look like so many different places.\"\nThe movie stars Bella Thorne as the meanest of the mean girls, along with Nick Eversman as hunky but vapid Toby, Bianca A. Santos and Skyler Samuels as hot but not unkind Casey and Jess and Ken Jeong and Romany Malco as Bianca's kind teacher and well-intentioned principal.\nThe book is based on the young adult novel by Kody Keplinger. The term \"Duff,\" by the way, is a made-up acronym that stands for \"Designated Ugly Fat Friend.\" Whitman of course is neither fat nor ugly, but her character gets a crash course in her place on the high-school pecking order courtesy of her lifelong friend Wesley, played by Robbie Amell. Apparently you can be a \"Duff\" simply by being less fabulous than your peers.\n\"I think everybody can relate to this,\" said producer Mary Viola. \"In any group you’re in you can feel like the best-looking one or the least best-looking one. We’re in Los Angeles. It’s a town of very pretty people. It’s easy to feel like the oddball out.\"\nAll the more reason to return to Atlanta soon, right?\n\"We were really happy to be in Atlanta,\" Cartsonis said. \"I don’t think that local people are jaded by the film industry. People are still excited and kind.\"","url":"https://www.ajc.com/blog/buzz/the-duff-execs-salute-atlanta-filming-community/w6lfH7VOECAQnCJXv480zH/"}
