{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 22:40:42","date_modify":"2018-10-30 22:40:42","date_publish":"2016-12-12 00:00:00","description":"American and Delta Air Lines have banned cellphone calls on planes. But the US government wants to know whether people think in-flight calls should be allowed.","filename":"data/vaneerConsumption/TheDOTandFCCmayallowpassengerstomakeinflightphonecalls.json","image_url":"https://amp.businessinsider.com/images/584b1edcca7f0cf3008b4b9c-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_cell-phone-calls-airlines-dot-fcc-2016-12_1540939242.html","title":"The DOT and FCC may allow passengers to make in-flight phone calls","title_page":"    The DOT and FCC may allow passengers to make in-flight phone calls - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"iStock/jean-marie guyon On December 8, the Department of Transportation announced a proposal that would require airlines and ticket agents to disclose in advance whether voice calls are allowed on-board during flights.\nAlthough most passengers assume cellphone use is prohibited by the federal government on commercial flights, that's actually not the case.\nIn fact, the DOT's announcement shines a new spotlight on a little-known technicality.\nWhile the Federal Communications Commission has banned the in-flight use of cellphones on certain radio frequencies, current regulations do not cover voice communications made via Wi-Fi, the DOT wrote in a statement.\nAs a result, the FCC has not yet been explicitly outlawed technology such as Skype, Apple FaceTime, and Google Hangouts on planes — leaving the possibility open for in-flight voice calls.\n\"Consumers deserve to have clear and accurate information about whether an airline permits voice calls before they purchase a ticket and board the aircraft,\" U.S. Secretary of Transportation Anthony Foxx said in a statement. \"Today's proposal will ensure that air travelers are not unwillingly exposed to voice calls, as many of them are troubled over the idea of passengers talking on cell phones in flight.\"\nApple FaceTime. PA images Now, the DOT is seeking public feedback over the next 60 days to find out if people think a disclosure requirement would be adequate, or whether all mobile voice calls should simply be banned outright on commercial flights within, to, and from the United States.\nThe DOT's latest announcement reignited a debate that started in 2013, after the the FCC indicated it would review whether the two-decade-old ban on in-flight cellphone use should be lifted. On the federal government's feedback website, the agency wrote:\n\"The Department of Transportation (DOT or Department) is seeking comment on whether it should adopt a rule to restrict voice communications on passengers' mobile wireless devices on scheduled flights within, to and from the United States. The Federal Communications Commission (FCC) recently issued a notice of proposed rulemaking that if adopted would, among other things, create a pathway for airlines to permit the use of cell phones or other mobile wireless devices to make or receive calls onboard aircraft. DOT supports the FCC's proposal to revise its rules in light of the technology available and to expand access to mobile wireless data services on board aircraft; however, under the Department´s aviation consumer protection authority and because of concerns raised, we are seeking comment on whether to ban voice calls on aircraft.\"\nThe response from the public has so far been overwhelmingly against any form of in-flight voice calls.\nOne commenter wrote, \"No phone calls of any kind. Chaos will ensue.\" Another commenter echoed this sentiment: \"Please do not allow cell phone conversations on commercial flights. I've flown millions of miles and believe this will be a terrible disruption and will lead to flights that are much less pleasant.\"\nAnother cited added stress for the cabin crew— writing, \"No. please don't pass this. Aside from the annoyance of sitting next to the loud talker and people getting agitated [with] this.... The flight crew already has enough to handle [with] inconsiderate passengers to add this will make it even more like a public transportation bus. Please put yourself in the crew's place when making this decision!\"\nSleeping passengers. volkova natalia/Shutterstock However, one commenter who identified himself as an airline captain supported in-flight voice calls.\n\"I am an airline captain and fully support the unregulated use of personal technology on aircraft,\" the commenter wrote. \" Voice calls are possible now with VOIP, FaceTime, Skype, etc are actually taking place on aircraft. It seems silly to make these illegal. People need to use their discretion on talking while sitting next to someone on an aircraft. This is an issue of manners and common sense.\"\nWhile the federal government may be debating the possibilities for in-flight phone calls, airlines don't believe there's much to discuss on this topic. In fact, Airlines For America— an aviation trade group that counts American, United, JetBlue, Southwest, and Alaska Airlines as members — don't think the DOT should weigh in on the issue at all.\n\"We have long held that this was not a matter for DOT to regulate, and we believe airlines should be able to determine what services can be safely offered in flight and make those decisions based on what is in the best interests of their passengers and crewmembers,\" an Airlines For America spokesperson told Business Insider in an email.\nDelta Air Lines cabin. Flickr / ERIC SALARD Currently, American, Delta, and United all forbid voice calls of any type on board its flights.\nIn 2013, then-Delta CEO Richard Anderson made that clear, writing in a memo:\n\"Delta will not allow cellular calls or internet-based voice communications onboard Delta or Delta Connection flights. Our customer research and direct feedback tell us that our frequent flyers believe voice calls in the cabin would be a disruption to the travel experience. In fact, a clear majority of customers who responded to a 2012 survey said they felt the ability to make voice calls onboard would detract from - not enhance - their experience. Delta employees, particularly our in-flight crews, have told us definitively that they are not in favor of voice calls onboard.\"\nIn an email to Business Insider, a Delta spokesperson wrote, \"Delta in the past has not been in favor of allowing voice calls on board, and that position has not changed.\"\nA United Airlines spokesperson told Business Insider that the company is reviewing the proposal and will listen to the views of its customers and employees.","url":"https://www.businessinsider.com/cell-phone-calls-airlines-dot-fcc-2016-12"}
