{"authors":[],"date_download":"2018-10-30 00:51:00","date_modify":"2018-10-30 00:51:00","date_publish":"2018-09-12 00:01:17","description":"One explanation for the ferocity of modern politics is that The Political Party That Is Never Wrong is getting a frightful drubbing today. Moreover, it is coming from a man who has only sought political office once in his life, our president, Donald J. Trump. Congratulations, Donald!","filename":"data/vaneerConsumption/TheDemocratsThePartyofResistance.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/Trump-Inauguration2017-1050908_31620567273.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860660.html","title":"The Democrats: The Party of Resistance","title_page":"The Democrats: The Party of ResistanceThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Washington\nOne explanation for the ferocity of modern politics is that The Political Party That Is Never Wrong is getting a frightful drubbing today. Moreover, it is coming from a man who has only sought political office once in his life, our president, Donald J. Trump. Congratulations, Donald!\nHe is beating the Democrats with policies that have revived the economy and rendered laughable Ex-President Barack Obama’s pathetic claim that the “new normal” is someplace around 2 percent growth. President Trump responds that his economy is now growing at a rate of some 4.2 percent, most likely even higher. President Trump is also beating The Political Party That Is Never Wrong with his judicial appointees. He has had confirmed 67 to the courts. More than any of his predecessors at this stage in their presidencies, and if all goes well he will have landed two appointees on the Supreme Court shortly. Finally, he is beating The Political Party That Is Never Wrong by rolling back that party’s stifling regulations and antiquated procedures. The party is desperate.\nThe Political Party That Is Never Wrong is led by septuagenarians who are exhausted and feckless, and they are about to be replaced by greenhorns who are self-proclaimed Socialists. That is to say, the septuagenarians are about to be replaced by Machiavels whose politics are at best lifted from the European left or at worst lifted from Venezuelans, some of whom have to stand in line for toilet paper. The Democrats, at various times in our history, have called themselves Liberals, Progressives, the left, and now Socialists. They claim that history has been on their side since at least the French Revolution. Every major achievement by mankind in such areas as philosophy, science, government, warfare, and — forget not — women’s studies and sex hygiene have been achieved by the American left.\nThat is why they are so furious today. In last week’s grilling of Supreme Court nominee Brett Kavanaugh, they threatened to break the law. Some actually did break the law, and they all charged Judge Kavanaugh with barbaric beliefs, grievous wrongs, and writing for The American Spectator, which was one of their few accurate observations. Judge Kavanaugh’s wife had to remove his children from the hearing rooms. Possibly she removed them from the entire city of Washington, D.C. and surroundings.\nAccepting defeat is quite incomprehensible to the left. That is why every contested presidential election of the modern era — in fact, every contested presidential election in any era — has been contested by the left, not the right. Interestingly, in recent years, as the left’s power dwindles, the number of contested elections has increased and grown more rancorous.\nNineteen-sixty was a very close election, but if it were to be contested Richard Nixon would have had to do it. He would not put the country through the ordeal of a recount. His reelection of 1972 was one of the greatest landslides in American history, and The Political Party That Is Never Wrong immediately put our country through the travail of Watergate. Few claimed the 1972 election was stolen by the fiendish Nixon — though I recall one or two fanatics — but by 1974 The Political Party That Is Never Wrong had come to the realization that there is more than one way to challenge an election. Nixon went quietly and with dignity. He had after all lied. When Bill Clinton faced impeachment in 1998 there was no dignity. There was in 1998, as Clinton’s wife is demonstrating today, only “resistance.”\nThe elections of 1980 through 1996 were pretty much normal, though The Party That Is Never Wrong did sense a glimmer of hope in 1986 when Iran-Contra inspired dark murmurings about President Ronald Reagan’s possible impeachment and, who knows, possible incarceration for life without parole? Then came the election of 2000 with all the left’s talk of “hanging chads,” replacing the Electoral College, and, in Florida, dark cabals. Suffice to say that in Florida George W. Bush won by 537 votes and with it won in the Electoral College. To this day there are Democrats who will tell you that their candidate won, but not according to the Constitution, which is still in effect.\nIn 2016 as in 2000 The Party That Is Never Wrong won the popular vote, but it lost in the Electoral College by 304 to 227. Two years later we are still wrangling about the outcome with Democrats in the FBI, the CIA, the Democratic National Committee, British Intelligence, a law firm hired by the Clintons, and the mysterious Fusion GPS claiming Russian collusion though no Russian has been found. Once again there is talk from the Democrats of a Republican president’s impeachment, though this time the Republican President might not be as nice as Richard Nixon in 1960 and 1974.\nThis time the Republican is Donald Trump, who has his finger on the atomic bomb.","url":"https://spectator.org/the-democrats-the-party-of-resistance/"}
