{"authors":[],"date_download":"2018-10-30 14:24:54","date_modify":"2018-10-30 14:24:54","date_publish":"2018-08-20 00:00:00","description":null,"filename":"data/vaneerConsumption/TheDoGoodersWhoGotaHardLessonintheExistenceofEvil.json","image_url":"https://www.americanthinker.com/images/bucket/2018-08/208488.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2018_08_the_dogooders_who_got_a_hard_lesson_in_the_existence_of_evil_1540909494.html","title":"The Do-Gooders Who Got a Hard Lesson in the Existence of Evil","title_page":"The Do-Gooders Who Got a Hard Lesson in the Existence of Evil","title_rss":"NULL","source_domain":"americanthinker.com","text":"Born in New York, Jay grew up in Monmouth County, attended the University of Delaware, and earned a master's degree from Georgetown University. It was at Georgetown that Jay met fellow unicorn-chaser Lauren Geoghegan. Austin, a vegan, spent his days advocating for sustainable living, worked for the Department of Housing and Urban Development (HUD) during the Obama administration, and owned a trendy micro-house he parked in Washington, D.C.\nIn 2001, believing he was Superman and could fly, a third-grade boy named Julian Roman attempted to jump rooftops in the Bronx. Julian died after slipping and smashing into an air conditioner protruding from an apartment window below. At the time of Julian's death, in Manalapan, New Jersey , a boy named Jay Austin was cultivating a Superman mentality similar to the one that cost Julian his life.\nIn 2017, Jay decided to follow in Julian Roman's footsteps and tempt fate. At the time, Austin wrote on his bicycle blog that \"[t]here's magic out there, in this great big beautiful world.\" Apparently, Jay believed that \"wishing for kind human beings\" supernaturally creates kind human beings. So, to prove that his brand of \"magic\" had power, he and girlfriend Lauren gave two weeks' notice and embarked on a cycling journey.\nIn the second year of the couple's intercontinental bike trek, on a quest to prove that those perceived to be evil for beheading enemies with hunting knives, drowning cages full of helpless men, and burning people alive just \"hold values and beliefs and perspectives different than our own,\" Jay and Lauren pedaled into ISIS recruitment territory.\nIn the midst of virtue-signaling, the bicycle enthusiasts delivered warm hugs and sunflower sentiments to the \"astoundingly generous\" people living in the central Asian Muslim republic of Tajikistan. The problem is that the area borders Afghanistan and is also known for recruiting ISIS J.V. team members, lacks religious freedom, and is guilty of widespread human rights violations.\nAbout the mode of transportation the couple preferred, Jay wrote this:\nBikes are a clean and quiet and simple way to get around, and a cheap one, too. They may make you more vulnerable, sure, but also more approachable. Humans can be an astoundingly generous species, and whether out of amazement or pity or a mix of both, one is likely to be offered more smiles, more encouraging waves, more curious conversations and genuine offers of a bed or a place to camp when biking than by perhaps any other mode of transport.\nSadly, instead of \"curious conversations\" and posting pictures on Instagram of the liberals sharing steamy bowls of plov with villagers, Jay, Lauren, and five other bicyclists were run off the Pamir Highway by a band of ISIS soldiers, who hacked four of the seven happy-go-lucky cyclists to death.\nBefore being murdered, on a blog that doubled as a travelogue, Jay expressed the following sentiments:\nYou watch the news and you read the papers, and you're led to believe that the world is a big, scary place. People, the narrative goes, are not to be trusted. People are bad. People are evil. People are axe murderers and monsters and worse. I don't buy it. Evil is a make-believe concept we've invented to deal with the complexities of fellow humans holding values and beliefs and perspectives different than [sic] our own – it's easier to dismiss an opinion as abhorrent than strive to understand it. Badness exists, sure, but even that's quite rare. By and large, humans are kind. Self-interested sometimes, myopic sometimes, but kind. Generous and wonderful and kind. No greater revelation has come from our journey than this.\nThe blogger's final revelation was never posted to his website because, just as Julian thought he could defy gravity, Jay's belief that \"evil is a make-believe concept\" led to his demise.\nWith that in mind, Jay Austin and his girlfriend, Lauren Geoghegan, were either profoundly brainwashed into believing that American conservatives are more dangerous than ISIS or, despite being educated at Georgetown University, unaware that history and Scripture both chronicle the reality that, since the dawn of creation, humankind has struggled with evil.\nRegrettably, whether on a roof in the Bronx or a dusty road in Central Asia, in a violent, disastrous way, despite good intentions, bad things happen. Julian Roman believed he was Superman and could fly. He was wrong. Either Jay and Lauren were making a symbolic statement or both honestly thought human beings are inherently good. They too were wrong and ended up as dead as the wannabe superhero from the Bronx.\nThere is a life lesson here concerning the progressive mindset to be gleaned from these sad events. For instance, let's apply Jay's and Lauren's attitude to another unicorn fantasy falsely perceived by leftists to be something that it's not: socialism.\nNo disrespect for the dead, but Jay and Lauren were deluded, naïve, and imprudent travelers who believed that entering ISIS territory would be different if they were the ones doing the venturing. In like manner, socialist-minded advocates think that although socialism has failed miserably wherever it's been tried, if American progressives like Sanders and Ocasio-Cortez get to divvy up the wealth, for the first time, capitalist naysayers will be proven wrong.\nSimply put, the result of biking through ISIS territory to prove that evil doesn't exist can be likened to biking through Venezuela to establish socialism as a force for good or jumping off a roof believing you're Superman.\nMuch like Jay and Lauren, both of whom falsely believed that \"pedaling the planet\" would prove to skeptics the innate goodness within all human beings, Marx and Engels preached that socialism and communism would usher in Heaven on Earth. If, prior to being murdered while conveying good vibes to ISIS on the Pamir Highway, Jay and Lauren had decided to take a trip through Caracas, Venezuela, there's a good chance the reckless romantics would have met a similar end.\nJeannie hosts a blog at www.jeannie-ology.com.","url":"https://www.americanthinker.com/articles/2018/08/the_dogooders_who_got_a_hard_lesson_in_the_existence_of_evil.html"}
