{"authors":[],"date_download":"2018-10-30 01:22:29","date_modify":"2018-10-30 01:22:29","date_publish":"2016-06-20 15:30:02","description":null,"filename":"data/vaneerConsumption/TheDiaryofWillisFumbleton.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/06/Trump_CAUCUS_241401581031.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862549.html","title":"The Diary of Willis Fumbleton","title_page":"The Diary of Willis FumbletonThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"I started to keep this diary the day I realized I would be at the center — or, pending resolution of low-intensity office conflict, at the edge — of the wildest campaign of the century. Any century.\nI’m a campaign guy. I’ve run campaigns and covered campaigns and funded campaigns and subverted campaigns. I can’t stay away. It’s the great American pastime, baseball without the tedium, and it comes with a rare binary satisfaction in a world full of nonjudgmental umps and the global warming of fudged result. Over the years, I’ve played about every position on the campaign team but candidate. No, I’d never go that far. When campaign guys run across each other along the trail, they always ask each other the same question, along about the second drink at the airport bar: “What’s your candidate like?” And they always get the same answer: “Well, he’ll never need Preparation H.” By which they mean, of course, that their candidate is a perfect asshole. It takes a special kind of guy to run for office these days. A guy who has no business winning.\nTake your top two candidates today, H and D, both of them manifestly unqualified to hold the office they seek, the one by character, the other by temperament. This should be a great contest, with the two candidates so evenly matched and so widely despised. I have gone all in for D. He may get distracted. H will steal with both hands.\nI suppose I should introduce myself. My name is Willis Fumbleton. Yeah, I’m almost as WASPy as I sound. My folks came over in the bow of the first rowboat from the Mayflower. That lineage and four bucks will get you a nonfat grande latte, and admission to a fusty club you have no interest in joining, but it can also give you an edge when pitching a political campaign. Most campaign guys are ethnically, sexually or sartorially colorful, politics being the last refuge of the unlettered but financially ravenous amateur. Most campaign guys are scary, their rapacity imperfectly disguised. Candidates look at me and see solid and sober and smart. Compared to some of the ding-a-lings in the campaign business, I guess I am.\nThe archetypal figure here is my friend Mike Murphy. Nobody plays the Irish scamp better than Mike. When dogged by rumors that he had ripped off the Bush campaign, Mike — who no doubt was the genius who put the exclamation point in Jeb! — told the press that he had taken less than a million dollars for his services, the implication being that if he had been paid a grown-up’s fee he would have stirred himself to drive Jeb! up to, say, an eleventh-place finish. You gotta like Mike.\nI have to go now. We’ve set up a briefing for D with one of our 24K foreign policy experts, who’s been promised ten minutes to make his case. I love these briefings. In the office pool I’m up $1200 so far on the standing bet that Mr. Expert, whoever he might be on any given day, will not hit the three-minute mark before an intervention by D. It’s classic stuff. As D vents about his superficial experience with some more-or-less related subject, he persuades all hands that he’s the dumbest guy in the room. If D’s agenda is to lull the cognoscenti into underestimation, it’s working like a charm. I know I’m underestimating him.\nWillis Fumbleton may or may not be a Senior Adviser to the Donald J. Trump campaign.","url":"https://spectator.org/the-diary-of-willis-fumbleton/"}
