{"authors":[],"date_download":"2018-10-30 00:53:28","date_modify":"2018-10-30 00:53:28","date_publish":"2017-01-26 00:00:00","description":null,"filename":"data/vaneerConsumption/TheDCEmpireStrikesBack.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2017_01_the_dc_empire_strikes_back_1540860808.html","title":"The DC Empire Strikes Back","title_page":"The DC Empire Strikes Back","title_rss":"NULL","source_domain":"americanthinker.com","text":"The DC Empire Strikes Back\nFor the political elite, President Trump's inauguration was like a party from hell. First there was the inaugural speech, in which Trump skewered \"a small group in our nation's capital\" who have prospered at the expense of heartland America. His election was more than a routine contest between parties, he said; it was a movement, and \"at the center of this movement is a crucial conviction, that a nation exists to serve its citizens.\" \"From this day forward,\" he roared, \"it's going to be America first, America first.\" Then there was the inaugural parade, with the military ensembles; the police and veterans' groups; the Boy Scouts and Girl Scouts, the bands from Olivet Nazarene University and Texas State; the high schoolers from Indianapolis and Frankfort, West Virginia; the Mid America Cowgirls Rodeo Drill Team; and, not least of all, the Rural Tractor Brigade.\nWhere was Beyoncé, Michelle's \"role model\" for her girls? (Those inured to vulgarity may wish to check out her performance of \"Formation,\" not what I'd want my daughter, if I had a daughter, to be doing.) Where were Usher and Alicia Keys, with their chart-topping \"My Boo,\" an insipid testament to hormones and doing just about anything you want? Where was the rhetoric of \"us\" and \"them,\" designed to wrench the country further apart and drive minority turnout in future elections? (There was plenty of that in Charles Schumer's mind-numbing introduction of Justice Roberts, but Trump had nothing to do with that.) For the political elite, there was entirely too much love of America, too many calls for unity, too much respect for our military and police, too much hope for a brighter day, too much faith in God, and too much belief in what ordinary Americans can achieve if given the chance. That's what the left calls a \"dark\" speech. The truth is that America's political elite, the tight group of smug, well connected, well educated insiders who control much of government, higher education, and the media, have no intention of giving America a chance. Their response to Trump is a perfect gauge of just how much they despise the ordinary person living and working in our nation's smaller cities and towns and in rural America. Their response was soaked in cynical contempt for the hopes of heartland America. The elite are shocked and disgusted by Trump's victory, and they are determined to undermine his presidency and quickly replace him with one of their own, an Elizabeth Warren or Cory Booker. But this time their response is driven not primarily by strategy. It is driven by visceral contempt for Middle America and for one element of heartland culture in particular: its optimistic faith in our nation and in God's providence toward its people. Within minutes of the inauguration, the media began penning its gotcha lines about a \"dark and ominous\" speech, the worst in history. What was it about the speech that was so offensive? Was it Trump's unrelenting emphasis on the \"people\" whom government is meant to serve, the people who own this country, the people who have been forgotten for so long and who, with his administration, will be forgotten no more? That was enough to bring them to the boiling point. Instead of flying off to the sunset like every other president before him, Obama decided to deliver an unconventional retort. \"It's always been about you,\" he assured his audience. Michelle and I, we've been \"your face and your voice.\" Translation: Trump's not your voice! It's ME, ME, ME. The legacy newspapers made it clear that Trump was not going to be their president, either. Back in August, as the mainstream media hyperventilated over Trump's growing popularity, Michael Goodwin wrote that \"journalism is collapsing before our eyes.\" Its collapse continues now that Trump is in office. The New York Times spent far more time on the protests and \"why Trump will fail\" than it did on the inauguration itself. WashingtonPost.com welcomed our new president with a searchable archive (\"Trump Revealed\") – a pageful of \"reporting\" on charges of bullying, bragging, exploiting, racism, and the like. It appears that the vast resources of the Times, Post, and other major papers could not uncover a single positive attribute of our new leader. And when Trump's new spokesman, Sean Spicer, complained, he was accused of attacking the press. Huh? Along with the off-the-wall personal attacks, there are the pious declarations that \"Trump will fail.\" In a Sunday New York Times opinion piece (\"Trump's Foreign Policy Team: Built to Fail\"), Jams Mann wrote that Trump's foreign policy appointments have no \"focus,\" no \"experience,\" and nothing to bind them together. (\"Strong disagreement seems baked into the team.\") In a front-page WSJ Review section, David Greenberg noted that \"controlling the White House and Congress is no guarantee of success.\" Trump is just as likely to fail as to succeed. Even Peggy Noonan, normally more circumspect, joined the chorus, arguing like many others that Trump may not be up to the task. If he disappoints, watch out! And the elite are eager to help him disappoint, right off the bat, by stalling his cabinet appointments. As I read the words of the political elite, the word that comes to mind is \"callous.\" These are the cynical voices of the Washington insiders lecturing a political novice and the mindless army of bumpkins who elected him on the way things work in D.C. Trump has deeply offended these pompous know-it-alls and the powerful interests they represent, and they're determined to get back at him, no matter what the cost to America. They'd rather have 2% growth forever than see some kid from Tulsa succeed in life. Just what is so offensive about Donald Trump? It's clear that he despises most of what the insiders believe, from the constant din of political correctness to Obama's \"shame on America\" take on foreign relations. Trump knows that the economy is rigged in their favor, and he's not afraid to say it or to do something about it. He's tweeted around the media, and in the process revealed just how irrelevant and dishonest the media are. Most of all, he listens to ordinary Americans and declares that this is their country. This \"new vision,\" which he confirmed in his inaugural address, amounts to a declaration of war against the political elite. Equally offensive to the elite, Trump mentioned God half a dozen times, a violation of their tacit ban on religion in the public arena. Trump has promised, with the help of all Americans, to make America strong, wealthy, proud, safe, and great. That promise goes to the heart of the matter. The political elite who have governed for the past 28 years do not seem to care about the prosperity, safety, or happiness of the average citizen. Tens of thousands are murdered each year; tens of millions live in poverty; one hundred million have seen no real improvement in living standards for decades; and, now that they have a chance, the political elite sneer at the idea of making their lives better. Hillary Clinton lost the election because she was the standard-bearer for the political elite. She displayed the same sneer, the same snicker, the same contempt for America's deplorables, and the deplorables hated her for it. It was Donald Trump who listened and who cared. It was Trump who declared in his inaugural address that \"whether a child is born in the urban sprawl of Detroit or the windswept plains of Nebraska ... they are infused with the breath of life by the same almighty Creator.\" Hillary would have said something like \"I'm so glad you voted for ME.\" It's a new era, and time for the political elite to depart the swamp. Without them, ordinary Americans have a chance to shine. Time to be strong, wealthy, proud, safe, and great. Time for the elite to get the hell out of our lives. Jeffrey Folks is the author of many books and articles on American culture including Heartland of the Imagination (2011).","url":"https://www.americanthinker.com/articles/2017/01/the_dc_empire_strikes_back.html"}
