{"authors":[],"date_download":"2018-10-30 14:20:26","date_modify":"2018-10-30 14:20:26","date_publish":"2016-08-17 00:00:00","description":null,"filename":"data/vaneerConsumption/TheDemocratsandcorruptionPerfecttogether.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_08_the_democrats_and_corruption__perfect_together_comments_1540909226.html","title":"The Democrats and corruption: Perfect together","title_page":"Blog: The Democrats and corruption: Perfect together","title_rss":"NULL","source_domain":"americanthinker.com","text":"In June, Democratic representative Chaka Fattah of Pennsylvania was found guilty of money laundering, bank fraud, mail and wire fraud. In July, Corrine Brown, a Democratic representative from Florida, was charged with running a fake charity, mail and wire fraud, and conspiracy and tax fraud. On August 4th Democratic Mayor Richard Silverhorne of Fairfax, Virginia was arrested for trying to trade meth for group sex. On August 15th, Kathleen Kane, the Democratic attorney general from Pennsylvania was found guilty of leaking Grand Jury information and committing perjury. Maybe the courts have hit their quota on charging Democrats with perjury or charity fraud and that is why Hillary, Eric Holder, and Lois Lerner are allowed to skate. Of course Bill Clinton, known perjurer, is still a hero for Democrats and the convicted felon George Soros is a well-known advisor to Bill, Obama, Hillary, and Kaine and major supporter of groups like Black Lives Matter. I am sure the... (Read Full Post)","url":"https://www.americanthinker.com/blog/2016/08/the_democrats_and_corruption__perfect_together_comments.html"}
the four strange deaths related to the Democrats who have died since June 22nd.\nI would think reporters might at least be curious, but they aren’t, for the same reason they have no time to focus on Hillary’s scandal. They have to focus 100% on taking down Trump.","url":"https://www.americanthinker.com/blog/2016/08/the_democrats_and_corruption__perfect_together.html"}
