{"authors":["Tyler Atwood"],"date_download":"2018-10-30 23:52:10","date_modify":"2018-10-30 23:52:10","date_publish":"2014-08-12 22:30:03","description":"It has been nearly a month since Gisele graced the World Cup Trophy ceremony in a Louis Vuitton mini dress and mismatched black and white heels, but the look remains one of my favorite of the summer. The model was charged with presenting FIFA's…","filename":"data/vaneerConsumption/TheDressGiseleWoreToTheWorldCupClosingCeremonyIsPerfectionGetTheLookIn4SimpleSteps.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/7cb0726f-00ec-4576-8805-453a4a3b3a08.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35501-the-dress-gisele-wore-to-the-world-cup-closing-ceremony-is-perfection-get-the-look_1540943530.html","title":"The Dress Gisele Wore To The World Cup Closing Ceremony Is Perfection - Get The Look In 4 Simple Steps","title_page":"The Dress Gisele Wore To The World Cup Closing Ceremony Is Perfection — Get The Look In 4 Simple Steps","title_rss":"NULL","source_domain":"bustle.com","text":"It has been nearly a month since Gisele graced the World Cup Trophy ceremony in a Louis Vuitton mini dress and mismatched black and white heels, but the look remains one of my favorite of the summer. The model was charged with presenting FIFA's trophy to the victorious German national team at the game's closing ceremony, and in true Bundchen spirit, her ensemble simply had to match the Louis Vuitton trophy case. But the outfit was no ordinary bohemian caftan or slinky minidress. Instead, the Brazilian beauty managed to mix patterns, add unexpectedly pared-down menswear accessories, and sneak a dose of metallic glamour into one barely-there look. Quite a feat, indeed.\nWhile the very Louis Vuitton mini Gisele wore to the ceremony is decidedly not in the wallet-friendly price range, the look can easily be replicated for your next elegant outing. Simply pair a breezy, printed mini dress with a metallic woven belt and chunky patterned heels for a look that would make any observer pale with envy. Read on for the four items you'll need to replicate Gisele's chic look. As for that Pantene commercial hair, however, you may require a deep-conditioning treatment and some quality time with a curling iron for Gisele-like luster.\n1. BREEZY PRINTED MINI DRESS\nChannel Gisele's Louis Vuitton look for less with a printed mini dress in a watercolor palette. Keepsake's Real Love Dress pairs an unconventional halter neckline with a sweet print for maximum impact.\n2. METALLIC WOVEN BELT\nMetallic accents add just the right amount of polish to any ensemble. Follow Gisele's lead and cinch your ensemble with a woven silver belt like J. Crew's Metallic Braided Belt to emphasize your waist.\n3. BLACK AND WHITE HEELS\nGisele could have easily let her dress remain the only standout item in her outfit, but the supermodel added yet another eye-catching accent with her black and white patterned heels. Achieve a similar look with Carolinna Espinosa's Allentown Sandals.\n4. CLASSIC WATCH\nAdd a streamlined, classic watch to your wrist for understated glamour like Gisele's. Kate Spade's New York Cooper Grand Black Quilted Leather Strap Watch will add sophistication to your ensemble without overwhelming it.\nImages: giseleofficial/Instagram; Keepsake Real Love Dress, $160, revolveclothing.com; J. Crew Metallic Braided Belt, $40, jcrew.com; Carolinna Espinosa Allentown Sandals, $225, shop.nordstrom.com; Kate Spade New York Cooper Grand Black Quilted Leather Strap Watch, $195, macys.com","url":"https://www.bustle.com/articles/35501-the-dress-gisele-wore-to-the-world-cup-closing-ceremony-is-perfection-get-the-look"}
