{"authors":[],"date_download":"2018-10-22 23:22:40","date_modify":"2018-10-22 23:22:40","date_publish":"2014-07-12 00:00:00","description":"On April 18, 16 Nepalese guides were killed in an avalanche on Mt. Everest. NPR's Tamara Keith talks to Outside Magazine's Grayson Schaffer about the deadliest day in Everest history.","filename":"data/vaneerConsumption/TheDayThatChangedEverythingOnMtEverest.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=330889564_1540250560.html","title":"The Day That Changed Everything On Mt. Everest","title_page":"The Day That Changed Everything On Mt. Everest : NPR","title_rss":"NULL","source_domain":"npr.org","text":"TAMARA KEITH, HOST:\nThis is WEEKEND EDITION from NPR News. I'm Tamara Keith. On April 18 of this year, Mt. Everest was the scene of a great tragedy. Sixteen Nepalese guides were crushed in a tremendous avalanche - others were injured but survived. The Sherpas were ferrying loads through the treacherous Khumbu Icefall when disaster struck. In the aftermath, the entire climbing season was scrapped and serious questions were raised about the ethics of the modern expedition, where well-off Westerners pay to be guided up the mountain by local men who risk their lives for relatively little money. In the August issue of Outside magazine, senior editor Grayson Schaffer's cover story looks at the Everest avalanche and what it has meant for the climbing community - both the Sherpas and the outfitters who depend on them. Grayson Schaffer joins us now from Santa Fe, New Mexico, welcome.\nGRAYSON SCHAFFER: Thanks for having me.\nKEITH: Grayson, take us back to that day. Based on what you've written, it seems like calling it an avalanche is an understatement.\nSCHAFFER: This was a hanging glacier that calved off - you know - a solid slab of ice that we think was probably at least 60,000 tons breaking off and falling through the air. And then just sort of exploding and probably 40 to 60 Sherpas were right in the path of it.\nKEITH: You arrived in Nepal four days after the avalanche and you spent a lot of time in and around the Everest region. Give us a sense of the scope of the tragedy for the people there.\nSCHAFFER: This was one of the things that didn't hit me until I went up to the Khumbu after the avalanche. Sixteen deaths - you know - when you hear news reports, these things can just be like numbers. In the Khumbu - this is a very small community. There are no more than a few thousand people living up in this region. And so a lot of the young men - you know, the strong young men who stay in the Khumbu - many of them work on the mountain. And so very few people in some of these villages were not directly affected by the avalanche. So in some cases you had, you know, a climber named Pemba who lost his father and also his uncle Dorjee. There was a young woman named Dawajengmu (ph) who lost her husband and also her brother who was never found. So in this one Valley you had a situation where there was a monk shortage, where the monks would go to perform these funerals - there were actually not enough of them to go around to all of the funeral ceremonies that needed to happen and the cremations that needed to happen in the immediate aftermath of this avalanche.\nKEITH: And not to be insensitive but - what does it mean financially for so many families who have lost breadwinners?\nSCHAFFER: The median income in Nepal is about $600 a year. You have a lot of these guys on Everest who will make $6,000 in a two-month season and they'll be supporting not only their own families but also their extended families. And so after - you know - in the wake of this avalanche, there were - we counted 28 dependent children who were left fatherless.\nKEITH: And we have to explain that funerals are very expensive there.\nSCHAFFER: One of the age-old problems in the Everest climbing industry is that when Sherpas do die, there is an insurance payment. It's been recently raised up to $11,000. But a lot of that gets gobbled up by these funeral ceremonies. In Buddhist funeral ceremonies are sort of like weddings here, where, you know, there's this feeling like the more you spend, the better the afterlife will be for your loved one. And so a number of these widows who are beset by grief and their families will commit themselves to displays of devotion and distributing gifts on the behalf of the dead.\nKEITH: A lot has been made of the relatively small amount paid to the Sherpas compared to the tens of thousands of dollars clients pay to be guided up the mountain. Is that a fair system?\nSCHAFFER: It's not a fair system. But that's the system that has evolved there. You know, a number of the top-notch Western outfitters actually do a pretty good job of taking care of their Sherpas - of paying them decent wages and of taking care of their families after they die. There's a new crop of local outfitters that is coming up in Kathmandu that is trying to essentially force the Western outfitters out. Now, if they actually succeed, the local outfitters have a much shakier track record of taking care of their workers after tragedies like this.\nKEITH: There was a heated time after the tragedy when the Sherpas were deciding whether or not to quit for the season. And there was a lot of argument and animosity - and ultimately the season was canceled. I wonder where that leaves things when next spring rolls around and a new climbing season on Everest begins.\nSCHAFFER: This is one of the difficult things in Mount Everest, where normally when there's a tragedy, what we've seen anecdotally is that more people actually flock to the mountain. The sort of danger - the chance of being involved in one of these accidents is actually, you know, more of an allure than anything. I mean, I think that if Everest was safe and easy nobody would do it. The idea though that your climb might actually be cut short by political instability and that you might pay all this money and not even get to set foot on the mountain, that may actually dissuade people from trying to climb the mountain.\nKEITH: The title of your article was \"The End Of Everest?\"\nSCHAFFER: I think that this is the end of Everest as we know it. This tragedy is really unprecedented in that it comes at a time when a lot of these younger Sherpas are getting better guiding certifications and are trying to command a bigger piece of the pie. And I think going forward, I don't think they're going to go back to just carrying loads. I think that we've seen a real awakening on the part of some of these younger Sherpas who want to bigger piece of the Everest pie. I think that they will probably continue to take it in the future.\nKEITH: Grayson Schaffer - his cover story about the Everest tragedy appears in the August issue of Outside magazine. Grayson, thank you so much for speaking with us.\nSCHAFFER: Thanks so much for having me.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=330889564"}
