{"authors":[],"date_download":"2018-10-30 00:54:22","date_modify":"2018-10-30 00:54:22","date_publish":"2017-03-06 13:57:59","description":null,"filename":"data/vaneerConsumption/TheDownsideofRaisingtheMinimumWage.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/03/9402829566_4b585c43d4_k.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860862.html","title":"The Downside of Raising the Minimum Wage","title_page":"The Downside of Raising the Minimum WageThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Kelley Uimer closed her independent book shop in Roseville, California after the state raised its minimum wage for the fourth time in ten years. Kelley chose to her pay her workers a wage and compensate them through profit sharing. With each minimum wage increase, however, her shop’s profits shrank. Eventually, her employees took home less pay at $10/hr than they did at $8/hr. Kelley laments: “I can no longer afford to pay the ever-increasing minimum wage.”\nIn Maine, restaurant owner Randy Wadleigh worries the newly enacted $12 minimum wage, which goes into full effect in 2020, will drive prices up and customers on fixed incomes away. “Losing their business on top of higher wages will create the perfect storm for layoffs and other cutbacks as we struggle to make ends meet.” He’s right to worry, as a recent study from the Employment Policies Institute estimates the mandated wage hike will eliminate 3,832 jobs.\nIn February, Pennsylvania Gov. Tom Wolf proposed raising the state’s minimum wage from $7.25 to $12, which would make Pennsylvania’s minimum wage in the highest state-wide wage in the country. (On July 1, 2017, Washington D.C. will raise its minimum wage to $12.50.)\nThe Wolf Administration argues a higher minimum wage will raise $95 million in new revenue by reducing participation in welfare programs and spurring job growth. These assertions are difficult to square with ample evidence showing minimum wage hikes eliminate jobs and harm the economy.\nMinimum Wage Hikes Don’t Help Welfare Participants\nThe Employment Policies Institute found no statistically significant evidence that a higher minimum wage reduces participation in means-tested welfare programs. In fact, modeling shows even more individuals may need programs like subsidized housing, as non-workers are even less likely to find jobs.\nMinimum Wage Hikes Kill Jobs\nThere is little correlation between relatively high minimum wages and job growth across the country, yet an undeniable connection exists between raising the minimum wage and job loss.\nAfter Seattle raised its minimum wage from $9.96 to $11.14, while workers earned more per hour, fewer had jobs, and those with jobs worked fewer hours. Preliminary data from wage hikes in five other major cities as diverse as Chicago, Oakland, and Washington D.C. all indicate significant job loss.\nIn Pennsylvania, studies of minimum wage hike proposals came to the same conclusion. The National Federation of Independent Business analyzed three minimum wage hike proposals and found they could cost the state 46,000 to 119,000 jobs by 2023.Interestingly, even Gov. Wolf seems to acknowledge wage mandates are a burden. His mandated minimum wage increase for government workers last year did not include contracts with the Department of Human Services because, in his words, “we didn’t want to put additional burdens” on human services providers in the midst of the budget impasse.\nMinimum Wage Hikes Don’t Boost Tax Revenue\nA forthcoming Pennsylvania Independent Fiscal Office (IFO) study will shed more light on the specific effects of a $12 minimum wage in Pennsylvania. However, the latest IFO report on a proposed $10.10 minimum wage estimated 31,000 Pennsylvanians would lose their jobs. Individuals without jobs cannot pay personal income taxes. It’s difficult to see how greater unemployment translates into higher revenues from personal income or other business taxes.\nFree-Market Reforms Will Raise Wages and Family Incomes\nIf Gov. Wolf and other policymakers are truly concerned about increasing wages and lifting people out of poverty, they should pursue the following proven reforms:","url":"https://spectator.org/the-downside-of-raising-the-minimum-wage/"}
