{"authors":[],"date_download":"2018-10-30 01:11:55","date_modify":"2018-10-30 01:11:55","date_publish":"2018-08-13 00:32:55","description":null,"filename":"data/vaneerConsumption/TheDemocraticPartysAltLeft.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Summer-Lee-Sara-Innamorato.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861915.html","title":"The Democratic Party’s Alt-Left","title_page":"The Democratic Party’s Alt-LeftThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Liberal reporters sprinted to the nation’s capital with their cameras this weekend in desperate hopes of capturing an “alt-right” uprising. The larger the smattering of white nationalists, the better for smearing Republicans and the Trump administration.\nAlas, they were disappointed.\n“Approximately two dozen white nationalists rallied in the nation’s capital on Sunday, one year after clashes in Charlottesville, Virginia,” lamented CNN. “The showing from ‘Unite the Right 2’ participants fell far short of the hundreds that organizer Jason Kessler was expecting.”\nThe liberal media didn’t get the “alt-right” fireworks it wanted. But in the meantime, liberals face an alt-left uprising within their beloved Democratic Party, and it doesn’t seem to disappoint them one bit.\nForget about two dozen angry white nationalists in Washington. They literally couldn’t fill two 15-passenger Ford vans. But how about the 40,000-plus members of the Democratic Socialists of America, the self-proclaimed largest socialist organization in the country? Not only is the DSA boasting a surge in membership under a Trump presidency, but it’s running candidates across the nation on the Democratic Party ticket. Traditional Democrats are losing in primaries to DSA “democratic socialists” running as Democrats.\nThe Democratic Party has an alt-left problem, and no one at CNN seems to care.\nThe DSA has been aggressively pushing its members to run as Democrats, and they’re winning. Here are three that embody what’s going on: Alexandria Ocasio-Cortez, Summer Lee, and Sara Innamorato.\nAlexandria Ocasio-Cortez is, of course, the poster-girl for the new zeitgeist. That unclean spirit is the wind of “democratic socialism,” which is the rage among the Trump “resistance.” But Ocasio-Cortez isn’t the only young woman scoring big in the Democratic Party for the DSA. Two others are here in my backyard of Western Pennsylvania, Summer Lee and Sara Innamorato, who defeated longtime state reps Paul and Dom Costa. The Costas (they are cousins) were classic Western Pennsylvania Democrats, expected to hold their seats for life, until they were beat soundly in May in the primary by Lee and Innamorato, both of which now run unopposed in the general election and will glide into the state house as elected socialists. Well, actually, as “democratic socialists” who ran as Democrats.\nHere are three “young progressive women,” as an excited New York Times describes them, that are on the march.\nLee and Innamorato, like Ocasio-Cortez, were openly backed by the DSA, and did not run from that endorsement. Quite the contrary. Both are members of the Pittsburgh chapter of the DSA.\n“I hope [the primary election] emboldens some secret progressives in elected office,” says Innamorato. “I hope they stop thinking, ‘I will get voted out if I don’t vote for this abortion ban.’ They can’t use that excuse any more. [The election] says that this is possible, you can run on progressive platforms, you can be a DSA member.”\nThe DSA certainly doesn’t dodge the socialist label, even as it lamely tries to spoon the collectivist gruel in a more palatable way to oblivious Millennials: “We believe that the workers and consumers who are affected by economic institutions should own and control them.”\nIt’s the same old slop, even as the DSA “constitution” tries to dress up the standard socialist boilerplate, calling for (to note just one example) a “humane social order based on popular control of resources and production, economic planning, equitable distribution, feminism, racial equality and non-oppressive relationships.”\nA sprinkling of economic socialism here, some classical Marxism there, and a little cultural Marxism, too.\nSure, guys. Go for it.\nEven then, what the likes of Ocasio-Cortez and Lee and Innamorato and their advocates don’t understand is that they’re not the first “democratic socialists” or “socialist democrats.” Plenty of hardcore communists shared the label. Take the troika of Vladimir Lenin, Leon Trotsky, and Joseph Stalin: Their Soviet Communist Party was originally the Russian Social Democratic Party, also known as (or variously called or translated as) the Russian Social Democratic Labour Party or the Russian Social Democratic Workers’ Party. A key name change came in 1903, at the 2nd Congress of the Russian Social Democratic Labor Party, starting in Brussels and ending in London, where Lenin seized the name “Bolsheviks” (meaning “Majority”) for his faction, whereas his opponents became the “Mensheviks” (or “Minority”).\nThey weren’t the only pioneering “social democrats” or “democratic socialists.” Consider Herbert Marcuse, the godfather of cultural Marxism, which today is prevalent in our universities under the deceptive label of “critical theory.” Marcuse first considered himself a “democratic socialist.” He was the most popular theorist of the Frankfurt School and became a guru to the 1960s New Left. The Weather Underground cadre read and loved Marcuse, as did America’s most famous female comrade, Angela Davis, who considered Marcuse her mentor. As readers here know, Davis in January 2017 held forth before a sea of clueless girls in pink hats fashioned after their genitalia at the Women’s March in Washington. There, comrade Angela spoke not of Marx and Lenin and Trotsky (she’s not stupid), but of gay rights, immigrant rights, the rights of flora and fauna, and on and on, while the ignorant young ladies screamed their approval.\nOh, and comrade Angela is well-known to Trump nemesis John Brennan: Brennan, Obama’s CIA director, voted for the Communist Party USA presidential ticket of Gus Hall and Angela Davis.\nOf course, this unsavory history is likely unknown to Alexandria Ocasio-Cortez, who was born in October 1989, as the Berlin Wall was about to fall. Alexandria was nursing at her mother’s breast as the wall was being pick-axed by jubilant East Berliners. As for Summer Lee and Sara Innamorato, they were toddlers in bouncer-seats. None of them remember the wonders of what Brezhnev and boys hailed as “real socialism” in their delightful Communist Bloc, and their government schools and lousy colleges surely taught them nothing of it.\nIf told that history now, Ocasio-Cortez and Lee and Innamorato might object that they’re a happier brand of “democratic socialist,” perhaps more along the lines of what Hugo Chavez once hailed as “21st century socialism.” Of course, when one examines the actual results, “21st century socialism” smells a lot like 20th century communism. The lines and shortages and lack of deodorant and toilet paper are just as bad in Venezuela in 2018 as they were in Czechoslovakia in 1968.\nNonetheless, this “democratic socialist” bunkum is having success in America today, especially among Millennials brainwashed by their universities. And most striking, it’s making headway within one of this nation’s two dominant political parties.\nIt is apparently a new day for the Democratic Party. Maybe Nancy Pelosi and Maxine Waters and friends can take a page from the old troika of Lenin and Trotsky and Stalin, a page from the new troika of Ocasio-Cortez and Lee and Innamorato, and do a name change. Maybe the “Democratic Party” could become the “Democratic Socialist Party.”\nThese three women seem game for that. “My name is Sara Innamorato,” says one of the new troika at her campaign website. “I am a Democrat.”\nYes, and she’s a Democratic Socialist.\nIs there really much of a difference nowadays?","url":"https://spectator.org/the-democratic-partys-alt-left/"}
