{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 21:49:30","date_modify":"2018-10-30 21:49:30","date_publish":"2016-12-17 00:00:00","description":"The Dodge Challenger GT AWD goes on sale in early 2017.","filename":"data/vaneerConsumption/TheDodgeChallengermusclecarnowhasallwheeldrive.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_dodge-all-wheel-drive-challenger-muscle-car-2016-12_1540936170.html","title":"The Dodge Challenger muscle car now has all-wheel-drive","title_page":"    The Dodge Challenger muscle car now has all-wheel-drive - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Dodge Challenger GT AWD. Dodge When it comes to driving through the snowy Alaskan winter, an American muscle car is probably not your ideal vehicle.\nBut that's exactly what Dodge is doing in its latest ad.\nHere's why.\nFor 2017, Dodge will make all-wheel-drive available on its Challenger GT muscle car.\nAccording to Fiat Chrysler executive Tim Kuniskis, this is \"the world's first and only all-wheel-drive American muscle coupe.\"\nYes. It's finally happened — a modern muscle car you can't do a burnout in. With that said, in an era of four-cylinder Camaros and Mustangs, an AWD Challenger doesn't sound so outlandish.\nEven though it may offend the muscle car purists, an all-wheel-drive Challenger makes a fair amount of sense. The availability of AWD gives Dodge the ability to offer a product more suitable for cold-weather markets where a rear-wheel-drive muscle car simply doesn't work as a winter daily driver.\nUnder normal conditions, the AWD system sends power only to the rear wheels — which means it'll drive like any other Challenger in most instances. However, when the car senses the rear wheels lose traction, the front axle engages — turning the Challenger into an AWD vehicle.\nDodge Currently, Dodge will offer AWD only with its award-winning 3.6 liter, 305 horsepower Pentastar V6 engine and an 8-speed automatic transmission. There's no word if Dodge will offer the option with its more potent V8 powertrains.\nThe Dodge Challenger GT V6 AWD arrives in showrooms early next year with a based price of $33,395.\nHere's Dodge's new-Alaska-centric commercial:","url":"https://www.businessinsider.com/dodge-all-wheel-drive-challenger-muscle-car-2016-12"}
