{"authors":[],"date_download":"2018-10-30 01:09:48","date_modify":"2018-10-30 01:09:48","date_publish":"2014-07-16 08:00:00","description":null,"filename":"data/vaneerConsumption/TheDnieperandtheLethe.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/07/Archip_Iwanowitsch_Kuindshi_001.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861788.html","title":"The Dnieper and the Lethe","title_page":"The Dnieper and the LetheThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The silver thread of the Dnieper stitches a winding seam through the fabric of the Ukrainian steppes, binding together a variegated national patchwork. Its dark-rolling waters “pierce the stone hills,” as the ancient Tale of Igor puts it, irrigating Ukraine’s countryside while nourishing its spirit. So central was this river to the medieval castellans of Kyiv that their territory was properly known as Poddnieprska Ukraina, or Dnieper Ukraine, and so significant was this river to the serf-born Romantic writer Taras Shevchenko that he asked to be buried on its dark shore,\nIn a place from where the wide-tilled fields\nAnd the Dnieper and its steep banks\nCan be seen and\nIts roaring rapids heard\nWhen it carries off\nThe enemy’s blood from Ukraine\nTo the deep blue sea.\nThis, Europe’s third largest river, would become the very embodiment of a nation caught between powerful geopolitical forces.\n“How many thoughts,” mused the Lviv-based geographer Stepan Rudnytsky in 1910, “arise about the glorious, and yet so unspeakably sad, past of the Ukraine, about its miserable present and the great future toward which the nation tends, amid great difficulties, as does the Dnieper toward the Black Sea over the porohs [cataracts].” It is telling indeed that neither of these writers could avoid the specters of bloodshed and strife—for what binds can also tear asunder.\nIt was during The Ruin—a chaotic period of intestine conflict and foreign intervention that lasted between 1657 and 1687—that Ukraine was rent in two from top to bottom. This produced two polities named for their relation to the southward-running Dnieper: In the east, the Left Bank; in the west, the Right Bank. This disastrous partition gave rise to such ignoble figures as the Hetman Ivan Briukhovetsky, a strongman whose slavish devotion to Moscow foreshadowed that of Viktor Yanukovych vis-à-vis Vladimir Putin. Describing himself in cringe-worthy fashion as “the most servile Hetman-footstool of the throne of His Most Noble Tsarist majesty,” Briukhovetsky entered into a particularly one-sided treaty with the tsar, only for a Cossack mob in the town of Budyshchi to seize him, lash him to a cannon, and cudgel him to death, a trenchant political morality play if there ever was one.\nSuch dramatic reassertions of Cossack self-respect notwithstanding, Ukraine’s territorial fragmentation continued apace, and the “ancient rights and privileges” of Left Bank Ukrainians recognized by the Kremlin in the 1654 Pereiaslav Treaty would give way to direct control from Moscow. Successive tsarist governments would funnel Ukrainian exports toward the empire’s northern emporia, and away from traditional markets like Wroclaw and Gdansk in order, as historian Mykhailo Hrushevsky later lamented, “to ruin Ukraine’s trade in general, hand it over to Muscovite merchants, and bind Ukraine economically to the northern centers of Great Russia, St. Petersburg, and Moscow.”\nOn the Right Bank, to complicate matters further, the influence of the Polish gentry held sway for centuries to come, even after the end of the Polish-Lithuanian Commonwealth and the several partitions of Poland, making for a Ukraine that served not as the hoped-for bridge between east and west, but rather as the front line of civilizations.\nThe long-term ramifications of this historical divide are profound. In the 2010 presidential elections, for instance, the western Ukrainian cities of Lviv and Ivano-Frankivsk provided the Europhile candidate Yulia Tymoshenko with 86.2 percent and 88.8 percent of their votes, respectively, while the Russophile Viktor Yanukovych garnered 90.4 percent of the votes in the eastern city of Donetsk. Such numbers put into perspective the partisan divides between, say, California and Texas, or Kensington and Newcastle.\nThe notion of geography as destiny has always had a certain amount of purchase in a region that, from time immemorial, has been cast as sort of informem terris, wholly lacking in obvious natural frontiers.\nHamstrung by the partitions of the past, and unable to capitalize on the valuable north-south axis of the Dnieper while priorities and threats were arrayed to the east and west, Ukrainians found themselves in a geopolitical bind only partly of their own making. But rather than wrangle with modern divisions and Mitteleuropean contradictions, it was far easier for public intellectuals to befuddle themselves creating mythical roots for the Ukrainian nation—like the claims of one author that Ukrainian anscestors are mentioned in the Bible as the Magog, “who through the ages, fought to the death in battle against the rapacious Gogs of the steppe, and shielded Western (Christian) civilization from fatal inroads and invasions.”\nHence the firm insistence on the part of the geographer Rudnytsky and likeminded thinkers that the “autonomy of Ukraine must be put forward so forcefully and defended so skillfully against any encroachment by Moscow centralists that Ukraine might profit from its advantageous geographical position rather than lose by it.” Servitude, however, is precisely what the Kremlin expects from a purported vassal state, though Vladimir Putin has gone even further by saying on record that “Ukraine is not even a state.…Part of its territories is Eastern Europe, but the greater part is a gift from us.” Yet attempts made during The Ruin, and during the national liberation struggle between 1917 and 1920, to counter Russian influence with Polish, Turkish, Tatar, Austrian, or German alliances, invariably went awry.\nThe politician Vyacheslav Lypynsky sadly concluded, in his 1926 Letters to Brother Farmers, that\nat present no one in Europe wants a strong and great Ukrainian State. On the contrary, there are many forces which are in fact interested in there being no Ukraine or that it be as weak as possible. This is why in restoring our traditions of nation, statehood, and Hetmanate we must not pin our hopes on receiving help because of our orientation but, on the contrary, we should anticipate that various outside forces will hinder us in this as much as possible.\nThat is as neat an encapsulation of Ukrainian historical pessimism as one is likely to find. The slogan “seeking a third way” began to be bandied about by narodnyky, or “nativists,” which the scholar Ola Hnatiuk correctly perceived to constitute “a retreat from European identity” and “a path towards isolation, which would allow Ukraine to be pushed back towards authoritarianism,” and necessarily towards Russia’s vise-like embrace.\nThe pro-western Ukrainian revolutions of 2004 and 2014 constitute the equal and opposite reaction to that line of reasoning. In a stirring December, 2004, address to the European Parliament in Strasbourg, writer Yuri Andrukhovych summed up the position of the Europhile camp by denouncing the “quarantine line that divides one Europe from the other,” while insisting “that Europe is waiting for us, that it can not endure without us, that Europe will not continue to be in all its fullness without Ukraine.” Andrukhovych’s speech reached its crescendo with a poetic defense of his country’s European geography: “in Ukraine there is not a single drop of water that does not belong to the Atlantic basin. This means that with all its arteries and capillaries it is stitched right to Europe.” Just as the water of the Dnieper spills out into the Black Sea, making its way via the Mediterranean to the Atlantic, Andrukhovych predicted, so will the Ukrainian nation follow its natural inclination westward, away from the “scare tactics, physical threats, moral torture” endemic to the east.\nSome might take issue with the rather grandiose claim that Europe cannot endure without Ukraine, but the European Union has long had designs on it. Brussels funneled some €389 million to Ukraine between 2011 and 2013 alone, and distributions were made to a host of civil society NGOs, such as the All-Crimean Association of Voters for Civil Peace and Interethnic Harmony. The 2014 protests, touched off by Yanukovych’s rejection of a European Union association deal, constitute the natural and immediate consequence of groundwork undertaken in Brussels, much to the Kremlin’s chagrin.\nTo extend the overall poetic conceit further, it could be argued that just as the Dnieper is central to Kyiv, so too does the European Union have its river: the Lethe, one of the five rivers of Hades, whose waters bore away strife in a stream of blessed forgetfulness. Oblivion, of all things, was given a central place the political life of the earliest democracy. It was a “good policy,” wrote Plutarch, “to rob hatred of its perpetuity,” and after episodes of upheaval it was not uncommon for the Greeks to swear solemn oaths “not to recall the misfortunes of the past.” Crippling fines for “recalling public evils” could even be levied on those chroniclers immune to Lethe’s charms. It mattered little that lethe is the linguistic negation of aletheia, or “truth.” Oblivion’s political utility was undeniable, and not just to the Hellenes.\nSimilar acts of forgetfulness are to be found throughout the subsequent course of western European history. The Edict of Nantes, which granted French protestsants religious protection in 1598, declared that domestic troubles were to be “obliterated and forgotten, as if no such things had happened.” The Peace of Westphalia ending the Thirty Years War insisted on “perpetual oblivion and amnesty.” Closer to our present era, in the immediate aftermath of the Second World War, Winston Churchill called for an “act of oblivion against all the crimes and follies of the past,” the better to pave the way for a European post-war renaissance.\nIt is hardly surprising that European regimes across the spectrum of time and space would express this sort of sentiment about the inconvenient past. But they have perfected it in the modern age, with the grandest act of political damnatio memoriae of all, the present incarnation of the European Union. While the Treaty of Lisbon pays lip service to the “cultural, religious and humanist inheritance of Europe,” it is in fact an act of historical oblivion writ improbably large, one that occasionally crosses the collective psychological border between paramnesia and outright amnesia.\nFor Jean Monnet, the architect of European integration, “Europe has never existed. It is not the addition of sovereign nations met together in councils that makes an entity of them. We must genuinely create Europe; it must become manifest to itself.” It was with considerable clarity that Harold Macmillan described Monnet’s plan as “not just a piece of convenient machinery,” but rather “a revolutionary and almost mystical conception.”\nThe end of the Cold War only seemed to vindicate this bold attempt to put paid to the traditional European nation-state. Commentators aligned events with the prophetic “end” of history and the triumph of liberal democracy. Yet, as we know, the great wheel of history had not actually ground to a halt. “For whilst the ‘end of history’ theorists could chatter about the triumph of liberalism,” the jurist Ian Ward wrote, “the European Union peered anxiously across its south-eastern border, and watched in horror as its neighbours set about slaughtering one another. This was not supposed to happen.” It was made readily apparent that the forms of the past could not so easily be cast off, or the command to forget so easily heeded. None of which would take away from just how comforting the thought of an escape from history could be.\nIn the years since the Balkan slaughter, the European Union’s eastern and southeastern borders still crept steadily forward, encompassing former Warsaw Pact states and the once unlikely accession candidates of Romania and Bulgaria. Even Serbia, once utterly non grata, became a European Union “associated state” on September 1, 2013, while of course Ukrainian western ambitions have touched off a crisis more or less unprecedented in recent European affairs. The imposition of a Brussels-imposed acquis communautaire was expected to uproot the firmly ensconced antagonisms of the various states that lie to the east. Ukrainian westernizers like Yuri Andrukhovych may be forgiven for hoping that the historical juncture had at last arrived at which Time would no longer represent a violent torrent, but something rather gentler. Yet Russia in particular remains a tense, as opposed to relaxed, society, according to scholar Ewa Thompson, where “memories are still grievances calling for action against the Other, rather than being signals to commemorate the events of the past.” Life in the public square of such a society can, particularly for those of a more liberal bent, be utterly taxing. Ukraine has historically partaken of this cultural tendency, no doubt, but its liberal and Europhile elements are increasingly attracted to the alternative. And yet an existential threat still looms from the east, and as European Union policymakers like Jean-Claude Juncker and Carl Bildt find themselves warning anyone who will listen that the “old debate between peace and war in Europe is not behind us” and that a “dangerous landscape” has been created by an “openly revisionist Russia.” It is unsurprising, then, that the European Union flags that graced Independence Square during the dramatic protests of last winter have quickly given way to national flags and nationalist rhetoric.\n“God knows what is the final destination,” admitted Ukrainian Prime Minister Arseny Yatsenyuk in a March press conference following the signing of the political chapters of the European Union-Ukraine Association Agreement, while declaring, in reference to the tension between economic and humanitarian interests, that “it’s up for everyone to decide: do we share value, or do we share values.” Yatsenyuk and his fellow westernizers may not appreciate the equivocations and tergiversation they have been, and will continue to be, met with by their tentative western allies. The authorities in Kyiv, led by president-elect Petro Poroshenko, cannot simply pin their hopes on receiving much-needed assistance solely due to their current westward orientation, even as they grapple with a proto-insurgency in the east, one which has involved bloody “anti-terrorist” operations at the Donetsk airport, and with the downing of a Ukrainian helicopter gunship over Slavyansk by a suspiciously sophisticated surface-to-air missile.\nThere has always been something comforting, at least, in the equation of the Dnieper with the Ukrainian state, in the permanency and predeterminacy of the river, in its succor and its centrality, though there has always been something equally disconcerting in the hazards of its cataracts, and its capacity to separate a land and its people. Two lieux de mémoire situated along the banks of the river—Taras Hill and Mezhyhirya—provide a poignant illustration of this dichotomy. “No one,” the geographer Rudnytsky would later posit, “is able to repeat the impressions which fill the soul of every Ukrainian when he looks down from this beautiful observation point of Shevchenko’s grave upon the majestic river below.” It was also along the Dnieper that the deposed Yanukovych built his secret estate at Mezhyhirya, that obscene monument to malfeasance and appalling taste, with its €8-million chandeliers, its personal zoo, and its floating banquet halls—a site that has been transformed into a decidedly instructive “museum of corruption.”\nFrom that grave on Taras Hill, the journey upriver to Mezhyhirya—a world away—is less than a hundred miles. The Dnieper, once again, offers an invaluable lesson to Ukrainians and outside observers alike. For just as Ukraine is obliged to straddle east and west, it is obliged to balance the need to remember with the need to forget, the need to maintain what Yuri Andrukhovych called the Ukrainian “Book of Memory tens of thousands of pages long” with the need to repudiate and reconcile the worst elements of that very same book. And all the while, the Dnieper dependably discharges its flow down toward the Black Sea, half the time tranquil, and half the time in spate.","url":"https://spectator.org/59565_dnieper-and-lethe/"}
