{"authors":[],"date_download":"2018-10-30 00:51:04","date_modify":"2018-10-30 00:51:04","date_publish":"2018-07-23 00:05:09","description":null,"filename":"data/vaneerConsumption/TheDarkSideofAmazon.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/Jeff_Bezos_and_Ash_Carter.jpeg.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860664.html","title":"The Dark Side of Amazon","title_page":"The Dark Side of AmazonThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Luke Skywalker was tempted by the Dark Side — but didn’t give in to it. Elon Musk and Jeff Bezos did.\nBoth began as promising free market Jedi — but have become Sith Lords of crony capitalism.\nMusk went from earning an honest living as one of the founders of PayPal, which made buying things online much easier and so facilitated the rise of online commerce — which in turn made buying things online cheaper.\nBut then he gave himself to the Dark Side as the founder of Tesla Motors — which hasn’t earned an honest dollar since it came into being 15 years ago. Every car it “sells” it actually gives away at a loss of thousands of dollars per car — and every car it has ever built exists only because of government subsidies and electric car production quotas.\nBezos became a Sith in similar fashion.\nAmazon started out as an online bookseller that grew into the retail outlet for everything online. As such, it embodied the free exchange of goods and services.\nBezos — like Musk — became extremely wealthy. And deserved it.\nBut money earned through the free exchange of goods and services apparently wasn’t enough for either of them. Power — through connections in DC — was the irresistible temptation that led to the Dark Side.\nAmazon — like Tesla — is becoming a crony capitalist operation that depends on government more than the free market. But the scale of Amazon’s rent-seeking dwarfs anything Tesla has managed so far.\nFor example, Amazon Web Services is on the verge of landing a ten-year Department of Defense contract for Cloud Storage of government data worth $10 billion.\nTo put that in perspective, Tesla has only lost about $5 billion so far — over the past 15 years.\nThe DoD contract is also “winner take all,” which would mean that all the Pentagon’s cloud-stored data would be under Amazon’s control — and on the taxpayers’ nickel.\nLots of nickels.\nAccording to an investigative report in the Wall Street Journal, Bezos has a lobbying operation in DC that’s bigger and better-funded than Walmart and Exxon Mobil. He has 100 full time lobbyists beating the bushes on behalf of Amazon and spent some $13 million on glad-handing the government last year alone — a five-fold increase over what it spent on lobbying circa 2013.\nThis investment has paid off handsomely.\nAmazon’s cloud server business already generates $1.5 billion in revenue from existing government contracts, including data storage for the Smithsonian and the CIA. Perhaps coincidentally, some of these contracts were awarded during the Obama years — and after the Obama campaign contracted with Amazon Cloud Services to handle its IT needs, reportedly for a favorable price.\nBezos thus earned the friendship — or at least, the ear — of the man who became president, which gave his company an edge when it came to securing favorable consideration for government contracts while that man (and friend) was the president.\nBut the currently pending DoD contract is worth more than nine times as much as the previous deals. And it would add an estimated 50,000 workers to Amazon’s payroll, who would essentially be government workers — since those workers would be working mostly if not exclusively on government-contracted business.\nAmazon would become — is already well on the way to becoming — just another Swamp Thing.\nNot surprisingly, Bezos is actively looking into relocating Amazon’s government-related operations to the Swamp. Three locations inside the Beltway are under consideration. Once relocated, this Dark Side Amazon Swamp Thing will have every incentive to lobby even harder for more government money.\nIn time, Amazon could easily become a mostly government-dependent operation.\nBut that pendulum swings both ways — and it’s one of the other ways that this DoD deal is a bad deal.\nA potentially dangerous deal.\nThe DoD’s data is not just any old data. It is sensitive data. Classified data. And if Amazon’s cloud storage business becomes the only business handling this sensitive data, it means that all the data could be hacked and compromised instead of just some of it.\nThe recent hack of one of the three major credit reporting agencies — Equifax — provides a cautionary example. Millions of peoples’ data was compromised — but not everyone’s— because Equifax isn’t the only credit reporting agency. The other two major players — TransUnion and Experian — weren’t hacked. Their data remained secure.\nThe fact that all the data wasn’t in one place — and accessible in one place — acted as a firewall.\nIf Amazon Cloud Services becomes the cloud storage for DoD data, it will mean all-in-one-place vulnerability of sensitive government data. And that data would be stored on cloud servers that apparently use the same or very similar software that Amazon has already sold to its Chinese partner, Beijing Sinnet Technology — in order to comply with Chinese law which forbids foreign companies operating in China from keeping such technology to themselves.\nThat ought to raise some red flags, all by itself.\nThe no-bid deal will also mean a government-issued Amazon Cloud Services monopoly for the next ten years — which is the antithesis of the free market competition Amazon used to champion but now seems determined to quash for the sake of padding its bottom line and “partnering” with the government.\nIt’s a shame to see Bezos — like Musk before him — give in to the Dark side.","url":"https://spectator.org/the-dark-side-of-amazon/"}
