{"authors":["Pamela J. Hobart"],"date_download":"2018-10-30 23:47:22","date_modify":"2018-10-30 23:47:22","date_publish":"2014-08-13 11:30:04","description":"Sex dolls are often thought of as punchlines to jokes about losers, but I'm here to remind you that they're a real thing that people really buy. As reported by EliteDaily, sex doll technology has recently reached its apex, and with a sex doll this…","filename":"data/vaneerConsumption/TheDutchWifeSexDollIsSoRealisticWhoNeedsAGirlfriend.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/5c90be21-58e3-4c35-bdfb-3c179f043b78.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35527-the-dutch-wife-sex-doll-is-so-realistic-who-needs-a-girlfriend_1540943242.html","title":"The \"Dutch Wife\" Sex Doll Is So Realistic, Who Needs A Girlfriend?","title_page":"The \"Dutch Wife\" Sex Doll Is So Realistic, Who Needs A Girlfriend?","title_rss":"NULL","source_domain":"bustle.com","text":"Sex dolls are often thought of as punchlines to jokes about losers, but I'm here to remind you that they're a real thing that people really buy. As reported by EliteDaily, sex doll technology has recently reached its apex, and with a sex doll this realistic, who needs girlfriends? Called the Dutch Wife, she is actually Japanese, and she costs a mere $1,700. But hey, a man could blow that in a few weeks or months on dates, when on the other hand the Dutch Wife is the sexual gift to yourself that just keeps on giving.\nThe Dutch Wife has lifelike skin, \"authentic-looking\" eyes, and posable joints which allegedly represent marked improvements over the crude sex dolls of yore. She can be ordered to one's specifications (e.g., bust size) and comes with a variety of clothing to spare her owner the indignities of shopping. I will assume that the Dutch Wife's skin and various orifices are fully washable.\nOne the one hand, far be it from me to criticize someone for the sex toys they use privately in the comfort of their own home. Women joke about \"battery-operated boyfriends,\" but what a real boyfriend lacks in buzzing power he (hopefully) makes up for in the emotional support department. However, I do slightly worry that if sex toys, and sex dolls, become too lifelike and realistic, that they will actually start to compete for the romantic and sexual energy of their owners — energy that would be best put toward more human ends.\nThat being said, if history's any guide, people are always looking for new sexual outlets and also then worrying about the ones that arise. We, the girlfriends of the world, probably don't have to worry about ending up forever alone until ultra-realistic sex dolls drop in price to like $50. I just hope the men who do opt for the Dutch Wife realize that she isn't actually going to serve them drinks.\nImages: Courtesy of the DailyMail","url":"https://www.bustle.com/articles/35527-the-dutch-wife-sex-doll-is-so-realistic-who-needs-a-girlfriend"}
