{"authors":["Julie Cart","Guest Commentary"],"date_download":"2018-10-30 22:54:03","date_modify":"2018-10-30 22:54:03","date_publish":"2016-10-06 08:00:00","description":"The state’s electric-car adventure got off to a shaky start. Here's the problem.","filename":"data/vaneerConsumption/TheElectricHighwayWhyCaliforniaissputteringalong.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/ElectricCarFeaturedImagine_5GTQF0Y-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940043.html","title":"The Electric Highway: Why California is sputtering along","title_page":"The Electric Highway: Why California is sputtering along | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The day Brian Feeney walked into a Palm Springs dealership to buy a new Nissan Leaf, he was fulfilling the dream of state policymakers to entice Californians to break off their love affair with gas-guzzling cars. But the amount of meticulous research that went into Feeney’s purchase was identical to the amount of carbon emissions his all-electric Leaf would spew into the atmosphere: zero.\nThe previous week, he had gotten into an accident, needed a rental, asked for something fun to drive and was issued an electric car. A few days behind the wheel convinced him to buy one. Now here he was, being handed the keys to a shiny new object—not to mention one that promised to make the planet better.\nSo, the salesman asked, how are you planning to get it home? Feeney blinked. His Pasadena house was more than 100 miles away—beyond the Leaf’s battery range.\nIn the end, his fun new car was delivered to his home hitched to the back of a tow truck.\nThe story is an apt metaphor for California’s similarly impulsive embrace of zero emission vehicles—and the logistical challenges of figuring out how to get from point of origin to ultimate destination. Like Feeney, the state knew little about the market for electric vehicles before mandating a widespread and expensive transportation reboot designed to dramatically cut tailpipe emissions. And, like Feeney’s foray, the state’s electric-car adventure has gotten off to a shaky start.\nNow, a half-dozen years into Gov. Jerry Brown’s futuristic vision of carbon-free transportation, California is encountering even more potholes along the electric highway—obstacles born from both practicalities and politics. Consumers, put off by high costs and concerned about limited range, just aren’t buying into the state’s ambitious aims. As a market share, hybrid electric and fully electric cars have been stuck at only 3 percent of new cars sold in the state. Undaunted, the state intends that by 2025, just nine years from now, zero-emission cars will make up 15 percent of California’s new car fleet—a five-fold increase.\nExactly how this will happen is anybody’s guess. The state is relying on the requirements it’s placed on carmakers to get us there. The industry’s response: We can make the cars, but we can’t make people buy them. And car buyers? At the moment most of them prefer bigger fuel-slurping cars—especially with gasoline relatively cheap—and they’re put off by the larger price tags and smaller driving range of electric cars.\nThe state of California has exercised its own policymaking power to help overcome these practical problems: issuing financial incentives for the purchase of low-emission cars, encouraging entrepreneurs and utilities to build out a network of convenient charging stations and rewarding carmakers for filling the market. But even as agencies have set to work fulfilling those goals, political support from the Legislature has been erratic.\nAt this point, it’s not clear that the state will meet either the legal mandates or the goals it has set. While more electric cars are sold every day, a study conducted for the Natural Resources Defense Council estimates that the state will meet only half the goal, or 6 percent of all new vehicles emission-free by 2025, unless vital changes are made.\nVia a 2012 Executive Order, Brown called for 1.5 million zero-emission vehicles in operation statewide by 2025. That number today: about 220,000.\nThe governor’s order also set a target that by 2050, “virtually all personal transportation in the state will be based on zero-emission vehicles.”\n“We are way behind, we are really way behind,” said Michael Schneider, chief environmental officer at San Diego Gas & Electric. “We’ve all got to work to move that forward.\nCalifornia new car sales:\nOn the optimistic side, more than half of the nation’s stock of battery electric, plug-in hybrid and hydrogen vehicles are sold in California. And more than two dozen different low-emission vehicle models are for sale in California, with more on the way.\nBut other signs say the momentum behind electric cars is slowing. The Legislature took until the last week of its session before finally opting to top up the funds in the state’s low-emissions vehicle rebate program. It also failed to approve a bill that would have codified the electric-vehicle goals as laws.\nThe maneuvering revealed a split among the Democrats who dominate the Legislature, with environmentalist coastal lawmakers running up against resistance from moderate Democrats representing poorer districts. Many of those lawmakers have received major campaign contributions from the oil industry. The pushback, which framed the debate around environmental-justice issues, led lawmakers to agree to specific spending to make zero-emission cars and charging stations more accessible for low-income communities.\nIt may not be enough.\n“Our trajectory for 2025 is OK,” state Air Resources Board commissioner Hector de la Torre told a group discussing the program in Sacramento in August. “After 2025 is where we are not doing so great. There’s an order of magnitude to go beyond.”\nFor environmentalists and certainly for Brown, climate change is an ‘existential threat’ and one way to attack it is remove carbon from transportation, responsible for about half the state’s harmful greenhouse-gas emissions.\n“The effort to decarbonize our economy is extremely difficult,” Brown said recently. “It’s a tall hill that we’re climbing, and there is opposition. Bring it on.”\nThe price of reaching zero:\nConsumers often like the idea of buying an electric car, at least in theory. Just imagine never buying gas again and maintenance costs about half that of a gas-powered car.\nThen there’s the lifestyle pitch: Help clear the air while driving a cool, tech-centric vehicle. And, for those angling for a life hack: Access to the carpool lane as a single driver and, often, preferential parking spaces with free charging at some locations.\nBut purchasing still-emerging technology comes at a steep price that has proved to be a barrier to more widespread adoption.\nAs with gas-powered cars, low-emission vehicles come in all shapes and sizes, but have one commonality: They cost more. A Nissan Leaf runs about $30,000, a Chevrolet Volt about $35,000, depending on options. That makes mid-sized electrics $5,000-$10,000 more dear than comparable gasoline models. Tesla’s boutique models are in the “if you have to ask…” category, topping out at more than $137,000.\n“Costs do play into it; we have a burden on our shoulders to ensure the polices have a certain level of reasonableness,” said Joshua Cunningham, chief of sustainable transportation technology at the state’s air board.\nAlthough seven other states have joined California in establishing similar programs to juice sales of zero-emission cars, the state has lagged in expanding ownership much beyond wealthier coastal areas, where clean-car adoption is highest. Research shows that higher-income neighborhoods are buying these cars at ten times the rate of lower-income areas—and that gap is widening.\nThe result: The poor and middle class can’t afford entry to the electric-highway onramp.\nWhat’s the break-even point if you buy an electric car? The U.S. Energy Department offers an online Vehicle Cost Calculator that allows consumers to enter details about their driving needs and compare the costs of electric cars and hybrids to traditional gas-gulpers. The above sample shows that an owner would come out ahead economically only after eight years. To enter your own preferences, visit the federal calculator site.\nGetting zero-emission cars into garages in disadvantaged communities is enlightened self-interest for the state as a whole: Lower-income Californians tend to live in areas with the worst air quality, are more likely to have longer commutes and to do so in older, more polluting cars. “If you are being realistic about meeting these targets, you need to target communities of color,” said Joel Espino, an attorney with the Greenlining Institute.\nOfficials are working on it. Need-based programs in parts of Los Angeles and the San Joaquin Valley provide rebates and low-interest loans—as much as $13,500—to allow low-income drivers to buy low-emission vehicles.\nAssemblyman Jim Cooper (D-Elk Grove) is a business-friendly Democrat who proposed a bill that would have expanded the rebate program into his district. The bill stalled, leaving Cooper fed up with the incentive program, which he described as favoring the well-off.\n“We’re not meeting the goals right now of reaching the middle class and poor people,” Cooper said. “People who are wealthy buy electric cars to drive in carpool lanes and get to work quicker. Meanwhile, poor people are in their old clunkers. It’s crazy. Areas that really need the cleaner air—the ones that suffer the most—not much is being done. I’m really soured on the whole thing. I like electric vehicles but I am not supportive of welfare to the rich.”\nTo that end, since 2009 the state of California has offered rebates to consumers: $5,000 for hydrogen fuel vehicles, $2,500 for full-battery electric cars, and $1,500 for plugin hybrids. Added to a federal tax credit of up to $7,500, these incentives have kept the engine of the zero-emission car market ticking over.\nAnd, even though Cooper’s legislation didn’t cross the finish line, the Legislature passed a bill on its last day in session allocating $133 million to the air board to continue the Clean Vehicle Rebate program. The state also is expecting to expand its Cash for Clunkers program—which provides up to $1,500 for low-income families to replace older, polluting cars. The program currently operates in the San Joaquin and South Coast air districts, and an air board spokeswoman said the agency can extend the program into other air districts if there is interest.\nBut the federal incentive is set to phase out in 2019, and the state rebates have had wavering political support. California capped eligibility for higher-income buyers, meaning its rebates are no longer available to individuals who earn more than $250,000 a year. And even those who remain eligible for a price break may not realize it. A study found that by the end of last year, more than one-fourth of eligible consumers did not apply for a rebate even after they had purchased a zero emissions vehicle.\nFrustrating willing buyers is the waiting list to receive state reimbursement, from a fund replenished by the Legislature’s 11th hour injection of $365 million from the proceeds of California’s cap and trade auctions. The changing landscape has made consumers hesitate, and led to what manufacturers describe as a “purchasing pause.”\nJamie Hall, who manages the advanced vehicle program at General Motors, said carmakers “are no longer talking about incentives because it’s on-again off-again. This is creating confusion in the market.”\nThe used-car market could fill the gap, but manufacturers find little incentive to promote the purchase of used electric cars when new models that represent far greater profit margins languish on dealers’ lots.\nHigh-range anxiety:\nThere’s more trauma than sticker shock associated with electric cars; there’s also “range anxiety,” the newfangled term for lingering concern that motorists will be stranded without a charge or made to wait for hours re-energizing their car’s battery. From the teeny Smart Car’s average range of 68 miles to the Leaf’s 107, more affordable electric cars are limiting.\nRange limitations have the effect of putting electric-car drivers on a tether—limiting how and where they can travel. Without a comprehensive system of charging stations around the state, motorists may lack confidence to launch themselves on an open-ended road trip.\n“We need to build the rest of the machine,” said John Bozzella, president of Global Automakers, an industry group representing a dozen vehicle manufacturers. “If I am in a community and I don’t see a single charging station, my view will be that these technologies are still exotic. I’ll wait ten years.”\nTesla provides free charging to owners of its cars. But the stations are not everywhere, and are proprietary and can’t be used by models from other makers.\nTo address the charging deficit, the state has given major utilities a significant role in expanding the charging infrastructure. The key, experts say, is to get charging stations to urban areas where the bulk of the population is clustered in apartments and condos.\nThe California Public Utilities Commission funded two pilot programs for Southern California Edison and San Diego Gas and Electric to establish charging stations in a variety of underserved areas, including low-income communities.\nOne effort is to site charging ports in places where people congregate for long periods, such as office buildings, malls and movie theaters. PUC Commissioner Carla Peterman said that 90 percent of owners charge when they get home from work—the time of highest demand on the state’s already stressed electric grid. It’s a habit the state is endeavoring to break with strategies such as sending cell phone alerts to electric-car owners alerting them to the cheapest daytime charging periods.\nA critical component of the pilot projects is to monitor consumer behavior, said Laura Renger, who oversees Edison’s charging program. “We don’t want to wait three to five years to have answers,” she said. “The more that we can make charging convenient for drivers, the more adoption we will see.”\nNot everyone is cheering the fact that the state is handing off so much of the electric charging market to utilities; the arrangement rankles many private companies. “A regulated monopoly that’s not used to having to pay attention to market dynamics is not well situated to make these decisions,” said J.R. DeShazo, director of UCLA’s Luskin Center for Innovation, which has studied the electric-vehicle market.\nPeterman of the state’s utilities commission said the agency is aware of the concerns and intends the state’s efforts to “complement private investment versus cannibalize it.”\nWhoever does the buildout, it needs to start now. The state has only about 10,000 public charging stations—too few to service the anticipated surge of clean-car sales, should a million more chargeable cars flood the roads.\nMore charging opportunities are an absolute need, said Colleen Quinn, a vice president at the Silicon Valley-based ChargePoint, which provides networked stations. “We see this as a great opportunity.” The company was awarded nearly $4 million from the California Energy Commission to complete the West Coast Electric Highway, a necklace of fast charging stations from Canada to Mexico. Some Canadian provinces are marketing tourism routes directly to owners of vehicules electrique. The Trans Canada Highway is billed as the world’s longest “green highway.”\nThe effort to add charging stations in California will get a boost from an unexpected source: As part of a settlement of its emissions cheating scheme, Volkswagen said it will spend $800 million to establish charging infrastructure.\nMeanwhile, public and private institutions are quickly adding stations, in part to comply with the state’s building code that requires new construction to be “charge ready.”\nOther bumps in the road:\nThe Air Resources Board is considering modifying the clean-car program that requires car companies in California to earn credits, in part by manufacturing zero-emission models. In some cases, manufacturers are so easily meeting the standards that they are decelerating clean-car production. Experts expect some rejiggering of credits to further entice carmakers to, for example, boost the traveling range of their electric models.\nThe agency structured the system much like cap and trade—manufacturers earn credits for selling low-emission vehicles. But car companies can also choose to purchase credits rather than sell cars. “Some of the companies are not trying all that hard to market their electric vehicles,” said Bill Magavern, policy director for Coalition for Clean Air, which has sponsored numerous bills encouraging adoption of low-emission vehicles.\nThe state also has the bad timing to be trying to goose along electric cars at a time when gasoline prices have fallen, consumers are showing a stronger appetite for larger cars and Millennials—a natural constituency for “cool cars”—seem more interested in ride-sharing than car-buying.\nThe state’s lofty goals for a decarbonized transportation sector require a sweeping overhaul of how Californians run errands, deliver goods and launch on vacations. How that will happen, absent consistent subsidies and political will, is not entirely clear.\n“I would love to get behind all this,” said Cooper, the assemblyman. “Climate change is real. I just want to make sure we are taking care of everybody. The state’s goals? That’s a pipe dream right now.”\nYet more than 400,000 people have put down $1,000 deposits on Tesla’s Model 3, the company’s “affordable” $35,000 sedan, which is promised for delivery by the end of next year, and there is heightened consumer interest in the newly released Chevy Bolt, an all-electric with a 230-mile range. Bozzella, of Global Automakers, said that this year there will be about 35 different low-emissions vehicles available in California, adding: “We are ahead of the consumer right now.”\nAnd those 20-somethings who use using ride-hailing services? Researchers say that the more frequently they ride in electric cars, the more likely they are to eventually purchase one—and electrics are becoming more popular among Uber and Lyft drivers.\nFeeney, who bought the Nissan Leaf, is now semi-retired and has become an Uber driver.\nHe’s on the waiting list for a Tesla.","url":"https://calmatters.org/articles/the-electric-highway-why-california-is-just-sputtering-along/"}
