{"authors":[],"date_download":"2018-10-30 20:59:15","date_modify":"2018-10-30 20:59:15","date_publish":"2015-08-21 20:41:25","description":"“This is about hypocrisy. The emperor is buck naked.” That's what Naomi Rose, a marine mammal scientist with the Animal Welfare Institute, had to say about the Georgia Aqaurium, which is locked in a bitter legal fight with the federal government, animal welfare advocates, environmentalists and celebrities over its efforts to import 18 wild-caught beluga whales from Russia.","filename":"data/vaneerConsumption/Theemperorisbuck.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/08/14/Images/photos.medleyphoto.7919544.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_georgia-aquarium-new-i_111d32a0f85ac89a9751c223ac1fedba__1540933155.html","title":"'The emperor is buck...","title_page":"Georgia Aquarium's new image problems: 'The emperor is buck...","title_rss":"NULL","source_domain":"ajc.com","text":"“This is about hypocrisy. The emperor is buck naked.”\nThat's what Naomi Rose, a marine mammal scientist with the Animal Welfare Institute, had to say about the Georgia Aqaurium, which is locked in a bitter legal fight with the federal government, animal welfare advocates, environmentalists and celebrities over its efforts to import 18 wild-caught beluga whales from Russia.\n“The aquarium’s image is suffering and it should,” Rose said. “It is presenting itself as this conservation organization and at the same time its giving you a Vegas-style dolphin show.”\nIt’s not the only negative attention the aquarium has garnered of late. Earlier this year, a troubling tape surfaced showing a dolphin trainer, who was set to become a senior vice president at the Atlanta attraction, allegedly hitting and kicking the animals at a theme park in Spain. Soon afterward, he was found dead in his car in Spain, an apparent suicide.\nThe stakes are high for a nonprofit organization that relies on public donations and and consistently draws a stream of more than 2 million visitors a year.\nA diminished Georgia aquarium would not only undercut the preservation work they’ve established — and rewrite what has largely been a success story in Atlanta — but it would also threaten a centerpiece of downtown tourism.\nClick here to read the complete MyAJC report, including reaction from the aquarium and visitors","url":"https://www.ajc.com/news/georgia-aquarium-new-image-problems-the-emperor-buck-naked/ixzYkd2930HLMORiEYXikI/"}
