{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 23:52:47","date_modify":"2018-10-30 23:52:47","date_publish":"2016-12-05 00:00:00","description":"Matteo Renzi announced late on Sunday that he is stepping down after losing a referendum on constitutional changes that he had staked his reputation on.","filename":"data/vaneerConsumption/TheeurohadagreatdaydespitetheItalianreferendumresult.json","image_url":"https://amp.businessinsider.com/images/58459d06dd08953c448b48da-750-375.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_euro-reaction-dollar-pound-matteo-renzi-resigns-italian-prime-minister-referendum-fx-2016-12_1540943567.html","title":"The euro had a great day despite the Italian referendum result","title_page":"    Euro reaction to Matteo Renzi resigning as Italian Prime Minister - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Italian Prime Minister Matteo Renzi gestures during a media conference after a referendum on constitutional reform at Chigi palace in Rome, Italy, December 5, 2016. REUTERS/Alessandro Bianchi LONDON — The euro completely reversed an earlier slump against the dollar and pound on Monday, gaining on the currency despite Italy's prime minister resigning.\nThe single currency dropped against both the greenback and sterling late on Sunday night after Italy's prime minister announced he is stepping down.\nMatteo Renzi announced his resignation after losing a referendum on constitutional changes that he had staked his career on.\nRenzi said in his resignation speech: \"Italy has chosen. Now it's up to those who won to make proposals.\"\nWhile Renzi's loss and resignation is not a shock — it had looked like he was heading for defeat in the run-up to the vote — it means more instability and uncertainty for Europe.\nThe euro fell as much as 1% against both the dollar and the pound as a result. But it recovered ground as the day progressed.\nHere is how it looks against the dollar at close to 5.00 p.m. GMT (12.00 p.m. ET):\nInvesting.com\nAnd here is how the euro looks against the pound at the same time — an even bigger gain:\nInvesting.com\nConnor Campbell, a market analyst at SpreadEx, says in an emailed statement: \"With the euro recovering all of its early losses (and then some), and the DAX and CAC rising by 1.5% and 1.1% respectively, the Renzi-resignation-triggering 'No' win seems to have been brushed aside by investors.\n\"There are likely a few reasons for this, first and foremost the fact that, unlike June's Brexit or November's Trumpocalypse, the polls were actually correct this time around. The 'No' vote had the lead in the majority of the surveys leading up to the referendum, so when that result was confirmed it came as no surprise.\n\"Also dissimilar to the year's other big votes is that the Italian referendum has seen the status quo preserved instead of demolished, even if those who comprise the 'No' side of things have plenty of anti-establishment populist blood pumping through their veins.\n\"This is not to say that everything in Italy is hunky-dory; its banking sector is still in trouble, while the country currently lacks a leader. However, from a market-perspective at least, investors have seemingly decided that last week's hand-wringing was a bit overdone.\"","url":"https://www.businessinsider.com/euro-reaction-dollar-pound-matteo-renzi-resigns-italian-prime-minister-referendum-fx-2016-12"}
