{"authors":[],"date_download":"2018-10-30 14:20:01","date_modify":"2018-10-30 14:20:01","date_publish":"2014-05-31 00:00:00","description":null,"filename":"data/vaneerConsumption/TheExcessiveUnbearableSelfRegardofHillaryClinton.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_05_the_excessive_unbearable_selfregard_of_hillary_clinton_comments_1540909201.html","title":"The Excessive, Unbearable Self-Regard of Hillary Clinton","title_page":"Blog: The Excessive, Unbearable Self-Regard of Hillary Clinton","title_rss":"NULL","source_domain":"americanthinker.com","text":"Hillary Clinton talks and writes endlessly about \"her life of service.\" To whom is hardly a mystery; to herself and herself alone. Everything she has ever done throughout her entire life has been to enhance her own power and for her own financial gain. Her handling of the disaster in Benghazi, the calculated lies, were all about saving her career. Everything else was unimportant. Lying to the families of the victims? Had to be done. Her calculated salvage of her philandering husband years ago was for herself, for the payback it would inevitably earn. She has fooled, and made fools of, many, many people over the years. Those who think she would be a good president are worse than fools. If elected she will finalize the Obama campaign to destroy America as founded. She will pound the final nail in the coffin of the middle class. While she lives her life of luxury and power, more and more... (Read Full Post)","url":"https://www.americanthinker.com/blog/2014/05/the_excessive_unbearable_selfregard_of_hillary_clinton_comments.html"}
ions of Americans now under Obama. For even more people, there will increasingly be no work, no jobs for college grads, home ownership will be out of reach. Millions more, year by year will have to rely on the government dole. The squeakiest wheels, the most undeserving will, as they do now, game the system and get the most. Those who strive to live by a code of self-reliance will be hardest hit. The \"dreamers\" who cross the border into America in droves, their \"acts of love,\" (as Jeb Bush puts it) will be well taken care of while those who attempt to immigrate legally will face continuing obstacles. Criminal aliens are released onto our streets, further endangering citizens. This is clearly by design. Obama wants to bring about the end of the America those of us over fifty know and love. We are to be punished for our \"white privilege.\" Hillary is on board to finish the job. Despite their obvious antipathy for one another throughout the 2008 campaign, Hillary and Obama are both Alinskyites, through and through. The woman, who as senator accomplished nothing, went on to become Secretary of State, who also accomplished nothing, to travel the world as a self-important emissary, ever arrogant and always wrong (see DiploMad, search Hillary): Russian Reset, pro-Morsi, pro-Muslim Brotherhood, pro-overthrow of Gadhafi, pro-Assad, pro-Palestinian of the terrorist variety, no security for Benghazi, \"What difference does it make?\" In the position she held for four years she accomplished nothing except to make US relations with other countries around the world worse. Hillary and Obama have successfully alienated most of our allies -- Israel, Poland, the Czech Republic, the Baltic states -- and coddled the worst of our enemies: Iran. Our allies no longer trust us; why would they? Obama's \"lead from behind\" strategy is a failure of monumental proportions. The world is disordered without America as a force for good. If Hillary is elected, she will carry on in like fashion to the detriment of the entire world. She is as much of a narcissist as Barack Obama and narcissists are toxic to all who must suffer their disorder.","url":"https://www.americanthinker.com/blog/2014/05/the_excessive_unbearable_selfregard_of_hillary_clinton.html"}
