{"authors":["Kerri Jarema"],"date_download":"2018-10-31 01:45:32","date_modify":"2018-10-31 01:45:32","date_publish":"2018-09-06 17:00:53","description":"If you've been paying attention to YA fantasy at all over the last year, you probably already know that Dhonielle Clayton's The Belles became such a phenomenon that when Beyonce's September Vogue cover was released, many readers couldn't help but…","filename":"data/vaneerConsumption/TheEverlastingRoseByDhonielleClaytonIsTheMuchAnticipatedSequelToTheBellesYouCanStartReadingNow.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/8ad5e914-0a00-4a4f-b0a8-ca986ab5810b-thebelles.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-everlasting-rose-by-dhonielle-clayton-is-the-much-anticipated-sequel-to-the-belles-you-can-start-reading-now-11771959_1540950332.html","title":"'The Everlasting Rose' By Dhonielle Clayton Is The Much-Anticipated Sequel To 'The Belles' & You Can Start Reading Now!","title_page":"'The Everlasting Rose' By Dhonielle Clayton Is The Much-Anticipated Sequel To 'The Belles' & You Can Start Reading Now!","title_rss":"NULL","source_domain":"bustle.com","text":"If you've been paying attention to YA fantasy at all over the last year, you probably already know that Dhonielle Clayton's The Belles became such a phenomenon that when Beyonce's September Vogue cover was released, many readers couldn't help but point out its similarity to the opulent aesthetic and feminine fierceness of Clayton's fantasy world. So it's absolutely no surprise that readers have been waiting with bated breath for news of the sequel, The Everlasting Rose, which is due to hit shelves on March 5, 2019. Bustle has an exclusive look at the cover and first chapter below.\nIf you need a little refresher, Clayton's series follows Camellia Beauregard, who lives in the opulent world of Orléans as a Belle — a girl who can control Beauty, which is the commodity coveted above all else. But when Camellia is chosen as the favorite Belle and whisked away to the palace, she soon learns that the very essence of her existence is a lie — and that her powers are far greater, and more dangerous, than she ever imagined.\nThe sequel begins with Camellia, her sister Edel, and her guard Remy on the run. With the help of an underground resistance movement called The Iron Ladies — a society that rejects beauty treatments entirely — and the backing of alternative newspaper The Spider's Web, Camellia uses her powers, her connections, and her cunning to try to restore peace to Orléans. And as if you weren't excited enough about that plot, it's time to check out the cover reveal for The Everlasting Rose below:\nThe Everlasting Rose by Dhonielle Clayton, $17.99, Amazon\nYou'll have to wait a few months before the book is released on March 5, 2019, but if you want a sneak peek of all the heart-stopping action, fierce friendship, and intense romance that it still to come, you can read the entire first chapter of the book right now. And be sure to add The Everlasting Rose to your pre-orders list ASAP.\nChapter One\nMaman never told me what to do when the world falls apart like a dress ripped at its seams; the beads scattering into faraway corners; the fabric a storm of shredded pieces left destroyed and unrecognizable. She never told me how to battle the nightmares that creep in like icy shadows, lingering behind closed eyes. She never told me what to do when all the color leaks out of the world like blood oozing from a mortal wound.\nShe gave me a mirror to see truth. I clutch it, the glass warming inside my palm.\nBut what happens when the reflection peering back is ugly, and when all I want to do is set everything ablaze, and she’s not here to help me?\nThe past three days are a chaotic blur, a télétrope in perpetual motion —the palace, Sophia’s dungeons, Charlotte waking up, and Arabella helping us get here with false papers.\n“Are you listening to me?” Edel snaps. “You’ve been gazing out that window for almost a full hourglass.”\nI don’t pivot around to face her or the small boardinghouse room we’ve been stuffed into. I fixate on the sun as it sinks behind the row of shops across the street and watch how it turns the sky the color of a peacock’s tail. Sunsets are much more beautiful this far south. It feels like the Spice Islands are at the very edge of the world and poised to float right off.\nI press my nose against the frigid glass; the cold-season wind attempts to push its way through. I wish it would wrap its icy fingers around me and cool my insides. In the distance, the cluster of islands almost kisses at the Bay of Croix and the capital city of Metairie overlooks them like a huge house-lantern out at sea, drawing ships safely near. Golden bridges connect the four isles and illuminate like fireworks as evening arch-lanterns are lit. Decadent river coaches skate over the waters beneath; the light glinting off their gilded trim. Grand spice plantations stretch out in all directions with large white mansions overseeing fields of mint, lemon balm, lavender, and sage. Plant-lanterns crest over the crops, paper-thin bees carrying sunshine and nutrients.\nThis place feels even stranger than the palace did; so different than our home. I used to want to see every far-flung corner of this world, but now, all I think about is what it would be like to watch Orléans burn, each island turning to ash, clouds of thick smoke clogging the skies and stamping out the sun, the seas blackening from the leftover debris. Would the gods intervene?\nThis place feels even stranger than the palace did; so different than our home. I used to want to see every far-flung corner of this world, but now, all I think about is what it would be like to watch Orléans burn, each island turning to ash, clouds of thick smoke clogging the skies and stamping out the sun, the seas blackening from the leftover debris.\"\nI gaze back down at the maps littering the desk. My charts of the trade winds. My theories about how far Princess Charlotte could have gotten if she sailed west toward the Glass Isles or maybe east around the base of the imperial island.\nOvercome with frustration, I throw the compass rose Rémy gave me, and it lands on the floor with an unsatisfying thud.\nEdel picks it up. “Camille, I need to show you something!” She looks over my shoulder at my maps. “Come now. You don’t even know if Charlotte made it out that night.”\n“Rémy said the queen’s private schooner was spotted. Who else could it be?”\n“A thief? Pirates? Some drunken courtiers who got on the wrong boat?”\nI scoff. “He said no one knows who was on it, and now you’re putting all your hopes into a girl who was unconscious for ten years.”\nShe touches my bare shoulder. I jump.\n“Your skin’s hotter than a cook stove,” she says. “Are you ill?”\nI want to tell her a never-ending fire burns in the pit of my stomach now; the flames fed by my rage.\n“And your fingers are like ice.”\nI grab the compass from her and trace another potential route Charlotte might have taken, putting her north of the imperial island. “She was coughing and waking up when Amber and I rushed out.”\n“Let’s forget Charlotte and storm the palace. We could take down Sophia ourselves.\"\n“Then, what? Rule Orléans?”\nEdel nibbles her bottom lip. “Maybe.”\n“If Charlotte is queen, then she can return Orléans to what it used to be. The way Queen Celeste wanted.”\n“I don’t want to go back. I won’t be in another teahouse again. I won’t be forced to—”\nI take her hand, and she swallows the rest of the sentence. “We need to hope. If we can find Charlotte and bring her back to the palace, she can confront her sister. She can put an end to all of this.” I hold her close. “Then we will find a different way forward, a different life for us. I promise.”\n“Fine, fine,” Edel mutters under her breath and pulls away. “But I have something more important to show you . . . something that will help us when we leave this place.” She’s shaky and casts nervous glances at the door. “I’ve been waiting until we were alone.”\n“What is it?” I turn away from the maps.\n“Watch.” Edel closes her eyes, concentrating so hard she looks minutes from laying a golden egg. Veins swell beneath her white skin and a red blush sets into her cheeks. The pale blond hair at her temples soaks with sweat, and it beads across her forehead like a strand of pearls. Her hair lengthens down to her waist inch-by-inch, then turns the color of midnight.\nI scramble backward, smacking into the tiny cage of sleeping teacup dragons. They squeak with alarm.\n“We’re not supposed to be able to do this.” I put my hand over my mouth.\n“I’m calling it our fourth arcana — glamour.” She takes my trembling fingers and pushes them into her hair. It still maintains the same fine texture its always had, but the color is utterly unfamiliar.\n“Our gifts are for others. . . .” My heart flips in my chest. My arcana hums just beneath my skin, eager to learn, eager to experiment with this dangerous trick; my mind fills with a thousand possibilities.\nMy arcana hums just beneath my skin, eager to learn, eager to experiment with this dangerous trick; my mind fills with a thousand possibilities.\"\n“No. This gift . . . this is for us. This is how—” Edel starts.\n“We will outsmart Sophia and her guards,” I interject. “And find Charlotte.”\nThe possibility of success wedges itself down to my bones and mingles with the anger living there. I’d always built my life on doing the unexpected and wanting it all—to be the favorite, to be the most talented Belle, to shape what it meant to be beautiful in Orléans—and now I’m presented with doing the biggest thing I’ve ever had to do and with the risk of danger far greater than I could ever imagine. All of it breathes life into my ambition.\nA full grin spreads across Edel’s face. She takes a deep breath, and the dark shade of midnight in her hair lightens as if morning sun pushes through each strand.\n“How did you learn to do this?”\nShe glances at the door. “It was an accident. Madame Alienas was yelling at me, laying out all the things I’d done wrong. She barked about how I needed to be nicer, and how she’d wished she’d gotten Valerie instead. I was twirling my hair around my finger.” She lifts one of the strands. “Growing angrier and angrier, thinking of our sister, and then, it darkened to Valerie’s brown shade.”\n“What does it feel like?” I stroke Edel’s hair again, and it shrivels back to its previous shoulder length.\n“Remember when we’d sneak up on the roof at home before the first snow? Our fingernails would be purple and blue. Our nightgowns would catch the wind, the fibers almost freezing.”\nI nod as the memory flickers through me. All of us on the roof after Du Barry and our mothers had fallen asleep, waiting for the clouds to release their crystals, waiting to catch a snowflake on our tongues, waiting to see the white mounds frost the tops of the dark forest behind our house.\n“It feels cold like that. I panicked at first. I didn’t think it was real. Thought my arcana was low, my eyes playing tricks on me. So I experimented with sections of my hair.” She walks in circles. “Adding a wave or a highlight, and testing how long I could hold it.”\nMy stomach flutters. Trusting untested aspects of the arcana feels like trying to harness a windstorm. “Did it make you sick?”\n“Nose bleeds, headaches, the chills.”\n“Then maybe—”\nShe put a hand up, sweeping away my worries. “That lessened as I got stronger. It just takes practice. I moved from my hair to aspects of my face.”\n“Does it weaken you like after we’ve done beauty treatments?”\n“Yes. I use the sangsues and chocolate to help me hold a glamour and to feel better after using one.” Edel takes my hand. “Quick. Let me show you.”\nI stretch across the thin mattress Edel, Amber, and I share. The springs dig into my back. Maman’s mirror sits just under my breastbone on its chain. I press my hand to it, wanting its truth and wisdom to push down inside me, fill me up, and make me feel like Maman is still here, ready to fight alongside me. What would she think of all this? The things I’ve done. The things I’m about to do.\nMaman’s mirror sits just under my breastbone on its chain. I press my hand to it, wanting its truth and wisdom to push down inside me, fill me up, and make me feel like Maman is still here, ready to fight alongside me. What would she think of all this? The things I’ve done. The things I’m about to do.\"\n“Close your eyes,” Edel directs.\nA tremor pulses in my stomach.\nEdel pushes my curls away from my sweaty forehead. Is this how our clients feel on our treatment tables? Tiny, exposed, vulnerable?\nShe takes my trembling hand. “Are you afraid?”\n“I’m angry.”\n“Good. That will make you strong.” Her soft fingers graze over my eyelids, forcing them closed. “Now, think back to when we were little girls first learning our second arcana, and Du Barry made us do all those lessons on visualizing our clients like paintings or sculptures. Remember?”\n“Yes.”\n“Instead, try to see yourself.”\nDu Barry’s childhood warnings are sharp echoes inside my head: “Belles must never be vain, for the Goddess of Beauty shall punish those who hoard their gifts. The arcana are favors from the Goddess of Beauty to be used in service.”\nDu Barry’s childhood warnings are sharp echoes inside my head: “Belles must never be vain, for the Goddess of Beauty shall punish those who hoard their gifts. The arcana are favors from the Goddess of Beauty to be used in service.”\nI push her words away; bury them deep down with the rest of the lies.\nEdel squeezes my shoulder. “Go back to Maison Rouge. You’ll see.\nI take a deep breath, let my muscles relax. Edel describes the home where we spent our entire lives until we turned sixteen last year. The pale white trees growing out of the bayou like bones, the rose-shaped bars on the house windows, the crimson-and-gold papered walls leading into the lesson rooms, the Age chambers with their terrariums of dying flowers and bowls of rotten fruit, the Aura rooms with their treatment tables and Belle-products, the nursery full of crying babies, the black forest—a shadow behind our house.\n“You’re tensing your muscles,” Edel says, stroking my cheek. “Let the arcana wake up. Focus on that.”\nAt the mention of the word arcana, their power throbs inside me, rising quickly to meet my request. All three skills—Manner, Aura, Age—are threads ready, able, and eager to be tugged and bent to my will.\nThe veins in my hands swell beneath my skin. My nerves prickle with thick energy.\n“Think of your own face,” Edel whispers. “Your curly hair and your high forehead. Your full lips. The shade of your skin is the brown of the almond luna pastries Rémy brought us this morning for breakfast.”\nWhen I would see clients for beauty work, a familiar warmth would race through me like someone had let a candle flame graze across my skin. But now, a deep chill settles in, replacing that feeling. My teeth chatter, and a shiver makes me jerk.\n“You’re all right. Keep going,” Edel says. “Change your hair to match one of the crimson Belle-roses from our home solarium with petals as large as plates.”\nThe flower sprouts beside the image of my own face in my mind. Its color bleeds into the strands of my hair, twisting around the coils like ribbons of blood. A headache erupts in my temples. My lungs tighten like I’ve just raced up a winding staircase.\nThe flower sprouts beside the image of my own face in my mind. Its color bleeds into the strands of my hair, twisting around the coils like ribbons of blood. A headache erupts in my temples. My lungs tighten like I’ve just raced up a winding staircase.\"\n“It’s working,” she says.\nI sit straight up.\n“Don’t break your concentration.\"\n“Why does it feel this way?” I ask, out of breath.\n“I don’t know. But you’re doing it.” Edel rustles through the beauty caisse Arabella sent with us, retrieving a small mirror, and thrusts it into my hands. “Look!”\nI gaze into it. The frizzy curls at the crown of my head are a deep fiery red like Amber’s, like Maman’s. I play with one curl and twist it around my finger to examine it more closely.\n“How long does it last?” I grimace through the cold. It grips my bones, a radiating ache splintering my insides.\n“As long as you can hold it in your mind and your levels stay strong. I’ve been able to maintain it for almost five hourglasses when I’m rested and focused,” Edel boasts. “But I know if I push myself or drink Belle-rose tea or elixir, I could go longer.”\n“I can’t concentrate anymore.”\nThe red fades away and the brown appears once more. I crumple on the bed.\nThe door snaps open. Amber marches in, her presence a landquake. A nest of red hair peeks out from under her hood.\nEdel stands. “You’re back early.”\n“There were too many guards, and I lost the mask you gave me,” Amber reports, then surveys the room. “What’s going on?”\n“Edel was just teaching me how to—” I start to say.\n“Quickly refresh your arcana.” Edel’s eyes burn into mine.\nI purse my lips and flash her a puzzled look.\n“Where’s Rémy?” Edel asks, taking a porcelain bowl from a nearby table and fishing out two wiggling sangsues. She wraps one leech around my wrist like a cuff, and in a whisper says, “Don’t say anything.”\n“He’s doing one of his rounds before coming upstairs.” Amber rushes to the dragons’ cage and lifts the blanket. They’re tangled together in a pile and remind me of jeweled bracelets made of pearls, emeralds, sapphires, rubies, and gold. “I brought them some pig meat and found these sweet necklaces.” She dangles the jeweled collars from her fingers and sets them in front of the cage.\n“Why’d you spend our money on those?” Edel snaps. “You were supposed to get hair dye for all of us.”\n“I did.” She yanks two pot-bellied jars from her pocket and throws one at Edel.\nEdel catches it.\n“All she had left was evergreen.”\n“That’s going to help us blend in,” Edel replies sarcastically.\n“The whole city is at a shortage of Belle-products with the teahouses shutdown. And she gave me those collars at a discount. The dragons need leashes for their training.” She hands me a crumpled page. “Found this on the lobby table.\"\nFour cameo portraits stretch across the page: Amber, Edel, Rémy, and lastly, me.\nMy own eyes stare out, looking haunted. The animated portrait shifts through a series of my most notable looks: one with my hair in a signature Belle-bun full of camellia flowers; another with it down and around my face in a big, curly cloud; and the last, with the strands all ironed straight and resting on my shoulders. The text calls us dangerous, cunning, and traitors to the crown. Sophia has promised 850,000 leas and 275,000 spintria for our capture. That would make a person instantly one of the wealthiest individuals in all Orléans, ready to join the circle of the kingdom’s finest.\nwanted: alive and in good condition. suitable for use.\nThe animated portrait shifts through a series of my most notable looks: one with my hair in a signature Belle-bun full of camellia flowers; another with it down and around my face in a big, curly cloud; and the last, with the strands all ironed straight and resting on my shoulders. The text calls us dangerous, cunning, and traitors to the crown.\"\nWhat does that mean? Are we cattle headed to the slaughterhouses on the Isle of Quin?\nAmber places fresh food in the teacup dragon’s cages, then plops down in one of the wooden chairs. “I hate this place.”\nEdel starts to cough. “I need water,” she says.\n“Are you sick?” Amber asks.\n“Thirsty,” Edel replies. “Can you grab some?”\n“Why can’t you?” Amber’s eyebrows lift with suspicion.\n“You always get the water. You know how to work the house pumps.” They lock eyes. “Plus, I’m not dressed, and you are.”\n“Amber, please. The teacup dragons need some as well,” I add.\nShe shrugs, then leaves the room.\nAs soon as the door closes, Edel stops coughing and turns to me. “Don’t tell her about the glamours.”\n“Why?” I ask feeling Edel’s distrust of Amber like a flash of heat.\n“She’s too weak to try it right now. We should wait until we know exactly how it works. We both have always been stronger and more willing to experiment than she is.”\n“But we’ll need to show her soon.” I study Edel’s face.\n“Of course,” Edel says, avoiding my eyes. “When the time is right.”\nExcerpt from THE EVERLASTING ROSE by Dhonielle Clayton ©2016. Reprinted by permission of Freeform/Disney Publishing Worldwide.","url":"https://www.bustle.com/p/the-everlasting-rose-by-dhonielle-clayton-is-the-much-anticipated-sequel-to-the-belles-you-can-start-reading-now-11771959"}
