{"authors":["Associated Press"],"date_download":"2018-10-23 02:43:03","date_modify":"2018-10-23 02:43:03","date_publish":"2016-01-28 17:48:00","description":"In the snowy woods of northern New England and other forested parts of the country, the lumberjack is an endangered species as s markets for forest products change and high-tech machinery.","filename":"data/vaneerConsumption/TheendoftheAmericanlumberjack.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:57a8ded188a541ba82334d807b2f5e51-2vdWmEltwXfba0ce28e632b41700-761_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420439_Waving-goodbye-piece-Americana-_-lumberjack_1540262583.html","title":"The end of the American lumberjack","title_page":"The end of the American lumberjack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In the snowy woods of northern New England and other forested parts of the country, the lumberjack is an endangered species.\nAs markets for forest products change and high-tech machinery replaces chain saws, which themselves replaced the ax, a generations-old way of life is disappearing, one that historically saw fathers pass on to their sons their love and knowledge of the woods and the independence that came from working for oneself.\nKen Davis feels this keenly as he reaches retirement age after a half-century career with no one to pass the torch to.\nlumberjack's goodbye: Logs destined for a mill are unloaded at a satellite wood yard in Harwick, Vermontt. The owner of the yard, Ken Davis, said he isn't sure what he'll do with his business when he retires because none of his employees want to take it over\nNot taking over: Aaron Martin works on a piece of logging equipment in Greensboro, Vermont. Martin, 31, said he likes to work outside, but he isn't interested in taking over the business\nDavis once employed 19 people full-time to cut the wood, haul it and then truck it, sometimes to his log yard, other times directly to the now-disappearing mills across Vermont, New Hampshire, Maine and upstate New York that would turn it into lumber or process it into paper.\nHe now employs seven, and has no sons. His daughter and son-in-law tried it for a while, but they didn't keep at it.\n'I've got the sawdust in my veins, and they don't make a dialysis machine to get it out, so I'm still here,' Davis said recently at his log yard in the town of Hardwick, in an especially rural region Vermonters call the Northeast Kingdom.\nNone of Davis' employees are showing interest in taking over his business. It's the same story across the region, said Michael Snyder, commissioner of the Vermont Department of Forest, Parks and Recreation.\n'It's dangerous, it's hard to make a living and everybody hates you,' Snyder said of logging. 'Who's signing up for that?'\nThe arguments for not becoming a logger are solid.\nFor one, there's just not as much demand for paper and other wood products because of low commodity prices and international competition, making it less secure than it once was. It's physically and — yes — intellectually demanding work that increasingly requires special skills to run hugely expensive, high-tech machinery. And because of that machinery, capital investments needed to get started can be prohibitive.\nKen Davis cuts logs to length at a log landing in Greensboro, Vermont. The renaissance that farming has undergone in recent years, with an emphasis on food systems and sustainable agriculture, hasn't brought the same energy to logging\nThe renaissance that farming has undergone in recent years, with an emphasis on food systems and sustainable agriculture, hasn't brought the same energy to logging.\nIn many quarters, loggers are still seen as despoilers of the land. But Snyder noted that while forests can do just fine on their own, logging can support their health by weeding out infestations and invasive species.\nLogging entails a number of jobs, including fallers, who cut down trees by hand — essentially, lumberjacks; operators of machinery used to fell trees; and graders and scalers, who check the amount and quality of the wood.\nThe number of all logging workers is expected to fall only 4 percent from 2014 to 2024, from 53,700 to 51,700, according to Bureau of Labor projections.\nNationwide, the number of fallers is projected to decline 17 percent over the same period, from 8,200 in 2014 to 6,800 in 2024.\nAaron Martin, left, and Ken Davis pose at a log landing in Greensboro. Martin has been logging for 10 years, but few of his friends have been drawn to the life, he said: 'They don't like being out in the cold.'\nWith the industry becoming more mechanized, the number of equipment operators is expected to stay about the same, with graders and scalers declining 2 percent and all other logging workers falling 7 percent.\n'Today you are running a half-million, $600,000 machine, and not only do you need to operate it, you've got to read GPS and computer-based technology equipment, you've got to be able to service and maintain that equipment, you have to know forestry, environmental law, best management practices, tree identification,' said Dana Doran, executive director of the Professional Logging Contractors of Maine.\nAcross the region, efforts are underway to bring along young loggers. The Vermont Technical College in Randolph helps train forest technicians. In Maine, the industry is backing a plan to train logging technicians in community colleges.\nIn the Northeast Kingdom, one of Davis' workers, 31-year-old Aaron Martin, said he likes the freedom of working outside in different places. He has been logging for 10 years, but few of his friends have been drawn to the life, he said: 'They don't like being out in the cold.'\nBut as much as he likes his work, he has no interest in being the boss.\n'With that comes its own headaches,' he said. 'It's nice to be able to work for somebody else and not deal with all the stress that comes with paying all the bills and everything that goes with it, finding the next job.\n'I just go to work and do what I'm told. It's a lot simpler that way.'","url":"https://www.dailymail.co.uk/news/article-3420439/Waving-goodbye-piece-Americana-_-lumberjack.html"}
