{"authors":[],"date_download":"2018-10-22 21:01:24","date_modify":"2018-10-22 21:01:24","date_publish":"2014-06-03 20:44:47","description":"A handful of companies are catching on to the idea of allowing their employees to recharge.","filename":"data/vaneerConsumption/TheEmailEmbargoPolicyTurnSmartphoneOffandChill.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_10/237241/140307-smartphone-2055_4009b9adc580d44cff50191d68d69017.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_email-embargo-policy-turn-smartphone-chill-n121696_1540242084.html","title":"The Email Embargo Policy: Turn Smartphone Off and Chill!","title_page":"The Email Embargo Policy: Turn Smartphone Off and Chill!","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBe honest. How often do you check your email?\nDo you scroll though messages before work? In bed? On vacation?\nOne study showed workers who have smartphones are on them at least 13.5 hours a day—and five hours on weekends. Another survey found 38 percent of workers check email \"routinely\" at the dinner table and half of them checked it in bed.\nGetting a few more hours of work out of employees may seem like a great deal for companies that spring for a smartphone, laptop or tablet for their workers. But it can also be counterproductive.\n\"If you stay on your email, you become transactional. You become reactive. You're not inspirational,\" says Sherry Turkle, a professor at Massachusetts Institute of Technology, who studies how devices are redefining communication. \"You have to encourage them to unplug,\" she says. \"Innovative companies are trying to help people find ways to do that.\"\nTake Bandwidth, a fast-growing telecom company in Raleigh, North Carolina, which offers its nearly 400 employees a unique perk: guaranteed time to unplug. A strictly enforced vacation embargo policy bars any contact with employees while they are off.\nIt took Lon France, a senior vice president at Republic Wireless, a division of Bandwidth, some time to adjust. He had worked at the company about two years before taking his first weeklong vacation. Even then he found it hard to put away his smartphone. \"After the third day the phone was in the house while I was at the beach,\" France says. \"I went six hours without having my smartphone. That's a first!\"\nBandwidth co-founder and CEO David Morken says he values his time off. A father of six, he wants to be a fully present parent outside the office—so he wanted everyone at his company to be able enjoy their free time as well.\nIt is ironic that a telecom company—in the business of connecting people—is now requiring its employees to disconnect. Yet, Morken says, \"maybe that's why we're sensitive to it. We're realizing everyday that it's important to disconnect. We offer meaningful work and a full life and those are not incompatible.\"\nA handful of other companies are catching on to this idea—finding ways to recharge and retain talent. New York start-up Quirky closes their office for a week three times a year, giving their employees an email \"blackout period.\" Boston Consulting Group guarantees one email-free evening a week for all of its consultants.\n\"In the short view, you can say, 'Look, I can get all of this extra work out of people,' \" Turkle says. \"But I'm finding that employers are starting to say, 'You know what? People are leaving. You know what? People are burning out.' \"\nStill, it may not be easy to get workers out of the habit of staying connected. Morken has to chase some employees out at the end of the day. But he says he gladly does it in order to give employees time to make meaningful connections outside of work.","url":"https://www.nbcnews.com/nightly-news/email-embargo-policy-turn-smartphone-chill-n121696"}
