{"authors":[],"date_download":"2018-10-30 01:08:29","date_modify":"2018-10-30 01:08:29","date_publish":"2014-08-19 00:00:00","description":null,"filename":"data/vaneerConsumption/TheEducationofHowardSternWillMoreLiberalJewsFollow.json","image_url":"https://www.americanthinker.com/images/bucket/2014-08/192978.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_08_the_education_of_howard_stern_will_more_liberal_jews_follow_comments_1540861709.html","title":"The Education of Howard Stern: Will More Liberal Jews Follow?","title_page":"Blog: The Education of Howard Stern: Will More Liberal Jews Follow?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Howard Stern, the always controversial and brassy shock jock of millions on terrestrial and satellite radio with his risqué words and actions, is shocked. Hardly a conservative purveyor of anything, recently he said to a caller on his program: ‘to be anti-Israel is to be anti-American.’ I have no idea what Mr. Stern’s religious beliefs are if any, but I think it is safe to assume that he is a cultural, rather than a practicing, Jew. Regardless of that, I think it’s reasonable to further infer that he didn’t vote for Mitt Romney or John McCain in the last two presidential cycles. Indeed, when Howard Stern starts to sound like WMAL’s conservative encyclopedia Chris Plante, it seems like something tectonic may shifting in the American psyche. Historically a great ally of the United States, flourishing Israel is the only functioning democracy in the war-torn Middle East. Once again, it is under attack by the... (Read Full Post)","url":"https://www.americanthinker.com/blog/2014/08/the_education_of_howard_stern_will_more_liberal_jews_follow_comments.html"}
launch seemingly endless missile attacks against its peace-loving neighbor. It is shameful and ironic that millions of U.S. aid to this “Palestinian State” intended both to curtail terrorism and to build infrastructure, roads and supply humanitarian relief have instead been funneled into bunkers, tunnels and weapons controlled by barbarous warmongers. In this topsy-turvy world where even America’s premiere Jewish university, Brandeis University -- of which I am a Christian alumnus -- muzzles Muslim dissident Ayaan Hirsi Ali in favor of “tolerance” of Islamic extremism, which philosophically refuses to acknowledge the fundamental right for Israel to even exist. Indeed, given this lack of middle ground between parties, armed conflict is unfortunate, but inevitable. The comic relief in this tragedy is the Obama administration’s flailing efforts to broker a peace beneficial to terrorists over a legitimate government. Israel will not lose this conflict. Not only does it have the right and the duty to defend itself, but also it should expel Hamas and reabsorb the Gaza Strip to prevent further attacks and future incursions. It will do this despite the squawking of Secretary of State John Kerry and the left-leaning U.S. administration he represents. Similarly, the howls of the liberal mass media that looks for every excuse to portray the aggressors as the victims will not fool any informed person. Try as I might, I cannot fathom why educated, liberal Jews would continue en masse to blindly support and fund Democratic politicians with demonstrated anti-Semitic policies. President Ronald Reagan talked about America as a shining city on a hill; a leading light in a dark world. This is a vital function it is not currently performing. Instead, bad actors like Vladimir Putin have filled the leadership vacuum, assumed the world’s center stage and are now pulling the strings. In such a crazy world one raunchy man, Howard Stern, has seen the truth: to be anti-Israel is to be anti-American. Despite the colorful messenger, liberals, particularly Jews, must learn to support civilized men over their lawless brothers.","url":"https://www.americanthinker.com/blog/2014/08/the_education_of_howard_stern_will_more_liberal_jews_follow.html"}
