{"authors":["Wolf Richter","Wolf Street"],"date_download":"2018-10-30 23:16:59","date_modify":"2018-10-30 23:16:59","date_publish":"2018-07-19 00:00:00","description":"The European Central Bank has been buying corporate bonds. Artificial demand caused all kinds of distortions in the eurozone. When central banks distort markets, risk disappears from view.","filename":"data/vaneerConsumption/TheECBsbondbuyingprogramcouldhavemaskedmajorrisks.json","image_url":"https://amp.businessinsider.com/images/5b50e148476800d7218b4638-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ecb-bond-buying-program-could-mask-risks-jpmorgan-exec-warns-2018-7_1540941419.html","title":"The ECB's bond-buying program could have masked major risks","title_page":"    ECB bond-buying program could mask risks, JPMorgan exec warns - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"European Central Bank President Mario Draghi listens at a news conference during an informal meeting of Ministers for Economic and Financial Affairs (ECOFIN) in Riga, Latvia, April 24, 2015. REUTERS/Ints Kalnins\n\"You could have a bunch of walking-zombie companies and you don't even know it,\" explained Mary Callahan Erdoes, CEO of JPMorgan Asset Management, on Wednesday at the Delivering Alpha Conference in New York. \"That's a super dangerous place to be,\" she said.\nShe was talking about the effects of the ECB's bond buying program as part of a broader warning that investors are no longer seeing risks.\nThe ECB has been buying corporate bonds, among other things, in an explicit effort to distort the bond market and drive corporate bond yields to near zero. At the peak of the frenzy last fall, the average euro junk-bond yield fell to 2.08% — though it has risen since. These are bonds with an appreciable risk of default. But the yield was barely enough to cover inflation (currently 2.0%). Credit risk wasn't priced in at all.\nThe bond-buying binge has created a universe of bonds with negative yields, and desperate investors who'll take any risk without compensation just to cover inflation. This desperation supplies fresh money to burn to even the riskiest zombie companies.\nCompanies have relentlessly taken advantage of this investor desperation. The amount of corporate euro bonds outstanding has surged by about 45% over the past three years, to €1.5 trillion ($1.75 trillion), including record euro-bonds issued by American junk-rated companies.\nWhen credit risk is not being priced at all - when it's free - this most important gauge of the credit market is worthless.\n\"You're equally rewarding the A-plus student and the student who's doing no homework and is just showing up,\" Erdoes said at the conference, as reported by Bloomberg. \"That's a super dangerous place to be, because when that gets pulled back, and the markets have to sort of figure out the good from the bad, and you have real-money buyers in there, as opposed to the governments, then you start to do your homework and you figure out, 'This is not all the same.'\"\nArtificial demand from the ECB's bond desk caused all kinds of distortions. While the ECB doesn't buy junk-rated bonds - it only buys investment grade and \"unrated\" bonds - the distortions from those purchases filtered down to the biggest credit risks, and companies that shouldn't be able to sell bonds, are not only able to sell bonds, but do so at a low cost, and are thus able to stay afloat.\nBut the ECB's bond-buying binge will likely end by the end of this year. And then what? That's when investors will begin to discover, as Erdoes put it so elegantly, that they have \"a bunch of walking-zombie companies.\"\nIn the broader context, she was talking about investor complacency - the idea that risks no longer exist because they're not being priced in anymore, and that there is nothing to worry about. And this has left investors unprepared for a downturn. This condition has its origins in the Financial Crisis - and what the Fed and other central banks tried to accomplish since then, and how the financial advisory industry has followed the instructions.\n\"Every moment since the financial crisis of 2008, our job as financial advisors is to help clients re-risk when it was uncomfortable to do so,\" Erdoes said, as reported by CNBC. \"Well they've done it, and now they're very comfortable doing it, and they see no risks on the horizon.\"\nAnd this idea that risks aren't there, or if they're there, that they don't matter because central banks will always bail out the markets at the smallest squiggle, and that therefore risks no longer need to be priced in - that's a pandemic attitude today.\nIronically, it is precisely what the Fed is now trying to undo with its efforts to tighten \"financial conditions.\" It wants risks to have a price, and it wants risk premiums to widen. But clearly, given how assiduously the markets are brushing off the Fed, this effort is going to be a slog.","url":"https://www.businessinsider.com/ecb-bond-buying-program-could-mask-risks-jpmorgan-exec-warns-2018-7"}
