{"authors":[],"date_download":"2018-10-23 05:35:41","date_modify":"2018-10-23 05:35:41","date_publish":"2015-05-25 00:00:00","description":"For the composer, life is how the past and the future connect. Glass' memoir, Words Without Music, looks back on his childhood, travels and music. Originally broadcast April 6, 2015.","filename":"data/vaneerConsumption/TheFutureItsAllAroundUsNPR.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=408776056_1540272941.html","title":"'The Future ... It's All Around Us' : NPR","title_page":"Philip Glass On Legacy: 'The Future ... It's All Around Us' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"TERRY GROSS, HOST:\nThis is FRESH AIR. I'm Terry Gross. I hope you’ve been having a good Memorial Day weekend. Today, we’re going to hear my recently-recorded interview with composer Philip Glass.\n(SOUNDBITE OF ARCHIVED BROADCAST)\nGROSS: When he started performing his own music, which was based on repetition and change, a lot of people didn't know what to make of it. Some people thought it sounded like the needle of a record was stuck in a groove, repeating over and over again. Some people thought it was simplistic. Some thought it was a joke. But those who loved the music realized something new was happening - a new musical language he was developing in parallel with composers like Steve Reich and La Monte Young. It was described as minimalist, even though Glass would tell you it was anything but.\nAlthough Philip Glass studied at the Peabody Conservatory of Music as a child, was a graduate of Juilliard and studied in Paris with renowned classical music teacher Nadia Boulanger, his music was initially shunned by the classical music world. But it was embraced in the worlds of avant-garde art and theater and experimental music. He's now considered one of the most important composers of his generation, and his work has become so accepted, it's been used in film scores and even TV commercials. Glass has written a new memoir called \"Words Without Music\" that's filled with insights into his music and has great stories about his childhood, his father's record store, his travels listening to music throughout Central Asia and India, his day jobs and his study of meditative practices and esoteric traditions. Let's start with music from his 1976 opera, \"Einstein On The Beach.\"\n(SOUNDBITE OF OPERA, \"EINSTEIN ON THE BEACH\")\nUNIDENTIFIED CHOIR: (Singing in foreign language).\nGROSS: Philip Glass, welcome to FRESH AIR. When you first started playing your music, people who didn't get it were sometimes angry. And I'd like to begin by asking you to tell the story of the guy who stormed the stage and sat down at your piano.\nPHILIP GLASS: (Laughter). That was quite a while ago. He didn't actually sit down at the piano. He didn't get that far. He came up and began banging on the piano. This was in Amsterdam. And I played a piece of – of Steve Reich's in a piece called \"Two Pages,\" and I guess it could drive you crazy a little bit. It only had five notes in it.\nGROSS: (Laughter).\nGLASS: But I played it a lot - those five notes in a lot of different ways, and I thought it was interesting. And this was about 1971, and the idea of music that was so, let's say, consciously or steadfastly repetitive was not so common then. And someone jumped on the stage and began banging on the piano. And without thinking about it, I stood up, and I punched him on the jaw or something. And just like in the comic books, and he fell off the stage.\nNow, I was there - I was working with a friend of mine, Richard Serra, the sculptor, and I used to be a part-time studio assistant for him when he needed some help. And I liked him a lot. We were old friends. And he was there. I was there helping him put up a piece. And one of the exchanges of our relationship was that when I went on a tour with him, I would do a concert at the same time, and that's why I was there.\nAnd afterwards, I said, Richard, why'd you let that jerk get on the stage and try to stop the concert? He said - he just laughed and said, I thought you did pretty good.\n(LAUGHTER)\nGLASS: Afterwards, Terry, what happened was that afterwards, people came after to say hello, and the fellow was there. And he said, now we have the discussion. And I said, no, we had the discussion. Thank you. And that was it.\nGROSS: What do you think it was about your music that really upset some people?\nGLASS: I think he thought that I was making fun of him. Now, this is an idea that people had, that artists are - when, you know, when Pollock first began dripping - doing his drip paintings, people thought he was making fun of them, or they thought, oh, my kid sister can do the same kind of painting. Or they thought that that was kind of the idea of epater la bourgeois, to put...\nGROSS: To shock the bourgeoisie, to shock the middle class?\nGLASS: Yeah, that's right. That's right. That's right. But I think that's one thing. When people got really angry, I think they thought it was a personal affront, that somehow I was questioning their ability to hear music or discern music or whatever. It's also the \"Emperor's Clothes\" gimmick, you know, that this was really the emperor's clothes. There was no real music there, and he was going to show me up by jumping on the stage and banging on the piano. But, you know, it never really made much sense to me. But that wasn't so bad as when people threw things at you.\nGROSS: (Laughter).\nGLASS: Now, that could be - now (laughter) - now, if they threw apples and oranges, that wasn't so great, but if they threw an egg, it isn't so bad because the eggs would just break. There was no danger from egg throwing, but - unless they boiled the eggs first, which they sometimes did.\nAnd I was - well, I was with Lucinda Childs. We were doing dance one time, and someone ran up to the stage and started throwing things at me. And I was with the dance company. And a not-boiled egg, a fresh, uncooked egg, was thrown up and hit a guy named Danny (ph) next to me. He was a dancer. And I looked over, and I saw this yellow suddenly appear on his costume. And he looked like he was going to cry. He was so upset. But on the other - why would you go to a concert with eggs unless you already knew you were going to throw them, right?\nGROSS: Yes, good point - boiled eggs - yeah.\nGLASS: I mean, someone that does that, they have - they're the ones with the agenda, not the artist.\nGROSS: So let me jump ahead. Your music now has been used in so many movies, and you've given so many performances. And it's even been used in TV commercials. So your music, which was so alien and even frightening to some people in the beginning, has become assimilated into America's musical vocabulary, into the world's musical vocabulary. And a lot of people copy it and have popularized it in their own idioms. Do you think about how your music has changed how people hear music or what they find acceptable and comprehensible?\nGLASS: The people have changed more than we've - than I've changed. But in the same way we were talking about painters before, someone like Jackson Pollock, when people would - you find his pictures in museums all over the place if people were lucky enough to have bought one. That happens all the time in painting and in music. I think the answer to the question, of course, isn't the question itself. And we both know the answer.\nWhat happens is that what seems strange and bizarre, after a very short period of time, starts becoming familiar. And whatever artistic rewards or secrets it might have become revealed, and - now, it depends. There was a certain amount of popularity that I have received, but in other circles, I never did receive. And there was a time when I was not even allowed to play in music schools. And if I played in a music school, I was usually invited by the dance department or some other department. And if I happened to be in the music building practicing, for example, I would see - could see a notice on the board showing the students that there was no need at all to come to hear me play that night. That went on for years. That has stopped simply because the young people who learn to like me or learned to like me are now the professors teaching in the schools (laughter). So we don't have that problem anymore.\nGROSS: I always think of there being something very obsessive about your music because of its repetitions and then variations on the repetitions and the speed of it and the precision of it. And I'm wondering if that's fair, to call - like, do you think of your composing or your performances as having an obsessive quality to them?\nGLASS: You know, that's a fair question. And I wonder whether - would people have said the same thing about Brahms or Chopin or - why is he playing that strange music? Why do we hear those chords over and over again?\nGROSS: You know why I think of it with you too because I think pattern is often a part of obsession, like, repeated patterns, shifts in patterns and...\nGLASS: Well, I certainly didn't - I didn't invent that. That's been around for a long time. I'm not sure exactly. I think it may have been also not just the music itself, but the way it was presented with the ensemble. You know, in amplified music, it could be interpreted as being aggressive. Though, that would only be true if you didn't know anything about popular music and that most popular music was already much more heavily amplified than anything that we did.\nGROSS: So you're telling me you're not OCD (laughter).\nGLASS: (Laughter). I'm not saying that either, but...\nGROSS: (Laughter). Well, are you? Are you?\nGLASS: No, I don't think so.\nGROSS: OK.\nGLASS: But how would I know?\nGROSS: (Laughter).\nGLASS: But anyway - but look, in order to play this music, takes - in order to play together, at least you have six, seven, eight people playing precisely together. It takes a lot of concentration, and the fierceness of the concentration might - itself could perhaps be off-putting. You know, at the theater, who are these crazy people who are counting all these numbers and playing this music, and what is that about? But over time, we got better at it, and we didn't look so crazy, maybe. But I'm not sure about that.\nI think when people first heard it - I mean, I remember the first time we played in Carnegie Hall. This was many, many years ago. And someone from the crew, who was - is long gone, he came up with a VU meter that tells you how loud the - and he said, look, if this VU meter goes above 90, we're pulling the plug on this concert. Now, we didn't come anywhere near 90, but the idea was that we were bringing amplified music into Carnegie Hall. They really thought the paint was going to peel off the walls.\nGROSS: If you're just joining us, my guest is composer and musician Philip Glass, and he has a new memoir called \"Words Without Music.\" Let's take a short break here, then we'll talk some more. This is FRESH AIR.\n(SOUNDBITE OF MUSIC)\nGROSS: If you're just joining us, my guest is composer Philip Glass, and he has a new memoir that's called \"Words Without Music.\" So some of your music education dates back to your childhood, and I'm not only talking about studying at the Peabody Conservatory when you were a child and then going to Juilliard. But your father owned a radio repair store that became, in part, a record store, and that introduced you to a lot of music. And I love the story about how - you describe how your father wanted to know what was selling and what wasn't selling and to understand why. So he'd take home a lot of records, and some records that weren't selling ended up being, like, contemporary music, you know, modern music, like a Bartok, Shostakovich.\nGLASS: Hindemith.\nGROSS: Hindemith, yeah, Stravinsky, and he loved it, but...\nGLASS: Well, he loved it because he'd listen to it 'cause he was trying to find out what was wrong with it. Now, he was not educated in music at all. But he figured if he listened to it long enough, he could figure out - but what happened, of course, is that he'd listen to it till he began to like it. And he became such an aficionado of contemporary music that in our little town of Baltimore, if you were looking for modern music you had to go to Ben's - you had to go to General Radio 'cause he's the guy that had it. And he became - with his favorite customers, he would pick - take a record and say here, Louie (ph), take this home and listen to it. If you don't like it, you can bring it back. He would push music off (laughter) on people, and I don't know how often I would see him do that. And he began to cultivate a taste for modern music in his customers.\nAnd of course, he cultivated it in myself as well. He was one of these guys that worked from 9 in the morning till 9 at night, but even as kid, I would be up at night sitting on the stairs behind him where he was having dinner or listening to music. I don't think he knew I was there, but I was listening to music with him. And eventually, I became - by the way, by the age of 15, I was a record buyer for the store.\nGROSS: That's pretty great. So part of your job when you were young at your father's store was breaking records because in order - he could return records to the label...\nGLASS: It was called the - it was called the return privilege. And those were the old 78s, you know?\nGROSS: Oh, the 78s, oh, OK. So the idea was if they were broken during the delivery process, they were returnable.\nGLASS: Yeah. That was our first job at the store. And it was on the weekends, and we would much have preferred to be outdoors playing around. But we were down in the basement of the store, jumping - my brother and I. My brother, Barton, and I - jumping on records so that we would then put them in boxes by label - Decca, Columbia, whatever the label was - those names don't even exist anymore. And we took out our - let's say, we were angry, actually, that we couldn't go outside and play. We had to break records, and we got over it by jumping on the records (laughter), demolishing them.\nAnd one thing we had to do - we had to make sure the label stayed on it. And by the way, Ben Glass, besides that, he discovered that there were other stores all through West Virginia and Virginia that had this same return privilege, but they never returned them. So he bought up their old records. I think he paid a nickel for each record, and he got a dime back from the company. So he had another little side business going on where he had his two sons breaking the records, then he would sell them back to the company (laughter).\nGROSS: So you started taking serious music lessons at a very young age. How old were you when you were taking lessons at Peabody? And you were the youngest student there.\nGLASS: Oh, maybe - well, I was the youngest student because they didn't have anyone teaching flute in the preparatory division, so I had to go to the conservatory. I was 7 or 8, I think, when I went. But that's a normal age for a young - young musicians start usually around 6 - 6 or 7. My parents thought music education was important. It never occurred to them that I would become a musician, and they were very disappointed at first and...\nGROSS: Well, they didn't want you to be a musician 'cause your uncle was a musician, and he was on the road all the time, not getting paid that well.\nGLASS: No, (laughter) that's in the book. The book begins with a conversation that my mother had with me when I was around 19. I'd come back from Chicago. It's a quote. She said if you go to New York and study music, you're going to end up like your uncle Henry, traveling from city to city and playing concerts all over the city. And I thought, my God, that sounds great.\n(LAUGHTER)\nGLASS: And of course, it turns out she was right; that's exactly what happened. I ended up being a performer mostly because I was inspired by people like Ravi Shankar, who was a performer and a composer, and the great jazz players, who were all composers and performers. And it meant a life of performing, and to me that sounded better than teaching, and that's what I wanted to do.\nGROSS: At age 15, you took the admission test for the Great Books Program in Chicago. Was that part of the University of Chicago?\nGLASS: Oh, yeah.\nGROSS: You got in. Your parents deliberated about what to do. They decided to let you go. What kind of adult supervision did you have in Chicago when you got to the university at the age of 15?\nGLASS: People that were 16 and 17.\n(LAUGHTER)\nGLASS: And of course, there was the faculty itself. But they were not interested in raising adolescents or having anything to do with us in that way. They were professional teachers. They weren't graduate students who had to teach undergraduates, which you often will find. And that doesn't mean they won't be good teachers, but we had amazing teachers at the University of Chicago. But the growing-up part was left to the kids.\nGROSS: So after doing the Great Books Program at the University of Chicago, you end up going to Juilliard, studying music there. You go to Paris to study with Nadia Boulanger, who was famous for her ability as a classical music teacher. And I'm wondering - you describe her as having helped you with a lot of technical skills and compositional skills, the tools that you would use to write your music. And I would love it if you could give us an example of an exercise or something that she taught you to do that you were able to draw on later.\nGLASS: Most of all, her work was based on Bach and Mozart and some Beethoven. Every week, I had three lessons - I had a private lesson with her, a group lesson with all of her students on Wednesdays. She had everyone who wanted to come that day, and that was an analysis class of maybe all the Mozart concertos in one year or maybe the Protestant views of Bach in another year. And there was a third class, which we called the Black Thursday class, which was - we were convinced that she took three of her best students and three of her worst students and put them together in one class. And the trouble was we never could figure out who was who.\nGROSS: (Laughter).\nGLASS: We all thought we were the worst, so it was - she was a fantastic teacher. And she could humble you and then at the same time could rescue you from the despair of being so incompetent as a musician. She would rescue you by giving you exercises that would then train you to overcome the handicaps which she had uncovered for you. So it was a very firm and unrelenting tutelage that went on with her.\nOne of the things that we did was every week, I had to learn one of the Bach chorales. I had to sing all four parts and play - I would sing one part and play the other three. And these were in three and four different clefts, by the way. So you had to read multi-cleft music and you had to - and you could - she would have an exercise sometimes where someone - she would write one line of music, and then the first time she sat down, you know, this is the tenor part. You sing the soprano part, and he would sing the soprano part. Now, we all knew it was coming, so we had to remember what he sang. And then she would say OK, Marco, you do the tenor part now.\nNow, Marco then had to remember what Daniel had sung. He could see that one line of music and then he had to sing the third form. Then she said, now the last part will be easy because you know what the first three are. But of course, that was true if you remember the first three (laughter). And then the last person had to sing the missing part and avoid all the parallelisms, which were all the forbidden movements of the voices that were part of the regime of writing this kind of music. So those could be terrifying experiences, however, what happened after several years of that, it got us - the amazing thing was that you found that you could do it.\nGROSS: Do you feel an affinity with Bach? Because I can hear an affinity, I think.\nGLASS: Well, she pounded it into my head. I mean, (laughter) I guess I have an affinity. And it came in very handy when I began writing opera sometime later on and I had a chorus singing and I had soloists. And being able to handle all those - that kind of accompaniment was - that's what that training - that kind of training is very, very good. It's called independence, being able to hear different parts separately.\nGROSS: My guest is Philip Glass. His new memoir is called \"Words Without Music.\" After a break, we'll talk about how studying yoga and meditation changed his life and music. And we'll talk about how his new music required a new approach to performing. I'm Terry Gross, and this is FRESH AIR.\n(SOUNDBITE OF MUSIC)\nGROSS: This is FRESH AIR. I'm Terry Gross back with composer Philip Glass. He's written a new memoir called \"Words Without Music.\" It's about his life and the new form of music he started composing, which was often called minimalist music, although Glass would disagree with the word minimalist. When we left off, we were talking about studying composition in Paris with the renowned teacher Nadia Boulanger. He decided to leave after two years, although she wanted him to stay longer. But before we get back to the interview, here's the opening of his composition \"Glass Piece Number One,\" a dance piece that was performed along with choreography by Jerome Robbins.\n(SOUNDBITE OF SONG, \"GLASS PIECE NUMBER ONE\")\nGROSS: So you leave Paris, you end up going to India, traveling through Central Asia, listening to all kinds of music that was new to you there. And you also started learning about what you describe as esoteric practices. These are various yoga practices, breathing and meditation practices. Talk a little bit about your interest in those practices and how...\nGLASS: Well...\nGROSS: And how they connect, if at all, musically for you.\nGLASS: Well, first of all, that began before then. I began when I was 20. A friend of mine and I, we had heard about something called yoga. We didn't know what it was. You have to remember, this is 1957 in New York, and there weren't yoga studios all over the place. In fact, we couldn't even find a yoga teacher. Well, we finally found someone by looking under Y in the telephone book, believe it or not. And there's a guy there named Yogi Butalis (ph), who turned out to be the teacher of Yehudi Menuhin, by the way, which I found out many years later. And we wanted to take lessons with him, and that's how we started doing yoga, and really didn't know anything very much about it at all. He also - at the end of the first lesson, he took me in the kitchen and said, I'm going to teach you how to cook now. He made me into a vegetarian immediately. And I've been a vegetarian for, my gosh - 57, 58 years I've been a vegetarian (laughter). And many of the things he taught me on that first day I still do.\nSo, Terry, it's important to understand that musicians generally are a very disciplined lot. The idea that we don't work hard or we kind of laze around in between concerts and then we just go up and we do these wonderful concerts as if there wasn't any work involved - that's something. What we really do is unknown to most people. Most musicians work very hard and they start early in the morning, they work all day. So that kind of activity fit in with everything else. You know, to be a performing musician into your 70s or 80s hopefully, there's a certain physical discipline, too. Many people are training that they train as if they were runners or as athletes. It's not that different.\nGROSS: How old are you now?\nGLASS: There's diet...\nGROSS: How old are you now?\nGLASS: I'm 78.\nGROSS: And you're feeling very fit in terms of being able to perform and travel?\nGLASS: I do, I do. And I do concerts - the concerts are 90-100 minutes long, and I do it without music. I mean I do it from memory.\nGROSS: So you did your travels through India and Central Asia with JoAnne Akalaitis, who was your wife. She's Catholic, and your father wrote you a letter saying never come home again. You're from a secular Jewish family. Your father - you describe him as having been an atheist. So did it make any sense to you that somebody who was basically an atheist would bar you from his home - from your family's home?\nGLASS: No. It made no sense at all, and it didn't last that long. I came back to New York a few years later. No, the next year I came back to New York, though I had been away for a few years. And a few years after that I was invited to come back. A cousin of ours arranged for me to come home, and I did meet him. We kind of got over that, but I was completely surprised by that. It took me a long time to figure out what that was about. I don't know if I ever I really did. But, you know, families are full of mysteries and some things that we never really understand. Sometimes we find out long after our parents have gone and we're left alone and we've become parents and we've become grandparents in fact that we begin to understand something of what they have been thinking about. That happened to me. Now I'm 12 years older than my father was when he died. That means I can see him as a younger man. Now that's interesting.\nGROSS: Yeah. And it's sad, you know, that just after the ban was lifted and you reunited with your father and your father met your children, he was killed in a hit-and-run accident, so you never had the chance to really talk to him about what had happened.\nGLASS: No, not really. We never talked about a lot of things. I went down to the store that - shortly after that, and I discovered that one of my records was in the store, which pleased me, but he hadn't told me. But he knew the music evidently. He had been listening to it. We didn't get a chance to do a lot of things, but that's - you know, that's the way life is sometimes.\nGROSS: So after your travels through Central Asia and India, you come back to New York, and you start composing music that ends up being Philip Glass music (laughter). And so...\nGLASS: Exactly (laughter).\nGROSS: I want to play an excerpt of one of your early pieces.\nGLASS: Please.\nGROSS: And this is \"Music In Contrary Motion.\" This is from 1969, and it's a solo piece. You're playing electric organ. So let's hear some of that.\n(SOUNDBITE OF SONG, \"MUSIC IN CONTRARY MOTION\")\nGROSS: So that's Philip Glass recorded in 1969, his piece \"Music In Contrary Motion.\"\nAnd is that really solo? It's just unimaginable to me that so much can be going on with just one person. It sounds like you have three hands? Like...\nGLASS: Oh, no. That's what's interesting about this so-called minimalist music is that - it's how rich it is. The description doesn't come close to telling you what you hear. That was all these - if you listen to it you'll hear - it'll seem like they're rhythms in the music that are being played or being stuck in the music, but they aren't really. It's just the result of the way the sounds work together when you play them very quickly together.\nGROSS: And there's something going on in the baseline in the left hand that is very in opposition to the kind of speedy contrapuntal or whatever it would be called lines that you're playing. And that low baseline, those slower notes sound like slow breaths beneath, like, supporting everything that's happening on top of it.\nGLASS: Well, that's of course my little finger of my left hand. That's what you're hearing. And...\nGROSS: With sustained from the organ, like from an organ panel?\nGLASS: I probably hold onto that note a shade longer than the other ones because I want the effect of that bass line. So the ways of playing that can bring out certain parts of it. The mechanical part of it is actually not what's happening. What's really happening is that this is - I'm not playing with a click track. I'm playing to my inner sense of rhythm. I'm making things longer and shorter and faster and slower. Also if you were to put a metronome on the performance, you would find it would be changing throughout the piece. It doesn't appear that way, but that's in fact what's happening. There's a lot of room for interpretation and for change and difference, even in a piece that's strictly repetitive as that one is.\nGROSS: And your left hand and right hand are kind of playing mirror images of each other?\nGLASS: Yeah, that's the contrary motion part, yeah.\nGROSS: My guest is Philip Glass, and he's written a new book about his life in music. It's called \"Words Without Music.\" Let's take a short break and then we'll talk some more. This is FRESH AIR.\n(SOUNDBITE OF MUSIC)\nGROSS: This is FRESH AIR. And if you're just joining us, my guest is composer and musician Philip Glass, who's written a new memoir called \"Words Without Music.\"\nGetting back to \"Music In Contrary Motion,\" which you played solo on organ, can you just describe what it feels like to play something like that piece at that speed? And that's like a 15-minute piece, so you're sustaining that for 15 minutes. There's a lot you have to remember. Your fingers don't stop. And I don't even know how you can breathe when you're doing something so fast and sustained and complex.\nGLASS: Well, you're putting a finger on exactly - what you have to develop is a - what we call a performance practice to go with this music. Now, if you think about it, for any music to be really new, there probably has to be a different performance practice to go with it, otherwise it wouldn't be new. What makes it new is that you have to find a new way to play, correct? We were playing electric keyboards, which only require a very light touch. They weren't like the acoustic pianos, where you have to dig your fingers in to make the sounds. You could just almost tap the keys and get the sound, so that we learned to play with a very light touch. I also learned to keep my breath very steady. I've - all of the things that you mentioned were things that had to be learned.\nWhen we first began playing this music, we didn't know how to do it. We taught ourselves. When I say we, I had a group of four, five people. We were together - maybe six altogether, eventually a singer - we became seven. We had two or three keyboards, two to three saxophones and one singer. And we got together, and we practiced. And eventually, we got really good at it. By '76, when we were doing \"Einstein On The Beach\" - we had begun this group maybe in '69 - but so six or seven years later of practicing and we had actually played fairly well. And we got actually very, very good at it. And the - we were able to play.\nFinally, I was no longer the music director. We got Michael Riesman to be music director. He was a much better musician than me in terms of practically keeping the band together. And he became the kind of conductor of the band, but it was really his left hand. We all listened to his left hand through the speakers, and we synced together with him. And we found that that was the way to do it. Now, this kind of performance was very exhilarating. We did a piece called \"Music In Twelve Parts,\" which was 12 pieces of music if you play them all together, which we still do these days. The whole evening takes about four and half hours (laughter). We took breaks, but it's a long evening with breaks in between. And it is a systematic study of this kind of music, and we got good at doing it. And it was very exhilarating, not only for us but for the audiences, too.\nGROSS: The foundation of some of your music is the arpeggio. And some of these arpeggios are pretty crazy - and maybe they're not technically arpeggios, but they sound like that. And I wonder why arpeggios are so imprinted in you.\nGLASS: Well, you'll find that in Bach and for the same reason because...\nGROSS: Yeah, that's why I was thinking of Bach earlier.\nGLASS: OK. The elements we talked - the elements of music being harmony - melody, harmony and rhythm, those were the three elements that we talk about. In the arpeggio, you have all three. You can - if you listen to the Bach unaccompanied violin pieces - it's just one line of music - you hear a melody, you hear a harmony and you hear rhythm all in one...\nGROSS: Right.\nGLASS: ...In the form of the arpeggio. So it becomes a shorthand, a way of getting the most of the smallest amount of music. So I guess that's true minimalism right there.\nGROSS: For people who don't know what an arpeggios is, would you just, like, sing an arpeggio or hum an arpeggio?\nGLASS: Well, I can't (laughter).\nGROSS: No? OK.\nGLASS: It would be (imitates arpeggio). Like I do was\n(singing) do mi so do so mi do.\nThat would be the solfege. And it would be - and if you listen to the left hand of a lot of the music of the Baroque, that's what you'll hear. You hear in the right hand, too. It's a - it comes up a lot in central European art and music because - for those reasons - because you could articulate the elements of music in a very compact form and build on that. You could build all kinds of things on top of it, which people like to do.\nGROSS: Because you couldn't make a living - a good enough living - with your music for several years, you did things like you had a moving van and had a moving business, furniture-moving business. You had a plumbing business for a while. You drove taxis for about five years. Did you ever worry about your fingers when you were doing - in moving furniture...\nGLASS: Yes, I did. And I ended up - I did. I got a lot of the - I also was an assistant for my friend Richard, Richard Serra, for a long time. I got worried about that, especially when I was doing - in those days, the plumbing business - you know the word plumb comes from the word lead, you know, it's the Latin word. And we used to - a lot of the work was done with lead, and it was hot lead. It was melted and you could - I was worried about my hands. And eventually, the safest place for me to be was either moving furniture, which is actually pretty safe and actually pretty good for you too - a lot of up and down stairs, carrying books - not a very interesting thing to do. In a way, the driving was the easiest one to do, but it was the most scary, too, because the city can be violent and the - any taxi driver will tell you that it can be scary.\nGROSS: Yeah, you said every night you'd have an adrenaline rush when someone would get in your cab, and you'd wonder if this was going to be your last night alive.\nGLASS: The last night (laughter).\nGROSS: So...\nGLASS: That could happen, yeah - not so much anymore.\nGROSS: ...Tell us one of those stories, though.\nGLASS: Well, these days we have partitions between the drivers, you know.\nGROSS: Right.\nGLASS: But in those days it wasn't there. But - oh, I remember I was taking a woman up to the Upper East Side in the - maybe 115th Street - somewhere in the East Side. And I was worried about taking her there. I said, are you sure you know where you're going? She said, don't worry, don't worry. Just take me to this address. And there are a lot of tricks in that you learn in the driving business. For example, when you come to an address, if there's a car in front, you don't go behind that car 'cause another car can get behind you and you're trapped, so you don't do that. But you also keep the doors locked, and I had my doors locked. And I got to - and I said, are you sure you know where you're going? And she said she was. And we stopped at that address, and she got out. And four guys leaped at the car and - each one of the doors. My front doors were locked. The back doors were open. I floored it. I mean, within seconds I was a block away. Two minutes later, I was on my way downtown, and I picked up another fare and kept going.\nGROSS: Gee.\nGLASS: I probably could have been dead that night. That's the kinds of things that can happen. I got out of that as soon as I could, but it wasn't - I was in my 40s when I did my last day job. You know, Terry, this is the story of being an artist in America, where you're a - you could be poet, you could be a dancer, you could be an actor. In those days, the garages were full of people who had - who were writers, and that's what it was.\nGROSS: Well, here's something I don't understand, like, so you nearly get killed on a fairly regular basis driving a taxi, but you keep doing it in part because you don't want to teach, yet the teachers you've had in your life have been so important to you. And I'm talking about music teachers, meditation teachers, yoga teachers, literature teachers made a deep and lasting impression on who you are as a person and as a musician and composer and yet you never wanted to do teaching yourself. Why not?\nGLASS: My mother was a teacher. I knew her friends. In those days, the people who came out of the - what we call the depression of the '30s, people who were trained to be engineers and different kinds of technical workers - we didn't have computers then, of course - they got jobs teaching 'cause there was no other work around. It was a very unhappy crowd of people that were teaching in the schools in those days 'cause they couldn't get the jobs that they wanted to have, so they ended up teaching. And my impression of teachers was that they were a pretty sad lot, and I didn't want to have very much to do with that.\nNow, the other thing was I didn't think I would have been a gifted teacher. I - the people I talked about were extremely gifted, and they knew how to teach, and they knew how to inspire, and they could implant a huge technical tracks inside of you. They knew the system of teaching. They knew the system of practice, and it was successful. I didn't think I had that talent. I was afraid that I would be one of those teachers who wasn't a very good teacher and the students wouldn't get very much from a person like me, so I decided I wouldn't do that. First of all, I didn't want to be in that company, and second of all, I didn't think I'd be good at it. And then there was another aspect to it, too. I really wanted to develop the independence, and I have that. I wasn't part of the academic world, and I never was.\nGROSS: If you're just joining us, my guest is composer and musician Philip Glass. He's written a new memoir called \"Words Without Music.\" Let's take a short break here, then we'll talk some more. This is FRESH AIR.\n(SOUNDBITE OF MUSIC)\nGROSS: This is FRESH AIR. And if you're just joining us, my guest is composer and musician Philip Glass. He's written a new memoir called \"Words Without Music.\"\nDo you ever think, in spite of the body of work that I'm famous for, I feel today like writing a simple song with an easy-to-sing melody and some nice chords behind it?\nGLASS: (Laughter) I feel that all the time.\nGROSS: Do you write it?\nGLASS: I'm always trying to - I'm trying to. I'm writing an opera right now for the Washington Opera, and I'm always looking for clarity and simplicity. It doesn't come easily to me.\nGROSS: So I've got to ask you this. Since you and Ira Glass are cousins or second cousins, do you have...\nGLASS: No, that's...\nGROSS: ...Childhood memories of him?\nGLASS: Oh yeah, but he was younger than me. My father's brother was his grandfather. And when his grandfather was no longer around to be part of that family, my father - we'd go over to ours - to his father's house, Barry's house and play with the kids. So Ira told me that when he was 8, he thought my dad was his grandfather. And we -it was a very close family. We were all Glass's. And I'd lost touch with him for a while, and he turned up again in Chicago. I got to meet him again there when he was a grown up, and now he's in New York so I see him quite a lot.\nWe actually have a lot of fun talking about family Glass stories together. Now, there are people that I knew that he didn't know when I told him stories and he told me things. And his sister actually recently gave me pictures of my father and my sister from 1942 that they had. So there's a lot of - we actually know each other.\nGROSS: So you write in a very moving way about several people who you've been very close to who died and you were present for the death - your mother, Allen Ginsberg and one of your wives. And you write about that moment where the breathing has stopped, the heart has stopped, but there's still energy in the body. And you don't consider the person dead until that energy has left and how you tried to sit there until the energy was gone. And reading that, it just made me wonder because of the way you've witnessed the deaths of people close to you and because of your, like, spiritual and meditation and yoga practices, what kind of afterlife do you want for your body? Like, do you want to be buried? Do you want to be cremated? Like...\nGLASS: I'm not so interested in that so much. But I've had other thoughts about that lately, which are quite interesting ones. I've thought of the lineage of music that goes way into the past and the future of music, which we thought - we hope will go on to the future and what does - where does my life fit into that? And I think that just expressing it that way - what is the meaning of an artist's life or of anybody's life?- of a doctor's life or a teacher's life or a radio interviewer's life? (Laughter). What is the meaning of that?\nAnd I'm more and more coming to the idea that it's the lineage and the connections with the past and the connection to the future. That is the real connection. Everything else I think is kind of imaginary. Do we got to - is there a heaven that is waiting for us or some afterlife of some kind? We have no idea. And in fact, it's not even important. The important thing is - was how are you connected to the past? How does that represent not only continuity, but does it bring us closer to something that's richer, that's more interesting? Does - what have we brought to the world and what do we leave behind us and what does the future have for us? And the future may be in - it's in our children, it's in our friends, it's in our work. It's all around us. I find that the most reassuring - when we contemplate this living and dying, that really misses the point. It's not the living and dying, it's the continuity of the lives that's important.\nGROSS: Philip Glass, thank you so much for talking to us today. Thank you for your music.\nGLASS: Well, thank you, Terry.\nGROSS: Philip Glass, recorded in April. His memoir is called “Words Without Music.” Tomorrow, I’ll ask a neurosurgeon about what it’s like to cut into the brain knowing that the jelly-like matter is the home of the patient’s emotion, reason and memory. My guest will be with Dr. Henry Marsh. His new memoir, “Do No Harm,” describes some of his most challenging cases, the triumphs and failures, and reflects on the state of his profession and the mysteries of consciousness.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=408776056"}
