{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:06:06","date_modify":"2018-10-30 22:06:06","date_publish":"2016-12-15 00:00:00","description":"'There has never been an online-only bank that has succeeded in America or Britain,' says Vernon Hill. 'Maybe there’s one coming, but we haven't seen one yet.'","filename":"data/vaneerConsumption/ThefounderofMetroBankthinksapponlybanksareallhype.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_metro-bank-founder-vernon-hill-app-only-banks-neobanks-all-hype-2016-12_1540937166.html","title":"The founder of Metro Bank thinks app-only banks are 'all hype'","title_page":"    Metro Bank founder Vernon Hill says app-only banks are 'all hype' - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"App-only bank Monzo. Monzo LONDON — The founder and chairman of UK challenger bank Metro Bank has dismissed the boom in digital-only banks in Britain as \"all hype.\"\nVernon Hill told Business Insider in an interview: \"That's all hype. There has never been an online-only bank that has succeeded in America or Britain. Maybe there's one coming, but we haven't seen one yet.\n\"Look at it this way, we passed 6 years, we just started making money, and our market cap is £2.6 billion. We've created a total growth machine. These people are selling you 'solutions', not banking.\"\nBritain has seen a surge in new banks since the financial crisis, including Metro Bank which started in 2010. The last 18-months has seen a boom in digital, app-only lenders. They include Atom, Starling, Monzo, Tandem, and Tide. These startups, collectively dubbed \"neobanks,\" have attracted hundreds of millions of pounds in investment between them.\nInvestors and entrepreneurs believe that they can tap into a generation shift to mobile and a more long-term shift in the entire population towards online services.\nBut Hill says: \"I agree [there's a shift to mobile] but you have to remember, what's our number one job in life? To acquire new customers. We've got to get you to switch banks. The store is the way we do that and the store is the public face.\n\"No mobile-only bank can deliver anything I can't deliver in the next minute and a half. What they're offering you is a tool, not a solution. The customer wants the best of every channel and my job is to deliver them the best of every channel.\"\nMetro Bank founder and chairman Vernon Hill with his dog Duffy. Metro Bank Hill told Business Insider in an interview this week that expanding Metro's branch network across the UK is crucial to growth plans at the business, targeting 100 stores by 2020.\nBut he added: \"We want to have the best of every delivery channel, we want to have the channels united together with the stores and deliver a unified experience.\"\nMetro Bank has partnered with peer-to-peer lending platform Zopa to offer loans and recently announced a project with Deloitte and startup SETL to develop a contactless card that uses blockchain technology. Hill says the bank is open to more partnerships like these to extend its digital capabilities.\n\"We have a big advantage in banking in Britain,\" he says. \"British banks have IT systems that are one step above a quill. We have the only modern IT bank system in Britain. Whatever new fintech idea comes along, it's relatively easy for us to get it up and running.\"","url":"https://www.businessinsider.com/metro-bank-founder-vernon-hill-app-only-banks-neobanks-all-hype-2016-12"}
