{"authors":["Wolf Richter","Wolf Street"],"date_download":"2018-10-31 00:09:56","date_modify":"2018-10-31 00:09:56","date_publish":"2018-07-12 00:00:00","description":"Producer prices rose by 3.4% in June. This data will work its way into consumer price inflation and add to it, pointing to a more hawkish Federal Reserve and faster-than-expected interest rate hikes.","filename":"data/vaneerConsumption/TheFedisgearinguptohikeratesfasterthanexpected.json","image_url":"https://amp.businessinsider.com/images/5b47a2237439162a008b48ac-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-fed-is-gearing-up-to-hike-rates-faster-than-expected-2018-7_1540944596.html","title":"The Fed is gearing up to hike rates faster than expected","title_page":"    The Fed is gearing up to hike rates faster than expected - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Chairman of the Federal Reserve nominee Jerome Powell testifies during his confirmation hearing before the Senate Banking, Housing and Urban Affairs Committee November 28, 2017 on Capitol Hill in Washington, DC. Alex Wong/Getty\n\"In June, most of the rise in the index for final demand is attributable to a 0.4-percent advance in prices for final demand services,\" said the Bureau of Labor Statistics in the release of its Producer Price Index data. The PPI and its numerous sub-indices measure inflation further up in the pipeline before it filters through to consumer prices.\nServices account for 65.3% (\"relative importance\") of the PPI. Energy prices soared, but they account for only 5.6% of the PPI. In the overall picture, services matter the most.\nThe PPI for \"final demand\" (as opposed to \"intermediate demand,\" which is further up the pipeline) jumped 3.4% in June compared to a year ago, the largest year-over-year increase since November 2011. This measure includes goods and services:\nWolf Street\nThe PPI for final demand energy jumped 17.2% in June compared to a year ago. Note the deep plunge of the index during the Oil Bust. But for consumers, this was a \"transitory\" relief, to rephrase Yellen: Wolf Street\nThe PPI for final demand goods — includes energy but excludes services and has a relative importance of 33% — rose 4.3% from a year ago. May (+4.4%) and June marked the sharpest increases since December 2011:\nWolf Street\nThe PPI final demand for goods without food and energy, which has a relative importance of 21.7%, rose 2.6% from a year ago, the largest year-over-year increase since March 2012:\nWolf Street\nOver the past few months, even the PPI for final demand services has begun to move higher. Due to its relative importance in the index of 65.3%, it matters! It jumped 0.4% from May to June and is now up 2.8% year-over-year. This and the March increase of 2.9% are the largest year-over-year increases in this data series going back to 2011:\nWolf Street\nThis inflation data balling up in the pipeline will work its way into consumer price inflation and add to it. Already, different measures of consumer prices have been on the rise:\nPCE price index without food and energy, the Fed's favorite: +2.0% in May.\nPCE price index with food and energy: +2.3% in May.\nConsumer Price Index:+2.8% in May; we're eagerly awaiting the June release.\nAt the Fed, even the last doves are coming around.\nInflation \"looks quite good,\" Chicago Fed President Charles Evans told the Wall Street Journal. Consumer price inflation whittles down the purchasing power of labor - and for companies, the cost of labor - and only someone focused on whittling down the purchasing power of labor and the cost of labor could call rising inflation \"quite good.\" But that's the twisted system we're in. He was one of the last remaining \"doves\" on the policy-setting FOMC and voted against the rate hike last December.\nNow he has changed his tune. The economy is strong enough to where businesses and consumers \"can live with more neutral financial interest rates,\" he said.\n\"And so we're raising short-term interest rate policy in a gradual fashion, and I think the markets understand this quite well,\" he said. \"Whether or not you think we should do it three times in 2018 or four times in 2018, it's really not going to make a big difference.\"\nThat's quite a change for someone who voted against the rate hike six months ago.\nAnd where is \"neutral?\" In the eye of the dove, it's \"100 basis points away\" - so four more rate hikes to a target range of 2.75% to 3.0%, and that's just neutral. Anything above that would be tightening. Evans' idea of \"neutral\" for the Fed's target range will likely be reached in the first half next year. For other Fed governors, \"neutral\" maybe higher. Wherever \"neutral\" is, the higher it is, the more rate hikes it takes to get there. And when it's reached, at that point, the discussions about \"tightening\" commences.\nInterest rates are rising, and are expected to rise further, and these rising interest rates have a peculiar effect.","url":"https://www.businessinsider.com/the-fed-is-gearing-up-to-hike-rates-faster-than-expected-2018-7"}
