{"authors":[],"date_download":"2018-10-30 01:22:36","date_modify":"2018-10-30 01:22:36","date_publish":"2016-07-05 05:00:35","description":null,"filename":"data/vaneerConsumption/TheFirstDayofSchoolAgain.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/07/Trump_with_supporters_in_Iowa_January_2016_2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862556.html","title":"The First Day of School, Again","title_page":"The First Day of School, AgainThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"It’s a staff meeting! A real staff meeting! I love these things.\nWe don’t have very many these days and they’re nothing but good. We get to see T in the flesh. He’s mostly out and about, of course. Lives in that damn plane. Now we get him in the Tower for forty minutes and he’s all ours. And we learn who he’s hired and what they’re supposed to be doing. The new guys introduce themselves in one of those let’s-go-around-the-table deals. It could be important someday that we know these people, if only briefly. And finally, we get to see what the consultants have done to T since we saw him last.\nThe word is that the five-thousand-bucks-a-day guys have been teaching T the finer points of “open listening.” In real life, when forced to sit through a staff meeting, or meet with an actual voter, T frowns and his face falls into a bored, when-am-I-outta-here mask. With open listening, the idea seems to be, you nod agreeably, smile slightly, encourage the other person to share his or her feelings in a kind of cone of collegiality. (It’s the full BJC, as we refer to the former president, who, as Corey would have said with anchorman emphasis, did not have sex with that woman, Ms. Lynch, on her airplane.) Open listening sounds good to me. One reason T hates staff meetings is that he has to pretend he’s interested in the views of others, which offends his sense of the natural order of things.\nT’s obviously been doing his homework, but it will take a while to catch the rhythm. When the fundraising lady announces services for her brother, who was killed in an auto accident over the holiday, it’s not the right time, frankly, for T to be nodding and smiling. But he’ll get the hang of it. He says he’s a quick study.\nThe meeting is chaired by Paul M, who may or may not be any good, but he’s a genius at personal PR. He’s persuaded the entire press corps that he’s a Manager of the Year candidate, the hefe who will finally provide adult supervision, even though Mr. Google can’t identify a single bigtime campaign he’s ever won, not counting those third-worlders of tyrannical stripe, that is.\nGod, I miss Corey. When he left, I experienced a real sense of personal loss. All that assiduous butt-kissing down the dumper. Damn, six months of my life I’ll never get back. But one thing about Corey — he knew his place. He knew he wasn’t managing some dumbass political campaign. He was tour director for the Greatest Show on Earth and he lived by the roadie’s watchwords: success is when everybody gets paid and nobody gets killed. Amen to that. I wonder what CNN will do when they find out that Corey isn’t withholding details of The Plan to capture the nomination. There was no plan.\nStaff changes consume the bulk of the meeting. Kellems is gone, apparently. A pretty sharp guy, if I have the right one — the thin guy from Indiana, not the fat guy from Alabama. But his shirt might have been buttoned a bit too tight. With T, you just have to embrace the chaos, man.\nAnd we have a bunch of new guys, one of them, I think his name is Murphy, described as a “Dole guy.” Now that’s just plain unfair. Why not call him a “Dirksen guy”? Or maybe they mean he’s a powerful lobbyist for the pineapple cartel. If he’s still here next week, I’ll check him out.\nAnd — tada! — we have a new Senior Political Adviser, a guy named Biundo from Rand Paul’s organization. Let’s see, with the two Millers — Steve from Jeff Sessions and Jason from Ted Cruz — and myself, that makes four Senior Political Advisers. (That we know about.) I guess T will be holding our coats while we duke it out. In the interim, he’ll be getting plenty of senior political advice. (Jeesh. Can you imagine a man like T taking any junior political advice?)\nAnd — tada!, tada! — we have a new pollster, a voluble blonde named Conway. I’m unfamiliar with her work, but I can guess how she was hired. Because he never reads anything, T not only watches TV, he believes it. Somebody, maybe Hannity, must have said Conway is a heckuva pollster. Everybody welcomes Conway with a round of applause, except our guy, Fabrizio, who looks like he’s just swallowed a week-old fajita. I know that look: it says, “Hey, I thought I was the pollster.”\nThe meeting then dribbles away in a debate over whether to book Mike Tyson as a convention speaker. The pros say he’s a great athlete and world famous. The cons say his ghetto mumble is incomprehensible to white folks. The pros say he’s a real black, not some affirmative action black. The cons say he’s a rapist. And so it goes, back and forth. As usual, T will have to make the tough decision.","url":"https://spectator.org/the-first-day-of-school-again/"}
