{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:41:32","date_modify":"2018-10-30 21:41:32","date_publish":"2016-01-28 12:40:49","description":"The Family Dog is officially back in business in Morningside.","filename":"data/vaneerConsumption/TheFamilyDoginMorningsideopensagain.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/01/28/Images/WPIMAGE_cmgajcfoodandmore_6428.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_th_431329f2f9bd07f76698b47e6b50a8e2__1540935692.html","title":"The Family Dog in Morningside opens, again","title_page":"The Family Dog in Morningside opens, again","title_rss":"NULL","source_domain":"ajc.com","text":"The Family Dog is officially back in business in Morningside. The announcement came Wednesday afternoon via the neighborhood bar and restaurant's Facebook page: \"We're baaackkkk! We will officially open today at 4pm! Help us spread the word ATL!\" And a neon open sign could be seen in a photo posted with the message.\nFormer owner, Ron Eyester, the chef/owner of Diner in Atlantic Station and founder of Grateful Tables restaurant group, confirmed the closing and pending sales of his two original Morningside/ North Highland Ave. restaurants, Rosebud and the Family Dog in Oct. 2015.\nIn Nov. 2015, Benjie Shirah and South Capital Partners confirmed that his group had closed on the property and would be reopening the Family Dog under the same name, with an extensive remodel and a new menu.\nTom Murphy and the team behind Murphy’s in Virginia-Highland and Paces & Vine in Vinings acquired the Rosebud space in Nov. 2015, with plans for a new concept slated to open in 2016.\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook and following Atlanta Dining on Twitter.\nRead the AJC Fall Dining Guide, Atlanta Around the Clock, here.","url":"https://www.ajc.com/blog/atlanta-restaurants/the-family-dog-morningside-opens-again/uXPhqsg2ikwiFk2LtR2eLN/"}
