{"authors":[],"date_download":"2018-10-30 01:03:11","date_modify":"2018-10-30 01:03:11","date_publish":"2014-11-11 09:00:00","description":null,"filename":"data/vaneerConsumption/TheFalloftheBerlinWall.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/11/800px-President_Reagan_giving_a_speech_at_the_Berlin_Wall2C_Brandenburg_Gate2C_Federal_Republic_of_Germany._June_122C_1987.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861391.html","title":"The Fall of the Berlin Wall","title_page":"The Fall of the Berlin WallThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"November 9 marked the 25th anniversary of the day the Berlin Wall cracked and Communist East Germany and its Kremlin overseers silently acknowledged Cold War defeat. As East and West Berliners began tearing the Wall to pieces, they began the dicey process of post-World War II German reunification.\nTwenty-first century Germans believe that process is complete. Or at least they did. Current events may have tempered celebrations in Germany and throughout what was Communist-controlled Eastern Europe. On that same day in 1989 the dangerous and now demonstrably incomplete process of USSR dissolution commenced. The Kremlin’s current czar, Russian president Vladimir Putin, regards the Soviet Union’s dissolution as a historical tragedy. Many Eastern Europeans see Putin’s March 2014 annexation of Ukraine’s Crimean peninsula as a signal that the Kremlin intends to regain military control of Ukraine and the Baltic States.\nNATO nations whose troops for some four decades defended Western Europe from Communist Russian attack also commemorated the Wall’s demise, as a moment of joy and immense relief more than victory.\nThe Wall’s fall mattered for everyone who understood the Cold War’s stakes and risks. The stakes were freedom versus tyranny. The Cold War risks in Western Europe were manifold, but they included escalation from a conventional firefight to global thermonuclear war.\nWhich is why I stress joy and relief. Those were the emotions that flooded me on Nov. 9, 1989, as I saw video of East and West Berliners clasping hands and weeping. Where were the border guards? Berliners said the East German border police had disappeared — they had refused to shoot. Then the crowd surged. Within a couple of hours, guitars replaced Kalashnikovs. I recall TV footage (the reporter said he was live in East Berlin) of a gleeful young man whacking the Wall with a sledgehammer.\nIn the mid-1970s I served for almost three years in Germany as a U.S. Army lieutenant. A year of that time was spent in an armored cavalry unit assigned to patrol what diplomats politely called “the intra-German border.” East German guard towers on pillars, wire fences and mine fields split the Thuringian Forest in our sector. These obstacles were the Wall extended. Now a German smashes the Wall with a sledgehammer? Something has changed, for the better.\nNote I refer to the damned thing as the Wall. If you pulled a European tour of duty in the U.S. military, the “Berlin” usually disappeared. Soldiers knew what you meant, even if they had never served in the U.S. Army’s Berlin Brigade or taken the train to West Berlin.\nSo did Germans — at least the West Germans I ran into.\nMany West Germans were once East Germans. A German friend’s mother had left East Germany before it was East Germany. She had fled what was the Soviet Union’s Zone of Occupation for the French, British or American zone — which one didn’t matter.\nUntil Germany officially reunified in October 1990, Berlin retained elements of this post-World War II administrative artifact. East Berlin was the Soviet-occupied zone. West Berlin combined the French, British, and U.S. sectors.\nThe East German government began constructing the Wall in 1961 (and later added the border obstacles my unit observed) for one evil reason: to imprison its own people. Why? East German citizens were leaving, by the millions. East Germany was losing its citizens. Before the Wall, defecting to West Germany was relatively easy for an East German. Before the Wall — and its subsequent intra-German border wire and guard tower offspring — over 3.5 million East Germans went west. Located deep within East Germany, West Berlin was the most convenient port of entry.\nThe Wall’s cement barriers, barbed wire, anti-vehicle obstacles and anti-personnel mine fields were built to keep East Germans inside East Germany.\nA few hardline left-wing bien-pensants still preach a U.S.-USSR Cold War equivalency. The Wall’s cold facts reveal them for what they are: liars. No surprise — some of them have become Putin apologists.\nCOPYRIGHT 2014 CREATORS.COM","url":"https://spectator.org/60940_fall-berlin-wall/"}
