{"authors":["Rebecca Patton"],"date_download":"2018-10-31 01:41:04","date_modify":"2018-10-31 01:41:04","date_publish":"2018-09-14 20:30:52","description":"Spoilers ahead for all of BoJack Horseman Season 5. BoJack Horseman (Will Arnett) is sad. It's his defining characteristic, and nowhere is this better depicted than in BoJack Horseman Season 5's \"Free Churro.\" His mother has died, and the…","filename":"data/vaneerConsumption/TheFreeChurroEpisodeOfBoJackHorsemanNailsWhatItsLikeToGrieveSomeoneWhoWasntEvenGoodToYou.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/018179b1-a02a-4e23-89ec-9514aefc63b9-bojacks5_ep6.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-free-churro-episode-of-bojack-horseman-nails-what-its-like-to-grieve-someone-who-wasnt-even-good-to-you-11899214_1540950064.html","title":"The “Free Churro” Episode Of ‘BoJack Horseman’ Nails What It’s Like To Grieve Someone Who Wasn’t Even Good To You","title_page":"The “Free Churro” Episode Of ‘BoJack Horseman’ Nails What It’s Like To Grieve Someone Who Wasn’t Even Good To You","title_rss":"NULL","source_domain":"bustle.com","text":"Spoilers ahead for all of BoJack Horseman Season 5. BoJack Horseman (Will Arnett) is sad. It's his defining characteristic, and nowhere is this better depicted than in BoJack Horseman Season 5's \"Free Churro.\" His mother has died, and the protagonist delivers an incredibly long-winded eulogy, only to discover that he's in the wrong room (the lizard audience should have tipped him off, but alas). Through this monologue, audiences get a glimpse into BoJack's grieving process, grappling with the awful person his mother was and wondering why he's still heartbroken. And while it's angry and unorthodox, his reaction is perhaps the best he can do, given his abusive upbringing.\nBoJack's method of mourning, which is punctuated by jokes and cruel jabs at his mother, is contrasted in Episode 7, when Mr. Peanutbutter (Paul F. Tompkins) realizes that his mother didn't just go to a farm. \"My dear mother has transcended this plane,\" he tells the cast of Philbert, distraught. \"I am incredibly fragile and could use all the support I can get.\" He is open and vulnerable, affectionate and sad. BoJack, meanwhile, tells everyone to leave him alone, when he really wants the same things Mr. Peanutbutter is comfortable asking.\nBoJack keeps returning to several themes during his speech: the first being a Jack in the Box that he stopped at on the way over. When the girl at the counter asked him if he was having \"an awesome day,\" he replied that his mom died. She began to cry, and he got a free churro. \"No one ever tells you when your mom dies, you get a free churro,\" he tells the funeral parlor. He later says that this gesture was nicer than anything his mother had ever done for him.\nNetflix\nThe actor also returns to the last words his mother said to him in the hospital: \"I see you.\" He speculates as to what this meant: Was it just that she literally saw him? Could it be more meaningful — that she truly understood him? Was it a more sinister, \"I'm watching you\"? Or perhaps she just meant that she was in the ICU. The third theme he returns to is derived from the eulogy his mother gave at his father's funeral. \"My husband is dead, and everything is worse now,\" he recalls her saying.\n\"Beatrice Horseman. Who was she? What was her deal?\" BoJack says. \"Well, she was a horse. Uh, she was born in 1938, she died in 2018. One time she went to a parade, and one time she smoked an entire cigarette in one long inhale! I watched her do it. Truly a remarkable woman.\" And in that, the actor sums up all he knows about his mother.\nNetflix\nIt's clear from previous seasons that BoJack has a less-than-stellar relationship with his parents. His father was a jaded author who wrote a single, terrible book, and his mother was bitter that her husband had deprived her of the lavish lifestyle she wanted. Beatrice took out this anger on her son, and now, BoJack is forced to send her off with a loving eulogy. Instead, he makes it about himself and the ways she's wronged him — the ways she failed to express her love.\n\"I kept waiting for that,\" he says. \"The proof that even though my mother was a hard woman, deep down, she loved me and cared about me and wanted me to know that I made her life a little bit brighter. Even now, I find myself waiting.\" The closest that BoJack got to his mother was in Season 4, Episode 11, \"Time's Arrow.\" She was suffering from Alzheimer's by that point, and her son comforted her with the lie that she was really at the family lake house in Michigan.\nNetflix\nWhat's more, his mother's death forces BoJack to come to terms with his own mortality. In Season 5 more than ever before, he is confronted with the realization that he's a bad person. With the parallels between Philbert and his own life, Diane (Alison Brie) finding out about what happened on the boat in New Mexico, and him literally strangling Gina, the horseman can no longer blame his parents for all of his problems. Viewers also find out this season that BoJack has never attended therapy or entered rehab before. But perhaps his mother's death is one of the reasons he allows Diane to drive him to a facility at the end of the season. He's realized that his legacy will be the same as his parents if he doesn't change his trajectory, and that terrifies him.\n\"Knock once if you're proud of me,\" BoJack jokes as he addresses his mother's casket. There is, obviously, no answer. His mother is dead, and everything is worse now.","url":"https://www.bustle.com/p/the-free-churro-episode-of-bojack-horseman-nails-what-its-like-to-grieve-someone-who-wasnt-even-good-to-you-11899214"}
