{"authors":["Andrew Meola"],"date_download":"2018-10-30 22:10:44","date_modify":"2018-10-30 22:10:44","date_publish":"2016-12-15 00:00:00","description":"With the rise of mobile and shift to online banking, today's banks need to be more innovative than ever to compete with the growing number of fintech banking companies. What is the future of banking?","filename":"data/vaneerConsumption/THEFUTUREOFBANKINGGrowthofinnovativebankingfintechservices.json","image_url":"https://amp.businessinsider.com/images/58504254a1a45e46008b5861-1536-768.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-future-of-banking-growth-of-innovative-banking-fintech-services-2016-12_1540937444.html","title":"THE FUTURE OF BANKING: Growth of innovative banking fintech services","title_page":"    THE FUTURE OF BANKING: Growth of innovative banking fintech services - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII Banking is a rapidly changing industry, and the biggest paradigm shift that has occurred is the move to digital-only banks.\nMillennials, in particular, are moving more frequently toward digital banking. And as a result, they're walking into their banks' traditional brick-and-mortar branches less often than ever before.\nThis generation represents the greatest share of the U.S. population at 26% and the employed population at 34%, so it's clear that their behaviors and preferences will have a profound effect on the future of the banking industry, particularly with regard to the way banks interact with their customers.\nThis shift to digital banking has come in many forms. Traditional powers such as Bank of America, JPMorgan Chase, Wells Fargo, and more have released mobile banking apps to let customers manage their accounts from their smartphones. And some startups have taken this approach one step further by creating digital-only banks that completely remove the need for a physical branch.\nBelow, we've outlined some of the key points on future banking and mobile banking, including the future of investment banking, innovations in online banking, and how these new players plan to grow financial electronic banking.\nBanking Is a Rapidly Changing Industry\nDigital-only bank Ally launched in the U.S. in 2008 and at the time, it was one of the first of its kind. But multiple new players have entered the scene in the last few years. These include Monzo, Tandem, N26, and Fidor in Europe, along with Digibank in India and B1NK in Kazakhstan.\nThese banks hold key advantages over traditional institutions, such as freedom from historical tech restrictions and the fees associated with brick-and-mortar branches. And in many nations, financial regulations also help these banks flourish. In Europe, these digital-only banks will soon be able to access customer data from traditional banks.\nFurthermore, new players can almost always offer better rates and lower fees to customers, and these banks typically provide innovative services that can more easily be tailored to individual customers' needs.\nAnd yet, digital-only banks face major problems in terms of customer acquisition as more of them flood the market and customers hesitate to leave a well-known, established bank for a startup. As a result, they haven't yet posed a true threat to legacy banks.\nBI Intelligence\nInnovation Banking\nAs fintechs have flooded the scene and disrupted the financial industry, traditional banks have had to innovate in order to stay ahead of the pack.\nCorporate investors, specifically traditional players, have started to increase their fintech investments in the last couple of years. This trend is likely to continue in the coming years as incumbents try to stake their claim to the most innovative fintech startups.\nOn top of this, the biggest banks have already set aside major resources to digitize their businesses. In fact, more than 40% of North American banks have dedicated more than 25% of their IT budget to digital transformation. This can include developing new consumer-facing products and services and modernizing core transactional systems.\nTo achieve this goal, most traditional banks will use third-party suppliers or will acquire fintech startups for education and mutual benefit.\nHigh Growth in Mobile Banking\nThe payments segment is much more mature than other fintech areas, and a small handful of companies now dominate the business-to-consumer (B2C) space in particular.\nPayPal is the undisputed leader in digital payments in the U.S. and Europe, while Apple Pay and Android Pay have taken over the top spots for in-store mobile payments all around the world. Furthermore, Alipay and WeChat are the top players in China.\nThe remittance space has also exploded thanks to companies such as TransferWise, which has been valued at over $1 billion, as well as Remitly, WorldRemit, and Azimo. And digital-first Xoom makes more revenue from electronic channels than 75-year-old MoneyGram, the second-largest remittance company in the world.\nDigital-Only Banks\nWe touched on digital-only banks in a previous section, but there is still much more to cover. As stated earlier, these banks have the advantage of flexibility and the ability to offer innovative services at much lower rates than legacy players. But these startups often struggle with customer acquisition, particularly amid competition.\nIn North America, banking customers have shown a greater willingness to switch banks. In fact, 11% switched providers in 2015, and 19% of those went to a bank with no brick-and-mortar branches. But there is an important caveat here.\nThere are very few options for digital-only banks in the U.S. but in Europe, the options are plentiful. Digital-only banks across the pond are competing both with legacy banks and with each other for customers. So in order to lure clients away from their existing bank, they have to offer a significantly better product than their competition.\nAs a result, these digital-only players have yet to pose a true threat to the Bank of Americas and JPMorgan Chases of the world. Their products are still too new, and customers are still hestitating to take the risk of letting a startup manage their money. But these banks are gaining ground in the U.S., and upcoming regulation in Europe will help digital-only banks spread their influence in that region. Therefore, legacy players must improve their offerings in order to stay ahead.\nDigital-Only Bank Names to Know\nNumber of Employees: 11 to 50\nTotal Funding: $17,699,015\nOne Thing to Know: U.K. digital-only mobile bank Monzo was founded as Mondo in 2015.\nNumber of Employees: 1 to 10\nTotal Funding: $70,000,000\nOne Thing to Know: Amazon Web Services named Starling Bank as one of its four Hot Startups to watch in November 2016.\nThe Street\nNumber of Employees: 1,000 to 5,000\nTotal Funding: N/A\nOne Thing to Know: Ally Financial went public on April 10, 2014\nNumber of Employees: 101 to 250\nTotal Funding: $34.8 million\nOne Thing to Know: Digital-only bank Tandem has an official banking license with the Bank of England.\nNumber of Employees: N/A\nTotal Funding: N/A\nOne Thing to Know: Groupe BPCE acquired the Munich-based web bank on July 28, 2016.\nNumber of Employees: N/A\nTotal Funding: $2 million\nOne Thing to Know: Tide claims it can get you a business MasterCard in just three minutes.\nNumber of Employees: 101 to 250\nTotal Funding: $52.73 million\nOne Thing to Know: Famous Silicon Valley investor Peter Thiel has backed the company, which obtained a full German banking license in July 2016.\nNumber of Employees: 251 to 500\nTotal Funding: $15.29 million\nOne Thing to Know: Simple has more than 100,000 customers and processed $1.7 billion in annual transactions in 2015.\nNumber of Employees: 11 to 50\nTotal Funding: $166.34 million\nOne Thing to Know: Atom users can log in to the mobile banking app using facial recognition.\nMore to Learn\nInnovation in banking merely scratches the surface of the fintech industry, which is growing in unprecedented ways.\nThat's why BI Intelligence spent months compiling the best and most exhaustive guide on the world of fintech entitled The Fintech Ecosystem Report: The Emerging Technologies and Firms Driving Change in Financial Services and How Legacy Players Can Navigate The Disruption.\nTo get your copy of this invaluable guide to the payments industry, choose one of these options:\nSubscribe to an ALL-ACCESS Membership with BI Intelligence and gain immediate access to this report AND over 100 other expertly researched deep-dive reports, subscriptions to all of our daily newsletters, and much more. >> START A MEMBERSHIP Purchase the report and download it immediately from our research store. >> BUY THE REPORT\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of the fast-moving world of financial technology.","url":"https://www.businessinsider.com/the-future-of-banking-growth-of-innovative-banking-fintech-services-2016-12"}
