{"authors":["Andrew Meola"],"date_download":"2018-10-30 22:17:07","date_modify":"2018-10-30 22:17:07","date_publish":"2016-12-14 00:00:00","description":"The explosive growth of the financial tech industry continues in 2016. Stay up to date with the latest fintech industry trends and investments report.","filename":"data/vaneerConsumption/THEFINTECHREPORT2016Financialindustrytrendsandinvestment.json","image_url":"https://amp.businessinsider.com/images/577d6c1d88e4a778008b6472-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-fintech-report-2016-financial-industry-trends-and-investment-2016-12_1540937827.html","title":"THE FINTECH REPORT 2016: Financial industry trends and investment","title_page":"    THE FINTECH REPORT 2016: Financial industry trends and investment - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence The explosive growth of the financial technology industry continued in 2016 thanks to new financial industry trends and a slew of fintech investments.\nThese different financial services industry trends have given rise to a host of new financial service products that are poised to change the way consumers deal with their banks.\nBI Intelligence, Business Insider's premium research service, has compiled a detailed finance report on this subject entitled The Fintech Ecosystem Report: The Emerging Technologies and Firms Driving Change in Financial Services and How Legacy Players Can Navigate The Disruption.\nBut below, we've highlighted some of the key trends from this report to give you a better understanding of the future of fintech growth.\nPayment Services Industry Trends\nGlobal fintech funding continues to grow. After it hit $19 billion in total in 2015, worldwide fintech funding hit $15 billion by mid-August 2016. The U.S., Europe, and the Asia-Pacific (APAC) region led the way in attracting the most fintech investment.\nAccelerators and incubators set up by legacy players and their tech partners are encouraging this growth, as these programs place fintech companies on the cutting edge of business ideas, along with a first-mover advantage if they want to invest in or acquire startups.\nFintech funding surged throughout 2016 thanks in large part to tremendous funding rounds by Chinese fintechs, along with expanding interest in new fintech areas such as insurtechs (more on those later). And yet, the geography of fintech funding has changed in the last year, specifically the rise of China and the move of European investments out of London.\nFurthermore, the sources of this funding are changing. VCs historically dominated fintech funding, but many of the largest rounds in the first half of 2016 (including Ant Financial's enormous $4.5 billion round) were private. And corporate investors are starting to increase their investments either in competition or coordination with VCs.\nBII\nBanking Fintech Trends\nMany new retail banks are foregoing brick-and-mortar branches and standard ATM networks in favor of services delivered exclusively online and through apps. Digital-only bank Ally launched in the U.S. in 2008, but a slew of new players has entered the market in the last few years. These include Monzo, Tandem, N26, and Fidor in Europe, along with Digibank in India and B1NK in Kazakhstan.\nThese banks have several advantages over legacy players, such as freedom from historical tech restrictions and the costs tied to brick-and-mortar branch networks. And in many nations, financial regulations also help these banks flourish. In Europe, these digital-only banks will soon be able to access customer data from traditional banks.\nFurthermore, new players can almost always offer better rates and lower fees to customers, and these banks typically provide innovative services that can more easily be tailored to individual customers' needs.\nAnd yet, digital-only banks face major problems in terms of customer acquisition as more of them flood the market and customers hesitate to leave a well-known, established bank for a startup. As a result, they haven't yet posed a true threat to legacy banks.\nInvestment & Stock Fintech Trends\nBar none, robo-advisors are rapidly becoming the biggest disrupter in the investment and stock space. BI Intelligence forecasts that robo-advisors will manage $8 trillion in global assets by 2020.\nRobo-advisors have started to settle into three distinct models, but they all have the same goal. Standalone firms such as Betterment (the most popular U.S. robo-advisor) use algorithms to recommend stocks and manage portfolios. These types of companies often target everyday consumers who don't invest, and they often have low minimums and fees as a result.\nHybrid robo-advisors combine computerized recommendations with on-demand advice from a human being. Legacy companies, such as Vanguard's Personal Advisor, typically offer products like this for existing investors.\nAnd finally, advanced standalone firms use more complex algorithms to create and actively manage portfolios. Companies such as Scalable Capital use this model to target wealthier investors.\nBI Intelligence\nInsurance Fintech Trends\nInsurtechs have started to prosper because the insurance industry has not been in too much of a rush to modernize when compared to the rest of the financial services industry. This is due to multiple factors, such as capital requirements and increasingly complex regulations.\nBut as these barriers have started to dissolve, insurtechs have stepped in to fill the gap and seize the opportunity. VC-backed funding for insurtechs grew 225% between 2014 and 2015, which made this one of the most active segments in fintech.\nInsurtechs fall into two categories: disruptive and enabling. Disruptive insurtechs are licensed to underwrite and issue their own policies. These companies (such as Oscar and the wildly successful Lemonade) are more capable of taking business away from traditional players. Consider Zhong An, China's first digital-only insurance provider that has already written 630 million policies since it launched in 2013.\nEnabling insurtechs, meanwhile, encompass most of the companies in the space. These businesses work in conjunction with legacy insurance companies to optimize the traditional players' operations and help them reach customers through new distribution channels.\nThanks to the predominance of the enabling type, insurtechs are more likely help modernize the insurance industry rather than threaten its existence.\nCurrency & Markets Financial Services Trends\nWhen we think of currency, markets, and fintech, the term \"blockchain\" immediately springs to mind. The technology, best known for powering Bitcoin and other cryptocurrencies, is gaining steam among finance firms because of its potential to streamline processes and increase efficiency. Blockchain could cut costs by up to $20 billion annually by 2022, according to Santander.\nFintechs that focus on blockchain continue to gather plenty of investment, and legacy players are conducting live experiments with the distributed-ledger technology. At first bitcoin and its peer cryptocurrencies were the focus, but the attention and the dollars have shifted to blockchain startups because the technology is actually more attractive for use in financial services. Blockchain can accelerate and automate transactions, create multiple copies of a ledger simultaneously, and enhance transaction security.\nBII\nFinancing Industry Trends\nFintech firms that specialize in payments were the some of the first to attract funding, and in turn, customers adopted many of their products first. Companies such as TransferWise (remittances), Stripe (payment gateways), and Mobikwik (mobile payments) all disrupted the financing industry in the early days.\nThe payments segment is much more mature than other fintech areas, and a small handful of companies now dominate the space. PayPal is the undisputed leader in digital payments in Europe and the U.S., while Apple Pay and Android Pay have taken over the top spots for in-store mobile payments. Finally, Alipay and WeChat are the top dogs in China.\nAnd yet, some of these fintechs are struggling with profitability and have adjusted course as a result. TransferWise, for example, pivoted away from its original peer-to-peer model as it expanded into markets where payments primarily flow in one direction.\nThe business-to-business segment has not yet reached its full potential, with a few exceptions (such as Stripe). A tremendous opportunity for B2B fintechs in payments still exists, but many companies in this space have thus far been considered too small to be profitable customers for legacy players.\nMore to Learn\nThere are far more trends to uncover in the fintech space, which should only continue to grow in the next few years.\nThat's why BI Intelligence spent months compiling the best and most exhaustive guide on the world of fintech entitled The Fintech Ecosystem Report: The Emerging Technologies and Firms Driving Change in Financial Services and How Legacy Players Can Navigate The Disruption.\nTo get your copy of this invaluable guide to the payments industry, choose one of these options:\nSubscribe to an ALL-ACCESS Membership with BI Intelligence and gain immediate access to this report AND over 100 other expertly researched deep-dive reports, subscriptions to all of our daily newsletters, and much more. >> START A MEMBERSHIP Purchase the report and download it immediately from our research store. >> BUY THE REPORT\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of the fast-moving world of financial technology.","url":"https://www.businessinsider.com/the-fintech-report-2016-financial-industry-trends-and-investment-2016-12"}
