{"authors":[],"date_download":"2018-10-30 00:52:23","date_modify":"2018-10-30 00:52:23","date_publish":"2016-02-18 09:00:00","description":null,"filename":"data/vaneerConsumption/TheFedsInflatedReputation.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/02/1024px-Washington_D.C._-_Federal_Reserve_0001-0003_HDR.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860743.html","title":"The Fed’s Inflated Reputation","title_page":"The Fed’s Inflated ReputationThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The Federal Reserve Bank, commonly referred to as “The Fed,” has a policy to inflate the dollar by 2% annually. This is an absurd policy, which undermines our currency. The methods the Fed uses to achieve this policy distort and undermine sustainable economic growth.\nThe Fed was established in 1913 as the Central Bank of the United States, for the purpose of maintaining a stable banking system and supporting sound money. But the opposite has happened. Since the founding of the Fed, the dollar has lost more than 90% of its value.\nThe Fed manipulates the money supply with artificially low interest rates to create inflation. This policy enables the federal government to expand deficit spending without the penalty of market interest rates. But interest is a cost that is important to sound business calculations; a sound economy requires financial reality.\nBy manipulating rates, the Fed undermines all economic decisions and creates market distortions. This manipulation results in economic bubbles that are challenging to detect, until it’s too late. These bubbles can take many forms, such as over-priced common stocks, or high-priced commodities and hard assets, such as real estate.\nThe Fed’s policies severely undermine the middle class by making goods and services more expensive. For example, an average American family loses $700 in purchasing power if inflation is 2% annually.\nMany workers do not receive a 2% raise yearly; as a result, their standard of living declines. Families recognize this problem when they buy groceries and household staples. And politicians who promise to help the middle class support this insidious wage-reduction policy. Inflation has very little visibility, but slowly, like negative compound interest, it reduces the buying power of every citizen.\nThe Fed’s near-zero interest rates also deny every citizen and saver a market return on their savings. As recently as the mid-1960s, a savings account would yield about 3% interest, encouraging savings. In recent years, the return on CDs and bank savings has been almost nothing. This policy discourages savings and investment, and, for many Americans, it undermines their standard of living.\nFurthermore, the Fed has an abnormal concern about deflation (“a decrease in the general level price level of goods and services”), which is why it established a policy to inflate the dollar. But deflation can be good. It results from greater efficiency, competition, and innovation —the stock-in-trade of American industry. Our standard of living is dependent on deflation of costs. Over the past 200 years, the country’s entrepreneurs have figured out how to design and manufacture products at lower cost. Americans have prospered from the declining price of goods, most notably since the Industrial Revolution. Historical data prior to the Fed’s creation in 1913 indicate that both the dollar and prices were stable (despite the deflation of some goods and services).\nCurrently, voters recognize the precipitous decline in gas prices; this is deflation on a large scale. This deflation hurts the oil industry, but it results in a huge saving for all drivers. Gas prices are 50% lower today than two years ago. This is very good deflation, because it allows consumers to save and to improve their standard of living. The next time a politician talks about the declining middle-class standard of living and the diminishing purchasing power of wages, think Federal Reserve Bank.\nThe Fed, nothing more than a board that fixes the price of short-term interest rates, establishes interest rates below market rates that create economic bubbles — in energy, stocks, and real estate — that eventually burst and cause devastating recessions and market crashes, like that of 2008. We have not fully recovered from the 2008 recession, but the next recession is already developing from the Fed’s interest rate price fixing. If businesses or industries in the private sector did the same, their leaders would face jail time. The Fed acts with impunity.\nRather than worrying about deflationary danger, the Fed would do the economy a great favor if it allowed the market to determine short-term interest rates. This would end the continuous speculation about future Fed policies and allow citizens, government, and business to make sound, sustainable economic decisions. The market adjusts precipitously, which means we could rapidly return to a sound, sustainable marketplace.\nLastly, the Fed’s manipulation of interest rates is the prime enabler of big government, which leads to massive deficits and a $19 trillion national debt. The Fed should focus on reducing its massive $4.5 trillion balance sheet, without creating a recession.\nAmericans are very capable of exceptionalism, but their success is challenged when the Fed distorts market prices by artificially manipulating interest rates.","url":"https://spectator.org/65503_feds-inflated-reputation/"}
