{"authors":["Max Margan For Mailonline"],"date_download":"2018-10-23 01:53:40","date_modify":"2018-10-23 01:53:40","date_publish":"2016-01-29 16:06:29","description":"Most European pickpockets work in groups and use distraction methods to rob unsuspecting tourists at popular attractions.","filename":"data/vaneerConsumption/ThefiveEuropeancitieswhereyouaremostlikelytobepickpocketed.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B3EB4700000578-0-image-a-11_1454083573509.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3423066_The-five-European-cities-likely-pickpocketed-avoid-victim_1540259620.html","title":"The five European cities where you are most likely to be pickpocketed","title_page":"The five European cities where you are most likely to be pickpocketed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The pickpocket gangs of Europe are masters of their trade – and they can ruin a holiday.\nMost European pickpockets work in groups and use distraction methods to rob unsuspecting tourists at popular attractions.\nHere are the five European cities that, according to a 2009 TripAdvisor study, are places to be especially aware of conniving pickpockets - and tips on how to avoid becoming a target.\nBarcelona\nMore than 300 thefts are reported every day in tourist hotspot Barcelona and Las Ramblas (pictured) is where many occur\nWith its stunning Catalan architecture and immaculate coastline, it is no wonder Barcelona is one of Europe’s top tourist destinations.\nBut more than 300 thefts are reported every day in this spectacular city, earning itself the reputation as the pickpocket capital of the world.\nYou can become a victim anywhere in Barcelona, but thieves particularly target Cathedral Square, Las Ramblas, Plaza Catalunya and Plaza Real.\nParis\nParisian police with bicycles at watch over tourists. The city, one of the world's most-visited, is teeming with pickpockets\nParis is one of the world’s most visited cities, but the tourist attractions which make the ‘city of love’ famous are teeming with pickpockets.\nThe Eiffel Tower was closed for a day last year after staff went on strike demanding help to deal with thieves operating around the landmark.\nThe Louvre, the world’s most visited museum, was closed in 2013 also because of strikes related to pickpockets targeting tourists and employees.\nFrench police launched a major operation targeting pickpocket gangs last year.\nMadrid\nPlaza Mayor in Madrid is a place where tourists must always keep their belongings secure\nWHAT TO WATCH OUT FOR The bottleneck Most pickpockets work in teams. Be wary when in crowded areas, keep your passport close and keep it safe. The cover-up Some pickpockets play the role of the lost tourist, extending a map in front of them. They then approach an unsuspecting tourist, and with the map providing a shield, delve into a bag and steal from the tourist. The distraction One of the group of pickpockets distracts the victim, while another leans in to steal possessions. Common rouse's can be asking for directions or asking if they have lost something. The hugger mugger A thief will act the drunken fool outside the pub, hugging people in a clever ploy. Then a quick dip into the trouser pocket and the unsuspecting tourist is passport-less. Key tip: don't put your passport in the back pocket.\nMadrid, the second Spanish city to make MailOnline Travel’s top five, is home to the infamous ‘Bosnian clan’.\nFour women who form the notorious pickpocket gang made a name for themselves in Barcelona – where they robbed thousands of tourists and Metro users – before moving on to Madrid.\nIn 2013 the gang was banned from all of Madrid’s underground network, before the ban was overturned on a legal technicality.\nPickpocketing on the Madrid Metro dropped by 40 per cent while the restraining order was in place.\nThe Metro, the Plaza Mayor and Cibeles Square are prime target areas for Madrid’s thieves.\nPrague\nCharles Bridge (pictured), Karlova Street, Old Town Square and Wenceslas Square are often targeted by thieves in Prague\nTRIPADVISOR'S FIVE TIPS FOR AVOIDING PICKPOCKETS 1. Never keep your wallet or valuables in your rear pocket, even if it buttons - it's by far the easiest target. 2. Beware of the distraction tactic. Dropping something near you, squirting something on you, or simply jostling you. Be on guard when in crowds, and secure your belongings. 3. Pickpockets often work in pairs or groups and it's not just the usual suspects. Be cautious with any strangers – sometimes people who don't look like they'd be a threat, such as children or the elderly, can be part of larger operations. 4. Stay alert in confined spaces and near passageways. Try to avoid standing near the doorways of trains as groups of pickpockets can rush at you when the doors open. 5. Before you set off on a trip, pare down the contents of your purse or wallet as the smaller the bulge, the less likely pickpockets are to covet it.\nThe pickpockets of Prague commonly target public transport, particularly the routes to and from Prague Castle and other major tourist sites.\nCharles Bridge, Karlova Street, Old Town Square and Wenceslas Square are also chosen areas for pickpockets and scam artists.\nUnlike most cities renowned for pickpocket gangs, here thieves usually work as individuals.\nRome\nPiazza Cavour (pictured) in Rome is where pickpockets sometimes congregate\nThe British Foreign Office describes pickpocketing as ‘endemic’ in Rome.\nIn this spectacular city, pickpockets congregate where the tourists are, in particular around the Vatican, the Spanish Steps and the Colosseum.","url":"https://www.dailymail.co.uk/travel/travel_news/article-3423066/The-five-European-cities-likely-pickpocketed-avoid-victim.html"}
