{"authors":[],"date_download":"2018-10-30 01:10:49","date_modify":"2018-10-30 01:10:49","date_publish":"2018-06-29 00:10:55","description":null,"filename":"data/vaneerConsumption/TheFishyPracticesoftheCatfishLobby.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/06/FMIB_38366_Unarmed_Eremophilus_1_Pimelodus_of_the_Volcanos_2.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861849.html","title":"The Fishy Practices of the Catfish Lobby","title_page":"The Fishy Practices of the Catfish LobbyThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Someone asked to make a list of lobbyists with the worst reputations on Capitol Hill probably wouldn’t add “the catfish lobby” in a million years. In fact, “the catfish lobby” sounds much more like the entrance to an exhibit at your local Natural History museum. But lobbyists for the domestic catfish industry are some of the most nakedly anti-competition out there.\nNow, you may ask why it matters. But the catfish industry is bigger than you may think. It’s the largest aquaculture industry, meaning the cultivation of aquatic plants and animals for food, in the United States. The catfish industry is particularly important to Mississippi and Alabama, which together accounted for around 87 percent of all catfish sales in the United States in 2017.\nBack in the 2008 Farm Bill, the catfish lobby pushed to transfer the inspection of imported catfish from the FDA, which inspects all other kinds of imported seafood, to the USDA. Sure, the switch would cost taxpayers $200 million over the next decade, but can you put a price on food safety?\nWell, it turns out, you can. Particularly when that $200 million, according the Government Accountability Office (GAO), provides absolutely no benefit. The GAO found no justification for transferring catfish inspection to the USDA, noting that the FDA had been performing seafood inspection just fine up to that point, and even suggested that splintering seafood inspection services could have negative consequences for food safety.\nWhy then? Put simply, to throw a regulatory hurdle in the path of seafood importers. Since most seafood importers don’t just import one kind of fish, transferring catfish inspection to the USDA means that they have to comply with an entirely different regulatory regime just to import one kind of fish. As former head of FDA food safety David Acheson puts it, “This restriction is based on regulatory differences between USDA and FDA that does not make the product safer, just more difficult to import.”\nFor many, it makes more sense to just stop importing catfish at all. I spoke with Mike Mitchell, co-founder and CEO of Acari Fish, a seafood company that produces and distributes fish jerky and filet products.\nAcari began as a way to turn a negative into a positive. The “devil fish,” or armored catfish, is an invasive species of fish that had been plaguing the waters of the Mexican state of Tabasco, wrecking the local ecosystem. Mitchell sought to make a company out of fishing “el pez diablo” and selling products from it.\n“We were riding high after winning a couple awards and securing big time clients in the U.S. for our jerky and fillet. We were on the verge of importing truckloads of our fish when we came across the catfish provision,” says Mitchell. “The catfish provision has put an incredible damper on our business.”\nCompanies like Mitchell’s are not even the target of the catfish provision, which sought to curtail competition from Vietnamese catfish imports. “What’s frustrating is that our fish doesn’t look, feel, or taste anything like the fish being fought over nor does it serve the same market,” says Mitchell. But the provision covers all 3,000 or so kinds of siluriformes, or catfish.\nThe President’s budget for this year proposed ending this wasteful form of protectionism by returning catfish inspection to the FDA, saving taxpayers a little over $2.5 million next year, as had the previous Administration in its budgets. With the President behind the change, Congress has no excuse not to place catfish inspection back in the purview of the FDA.\nWith Congress buried in the Farm Bill process, now is the time to put this provision in the dustbin of history. It would be hard to justify the catfish provision on policy grounds, and Congress shouldn’t try. Simply stop caving to the demands of an anti-competitive lobby, and make food safety regulation do what it’s supposed to do — keep food safe, not out of the country.","url":"https://spectator.org/the-fishy-practices-of-the-catfish-lobby/"}
