{"authors":[],"date_download":"2018-10-30 14:27:48","date_modify":"2018-10-30 14:27:48","date_publish":"2014-06-13 00:00:00","description":null,"filename":"data/vaneerConsumption/TheFruitinNogalesStinketh.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2014_06_the_fruit_in_nogales_stinketh_1540909668.html","title":"The Fruit in Nogales Stinketh","title_page":"The Fruit in Nogales Stinketh","title_rss":"NULL","source_domain":"americanthinker.com","text":"Let’s apply that simple formula to what is going on down on the border as an army of illegal immigrant minors are being encouraged to overrun the U.S. The result of the lawlessness the federal government is enabling and even financing has resulted in an out-of-control mess, where warehouses are packed with destitute youths spreading third-world diseases and, while waiting for refugee resettlement at the Nogales Placement Center in Tucson, Arizona, are purportedly indulging their hormonal desires with unabashed enthusiasm.\nJesus gave His disciples a simple recipe to evaluate good and bad circumstances when He pointed out that “[a] good tree cannot produce bad fruit, nor can a bad tree produce good fruit.”\nIn other words, the tree, which in this case is the Obama administration and its immigration policy, is deformed and diseased, and therefore the fruit in Nogales stinketh, and it stinketh bad.\nPredictably, rather than accept blame for the foul-smelling fruit, the Obama administration is blaming violence in Central America for the uncontrollable influx of \"refugees.\" However, a veteran Border Patrol agent who heads the agency’s Tucson sector union says stories of official pardons are what’s driving the startling tsunami of illegal immigrants into the U.S.\nArt Del Cueto, the Tucson Border Patrol union president, says that when they interrupt border-busting fornicators and ask them what drove them to cross over from Mexico into the U.S., the word they’re hearing is “amnistía\" (amnesty).\nRotten fruit from a rotten tree served up as charitable concern is rotten all the same, and what a coincidence it is that right around the time Obama predicted that amnesty would be accomplished one way or another, there is suddenly a crisis on the border that requires emergency attention!\nThe Obama technique is to foster larger crises, so this time it’s by waving in busloads of illegals with the goal of bringing an already volatile situation to a boiling point so that Cloward-Piven strategic solutions can be employed and emergency amnesty granted straightaway.\nThe child migrant crisis is clearly being orchestrated by an administration careful to never let a good crisis go to waste, be it manufactured or not. That’s why the community agitator is encouraging the fruit to rot by blaming violence in Central America for what he calls an “urgent humanitarian situation.”\nAlabama Senator Jeff Sessions, senior member of the Senate Judiciary Committee, recognizes that the unprecedented emergency unfolding at the border is happening because Obama is “committed to escalating” the situation.\nAccording to Sessions, “[t]his crisis is a direct and predictable result of the president’s sustained and deliberate campaign to dismantle immigration enforcement.” Sessions rightly pointed out that Obama has broadcast to the larger third world that lawlessness is acceptable and that immigration laws will not be imposed on foreign youth.\nMeanwhile, a Homeland Security source alleges that “it’s all over the news in Central America that if you bring your kids north you have a free pass.” Up close and personal to the rancid fruit in the Nogales facility, a DHS source says that “[t]he entire thing can be pinned squarely on the Obama administration and its policies” and warned that “[i]t’s going to get much worse.”\nWhy? Because in countries like El Salvador and Honduras, newspapers are reporting that the amnesty offered to illegal immigrants who came to the U.S. as minors under Deferred Action for Childhood Arrivals (DACA) is being extended two more years. Signed by Barack Obama in 2012, the policy eliminates the threat of deportation for at least two years while granting provisional legal status to the young schemers Obama likes to call DREAMers.\nCentral American news sources are also quoting DHS Secretary Jeh Johnson, who said, “Almost all agree that a child who crossed the border illegally with their parents, or in search of a father or a better life, was not making an adult choice to break our laws, and should be treated differently than adult violators of the law.”\nBut according to Mr. Del Cueto, “[t]hey’re not all little kids. Some are 17-years-old and they have possible ties to gang members yet they will be relocated in the U.S. with family.”\nMaybe Mr. Del Cueto should ask Mr. Johnson if he considers joining a gang or copulating on a warehouse floor after illegally crossing the border into another country an adult decision. And what about that copulating? Doesn’t the party Jeh Johnson proudly identifies with believe that when disposing of the possible result of fornication, it’s an adult choice that requires no parental notification?\nNevertheless, officials speaking on behalf of the bad tree that’s producing the bad fruit insist that the obviously uncontrolled situation is under control. Those officials assure us that the sexually active illegal alien minors with scabies, measles, chicken pox, and MRSA will be put in removal proceedings because they do not qualify for the president’s DACA, the program that grants amnesty to those who came to the U.S. as children “through no fault of their own.”\nThe truth is that thousands of sometimes sickly children from Honduras, Guatemala, and El Salvador will never be extradited, and some who have criminal backgrounds, while being “processed,” will be released onto the streets of the U.S., diseases and all. It’s a given that, once released, “unaccompanied children” will never be followed up on again, and if they are, Obama is proposing a very expensive program called Justice AmeriCorps that, while veterans die on VA waiting lists, will offer some of those copulating on collapsible cots in Nogales free legal help to stay in the country.\nAll the same, Jesus did offer advice on how to deal with rotten trees when He said: “Every tree that does not bear good fruit is cut down and thrown into the fire.” Hopefully, the noxious harvest that Obama is producing on the border will inspire Americans to chop down and throw into the political fire the rotten tree whose roots are presently choking the life out of America.\nJeannie hosts a blog at www.jeannie-ology.com.","url":"https://www.americanthinker.com/articles/2014/06/the_fruit_in_nogales_stinketh.html"}
