{"authors":[],"date_download":"2018-10-30 00:52:29","date_modify":"2018-10-30 00:52:29","date_publish":"2017-02-13 00:04:55","description":null,"filename":"data/vaneerConsumption/TheFreeMarketIsComingforPharma.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/02/Senator_Mike_Lee_5894187979.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860749.html","title":"The Free Market Is Coming for Pharma","title_page":"The Free Market Is Coming for PharmaThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Scratch a “conservative” defender of the pharmaceutical industry on the topic of drug prices, and you’ll generally hear an argument formulated something like the following:\n“High drug prices are just the free market at work. Who are we to judge how much a piece of life-saving technology is worth?”\nWere the market for drugs truly free and competition open, this line of reasoning would be hard to argue with, at least from the Right. However, as anyone with a basic understanding of pharma’s abuse of the patent system, or of the anti-competitive ban on drug importation, or any of a number of other policies will tell you, nothing of the sort is true. If anything, high drug prices are a result of specific government policy: something that decisively argues against the notion that the market for drugs is in any way free.\nBut fortunately, after this week, it just might get closer to being free. That’s because this week, Sen. Mike Lee (R-UT) will take the first step to curtail drug prices using the very thing that big pharma fears most: competition. Specifically, Lee is going to introduce a bill that takes square aim at pharma’s capacity to shut generic drugs out of the marketplace: something that has been integral to its anticompetitive business model for eons.\nTo explain the bill, known as the Creating and Restoring Equal Access to Equivalent Samples (CREATES) Act, a quick thought experiment is necessary: Imagine that you wanted to open a hamburger joint. However, the only way you could get a recipe for the sandwich was for your would-be restaurant to pass a health inspection conducted not by the government but by the head of McDonald’s.\nIt doesn’t take a market forecaster to predict how many hamburger chains would open (aside from McDonald’s) under such a regime. Yet this is precisely this Kafkaesque situation that would-be generic drug manufacturers face when trying to manufacture generic versions of existing drugs. This is because, under a little-known government program called the Risk Evaluation and Mitigation Strategies (REMS) program, the FDA basically outsources the job of figuring out which generic drug manufacturers are planning on making safe products to the very pharmaceutical companies whose formulas those manufacturers will need to start production.\nGranted, the program explicitly forbids companies from denying access to their formulas solely on the basis of stopping lower-cost alternatives from entering the market. However, this ban is hard to enforce, and it’s no stretch to imagine pharmaceutical companies concocting spurious reasons to deny access to their formulae, just as they concoct spurious reasons to extend their patents. And as it stands, the only remedy that possibly exists is antitrust litigation, which is almost no solution at all, since many cases are difficult-to-impossible to prove.\nEnter Mike Lee’s version of the CREATES Act, which sets out specific and much easier conditions for generic manufacturers to meet when crying foul over anticompetitive behavior by Big Pharma, while offering a means of resolving the dispute that is less costly than antitrust suits for everyone involved. Pharma, of course, howled bloody murder about the bill, claiming it would permit rogue snake oil-style generic manufacturers to gain access to their formulas with the threat of lawsuits and regulatory interference. And to be fair to the industry, a previous version of the bill introduced last year was vulnerable to these charges.\nHowever, where that bill went after REMS abuses with a hammer, Lee’s targets them with a scalpel. For example, Lee’s bill explicitly limits the extent to which brand name pharmaceutical companies can be sued in cases where their generic accusers can be proven not to have used adequate safety measures. Pharmaceutical companies can also escape liability, if they can prove that generic companies could’ve gotten access to formulae through other, commercially viable means. In other words, this is a bill aimed at increasing competition with pharma but only provided that the would-be competitors are playing by the rules, not cutting corners, and acting in good faith.\nNot only is such an approach commonsensical; it is deeply, unquestionably conservative. The balancing act in Lee’s bill between ensuring that generic manufacturers meet the standards to produce the drugs and also making sure that Pharma follows the rules and permits competition when they do is emblematic of a timeless tension within conservative thought. That is, it pays special attention to balancing the free market (by encouraging competition) with the rule of law (by curtailing abuses by all sides).\nGranted, pharma will likely still oppose the bill, and one probably shouldn’t have expected anything else from the architects of Obamacare, which wasn’t exactly a strong bill for either freedom or the rule of law. And in that regard, Lee’s bill is also doing an important service: It is smoking out the anticonservative nature of an industry that conservatives have been willing to accept uncritically as an ally for far too long.\nA more prudent iteration of pharma might understand this and support the bill. However, if they prove unlikely to be so prudent, then one can thank Mike Lee and the CREATES Act for destroying not only pharma’s credibility but the corporate welfare-driven pricing regime with which they have held so much of America hostage.","url":"https://spectator.org/the-free-market-is-coming-for-pharma/"}
