{"authors":["Alexis Rhiannon"],"date_download":"2018-10-31 01:51:29","date_modify":"2018-10-31 01:51:29","date_publish":"2018-08-27 16:41:58","description":"Big Little Lies may not be returning for Season 2 until 2019, but there is some consolation — the first official footage of Meryl Streep in Big Little Lies is here, and it's already proving worth the wait. The iconic actor appeared for just a second…","filename":"data/vaneerConsumption/TheFirstFootageOfMerylStreepInBigLittleLiesWillSendTheBestKindOfShiversDownYourSpineVIDEO.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/fdaabce5-418f-47f0-a62e-08f6573ccac7-screen-shot-2018-08-27-at-90705-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-first-footage-of-meryl-streep-in-big-little-lies-will-send-the-best-kind-of-shivers-down-your-spine-video-10244399_1540950689.html","title":"The First Footage Of Meryl Streep In 'Big Little Lies' Will Send The Best Kind Of Shivers Down Your Spine - VIDEO","title_page":"The First Footage Of Meryl Streep In 'Big Little Lies' Will Send The Best Kind Of Shivers Down Your Spine — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Big Little Lies may not be returning for Season 2 until 2019, but there is some consolation — the first official footage of Meryl Streep in Big Little Lies is here, and it's already proving worth the wait. The iconic actor appeared for just a second or two in a new HBO promo video that was released Sunday, but even just that one glimpse is an embarrassment of riches. The promo was, unfortunately, not a Big Little Lies teaser, but rather one for all of HBO original shows, crowded with teasers from True Detective, Veep, and even Game of Thrones. But somehow Streep stood out anyway, holding her own even against the sneak peek of Daenery Targaryen and her dragons from the final season of Game of Thrones.\nIt's a hard field to stand out in, but it should be no surprise that Streep is managing it, even with only a brief blip of screen time. It was previously announced that the 69-year-old would be brought onto Big Little Lies Season 2 to playing Mary Louise Wright, mother to Alexander Skarsgård's character Perry, and thus mother-in-law to Nicole Kidman's character Celeste. And while exact plot details aren't yet known, The Hollywood Reporter claimed that Mary Louise is in town to check in on her grandchildren and get some answers about what happened to her son. It's a reasonable motivation that should make total sense to anyone who remembers the events of BLL's Season 1 finale. Spoilers for Season 1 of Big Little Lies ahead.\nHBO on YouTube\nAs fans hopefully will recall, Perry died at the end of last season, and he was physically, emotionally, and psychologically abusing his wife right up until his murder. So the relationship between Celeste and her mother-in-law is likely to be a fraught one — you can catch your first glimpse of exactly how fraught one minute and seven seconds into the above video.\nIn the first look at Big Little Lies Season 2, Kidman and Reese Witherspoon stand close together, clearly wrapping up an uncomfortable interaction with someone seated below them. Kidman smiles tightly, nodding a farewell, while Witherspoon gapes at her helplessly, clear unsure about how to handle what's just happened, even as Kidman takes it in stride.\nAnd then the two women clear the frame, and there she is: Streep, sitting calmly at a table like this isn't the most exciting moment of our day, living for the camera in a sleek ash blond bob, gold wire-rimmed glasses, simple jewelry, and an immaculately tailored shirt, silk scarf, and coat combo. It's a look that's already iconic, as you can see from this tweet:\nAs she absentmindedly toys with the page of the book laid out in front of her, Streep squeezes her lips together in what could be interpreted as a smile, except that it doesn't reach her eyes, which dispassionately follow the other women on their path away from the table. It's enough to send shivers down your spine, although whether they're from terror, pure excitement, or some combination of the two is anyone's guess. Though leave it to Streep to make sitting calmly seem absolutely chilling.\nBut while other familiar BLL faces crop up before the promo wraps, it's impossible to tell how much new footage is really there, and this is the only glimpse we get of Streep. Fans will have to wait until 2019 to see Big Little Lies Season 2, and if her steely gaze from the promo is any indication, Mary Louise won't mind making you squirm a little in discomfort and anticipation.","url":"https://www.bustle.com/p/the-first-footage-of-meryl-streep-in-big-little-lies-will-send-the-best-kind-of-shivers-down-your-spine-video-10244399"}
