{"authors":["Matt Turner"],"date_download":"2018-10-30 20:49:03","date_modify":"2018-10-30 20:49:03","date_publish":"2016-12-27 00:00:00","description":"A Fed staff paper suggests that the Volcker rule, which limits proprietary trading by banks, has had a negative effect on bond market liquidity.","filename":"data/vaneerConsumption/TheFedhasgivenTrumpcovertounwindakeyWallStreetrule.json","image_url":"https://amp.businessinsider.com/images/582c88e4ba6eb6771b8b46d8-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_federal-reserve-study-on-volcker-rule-trump-2016-12_1540932543.html","title":"The Fed has given Trump cover to unwind a key Wall Street rule","title_page":"    Federal Reserve study on Volcker rule shows Trump can unwind it - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Mark Wilson/Getty Images It's the talk of Wall Street.\nThe prospect of deregulation following the election of Donald Trump — and specifically some kind of softening of the Volcker rule — is being discussed far and wide.\nNow it seems the Federal Reserve has provided some cover for Trump's nominees to go soft on the rule.\nThe Fed released a staff paper on December 22 focused on the Volcker rule, which bans proprietary trading, and its effect on market liquidity.\nIn short, the staff paper found that the rule had had a negative effect on corporate bond liquidity, or the ease with which buyers can find sellers and vice versa:\n\"Our main finding is that the Volcker rule has a deleterious effect on corporate bond liquidity and dealers subject to the rule become less willing to provide liquidity during stress times. While dealers not affected by the Volcker rule have stepped in to provide liquidity, we find that the net effect is a less liquid corporate bond market.\"\nIt's important to note that bond market liquidity has been a hot topic on Wall Street for some time, with dealers and investors often complaining that postcrisis regulations have made it harder to transact in the bond market. The Fed, meanwhile, has appeared sanguine about the effect of regulation on bond liquidity.\nAccording to Isaac Boltansky at the research firm Compass Point, the paper could be used as \"political cover\" for Trump and his team as they look to peel away some of the postcrisis financial regulation on Wall Street:\n\"In practical terms, our view is that this paper will provide political cover for President-elect Trump's nominees to de-emphasize enforcement of the Volcker rule in the near term and could ultimately serve as cannon fodder in the impending battle over legislatively repealing the rule.\"\nBoltansky added:\n\"Although this paper represents staff findings rather than the Federal Reserve's official policy position, our sense is that Volcker rule opponents will use it as definitive proof that the rule should be administratively and legislatively unwound.\"\nBoltansky added that he expects Trump's financial regulatory nominees to \"de-emphasize supervisory compliance with the rule early in their appointments,\" and that he believes \"a Volcker rule repeal effort will be part of the legislative conversation in 2017.\"\nThat said, he said he remains unconvinced that the Volcker rule will be repealed, as the deregulation effort is likely to focus on lightening the load for smaller banks rather than making life easier for large market-making investment banks.\nIn addition, several senior bankers have said that the repeal of the Volcker rule would have little effect on how they conduct business.\n\"There is a lot of noise about the Volcker rule, whether that stays or goes,\" said Daniel Pinto, CEO of the corporate and investment bank at JPMorgan. \"We will not do anything differently at all if the rule is eliminated. The way we would do business would not change. We may avoid some of the bureaucracy around all the reporting and checking and all of these things, but the way we do business would not change.\"\nCitigroup CFO John Gerspach said in December that \"we don't want to do proprietary trading, but I also would love to work with regulators to lessen the burden of proving that we are not engaging in proprietary trading.\"","url":"https://www.businessinsider.com/federal-reserve-study-on-volcker-rule-trump-2016-12"}
