{"authors":["Caroline Burke"],"date_download":"2018-10-31 01:38:42","date_modify":"2018-10-31 01:38:42","date_publish":"2018-08-28 23:00:05","description":"Weeks after the incident occurred, a French street harassment video has led to a man's arrest, according to a report by Deutsche Welle. The man, whose name has been withheld, was caught on a surveillance camera punching 22-year-old Marie Laguerre in…","filename":"data/vaneerConsumption/TheFranceStreetHarassmentVideoHasLedToTheArrestOfAMan.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/a397115c-5cf4-4aaf-92da-64f47a48d568-screen-shot-2018-08-28-at-31037-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-france-street-harassment-video-has-led-to-the-arrest-of-a-man-10926500_1540949922.html","title":"The France Street Harassment Video Has Led To The Arrest Of A Man","title_page":"The France Street Harassment Video Has Led To The Arrest Of A Man","title_rss":"NULL","source_domain":"bustle.com","text":"Weeks after the incident occurred, a French street harassment video has led to a man's arrest, according to a report by Deutsche Welle. The man, whose name has been withheld, was caught on a surveillance camera punching 22-year-old Marie Laguerre in the face after she reportedly yelled at him to stop screaming lewd remarks at her.\nThe man has not formally been charged with any crime as of yet, though officials are currently deciding whether or not to begin a formal investigation. Now, Laguerre will have to identify the man to see if he was the one who punched her earlier in the month.\nNPR has revealed via a French public radio station that the man who was taken into custody had been undergoing psychiatric treatment for the previous month, though his exact condition is undisclosed. After leaving the hospital, he was immediately taken into police custody, though his stay at the hospital actually had nothing to do with the incident that was caught on camera. In fact, NPR reports that the man was at the psychiatric ward as party of a \"separate judicial case.\"\nThe video, which was originally published in early August, has since garnered 6 million views, and has inspired a global conversation over abuse and mistreatment of women, as the assailant reportedly made several inappropriate and lewd noises at Laguerre.\nMarie Laguerre on YouTube\nThe video shows Laguerre (in the bottom left corner) initially turning back to say something to a man, who then followed her around the restaurant and punched her in the face. Laguerre later explained that she was on her way home when the man harassed her, and that she then told him to \"shut up.\" She said via The Guardian, “I told him to shut up and kept walking away, because I can’t stand this kind of behaviour. I can’t keep quiet, and we mustn’t keep quiet any longer.”\nTo CNN earlier in the month, Laguerre said of the incident, \"It put me in a rage and I told him to shut up. I didn't think he'd hear me, but he did. He actually got really mad and then he threw an ashtray at me. After that, I insulted him and after that, he rushed back to punch me.\"\nLaguerre added, \"I took the punch with the most pride I could, because I didn't want to show him any sign of weakness or any sign that he was actually going to put me down.\"\nCoincidentally, the incident occurred one week before French legislators passed a new law banning sexually-charged comments that are \"degrading, humiliating, intimidating, hostile or offensive.\" Per CNN, the comments, if charged, will result in fines up to 750 Euros— which is the equivalent of $878.\nIn the time since the attack, Laguerre has since started a website called \"Nous Toutes Harcelement,\" which translates to \"We Are All Harassed.\" On the site, people are free to share their own experiences with harassment. Laguerre reportedly set up the website after receiving hundreds of messages of support and solidarity from people all over the world.\nLaguerre said to CNN, \"He wasn't the first one that day, or that week. It happens almost every day.\"","url":"https://www.bustle.com/p/the-france-street-harassment-video-has-led-to-the-arrest-of-a-man-10926500"}
