{"authors":["John Hutchinson For Mailonline"],"date_download":"2018-10-23 01:08:31","date_modify":"2018-10-23 01:08:31","date_publish":"2016-01-29 14:56:55","description":"Helen Bilton, founder of The Group Company in North Yorkshire, is celebrating her company's ten year anniversary by treating all 32 members to a luxury holiday to Barbados.","filename":"data/vaneerConsumption/TheGroupCompanyfounderrevealstostafftheyregoingtoBarbados.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/309FAC7A00000578-0-image-a-61_1454076922017.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3422830_Is-best-boss-world-Manager-pretends-treat-staff-day-theme-park-reveals-going-Barbados_1540256911.html","title":"The Group Company founder reveals to staff they're going to Barbados","title_page":"The Group Company founder reveals to staff they're going to Barbados | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Staff at a travel company were shocked when their boss marked a successful decade in business - by treating them to a luxury holiday in Barbados.\nGenerous Helen Bilton, founder of The Group Company, is celebrating her company's ten year anniversary by taking all 32 members of staff on a five-star, three-night all inclusive trip to the exotic island.\nHelen had initially told staff at a meeting last year that they would be attending Flamingo Land - but later said the adventure park was shut and revealed everyone would instead be travelling on an 8,000 mile round trip to the Caribbean destination.\nHelen Bilton (blue top, front) is celebrating her company's ten year anniversary by taking all the staff on a five-star, three-night all inclusive trip to Barbados\nHelen, whose company is based in York, North Yorkshire, said: 'I thought about doing a big party to celebrate the tenth anniversary with suppliers and customers.\n'But then I thought the people that really deserve a treat are the people that work hard day in, day out for the business.\n'I decided around six months ago to go to Barbados. We have a monthly staff meeting, and a few months ago I asked for ideas.\n'Someone suggested hiring out Flamingo Land - so I pretended that's what we were going to do.\nWorkers at the The Group Company will be looking forward to an all-expenses paid trip to Barbados\n'At the next meeting I told them Flamingo Land was closed that day, so we're going to Barbados instead.\n'They couldn't believe it. I think they thought I was joking.'\nSpeaking about the role her staff play at the company, she added: 'Everyone works so hard and I am very grateful for that, so I'm delighted to be able to reward them.'\nThe company boss at first pretended that she was treating the workforce to a day out at Flamingo Land, which is in North Yorkshire\nTeams work to negotiate deals with hotels, selling them on to a customer base of 500 different operators.\nThe wholesale travel company has enjoyed 50 per cent year-on-year sales growth since the company was founded in February 2006.","url":"https://www.dailymail.co.uk/travel/travel_news/article-3422830/Is-best-boss-world-Manager-pretends-treat-staff-day-theme-park-reveals-going-Barbados.html"}
