{"authors":[],"date_download":"2018-10-30 01:18:01","date_modify":"2018-10-30 01:18:01","date_publish":"2018-08-21 00:05:07","description":"Warren Buffett likens healthcare to a “tapeworm” draining the lifeblood of the American economy. A more apt animal metaphor seems Godzilla.","filename":"data/vaneerConsumption/TheGodzillaWreckingtheAmericanEconomy.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Godzilla_-_Launch_Trailer_-_Godzilla_atomic_ray_3.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862281.html","title":"The Godzilla Wrecking the American Economy","title_page":"The Godzilla Wrecking the American EconomyThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Warren Buffett likens healthcare to a “tapeworm” draining the lifeblood of the American economy. A more apt animal metaphor seems Godzilla.\nAmazon, a partner with Berkshire Hathaway and JP Morgan Chase in a recently launched healthcare company, plans to open a clinic in Seattle, CNBC reports. The clinic reportedly serves very few Amazonians initially before more ambitiously rolling out to a larger part of its rainforest in 2019.\nOne clinic opening in the northwest normally does not make for the stuff of headlines and speculation. That the company owned by the world’s richest inhabitant opens the clinic fuels interest. More so does the shroud of secrecy that surrounds the venture. Amazon bestowing a code name, and one as grandiose as “1492,” on its broader healthcare ambitions ironically sparks rather than tamps down curiosity. Small things, as the results of the “Manhattan Project” suggest, do not receive code names.\nThat clinic, thought of as the first of many, may go viral beyond Amazon.\n“Don’t be surprised if in a year Amazon has solidified its own operation such that it branches out and sets up shop for other employers,” Beth Jones Sanborn writes at Healthcare Finance. “The implementation of work-site clinics, by Amazon and the others, is a not a passing event. It’s another step in the direction of a move to [a] market-based model. And one that makes great sense. Employers have not taken as important a role in demanding better outcomes and greater accountability, but they need to because they have a vested interest in it.”\nHow much of an interest?\nThe National Business Group on Health pegs the price of healthcare for large companies at $14,156 this year. Employees pay about $4,200 of that, leaving companies with a $10,000 bill per worker. Amazon employs 563,000 people, most of them in the United States. You do the math.\nSo, sure, a vested-interest propels Amazon’s venture. But, to update an aphorism, what’s good for Amazon is what’s good for America — at least it is here.\nBut Amazon appears as confused as the rest of us as to what is good for America. So it does not put all its chips on one bet.\nIn Seattle, a clinic looks like it cuts out middlemen and much else in saving Amazon money as part of a private-sector reform. Its venture with J.P. Morgan Chase and Berkshire Hathaway named surgeon and writer Atul Gawande, an advocate for more state involvement in medicine, as its chief executive officer. “Even though I’m going to work for a bunch of employers,” Gawande confessed several months ago, “employer-based care is broken.” He prefers a universal system administered by the federal government.\nOne imagines that either the private sector reforms healthcare or the public sector absorbs it (Amazon seems intent on covering its bases no matter what happens). Something eventually gives.\nA priority that consumed five percent of the gross domestic product in 1950 and increased to seven percent a half-century ago has ballooned to around 18 percent today. By the middle of the next decade, the percentage reaches 20 percent, the Center for Medicare and Medicaid Services estimates.\nRepublicans can scoff at the Medicare-for-All mantra increasingly popular among their political opponents. After all, a study released by George Mason University’s Mercatus Center estimates that the price of Medicare for All approaches the annual cost of the federal government. But its supporters point out that Americans spend this money on healthcare anyhow (a large chunk of it through government) and that Medicare for All likely brings down administrative costs. Rather than offer a winning, easy-to-understand counterproposal, Republicans ridicule.\nSomething usually beats nothing. Free market enthusiasts should hope that Amazon’s clinics serve as a model for companies in bringing down costs. If it does not, there’s always the Plan B advocated by its healthcare guru.\nAnd if the solutions make the problem worse, we can always try peaceful coexistence with Godzilla. Aficionados of Japanese cinema may lack optimism here.\nHunt Lawrence is a New York-based investor. Daniel Flynn is the author of six books.","url":"https://spectator.org/the-godzilla-wrecking-the-american-economy/"}
