{"authors":["Anna Klassen"],"date_download":"2018-10-30 22:33:43","date_modify":"2018-10-30 22:33:43","date_publish":"2014-08-15 11:15:02","description":"Like much of grade school required reading, the novels we ingest before we become teenagers are often the prose that stick with us for the rest of our lives. That was certainly the case with Lois Lowry's beloved The Giver , a 1993 novel that as a…","filename":"data/vaneerConsumption/TheGiversJeffBridgesCastSpeakAbouttheStorysNearly2DecadeLongTransitiontoFilm.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/82f4524f-81c3-47a2-bb81-0c82ca090c72.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35830-the-givers-jeff-bridges-cast-speak-about-the-storys-nearly-2-decade-long-transition-to_1540938823.html","title":"'The Giver's Jeff Bridges & Cast Speak About the Story's Nearly 2 Decade Long Transition to Film","title_page":"'The Giver's Jeff Bridges & Cast Speak About the Story's Nearly 2 Decade Long Transition to Film","title_rss":"NULL","source_domain":"bustle.com","text":"Like much of grade school required reading, the novels we ingest before we become teenagers are often the prose that stick with us for the rest of our lives. That was certainly the case with Lois Lowry's beloved The Giver , a 1993 novel that as a third grader, and as a twentysomething, still resonates in my memory with great admiration. And now, the book we read as children and still ponder as adults is becoming a major motion picture. Surprisingly, the adaptation wasn't an idea of late — the book has been in the process of becoming a film for 18 years. Yes, nearly two decades — all at the willpower of Hollywood staple Jeff Bridges.\nFor the uninitiated, the story centers around a seemingly perfect community, one that exists without suffering, pain, even war. But with this peacefulness comes a lack of choice. One boy, Jonas, (Brenton Thwaites), is chosen to be the keeper of memories the world no longer knows. The Giver (Jeff Bridges) offers him these pleasurable and painful memories so that Jonas can become The Giver himself.\nAt the Los Angeles press day for the film, Bridges, along with author Lois Lowry, the cast and filmmakers, spoke about the long and drawn-out process of brining the book to screen.\n\"A lot of it was timing. Jeff was so enthusiastic about the project for so many years and didn't let it go. We went through a struggle similar to Jonas in getting this movie made. A lot of it was timing and luck and the timing of everyone else,\" said Michael Mitnick, one of the two screenwriters who worked on the film.\n\"And still retain the spirit of it, which is what they were able to do,\" Lowry chimed in.\nCharley Gallay/Getty Images Entertainment/Getty Images\nRobert B. Weide was the original writer on the screenplay so many years ago. He spoke about the challenges of the book-to-film adaptation. \"The book is very internal, a lot of it is Jonas' experience,\" he said. \"we expanded some parts, like the Chief Elder who was virtually a cameo in the books, her role is expanded which is great because when you have Meryl Streep, you want to give her something to do.\"\nBut for Bridges, a story that took nearly half of his working career to develop had its benefits. For one, he was old enough, by the time the script was complete and greenlit, to play The Giver himself. \"I finally qualify as the grizzled guy,\" he said. But his decision to take on the character wasn't an instant one.\n\"Often when I come to crossroads in my life I try to inject myself with the future and say, 'How am I going to feel if I let this one go, or engage?' And I felt just terrible letting this one go. So I said 'Just go for it, dance with the universe. Have a jam session,'\" he said. \"I was in love with the book and I wanted to put the book up on screen exactly how it was. So much of the success of the film depends on the casting of the actors.\"\nAnd the movie managed to collect an impressive cast of actors: Not only is Jeff Bridges starring, but Academy Award winning Meryl Steep took a central role. Katie Holmes plays Jonas' mother, True Blood's Alexander Skarsgard takes on the role of his father, and even country superstar Taylor Swift came on board for a cameo.\n\"When you get this gift, this opportunity, you kind of have to pinch yourself every day before you go to work, and it was like that every morning,\" Thwaites said of working with some of Hollywood's most sought after actors.\nNewcomer Odeya Rush, who plays Jonas' friend and love interest, echoed his sentiments. \" It's such an honor to work with these greats. When you meet them they're so warm and make you feel really comfortable. It can be really intimidating,\" she explained.\nFrazer Harrison/Getty Images Entertainment/Getty Images\nKatie Holmes, who not only plays Jonas' protective mother, but the protector of the societal rules in the community, found a challenge in her character of Mother.\n\"It was interesting to play this character because this role is without emotion. There's no pain. As an actor you're always trying to emote, but you can't. To play Brenton's mom and having him have these experiences that were so foreign to my character and also being the guardian of the rules of this world was quite a challenge,\" she said.\nBrenton Thwaites, a 25-year-old actor from Australia is having quite the moment. Not only does he star in The Giver as Jonas, but he's appearing in five films this year total. (Remember him as the charming Prince Philip in Maleficent?) But Brenton exuded excitement for the cast and crew of The Giver, primarily his director Phillip Noyce, and of course — Jeff Bridges.\n\"To work with a fellow Auzzie was pretty cool,\" Thwaites said of Noyce. \"If I was bad in a scene he'd say, 'Mate.' If I was good, he'd say, 'Mate.' Only I understood what I was saying!\"\nAs for Bridges, well, the two of them made sweet music. \"We just jam. It's a musical expression but it also works for making movies too. Brenton plays guitar, we did a lot of jamming,\" Bridges said.\nAs the press day came to a close, Weide had a final thought: \"Speaking of how far back this goes, it occured to me last night that I started to write the script, and you meanwhile went off to make a little movie that ended up being The Big Lebowski. That's how far back this went.\"\nImage: Tumblr","url":"https://www.bustle.com/articles/35830-the-givers-jeff-bridges-cast-speak-about-the-storys-nearly-2-decade-long-transition-to"}
