{"authors":["Andrew Meola"],"date_download":"2018-10-30 21:17:45","date_modify":"2018-10-30 21:17:45","date_publish":"2016-12-21 00:00:00","description":"Learn how payments are made on one side of the world and received on the other. The global payment landscape has never been so connected.","filename":"data/vaneerConsumption/TheGlobalPaymentLandscapeMarketTrendsExplained.json","image_url":"https://amp.businessinsider.com/images/58092c4ec52402c9008b5f23-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_global-payments-landscape-market-trends-2016-10_1540934265.html","title":"The Global Payment Landscape: Market Trends Explained","title_page":"    The Global Payment Landscape: Market Trends Explained - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nPayments used to be a simple one-on-one transaction. You'd hand cash to a clerk in exchange for whatever goods you needed, and that was that.\nBut today, the payments ecosystem has evolved into a complex global machine. This world of global payment processing now includes card networks, gateways, acquirers, processors, and more.\nTo understand today's payment industry trends, one must fully understand the payments landscape. Below, we've provided a payment industry overview and outlined some emerging payments, and explained how payments made on one side of the world can be received on the other.\nUnderstanding the Global Payment System\nThere are three stages to processing a card payment, but consumers only really deal with the first step. Yet beyond the initial swipe are important stages that make the process seamless for the user.\nTo illustrate how the payments processing industry works, imagine someone makes a $100 purchase with a credit card.\nThe first stage in the process is authorization. When the customer swipes his or her card at a payment terminal, the transaction data goes through the terminal to an acquiring bank, which then sends an authorization request to the customer's issuing bank. Barring any issues (such as lack of funds, a lost or stolen card report, etc.), the issuing bank sends an authorization code through the card network to the acquirer, which sends it back to the merchant to complete the transaction. And all of this happens in a matter of seconds.\nAt this point, the consumer can leave with his or her purchase complete, but the merchant has not actually received any funds. All transactions for the day must be batched and cleared before that happens. The batch, or the aggregation of all the day's transactions, goes to the acquirer, which then requests payment on the merchant's behalf from the necessary card networks. These networks then send requests for funds to the appropriate issuing bank.\nThis begins the third and final stage: funding. The issuing bank sends the funds to the acquirer through the card network, minus a small interchange fee . The card network also takes a minuscule assessment fee and transfers the funds to the acquirer, which finishes the clearing process.\nBII\nPayment Technologies Are Increasingly Global\nThere are still some barriers to a truly global payments industry, but many previous roadblocks have been torn down thanks to the transition to digital payments. This shift has caused rapid transformations within the overall payments ecosystem.\nThese new technologies have started to work their way into the mainstream, and each of them is helping to make the payments industry more global.\nFor example, the legacy remittance industry has helped immigrants send funds to their families and friends in their home countries for more than 100 years, thanks to companies such as Western Union. But new digital initiatives are making this process easier than ever and making the payments world more connected.\nMobile wallets such as Apple Pay and Chase Pay let shoppers simply tap their smartphones at terminals anywhere in the world to quickly and efficiently make a purchase.\nPeer-to-peer services such as Venmo make it easier for friends to split restaurant checks and rent, but you can also send money to someone halfway around the world with just the push of a button.\nEmerging Payment Trends Overview\nThus far, 2016 has been a landmark year for the payments industry, thanks specifically to emerging payments technologies.\nMobile wallets have flooded the market. Consider that Apple Pay was the only major mobile wallet in 2014, but now Android Pay, Samsung Pay, Chase Pay, and Walmart Pay have all debuted and are thriving in their own ways.\nAt the same time, mobile commerce has matured as smartphone manufacturers have started to create devices with larger screens and payment companies have added one-click buy buttons in order to remove the friction of shopping on mobile phones.\nAnd alternative technologies are poised to disrupt the payments ecosystem, as connected device payments are becoming more popular. Watches, refrigerators, and more now have payments functionality, which could change consumer purchasing habits.\nMore to Learn\nThis is a broad overview of how the modern payments industry functions, but the details reveal a far deeper and more complex web that makes the payment process smoother for the public.\nThat's why BI Intelligence spent months compiling the best and most comprehensive guide on the world of payments entitled The Payments Ecosystem Report: Everything You Need to Know About The Next Era of Payment Processing.\nTo get your copy of this invaluable guide to the payments industry, choose one of these options:\nSubscribe to an ALL-ACCESS Membership with BI Intelligence and gain immediate access to this report AND over 100 other expertly researched deep-dive reports, subscriptions to all of our daily newsletters, and much more. >> START A MEMBERSHIP Purchase the report and download it immediately from our research store. >> BUY THE REPORT\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of the fast-moving world of the payments ecosystem.","url":"https://www.businessinsider.com/global-payments-landscape-market-trends-2016-10"}
