{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 18:50:20","date_modify":"2018-10-30 18:50:20","date_publish":"2015-06-30 14:37:46","description":"SANTA CLARA, CA – The Grateful Dead were in top form for their final performance in California, but to many fans in attendance at Levi’s Stadium on Sunday night, the quality of the music was almost beside the point. |","filename":"data/vaneerConsumption/TheGratefulDeadBidFareTheeWelltoCalifornia.json","image_url":"https://media.breitbart.com/media/2015/06/dead-heads-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_06_30__1540925420.html","title":"The Grateful Dead Bid 'Fare Thee Well' to California","title_page":"The Grateful Dead Bid 'Fare Thee Well' to California | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"SANTA CLARA, CA – The Grateful Dead were in top form for their final performance in California, but to many fans in attendance at Levi’s Stadium on Sunday night, the quality of the music was almost beside the point.\nSunday’s concert offered California Deadheads (and those unable to take the big financial hit of attending the July 4 three-show extravaganza in Chicago) a chance to pay their last respects to a musical institution unrivaled in its scope of influence on the Golden State.\nThe show’s best musical moments – from the early, booming first riffs of ‘80s-era “Feel Like a Stranger,” through the heartfelt favorite “Row Jimmy” and the haunting, spacey “Wharf Rat” – were, as always, transcendental in nature.\nBut, more than simply a musical performance, Sunday’s concert put a capstone on five decades of the Dead’s legacy in California, which endures to this day.\nAfter Saturday night’s show featured a set list culled from the band’s early material, expectations were sky-high for Sunday’s finale.\nAnd the band delivered, for the most part. Phish lead guitarist Trey Anastasio, recruited by the Dead to fill the Jerry Garcia role for all of the band’s final five “Fare Thee Well” performances, played the band’s music dutifully and respectfully, rarely jumping out in front as he is required to do with his other jam-heavy outfit.\nInstead, Anastasio hung back and let the rest of the Dead’s “Core Four” – guitarist Bob Weir, bassist Phil Lesh, and drummers Mickey Hart and Bill Kreutzmann – power the musical spectacle.\nWeir was particularly good on Sunday night. While he has struggled to recall lyrics in recent performances with side projects Ratdog and Furthur, he remained on point throughout this show, delivering particularly rousing vocals on “Black Peter” and “Loose Lucy.”\nThe second set’s “Eyes of the World” gave Deadheads the exploratory jamming they’ve come to expect from their favorite band, while “He’s Gone” conjured up bittersweet feelings as the band sang the refrain “Oooh, nothing’s gonna bring him back.”\nOther highlights included an electric “Alabama Getaway,” Weir’s exclamatory vocals on “I Need a Miracle” and the show-closing crowd-pleaser “Sugar Magnolia.” The band encored with the obligatory “Brokedown Palace,” which contains the line “Fare thee well, fare thee well, I love you more than words can tell.”\nAnd then the concert was over, and with it, the band’s tenure in California. The 65,000 plus in attendance streamed toward the exits and the darkness of the labyrinthine parking lot.\n* * * * * * * *\nThe Grateful Dead, then known as the Warlocks, cut their teeth in the Bay Area in the mid-60s, from playing Ken Kesey’s early “acid test” parties to playing free street festivals during San Francisco’s “Summer of Love” in 1967.\nFronted by spiritual and creative leader Jerry Garcia, the Dead quickly became one of the most popular bands to emerge from the hallucinogenic-soaked streets of San Francisco. They played Woodstock in 1969, and then, shortly after, the country, taking on sold-out amphitheaters and stadiums from coast to coast.\nThe live history of the band is well documented, but it is sufficient to simply say that their performances became legendary. The concerts were musical marathons, often lasting over three hours, in which the band drew from every genre of music imaginable: rock, folk, country, jazz, blues, psychedelia. Shows usually included a segment in which all of the band members left the stage, leaving drummers Mickey Hart and Bill Kreutzmann behind for an extended “Drums” solo. The “Space” segment that followed in later years allowed the band to stretch out and explore ambient noise for the benefit of the usually well-lubricated Deadheads.\nThe band’s innovation extended far beyond its musical output; in 1974, Dead sound engineer Owsley Stanley, known affectionately as “Bear,” built a “Wall of Sound” speaker system to accompany the band’s increasingly complex live performances. The band members themselves controlled the speakers, rather than a front-of-house engineer, and the setup was reportedly so elaborate that each of Phil Lesh’s four bass strings was assigned its own speaker. The system was a significant achievement in live production, though it ultimately became too costly and impractical to haul around on tour.\nMarketers have written books about the band’s legendary business acuity. When “tapers” began bootlegging Grateful Dead concerts in the late 60s, the band could have fought them off, as others did. Instead, they embraced them, setting up “taper sections” so that fans with expensive recording equipment could have more space. In doing so, the band created a tape-trading network unparalleled in modern music. Diehard fans brought their tape collections to concerts, trading them for other fans’ tapes.\nIt is easy to underestimate the significance of this development in the Internet era, when thousands of the Dead’s concerts can be found on a single website. But the band’s loose taper policy had a major impact on its marketing, helping to build the increasingly mythical nature of their live performances.\nThe original incarnation of the Grateful Dead officially ended with Garcia’s death in August 1995, though keyboardists Pigpen, Keith Godchaux and Brent Mydland had passed away before then. The founding members continued on to side projects; guitarist Bob Weir fronted Ratdog and bassist Phil Lesh tours with a rotating cast of musicians in a project called Phil Lesh and Friends. Drummers Hart and Kreutzmann founded the Rhythm Devils.\nAfter Garcia’s death, the so-called “Core Four” toured sporadically under the name “The Other Ones” before changing simply to “The Dead” in 2003. In 2008, Weir, Lesh and Hart reunited for the first time in four years at The Warfield in San Francisco for “Deadheads for Obama,” a fundraising concert for then-presidential candidate Barack Obama.\n* * * * * * * *\nIt is useful, on the night of the band’s final performance just a few dozen miles from its old stomping grounds, to briefly examine the Dead’s music and cultural legacy in the country’s most populous state.\nThe band’s early fans were comprised of Bay Area hippies, many who of whom had migrated west to experience the heady early days of free love and virtually unlimited drugs. The popularity of LSD literally dovetailed with the band’s own momentous rise; Wall of Sound builder Owsley Stanley manufactured hundreds of thousands of tabs of acid from his California home and generously supplied the drug to both Kesey’s wild psychedelic parties and the band.\nThe optimism was palpable. Legendary journalist and author Hunter S. Thompson called San Francisco in the 60s a “very special time and place to be a part of.”\n“There was a fantastic universal sense that whatever we were doing was right, that we were winning,” Thompson wrote in 1973’s Fear and Loathing in Las Vegas. “And that, I think, was the handle—that sense of inevitable victory over the forces of Old and Evil. Not in any mean or military sense; we didn’t need that. Our energy would simply prevail. There was no point in fighting—on our side or theirs. We had all the momentum; we were riding the crest of a high and beautiful wave.”\nBut the wave would eventually crash and roll back.\nLike everyone else, the Deadheads grew up. Many of them took teaching jobs at Cal State or started environmental nonprofits. Others entered politics, becoming state senators in San Jose or Senior Aides in Sacramento. Even some of the most dedicated acid freaks dropped out of the scene and became used-car salesmen in Torrance.\nBut the culture never died. The Deadheads carried the liberal spirit and unbridled optimism of that San Francisco summer of ‘67 with them.\nAnd now, California is largely, for better or worse, a product of that progressive optimism, both politically and culturally. Where liberal hippies in the Sixties were primarily concerned with pushing back against the “normalcy” of society, today’s Left in California demands it.\nThe Irvine campus of University of California – the same school whose Berkeley outpost was the site of the infamous free speech protests in 1964 – recently attempted to ban the American flag from a building lobby. State universities are rife with anti-Semitic sentiment, borne from liberal movements like BDS and the academic boycott of Israel. “Safe spaces” are on the rise at universities across the U.S.; comedian Jerry Seinfeld won’t play college campuses due to political correctness.\nCalifornia public policy also suffers, due largely to the rigid, left-leaning majority in the state Legislature. A glut of spending over the past several decades, guided with what can only be assumed is the same optimism the hippies felt in those early, heady days in San Francisco, has left the state with massive unfunded liabilities and an inexplicable appetite for a very expensive, bond-financed transportation project.\nAnd then, of course, there is the drought. California is in the grip of a record water shortage, but the state’s gargantuan bureaucracy stifles all attempts at rational water policy. Environmental organizations – the same outfits founded by those old school, wide-eyed optimists – have grown to become the most powerful entities in the state.\nOf course, it is at best misguided, and at worst, unfair, to place the blame for California’s current dysfunction entirely on the shoulders of grown-up Deadheads. The state is in trouble for a lot of reasons. Deadheads are overwhelmingly kind, open-minded individuals with a collective appreciation for the art and passion of live music. They also have libertarian sympathies with regard to governmental overreach.\nBut the Deadhead brand of liberal activism – borne out of optimism and good intentions during those fateful California summers – has endured in the state. And in the hands of a new generation, it has morphed altogether into something more violent and, somewhat surprisingly, more conformist.\nStill, on Sunday night, issues of politics, legacy, and even identity faded away. And as the Dead played their final set on a clear night in California, tens of thousands of fans tapped, if only briefly, into that relentless optimism, into the sense that everything, somehow, would be alright.","url":"https://www.breitbart.com/entertainment/2015/06/30/the-grateful-dead-bid-fare-thee-well-to-california/"}
