{"authors":["Emma Madden"],"date_download":"2018-10-31 01:42:07","date_modify":"2018-10-31 01:42:07","date_publish":"2018-08-28 05:05:52","description":"There's no such thing as an apathetic Game Of Thrones fan. If you're one of them, then you're probably counting down the 48 weeks, 7 hours, 6 minutes and 42 seconds (even less by the time you've finished this sentence!) until season eight of the…","filename":"data/vaneerConsumption/TheGameOfThronesSeason8TrailerJustTeasedSomeMAJORDrama.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/5daddc8b-8bd3-48e9-8e43-3373c9efc446-shutterstock_9036271dv.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-game-of-thrones-season-8-trailer-just-teased-some-major-drama-10249305_1540950127.html","title":"The 'Game Of Thrones' Season 8 Trailer Just Teased Some MAJOR Drama","title_page":"The 'Game Of Thrones' Season 8 Trailer Just Teased Some MAJOR Drama","title_rss":"NULL","source_domain":"bustle.com","text":"There's no such thing as an apathetic Game Of Thrones fan. If you're one of them, then you're probably counting down the 48 weeks, 7 hours, 6 minutes and 42 seconds (even less by the time you've finished this sentence!) until season eight of the show premieres. But rejoice, because the first trailer for Game Of Thrones Season 8 is finally here.\nIt's been over a year since the Army of the Dead brought out their blue dragon fire. After spoilers were leaked early on last time around, creators David Benioff and D.B. Weiss are making sure to keep things under wraps this time. But after just over a year of waiting, they've given us a little morsel.\nOK, so the trailer doesn't tell us much, but it's been enough to drive fans into a frenzy. In it you'll see a weathered Jon Snow embracing his sister Sansa Stark, with Stark looking not at all into it. There's \"dracarys\", the Night King, as well as some clear tension between Jon Snow and Daenerys after *that* finale to Season 7. The surprise teaser trailer was sandwiched within a reel of upcoming HBO shows, which was shown on last night's finale of Sharp Objects. But the trailer doesn't give much away for the final season of the show, which you'll have to wait until 2019 for.\nSeries Trailer MP on YouTube\nHey, it'll be worth the wait and all of the GoT marathons you'll get to do in the interim will surely keep you entertained. HBO senior executive Francesca Orsi has described their last table read as an emotional affair. \"By the end, the last few words on the final script, the tears just started falling down. Then there was applause that lasted 15 minutes,\" she revealed. But viewers won't know which ending had the cast crying. According to HBO's president of programming Casey Bloys, \"they're going to shoot multiple versions,\" in case the season leaks.\nThere will only be six episodes of the final season in total, according to a statement made by HBO, but they'll all be feature length, meaning that they could be anything from an hour to two hours long. The creators of the show are taking their sweet time to \"craft the strongest final six episodes possible,\" Bloys told Entertainment Weekly back in January. Those will also be the six most expensive episodes in TV history. Back in September 2017 Variety reported that each episode is estimated to have cost at least $15 million, trumping The Crown as the most expensive show ever.\nHBO\nBut most importantly, which of our favs are going to die this time around? Anyone who's seen GoT has learned the hard way that you can't get attached to anyone on the show. And since it's the final season, fans are expecting total carnage. Will there even be anyone left standing?\nA data scientist in Boston wrote a complex algorithm in order to calculate the likelihood of each character's death. And let's just say, it's bad news for Daenerys. According to Taylor Larkin, there's over a 83 percent chance of her dying in season 8, while Gendry's looking pretty smug with less than a 40 percent chance of fatality. Can Gendry really be the last man standing? We'll soon find out.","url":"https://www.bustle.com/p/the-game-of-thrones-season-8-trailer-just-teased-some-major-drama-10249305"}
