{"authors":[],"date_download":"2018-10-30 14:30:54","date_modify":"2018-10-30 14:30:54","date_publish":"2015-08-03 00:00:00","description":null,"filename":"data/vaneerConsumption/TheGOPfiguresitallout.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_08_the_gop_figures_it_all_out_1540909854.html","title":"The GOP figures it all out","title_page":"The GOP figures it all out","title_rss":"NULL","source_domain":"americanthinker.com","text":"This same sort of inane calculation is used by political parties in choosing where to hold their political conventions.\nIn choosing their favorite sports team, people usually choose the team who takes showers in locker rooms physically close to where they live. So if you live in Oakland, you like the Oakland Raiders, because they shower closer to you than other teams. If you're in New York, you like the Yankees, because their locker room toilets are closest to where you live as well. Even though most of these players do not come from the same location, people like it because the team is said to represent where they live.\nThe ultimate bellwether state in presidential politics, Ohio is the site of next Thursday’s [Republican] debate because, just under a year from now, it will host the 2016 convention in the same Cleveland sports arena. “We will have thousands of Ohio Republican volunteers and activists converging on Cleveland next summer,” said Mark R. Weaver, a Republican strategist in the state. “They will be re-energized, signed up and ready to rock.”\nThe activists will come to Ohio for the convention. The convention will be held. Many restaurants, hotels, and brothels will do brief but brisk business. The activists will then leave. How does this help in Ohio?\nBesides firing up activists, Republicans are using the debate and the convention to woo Ohio’s general-election voters -- who have unerringly picked every president since 1964 -- and highlight before millions of voters nationwide the state’s economic resurgence, which the party credits to Republican leadership.\nHow will a convention in Ohio woo voters from Ohio? Will they really watch it, thinking, \"They are standing in a stadium in Ohio. That makes me want to vote for them\"? Are voters really this obtuse?\nStill, many Republicans believe they can break the trend in Ohio. “The fact we’re in the field now preparing for November 2016, the fact we have the convention there -- our increased emphasis on Ohio will, I think, help us carry the state,” said Ryan Mahoney, a spokesman for the Republican National Committee.\nOkay, if a spokesman for the RNC is saying it, then we know for sure it's not true.\nLet me offer a contrary view. Instead of spending so much time and effort thinking about where to physically hold an event, hoping viewers recognize and identify with the stadium, why not focus a little more on messaging? I'll bet that while the candidates are in Ohio, they can simultaneously appeal to voters in other states if they actually campaign on the issues. Who is going to start talking about this crushing national debt? Who besides Trump and Ted Cruz will talk about illegal immigration? Who besides Huckabee and Cruz is going to talk about the murder of unborn children? Who is going to talk to blacks about how they have been abused by a racist party that has taken them for granted?\nYou won't see Ryan or any of the RNC shirts talking about that. They're more focused on the stadium, not how our team is playing ball. And that's why we are in danger of losing.\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/08/the_gop_figures_it_all_out.html"}
