{"authors":["Gabe Bergado"],"date_download":"2018-10-30 23:21:36","date_modify":"2018-10-30 23:21:36","date_publish":"2014-08-13 19:49:32","description":"One of the most important things in this life is loving yourself. Sometimes you need help doing just that, and The Glov, a new sex toy, is, er, coming to the rescue. Because when I say \"loving yourself,\" I'm talking about masturbation, the kind done…","filename":"data/vaneerConsumption/TheGlovSexToyMightMakeMasturbationEvenMoreEnjoyable.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e59942b0-789c-41ce-9692-6b92099f287f.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35659-the-glov-sex-toy-might-make-masturbation-even-more-enjoyable_1540941696.html","title":"The Glov Sex Toy Might Make Masturbation Even More Enjoyable","title_page":"The Glov Sex Toy Might Make Masturbation Even More Enjoyable","title_rss":"NULL","source_domain":"bustle.com","text":"One of the most important things in this life is loving yourself. Sometimes you need help doing just that, and The Glov, a new sex toy, is, er, coming to the rescue. Because when I say \"loving yourself,\" I'm talking about masturbation, the kind done with a vibrator or dildo. Getting those toys to hit just the right spot can leave your wrist cramped, but this new sex toy is hoping to solve this crisis — it's quite literally here to give you a helping hand.\nI'm sure many of you out there have wished for a less straining masturbatory practice than moving a phallic object so quickly it's like you're trying to start a campfire. Don't fret — the Glovin Life TEAM has got you covered with the future of self-pleasure technology. The glove-like sex toy allows for either a Rabbit or dildo attachment to hook onto a bracket that is connected to the middle three fingers. The user can wiggle those fingers to control the movement and speed of the attachment. It's like doing curls with your fingers, but instead of building muscle you're just trying to get yourself off. Check out the video below for a visual aid of the functionality.\nYouTube\nAccording the page, \"countless hours of research have gone into developing\" the sex toy — how does one get the job of sex toy researcher? — but it's still in the funding stages. Its Indiegogo page went live just a few days ago — The Glov is hoping to raise $38,000, but it's unclear if they're going to get enough helping hands in reaching their goal. If you're trying to get your hands into one of these as soon as possible, you can donate $89 to get the \"Early Supporter Arousal\" gift, which includes the Glov, rabbit attachment and lube (jackpot!). This tool might strive to redefine masturbation, but we'll see how many people stick with simultaneously getting themselves off and working out their forearms sans the Glov.\nImages: Glovin Life/YouTube","url":"https://www.bustle.com/articles/35659-the-glov-sex-toy-might-make-masturbation-even-more-enjoyable"}
