{"authors":["Kelly Schremph"],"date_download":"2018-10-31 01:44:56","date_modify":"2018-10-31 01:44:56","date_publish":"2018-08-27 20:38:32","description":"With only a month to go until the Grey's Anatomy Season 15 premiere, it's hard not to wish the rest of the summer away so you can scrub back in with your favorite Grey Sloan Memorial surgeons. However, ABC is doing everything it can to make sure…","filename":"data/vaneerConsumption/TheGreysAnatomySeason15PremiereIs2HoursLongSoPrepareForADoubleDoseOfDrama.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/e4081ff3-b324-4afe-a8e5-409f7a31473e-149059_2002.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-greys-anatomy-season-15-premiere-is-2-hours-long-so-prepare-for-a-double-dose-of-drama-10252194_1540950296.html","title":"The 'Grey's Anatomy' Season 15 Premiere Is 2 Hours Long, So Prepare For A Double Dose Of Drama","title_page":"The 'Grey's Anatomy' Season 15 Premiere Is 2 Hours Long, So Prepare For A Double Dose Of Drama","title_rss":"NULL","source_domain":"bustle.com","text":"With only a month to go until the Grey's Anatomy Season 15 premiere, it's hard not to wish the rest of the summer away so you can scrub back in with your favorite Grey Sloan Memorial surgeons. However, ABC is doing everything it can to make sure this new installment is well worth the wait, which is why the Grey's Anatomy Season 15 premiere will be two hours long rather than the typical one-hour time slot. That's right, folks — you're getting double the amount of drama right off the bat when the show returns on Thursday, Sept. 27 from 8 p.m. ET to 10 p.m. ET, followed by the How To Get Away With Murder Season 5 premiere.\nFor those wondering how this can possibly work into the ABC schedule, never fear. The regular TGIT line-up will kick into full gear the following week on Oct. 4, when Grey's Anatomy returns to its usual 60-minute time frame at 8 p.m. ET, followed by the sophomore season of its spinoff series Station 19, which will debut its second season premiere at 9 p.m. ET. But for that first week, Grey's will be taking up an extra helping of our time. (No complaints here!)\nGranted, this isn't a complete surprise by any means. Two-hour back-to-back episodes have become quite common for the series, especially when it comes to premieres and finales. And considering that Season 14 left fans with quite a few cliffhangers, it makes sense that the characters need a little extra time to catch us up on what's been going on with their lives and what direction the new season will be taking.\nLast we saw at the end of Season 14, Teddy is pregnant, presumably with Owen's baby, which could definitely throw a wrench in his recent reconciliation with Amelia. Then there's the newly married Jo and Alex, who are potentially gearing up to move across the country for Jo's blossoming career.\nMeanwhile, Arizona moved to New York with Sofia and April left the hospital to pursue helping the homeless. Nothing all that exciting was really going on in Meredith's life, but she finally seemed happy and ready to focus on the future. Given that Season 15 is being referred to as \"the season of love,\" it's possible a new and lasting relationship could be in the cards for her. (Not that Meredith has ever needed a man in order to be happy, but she's more than earned the right to a little romance if that's what she desires.)\nEither way, there's certainly a lot of plot to dive into when the series returns this fall, so it's no wonder the writers wanted a little extra time to cover all the various storylines. Grey's thrives on drama, whether it involves a complicated love triangle or a particularly difficult surgery, these cast of characters never fail to keep us on our toes. So when it comes to episode length, we can all agree that there's no such thing as too much Grey's. Bring it on, ABC.","url":"https://www.bustle.com/p/the-greys-anatomy-season-15-premiere-is-2-hours-long-so-prepare-for-a-double-dose-of-drama-10252194"}
