{"authors":["Will Martin"],"date_download":"2018-10-30 22:17:28","date_modify":"2018-10-30 22:17:28","date_publish":"2016-12-14 00:00:00","description":"Japanese automaker Nissan struck a deal with the government to build two new models at its plant in Sunderland.","filename":"data/vaneerConsumption/ThegovernmentdidNOTofferNissanasweetheartdealtoboostitsUKproduction.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_government-nissan-letter-should-be-released-national-audit-office-2016-12_1540937848.html","title":"The government did NOT offer Nissan a 'sweetheart deal' to boost its UK production","title_page":"    The government did NOT offer Nissan a 'sweetheart deal' to boost its UK production - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Peter Nicholls/Getty Images LONDON — The boss of the National Audit Office (NAO) says there is no good reason that a letter sent by the government to the NAO discussing Nissan's decision to build two new models in Sunderland should not be released.\nThe NAO is the body responsible for auditing government departments and ensuring their accounts are in order.\nSpeaking to MPs from the Treasury Select Committee published on Tuesday, NAO chief Sir Amyas Morse said he \"can't see any reason\" why a letter sent by the government assuring auditors that Downing Street had sent \"no other letters\" and no more promises to Nissan before the firm made its investment decision shouldn't be released.\nNissan agreed in October to produce the new Qashqai and X-Trail car models at its massive plant in the north-east city of Sunderland, having previously said that it may have to look to move jobs out of the city after the Brexit vote.\nThe news was greeted as the first major affirmation that big businesses will stay in Britain after it leaves the EU, but many questioned the way the deal was supposedly struck, criticising the government for a lack of transparency.\nAt the heart of this was a letter sent by Business Secretary Greg Clark.\nHe reportedly wrote to bosses at Nissan to tell them that the government will do all it can to assure that its UK business will \"remain competitive,\" but at the time it was rumoured that the letter also included assurances from Clark of government financial support for Nissan.\nThe Department for Business, Energy and Industrial Strategy declined to comment on letter at the time, but appearing on Question Time in the week the deal was announced, Clark said that no \"cheque book\" had been involved in the deal. \"There's no cheque book. I don't have a cheque book,\" he said. Essentially, Clark denied that the government has offered Nissan state aid, or any kind of financial assistance.\nAs part of its review of the government's dealings with Nissan, the NAO was given a copy of Clark's letter to examine, as well as a further letter from the government, which gave \"assurances from the Permanent Secretary that there are no other letters to Nissan on this matter and that nothing was discussed in the relevant meetings that might be understood as an additional commitment by HM Government.\"\nThere is no reason those communications between government and its auditors shouldn't be released, Morse said.\nEssentially, the government has assured the NAO that it did not grant any sort of so-called \"sweetheart deal\" to the Japanese automaker before it committed to making its new models in the north-east.\nOn the day of his appearance the Treasury Committee released a letter sent by Morse to committee chair Andrew Tyrie in conjunction with his appearance.\nHere is the key extract from Morse's letter to Andrew Tyrie (emphasis ours):\n\"After a meeting in Sunderland the Secretary of State for Business, Energy and Industrial Strategy wrote to Nissan on 21 October. Nissan then announced on 27 October that they will build their new Qashqai and X-trail models in their Sunderland plant. The Secretary of State for Business, Energy and Industrial Strategy then made a statement in the House of Commons on 31 October aiming to set out the assurances government had provided. After that statement my audit team requested access to the letter the Department sent to Nissan.\n\"I have reviewed the contents of that letter. I have also received written assurances from the Permanent Secretary that there are no other letters to Nissan on this matter and that nothing was discussed in the relevant meetings that might be understood as an additional commitment by HM Government. On that basis I am satisfied there is no identifiable contingent liability for the purpose of inquiry into whether there was an obligation to notify. We will, of course, examine the evidence again during our audit of the Department's accounts.\"","url":"https://www.businessinsider.com/government-nissan-letter-should-be-released-national-audit-office-2016-12"}
