{"authors":[],"date_download":"2018-10-22 20:51:58","date_modify":"2018-10-22 20:51:58","date_publish":"2014-05-04 19:08:37","description":"Read chapter 10 of 'The Ghost Horse' to learn more about Lisa's Booby Trap.","filename":"data/vaneerConsumption/TheGhostHorse.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/419281/ghost_horse_2272e22fd52d1bb8e24d569068ec915c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/dateline_ghost-horse-n96766_1540241518.html","title":"The Ghost Horse","title_page":"The Ghost Horse","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nChapter Ten When she arrived at Finger Lakes Racetrack in April 2010, Lisa’s Booby Trap was just another cheap and obscure filly lazily munching hay in a stall, with virtually no reasonable chance of ever becoming anything more than that. She was prettier than most of her stablemates, taller, a bit gangly, but with long muscles still in development, and so she certainly looked like more of a racehorse. But appearances can be deceptive and breeding unreliable; no one knew better than Tim Snyder that the filly was far from the second coming of Ruffian. His goals for her remained modest: to correct any lingering structural issues and determine whether she was even capable of running. If he succeeded at that, then perhaps she might eventually make a few bucks at the track. It remained, however, a daunting project.\nTim had started working with Lisa in Ocala, and what he saw both encouraged and distressed him. The fact that she was at least partially blind in one eye did not overly concern Snyder, for she did not seem distracted or hampered by it. One- eyed horses, or at least horses with diminished vision, rou- tinely make it to the starting gate; some perform surprisingly well. Tim was confident that Lisa’s Booby Trap fell into the latter category. When he approached from the blind side, Lisa would not spook easily, as some vision-impaired horses do. In a bridle, she did not jerk her head awkwardly, as if trying to accommodate the disability. She simply went about her busi- ness, almost as if the problem didn’t exist. “The eye was no big deal,” Tim said. “I’ve been around a lot of blind horses. It doesn’t stop them from running—if they want to run, they can run with a bad eye. That was the least of her problems.” A horse’s genetic blueprint is determined very early in the game, and there is only so much that can be done after the fact to correct mistakes or shortcomings. It’s best to concen- trate on the things that can be fixed. In the case of Lisa’s Booby Trap, that meant working on feet that were not designed for running. Like Don Hunt before him, Snyder recognized is- sues with Lisa’s feet and attempted to correct them by trial and error. “I trimmed her feet and put shoes on her when I first got her in Florida,” Tim said. “Then I went to Ocala, and a month later I took some more off her feet, put another set of shoes on her. I was lucky to have a couple good blacksmiths who could help me. I’ve been lucky a lot with this horse. Seemed like everywhere I went, I knew somebody who needed me to work, and I needed their help, and we were able to work out a deal. You can’t do it alone.”\nThe way Tim saw it, maybe Lisa wasn’t really the slowest horse in the world. Maybe she was simply a horse whose structural and balance issues were so severe that she was dis- inclined to even take that first step, for she knew what lay ahead: discomfort and anxiety. Imagine trying to run with one bare foot and one protected by a shoe. Imagine trying to run on shoes of unequal size. Imagine having legs of unequal length. While none of these scenarios reflect exactly the issues faced by Lisa’s Booby Trap, they offer a glimpse into the chal- lenges encountered by anyone trying to prepare her for a career on the racetrack. The more Snyder worked with Lisa, the more he began to think that her feet were the source of all prob- lems. She had a clubfoot on the right front side; on the left front, a diminished heel. “So she’s up on her heel on one side, and flat-footed on the other,” Tim said. “It’s like she’s a got a high heel on one side, and a sneaker on the other. No way you can even walk like that, let alone run. It was very bad. Horses like that don’t often make it to the racetrack; sometimes they do. Trainers don’t notice that shit, usually, but it was really obvious with Lisa. That’s why I ended up with her. Her lineage was fine, but she was structurally unsound. Trainers and owners get rid of horses in that condition, pawn them off. Usually, best a horse like that can hope for is to become a barn pony or a jumper. Basically a big pet. Nothing wrong with that. But I thought maybe Lisa could be more. I took her because she was big and had a long stride on her. She was graceful despite her problems.”\nHad Lisa’s Booby Trap never stood in a starting gate, had she never become anything more than a cheap Finger Lakes claimer, chances are no one would have disputed Snyder’s assertions about the condition of the horse, or the amount of work he put into her. As it happened, though, Lisa entered the spotlight just long enough for Snyder’s claims to come into question. “She was in bad shape when I got her,” said Don Hunt. “Her feet were atrocious. I still have the X-rays to document the feet when I got her. But Tim did not do any miracle work with her feet. I did whatever straightening out there was, and apparently it did help the horse somewhat. She looked like a million bucks when they took her out of here. There wasn’t any second-guessing about what she looked like. The horse was picture perfect when Tim bought her. I’ve got vet reports about how good her feet were.” John Shaw is similarly unconvinced that Snyder worked any magic with Lisa’s Booby Trap. “When I got her she looked fabulous, and Don takes great care of his horses, too. I read somewhere that Snyder said she was wormy or whatever. That’s just hocus-pocus to make him- self look better.” As for whether the filly’s feet were as bad as Snyder claimed? “I don’t think she had a clubfoot” Shaw said. “If she has one now it’s from poor shoeing. If she did have a clubfoot, it might have been just a little narrow. Don X-rayed her feet because she had some rotation on the coffin bone, which would cause her to be sore. And that’s what basically turned it around, because he told Snyder to be aware of the possibility that she’s got a rotation in the coffin bone. Other than that . . . I don’t know.”\nSnyder gets visibly agitated when he hears this sort of thing. He claims that he never said anyone mistreated the filly; at the least, he never intended for that message to come across. But he stands by his assertion that the horse was a structural mess and that he put in the time to correct those is- sues—to the extent that they could be corrected. “I changed the degree on her feet with every new shoe- ing,” Tim said. “Her feet were way out in front of her, like having long nails. And each shoeing, I was getting her feet up underneath her, straight with the knee, so she wouldn’t strain her tendons and ligaments. I’d cut the toe up, move the shoe back. But you can’t make a drastic change; you have to do it a little at a time. It’s a long, slow process.” John Tebbutt, a genial sort whose even temper serves as a neat counterbalance to Snyder’s more volatile nature, bris- tles slightly when asked how much credit his friend deserves for the transformation of Lisa’s Booby Trap. “I think he deserves all the credit. After this horse started working well, everybody considered her a freak. When they are that far out of alignment you wonder how long they can last. It’s like driving down the road with one good tire and three tires that are bald. It doesn’t mean they can’t run, it just usually means their time is very limited. And that turned out to be the case with Lisa. But in the beginning there was no reason to think she’d ever amount to anything. She was a big, good-looking horse, but her muscles didn’t look right, and she was very awkward.”\nTebbutt is at times almost oddly defensive about a man he openly describes as “a pain in the ass.” But such is the na- ture of friendship, particularly when it has endured the twin tests of time and hardship. “I have been Tim’s best friend for a very long time,” Teb- butt said. “That’s not going to change, no matter what he does. “Since I quit drink ing and drugging about fifteen years ago, I’ve become very compassionate to other people, you know? Tim has had a hard life. I try not to judge people in a negative way; I try to find the positives about them. Any- body that comes along, you try to support the best you can. I worked in California for a while, and I saw that from an old man I worked for. We were the first barn at Hollywood Park, and every single kind of person would come to his barn first, to borrow five dollars or fifty thousand. Or just to say hello. Everybody owed him a favor—from the chief stewards to the mega rich, to the hotwalker who never had anything and never would have anything. He was kind to everyone; that was an attribute I admired.” It’s worth noting that the old man to whom Tebbutt referred was no ordinary backstretch plugger. His name was Charlie Whittingham, a Hall of Fame trainer widely regarded as one of the greatest horsemen in the game, as well as one of the most generous of spirit. With Whittingham as a mentor, it’s probably no surprise that Tebbutt comes across as someone with unusual patience—at least where Tim Snyder is considered.\nFor example, when Tim returned to Finger Lakes from Ocala, he did so with the intent to continue working for Dave Markgraf. That arrangement lasted only a few days, and soon Tim found himself at Tebbutt’s barn, in need of stall space, a job, a paycheck, and something else, as well. He needed someone he could trust. “I was the registered owner on Lisa, but I had no trainer’s license,” Snyder explained. “It had lapsed, and I didn’t have the money to apply for a new one. You need six hundred bucks for the track fee, and another four-fifty for workman’s comp, so that’s a thousand bucks I didn’t have at the time. I had already borrowed so much money to keep this horse going. I figured it made more sense to just run her in John’s name. If she won a couple races, I could get my license and put her in my name.” For someone with Tim’s naturally skeptical nature, the thought of turning over Lisa to another trainer, if only as a matter of protocol, was enough to cause a serious spike in anxiety. “I didn’t want to put the horse in anyone else’s name, just in case she went the other way and turned out to be a nice horse,” he said. “That could cause problems. Racing is a tough business; you’ve gotta watch your own ass.” Or have a friend willing to watch it for you. For Tim, that person was John Tebbutt, who became, in April 2010, the offi- cial trainer of Lisa’s Booby Trap, and who saddled the horse in her first couple races—albeit with Tim, as an “assistant,” right by his side. “It wasn’t a big deal,” Tebbutt said with a shrug. “Just part of the game.” With the appropriate paperwork in place and his new horse comfortably settling into her upstate home, Tim turned his attention to preparing Lisa for the racetrack. He continued to tinker with her feet and her shoes, until finally she appeared to walk normally, without bobbing from side to side. Then he went about the hard business of training, and correcting another of Lisa’s apparent structural abnormalities: an imbalance in her shoulders.\nSnyder first noticed the issue in Florida, when he worked Lisa in a eurociser. The eurociser is a circular, mechanized training apparatus, divided into stalls, that permits horses to walk or jog in a tightly controlled space, without having to bear the burden of a rider. Akin to a giant, horizontal hamster wheel, it’s particularly useful when working with horses that are either new to the sport or recovering from some type of injury. In the case of Lisa’s Booby Trap, it gave Tim Snyder an opportunity to monitor the gate and stride of his new filly; what he saw concerned him. “Her right shoulder was much larger than her left shoul- der,” he recalled. “It was the strangest thing.” What Snyder quickly determined, after taking Lisa out on the track a few times, was that she was unable to switch leads while galloping. The concept of switching leads sounds complicated and mysterious to those who haven’t spent any time around a racetrack (or around horses in general), but it’s actually a normal and instinctive behavior, albeit one that sometimes needs tweaking and prodding. Basically, when a horse gallops it “leads” with the legs on one side of its body, meaning the legs on either the left or right side reach farther forward than the legs on the other side. (This contrasts with, say, a rabbit, which ambulates by pulling rear legs forward first, in tandem, and then front legs afterward.) If the horse leads with his left, he will first push off his right hind leg. Then he will reach forward simultaneously with his left hind leg and right foreleg. Finally, he pulls the left front leg forward. Then he repeats the motion, over and over, creating what ap- pears to be a beautiful and effortless gallop. A horse leading with its right simply reverses the movement, driving first off its left rear leg.\nWhen a horse runs in a straight line, it really doesn’t matter whether a left or right lead is utilized. But it’s generally accepted that when running in a circle, the inside leg should be the lead leg. In other words, a horse rounding the final turn of a racetrack, running in a counterclockwise direction, should be using its left—or inside—lead. “If they’re on the outside lead going through that turn, they can veer out fast and get into trouble,” Snyder explained. “They have to be on the inside lead. Then, after they get through the turn, they switch to the outside lead because they want to go straight. Halfway down the stretch they’ll switch again just because they’re tired.” If the horse is sound and a natural runner—as all thor- oughbred racehorses are presumed to be—all of this happens smoothly and imperceptibly. The jockey feels it, though, and sometimes can prompt the change in a horse that is either reluctant or too tired to think straight. But when a horse fails to switch leads, it typically strug- gles and fades, for it is no longer running efficiently. “If he’s tired and he doesn’t switch leads, something bad is going to happen,” Snyder said. “He’s going to fall or pull up, or veer out into traffic. Nothing good, that’s for sure.”\nThe first few times he galloped his new filly, Tim noticed that she would not use her left lead. Whether this was be- cause of the imbalance in her shoulder muscles, or whether the failure to use the left lead caused the imbalance (or whether both were caused by her bad feet) was almost irrelevant. It was a serious impediment to her future as a racehorse, and it had to be corrected. Snyder wasn’t sure how he was going to fix the problem, but he knew this much: he wanted it to re- main a secret. “I’d jog her all the way around to the backstretch, then only gallop a half-mile or so, because I knew people were watching. I didn’t want all those big-time trainers and own- ers to see that she couldn’t switch leads. Shit, some of these guys were paying a half-million dollars for horses that looked like jackasses. I had a horse that looked great, but didn’t know how to run. I figured maybe if I could hide that fact for a little while, one of them would want her. Maybe they’d pay real money.” At the very least, Tim was encouraged by what he felt was a diagnostic breakthrough. Prior to being purchased by Snyder, the filly had routinely plodded through workouts of three-eighths of a mile in forty-three seconds, a good five to seven seconds slower than her peers. Thus the declaration by John Shaw (and others) that she was among the most hope- less of cases: a racehorse that would never race; a filly of al- most incomprehensible torpor. Snyder saw and felt something else: a big, strong girl who wanted to run, but couldn’t. “She didn’t know how to switch leads,” he recalled. “I thought if I could get that worked out, maybe she’d be all right.”\nOne day in late February, after a particularly energetic session of breezing, Snyder called his mother-in-law. “If I can figure this out,” he told her, “I think I might have one of the best horses on the East Coast.” Carol Calley didn’t know how to respond. She was happy that Tim seemed excited, optimistic; she respected his knowl- edge of the game. Still . . . One of the best horses on the East Coast? Tim was prone to wild mood swings, ferocious highs and lows that knew no boundaries. He could be thrilled about a horse one day, moribund the next. Although she didn’t say so at the time, Carol figured that eventually the filly would be revealed for what she was: a $4,500 gamble unlikely to ever pay off. But maybe that didn’t really matter. If the horse never gave Tim a trip to the winner’s circle, at least she’d rekindled his passion for horse racing, and maybe for life in general. In that sense, she’d been a solid investment. Eventually, after a few weeks in upstate New York, Snyder noticed that Lisa tended to clip heels when she tried to switch leads. Once properly shod—and he stressed that this does not mean his previous owners failed her in this regard, but rather that more experimentation was necessary; in the case of Lisa’s Booby Trap, this included the use of a rear shoe on a front foot—she was able to work crisply and efficiently, and before long she began to take on the appearance of a real racehorse. Not that anyone really noticed. Finger Lakes is several hundred miles and a metaphorical galaxy away from the cen- ter of the racing universe. While the most notable performers in that season’s three-year-old crop—Super Saver, Lookin’ at Lucky, Drosselmeyer—were plowing through the Triple Crown races, in front of hundreds of thousands of fans and national television audiences, with million-dollar purses on the line, Lisa’s Booby Trap was quietly working out in the obscurity of Finger Lakes Racetrack, in the gloom and mud of an upstate spring.\nWith each passing day she grew stronger and more confident, her stride smoother, longer, less labored. There was something else Tim noticed (and Tebbutt noticed it, as well): the filly’s temperament improved dramatically. Those reluctant to seek mystical reasons for the behavior of animals might point to the fact that just about any creature—including human beings—is prone to orneriness when it doesn’t feel well. Chronic pain will wear away at the spirit of even the strongest animal. If it’s true that Tim Snyder had alleviated a substantial portion of Lisa’s discomfort by correcting her feet and shoulder problems, then it makes sense that she would have developed into a less irritable animal around the barn. Popular mythology notwithstanding, a gentle demeanor is hardly a prerequisite for success among thoroughbred race- horses. Ask anyone who has spent a reasonable amount of time in the sport, and you’ll hear stories of champions who routinely tried to sever the digits of anyone foolish enough to hand-feed them in the stall; or bucked so hard in the paddock that they unseated their riders. Whatever strand of DNA it is that makes a horse fiercely competitive when the starting gate is thrown open can also make him pure hell to be around. Conversely, a horse who likes to nuzzle its handlers in the barn might lack the fire to run. Or not. This much is certain: Lisa’s Booby Trap, who had been frequently glum and reluctant, and sometimes downright nasty, when Tim Snyder first took possession of her, became a more compliant and personable filly on the backstretch of Finger Lakes Racetrack. It was almost as if someone had slipped Prozac into her feedbag. With this sweeter disposition came an improved work ethic at the track. The changes were at first subtle—a livelier gait, less tenderness after walking or breezing—and then more glaring. All of this happened anecdotally, and out of the field of vision of anyone who might care, for Lisa’s improvement was measured only by instinct. A horse can exhibit the characteristics of a runner, but until you put a clock on her it’s all just wishful thinking.\nTim was hesitant in those first few weeks to formally test his filly. Nevertheless, it had become apparent to both Snyder and Tebbutt that Lisa was looking less like her stable- mates at Finger Lakes, and more like a horse who belonged at Belmont or Saratoga. Her improvement went largely unnoticed, but at any racetrack there are people looking for the long shot who isn’t really a long shot; a horse who will go off at healthy odds, despite the fact that she’s actually quite capable of winning. The same mind-set applies to would-be owners and trainers, virtually all of whom spend a good deal of their time angling for new product. “One guy around the barn watched her work a few times,” Tim remembered, “and I could tell he was impressed. He kept saying, ‘When are you gonna run that filly? I like the way she looks.’ ” “Couple weeks, maybe,” Tim told him. “Yeah? Maiden special weights?”\n“Could be,” Tim said coyly. The other man smiled. “Well, if she runs one, two, or three, I’ll give you twenty-five grand for her.” At first, Tim said nothing, simply nodded and clenched his jaw to keep from shouting at the sky. “Twenty-five grand?! Justfor hitting the board? He’d been around long enough to know that horse rac- ing is a poker game, with bluffs and bullshit an integral part of the process. Maybe the man was serious; maybe not. Re- gardless, the unwritten rules of the sport dictated that Snyder feign disinterest. Like a football player reaching the end zone for the first time, he had two choices: dance like a celebratory fool, and risk being branded a novice . . . or act like he’d been there before. Tim chose the latter option. With a hand resting on Lisa’s forehead, he looked at the man and offered a true horse trader’s salvo. “Who said she’s for sale?” The man laughed. “They’re all for sale, Timmy.” Of course she was. They both knew it. Right? At backstretches across the country, at tracks large and small, prosperous and failing; from Churchill Downs to the county fair circuit, horse racing is driven by two things: the gambler’s dollar and the horseman’s passion. But even a soft- hearted trainer knows better than to allow himself to grow too attached to his stock. Horses are raised and developed and trained with a single goal in mind: to turn a profit for their owners. That doesn’t mean they don’t sometimes provoke tender responses in the people who work with them on a daily basis; it simply means that everyone in the game understands the parameters, and a certain hardness will probably make success more likely, and failure a bit more tolerable.\nLisa Calley was a horse lover first, a horseman second. Tim Snyder was a horseman first, second, third, and be- yond. “You know, I’ll sell you anything,” he would say later that summer, while standing improbably, almost shockingly, out- side a barn at venerable Saratoga Race Course. “Ask anyone who knows me. I’ll sell you my truck, the clothes off my back. I’ve sold just about every horse I’ve ever owned. Never got attached to any of them.” Until Lisa’s Booby Trap came along. “This is horse is different,” he said, shaking his head in disbelief. “This is personal. I’ll never sell her.” In April, though, Tim wasn’t so sure, and most proclama- tions about the big bay filly not being on the market were merely misdirection. And yet . . . there was something about her that gave him pause. Maybe it was simply a matter of stat- ure. Lisa was one hell of a handsome horse, as physically im- pressive as any animal Snyder had ever owned. When he took her by the reins and led her from the barn to the track, he could feel the strength in his hands. When he entered her stall, he couldn’t help but be impressed by the sheer size of the filly. Consider for a moment that Zenyatta, arguably the great- est filly in history, stood 17.2 hands high, and was considered an absolute beast—physiologically on par with the top male horses of her generation. Secretariat, known colloquially as “Big Red,” stood 16.2 hands high. At 17.5 hands, Lisa was taller than either of those horses, taller in fact than just about any horse. Of course, there’s more to the making of a racehorse than simply height. But Lisa was strong as well, her body gaining muscle mass and tone with each passing week. If you were a racetrack lifer, wheeling and dealing crappy, slow- footed stock, buying one day, selling the next, never seeing anything pass through your barn that could remotely be mistaken for a Grade I–caliber racehorse, let alone a Triple Crown contender, and suddenly you found yourself bathing a filly seventeen hands tall, with the rippling musculature of a true runner . . . well, you could be forgiven for losing your shit; maybe even for falling in love.\n“Right from the beginning, Timmy was very attached to this horse,” observed Carol Calley. “It wasn’t like him to be that way. And I know it sounds funny, but the horse was very attached to him, too.” The romantic might suggest that the trainer saw some- thing in the horse, beyond merely her name, that reminded him of his late wife. Certainly, as time passed, Tim did noth- ing to dissuade that notion. If others wanted to weave a senti- mental story, well, that was their business. If sportswriters and bloggers felt compelled to grasp at the obvious, fantastic hook—that Lisa Calley had made good on her deathbed prom- ise of returning to life as a racehorse—there was no reason to argue otherwise. “I don’t know about all that reincarnation stuff,” Tim would say at the height of the frenzy. “I mean, she’s a horse. But I will say this: I talk with her all the time. I tell her about my day. I tell her how I’m doing. And I do it just like I used to talk with my old lady.” He stopped, smiled sheepishly.\n“I know how that sounds: kind of crazy. But that’s what I do.” There are so many possible explanations for Snyder’s ini- tial interest in the horse, and for his reluctance to give her up in those first few months. Yes, she was strikingly attractive, but as she gained confidence and fitness, she offered more than merely aesthetic pleasures. Ego and ambition (and maybe a bit of greed) are powerful motivators in any business, and the horseman is hardly invulnerable to these factors. Tim Snyder had never owned or trained a great racehorse; hell, he’d only owned or trained a handful of even competent race- horses. He’d spent his whole life around horses—breaking, training, grooming and shipping them; buying them and selling them with virtually no emotional investment or any hope of hitting the jackpot—and now, all of a sudden, he had a horse in his barn (well, in John Tebbutt’s barn) that might just be something special. A horse that looked and behaved like a real racehorse. A horse no one else wanted or believed in. He had found her and fixed her, and he rightfully took no small amount of pride in that accomplishment. Indisputably, racing is a cruel and fickle game, thus the prevailing wisdom is this: If you’re lucky enough to have a good horse, cash in as quickly as possible. You’re never more than one bad step away from a crippling injury (and, subsequently, a lethal injection); one bad performance away from being worthless on the breeding market. No one had to tell any of this to Tim Snyder. He knew better than anyone that logic and common sense dictated that if someone wanted to buy his $4,500 filly for twenty-five grand, he should get down on his knees, thank God for his unexpected good fortune, take the money, pay off his debts, fix his Taurus wagon, maybe get some decent health insurance, and find a place of his own to live. Then, and only then, if there were a few bucks left over, maybe he could buy another horse. You take whatever victories you find in this game, and you measure success in the smallest of increments.\nTim Snyder considered all of this carefully. But as the mud of April dried and the winter winds blowing off Canan- daigua Lake relented—a sure sign that racing season was on the horizon—Tim began to have second thoughts. For the first time in a long time, he listened to his heart rather than his head.\nMaybe I’ll hang on to her for a while.","url":"https://www.nbcnews.com/dateline/ghost-horse-n96766"}
