{"authors":["Sarkis Zeronian"],"date_download":"2018-10-30 22:07:13","date_modify":"2018-10-30 22:07:13","date_publish":"2015-06-19 08:22:03","description":"A graphic released by the Institute for Government shows 14 departments have decreased in staff size since the spending review of 2010, only three have |","filename":"data/vaneerConsumption/TheGraphicThatShowsWhyCameroonsShouldBeEmbarrassedByTheirModernConservativeParty.json","image_url":"https://media.breitbart.com/media/2015/06/57357305.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_06_19__1540937233.html","title":"The Graphic That Shows Why Cameroons Should Be Embarrassed By Their 'Modern' Conservative Party","title_page":"The Graphic That Shows Why Cameroons Should Be Embarrassed By Their 'Modern' Conservative Party | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A graphic released by the Institute for Government shows 14 departments have decreased in staff size since the spending review of 2010, only three have increased. The three that were so central to David Cameron’s worldview that they merited protection, and indeed growth, were the Department of Energy & Climate Change (“DECC”), the Department for International Development (“DfID”) and the Cabinet Office (“CO”), the department that supports the Prime Minister and administrative functions of government.\nTraditional concerns of Conservative governments such as the Treasury, the Ministry of Defence, the Department of Business, Innovation & Skills and the Home Office, all lost out to the chosen three departments.\nP.J. O’Rourke, the pre-eminent American satirist, once offered The Telegraph his opinion on the British Conservative Party during the leadership election of 2005:\n“The Conservative Party used to be the party of not doing very much, or at most of only doing things which scaled back government programmes. Conservatives wanted to take government out of people’s lives and reduce how much government took from their pockets. But recently, under the influence of Tony Blair, they have started saying that they’re no longer the party of cutting back on government: they’re really the party of using government to give people things. This is a mistake. “The Tories can’t junk all of their economic principles at once. The result is that they end up saying: ‘We’re in favour of giving you all the things the other party say they’ll give you – just a little less of them.'”\nAs all who follow British politics know, since 2010 the Conservative Party has been back in government. Although in a governing coalition with centre-left Liberal Democrat MPs, David Cameron led as senior partner. As Prime Minister he was ultimately responsible for the direction the government took, only intermittently moderated by the restraining hand of others.\nIt is, therefore, fair to say that the broad thrust of government since 2010 represents the general policy approach of Cameron’s Conservative Party. So did Cameron lead his party as a ‘compassionate Conservative’ as O’Rourke described, or did he revert to Thatcherite principles?\nThe Institute for Government has analysed Public Sector Employment Data for 2010 to 2015 provided by the Office for National Statistics. It illustrates the reality of the supposedly “savage culture of Tory cuts” that lay at the heart of the government’s austerity policies.\nIt is fair to acknowledge that the number of full time equivalent civil servants fell by 15 per cent during the period in question (falling short of the 23 per cent target), albeit at a time when the former Chief Secretary to the Treasury Liam Byrne said there was no money. True conservatives, would recognise that as a good start.\nHowever, true conservatives, as opposed to Conservative Party loyalists, would ask why it was that the Prime Minister they elected chose to grow areas of government promoting overseas aid, fighting climate change and employing government functionaries rather than supporting departments key to financial security and to survival in the fight against radical Islam?","url":"https://www.breitbart.com/europe/2015/06/19/the-graphic-that-shows-why-cameroons-should-be-embarrassed-of-their-modern-conservative-party/"}
