{"authors":["Lucia Peters"],"date_download":"2018-10-31 01:39:44","date_modify":"2018-10-31 01:39:44","date_publish":"2018-08-31 13:00:53","description":"Equal parts beloved and reviled, it has nonetheless come to represent the arrival of fall in a way that few other things do. I’m talking, of course, about the Pumpkin Spice Latte — that sweetly spiced espresso drink that graces the menus of coffee…","filename":"data/vaneerConsumption/TheHistoryOfThePumpkinSpiceLatteHowItCameToEmbodyAllThingsFall.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/23/747739d5-a59d-4bf9-98f8-cf9fb27dec90-pumpkin_spice_latte_-_2015_4.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-history-of-the-pumpkin-spice-latte-how-it-came-to-embody-all-things-fall-10222074_1540949984.html","title":"The History Of The Pumpkin Spice Latte & How It Came To Embody All Things Fall","title_page":"The History Of The Pumpkin Spice Latte & How It Came To Embody All Things Fall","title_rss":"NULL","source_domain":"bustle.com","text":"Equal parts beloved and reviled, it has nonetheless come to represent the arrival of fall in a way that few other things do. I’m talking, of course, about the Pumpkin Spice Latte — that sweetly spiced espresso drink that graces the menus of coffee shops across the country for all too brief a time each fall. But what’s the history of the Pumpkin Spice Latte? Is it all down to Starbucks — perhaps the most well-known purveyor of the drink — or is there more to it than that?\nIt turns out that the PSL’s rise to prominence does have a lot to do with the Seattle-based coffee giant. Although it's generally agreed upon that Starbucks didn't straight-up invent the idea of combining pumpkin pie and coffee — heck, anyone who's ever enjoyed a cup of coffee alongside a slice of pumpkin pie can attest to that — we can actually trace a direct line from the current pumpkin spice fad right back to the PSL's debut on the Starbucks menu. What's more, since the drink's inception, the fall flavor has taken on a life of its own, growing beyond simply one espresso drink into a full-fledged cultural phenomenon.\nHere’s the story of how the Pumpkin Spice Latte came to be — and how it became so much more than the sum of its cinnamon-dusted, caffeinated parts.\nFinding The Perfect Fall Drink\nIn 2003, Peter Dukes was a product manager in Starbucks’ espresso division. The idea of seasonal Starbucks drinks wasn’t new at the time; indeed, according to Starbucks Melody, one such drink, the winter holiday favorite known as the Eggnog Latte, had been around in one form or another since the mid-‘80s. However, the annual arrival of special, limited-edition drinks wasn’t nearly the Event-with-a-capital-E back then that it is today — although the company had just seen something that hinted at a bright future: The Peppermint Mocha debuted during the 2002-2003 winter holiday season to great success. Could the Peppermint Mocha’s success be replicated? And if so, could it work for different seasons?\nThat's the answer, by the way — a resounding yes (or YAAAAAS, if you prefer). But let's not get ahead of ourselves; we still have to get from Point A to Point B. Dukes was the one tasked with capturing Peppermint Mocha levels of success with a new drink for the autumn season — and so, in the spring of 2003, he and a team of R&D folks headed into a top secret room on the seventh floor of Starbucks’ Seattle headquarters termed “the Liquid Lab\" and got to work.\nAccording to Seattle Met’s 2014 deep dive into the PSL’s backstory, the group brainstormed a list of 20 possible fall latte flavors; then, it surveyed Starbucks customers online about which latte ideas appealed to them the most as seasonal options. Surprisingly, the idea of a “pumpkin pie latte” just didn’t do it for most of the respondents — they were more into chocolate- and caramel-based drinks. But when the time came to narrow the list of 20 down to four, which would then be mocked up as prototypes and brought to a team of higher ups to find one winner for development approval, Dukes and his team included the pumpkin pie option anyway.\nThe other three options were a chocolate-caramel drink, an orange-and-spice latte, and a “cinnamon streusel latte” which was later reborn as the Cinnamon Dolce Latte — but although many of those picks were solid ideas based on the survey data, the pumpkin pie latte stood out as something unique worth pursuing. Although the flavor combination wasn’t unheard of at the time — according to Seattle Met, a pumpkin pie latte had previously appeared at a few other coffee shops around the country, including the Indiana joint J.L. Hufford Coffee and Tea Company — it was certainly new territory. So, the team got the go-ahead to develop it further.\nThe PSL Is Born\nYou’re probably familiar with how the researchers tackled the nailing of the latte’s flavor: According to company lore, they all gathered together and literally ate pumpkin pie while drinking espresso. As they did so, they attempted to figure out which elements of the baked good played best with the espresso — and according to Seattle Met, they ultimately decided to focus on two main components: Pumpkin and spice. As they mocked up drink after drink, they played around with raising and lowering the levels of these two components, tasting each trial carefully to see what worked and what didn’t. The winner included high levels of both pumpkin and spice. The use of pumpkin sauce as opposed to syrup was part of the equation, too, by the way; heavier than syrup, the sauce helped replicate the mouthfeel of pumpkin pie, Seattle Met reported.\nThe battle wasn’t done after the drink itself was finally perfected, though; they also had to name the thing, which turned out to be easier said than done. Among the many monikers that were brought to the table during the naming process was the “Fall Harvest Latte” — but although that title evoked the season of the drink, it didn’t actually tell customers anything about what the drink actually tasted like. It was summarily rejected on those grounds. “Pumpkin Spice Latte,” meanwhile, presented an elegant yet cozy solution: It prepared you for the entire flavor profile — pumpkin, cinnamon, clove, nutmeg, milk, and espresso — while also evoking the kind of warm-fuzzy feelings many of us feel about the fall. Et voila! The Starbucks PSL was born.\nAn Instant Success\nThe Pumpkin Spice Latte’s first test rolled out at 100 Starbucks stores in Vancouver, British Columbia in Canada, and Washington, D.C. in the United States during the fall of 2003 — and it was immediately clear that the company had a hit on its hands. “Within the first week of the market test, we knew we had a winner,” Dukes said in a retrospective of the Pumpkin Spice Latte published over at the Starbucks Newsroom in 2014. “Back then,” he continued, “we would call store managers on the phone to see how a new beverage was doing, and you could hear the excitement in their voices.”\nThe drink was subsequently rolled out nationwide during the fall of 2004 — and ever since then, it has grown in popularity with each successive season. The PSL’s dedicated Twitter account hit the scene in 2014; it now has nearly 110,000 followers. Its corresponding Instagram account became verified in 2015; more than 35,5000 people follow the drink over there. It’s now available in bottled form in grocery stores, as well as made fresh at actual Starbucks — and according to the company, it’s their top-selling seasonal beverage of all time.\nPumpkin Spice Is Suddenly Everywhere\nEven though Starbucks may not have been the first to combine the flavor of pumpkin pie with the almighty latte, it’s clear that the company's version of the PSL — and its concept of the treat as a seasonal specialty — launched the drink into the mainstream. Indeed, in the 15 years following the Starbucks PSL’s debut, others have eagerly grabbed at their own slice of the (pumpkin) pie (sorry, not sorry): McDonald’s McCafe line began offering a Pumpkin Spice Latte in 2013; Dunkin’ Donuts not only has a Pumpkin Spice Latte, but also a straight-up Pumpkin Coffee on the menu each fall; heck, you can even get a PSL at 7-Eleven, although as Thrillist noted in 2015, it’s the kind you get out of a machine by pressing a single button, rather than the kind that’s made by hand by an actual human.\nAnd that’s to say nothing of the Pumpkin Spice Explosion (Pumpkin Splosion?) that’s erupted in recent years; these days, everything from cereal to yogurt and from pretzels to rum gets blasted with the flavors of cinnamon, nutmeg, allspice, ginger, cloves, and pureed pumpkin once the waning days of summer roll around.\nThe drink's dominance has even spread beyond the realm of food: It's now a hair color trend; a fashion statement; and, as evinced by this year's Leaf Raker's Society Facebook group, an entire lifestyle. Love it or hate it, one thing’s for sure: The PSL isn’t going anywhere.\nNow if you’ll excuse me, I have a latte to order.","url":"https://www.bustle.com/p/the-history-of-the-pumpkin-spice-latte-how-it-came-to-embody-all-things-fall-10222074"}
