{"authors":["Meghan Demaria"],"date_download":"2018-10-31 01:48:39","date_modify":"2018-10-31 01:48:39","date_publish":"2018-09-13 23:19:46","description":"Annalise Keating is back. After losing her job as a professor at Middleton's law school, Professor Keating is in the classroom once more. But this doesn't look like her so-called \"How to Get Away with Murder\" intro class. Annalise is back in the…","filename":"data/vaneerConsumption/TheHowToGetAwayWithMurderSeason5TrailerShowsAnnalisesReturnToTheClassroomVIDEO.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/c38f6f8e-38b6-49f3-910c-afbb71ff1efa-screen-shot-2018-09-13-at-40824-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-how-to-get-away-with-murder-season-5-trailer-shows-annalises-return-to-the-classroom-video-11912390_1540950519.html","title":"The 'How To Get Away With Murder' Season 5 Trailer Shows Annalise's Return To The Classroom - VIDEO","title_page":"The 'How To Get Away With Murder' Season 5 Trailer Shows Annalise's Return To The Classroom — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Annalise Keating is back. After losing her job as a professor at Middleton's law school, Professor Keating is in the classroom once more. But this doesn't look like her so-called \"How to Get Away with Murder\" intro class. Annalise is back in the classroom in the How to Get Away with Murder season 5 trailer, but it's not clear exactly what she's teaching.\n\"And to think, they wouldn't even let me step foot on this campus a few months ago,\" Annalise says to an auditorium of students in the new trailer. Based on the fact that the remaining members of the Keating Five are in the audience, it looks like Annalise is teaching third-year students now. (Side note: Why is Connor in the same classroom as Michaela and Asher if he dropped out of school last season? Surely he's at least a semester behind them.)\n\"Despite what you think, this is not a class at all,\" Annalise tells the confused-looking students. \"This is a sacrifice. It's brutal, mean, depressing. But that's what it costs to change the world.\" Her infectious smile and no-nonsense words are enough to get the class pumped up, but Michaela and Connor look more worried than excited for the semester ahead.\nABC on YouTube\nLast season focused more on Annalise's class action lawsuit against the State of Pennsylvania. After meeting with none other than Olivia Pope herself, Annalise successfully argued her case in front of the Supreme Court. With all of that going on, not to mention Laurel's going into labor and her drama with her dad, there wasn't a ton of time for Annalise to worry about going back to Middleton.\nBut it looks like now that the case is settled, Annalise has her old job back. However valid Middleton's reasons for suspending her were — and addressing Annalise's struggle with addiction was super important — it's probably hard for a law school not to hire back someone who's just won a landmark Supreme Court case. Middleton president Soraya Hargrove doesn't appear in the trailer, but there could be a place for her in season 5, depending on how much of the season is devoted to Annalise's continued recovery.\nFortunately, there's one majorly happy event in the trailer: Connor and Oliver's wedding. Annalise is seen smiling and dancing at what appears to be their wedding reception, but, of course, that joy doesn't last long. She asks Frank why he looks \"like someone just died,\" which likely means that, well, someone did.\nABC/Richard Cartwright\nLaurel's parents and baby aren't in the trailer — could one (or more) of them be dead, and Frank is the first to know? Hopefully, for Laurel's sake, it's not her child. She just won custody of the baby back from her father, and she really did seem excited about becoming a mom. But considering the mystery surrounding her parents — fans still don't know why Wes met with Laurel's mom before he died — it's not out of the question that one or both of them will meet an untimely death.\nMiddleton law student Gabriel Maddox, who may be Bonnie's son, also shows up at the end of the trailer, with a fairly threatening voiceover. \"Once a person commits murder, something inside them is rotten,\" Gabriel says. Is he referring to his own actions, or does he know about what the Keating Five, and Bonnie, have done over the years? If Gabriel knows about his maybe-mom's killing Rebecca, he's probably not eager for a reconciliation.\nThere are still plenty of questions for the show to answer, and the new trailer only raises more of them. But based on the fact that Annalise is back at Middleton, it looks like she might actually be able to move her own life and career forward, instead of just cleaning up the messes her employees and students keep making.","url":"https://www.bustle.com/p/the-how-to-get-away-with-murder-season-5-trailer-shows-annalises-return-to-the-classroom-video-11912390"}
