{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:17:40","date_modify":"2018-10-30 22:17:40","date_publish":"2016-12-14 00:00:00","description":"The House of Lords Brexit committee is concerned that thousands of jobs in the City could be lost if a transition deal is not put in place.","filename":"data/vaneerConsumption/TheHouseofLordswantsatransitionBrexitdealforbanks.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_house-of-lords-brexit-committee-transition-deal-bank-jobs-banking-2016-12_1540937860.html","title":"The House of Lords wants a transition Brexit deal for banks","title_page":"    House of Lords Brexit committee to call for transition deal to protect bank jobs - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Canary Wharf, home to the London headquarters of many of the UK's biggest banks. REUTERS/Toby Melville LONDON — A House of Lords committee on Brexit is expected to call for the government to put a transitional deal in place with the European Union to ease the process of leaving the bloc.\nThe Guardian reports on Wednesday that the committee will publish a report on Thursday warning that thousands of banking jobs will be lost if a transition deal is not put in place as banks need certainty and will relocate jobs to the continent if trade negotiations look like they will drag on.\nThe House of Lords report is set to be the latest warning that thousands of finance jobs could be lost if a transition deal is not put in place. It is also yet another voice in the growing chorus calling for such a deal.\nBank of England Governor Mark Carney and Chancellor Philip Hammond have been the most prominent figures calling for a transition deal. Hammond told the Treasury Select Committee earlier this week that there is an \"emerging view\" that \"having a longer period to manage the adjustment between where we are now as full members of the EU and where we get to in the future as a result of negotiations would be generally helpful.\"\nHowever, \"Hard Brexiters\" want Britain to pull out of the EU at the end of the two-year negotiating period mandated for leaving, regardless of whether any trade deals have been reached. The Prime Minister has also signalled that she is unwilling to pursue a transition deal.\nAt stake for the City is passporting rights and potentially thousands of jobs. Around 5,500 firms with a combined turnover of £9 billion rely on EU rules that allow them to \"passport\" local licences into other countries and sell their services abroad.\nIf those rights, are lost thousands of jobs could relocate to places like Paris, Frankfurt, or Dublin, which will retain the rights. A confidential Deutsche Bank briefing document obtained by Business Insider predicted that top banks would look to move out of Britain to elsewhere in Europe as a result of the June 23 Brexit vote.\nThe Guardian says the Lords committee has been \"struck by the urgent need for financial institutions to make decisions\" and is alarmed by just how many jobs are at stake. JPMorgan and UBS have already publicly stated that they may have to move thousands of jobs out of the UK as a result of Brexit and Goldman Sachs is said to be considering moving up to 2,000 roles from Britain to the EU.\nThe boss of the British Bankers' Association (BBA) wrote in an article earlier this year: \"Businesses can't wait to the last minute. It takes years to move operations. Banks might hope for the best but have to plan for the worst... Their hands are quivering over the relocate button.\"","url":"https://www.businessinsider.com/house-of-lords-brexit-committee-transition-deal-bank-jobs-banking-2016-12"}
