{"authors":[],"date_download":"2018-10-30 00:59:21","date_modify":"2018-10-30 00:59:21","date_publish":"2018-08-23 00:05:43","description":null,"filename":"data/vaneerConsumption/TheHollywoodComplianceDecree.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Taken.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861161.html","title":"The Hollywood Compliance Decree","title_page":"The Hollywood Compliance DecreeThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Movies used to be inspiring for boys and romantic for girls, often both in the same film. The vast number of them had a stalwart male hero and a smart, beautiful woman to be won or saved. This simple formula powered most of the screen art for more than a hundred years, well into the last decade. It’s all over now, not because the Hero Saving Damsel in Distress scenario is any less popular, it just became politically incorrect. Hollywood has killed that golden goose, at the price of any future profit from it, for the prize of wokeness.\nTake the blockbuster thriller, Taken, celebrating its tenth anniversary. In that action classic, an overprotective divorced dad rescues his teen daughter from white slavers by applying the lethal skills of his former trade — while giving his Bond Girl ex-wife second thoughts about the rich beta male she married. Taken was a monster hit. It was also the last of its kind. A film that audiences rewarded en masse ten years ago would today melt down every college snowflake and cause pearl clutching in Beverly Hills.\nThere is so much intersectionally wrong with the movie. Start with the white heteronormative patriarch portrayed by Liam Neeson. He keeps warning his nubile daughter that the world is a dangerous place for such as her. I mention the comeliness of actress Maggie Grace in the role because it’s the reason for her character’s kidnapping! The Middle Eastern white slavers responsible (I know I’m reaching my trigger warning quota) later force her to dance half naked for her prospective masters. And with her daughter’s life in danger, the hero’s former wife, Bond Girl Famke Janssen, realizes the millionaire milquetoast she married is good only as the funder of her real man-ex’s rescue mission.\nAll of the aforementioned elements are anathema to post-Obama Hollywood. The reality-based concept of a man using his superior physical prowess to protect a female loved one has given way to the fantasy of unfeminine heroines overpowering brawny men by movie-mythic combat moves. The latter might be acceptable as an escapist alternative to the former. Except the former has ceased to exist. Today, even Disney princesses appear more at ease shooting arrows on horseback than dreaming that someday their prince will come. They ignore the countless real girls and women who do just that — expect a strong, protective man to love them.\nSeveral progressive forces have led to the current absurd state of cinema, the top three being feminism, identity politics, and feminism. They come forth generically from the leftist groupthinkers who now run the movie industry, who would neutralize every factor that made Taken a hit. But what if the new rules for Hollywood are not just instinctive but actually codified? What if there exists a secret Industry-wide rulebook citing the demands for all future productions, so that hopeful filmmakers must obey them or lose their hope for a movie deal?\nA young journalist uncovers such a clandestine Hollywood blacklist in my second novel, Paper Tigers, coming in October from Deeds Publishing. Known as the Compliance Decree, it’s the brainchild of the most powerful director-producer in the film community, made rabid by the result of the last Presidential election. Below are the Compliance Decree’s Ten Commandments:\nOne — three or more heteronormative relationships must be counterbalanced by at least one LGBT one.\nTwo — one or more villains of a racial minority must be counterbalanced by at least one white male.\nThree — one or more Muslim villains must be counterbalanced by at least one positive Muslim character.\nFour — overtly conservative characters, including police and military, must be shown in a neutral or negative light, so as not to appear as role models.\nFive — overtly Christian characters must be shown in a neutral or negative light, so as not to appear as role models.\nSix — female sexuality must be de-emphasized.\nSeven — female domesticity must be de-emphasized.\nEight – a male hero must not display any salacious interest in a woman based on her physical appearance.\nNine — a heroine in combat must be as formidable as any male counterpart, including against male combatants.\nTen — a heroine in peril must extricate herself from danger with no male assistance.\nJudging by the films coming out, who can say these Commandments are not written in stone somewhere beneath Sunset Boulevard.\nLou Aguilar is a published novelist, produced screenwriter, cultural essayist, and former USA Today reporter. His second novel, Paper Tigers — a Washington romance in the mad time of Trump — will be out in October from Deeds Publishing.","url":"https://spectator.org/the-hollywood-compliance-decree/"}
