{"authors":[],"date_download":"2018-10-30 00:59:06","date_modify":"2018-10-30 00:59:06","date_publish":"2015-07-23 08:00:00","description":null,"filename":"data/vaneerConsumption/TheHeroasSupererogator.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/07/Heroism_defined_on_MoH_Day_at_Arlington_140325-A-DQ287-914.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861146.html","title":"The Hero as Supererogator","title_page":"The Hero as SupererogatorThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The political arena is much given to trash talking these days, with invective, umbrage, and posturing in full play. Internecine insults, harrumphs, and blowbacks are exploding everywhere. Apparently, some of us are “crazies,” “bigots.” Others of us fail as “patriots,” and “heroes.” This last term, ‘hero,’ has particularly intrigued me through the years, and Donald Trump’s recent suggestion that John McCain didn’t fill the bill leads me to give the notion a closer look.\nHow can it apply without dissent to a passerby, an insurance salesman or greengrocer, who wades out into hip-deep rushing water to pull a woman from a stalled car, but not so readily apply to a soldier headed out on his eleventh motor patrol in an Afghan district known for its IEDs? The former is far more likely to get a medal or certificate, even though the danger is real for them both. So what’s the difference?\nIt seems to me that it depends upon the level of sacrifice or strenuous achievement one manages “above and beyond one’s call to duty” — supererogation. The citizen happening upon the trapped driver has no generally accepted duty to put himself in harm’s way to effect the rescue. The “grunt” who pulls his buddy from a burning Humvee or MRAP does.\nSimilarly, an elderly couple who adopts a child with muscular dystrophy gets more credit than would its natural parents, had they followed through on their responsibility (the “perfect duty” to care for their offspring, as distinct from the “imperfect duty” to do good in the world). Of course, the culture of amniocentesis-leading-to-abortion is pervasive, so we may count the mother who carries a impaired child to term heroic, but in a morally saner world, her behavior would not be so astonishing.\nOf course, heroes are sometimes born through the sacrifice of business and career, community standing and friendship, or peace and quiet. Sometimes it’s just a matter of sitting on the front of the bus when you’re supposed to sit on the back, of sticking your neck out for a good cause with the result that you’re shunned, fired, or vilified in print.\nSo back to the POW question: Are you a hero if you spend years in a vile prison camp, suffer torture and inattention to your wounds, and refuse special early release because your father’s an admiral? Well, what’s the POW’s duty? Did he go above and beyond it? Not if I understand my own army training. You’re supposed to engage in “survival, evasion, and escape,” and to remain faithful to your colleagues by not taking special favors. The old “name, rank, and serial number only” standard has been loosened to allow for phony confessions, such as the one McCain signed (and rues) regarding his “war crimes.” He didn’t reveal any secrets, and he endured, though he’s said that suicide crossed his mind. So yes, he did his duty in admirable fashion.\nSome POW service can be heroic, as in the case of Admiral Stockdale, leader of the “Alcatraz Nine” in the “Hanoi Hilton.” For his astonishing feats, he received the Congressional Medal of Honor. But persisting in misery in a prison camp is SOP, even as persisting in misery for months on the Khe San combat base under continuous ground, rocket, artillery, and mortar attacks was SOP.\nBeing captured is akin to being wounded, to being crippled, sometimes gravely. It’s more a matter of misfortune than achievement. On the other hand, it’s not a demerit; to say that you “like people who weren’t captured” is like saying “I like people who weren’t wounded.” Dumb.\nMy uncle Clifton suffered the Bataan Death March and was interred and abused in Japan for the duration of the war. He was so broken that my father was tasked to handle his financial affairs until his death. Did he get a medal for his sufferings? No, but he did receive veterans care in many forms, and rightly so.\nIt doesn’t seem fair. Uncle Cliff puts his life on the line in the Philippine jungle and gets no medal. Another fellows wades into suburban, hip deep water one time, and they name the street after him. Well, yes. But the latter didn’t sign up for the rescue; Cliff did sign up for the prospect of mayhem at the hand of our enemies.\nMaybe it’s a little like advanced academic courses. An A in arithmetic isn’t the same as an A in differential calculus. Though civilian heroism can be just as harrowing, the grading scale is different. Enroll in a tough course (military, police, fire fighting), and you face a tougher curve.\nSome say that those who’ve never served in the military are in no position to pass judgment on those who have. That’s like saying Stephen Hawking can’t evaluate the players in a televised cricket match. There simply are standards appropriate to the various endeavors, and all sorts of amateurs and non-participants can make accurate calls. I’ve never worked the deck of a Bering Sea crab boat, but I can still rank the performances of the deckhands on Deadliest Catch.\nLook, I signed up for the Army in the 1960s, and I’m not a hero. I was commissioned an infantry officer during the Vietnam War, but we had a draft back then, and the key question was not whether we’d serve, but how. I chose ROTC at my college, preferring to be an officer. But the National Defense Service Medal I got for that enlistment has been called “Alive in ’65,” since duty was relatively inescapable for able-bodied young men of that era. I served out most of my time in the National Guard and Reserves in the day between Vietnam and Iraq, when we stuck to training stateside — some nice travel and income, exhilarating challenges, fond camaraderie, some cool adventures, flying around in helicopters, talking on armored vehicle radios — that sort of thing. But no bullets or RPGs ever headed my way.\nMy son, on the other hand, was appropriately called a hero by my father at his wedding rehearsal banquet. As a Marine, he’d come home between tours in Iraq, where he was part of the push up from Kuwait and later ran convoys through the Sunni Triangle. (He once called me on a satellite phone from a Saddam Hussein palace portico, and I urged him to be careful. He assured me that when Marines traveled, they were “both safe and dangerous.” Oorah!) The draft was over, and he didn’t have to sign up. As for my dad, he joined up in WWII as a chaplain when he could have stayed home safely. Compliments of the Navy and Marines, he found himself on Guadalcanal and points north in the neighborhood of Japan. In my totally unbiased estimation, they’re heroes. In signing up, they took on risks they didn’t have to. Nevertheless, they weren’t awarded medals for heroism. They were just doing the jobs that went with the territory. (In contrast, an ordinary citizen traversing submarine-infested waters or taking a run at Saddam’s forces would be duly recognized for supererogation.)\nMost heroes would prefer not be called heroic and would be offended that people got all worked up over their not being called so. When I was a pastor in Illinois, we flew in a Medal of Honor recipient from WWII (and a winsome Christian) to ride on our Fourth of July float. In France, years ago, he’d grabbed a blanket and thrown himself on a grenade, saving his buddies. The blast tore him up pretty well, but he survived. When asked about it, he simply said sheepishly that he acted instinctively, without thinking, and that it was nothing heroic.\nLook, I think soldiers doing their duty are marvelous, exhibiting the characteristics represented in the military acronym, JJDIDTIEBUCKLE (Justice, Judgment, Dependability, Initiative, Decisiveness, Tact, Integrity, Enthusiasm, Bearing, Unselfishness, Courage, Knowledge, Loyalty, and Endurance). Command will honor you if you “overdo” them and ding you if you “underdo” them. But in good measure, they’re expected of all.\nOf course, the bigger issue is whether or not your present performance is admirable and sensible, notwithstanding what heroic deeds you did in the past. I’m reminded of a top NCO in our Illinois unit. He had service chevrons up his sleeve, and he could tell stories of hair-raising HALO jumps (high altitude [drop], low [parachute] opening, to avoid detection). I’m guessing he volunteered for this sort of dangerous work and, so, got close to heroism. But he was a joke in the unit. He didn’t do much, and when we convoyed to Wisconsin for summer duty, he slipped away to cultivate an affair he’d earlier initiated. Back in the Chicago area, we discovered that his heartbroken wife had put on a nightgown, lay on the hood of their car in the garage, and turned on the motor, attempting suicide. Maybe he was a hero once, but he wasn’t worth shooting now. (Neither were McCain and Trump when they undertook marriage wrecking infidelities of their own.)\nWell, it’s fun to analyze trash talk and the trashy trashing of trash talk, but we need to get back to straight talk. And we can hold off on the medal ceremonies for the present.","url":"https://spectator.org/63536_hero-supererogator/"}
