{"authors":["Lianna Brinded"],"date_download":"2018-10-30 22:40:08","date_modify":"2018-10-30 22:40:08","date_publish":"2016-12-12 00:00:00","description":"The committee says 'any negative impact of Brexit on the UK economy is likely to be replicated, or even magnified, for the Irish economy.'","filename":"data/vaneerConsumption/TheHouseofLordsispushingforspecialBrexittreatmentforNorthernIreland.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_house-of-lords-eu-select-committee-push-for-special-brexit-treatment-for-northern-ireland-2016-12_1540939208.html","title":"The House of Lords is pushing for special Brexit treatment for Northern Ireland","title_page":"    House of Lords' EU Select Committee push for special Brexit treatment for Northern Ireland - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Tim Fields / Flickr LONDON — The House of Lords' EU Select Committee is pushing for Northern Ireland to have special status after Brexit because \"any negative impact of Brexit on the UK economy is likely to be replicated, or even magnified, for the Irish economy.\"\nAccording to a report released by the committee on Monday, the House of Lords believes that Northern Ireland should maintain its open land border with the Irish Republic and have devolved control over EU immigration.\nIn other words, even if Britain as a whole enacts a \"hard Brexit\" — the UK leaving the European Union without access to the single market in exchange for complete control over immigration — the House of Lords thinks Northern Ireland should be able to have:\nBritain voted for a Brexit by a slim majority on June 23 and, since then, there has been much speculation on when the new prime minister, Theresa May, will trigger Article 50 and start the official two-year negotiation process for Britain to leave the EU. March 2017 is the current target date.\nMay said she will not give a \"running commentary\" on how negotiations are going but she has made it clear in various speeches that her government is prioritising immigration restrictions. This would imply a \"hard Brexit\" because the EU's official line is that it will not allow the UK to curb immigration and keep membership of the single market at the same time.\nHowever, the committee's findings fall in line with Prime Minister Theresa May's promise to Northern Ireland that there will not be a return to the \"borders of the past\" — which suggests that Northern Ireland should be given special treatment.\n\"I have been clear, the secretary of state for Northern Ireland has been clear, the taoiseach has also said that on both sides of the border we don't want to see a return to the borders of the past,\" she said in October this year, when Northern Irish officials voiced concerns over the impact Brexit will have on the region.\n\"I think it's worth reminding the house that actually the Common Travel Area has been in place since the 1920s, so it was there well before we were both members of the European Union. We are working together with the government of the Republic and obviously I've had discussions on this with the first minister and the deputy first minister in Northern Ireland.\n\"We want to ensure, as I say, that we don't see a return to the borders of the past.\"\nWhile the House of Lords committee concluded that \"the unique nature of UK-Irish relations requires a unique solution, and calls on the UK and Irish Governments to negotiate a draft bilateral agreement,\" it highlighted how it was \"not a given\" that the remaining EU member states would support this during Brexit negotiations.\n\"It is not a given that the EU will tolerate uncontrolled movement from the UK into the EU, via the UK-Irish border. Both the UK and Irish Governments must seek to convince EU partners of the necessity of maintaining the reciprocal rights enjoyed by UK and Irish citizens, both because of the unique nature of UK-Irish relations, and in view of the specific circumstances in Northern Ireland,\" said the report.","url":"https://www.businessinsider.com/house-of-lords-eu-select-committee-push-for-special-brexit-treatment-for-northern-ireland-2016-12"}
