{"authors":["Caitlin Cruz"],"date_download":"2018-10-31 00:02:00","date_modify":"2018-10-31 00:02:00","date_publish":"2018-10-28 19:58:04","description":"One of the most visible testaments to the violence that comes from anti-Semitism weighed in on the shooting at a synagogue on Saturday, which left nearly a dozen people dead. The U.S. Holocaust Memorial Museum condemned the shooting in Pittsburgh…","filename":"data/vaneerConsumption/TheHolocaustMuseumRespondsToThePittsburghShootingWithAWarningAboutUncheckedHatred.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/28/9c6504ae-92ad-41c5-9f0b-15ef7a53831e-getty-632849090.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-holocaust-museum-responds-to-the-pittsburgh-shooting-with-a-warning-about-unchecked-hatred-13011132_1540944120.html","title":"The Holocaust Museum Responds To The Pittsburgh Shooting With A Warning About \"Unchecked Hatred\"","title_page":"The Holocaust Museum Responds To The Pittsburgh Shooting With A Warning About \"Unchecked Hatred\"","title_rss":"NULL","source_domain":"bustle.com","text":"One of the most visible testaments to the violence that comes from anti-Semitism weighed in on the shooting at a synagogue on Saturday, which left nearly a dozen people dead. The U.S. Holocaust Memorial Museum condemned the shooting in Pittsburgh and prayed for those \"callously murdered\" during a Shabbat service.\n\"The United States Holocaust Memorial Museum strongly condemns the shooting at the Tree of Life synagogue in Pittsburgh and sends its deepest sympathies to the victims and families of those who were callously murdered,\" the museum said in the statement released on Saturday.\nThe museum — a testament to the horrific murders of 6 million Jewish people during the Holocaust — specifically highlighted the alleged shooter's anti-Semitic comments during the attack. \"Before opening fire, the alleged perpetrator reportedly yelled, 'All Jews must die!' The Museum reminds all Americans of the dangers of unchecked hatred and antisemitism which must be confronted wherever they appear and calls on all Americans to actively work to promote social solidarity and respect the dignity of all individuals,\" the statement read.\nEleven people were shot and killed at the synagogue. The people killed were Rose Mallinger, 97; Joyce Feinberg, 75; Daniel Stein, 71; Richard Gottfried, 65; Jerry Rabinowitz, 66; brothers Cecil, 59, and David Rosenthal 54; spouses Bernice, 84 and Sylvan Simon, 86; Melvin Wax, 88; and Irving Younger, 69, according to USA Today.\nThe Anti-Defamation League (ADL), which tracks anti-Semitic activity, said on Saturday that the attack on the Squirrel Hill synagogue is the deadliest attack on Jewish people in America. \"We believe this is the deadliest attack on the Jewish community in the history of the United States,\" the organization said in a statement. \"We are actively engaged with law enforcement to support their investigation and call on authorities to investigate this as a hate crime.\"\nThe alleged shooter faces two hate crime charges in addition to 27 others, according to CNN. \"The crimes of violence are based upon the federal civil rights laws prohibiting hate crimes,\" U.S. Attorney Scott Brady and FBI Special Agent Bob Jones in a statement, according to CNN.\nThe network also reported the suspect could face the death penalty if he is convicted of a hate crime.\nThe ADL called the timing of the attack \"simply unconscionable\" when it called for a hate crime investigation. \"It is simply unconscionable for Jews to be targeted during worship on a Sabbath morning, and unthinkable that it would happen in the United States of America in this day and age,\" the organization said in a statement.\nJonathan Greenblatt, the CEO of the ADL, elaborated on the \"very difficult 24 hours for the Jewish community\" in a piece for The New York Times, saying the \"horror\" of the shooting is \"shocking, [but] it is not entirely surprising.\"\n\"All Americans — online and in their communities — and all responsible leaders from across our society must step forward and clearly denounce this hate,\" Greenblatt wrote. \"People of all faiths and ideologies must speak out clearly and forcefully against anti-Semitism, scapegoating and bigotry in our society.\"","url":"https://www.bustle.com/p/the-holocaust-museum-responds-to-the-pittsburgh-shooting-with-a-warning-about-unchecked-hatred-13011132"}
