{"authors":["Alicia Lu"],"date_download":"2018-10-30 22:24:44","date_modify":"2018-10-30 22:24:44","date_publish":"2014-08-15 17:57:22","description":"By now, you've probably seen at least a handful of friends — and perhaps even some famous people — on Facebook pour ice water over their heads. The Ice Bucket Challenge raises awareness for ALS, or Amyotrophic Lateral Sclerosis, also known as Lou…","filename":"data/vaneerConsumption/TheIceBucketChallengeCausedThesePricelessReactionsAndRaisedSeriousPHOTOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/9dfde781-992b-4110-805c-446b22a2fc54.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35931-the-ice-bucket-challenge-caused-these-priceless-reactions-and-raised-serious-photos_1540938284.html","title":"The Ice Bucket Challenge Caused These Priceless Reactions (And Raised Serious $$) - PHOTOS","title_page":"The Ice Bucket Challenge Caused These Priceless Reactions (And Raised Serious $$) — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"By now, you've probably seen at least a handful of friends — and perhaps even some famous people — on Facebook pour ice water over their heads. The Ice Bucket Challenge raises awareness for ALS, or Amyotrophic Lateral Sclerosis, also known as Lou Gehrig's Disease. Though it might seem silly — and it is hilariously silly — the challenge has been instrumental in raising money for the cause. Since July 29, more than 70,000 donors have given $4 million to the ALS Association. But the icing on the cake may be the videos themselves, and all the wincing faces they inspire.\nBasically, challenge participants have to record themselves dumping a bucket of ice water over their heads, but before they do so they challenge a handful of other people to also complete the task within 24 hours. If they don't take on the challenge, they have to donate $100 to an ALS organization of their choice. But since humanity can be really beautiful once in a while, people have been donating either way. And since the cause is such an important one — 5,600 people in the U.S. are diagnosed every year — many famous faces have winced for the challenge too.\nFrom pop stars like Justin Timberlake to politicians like Chris Christie and even lifestyle maven Martha Stewart, celebs are braving the cold for ALS. Here is our visual roundup of the best \"Holy sh*t that's cold!\" faces from the Ice Bucket Challenge and what these brave souls are probably thinking.\nMark Zuckerberg\n\"I better get at least 500k likes for this.\"\nEmmy Rossum\n\"Why did I wear this bikini top when I should be wearing a damn poncho?!\"\nMickey Rourke\n\"Nope, the goggles didn't help at all.\"\nMatt Lauer\n\"Why did I bother showering this morning?\"\nMartha Stewart\n\"Just remember the end goal, Martha: challenging Gwyneth Paltrow and watching her mess up her hair.\"\nEthel Kennedy\n\"You better accept my challenge, Obama, or I'm coming after you.\"\nConan O'Brien (Who, the Wise Guy That He Is, Thought That the ALS Association Would Pay Him $100 For Dumping Ice Water on His Head)\n\"I want my money.\"\nJimmy Fallon, Rob Riggle, Horatio Sanz, Steve Higgins, and Every Member of The Roots\n\"Aaaaaaaahhhhhhhhh!\"\nLet's Take a Closer Look at Jimmy's Face:\n\"Yup, still cold.\"\nImages: emmyrossum/Instagram, YouTube, Maxwell Kennedy/Facebook","url":"https://www.bustle.com/articles/35931-the-ice-bucket-challenge-caused-these-priceless-reactions-and-raised-serious-photos"}
