{"authors":["David Scutt","Business Insider Australia"],"date_download":"2018-10-31 00:10:06","date_modify":"2018-10-31 00:10:06","date_publish":"2018-07-11 00:00:00","description":"After largely dismissing the introduction of tariffs on $34 billion worth of Chinese imports late last week, US stocks, like others around the world, were roiled on Wednesday as the Trump administration announced a list of $200 billion in Chinese imports that could soon attract tariffs of 10%.","filename":"data/vaneerConsumption/TheimpactofthelatestproposedUStariffsonindustrysectorsinonechart.json","image_url":"https://amp.businessinsider.com/images/5b46b97f5ea10867088b46fb-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_us-tariffs-impact-on-industry-sectors-in-one-chart-2018-7_1540944606.html","title":"The impact of the latest proposed US tariffs on industry sectors, in one chart","title_page":"    The impact of the latest proposed US tariffs on industry sectors, in one chart - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bill Pugliano/Getty Images\nAfter largely dismissing the introduction of tariffs on $US34 billion worth of Chinese imports late last week, US stocks, like others around the world, were roiled on Wednesday as the Trump administration announced an additional list of $US200 billion in Chinese imports that could soon attract tariffs of 10%.\nThe S&P 500 fell 0.71% with all sectors aside from utilities losing between 0.35% to 2.17%.\nPut bluntly, in response to the escalating trade tensions between the world's two great superpowers, nothing aside from safe-haven utility stocks was spared from the selling pressure.\nThe broad-based selloff was understandable, especially as the list of goods that could be subject to tariffs contained over 6,000 items, including some that few knew even existed.\nTrying to interpret what sectors would be hit harder than others was understandably difficult to fathom in such a short period of time.\nWhat firms would face the largest increase in input costs, presuming the tariffs, like those before them, are implemented?\nWell, thanks to JP Morgan Asset Management, we now know the answer.\nBased on tariffs already implemented, the new items on the proposed USTR list and the dollar value of Chinese imports that entered the United States last year, two sectors stood out in particular: industrials and technology.\nThis chart shows the impact across various sector and shows how the new list of proposed tariffs dramatically widens the potential impact in scale and across sectors.\nJP Morgan Asset Management\n\"For markets, the initial reaction to trade developments, as with most situations, is sharp and then investors take a breath and refocus on what drives returns,\" says Hannah Anderson, JP Morgan Asset Management Global Market Strategist.\n\"In this time of rising trade tensions it's a much more individual company specific question than it once was.\"\nAnderon says it will take markets sometime to fully price in the impact of what these new proposed tariffs could mean to individual firms.\nHowever, from a broader perspective, even if the tariffs are implemented, Anderson says they're unlikely to have as great an impact as some currently expect.\n\"In the grand scheme of things, the US actions on China represent a small portion of trade and GDP,\" she says, pointing to the chart below.\nJP Morgan Asset Management\n\"Other trade proposals, like Autos and NAFTA, are more important for the US.\"","url":"https://www.businessinsider.com/us-tariffs-impact-on-industry-sectors-in-one-chart-2018-7"}
