{"authors":[],"date_download":"2018-10-30 01:00:13","date_modify":"2018-10-30 01:00:13","date_publish":"2015-04-26 00:00:00","description":null,"filename":"data/vaneerConsumption/TheIRSvstheChurch.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_04_the_irs_vs_the_church_comments_1540861213.html","title":"The IRS vs. the Church","title_page":"Articles: The IRS vs. the Church","title_rss":"NULL","source_domain":"americanthinker.com","text":"The IRS targeting of Tea Party and other conservative groups prior to the 2012 election was an unconscionable abuse of power for which accountability and punishment have been noticeably absent. But this was and is not the only use by the Obama administration of the power to tax to attempt to destroy its political opponents. The IRS is also involved in targeting what President Obama has called “less than loving” Christians through the mandates of ObamaCare and its attack on the free exercise of religion through the attempted coercion of mandated health insurance coverage This administration’s war on religion is also seen in the monitoring of Christian churches by the IRS in response to a lawsuit filed on December 27, 2012 by the Freedom from Religion Foundation (FFRF) concerning sermons that are considered by the political left to be political speech by tax-exempt organization in alleged violation of federal law. These sermons, often criticizing... (Read Full Article)","url":"https://www.americanthinker.com/articles/2015/04/the_irs_vs_the_church_comments.html"}
ents.\nThe FFRF sought enforcement by the IRS of the 1954 Johnson Amendment which states that tax-exempt groups, including churches, are not allowed to endorse political candidates. But the FFRF stretches that law to interpret churches taking positions from the pulpit in opposition to, say, gay marriage or the ObanaCare mandates on providing contraceptive coverage as support for political candidates, albeit unnamed, that might share that opposition.\nIn a November 6, 2012 letter to the IRS by the group’s staff attorney, Rebecca Markert, the Wisconsin-based FFRF took particular issue with Bishop Robert Morlino of the Madison Wisconsin Archdiocese, accusing him of sending out an election eve article to parishioners in his diocese stressing the need to vote against candidates endorsing homosexual marriage and abortion even though no candidates were mentioned by name:\nThe issues identified by the bishop in the November 1st article are generally what distinguish Republican and Democrat social platforms. In Wisconsin, these issues differentiate candidates for federal and state offices, i.e., one candidate for U.S. Senate is anti-abortion and anti-gay marriage, and the other candidate is a lesbian who supports marriage equality and abortion rights. Biushop Morlino’s article, published and distributed just five days before election day, is clearly urging people not to vote for candidates that embrace these positions. Likewise, the paragraph about “religious freedom and freedom of conscience” is a clear reference to the HHS mandate of the incumbent candidate for president, Barack Obama. Though he does not specifically state, “Vote for Romney: or any other specific candidate, it is clear to the reader that Morlino is urging members of his diocese to vote against President Obama and other Democratic candidates in today’s election\nClearly, it is the position of the FFRF that not mentioning a candidate, as “issue ads” by genuinely political groups such as labor unions often do not by name doesn’t matter. A bishop or minister is not allowed under their Constitution cannot preach church doctrine in an election year and ask parishioners to vote accordingly, connecting the dots on their own.\nInvestor’s Business Daily, in a biting July 31, 2014 editorial ripped apart the FFRF’s faulty logic:\nBut is the Catholic Church \"politicking\" when it proclaims its \"Fortnight for Freedom\" dedicated to opposing ObamaCare's contraceptive mandate and the government's forcing schools and charities it considers an extension of its faith to include it in insurance coverage or face crippling fines? Are Protestant and evangelical churches \"politicking\" when they participate in \"Pulpit Freedom Sunday\" this year on Oct. 5 to encourage congregations to \"vote their faith,\" which they consider to be an exercise of free speech and freedom of religion? The FFRF says that such events at \"rogue churches\" have \"become an annual occasion for churches to violate the law with impunity.\" But doesn't the Constitution say that Congress can make no such laws?\nThe IRS seems to have sided with the FFRF through a settlement of the lawsuit against it, agreeing to silence through monitoring and implied intimidation churches whose religious beliefs are at odds with stated administration policies. In a press release dated August 1, 204, the FFRF announced:\nFFRF agreed to voluntarily dismiss its closely-watched federal lawsuit against the IRS after being given evidence that the IRS has authorized procedures and “signature authority” to resume initiating church tax investigations and examinations.\nAs National Review Online contributing editor Quin Hillyer notes in an August 20, 2015 article, the IRS, as it did in the Tea Party targeting scandal, is refusing to make public any documents or correspondence relating to its acquiescence to the FFFR lawsuit, causing conservative groups Alliance for Defending Freedom and Judicial watch to file Freedom of Information lawsuits:\nTo fight this combined assault on religious liberty and on government transparency, conservative legal stalwarts Alliance Defending Freedom (ADF) and Judicial Watch together filed suit April 9 to force release of the IRS documents. ADF asserts that the IRS already has shared the documents with the atheist Freedom From Religion Foundation (FFRF). Once again, the IRS bends over backwards on behalf of leftists while harassing and ignoring the rights, on multiple levels, of conservative groups or faith communities.\nAs Investor’s Business Daily noted in its editorial:\nCongress can make no laws prohibiting the free exercise of religion. So it's not clear where the IRS gets off doing just that by spying on religious leaders lest they comment on issues and activities by government that are contrary to or impose on their religious consciences. Our country was founded by people fleeing this kind of government-monitored and mandated theology last practiced in the Soviet Union.\nIndeed, the Constitution if fact guarantees freedom of religion, not freedom from it. Thomas Jefferson, source for the “separation of church and state” phrase often invoked by liberals, also said\n“I have sworn upon the altar of God eternal hostility against any form of tyranny over the mind of man”\nThat should apply to those who speak their mind from the pulpit as well.\nDaniel John Sobieski is a free lance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/articles/2015/04/the_irs_vs_the_church.html"}
