{"authors":["Savannah O'Leary"],"date_download":"2018-10-30 22:52:42","date_modify":"2018-10-30 22:52:42","date_publish":"2014-08-14 17:08:50","description":"Do you want your next cross-country flight to feel more like a rollercoaster ride from point A to point B? Thanks to the new IXION private jet design, that could soon be a reality. Imagine if airplane walls were see-through — You wouldn’t have to…","filename":"data/vaneerConsumption/TheIXIONPrivateJetReplacesTinyWindowsWithScenicLandscapeViews.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/7203b1ed-bb12-4084-b652-18e328203aee.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35776-the-ixion-private-jet-replaces-tiny-windows-with-scenic-landscape-views_1540939962.html","title":"The IXION Private Jet Replaces Tiny Windows With Scenic Landscape Views","title_page":"The IXION Private Jet Replaces Tiny Windows With Scenic Landscape Views","title_rss":"NULL","source_domain":"bustle.com","text":"Do you want your next cross-country flight to feel more like a rollercoaster ride from point A to point B? Thanks to the new IXION private jet design, that could soon be a reality. Imagine if airplane walls were see-through — You wouldn’t have to crane your neck to stare through that tiny peep-hole-excuse-of-a window to catch a glimpse of the Grand Canyon beneath you. Instead, you would enjoy a panoramic view of your surroundings.\nIf you thought the Emraer E2 Jet’s new cabin design was cool, just wait until you meet the IXION jets, a concept created by Technicon Design’s team in France. This puts all existing onboard entertainment systems to shame — the concept uses \"wing mounted cameras\" that deliver \"unhindered comprehensive exterior views to the flexible screens that cover the cabin’s walls.”\nSure. I don’t care how it works, I just want it to happen.\nThe screens can do more than display the views around you. Posh business people — the ones who can actually afford to fly a plane like this — will take pleasure in the fact that the walls can also be used for video conferencing. Yes, you can Skype 30,000 feet above ground!\nThe screens can also display pre-set photos, which will come in handy if your actual surroundings become....unfavorable. In other words, there are some things you just don't want to know about while in the air. Like the fact that you might be flying through the great white abyss of a cloud. I'm really only interested in what happens once we get closer to the ground. Bring on the cityscapes!\nThat being said, for those of you with a fear of flying – this is probably not for you.","url":"https://www.bustle.com/articles/35776-the-ixion-private-jet-replaces-tiny-windows-with-scenic-landscape-views"}
