{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 23:27:13","date_modify":"2018-10-30 23:27:13","date_publish":"2014-08-13 18:38:37","description":"I don't think that there's really a precedent for something like this, so it's hard to say whether or not Sony is making the right choice by this: According to Uproxx, Sony will alter The Interview to avoid conflicts with North Korea, after the…","filename":"data/vaneerConsumption/TheInterviewWillBeAlteredSoNorthKoreaDoesntGetTooMadButTheyreProbablyStillGonnaGetMad.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/4d3f62fe-2e7b-4e64-8b6c-f9d86b443fb1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35647-the-interview-will-be-altered-so-north-korea-doesnt-get-too-mad-but-theyre-probably-still_1540942033.html","title":"'The Interview' Will Be Altered So North Korea Doesn't Get Too Mad, But They're Probably Still Gonna Get Mad","title_page":"'The Interview' Will Be Altered So North Korea Doesn't Get Too Mad, But They're Probably Still Gonna Get Mad","title_rss":"NULL","source_domain":"bustle.com","text":"I don't think that there's really a precedent for something like this, so it's hard to say whether or not Sony is making the right choice by this: According to Uproxx, Sony will alter The Interview to avoid conflicts with North Korea, after the dictatorship country denounced the movie and swore \"merciless retaliation\" following the trailer's release. Oh, and if you're not aware of what The Interview, which stars Seth Rogen and James Franco, is actually about, here's a summary: Basically, Rogen and Franco play TV journalists hired to assassinate Kim Jong Un. So, yeah, North Korea isn't too happy about that.\nFrom The Hollywood Reporter , who broke the story about Sony's decision:\nSources say the studio is digitally altering thousands of buttons worn by characters in the film...because they depict the actual hardware worn by the North Korean military to honor the country's leader, Kim Jong Un, 31, and his late father, Kim Jong Il (showcasing military decorations would be considered blasphemous to the nuclear-armed nation).\nSo, that's not a huge thing they're changing, yes. But it is still telling that Sony is making the effort to avoid angering the country's dictatorship even more so than they're already going to by simply releasing a film about an assassination of their despot. Part of me feels like they shouldn't have to alter the film at all because Hollywood and government affairs are two separate entities in the US unlike, perhaps, in North Korea where propaganda runs rampant — but another part of me is kind of glad that maybe there won't be a nuclear war started by a Seth Rogen movie after all.\nI say \"maybe.\" I mean, after all, Sony is still putting out a movie about how Seth Rogen and James Franco assassinate Kim Jong Un, North Korea is still going to be mad.\nNo word on what else in the film Sony is officially going to alter, but THR added that they're considering cutting a scene \"in which the face of Kim Jong Un (played by Randall Park) is melted off graphically in slow motion.\" So, there's that.\nAnyway, The Interview is set to hit theaters on December 25. Family fun for everyone!","url":"https://www.bustle.com/articles/35647-the-interview-will-be-altered-so-north-korea-doesnt-get-too-mad-but-theyre-probably-still"}
