{"authors":["Breitbart London"],"date_download":"2018-10-30 20:47:55","date_modify":"2018-10-30 20:47:55","date_publish":"2015-12-04 16:27:14","description":"British withdrawal from the EU would deliver a significant blow for accountability and popular sovereignty, and protect the NHS from TTIP.","filename":"data/vaneerConsumption/TheIndependentIfYouWantAnEndToAusterityHeresWhyYouShouldVoteToLeaveTheEU.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_12_04__1540932475.html","title":"The Independent: If You Want An End To Austerity, Here’s Why You Should Vote To Leave The EU","title_page":"The Independent: If You Want An End To Austerity, Here’s Why You Should Vote To Leave The EU","title_rss":"NULL","source_domain":"breitbart.com","text":"I want to see the election of a Labour government: I want to see an end to austerity, key services like our railways back into public ownership, and the NHS protected from privatisation. But Britain’s membership of the European Union threatens the ability of a democratically elected government to do any of this.\nThe EU we are being asked to remain a member of is no longer the advocate of a “social Europe”. Where the Europe of Jacques Delors appeared to offer some defence against the Thatcherite onslaught witnessed here in Britain, today’s EU is a key agent and driver of that neoliberalism. Those real social gains which remain in EU law from this period are under threat. It is no coincidence that the big battalions of capital in Britain – the CBI, the Financial Times, the City of London – all stand squarely in favour of staying “In”.\nI want to see the election of a Labour government: I want to see an end to austerity, key services like our railways back into public ownership, and the NHS protected from privatisation. But Britain’s membership of the European Union threatens the ability of a democratically elected government to do any of this.\nThe EU we are being asked to remain a member of is no longer the advocate of a “social Europe”. Where the Europe of Jacques Delors appeared to offer some defence against the Thatcherite onslaught witnessed here in Britain, today’s EU is a key agent and driver of that neoliberalism. Those real social gains which remain in EU law from this period are under threat. It is no coincidence that the big battalions of capital in Britain – the CBI, the Financial Times, the City of London – all stand squarely in favour of staying “In”.\nTake the Transatlantic Trade and Investment Partnership (TTIP) – a trade deal between the USA and EU – negotiated in secret, and with frightening implications for the future of democracy. It aims to introduce a new ‘Investment Court System’, which allows multinational corporations to bring legal actions in offshore courts against the governments of nation states for loss of potential profits incurred where services are run in the public sector rather than being privatised or outsourced. This is a thinly-veiled version of the Investor-State Dispute Settlements (ISDS) already contained within other bi-lateral treaties signed by the EU. This led to energy company Vattenfall suing the German government for billions of dollars over its decision to phase out nuclear power plants in the wake of the Fukushima disaster in Japan. If applied here, such a system could well mean that, for example, our National Health Service is ruled unlawful by foreign courts able to dictate to a British government that healthcare must be run for private profit.","url":"https://www.breitbart.com/europe/2015/12/04/the-independent-if-you-want-an-end-to-austerity-heres-why-you-should-vote-to-leave-the-eu/"}
