{"authors":["Helen Turnbull For Mailonline"],"date_download":"2018-10-23 03:40:40","date_modify":"2018-10-23 03:40:40","date_publish":"2016-01-29 18:47:23","description":"The former EastEnders actress had to be fetched from the piste by Mountain Rescue who sped her to Innsbruck Hospital for an emergency CT scan and X-rays on Wednesday.","filename":"data/vaneerConsumption/TheJumpsLouisaLyttonrushedtohospitalafterfallingonslopes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4BC3800000578-0-image-a-27_1454091938990.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423271_The-Jump-s-Louisa-Lytton-rushed-hospital-falling-slopes_1540266040.html","title":"The Jump's Louisa Lytton rushed to hospital after falling on slopes","title_page":"The Jump's Louisa Lytton rushed to hospital after falling on slopes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The reality series never goes by without at least one contestant injuring themselves.\nAnd The Jump's Louisa Lytton has suffered yet another blow to her campaign as she was rushed to hospital on Wednesday after suffering a nasty fall during a training session on the slopes in Austria, just days before the new series kicks off on Sunday.\nThe former EastEnders actress had to be fetched from the piste by Mountain Rescue who sped her to Innsbruck Hospital for an emergency CT scan and X-rays.\nScroll down for video\nBetter to be safe than sorry: The Jump's Louisa Lytton was rushed to hospital by the Mountain Rescue team on Wednesday after suffering a nasty fall, just days before the series kicks off on Sunday\nA source told The Sun: 'She was clearly in a lot of pain and it was all very scary as no one knew how bad her condition really was.'\nHowever, after receiving medical attention, the 26-year-old was counting her lucky stars to have only suffered some bruising as doctors confirmed she hadn't broke any thing, as first feared.\nThe latest injury is Louisa's second she's sustained during training after having torn a ligament in her thumb. As a result, one hand will be bound to a cast for the next four weeks.\nOuch: Louisa's bruising is the second injury she's sustained during training after having torn a ligament in her thumb. As a result, one hand will be bound to a cast for the next four weeks\n'Not ideal': The 26-year-old moaned as she shared a picture of her cast-clad hand on Instagram on Friday\nDespite being in the wars, the former Ruby Allen star is determined to compete in the premiere show on Sunday.\nThe source added: 'She was devastated by the fall and it has really knocked her confidence.\n'She wants to reinvigorate her career so crashing out before the show has even started just isn't an option.'\nIt all started off so well: The former EastEnders star looked excited as she boasted about her ski wear earlier in the week\nAlthough she's previously confessed she's far from a natural skiier, she's determined to leave the competition having mastered the sport.\nLouisa will compete in a wide range of winter sports against celebrity contestants - TOWIE's James ‘Arg’ Argent, fellow EastEnder Sid Owen, Made In Chelsea's poshest star Mark-Francis Vandelli, former Olympic swimmer Rebecca Adlington, and ex-Girls Aloud singer Sarah Harding.\nAlso taking part are IT Girl Tamara Beckwith, Brian McFadden of Westlife fame, former sprinter Linford Christie, gymnast Beth Tweddle, Tina Hobley and Dean Cain.\nThe Jump kicks off on Sunday at 7.30pm on Channel 4\n'The A Team': The former Ruby Allen actress and her celebrity contestants appear to have formed quite the bond over the past few weeks\nShocker: Host Davina McCall seemed pretty shocked by the freak accident\nHappier stars: Rebecca Addlington was more primed for a selfie with the host","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423271/The-Jump-s-Louisa-Lytton-rushed-hospital-falling-slopes.html"}
