{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:09:36","date_modify":"2018-10-31 00:09:36","date_publish":"2015-09-27 08:00:00","description":"Around the Capitol they’re known as “juice committees” – those that oversee lucrative industries, allowing politicians to foster relationships they can","filename":"data/vaneerConsumption/ThejuiciestjobinSacramento.json","image_url":"https://calmatters.org/wp-content/uploads/hustlercasino.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944576.html","title":"The juiciest job in Sacramento","title_page":"The juiciest job in Sacramento | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Around the Capitol they’re known as “juice committees” – those that oversee lucrative industries, allowing politicians to foster relationships they can squeeze for campaign cash.\nThese panels preside over business interests that fight obscure industry battles before the Legislature; think of lawyers vs. insurance companies, doctors vs. physical therapists, or card rooms vs. Indian casinos.\n“These are non-visible issues that are of high interest to very wealthy groups,” said Stacy Gordon Fisher, a political scientist who studied Sacramento’s juice committees as a professor at University of Nevada, Reno.\nSo those groups spend what it takes to get noticed, hiring lobbyists and pouring money into political campaigns.\nOne of the juiciest committees is responsible for regulating booze, cigarettes and gambling. It was called the “committee on public morals” back in the 1800s but now goes by a more innocuous name: the committee on governmental organization.\nG.O., as the committee is known, is one of the Legislature’s biggest, with a total of 34 members in the Senate and Assembly. Its decisions impact profits for California’s gambling factions — card rooms, racetracks and Indian tribes that run casinos. And now, those businesses are bankrolling the political ambitions of the committee’s chairman, Sen. Isadore Hall (D-Compton).\nHall landed in the California Senate in December, following a special election in which just 7 percent of those registered turned out to vote. It was the latest in a long string of political victories for Hall, who advanced from the school board in Compton to its city council to the state Assembly. He represents one of California’s poorer Senate districts, where about 20 percent of people live in poverty.\nHall had served less than three months in the state Senate when he announced plans to run for the Congressional seat being vacated by Rep. Janice Hahn (D-San Pedro), who endorsed him. Through June, he’s raised twice as much money as his closest opponent, attorney Nanette Barragan.\nAs Hall works to build a campaign war chest for what’s likely to be a competitive election next year, about 8 percent of his donors have come from the district he seeks to represent.\nInstead, the bulk of them reflect relationships he’s built as G.O. chairman. More than one-third of the $369,000 Hall raised in the first six months of the year came from people tied to a gambling business. Donors include:\n– Former Assembly speakers Fabian Núñez and Willie Brown, who have worked as consultants to casino magnate Sheldon Adelson in his fight against online poker – an issue that has come before Hall’s committee for several years.\n– Pornographer Larry Flynt, who owns the Hustler Casino in Hall’s Senate district and pushed for a bill this year that would change a rule about casino ownership.\n– Sacramento lobbyists David Quintana and Steve Cruz, who represent casino-owning Indian tribes, and Robyn Black, who represents Flynt and horse-racing interests. They routinely lobby bills in Hall’s committee and are forbidden by state law from contributing to a legislator’s state-level campaign. The law does not apply, however, to federal races.\n– Las Vegas casino executives Frank and Lorenzo Fertitta, whose company worked with a California tribe to plan a casino near Fresno with the help of a bill carried by Hall.\n– Seven Indian tribes that run casinos, as well as owners of numerous card rooms and horse racing tracks.\n“They want to have access to him to have their position heard,” said Gordon Fisher, the political scientist who wrote a book called “Campaign Contributions and Legislative Voting.”\n“Over the long term they give him money, he hears them out. There’s not necessarily a quid pro quo, but a relationship is built.”\nAsked about his fundraising, Hall said he didn’t want to talk about it while inside the state Capitol. And then he did not respond to follow-up inquiries.\nCard room owners are supporting Hall’s congressional campaign because he’s “a champion for the industry,” whose support goes back to his experience in local government, said Jarhett Blonien, a lobbyist who represents several card rooms.\n“It’s not so much that they’re looking for favors, it’s that Isadore is their friend and they want to help him out,” Blonien said.\nBlack, the horse-racing lobbyist who gave $500 to Hall’s campaign, said her donation is unrelated to the business she has before him. She pointed out that she’s donated to several congressional campaigns across party lines.\n“There are members that you get to know because you worked with them here in Sacramento and you just know they’re the kind of person you want representing our state,” Black said.\nThe message was the same from Quintana, the lobbyist for several casino-owning tribes, who gave $2,000 to Hall’s campaign: “I’ve seen him operate in Sacramento… and I think he would make a great congressman.”\nTo be clear: donors don’t necessarily get their way. Quintana, for example, lobbied against a bill Hall carried this year to expand the ability for sports teams to host live raffles at their games. The bill passed through the Legislature and is awaiting action from Gov. Jerry Brown.\nWhich gets back to the allure of a juice committee: Often, the money keeps flowing no matter which way politicians vote.\n“It’s not like he always has to represent their interests for this to be a good investment,” Gordon Fisher said.\n“Every once in awhile he might be a critical vote on a piece of legislation that’s important to them.”","url":"https://calmatters.org/articles/the-juciest-job-in-sacramento/"}
