{"authors":["Ariel Kay"],"date_download":"2018-10-30 22:24:43","date_modify":"2018-10-30 22:24:43","date_publish":"2014-08-15 18:04:06","description":"With cocaine-addled doctors, botched C-sections, a suicide before its first 15 minutes are up: The Knick , Cinemax's new series from Steven Soderbergh, is only one episode old, but the 1900-set drama about the invention of modern medicine has…","filename":"data/vaneerConsumption/TheKnickWasaRealHospitalItsGotaRealAndReallyGoryHistory.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/dd1df595-716f-4cf9-a299-ac7b94bbbdea.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35696-the-knick-was-a-real-hospital-its-got-a-real-and-really-gory_1540938283.html","title":"'The Knick' Was a Real Hospital & It's Got a Real - And Really Gory - History","title_page":"'The Knick' Was a Real Hospital & It's Got a Real — And Really Gory — History","title_rss":"NULL","source_domain":"bustle.com","text":"With cocaine-addled doctors, botched C-sections, a suicide before its first 15 minutes are up: The Knick , Cinemax's new series from Steven Soderbergh, is only one episode old, but the 1900-set drama about the invention of modern medicine has already proved to be nearly as mesmerizing as it is gruesome. This summer has been full of ambitious scary-gross new dramas, like The Strain and The Leftovers, of which The Knick is only the latest. The Knick, however, is made all the more fascinating by the fact that its depictions of disease, gore, and immorality are all inspired by real events.\nAccording to The Bowery Boys blog, The Knickerbocker, the hospital from which The Knick derives its name, was a real New York hospital that operated from 1862 to 1979 in Harlem. The institution went through several names throughout its existence. It started as a hospital for northern Civil War veterans known as the Manhattan Dispensary. By 1895 the building had been rechristened J. Hood Wright Memorial Hospital, and in 1913, its name was finally changed to the Knickerbocker, a moniker that stuck until a few years before its closing, when it was renamed the Arthur C. Logan Memorial Hospital.\nHello, Name & Location Change\nSo the Knick actually existed during the time of the Cinemax show, but it didn't get that name until 13 years later. Beyond that, there are other differences between the fictional hospital and the actual Knick. For one, the show is set way downtown in the Village, whereas the historical hospital is located at Covent Avenue and 131st Street, at the opposite end of Manhattan. Today, the Knickerbocker building is an apartment complex for senior citizens, according to Bowery Boogie.\nBut There's Plenty of Truth\nBut despite these editorial changes, much of The Knick is based in fact. As in the show, the Knickerbocker was a hospital serving primarily poor and immigrant patients, the Bowery Boys report. And Clive Owen's character, Dr. John Thackery, is based in part on an actual person, Dr. William Stewart Halsted, who invented many new surgical instruments and techniques in the early 20th century and, like Thackery, was known to be addicted to cocaine and morphine, according to the Johns Hopkins Institute. Of course, these substances were not illegal at the time, but that doesn't exactly mean they were safe to use while operating on other people.\nAll About Algernon Edwards\nAnother aspect of the show that is historically accurate is its portrayal of racism among the hospital's staff. It is established from the first episode that Thackery opposes integration, and he refuses to work with a new black doctor, Algernon Edwards. The Bowery Boys report that the real Knickerbocker had a similar policy regarding African-Americans, often refusing to treat them, despite the hospital's mission to serve those who could not afford to pay for medical care.\nIn coming episodes of The Knick we'll see André Holland's character, Dr. Edwards — the only black doctor at the hospital — attempt to treat African-American patients in secret. The first African-American to ever earn a medical license was James McCune Smith in 1837 — but Smith was trained at the University of Glasgow, Scotland, because no American college would admit him, according to PBS. In The Knick (which is set 63 years after Smith became a doctor) Edwards went to Harvard (which graduated its first black student, Richard T. Greener, in 1870). But before starting at the Knick, the fictional Edwards had only previously practiced medicine in Europe, because American hospitals refused to hire him, which lines up with his onscreen incarnation.\nThe Bottom Line\nIt's still too early to tell if The Knick is worth watching all the way through, or if it doesn't deliver the quality to justify its graphic content. But having such an extensive history behind the show's concept does make me more interested in seeing where this season goes. And the fact that Soderbergh is at the helm can only mean good things for the show. Maybe he can even get his old pal Channing Tatum to drop by for a scene — in one of Thackery's opium-fueled hallucinations, perhaps?\nImages: Mary Cybulski/Cinemax (4)","url":"https://www.bustle.com/articles/35696-the-knick-was-a-real-hospital-its-got-a-real-and-really-gory"}
