{"authors":["Alanna Bennett"],"date_download":"2018-10-30 22:52:35","date_modify":"2018-10-30 22:52:35","date_publish":"2014-08-14 17:37:17","description":"People tend to know what Wes Anderson's about at this point. He's not necessarily as derivative of his own work as, say, Michael Bay — but he's definitely got a style we all recognize, you know? A notable love of symmetry, certain character-types he…","filename":"data/vaneerConsumption/TheKidInEveryWesAndersonMovieSketchByUCBIsOnPointVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/d54621e4-789a-4be3-ac2c-cad35259668c.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35792-the-kid-in-every-wes-anderson-movie-sketch-by-ucb-is-on-point-video_1540939955.html","title":"\"The Kid In Every Wes Anderson Movie\" Sketch By UCB Is On Point - VIDEO","title_page":"\"The Kid In Every Wes Anderson Movie\" Sketch By UCB Is On Point — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"People tend to know what Wes Anderson's about at this point. He's not necessarily as derivative of his own work as, say, Michael Bay — but he's definitely got a style we all recognize, you know? A notable love of symmetry, certain character-types he can't stop revisiting. All this makes \"The Kid In Every Wes Anderson Movie\" very much on-point.\nThe sketch, put out into the world by the Upright Citizen's Brigade (UCB, if ya nasty), stars comedy person Matthew Starr as all of Anderson's recent young male characters lusting after ladies. It's clear he's mostly channeling Sam from Moonrise Kingdom, but the whole thing's also just a wider statement about Anderson and his narrative habits.\nStarr, for his part, really nails Anderson's stylized stiffness — as well as Anderson's love of the kookily idiosyncratic lady character. \"She likes all the things that girls like,\" Starr says, \"like cigarettes and binoculars.\" He continues:\nShe's definitely wearing a beret, and she probably has a wooden finger, or a wooden toe, or a glass eye. I'm not picky. And she definitely has a dead husband, who died exploring the antarctic or some bullshit.\nI mean, don't we all? Sadly, these two have been barred from spending too much time together, as his lady love can only be reached by carrier falcon.\nHere is the sketch:\nUCB Comedy on YouTube\nAnd here is the trailer to Moonrise Kingdom:","url":"https://www.bustle.com/articles/35792-the-kid-in-every-wes-anderson-movie-sketch-by-ucb-is-on-point-video"}
