{"authors":[],"date_download":"2018-10-30 14:17:21","date_modify":"2018-10-30 14:17:21","date_publish":"2016-12-15 00:00:00","description":null,"filename":"data/vaneerConsumption/TheleftsRussiamemeFakenewsoftheweek.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_12_the_lefts_russia_meme_fake_news_of_the_week_1540909041.html","title":"The left's Russia meme: Fake news of the week?","title_page":"The left's Russia meme: Fake news of the week?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Hacking what? We know they did not hack any voting machines because they are not connected to the internet, and Jill Stein's ridiculous recount proved only that there was Democrat fraud in Michigan. Adding insult to injury, Trump gained a few votes in both Michigan and Wisconsin.\nWe know that John Podesta's email account was hacked, but no one has provided evidence so that we know by whom. The NYT and the WaPo both published some well-crafted fake news stories, complete with unnamed sources, saying it was Russia who hacked and leaked Podesta's emails. But no one within our intelligence agencies, nor any of the Democrats who show up all over the news programs to claim \"there is no doubt that it was Russia that cost Hillary the presidency,\" has offered a scintilla of proof. No one from any of those agencies will even show up to brief the House Intelligence Committee. There is apparently some disagreement among them. Hmmm.\nStonewalling and deception are the usual tactics of the left, so even now, they cannot imagine that their \"Russia did it\" strategy will not work. They intend to convince us all that the release of those emails affected the voters enough to cost Clinton the victory she \"deserved\" and had long assumed was in the bag. But that is where this particular fake news campaign becomes amusing.\nDespite their loss, in the spirit of Goebbels, the left still assumes that American voters and news consumers are stupid, that they fall for every hook the left baits. Their plan is that by repeating the hacking charge over and over again, the public will think the voting machines and email accounts were similarly hacked. They assume we will believe that Russia did indeed affect the outcome of the election.\nTheir next mistaken assumption is that no one will recall exactly what was revealed in those leaked emails. The last thing they want the public remembering is the absolute venality of just about everyone within the Clinton campaign. In all of those emails published by WikiLeaks, there is not a word of concern for the country, the economy, the working class, health care, etc. Not a word. Those volumes of correspondence are all about how to deceive the public, how to co-opt the media, most of which was already in their pocket, how to cover-up the crimes of the Clinton Foundation, how to take out Bernie Sanders, how to use the press and abuse the voters in order to win. Those emails proved that the Clinton campaign in its entirety was, and remains, as corrupt as it was when Bill Clinton was in the White House. If the emails did affect the outcome of the election, the hacker did the country a favor. The country dodged a malignant bullet with Trump's election.\nThe Clinton machine, which was obviously behind Jill Stein's recount farce and the \"Russia did it\" meme, is still operating on the assumption that we are a populace incapable of reading and thinking critically. We did not actually read those emails, they think. Nor did we see those Project Veritas videos of Clintonistas hiring thugs to pose as Trump supporters to foment mayhem at Trump rallies. No one, they are certain, knows the actual depth of turpitude they exposed. That is how foolish they think we are, how contemptuous of us they are.\nNow that a week or so of their latest \"Russia did it\" plan has been underway, the left's scheme to get the election overturned by convincing enough electors that Trump's victory is tainted, they still think we are all idiots. Elector Christine Pelosi, daughter of Botox Nancy, embarrassed herself on Neil Cavuto's program when she insisted her demand for an intelligence briefing on the Russian hacking before casting her vote is in the \"interest of transparency.\" Cavuto kept asking her what her endgame is, but she refused to answer. Of course she did. She thinks she is keeping it under wraps! So transparent are these people, we can see right through them as if they are not there. There is nothing there, nothing but self-righteous entitlement and white-hot fury at losing. These are people so used to winning by cheating and misleading (think Obamacare) that they simply cannot accept their loss, especially to an outsider businessman like Donald Trump.\nClinton was a terrible candidate, and her loss was most likely due to her screeching voice and her campaigning only against Trump and for nothing but to see herself in the White House. This time, Hillary's \"deplorables\" may or may not have read those emails, but they do know the difference between same old, same old and change. They wanted change. They are not going to fall for this absurd \"Russia did it\" banality, even if Russia did do it. Everyone knows Russia hacks, just as we do, Israel does, Iran does, China does, North Korea does, etc.\nIf there is proof that Russia was behind leaking the Podesta emails, let's see it. But there are hackers everywhere, even within the Democratic Party. Given the nature of those emails, it could be that they were leaked by someone who understood exactly what they revealed: a party shot through with greed and corruption.","url":"https://www.americanthinker.com/blog/2016/12/the_lefts_russia_meme_fake_news_of_the_week.html"}
