{"authors":["Associated Press"],"date_download":"2018-10-22 21:11:43","date_modify":"2018-10-22 21:11:43","date_publish":"2017-04-26 01:10:18","description":"LOS ANGELES (AP) - The Latest on pretrial testimony in the Robert Durst murder case (all times local):5:05 p.m.A friend says years before Susan Berman was...","filename":"data/vaneerConsumption/TheLatestFriendsaysvictimforetoldofharmfromDurst.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/01/wire-462449-1493165740-367_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4445974_The-Latest-Friend-says-victim-foretold-harm-Durst_1540242703.html","title":"The Latest: Friend says victim foretold of harm from Durst","title_page":"The Latest: Friend says victim foretold of harm from Durst | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LOS ANGELES (AP) - The Latest on pretrial testimony in the Robert Durst murder case (all times local):\n5:05 p.m.\nA friend says years before Susan Berman was killed, she had implicated real estate heir Robert Durst as her future assailant.\nFILE - In this Dec. 21, 2016, file photo, real estate heir Robert Durst sits in a courtroom during a hearing in Los Angeles. A retired New York police detective says the missing wife of New York real estate heir Robert Durst once went to her neighbor's in pajamas and said her husband beat her and she feared he would kill her. James Varian testified Tuesday, April 25, 2017, that a neighbor reported Kathleen Durst had knocked on her Manhattan penthouse bedroom window for help. (AP Photo/Jae C. Hong, Pool, File)\nMiriam Barnes said Tuesday that Berman once told her she had done something for Durst around the time his wife disappeared, but she didn't elaborate.\nBarnes says Berman said: \"If anything ever happens to me, Bobby did it.\"\nShe forgot the statement until Berman's funeral in 2000.\nBarnes says she never went to police because she feared Durst.\nBarnes says she eventually told the account to the New York Times because she didn't think Durst would live to see his day in court.\nBarnes nervously eyed the frail multimillionaire several times in Los Angeles Superior Court.\nDurst has pleaded not guilty to murder in the shooting of Berman.\n___\n12:17 p.m.\nA retired New York police detective says the missing wife of New York real estate heir Robert Durst once went to her neighbor's penthouse in pajamas and said her husband beat her and she feared he would kill her.\nJames Varian testified Tuesday that a neighbor reported Kathleen Durst had knocked on her Manhattan bedroom window for help.\nVarian, 77, briefly investigated Kathleen Durst's disappearance in 1982.\nProsecutors are presenting testimony from elderly witnesses who may not be able to testify at Durst's murder trial.\nDurst, 74, has pleaded not guilty to murder in the death of his close friend, Susan Berman, in Los Angeles in 2000.\nProsecutors allege that Durst killed Berman to prevent her from talking to police about Kathleen Durst's disappearance.","url":"https://www.dailymail.co.uk/wires/ap/article-4445974/The-Latest-Friend-says-victim-foretold-harm-Durst.html"}
