{"authors":["Associated Press"],"date_download":"2018-10-22 23:09:13","date_modify":"2018-10-22 23:09:13","date_publish":"2016-01-11 04:47:08","description":"BEVERLY HILLS, Calif. (AP) — The latest from Sunday's 73rd Annual Golden Globe Awards at the Beverly Hilton Hotel in Beverly Hills, California (all times loc...","filename":"data/vaneerConsumption/TheLatestTheRevenantwinsbestdramafilmGoldenGlobe.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:5043ac9d88944d6e92ae67cfee716b3c-56CX32zFKLb7123928b84ca6ae44-875_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393022_The-Latest-Globes-carpet-warming-up_1540249753.html","title":"The Latest: 'The Revenant' wins best drama film Golden Globe","title_page":"The Latest: 'The Revenant' wins best drama film Golden Globe | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: 'The Revenant' wins best drama film Golden Globe\nBEVERLY HILLS, Calif. (AP) — The latest from Sunday's 73rd Annual Golden Globe Awards at the Beverly Hilton Hotel in Beverly Hills, California (all times local):\n8:05 p.m.\n\"The Revenant\" is the winner of the best drama film at Sunday's Golden Globe Awards.\nIn this image released by NBC, Leonardo DiCaprio accepts the award for best actor in a motion picture drama for his role in \"The Revenant\" during the 73rd Annual Golden Globe Awards at the Beverly Hilton Hotel in Beverly Hills, Calif., on Sunday, Jan. 10, 2016. (Paul Drinkwater/NBC via AP)\nLeonardo DiCaprio stars in the 19th century survival tale from director Alejandro G. Inarritu, which includes scenes of the actor jumping into icy waters, eating raw bison and being mauled by a bear.\nInarritu earlier won the best director honor and DiCaprio won the best movie actor honor.\nThe Globes splits its top film honors into two categories and named \"The Martian\" the top film comedy movie earlier in Sunday's ceremony.\n____\n7:55 p.m.\nLeonardo DiCaprio has won the best film drama actor Golden Globe Award for his role in \"The Revenant\".\nDiCaprio's performance in the film required him to brave icy waters, eat raw bison and other feats to make the 19th century survival epic as realistic as possible.\nDiCaprio beat out fellow nominees Bryan Cranston, Michael Fassbender, Eddie Redmayne and Will Smith.\n___\n7:53 p.m.\nBrie Larson has won the Golden Globe Award for best actress in a drama film.\nLarson won for her role in \"Room,\" in which she plays a mother trying to give her son a normal upbringing despite the fact they're both captives of a man who abducted her years earlier.\n___\n7:44 p.m.\n\"The Martian\" is the winner of the best comedy film Golden Globe.\nThe Ridley Scott sci-fi film stars Matt Damon as an astronaut marooned on Mars who uses his intellect — and humor — to try to survive until he can be rescued.\nThe Globes splits its top film honors into two categories and will name its winner of the top drama film at the end of Sunday's ceremony.\n___\n7:35 p.m.\nIn a battle of close friends, actress Jennifer Lawrence has beaten out Amy Schumer for the Golden Globe for best actress in a film comedy.\nLawrence won for her role in \"Joy.\" The women are close friends and have joked about being rivals in the run-up to Sunday's awards ceremony.\nLawrence and Schumer joined each other onstage earlier in evening to present clips from their films, \"Joy\" and \"Trainwreck.\"\nOther nominees in the category were Melissa McCarthy, Maggie Smith and Lily Tomlin.\n___\n7:28 p.m.\nTaraji P. Henson is channeling her \"Empire\" character after winning the Golden Globe Award for best actress in a television drama.\nHenson walked to the stage passing out cookies, a reference to her popular character, Cookie Lyon on the show.\nHenson opened her speech, \"Cookies for everyone tonight! My treat.\"\n___\n7:10 p.m.\nIt took two hours and, finally, Sylvester Stallone's first Golden Globes win to bring a tough audience to its feet.\nAfter host Ricky Gervais got the awards show off to a giggly start with his opening monologue, the Beverly Hilton ballroom was mostly quiet until Stallone claimed the Globe for supporting actor for the film \"Creed.\"\nAs the stunned-looking actor made his way to the stage, the audience erupted in a loud ovation.\nThe adulation might have thrown Stallone off a bit. He didn't mention his co-star, Michael B. Jordan, or director Ryan Coogler in his acceptance speech.\nAs the broadcast cut to a commercial he returned to the stage to make amends.\n___\n7:06 p.m.\nMel Gibson and Ricky Gervais are turning old jokes into new laughs.\nGervais joked about Gibson during a previous stint hosting the Golden Globes and on Sunday introduced the Oscar winner to present a clip from the film \"Mad Max: Fury Road.\"\nGervais noted it was an awkward situation, and blamed Globes broadcaster NBC.\nThat didn't stop him from continuing to crack jokes at Gibson's expense.\nThe host didn't stop there, saying he would rather drink with Gibson than with Bill Cosby.\nGibson took the ribbing with good humor and gave it back to Gervais. He said seeing the comedian host the Globes again reminded him it was time to get a colonoscopy.\n___\n7 p.m.\nLong after presenting one of the first Golden Globes of the night, Channing Tatum and Jonah Hill were still hanging out together.\nThe pair were seen scrambling through a patio, on their way back to the Beverly Hilton ballroom.\nAnd, yes, Hill was still toting that bear hat.\nOn the smoking terrace, it was a Meeting of the Mikes, as Michael Fassbender and Michael B. Jordan shared an embrace and introductions to their respective friends.\nAt the back of the ballroom, Jeffrey Tambor was holding court, posing for photos with both reporters and pretty much anyone else who wanted one.\n___\n6:59 p.m.\n\"Mr. Robot\" has won the Golden Globe Award for best television drama series.\nThe USA network show follows the adventures of a computer programmer-turned-hacker being recruited for a job by an anarchist.\nIt beat out other heavyweight shows such as \"Game of Thrones,\" ''Outlander\" and \"Empire.\"\n___\n6:52 p.m.\nLady Gaga has won the Golden Globe Award for best actress in a limited television series or movie, fulfilling a lifelong dream.\nThe Grammy-winning singer won Sunday for her role on \"American Horror Story: Hotel.\"\nAn emotional Gaga told the audience at the Globes that she wanted to be an actress before she wanted to become a singer, but that her recording career worked out first.\nGaga says, \"This is one of the greatest moments in my life.\"\nThe Globe statuette will join Gaga's other accolades, including Grammy Awards for her album \"The Fame Monster,\" her song \"Bad Romance\" and an album she recorded with Tony Bennett.\n___\n6:50 p.m.\nDamian Lewis didn't have to wait long for congratulations after his PBS series \"Wolf Hall\" was honored as best miniseries at the Golden Globes.\nJon Hamm quickly dropped by his table to offer a handshake.\nNow Lewis can return the favor: Shortly after that shake, Hamm won as best drama series actor for the final season of \"Mad Men.\"\n___\n6:47 p.m.\nSylvester Stallone gave his Golden Globe supporting actor acceptance speech in two parts.\nStallone initially thanked his fictional character Rocky Balboa before leaving the stage.\nAs the telecast went to commercial, Stallone quickly returned to the microphone to thank \"Creed\" director Ryan Coogler and co-star Michael B Jordan.\n___\n6:40 p.m.\nHungary's \"Son of Saul\" has been awarded the Golden Globe Award for best foreign language film.\nThe film tells the story of a Jewish man forced to work at Auschwitz burning bodies of those killed by the Nazis.\n___\n6:23 p.m.\nSylvester Stallone has won the Golden Globe for best supporting movie actor.\nStallone won for his role in \"Creed,\" in which he reprised his role as Rocky Balboa.\n___\n6:15 p.m.\nCue the voice of Joy for the makers of \"Inside Out,\" which has won the Golden Globe Award for best animated film.\nThe film goes inside the head of a little girl as she feels different emotions, ranging from sadness to fear, anger and joy.\nAmy Poehler voices Joy.\n___\n6:10 p.m.\nMatt Damon has won the best actor in a film comedy or musical Golden Globe Award.\nDamon won for his role in \"The Martian.\"\nThe Ridley Scott sci-fi film stars Damon as an astronaut marooned on Mars who uses his intellect and humor to try to survive until he can be rescued.\n___\n5:58 p.m.\nJon Hamm has won the Golden Globe Award for best actor in a television drama series.\nHamm won for his portrayal of Don Draper in the AMC series \"Mad Men,\" which ended last year after seven seasons. It is Hamm's second Golden Globe win.\n___\n5:54 p.m.\nThe Golden Globe Awards is living up to its reputation as a free-wheeling, wise-cracking affair.\nIn the first hour of the show, Andy Samberg joked about Bill Cosby giving a full confession and Jonah Hill presented an award wearing a bear hat. Hill was bleeped twice for using profanity during his presentation.\nActress Jaimie Alexander's microphone was also cut when she criticized the person running the teleprompter during an awards presentation.\n___\n5:49 p.m.\nSean Penn's Rolling Stone interview with Joaquin \"El Chapo\" Guzman had several people fascinated at the Golden Globes.\n\"Santa Monica High alumni get things done. We get nominated for Golden Globes, we help apprehend international drug fugitives, because that's what we're taught at Santa Monica High,\" joked actor and Penn's fellow Santa Monica High School alum Rob Lowe.\nWagner Moura wasn't so sure it was a good idea for Penn to venture to the jungles of Mexico to meet with Guzman before the drug lord was captured this week.\n\"Isn't that crazy?\" asked Moura, who portrays drug lord Pablo Escobar on the television series \"Narcos.\"\n___\n5:37 p.m.\n\"Wolf Hall\" is the winner of the Golden Globe Award for best miniseries or TV film.\nThe six-episode miniseries stars Damian Lewis as King Henry VIII and Mark Rylance as his trusted adviser. It aired on PBS.\n___\n5:27 p.m.\n\"Mozart in the Jungle'\" has won the Golden Globe Award for best television comedy series.\nThe Amazon series stars Gael Garcia Bernal as a brash new member of the New York Symphony.\n___\n5:10 p.m.\nKate Winslet has won the Golden Globe Award for best supporting actress in a feature film.\nWinslet won for her role in \"Steve Jobs.\" She portrays marketing executive Joanna Hoffman, a trusted adviser of the late Apple co-founder.\n___\n5:08 p.m.\nRicky Gervais isn't wasting any time blasting Hollywood's elite, taking aim at Sean Penn, NBC and Caitlyn Jenner in his Golden Globe Awards opening monologue.\nGervais' first joke included a poke at Penn, who conducted an interview with a Mexican drug kingpin and penned an essay for Rolling Stone magazine. Gervais joked he wanted to get through his monologue and go into hiding — somewhere even Penn couldn't find him.\nHe then called the actor a \"snitch\" — a reference to Mexican authorities' claims that Penn's interview helped lead them to Joaquin \"El Chapo\" Guzman.\nThe comedian also joked NBC was the perfect network to broadcast the Globes, since it had no nominations.\nAnd he lauded Jenner for being a role model and breaking down barriers when she announced her transition, but then added, \"She didn't do a lot for women drivers.\"\nJenner, formerly Bruce Jenner, was involved in a fatal car crash in February. She is being sued over the wreck, but prosecutors refused to pursue charges.\nSunday's ceremony is the fourth time Gervais has hosted the boozy ceremony honoring top television shows and films.\n___\n4:43 p.m.\nIt's more dangerous than it looks the navigating the Golden Globes red carpet.\nOlivia Wilde nearly lost a limo door when she opened it in front of oncoming traffic on the two-lane driveway where celebs are being dropped off for the show Sunday evening.\nThat configuration kept several stars from coming over to the fan bleachers to high five or pose for as they have done in the past. Mark Ruffalo, Amy Schumer and Amy Adams were among those who made up for it by flashing peace signs, blowing kisses or waving from afar.\n\"Hi, guys!\" Adams exclaimed as she stepped out of her ride.\nWill Smith and Kevin Hart decided to take their chances and cross in front of traffic to get to the bleachers.\nLaverne Cox experienced a different kind of emergency. The \"Orange is the New Black\" co-star required a dedicated handler for her long white train as she exited her vehicle.\n___\n4:23 p.m.\nRicky Gervais is playing coy about whether he's made any last-minute revisions to his Golden Globe Awards joke roster.\nGervais wouldn't say whether he wrote new material after Rolling Stone released a piece by actor Sean Penn in which he interviewed Mexican drug kingpin Joaquin \"El Chapo\" Guzman.\nThe host of Sunday's ceremony told Matt Lauer and Savannah Guthrie that NBC and the ceremony's hosts haven't put any restrictions on what he says.\nGervais, who has skewered many stars during his three previous times hosting the Golden Globes, says the show will go by fast.\nAnd he promised Lauer and Guthrie that, \"I won't break any laws, you know.\"\n___\n4 p.m.\nThis year's heightened security is creating a mile-long traffic jam outside the site of the Golden Globes.\nEach limo, SUV or other vehicle arriving for valet parking at the Beverly Hilton Hotel must stop while authorities check the contents of the trunk. Mirrors are being used to check underneath vehicles.\nThe new restrictions also bar guests from being dropped off by cab and walking in.\nThe heavy security presence around the hotel and the Globes' red carpet includes SWAT officers, dogs and representatives of multiple police agencies, including the FBI.\n___\n3:30 p.m.\nThe limousines, sport-utility vehicles, sedans and ride-sharing services are creating a Golden Globes traffic jam.\nAlan Cumming, Patrick Stewart, Michael Shannon, Bernadette Peters and the cast of Amazon's \"Transparent\" were among the first celebs to arrive on a red-carpet-covered driveway Sunday afternoon.\nSam Smith was greeted by screams when he opened his passenger-side door directly in front of a bleacher populated with fans.\nWhile most stars made a beeline to the camera crews and photographers waiting outside the Beverly Hilton, Jamie Lee Curtis stopped to wave and blow kisses to the excited crowd.\n\"Thank you!\" she screamed.\nWhen a fan recognized actor and screenwriter Danny Strong, the \"Empire\" co-creator paused to acknowledge the greeting.\n\"You're the one person who knew my name,\" he shouted. \"I love you!\"\nJason Schwartzman arrived in the most stylish ride, emerging from a vintage limo.\n___\n1:30 p.m.\nIt's still hours to showtime, but the Golden Globes red carpet is already warming up.\nWith intermittent sun beating down outside the Beverly Hilton Hotel following days of rain, \"Today\" show co-hosts Matt Lauer and Savannah Guthrie rehearsed for celebrity arrivals at their prime, rose-covered red carpet location. Dressed casually with shades covering their faces, the pair interviewed a stand-in wearing a pink Jennifer Lawrence sign around her neck.\nWith the threat of rain diminished, \"Entertainment Tonight\" stagehands ascended ladders on the other side of the carpet to remove tarps covering their red carpet headquarters. If there is any drizzle, a transparent tent will protect celebrities — but not the fans.\nIn the uncovered bleachers, a group of about 40 fans of the TV series \"Outlander\" gathered — a few in costume — to catch a glimpse and root for the cast and crew of the Starz series.\n\"We apologize in advance if we're loud and obnoxious,\" said Leona Barad told to the rest of the crowd in the bleachers.\nBarad coordinated with dozens of other \"Outlander\" fans on Facebook for the group to sit among the audience overlooking the awards show entrance. When cameras from E! panned across the crowd, they screamed \"OUTLANDER!\" in unison.\nIn this image released by NBC, Brie Larson accepts the award for best actress in a motion picture drama for her role in \"Room\"at the 73rd Annual Golden Globe Awards at the Beverly Hilton Hotel in Beverly Hills, Calif., on Sunday, Jan. 10, 2016. (Paul Drinkwater/NBC via AP)\nIn this image released by NBC, Alejandro G. Inarritu accepts the award for best motion picture drama for his film \"The Revenant\" during the 73rd Annual Golden Globe Awards at the Beverly Hilton Hotel in Beverly Hills, Calif., on Sunday, Jan. 10, 2016. (Paul Drinkwater/NBC via AP)\nJennifer Lawrence poses in the press room with the award for best performance by an actress in a motion picture - musical or comedy for ¿Joy¿ at the 73rd annual Golden Globe Awards on Sunday, Jan. 10, 2016, at the Beverly Hilton Hotel in Beverly Hills, Calif. (Photo by Jordan Strauss/Invision/AP)\nMatt Damon poses in the press room with the award for best performance by an actor in a motion picture - musical or comedy for ¿The Martian¿ at the 73rd annual Golden Globe Awards on Sunday, Jan. 10, 2016, at the Beverly Hilton Hotel in Beverly Hills, Calif. (Photo by Jordan Strauss/Invision/AP)\nTaraji P. Henson poses in the press room with the award for best performance by an actress in a TV series - drama for ¿Empire¿ at the 73rd annual Golden Globe Awards on Sunday, Jan. 10, 2016, at the Beverly Hilton Hotel in Beverly Hills, Calif. (Photo by Jordan Strauss/Invision/AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3393022/The-Latest-Globes-carpet-warming-up.html"}
