{"authors":["Associated Press"],"date_download":"2018-10-23 01:38:55","date_modify":"2018-10-23 01:38:55","date_publish":"2017-03-10 10:04:07","description":"BEIRUT (AP) - The Latest on the developments related to Syria's civil war and the expected push against the Islamic State group's main stronghold of Raqqa in...","filename":"data/vaneerConsumption/TheLatestPutinhostsErdoganforSyriafocusedtalks.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/11/wire-195791-1489147152-584_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300612_The-Latest-Syrian-Kurds-force-boosting-push-IS_1540258735.html","title":"The Latest: Putin hosts Erdogan for Syria-focused talks","title_page":"The Latest: Putin hosts Erdogan for Syria-focused talks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BEIRUT (AP) - The Latest on the developments related to Syria's civil war and the expected push against the Islamic State group's main stronghold of Raqqa in northern Syria (all times local):\n1:55 p.m.\nPresident Vladimir Putin is hosting his Turkish counterpart, Recep Tayyip Erdogan, for Syria-focused talks.\nFILE - This frame grab from a video provided by the Syria Democratic Forces (SDF), shows fighters from the SDF running during fighting with Islamic State group militant, in Raqqa's eastern countryside, Syria, Monday, March 6, 2017. The main U.S.-backed force fighting the Islamic State group in Syria has enough fighters to capture the extremists' de facto capital of Raqqa north of the country at a time when U.S. troops are playing a bigger role on the ground in the battle to conquer the city, a spokeswoman for the force said Friday, March 10, 2017. (Syria Democratic Forces, via AP)\nPutin greeted Erdogan at the start of the talks in the Kremlin on Friday and hailed close interaction between the two nations' militaries and special forces in Syria. He noted that few could expect \"so efficient and confiding contacts\" between Ankara and Moscow.\nTurkey and Russia brokered a cease-fire in December and co-sponsored two rounds of talks this year between Syrian President Bashar Assad's government and the opposition. The two also coordinated their operations against the Islamic State group in Syria.\nThe increasingly close cooperation marked a sharp turnaround for the two nations, which have backed opposing sides in Syria, with Moscow siding with Assad and Turkey supporting his foes since the start of the Syrian conflict.\n___\n12:30 p.m.\nThe Russian military says its warplanes have killed more than 600 militants in just one week while backing the Syrian army's offensive against the Islamic State group.\nCol. Gen. Sergei Rudskoi of the military's General Staff said on Friday that Russian aircraft have carried out 452 airstrikes in support of the Syrian government forces' push east of the city of Aleppo.\nHe says Russian airstrikes also destroyed 16 armored vehicles and scores of pickup trucks and other cars in the area over the past week. Rudskoi also says that Syrian government forces have recaptured 92 towns and villages across a territory of 479 square kilometers, or 185 square miles, from IS in the past week.\n___\n12:15 p.m.\nThe Russian military says its combat engineers have been deployed to clear the ancient town of Palmyra from explosives and mines left behind by the Islamic State group.\nCol. Gen. Sergei Rudskoi of the military's General Staff said on Friday that 187 Russian sappers have begun to defuse land mines in Palmyra with the help of robotic equipment.\nHe says Syrian government troops are now pushing further east of Palmyra after recapturing it from IS last week. It was the third time the town, famed for its ancient Roman ruins, changed hands in just one year.\nRudskoi says the Syrian forces also reached the banks of the Euphrates River east of the town of Khafseh and now control a stretch of 15 kilometers, or 9 miles, along the river.\n___\n11:55 a.m.\nU.S.-backed Syrian Kurdish forces say they have enough fighters to take the Islamic State group's de facto capital of Raqqa in northern Syria.\nThe spokeswoman for the Syrian Democratic Forces said on Friday that their numbers are increasing, with residents of areas newly liberated from IS joining the ethnically mixed force.\nCihan Sheikh Ehmed says the SDF has been on the offensive in the Raqqa area since November and have closed major supply roads used by the Islamic State group. SDF has captured wide areas from IS since then, under the cover of airstrikes by the U.S.-led coalition.\nShe says troops from the U.S.-led coalition have increased in numbers and are taking a bigger part in the battle for Raqqa. Earlier this week, the United States sent a couple of hundred Marines into northern Syria in preparations for the push on Raqqa.\n___\n10:55 a.m.\nTurkey's military says Turkish troops and Turkey-backed Syrian opposition forces have killed - or \"neutralized\" - 71 Syrian Kurdish fighters in northern Syria this week.\nThe operations are part of Turkey's months-long incursion into its war-torn neighbor in a push against the Islamic State group but also in an effort to restrict U.S.-backed Syrian Kurdish militias, which Ankara has declared a terrorist organization and which it considers to be linked to its home-grown Kurdish insurgency.\nFriday's military statement says that since the Turkish operation started in August, the joint Turkish and Syrian opposition forces killed as many as 2,647 IS militants and 425 Syrian Kurdish fighters in Syria.\nIt says that more than 2,000 square kilometers (772 square miles) in northern Syria are now under control of the Turkish-backed forces.","url":"https://www.dailymail.co.uk/wires/ap/article-4300612/The-Latest-Syrian-Kurds-force-boosting-push-IS.html"}
