{"authors":[],"date_download":"2018-10-30 22:27:11","date_modify":"2018-10-30 22:27:11","date_publish":"2018-07-25 15:35:49","description":"Recording artist Nicole C. Mullen has established herself as a chart-topping contemporary Christian singer. CBN News recently interviewed her recently about her life, her loss and finding love again.","filename":"data/vaneerConsumption/TheLordTurnedMyNightIntoDayNicoleCMullenTalkstoCBNNewsaboutHerNewAlbum.json","image_url":"http://www1.cbn.com/sites/default/files/styles/original/public/media/standard/images/nicolecmullen_si.jpg?itok=0iqoCzt-","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/.cbn.com/cbnnews_2018_july_the-lord-turned-my-night-into-day-nicole-c-mullen-talks-to-news-about-her-new-album_1540938431.html","title":"'The Lord Turned My Night Into Day': Nicole C. Mullen Talks to CBN News about Her New Album","title_page":"'The Lord Turned My Night Into Day': Nicole C. Mullen Talks to CBN News about Her New Album | CBN News","title_rss":"NULL","source_domain":"cbn.com","text":"Recording artist Nicole C. Mullen has established herself as a chart-topping contemporary Christian singer. CBN News recently interviewed her recently about her life, her loss and finding love again.\nHer new project is titled Like Never Before and the singer has said in the past that much of her music is based on life experiences. So what happened to give birth to this new album?\n\"A lot of love, a lot of loss, and a lot of redemption,\" Mullen replied. \"It's going through a night season. Having a marital status change. Becoming a single mom. Learning how to continue to implement forgiveness and to receive healing. And to allow other people into your pain and to minister.\"\n\"And to see the Lord begin to turn my night into day,\" she continued. \"And so the album has songs on there about that journey. And really how ultimately when it's all said and done, how the love of Christ is greater than anything we can go through.\"\n\"The sufferings of his present time are not worthy to be compared to the glory that shall be revealed in us,\" Mullen added. \"So his love again is greater still.\"\nHow would she compare this project to her previous ones?\n\"It's a continuation, but also a new chapter, not even a new chapter but a new book,\" Mullen answered. \"It has a variety of styles. There's some upbeat so you can dance to it. You have the worship you can worship with it. You can cry with it. It has the love songs on it. It has the whole gamut -- it is Nicole C. Mullen.\"\n\"But at the same time, it's on the cusp of the morning,\" the singer explained. \"Everything you've ever heard from me has been out of my night season. This is the first fruits of my day.\"\nWhen asked if she had a favorite in all those other fruits, Mullen confessed picking a favorite one is hard.\n\"They are all like pages out of my journal. So on different days, different songs speak to me in another way,\" she confided. \"Today, the song that is probably speaking the clearest to me is Greater Still. Because at the end of it, it has the celebration of 'I will rejoice. I choose to rejoice.' And I've found that is not just something that we fall into. But it's a choice that we make.\"\n\"And when we do choose to have joy again -- rejoice. Then in that, we find strength. We find grace. And we find help. And we find joy,\" Mullen said.\nCBN News asked if she's seeing any musical interest in her children.\n\"Yes, in my daughter. She's 24,\" the singer responded. \"For the longest time, she said, 'I'm not going to sing. I'm going to be an actress.' Now she's the lead singer of a band called The New Respects. They are on tour all of the time. They were on the cover of Rolling Stone magazine. They are Christians in the mainstream.\"\n\"My son who is 20, he plays the piano and he sings as well,\" Mullen continued. \"And my 15-year-old son, he thinks he's like the coolest thing ever. They are all great kids and musically inclined.\"\nGrowing up Mullen knew she wanted to sing, but some of those around her advised her to choose a different life path. Find out about the best career advice she ever received and see her reaction when asked about the new love in her life. Click the player above to watch Studio 5's interview with Nicole C. Mullen.","url":"http://www1.cbn.com/cbnnews/2018/july/the-lord-turned-my-night-into-day-nicole-c-mullen-talks-to-news-about-her-new-album"}
