{"authors":["Associated Press"],"date_download":"2018-10-23 05:15:17","date_modify":"2018-10-23 05:15:17","date_publish":"2016-01-29 21:08:15","description":"BERLIN (AP) — The Latest on the massive influx of asylum-seekers into Europe (all times local): 3:55 p.m. Italian Premier Matteo Renzi says he's expecting an...","filename":"data/vaneerConsumption/TheLatestItalyquestionsgivingmigrantaidtoTurkey.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:6c499283387941118700a6d9943c908e-4PuZeKVXE7cd9005b2c876e51135-57_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422511_The-Latest-Dutch-deal-return-Albanian-asylum-seekers_1540271717.html","title":"The Latest: Italy questions giving migrant aid to Turkey","title_page":"The Latest: Italy questions giving migrant aid to Turkey | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Italy questions giving migrant aid to Turkey\nBERLIN (AP) — The Latest on the massive influx of asylum-seekers into Europe (all times local):\n3:55 p.m.\nItalian Premier Matteo Renzi says he's expecting an answer soon from the European Commission on his country's questions about providing 3 billion euros ($3.25 billion) in aid to Turkey to help with Syrian refugees, which could remove the final barrier to providing the funds.\nA boy hugs a young child after their arrival aboard a dinghy with other migrants from the Turkish coast to the northeastern Greek island of Lesbos, on Friday, Jan. 29, 2016. A migration monitoring agency says deaths of refugees and migrants crossing the Aegean Sea between Turkey and Greece are \"increasing at an alarming rate\" as 218 people have died in January on that eastern Mediterranean route. (AP Photo/Mstyslav Chernov)\nSpeaking at a joint press conference Friday with German Chancellor Angela Merkel, Renzi said \"it would make me happy\" it the answer were to arrive before a conference on Syria in London next week.\nItaly is currently blocking the fund for Syrian refugees in Turkey, insisting the money be paid entirely from EU coffers rather than by member countries.\nRenzi didn't specify if Italy would relent after receiving answers to its questions from the European Commission. But he suggested the possibility, saying \"we will fulfill our obligations.\"\n___\n3:45 p.m.\nHungary's prime minister says the migrant crisis in Europe is now mainly a security issue.\nViktor Orban said Friday during a visit to Bulgaria that \"the terrorist threat is increasing and public order is deteriorating\" and Europeans, especially women and those who cannot protect themselves, are under threat.\nOrban, who built fences on Hungary's borders with Serbia and Croatia and has been advocating for Europe to block off the northern borders of Greece to stop the migrant flow, said it was \"a big problem\" that an increasing number of European countries could not fulfill their basic obligations to defend their citizens.\nBulgarian Prime Minister Boiko Borisov said Europe can no longer sustain the refugee influx and called for an immediate closure of the EU's external borders. He said that returning migrants after they reached Western Europe would be more inhumane than halting them at the borders.\n___\n3:30 p.m.\nSerbian customs authorities say they have found 10 migrants hidden in a truck that was transporting cardboard to neighboring Croatia.\nThe customs office said in a statement Friday that the migrants said they were from Syria and were handed over to the police.\nThe statement says the truck bearing Slovenian registration plates appeared suspicious because it had a hole on its top cover. Officers found the migrants among the cargo during a search. The driver insisted they sneaked in while he took a break at a gas station.\n___\n3:10 p.m.\nItalian Premier Matteo Renzi says that if the European Union give up on its Schengen border-free area \"then we give up on Europe.\"\nSpeaking at a joint news conference with German Chancellor Angela Merkel, Renzi said EU countries have to work together to solve the migrant crisis.\nSchengen countries shocked by the flow of asylum-seekers across their borders have increasingly been using rules that allow them to temporarily reintroduce border controls, leading to questions about whether the Schengen Zone can survive.\nRenzi and Merkel both said EU countries need to address the problems in refugee camps outside Europe to help stem the flow, increase Europe's exterior border security, and do what is possible to fairly share out those who deserve asylum.\n___\n3 p.m.\nHungary's foreign minister says there are currently no plans to build a fence between Hungary and Romania, downplaying earlier statements that the country was ready to build one on short notice to stop migrants from entering.\nPeter Szijjarto said \"the possibility exists but we hope that we won't be in the situation where we have to discuss this subject.\" Last year Hungary built fences on its borders with Serbia and Croatia to stop the migrant flow.\nSzijjarto spoke in Bucharest Friday during a meeting with his Romanian counterpart, Lazar Comanescu.\nMore than 390,000 migrants entered Hungary in 2015, but refugees and migrants have bypassed Romania which is not in the Schengen zone.\nSzijjarto criticized EU plans for countries to take in asylum-seekers according to quotas, saying they \"aren't logical, are not applicable and contravene European laws.\"\n___\n12:15 p.m.\nA migration monitoring agency says deaths of refugees and migrants crossing the Aegean Sea between Turkey and Greece are \"increasing at an alarming rate.\"\nJoel Millman, spokesman for the International Organization for Migration, says 218 people have died in January on that eastern Mediterranean route.\nHe told reporters in Geneva the deaths have occurred even though only 55,000 people — a \"very small number\" compared with last year's record wave of migration into Europe — have made the crossing this month.\nOverall, Millman said 244 people have died trying to cross the Mediterranean including deaths on the traditionally more deadly route between Libya and Italy.\nHe said IOM had reported earlier Friday that six bodies were found on a boat that had been rescued at sea there.\n___\n11:20 a.m.\nThe Dutch justice ministry says it has reached an agreement with Albania that clears the way for the Netherlands to send rejected Albanian asylum-seekers back to their home country more quickly.\nUnder the deal announced Friday, the Dutch can put rejected asylum-seekers who refuse to go home voluntarily on special government flights to Albania.\nThe ministry says \"the Netherlands is no longer dependent on commercial airlines and large groups can be sent home together.\"\nThe agreement comes amid a steep rise in the number of Albanians seeking asylum in the Netherlands — more than 750 in the last four months. Dutch authorities did not grant asylum to a single Albanian last year, when more than 1,000 applied.\n___\n10:15 a.m.\nPolice in southwestern Germany are looking for suspects after someone threw a hand grenade over the fence of an asylum-seekers' home early Friday morning in the town of Villingen-Schwenningen.\nRegional police spokesman Thomas Kalmbach says \"it was just luck\" the device did not explode and nobody was harmed.\nPolice say the grenade still contained its explosives but it was not clear whether it still had a detonator. Forensics experts are investigating. Kalmbach said an unidentified person threw the device toward the home at 1:15 a.m.\nSecurity personnel spotted the grenade and kept residents away while police responded. A bomb squad destroyed the device in a controlled explosion on the scene at about 5 a.m. after evacuating the 20 residents from the home.\nGermany took in nearly 1.1 million asylum-seekers last year and there have been multiple attacks on such residences, though primarily arson attacks are on unoccupied buildings.\nFirefighters prepare hoses outside an asylum seekers' shelter in Villingen-Schwenningen, southern Germany, Friday, Jan. 29, 2016, after someone threw an explosive device over the fence. Police said \"it was just luck\" the device did not explode and nobody was harmed. (Marc Eich/dpa via AP)\nMigrants wait to travel to Greek island of Lesbos, near the Aegean town of Ayvacik, Turkey, Friday, Jan. 29, 2016. Italian Premier Matteo Renzi said in Berlin on Friday that he is expecting an answer soon from the European Commission on his country's questions about providing 3 billion euros in aid to Turkey to help with Syrian refugees.(AP Photo/Halit Onur Sandal)\nPolice cordon off an asylum seekers' shelter in Villingen-Schwenningen, southern Germany, Friday, Jan. 29, 2016, after someone threw an explosive device over the fence. Police said \"it was just luck\" the device did not explode and nobody was harmed. (Marc Eich/dpa via AP)\nMigrants wait to travel to the Greek island of Lesbos, near the Aegean town of Ayvacik, Turkey, Friday, Jan. 29, 2016. Italian Premier Matteo Renzi said in Berlin on Friday that he is expecting an answer soon from the European Commission on his country's questions about providing 3 billion euros in aid to Turkey to help with Syrian refugees.(AP Photo/Halit Onur Sandal)\nMigrants walk as they wait to travel to Greek island of Lesbos, near the Aegean town of Ayvacik, Turkey, Friday, Jan. 29, 2016. Italian Premier Matteo Renzi said in Berlin on Friday that he is expecting an answer soon from the European Commission on his country's questions about providing 3 billion euros in aid to Turkey to help with Syrian refugees.(AP Photo/Halit Onur Sandal)\nA child looks through a bus window as migrants wait to travel to Greek island of Lesbos, near the Aegean town of Ayvacik, Turkey, Friday, Jan. 29, 2016. Italian Premier Matteo Renzi said in Berlin on Friday that he is expecting an answer soon from the European Commission on his country's questions about providing 3 billion euros in aid to Turkey to help with Syrian refugees.(AP Photo/Halit Onur Sandal)\nMigrants wait to travel to the Greek island of Lesbos, near the Aegean town of Ayvacik, Turkey, Friday, Jan. 29, 2016. Italian Premier Matteo Renzi said in Berlin on Friday that he is expecting an answer soon from the European Commission on his country's questions about providing 3 billion euros in aid to Turkey to help with Syrian refugees.(AP Photo/Halit Onur Sandal)\nMigrants walk as they wait to travel to the Greek island of Lesbos, near the Aegean town of Ayvacik, Turkey, Friday, Jan. 29, 2016. Italian Premier Matteo Renzi said in Berlin on Friday that he is expecting an answer soon from the European Commission on his country's questions about providing 3 billion euros in aid to Turkey to help with Syrian refugees.(AP Photo/Halit Onur Sandal)\nMigrants wait to travel to the Greek island of Lesbos, near the Aegean town of Ayvacik, Turkey, Friday, Jan. 29, 2016. Italian Premier Matteo Renzi said in Berlin on Friday that he is expecting an answer soon from the European Commission on his country's questions about providing 3 billion euros in aid to Turkey to help with Syrian refugees.(AP Photo/Halit Onur Sandal)\nGerman rescue volunteers patrol with their vessel near the village of Skala Sykaminias on the northeastern Greek island of Lesbos, on Friday, Jan. 29, 2016. A migration monitoring agency says deaths of refugees and migrants crossing the Aegean Sea between Turkey and Greece are \"increasing at an alarming rate\" as 218 people have died in January on that eastern Mediterranean route. (AP Photo/Mstyslav Chernov)\nRefugees and migrants on a dinghy arrive from the Turkish coast to the northeastern Greek island of Lesbos, on Friday, Jan. 29, 2016. A migration monitoring agency says deaths of refugees and migrants crossing the Aegean Sea between Turkey and Greece are \"increasing at an alarming rate\" as 218 people have died in January on that eastern Mediterranean route. (AP Photo/Mstyslav Chernov)\nA German rescuer volunteer escorts with his vessel a dinghy with refugees and migrants as they arrive from the Turkish coast to the northeastern Greek island of Lesbos, on Friday, Jan. 29, 2016. A migration monitoring agency says deaths of refugees and migrants crossing the Aegean Sea between Turkey and Greece are \"increasing at an alarming rate\" as 218 people have died in January on that eastern Mediterranean route. (AP Photo/Mstyslav Chernov)\nA woman feeds a baby after their arrival with other refugees and migrants from the Turkish coast to the northeastern Greek island of Lesbos, on Friday, Jan. 29, 2016. A migration monitoring agency says deaths of refugees and migrants crossing the Aegean Sea between Turkey and Greece are \"increasing at an alarming rate\" as 218 people have died in January on that eastern Mediterranean route. (AP Photo/Mstyslav Chernov)\nHungary's Foreign Minister Peter Szijjarto, left, arrives for a joint media briefing with Romanian counterpart Lazar Comanescu, right, in Bucharest, Romania, Friday, Jan. 29, 2016. Hungary¿s foreign minister says currently there are no plans to build a fence between Hungary and Romania, downplaying earlier statements the country was ready to build one on short notice to stop migrants from entering. Last year Hungary built fences on its borders with Serbia and Croatia to stop the migrant flow. (Andreea Alexandru/Mediafax via AP) ROMANIA OUT\nHungary's Foreign Minister Peter Szijjarto listens to translation during a joint media briefing with Romanian counterpart Lazar Comanescu in Bucharest, Romania, Friday, Jan. 29, 2016. Hungary¿s foreign minister says currently there are no plans to build a fence between Hungary and Romania, downplaying earlier statements the country was ready to build one on short notice to stop migrants from entering. Last year Hungary built fences on its borders with Serbia and Croatia to stop the migrant flow. (Andreea Alexandru/Mediafax via AP) ROMANIA OUT\nHungary's Foreign Minister Peter Szijjarto listens to translation during a joint media briefing with Romanian counterpart Lazar Comanescu, right, in Bucharest, Romania, Friday, Jan. 29, 2016. Hungary¿s foreign minister says currently there are no plans to build a fence between Hungary and Romania, downplaying earlier statements the country was ready to build one on short notice to stop migrants from entering. Last year Hungary built fences on its borders with Serbia and Croatia to stop the migrant flow. (Andreea Alexandru/Mediafax via AP) ROMANIA OUT\nHungary's Foreign Minister Peter Szijjarto, left, shakes hands with Romanian counterpart Lazar Comanescu, right, during a joint media briefing in Bucharest, Romania, Friday, Jan. 29, 2016. Hungary¿s foreign minister says currently there are no plans to build a fence between Hungary and Romania, downplaying earlier statements the country was ready to build one on short notice to stop migrants from entering. Last year Hungary built fences on its borders with Serbia and Croatia to stop the migrant flow. (Andreea Alexandru/Mediafax via AP) ROMANIA OUT","url":"https://www.dailymail.co.uk/wires/ap/article-3422511/The-Latest-Dutch-deal-return-Albanian-asylum-seekers.html"}
