{"authors":["Associated Press"],"date_download":"2018-10-23 05:11:05","date_modify":"2018-10-23 05:11:05","date_publish":"2017-03-16 16:10:13","description":"ORLANDO, Fla. (AP) - The Latest on the decision by a top prosecutor in central Florida to no longer seek the death penalty (all times local):5:45 p.m.An...","filename":"data/vaneerConsumption/TheLatestProsecutorwillfollowgovernorsorderoncase.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320858_The-Latest-Gov-says-prosecutor-recuse-herself_1540271465.html","title":"The Latest: Prosecutor will follow governor's order on case","title_page":"The Latest: Prosecutor will follow governor's order on case | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ORLANDO, Fla. (AP) - The Latest on the decision by a top prosecutor in central Florida to no longer seek the death penalty (all times local):\n5:45 p.m.\nAn Orlando prosecutor says she will follow an order by Florida's governor transferring an officer-killing case out of her hands after she announced she would no longer seek the death penalty in any cases.\nState Attorney Aramis Ayala said Thursday that she will cooperate with Gov. Rick Scott's order transferring Markeith Loyd's first-degree murder case from her office to the office of a prosecutor in a neighboring district.\nLoyd is charged with killing his pregnant ex-girlfriend and Orlando Police Lt. Debra Clayton.\nScott said transferring the case was a matter of fighting for justice.\nAyala says she made her decision after conducting a review and concluding that there is no evidence to show that imposing the death penalty improves public safety for citizens or law enforcement.\n___\n4:10 p.m.\nFlorida's governor is reassigning a case involving the killing of a police officer after an Orlando prosecutor said she no will longer seek the death penalty.\nA spokeswoman for Gov. Rick Scott said Thursday that the governor is reassigning the Markeith Loyd case to a prosecutor in a neighboring district northwest of Orlando.\nScott's action came hours after the top prosecutor in Orlando announced her office will no longer seek the death penalty in cases.\nLoyd's case is the most visible one affected by State Attorney Aramis Ayala's decision. He is charged with killing his pregnant ex-girlfriend and Lt. Debra Clayton.\nAyala says there is no evidence of improved public safety for citizens or law enforcement with the death penalty, and that such cases are costly and drag on for years.\n___\n10:35 a.m.\nFlorida's governor says the top prosecutor in metro Orlando should recuse herself from the case of a defendant charged with murdering a police officer.\nGov. Rick Scott said Thursday that State Attorney Aramis Ayala should recuse herself from handling Markeith Loyd's case after she announced her office will no longer seek the death penalty in cases.\nLoyd's case is the most visible one affected by Ayala's decision. He is charged with killing his pregnant ex-girlfriend and Lt. Debra Clayton.\nAyala says there is no evidence of improved public safety for citizens or law enforcement with the death penalty, and that such cases are costly and drag on for years.\nScott says he \"completely disagrees\" with Ayala's decision as it applies to Loyd.\n___\n10:50 a.m.\nThe top prosecutor for metro Orlando says she is no longer going to seek the death penalty.\nState Attorney Aramis Ayala on Thursday said she had decided to no longer seek the death penalty in first-degree murder cases after conducting a review. The most visible case immediately affected by Ayala's decision is that of Markeith Loyd, who is charged with killing an Orlando police lieutenant.\nAyala's decision comes just days after Gov. Rick Scott signed a bill requiring a unanimous jury recommendation before the death penalty can be imposed.\nAyala says there is no evidence of improved public safety for citizens or law enforcement with the death penalty, and that such cases are costly and drag on for years.\nLoyd is also charged with killing his pregnant ex-girlfriend.","url":"https://www.dailymail.co.uk/wires/ap/article-4320858/The-Latest-Gov-says-prosecutor-recuse-herself.html"}
