{"authors":["Associated Press"],"date_download":"2018-10-22 21:42:48","date_modify":"2018-10-22 21:42:48","date_publish":"2016-01-28 08:33:47","description":"PARIS (AP) — Iranian President Hassan Rouhani is being formally welcomed to France at the gold-domed Invalides monument where Napoleon is buried. While Rouha...","filename":"data/vaneerConsumption/TheLatestIranianpresidentformallywelcomedtoFrance.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:a88c0833e055426583efcc74afb22c85-2vdWmEltwXfba0ce28e63262670c-206_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420523_The-Latest-Iranian-president-formally-welcomed-France_1540244568.html","title":"The Latest: Iranian president formally welcomed to France","title_page":"The Latest: Iranian president formally welcomed to France | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Iranian president formally welcomed to France\nPARIS (AP) — Iranian President Hassan Rouhani is being formally welcomed to France at the gold-domed Invalides monument where Napoleon is buried.\nWhile Rouhani arrived in Paris on Wednesday from Rome, the official French government greeting ceremony is being held Thursday morning.\nRouhani is also meeting Thursday with the chief of UNESCO, the Paris-based U.N. cultural body, and speaking to high-level French executives whose companies are interested in resuming trade with his long-isolated nation of 80 million people.\nIranian President Hassan Rouhani waits before a meeting with French Senate President Gerard Larcher, in Paris, Wednesday, Jan. 27, 2016. Rouhani says his first visit to Europe since the nuclear accord was signed has proven that there are \"great possibilities\" for economic, academic, scientific and cultural cooperation and that \"today we are in a win-win situation\" after years of mutual losses due to sanctions. (AP Photo/Christophe Ena)\nLater he and French President Francois Hollande will oversee a ceremony for signing about 20 bilateral accords.\nThe trip is an effort to usher in a new era after a landmark accord to curb Iran's nuclear program and lift Western sanctions. However, France is now weighing new sanctions over Iranian ballistic missile tests.\nIranian President Hassan Rouhani, third left seated, attends a meeting with French Economy Minister Emmanuel Macron and French business leaders in Paris, Wednesday, Jan. 27, 2016. Rouhani says his first visit to Europe since the nuclear accord was signed has proven that there are \"great possibilities\" for economic, academic, scientific and cultural cooperation and that \"today we are in a win-win situation\" after years of mutual losses due to sanctions. (AP Photo/Christophe Ena)","url":"https://www.dailymail.co.uk/wires/ap/article-3420523/The-Latest-Iranian-president-formally-welcomed-France.html"}
