{"authors":["Chris Kitching For Mailonline"],"date_download":"2018-10-23 02:38:45","date_modify":"2018-10-23 02:38:45","date_publish":"2016-01-29 17:20:27","description":"The Lodge at Sea Island, in Georgia, edged posh brands and big-city hotels to claim top spot on U.S. News & World Report’s annual ranking, moving up one spot from last year’s second-place finish.","filename":"data/vaneerConsumption/TheLodgeatSeaIslandnamedthebesthotelintheUS.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B44FC700000578-0-image-a-29_1454086789008.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3423074_The-Lodge-Sea-Island-named-best-hotel-U-S_1540262325.html","title":"The Lodge at Sea Island named the best hotel in the U.S.","title_page":"The Lodge at Sea Island named the best hotel in the U.S. | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A luxury five-star lodge that resembles an English country manor and has sweeping views of the Atlantic from the Georgia coast has been named the best hotel in the U.S.\nThe Lodge at Sea Island edged high-end brands and big-city hotels to claim top spot on U.S. News & World Report’s annual ranking, moving up one spot from last year’s second-place finish.\nWith rates starting from $395 (£280) a night, the 40-room hotel, on St Simons Island, offers a private setting with classic luxury, with guests returning every year for romantic breaks or world-class golf getaways.\nScroll down for video\nWith rates starting from $395 (£280) a night, The Lodge at Sea Island, on the Georgia coast, offers a private setting with classic luxury\nThe 40-room hotel, on St Simons Island boasts sweeping views of the Atlantic and a high standard that guests and experts rave about\nThe Lodge is part of the five-star Sea Island resort, which offers a range of accommodation and three championship golf courses\nTHE BEST HOTELS IN THE U.S. REVEALED 1. The Lodge at Sea Island, Georgia 2. The Jefferson, Washington, DC 3. ARIA Sky Suites, Las Vegas 4. Four Seasons Resort Hualalai, Hawaii 5. The Peninsula Beverly Hills, California 6. Montage Palmetto Bluff, Bluffton, South Carolina 7. The Langham, Chicago 8. Mandarin Oriental, Las Vegas 9. Waldorf Astoria, Chicago 10. Auberge du Soleil, Rutherford, California Source: U.S. News & World Report\nGuest rooms boast rich wood furnishings, exposed beam ceilings, overstuffed chairs, hardwood floors, hand-crafted Oriental rugs and marble bathrooms.\nThere is a 24-hour butler service to cater to guests’ needs and one of the quirks is a nightly performance by a bagpiper at sunset.\nU.S. News & World Report said it chose The Lodge because it is a perennial favourite among experts and travellers thanks to its amenities and high standards.\nSecond place on this year’s list went to The Jefferson, one of President Barack Obama’s favourite haunts in Washington, DC.\nGuest rooms boast rich wood furnishings, exposed beam ceilings, overstuffed chairs, hardwood floors, hand-crafted Oriental rugs\nU.S. News & World Report said it chose The Lodge because it is a perennial favourite among experts and travellers thanks to its amenities\nThere is a 24-hour butler service to cater to guests’ needs and one of the quirks is a nightly performance by a bagpiper\nSet in the heart of the nation’s capital, The Jefferson is a 95-room Beaux Arts-style boutique hotel that is just a few blocks from the White House.\nLas Vegas’ ARIA Sky Suites claimed third spot and was followed by Four Seasons Resort Hualalai in Hawaii and The Peninsula Beverly Hills, which rounded out the top five.\nMontage Palmetto Bluff in Bluffton, South Carolina, ranked sixth, while The Langham in Chicago was seventh.\nMandarin Oriental in Las Vegas, Waldorf Astoria in Chicago and Auberge du Soleil in California’s Napa Valley took spots eight through 10.\nIn addition to being a haven for golfers, the Lodge at Sea Island is billed as a hideaway for those seeking privacy and classic luxury\nThanks to its Southern hospitality, The Lodge at Sea Island claimed first place. It was followed by The Jefferson in Washington, DC\nIn addition to three championship golf courses, Sea Island resort has five miles of private beach and casual to five-star dining\nU.S. News & World Report said its editors chose the top 10 after evaluating more than 1,750 hotels across the U.S., taking into account each property’s star rating and reputation among guests and experts.\nTravel editor Erin Shields said: ‘A great hotel can make your vacation, but travellers don't have to waste time searching for the perfect accommodations.\n‘The hotels on our list are adored by both travellers and expert reviewers for their high-quality amenities, comfortable rooms and exceptional services.’","url":"https://www.dailymail.co.uk/travel/travel_news/article-3423074/The-Lodge-Sea-Island-named-best-hotel-U-S.html"}
