{"authors":["Associated Press"],"date_download":"2018-10-23 01:42:55","date_modify":"2018-10-23 01:42:55","date_publish":"2017-04-26 12:20:52","description":"SAN FRANCISCO (AP) - The Latest on a federal judge's ruling that blocked a Trump administration order to withhold funding from sanctuary cities (all times...","filename":"data/vaneerConsumption/TheLatestAttorneygeneralvowssanctuarycityfight.json","image_url":"https://i.dailymail.co.uk/1/2017/04/27/02/wire-469059-1493255767-416_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447368_The-Latest--Trump-calls-courts-sanctuary-ruling-ridiculous_1540258975.html","title":"The Latest: Attorney general vows 'sanctuary city' fight","title_page":"The Latest: Attorney general vows 'sanctuary city' fight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SAN FRANCISCO (AP) - The Latest on a federal judge's ruling that blocked a Trump administration order to withhold funding from sanctuary cities (all times local):\n6 p.m.\nAttorney General Jeff Sessions says President Donald Trump's executive order to cut off funding to \"sanctuary cities\" that protect immigrants was well within his power.\nFILE - In this Jan. 25, 2017 file photo, Moina Shaiq holds a sign at a rally outside of City Hall in San Francisco. On Tuesday, April 25, 2017, a federal judge blocked a Trump administration order to withhold funding from communities that limit cooperation with U.S. immigration authorities, saying the president has no authority to attach new conditions to federal spending. (AP Photo/Jeff Chiu, File)\nSessions said late Wednesday that the U.S. Department of Justice cannot accept a judge's ruling blocking the order and would continue to fight the cases in court. It was not clear whether he planned an appeal.\nU.S. District Judge William Orrick issued a preliminary injunction against the order on Tuesday in two lawsuits - one brought by the city of San Francisco, the other by the California county of Santa Clara.\nOrrick rejected the administration's argument that the executive order applies only to a relatively small pot of money and said Trump cannot set new conditions on spending approved by Congress.\n___\n6:45 a.m.\nPresident Donald Trump has taken to Twitter in reaction to a federal judge's ruling that knocked down an immigration order, calling the decision \"ridiculous.\"\nA day after a judge issued a decision to block the president's order to withhold funding from \"sanctuary cities\" that do not cooperate with U.S. immigration officials, Trump said he would take his fight to the highest court, tweeting, \"See you in the Supreme Court.\"\nTrump tweeted that the 9th circuit, which earlier ruled against his travel ban, has \"a terrible record of being overturned (close to 80 percent).\"\nHe also says, \"They used to call this \"judge shopping!\" Messy system.\" That is apparently a reference to the 9th circuit's liberal reputation and rulings that have often irked conservatives.\n___\n3 a.m.\nFor the third time in two months, a federal judge has knocked down an immigration order by President Donald Trump and used Trump's own language against him.\nIn a ruling on Tuesday, U.S. District Judge William Orrick quoted Trump to support his decision to block the president's order to withhold funding from \"sanctuary cities\" that do not cooperate with U.S. immigration officials.\nThe judge said Trump calling the order a \"weapon\" against communities that disagree with his preferred immigration policy was evidence that the administration intended the executive order to apply broadly to all sorts of federal funding, and not a relatively small pot of grant money as the Department of Justice had argued.\nIt was another immigration policy setback for the administration as it approaches its 100th day in office later this month.\nCity Attorney Dennis Herrera talks about a federal judge's order blocking any attempt by the Trump administration to withhold money from \"sanctuary cities \"during a news conference at City Hall Tuesday, April 25, 2017, in San Francisco. (AP Photo/Eric Risberg)\nFILE - In this Wednesday, Jan. 25, 2017 file photo, Lordes Reboyoso, right, yells at a rally outside of City Hall in San Francisco. President Donald Trump moved aggressively to tighten the nation's immigration controls Wednesday, signing executive actions to jumpstart construction of his promised U.S.-Mexico border wall and cut federal grants for immigrant-protecting \"sanctuary cities.\" On Tuesday, April 25, 2017, a federal judge blocked a Trump administration order to withhold funding from communities that limit cooperation with U.S. immigration authorities, saying the president has no authority to attach new conditions to federal spending. (AP Photo/Jeff Chiu, File)\nCity Attorney Dennis Herrera, at podium, with his staff beside him, talks about a federal judge's order blocking any attempt by the Trump administration to withhold money from \"sanctuary cities\" during a news conference at City Hall Tuesday, April 25, 2017, in San Francisco. A federal judge on Tuesday said the president has no authority to attach new conditions to federal spending. U.S. District Judge William Orrick issued the preliminary injunction in two lawsuits, one brought by the city of San Francisco, the other by Santa Clara County, against an executive order targeting communities that protect immigrants from deportation. (AP Photo/Eric Risberg)","url":"https://www.dailymail.co.uk/wires/ap/article-4447368/The-Latest--Trump-calls-courts-sanctuary-ruling-ridiculous.html"}
