{"authors":[],"date_download":"2018-10-30 14:21:25","date_modify":"2018-10-30 14:21:25","date_publish":"2017-01-25 00:00:00","description":null,"filename":"data/vaneerConsumption/Theleftandlogic.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_01_the_left_and_logic_comments_1540909285.html","title":"The left and logic","title_page":"Blog: The left and logic","title_rss":"NULL","source_domain":"americanthinker.com","text":"Why are progressive people so aggressive, compulsive, and nearsighted? No doubt there are those on the other side, but to their credit, they tend to keep quieter about it. I have been mulling over the events of the past few days after the inauguration of Donald Trump. The behavior of these progressive people who have been relentless in their obnoxiousness and inappropriateness since the inauguration is so terribly disappointing and distressing. From a group that constantly espouses “co-exist,” “love trumps hate,” “diversity,” etc. comes the most overwhelming hatred and divisiveness. How is it that these people can never take a moment to hear or see themselves? During President Trump’s campaigning, time and again, the media called out his rally attendees as being too white. Did not those same cameras scan the crowds at this weekend’s whiners’ march? If you look at who was out... (Read Full Post)","url":"https://www.americanthinker.com/blog/2017/01/the_left_and_logic_comments.html"}
ant to those demanding inclusiveness and diversity? So many of the righteous claimed that it was the last straw when Donald Trump’s private conversation with a bunch of men was exposed to be crass, yet these same righteous people are out yelling similar obscenities, carrying signs with those same vulgar words in an attempt to counter what they found so objectionable. How does that make sense? How can you use the very same expressions you claim are so bothersome? It defies logic. The were many signs about science at the womyn’s march, yet those same people who claim that science is settled on climate, something so variable, will argue about the science of when life occurs during conception and pregnancy. This is a finite biological process that has been very well documented, one where actual pictures document the progress of that life as it develops in utero. Likewise, they argue the science of the biological differences between men and women yet claim to know definitively the impact of humans on the climate. I could go on and on, but the main point here is that these people have no concrete reasoning capabilities, and those of us who do have to remain vigilant and active to keep them from pushing their insanity upon us. They won’t stop, so we cannot. Donald Trump winning the presidency was only the beginning. The voices of logic and reason must remain as loud as theirs. Get involved locally, and stay active.","url":"https://www.americanthinker.com/blog/2017/01/the_left_and_logic.html"}
