{"authors":["Associated Press"],"date_download":"2018-10-23 02:34:09","date_modify":"2018-10-23 02:34:09","date_publish":"2017-03-16 13:09:18","description":"PARIS (AP) - The Latest on the shooting at the high school in the southern French town of Grasse (all times local):7:15 p.m.A French prosecutor says the...","filename":"data/vaneerConsumption/TheLatestProsecutorsaysbadrelationspossiblemotive.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/18/wire-230051-1489688990-310_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320210_The-Latest-French-police-cordon-school-shooting_1540262049.html","title":"The Latest: Prosecutor says 'bad relations' possible motive","title_page":"The Latest: Prosecutor says 'bad relations' possible motive | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PARIS (AP) - The Latest on the shooting at the high school in the southern French town of Grasse (all times local):\n7:15 p.m.\nA French prosecutor says the shooting at a high school in southern France has \"no link\" to a terrorist organization at this stage of the investigation.\nPolice officers take position after an attack in a high school student in Grasse, southern France, Thursday, March 16, 2017. An armed high school student was arrested and police fanned out around a picturesque perfume capital in southern France after a school shooting that left at least two wounded. (AP Photo/Philippe Farjon)\nFabienne Atzori says investigators think the motive might have been the \"bad relations\" the student suspected of opening fire had with fellow students.\nAtzori says the 16-year-old suspect apparently struggled to socialize with other students.\nHe was armed with a rifle, several guns and a hand grenade.\nAtzori says the suspect entered the high school and shot at students before the high school principal intervened.\nThe principal was injured along with two students. None of the injuries were considered life-threatening.\n___\n6:15 p.m.\nFrench Education Minister Najat Vallaud-Belkacem says the shooting in a high school in southern France appears to be the \"insane act of a fragile young man fascinated by weapons.\"\nVallaud-Belkacem has visited the high school in the town of Grasse to meet with the staff, after a 16-year-old student opened fire, wounding two other students and the principle trying to intervene.\nShe said psychological assistance is being proposed to help students who would need it.\n\"Ongoing investigations are going to establish whether the assailant was helped by an accomplice\", she added.\n___\n5:10 p.m.\nA top police official says the student suspected of having shot students and a high school principal in the French southern city of Grasse is 16-year-old Killian Barbey.\nThe official spoke anonymously to The Associated Press because he was not allowed to disclose information on the ongoing investigation.\nGrasse's prosecutor has scheduled a news conference for Thursday afternoon.\nThe shooting attack at the Alexis de Tocqueville school left the town of Grasse - the country's picturesque perfume capital - in shock, since school shootings are rare in the France.\n-By Sylvie Corbet\n___\n4:15 p.m.\nFrench President Francois Hollande says a school shooting in southern France has no direct links to terrorism but insists that France should remain \"vigilant\" and stay under a state of emergency.\nHollande said a school principal and two others were shot in Thursday's attack in the town of Grasse, and investigators are trying to determine how the shooter entered the premises with weapons. A 17-year-old student has been arrested.\nChristian Estrosi, president of the region that includes Grasse, says the school principal tried to intervene when the student was making threats \"but unfortunately he didn't succeed.\"\nAfter the school attack and a letter bomb explosion in Paris on Thursday, Hollande said the country's state of emergency is \"justified.\" It was imposed after deadly Islamic extremist attacks in 2015 and has been extended through July.\n___\n3:45 p.m.\nA student at the high school in southern France where a student shot the principal and two others says he heard four shots that seeded panic among students.\nThe visibly shaken student told BFM TV on Thursday that \"it was total panic\" at the Alexis de Tocqueville school in Grasse, the picturesque perfume capital of France.\nHe said: \"I was downstairs ... We started to run. I was with a buddy and we took refuge upstairs. Then, the riot police arrived. ... It was like in a film.\"\nThe student giving the first witness account of the drama was identified only as Andreas.\nHe said: \"We hear this kind of thing in Paris. Now we understand what it is.\"\nThe shooter was arrested.\n___\n3:10 p.m.\nA French police official says a high school principal and two others have been shot by a 17-year-old student, and authorities believe there is no reason to suspect the attack is related to terror.\nPolice surrounded the area around the Alexis de Tocqueville school in the southern French town of Grasse. The official says in addition to the three wounded in Thursday's shooting, five other people are being treated for shock. None of the injuries is life-threatening.\nThe student has been arrested for possessing weapons.\nThe official said there did not appear to be any other suspects, although police are working to \"remove all doubt.\" The official, from the national police, was not authorized to be publicly named.\n- Angela Charlton.\n___\n3 p.m.\nFrench police are looking for a possible second attacker in a school shooting in southern France that left at least two wounded.\nInterior Ministry spokesman Pierre-Henry Brandet said a 17-year-old student from the Alexis de Tocqueville school in the town of Grasse was arrested after Thursday's shooting at the school.\n\"We are still in the phase of rescue, of searching for a possible second perpetrator,\" Brandet said on BFM television.\nHe said it is too early to know the motives for the attack, which came as France is under a state of emergency. All students are safe, he said.\n___\n2:15 p.m.\nOfficials say an armed high school student was arrested after a shooting in a school in southern France that left at least two wounded.\nA French police official would not elaborate on what weapon or weapons the student was carrying. The official was not authorized to be publicly named.\nThe government minister for victims affairs tweeted that two people were wounded and all the students are now safe.\nSchool shootings are rare in France, which remains under a state of emergency after deadly Islamic extremist attacks.\n-By Elaine Ganley\n___\n2:05 p.m.\nPolice have cordoned off the area around a high school in southern France where police say a shooting has taken place.\nPolice reported an attack at the Alexis de Tocqueville high school in the town of Grasse. It came as France is under a state of emergency.\nFrench television BFM showed residents gathered around the area, along with several police cars and emergency vehicles. Residents said some students have been able to leave the school.\nAn employee of a nearby electronics store said police had asked residents to stay indoors. An employee of sports chain Decathlon, which has a branch less than 500 meters from the high school, said he'd seen about 40 high school students leaving from the area and gathering in a nearby parking lot.\nBoth local residents would not provide their names.\n-By Raphael Satter\n___\n1:30 p.m.\nThe French government has sent out an alert warning of an attack at the Alexis de Tocqueville high school in the southern French town of Grasse after local police reported that shots have been fired.\nThe alert came in a system implemented by the government after the deadly November 2015 attacks in Paris.\nPolice say they are still trying to confirm if there are any casualties in the shooting in the town, 40 kilometers (25 miles) from the southern city of Nice.\nThe shooting at the high school comes as France remains in a state of emergency following deadly attacks in Paris in 2015 and an attack last year in Nice.\nA French police message alert is displayed on a cell phone in Paris, France, Thursday, March 16, 2017. The French government has sent out an alert warning of an attack at the Alexis de Tocqueville high school in the southern French town of Grasse after local police reported that shots have been fired. (AP Photo)\nPolice officers take position after an attack in a high school in Grasse, southern France, Thursday, March 16, 2017. An armed high school student was arrested and police fanned out around a picturesque perfume capital in southern France after a school shooting that left at least two wounded. (AP Photo/Philippe Farjon)","url":"https://www.dailymail.co.uk/wires/ap/article-4320210/The-Latest-French-police-cordon-school-shooting.html"}
