{"authors":["Associated Press"],"date_download":"2018-10-22 20:31:59","date_modify":"2018-10-22 20:31:59","date_publish":"2016-01-28 01:38:12","description":"HUNTSVILLE, Texas (AP) — The Latest on the execution of James Freeman for the slaying of a Texas game warden (all times local): 7:10 p.m. The brother of the ...","filename":"data/vaneerConsumption/TheLatestTexasexecutesmanwhofatallyshotgamewarden.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:52c9d54d3da74638877f64821cad270b-4vVdYopwYQ7f641721b07a727a99-649_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420205_The-Latest-Texas-executes-man-fatally-shot-game-warden_1540240319.html","title":"The Latest: Texas executes man who fatally shot game warden","title_page":"The Latest: Texas executes man who fatally shot game warden | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Texas executes man who fatally shot game warden\nHUNTSVILLE, Texas (AP) — The Latest on the execution of James Freeman for the slaying of a Texas game warden (all times local):\n7:10 p.m.\nThe brother of the Texas game warden slain by inmate James Freeman nine years ago thanked some of about 100 law enforcement officers who stood outside the Huntsville prison as the inmate was executed.\nThis undated photo provided by the Texas Department of Criminal Justice shows Texas inmate James Freeman. On Wednesday, Jan. 27, 2016, Freeman, 34, was set to die for killing Texas Parks and Wildlife Game Warden Justin Hurst during a March 17, 2007 a shootout. (Texas Department of Criminal Justice via AP)\nJustin Hurst was fatally wounded during a shootout after a vehicle chase that began when a warden suspected Freeman was hunting illegally.\nGreg Hurst's voice cracked with emotion as he spoke about his brother's death, saying: \"Nine years ago -- nine long years.\"\nTexas Game Warden Col. Craig Hunter, head of law enforcement for the Texas Parks and Wildlife Department and a witness to Freeman's execution, said the punishment marked \"a moment that many of us have been waiting for since we first heard of Justin's death.\"\n___\n6:40 p.m.\nA Texas prisoner has been executed for fatally shooting a game warden nine years ago during a shootout after a 90-minute chase that began when he was suspected of poaching.\nThe lethal injection Wednesday evening of 35-year-old James Freeman was the second in as many weeks in Texas, which carries out capital punishment more than any other state.\nFreeman in 2007 led police on a chase with speeds reaching 130 mph after he was suspected of illegal hunting in Wharton County in Southeast Texas. After his pickup truck was disabled, he jumped out and opened fire at officers with a pistol and an assault rifle.\nA Texas game warden, Justin Hurst, was shot and killed in the June 17, 2007, shootout. It was Hurst's 34th birthday.\n___\n12:42 p.m.\nNo late appeals are expected for a man set to be executed for a Texas game warden's death during a 2007 shootout.\nJames Freeman's lethal injection would be the second in as many weeks if carried out Wednesday in the nation's busiest death penalty state.\nThe U.S. Supreme Court earlier this month refused to review Freeman's case. On Monday, the Texas Board of Pardons and Paroles declined a clemency petition for Freeman.\nFreeman was suspected of illegally hunting at night from his truck when a Texas game warden spotted him. Freeman led authorities on a 90-minute chase that ended with a shootout in which another game warden who joined the pursuit was killed.","url":"https://www.dailymail.co.uk/wires/ap/article-3420205/The-Latest-Texas-executes-man-fatally-shot-game-warden.html"}
