{"authors":["James Delingpole"],"date_download":"2018-10-30 19:33:28","date_modify":"2018-10-30 19:33:28","date_publish":"2015-09-22 21:09:20","description":"When twenty alarmist climate scientists wrote to President Obama last week demanding that he use RICO laws to crush dissenting climate skeptics","filename":"data/vaneerConsumption/TheLeadClimateScientistBehindtheObamaRICOLetterhasSomeSeriousQuestionstoAnswer.json","image_url":"https://media.breitbart.com/media/2015/03/climate-change-activist-polar-bear-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_22__1540928008.html","title":"The Lead Climate Scientist Behind the Obama/RICO Letter has Some Serious Questions to Answer","title_page":"The Lead Climate Scientist Behind the Obama/RICO Letter has Some Serious Questions to Answer | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"When twenty alarmist climate scientists wrote to President Obama last week demanding that he use RICO laws to crush dissenting climate skeptics, the world of honest science – it still exists, just about – was rightly and properly appalled.\nThe hypocrisy and dishonesty of signatory Kevin ‘Travesty’ Trenberth, which we reported here last week, was bad enough.\nBut just wait till you hear the sorry tale of the letter’s lead signatory, Jagadish Shukla. It’s so murky you’ll wonder what on earth possessed him to stick his head above parapet. And you may well conclude that if anyone in this ugly business is worthy of investigation, it’s certainly not anyone on the skeptical side of the argument…\nGeorge Mason University Professor Jagadish Shukla is a lead author with the UN Intergovernmental Panel on Climate Change and winner of numerous awards including the International Meteorological Organization Prize, the Rossby Medal of the American Meteorological Society, and the Padma Shri National Award from the President of India. He is currently president of the Institute of Global Environment and Society and a professor of Climate Dynamics.\nFor his expertise, Shukla is amply rewarded by George Mason University with a salary over $250,000 a year.\nApparently, though, this isn’t a full time job. It can’t be – because on top of this salary, from 2012 to 2014, Shukla appears to have paid himself and his wife $1.5 million from government climate grants for his part-time work via his non-profit Institute of Global Environment and Society (IGES).\nIGES is an organization which gets almost all its income from US taxpayers – last year a whopping $3.8 million – via institutions including the National Science Foundation, NOAA and NASA. The organization’s declared aim is to “improve understanding and prediction of the variations of the Earth’s climate through scientific research on climate variability and climate predictability, and to share both the fruits of this research and the tools necessary to carry out this research with society as a whole.”\nA tough job, clearly, but someone’s got to do it. Which is why Shukla generously rewards its president – himself – with a salary of $330,000 for a 28 hour week and his wife (who works full time) another $166,000.\nPerhaps this is all perfectly above board and legal.\nBut there are a couple of details that appear rather puzzling.\nIGES is, according to the Maryland department of Assessments and Taxation where it is registered, supposed to be organized exclusively for charitable, religious, educational and scientific purposes. (Hence its non-profit status).\nSo why, exactly was the letter to Obama sent from the IGES? Does its tax status not exclude it from such naked politicking?\nAlso, is it not the case that under Virginia law (Shukla teaches at George Mason University, remember) you cannot be employed elsewhere to do the same job? So perhaps he can explain how his work as professor of climate dynamics at GMU differs so markedly from his “scientific research on climate variability and climate predictability” at IGES that it entitles him to claim separate federal grant funding for the latter. If he can’t, then GMU might want him to ask him for its share of that $3.8 million in federal grants mentioned above. The university would be entitled to 50 per cent.","url":"https://www.breitbart.com/politics/2015/09/22/lead-climate-scientist-behind-obamarico-letter-serious-questions-answer/"}
