{"authors":["Fiona Macrae Science Editor For The Daily Mail"],"date_download":"2018-10-23 05:27:03","date_modify":"2018-10-23 05:27:03","date_publish":"2016-01-11 18:30:03","description":"The diagnoses, made at London’s Great Ormond Street hospital, could point to vital new treatments for Georgia Walburn-Green and Jessica Wright. They are among 40,000 people having their DNA decoded.","filename":"data/vaneerConsumption/Thelittlegirlswithmysteryhealthconditionswhofinallyhaveadiagnosis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300DBCA800000578-0-image-a-22_1452537942417.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3394266_The-little-girls-mystery-health-conditions-finally-diagnosis-Landmark-300m-project-reads-person-s-entire-genetic-code-detect-disease_1540272423.html","title":"The little girls with 'mystery' health conditions who finally have a diagnosis","title_page":"The little girls with 'mystery' health conditions who finally have a diagnosis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two little girls whose illnesses were a mystery have been diagnosed by a pioneering project that read their entire genetic code.\nThe diagnoses, made at London’s Great Ormond Street hospital, could point to vital new treatments for Georgia Walburn-Green and Jessica Wright.\nThey will also ensure that the girls, who are both four, get the care and support they need and help their parents decide whether to have more children.\nThe girls are among 40,000 children and adults from around Britain who will have their DNA decoded in a landmark project.\nThe biggest piece of research of its kind in the world, the 100,000 Genomes Project also aims to transform the treatment of cancer.\nGeorgia Walburn-Green, 4, with her parents Matt and Amanda, is among 40,000 children and adults from Britain who will have their DNA decoded in the landmark project\nJessica Wright, with parents Kate and Simon, suffers from a range of problems including epilepsy- and she struggles to walk. Reading her DNA showed a gene key to ensuring her brain has enough energy is damaged\nIt is hoped that by delving deep into a person’s DNA and combining the data with information from their health records, it will be possible to learn more about their illness than ever before.\nCrucially, a single test should be enough to give a diagnosis.\nThis is because rather than testing a single gene at a time, a slow, expensive and distressing process, doctors will check the patient’s entire DNA in one go.\nGeorgia had been sick from birth, but numerous test failed to find out what was wrong with her, leaving her doctors stumped and her parents in a constant state of uncertainty.\nHer mother, Amanda Walburn-Green, of Newbury in Berkshire, said: ‘When Georgia was born in June 2011 we had 20 blissful, worry-free minutes enjoying our first born child and then our world was shattered.\n‘The curtains were drawn round my bed and we were told that there may be a problem.\n‘Between ages of one and two, we discovered all the problems Georgia had one by one.\n‘As well as both physical and mental developmental delay, we found that she has a rare eye condition that affects her sight, her kidneys don’t function properly, and she has verbal dyspraxia and meaning we don’t know if she will ever talk.\n‘It’s been very hard living with an undiagnosed child.\n‘It’s a constant rollercoaster of being tested for large numbers of horrific conditions before being given the all clear.\n‘When doctors at Great Ormond Street said they’d found something, it was one of the biggest days of my life.’\nBlood tests revealed a tiny flaw in one of Georgia’s genes is likely be behind her illness\nGeorgia had been sick from birth, but numerous test failed to find out what was wrong with her, leaving her doctors baffled and her parents extremely anxious\nDoctors took samples of blood from Georgia, Mrs Walburn-Green and her husband, Matt Walburn, and some other children with similar symptoms and compared them.\nThis revealed a tiny flaw in one of Georgia’s genes to likely be behind her illness.\nThe genetic fault is extremely rare, there are only two other known cases in the UK, and so condition has yet to be given a name.\nThere are no drugs for it as yet but the gene is now being studied in the hope of finding a treatment.\nThe genetic screen, done as part of the 100,000 Genome’s Project, showed the flaw in Georgia’s DNA wasn’t inherited, and now her parents feel happy to try for another child.\nJessica Wright was found to carry a different rogue gene – and there is a treatment that could help her\nJessica Wright was found to carry a different rogue gene – and there is a treatment that could help her.\nThe youngster, from East Sussex, suffers from a range of problems, including epilepsy and a squint and struggles to walk.\nReading her DNA showed a gene key to ensuring her brain has enough energy was damaged.\nA special diet, high in fat, could provide an alternative source of fuel, and her parents say there is a high chancr it will work.\nHer mother, Kate Palmer, said: ‘We had always worried that something happened during the pregnancy or at the birth to cause Jessica’s problems and it was such as relief to know there’s nothing we could have done differently.\n‘A diagnosis also means we can link up with other families who are in the same boat and offer support.\n‘The condition is still quite rare but there are definitely other children out there who have it.\n‘I am really looking forward to saying, “We are one of you, we have this problem too.”\n‘More than anything, the outcome of this project has taken the uncertainty out of life for us and the worry of not knowing what was wrong.’\nSeveral thousand children with rare genetic diseases will have their DNA sequenced at Great Ormond Street. Thousands of cancer patients will also take part in the ‘genomics’ project.\nProfessor Lyn Chitty, the lead doctor on the 100,000 Genomes Project, said reading DNA promises to change the way patients are diagnosed and treated.\nHealth Secretary Jeremy Hunt said the science was ‘revolutionary’ and Georgia’s results were ‘groundbreaking’.\nProfessor Mark Caulfield, Chief Scientist at Genomics England, said:\n‘This is a pioneering project that will transform the application of genomics in our healthcare system.’","url":"https://www.dailymail.co.uk/health/article-3394266/The-little-girls-mystery-health-conditions-finally-diagnosis-Landmark-300m-project-reads-person-s-entire-genetic-code-detect-disease.html"}
