{"authors":["Associated Press"],"date_download":"2018-10-22 21:17:18","date_modify":"2018-10-22 21:17:18","date_publish":"2016-01-29 06:08:35","description":"PROVIDENCE, R.I. (AP) — The latest on the death of former Providence Mayor Vincent \"Buddy\" Cianci Jr., who dominated Rhode Island politics for parts of four ...","filename":"data/vaneerConsumption/TheLatestPublicviewingforexProvidenceMayorCianci.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:61cab194c01c4e6c8ae00b178713d548-4PuZeKVXE7cd9005b2c876587aba-300_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421356_The-Latest-Providence-flags-half-staff-honor-Cianci_1540243038.html","title":"The Latest: Public viewing for ex-Providence Mayor Cianci","title_page":"The Latest: Public viewing for ex-Providence Mayor Cianci | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Public viewing for ex-Providence Mayor Cianci\nPROVIDENCE, R.I. (AP) — The latest on the death of former Providence Mayor Vincent \"Buddy\" Cianci Jr., who dominated Rhode Island politics for parts of four decades before serving time for corruption (all times local):\n12:30 a.m.\nA public viewing is expected to be held at city hall for former Mayor Vincent \"Buddy\" Cianci Jr., who died Thursday. He was 74.\nFILE - In this June 22, 2010, file photo, former Providence, R.I., mayor and talk show host Buddy Cianci, speaks into a microphone during a live broadcast of \"The Buddy Cianci Show,\" at the WPRO radio studios in East Providence. Cianci died Thursday, Jan. 28, 2016, in Providence. He was 74. (AP Photo/Steven Senne, File)\nFormer Providence Mayor Joseph R. Paolino says according to initial plans mourners will be able to pay their respects to Cianci Feb. 6-7. A funeral mass is expected to be held Feb. 8 at the Cathedral of Saints Peter and Paul in downtown Providence.\nCianci's nephew Brad Turchetta tells WPRI-TV that the former mayor will be buried at St. Ann's Cemetery in Cranston.\nPaolino, former U.S. Ambassador to Malta, says Providence \"lost its greatest champion\" when Cianci died. Paolino says, \"He gave his heart to Providence.\"\n___\n6 p.m.\nThe Rhode Island House of Representatives has passed a resolution expressing deep condolences following the death of former Providence Mayor Buddy Cianci.\nLawmakers stood for a moment of silence Thursday evening after Democratic House Speaker Nicholas Mattiello spoke about the former mayor and talk show host's legacy.\nMattiello said Cianci was a transformative figure who loved the political process, cared about people and made Providence better.\nMattiello added he was mindful of what he described as Cianci's footnote and said it was something for everyone to learn from. Cianci's political life was cut short by criminal charges and a prison term for corruption.\nDemocratic Gov. Gina Raimondo also released a statement Thursday evening expressing condolences and calling Cianci a colorful part of Providence's fabric.\n___\n4:50 p.m.\nRhode Island Gov. Gina Raimondo and other state leaders say they're saddened by the death of former Providence Mayor Buddy Cianci.\nThe Democratic governor and other political leaders were asked their thoughts on Cianci during a Thursday press conference about a public works bill.\nRaimondo says Cianci always was a booster for the city. She expressed condolences to his family and friends.\nDemocratic House Speaker Nicholas Mattiello says Cianci was a controversial but transformative figure who helped make Providence a better place.\nSenate President Teresa Paiva Weed, a Democrat, says there was perhaps no greater advocate for Providence than Cianci.\nRaimondo says she will not lower the state flag since Providence City Hall has lowered its city flag, and that's a more appropriate place. She lives in Providence.\n___\n12:15 p.m.\nRhode Island House Speaker Nicholas Mattiello says former Providence Mayor Vincent \"Buddy\" Cianci was a giant on Rhode Island's political landscape who will be deeply missed.\nThe Democratic lawmaker from Cranston was one of several politicians who issued statements expressing condolences after Cianci died Thursday.\nMattiello says Cianci moved Providence forward.\nHe says the former mayor also was an informative voice in his second career as a radio and TV talk show host who helped engage residents in the political process.\nDemocratic Lt. Gov. Daniel McKee also was among those expressing condolences. He says Cianci loved Providence, oversaw its renaissance in the 1990s and was a fixture in the city that would not be the same without him.\n___\n11:20 a.m.\nProvidence Mayor Jorge Elorza has ordered flags to be flown at half-staff to honor the memory of former Mayor Vincent \"Buddy\" Cianci, who has died.\nElorza says in a statement Thursday that Cianci's love for the city is undeniable, and his mark on the city will not be forgotten.\nThe Democratic mayor also says the city is making arrangements to recognize his memory.\nCianci was the city's longest-serving mayor. He was elected to six terms and served 21 years in office, twice being forced out due to criminal activity.\nElorza defeated Cianci in the mayor's race in 2014. Cianci received 45 percent of the vote in his comeback bid for mayor.\n___\n11:00 a.m.\nFormer Boston Mayor Ray Flynn says he'll miss his longtime friend, Buddy Cianci, the former mayor of Providence who has died.\nFlynn says he spoke with Cianci recently about family, politics and Providence College basketball.\nFlynn says he was proud to stand with Cianci during the good times and the rough days as well.\nFlynn says Cianci will be deeply missed.\n___\n11:00 a.m.\nA spokesman for Miriam Hospital confirms that former Mayor Buddy Cianci died at the hospital at 9:40 a.m. Thursday.\nDavid Levesque says Cianci was in critical condition when he arrived at the hospital, but said he could not release the cause.\n___\n10:45 a.m.\nThe former Providence mayor who dominated Rhode Island politics for parts of four decades before serving time for corruption has died. Vincent \"Buddy\" Cianci Jr., was 74.\nCianci's employer, WLNE-TV, and a friend, Artin Coloian, both confirmed his death. Coloian said he died Thursday morning.\nCianci presided over the resurrection of Providence from a decaying, Industrial-age relic to a 21st-century city with gondolas plying newly uncovered rivers.\nHis bare-fisted style of politics made Cianci larger than life even in a tiny state known for the outsized personalities of its public figures.\nCianci was forced from office twice, first in 1984, when he pleaded no contest to assaulting a man with a fireplace log.\nHis second administration ended in 2002 with a federal prison term for racketeering conspiracy.\n___\n9:20 a.m.\nFormer Providence Mayor Buddy Cianci has been hospitalized after experiencing severe stomach pains while taping his weekly TV show.\nWLNE-TV reports that the 74-year-old Cianci was taping \"On the Record with Buddy Cianci\" on Wednesday evening when he became ill. He was taken by ambulance to Miriam Hospital.\nA hospital spokeswoman said Thursday morning that Cianci's condition was unavailable.\nCianci was diagnosed with cancer in 2014 and underwent chemotherapy and radiation treatments. In November, during his portrait unveiling at City Hall, Cianci felt woozy and left in an ambulance. He was released from the hospital almost immediately.\nCianci was the longest serving mayor in city history. He was forced from office twice due to felonies and went to prison for corruption. He ran unsuccessfully for another term in 2014.","url":"https://www.dailymail.co.uk/wires/ap/article-3421356/The-Latest-Providence-flags-half-staff-honor-Cianci.html"}
