{"authors":[],"date_download":"2018-10-30 14:31:42","date_modify":"2018-10-30 14:31:42","date_publish":"2015-06-12 00:00:00","description":null,"filename":"data/vaneerConsumption/TheliberalpoliticsofthenewCEOofFox.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_06_the_liberal_politics_of_the_new_ceo_of_fox_1540909902.html","title":"The liberal politics of the new CEO of Fox","title_page":"The liberal politics of the new CEO of Fox","title_rss":"NULL","source_domain":"americanthinker.com","text":"So why do we care? Well, 21 st Century Fox owns the Fox News Channel, and whoever manages Fox will have a say in the programming of FNC. In light of that, it's interesting to find out the politics of James and Lachlan.\nRupert Murdoch is turning over the reigns of 21 st Century Fox to his sons, James and Lachlan. It's unclear who the primary successor is – James will be CEO, while Lachlan will be co-chairman of the board. Being co-chairman of the board is normally a higher rank, but Lachlan is specifically listed as a \"nonexecutive\" co-chairman, and as CEO, James will make most day-to-day decisions. My bet is that James is the one positioned to succeed his father.\nI did some research on Lachlan but didn't come up with anything telling. James, however, was another story:\nHe is married to Kathryn Hufschmid, who works for the Clinton Climate Initiative, a charitable foundation set up by former President Clinton in 2006. Asked about his views on climate change denial during an interview with The Observer newspaper (which is not owned by News International) in June 2009, James Murdoch replied: \"How we deal with climate change deniers depends on who they are. If they run energy policy for large governments, then they're a problem. If it's a random columnist, ignore them for a while.\" In early 2008, shortly after James Murdoch took the helm at News International, the company's most profitable tabloid newspaper, The Sun, appointed its first environment correspondent, Ben Jackson. The newspaper has sought to report environmental issues, including climate change, more prominently[.]\nAccuracy in Media has more details :\nThe London Telegraph reports that “Thanks to friendships with Al Gore and Bill Clinton, he [James Murdoch] has developed deep green instincts?” His father made a $500,000 gift to the Clinton Global Initiative. “I’ve gotten to know Al [Gore] in a number of different contexts in the last number of years,” James Murdoch told the Financial Times in an interview. We “think the same way about the necessity of being realistic concerning the climate crisis,” Gore piped in during the same interview.\nJust because James is apparently a global warming fanatic doesn't mean he's liberal on other matters, of course. But it is a troubling indicator. Also troubling is the more recent trend of Fox News to give a large role for establishment Republicans like Karl Rove. Roger Ailes, who runs Fox News, will still report directly to Rupert Murdoch, but that arrangement obviously won't last forever. Ailes's contract expires next year, and he is thought not to be particularly close to either son.\nDo you think James will try to water down Fox News even further, or, given its large contribution to the bottom line, be afraid to tinker with such a profitable property?","url":"https://www.americanthinker.com/blog/2015/06/the_liberal_politics_of_the_new_ceo_of_fox.html"}
