{"authors":["Associated Press"],"date_download":"2018-10-22 23:59:54","date_modify":"2018-10-22 23:59:54","date_publish":"2017-03-10 05:14:08","description":"SEOUL, South Korea (AP) - The Latest on South Korean President Park Geun-hye's removal from office Friday by the Constitutional Court (all times local):5:32...","filename":"data/vaneerConsumption/TheLatestUSistakingnopositiononupcomingelection.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/20/wire-197963-1489178365-356_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300054_The-Latest-Japan-says-work-needed-comfort-women_1540252794.html","title":"The Latest: US is taking no position on upcoming election","title_page":"The Latest: US is taking no position on upcoming election | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SEOUL, South Korea (AP) - The Latest on South Korean President Park Geun-hye's removal from office Friday by the Constitutional Court (all times local):\n5:32 a.m.\nThe United States is taking no position on the outcome of South Korea's upcoming presidential election, saying it's a domestic issue to be decided by South Koreans and their democratic institutions.\nPolice officers move near the Gwanghwamun, the main gate of the 14th-century Gyeongbok Palace, one of South Korea's well known landmarks, in Seoul, South Korea, Friday, March 10, 2017. In a historic, unanimous ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil and worsened an already-serious national divide. (AP Photo/Lee Jin-man)\nSpokesman Sean Spicer says the White House is monitoring developments after South Korea's Constitutional Court removed impeached President Park Geun-hye from office Friday over a corruption scandal.\nSpicer says the U.S. will remain a \"steadfast ally, friend and partner\" to the Republic of Korea, regardless of the outcome of the election.\nSouth Korea must hold a presidential election within two months to choose Park's successor.\n___\n8: 30 p.m.\nNorth Korea's official media have briefly reported South Korean President Park Geun-hye's ouster.\nThe Korean Central News Agency said South Korea's Constitutional Court made the decision \"amid the high-pitched public struggle demanding her impeachment.\"\nIt said after being ousted, Park would \"reportedly face a thorough investigation as an ordinary criminal.\"\nAs a former president, Park has lost her immunity to prosecution.\nPark took a tougher line toward North Korea than other recent presidents, and the North routinely threw vicious sexist and violent insults at her, including calling her an \"aging witch\" and a \"female dog.\"\n___\n8:10 p.m.\nTens of thousands of South Koreans have occupied a square in front of an old palace gate in Seoul to celebrate the ousting of President Park Geun-hye, hours after the Constitutional Court removed her from office over a corruption scandal.\nCarrying signs and candles, the crowd cheered to speeches and swayed to music Friday night, while angry supporters of Park continued to scuffle with police in streets near the court. Two people died and dozens were injured in the clashes between Park's supporters and police following the ruling.\nSouth Korean lawmakers voted to impeach Park in December, following weeks of massive but peaceful protests participated in by millions of people amid allegations that Park colluded with a longtime confidante to accept money from companies and allowed the friend to secretly manipulate state affairs.\n___\n6:30 p.m.\nSouth Korean police and hospital officials say about 30 protesters and police officers have been hurt in violent clashes near Seoul's Constitutional Court following a ruling that ousted Park Geun-hye as president over a corruption scandal.\nTwo men believed to be protesters died on Friday as Park's supporters angrily reacted to the ruling, hitting police officers and reporters and climbing on police buses used to create a perimeter to protect the court. Police say protesters also smashed the windows of several buses.\nAn official from Inje University Paik Hospital says about 20 protesters are being treated for injuries from the rallies. An official from Kangbuk Samsung Hospital says it's also treating injured protesters, but couldn't say how many.\nAn official from the Seoul Metropolitan Police Agency says seven officers are also being treated for mostly minor injuries.\n___\n5:35 p.m.\nSouth Korea's acting head of state has pleaded with opponents and supporters of ousted President Park Geun-hye to stop their fierce rallies that have divided the streets of capital Seoul.\nThe comments by Prime Minister Hwang Kyo-ahn on Friday came hours after two men died amid clashes between Park's supporters and police following the Constitutional Court's ruling to formally remove her from office.\nIn a televised speech, Hwang says \"there would be people who feel they cannot understand or accept (the court ruling), but it's now time to move on and end all conflict and standoff.\"\nHe adds: \"It's not ideal to expand the conflict by continuing the protests outside on the streets ... Precious lives were lost during the rallies today, and this must no longer happen.\"\nHwang has served as the government caretaker since lawmakers voted to impeach Park in December.\n___\n3:45 p.m.\nSouth Korea's presidential office says Park Geun-hye won't leave the presidential Blue House on Friday after the constitutional court stripped her of her powers over a corruption scandal.\nA Blue House spokesman says some of Park's aides are at her southern Seoul home to prepare for her return, but it hasn't been determined exactly when she will leave the Blue House.\nThe spokesman says Park has no plans to issue a statement over the ruling on Friday.\n___\n3:20 p.m.\nSouth Korea's acting head of state says he feels \"heavy responsibility\" after the Constitutional Court formally removed Park Geun-hye as president over a corruption scandal.\nPrime Minister Hwang Kyo-ahn has been the government caretaker since lawmakers voted to impeach Park in December. He said Friday in a meeting with Cabinet ministers that the government needs to focus on maintaining defense and economic stability while preparing for a presidential by-election that must be held within 60 days.\nHwang also instructed the Justice Ministry and police to prepare for the possibility of violent protests following the ruling.\n___\n2:40 p.m.\nSouth Korean netizens are seeing a South Korean judge's hair rollers as a symbol of dedication and hard-working women on the day that the court that the judge leads dismissed the president from office.\nActing Chief Justice Lee Jung-mi arrived at the Constitutional Court earlier Friday with two pink hair rollers attached to the back of her bobbed hair.\nPictures of her profile showing the round curlers as the justice walked to her office, apparently unaware, went viral.\nSome South Koreans saw the apparent mistake as a sign of Lee's dedication to her work. Some linked it to President Park Geun-hye, who summoned her hair stylist to work hours after a deadly ferry sinking.\nLee, 54, is the sole female among eight judges on the Constitutional Court.\n___\nThis item corrects Lee's age.\n___\n2:30 p.m.\nSouth Korean police say a second person has died in protests against a court's decision to remove President Park Geun-hye from office.\nPolice had no other details about the death Friday. Hospital official earlier said that another person, a man in his 70s, died from head wounds after falling from a police bus in front of the Constitutional Court after it ruled to oust Park.\nThe official said the man, believed to be a Park supporter, was bleeding heavily when he arrived at the office and died at around 1:50 p.m.\nThousands of Park's supporters angrily reacted to the verdict, shouting and hitting police officers with flag poles and climbing on buses the police used to create a perimeter protecting the court.\n___\n2:25 p.m.\nSouth Korea's defense minister has ordered the military to be on alert for possible North Korean provocations attempting to exploit \"unstable situations at home and abroad.\"\nIn a video conference on Friday with military commanders, Defense Minister Han Min Koo said North Korea can make \"strategic or operational\" provocations at any time. The North has test-fired ballistic missiles in recent weeks.\nNorth Korea's state-run Korean Central News Agency has published a short dispatch on the court ruling in Seoul, anticipating that Park will now come under investigation as a \"regular criminal.\"\nThe party of ousted South Korean President Park Geun-hye, meanwhile, says it \"humbly accepts\" the ruling by the Constitutional Court to remove Park from office and that it feels responsible for her downfall.\n___\n2:10 p.m.\nA South Korean hospital official says that a man in his 70s died from head wounds after falling from a police bus in front of the Constitutional Court after it ruled to remove President Park Geun-hye from office.\nThe official said Friday that the man, believed to be a Park supporter, was bleeding heavily when he arrived at the hospital and died at about 1:50 p.m.\nThousands of Park's supporters have angrily reacted to the verdict, shouting and hitting police officers with flag poles, and climbing on buses the police used to create a perimeter protecting the court.\n___\n1:55 p.m.\nJapan's top diplomat says it will continue to work with a South Korean government led by the successor of ousted President Park Geun-hye.\nForeign Minister Fumio Kishida told reporters Friday that he would not comment on the court ruling that removed the impeached president, citing internal politics.\nKishida says both countries must work on the \"comfort women\" dispute that has strained their relations for decades. He says he hopes Tokyo and South Korea's new government can implement a 2015 agreement they signed to fully resolve the impasse over sexual exploitation of the women by Japan for its troops before and during World War II.\nKishida says Japan has no immediate plan to send back the ambassador it temporarily recalled to protest a \"comfort woman\" statue built outside of its consulate in the South Korean city of Busan.\n___\n11:55 a.m.\nThe United States says the removal of South Korean President Park Geun-hye is a domestic issue that doesn't affect its strong alliance with the country.\nThe Constitutional Court formally removed the impeached Park from office Friday over a corruption scandal.\nState Department spokesman Mark Toner says the U.S. will continue to work with the acting president, Prime Minister Hwang Kyo-ahn, and looks forward to whomever South Koreans choose in a presidential election to be held within two months.\nToner says Park's removal is \"a domestic issue on which the United States takes no position,\" and that it's up to the South Korean people to determine their country's future.\nHe says the two nations' alliance \"will continue to be a linchpin of regional stability and security.\"\n___\nThis story has been corrected to show that Lee Jung-mi is acting chief justice of the Constitutional Court, not chief justice.\nAn injured supporter of South Korean President Park Geun-hye lies on the ground during a rally opposing her impeachment near Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed the impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (Kim Do-hun/Yonhap via AP)\nA fainted supporter of South Korean President Park Geun-hye lies on a table during a rally opposing her impeachment near Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed the impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Ahn Young-joon)\nThe presidential Blue House is seen in Seoul, South Korea, Friday, March 10, 2017. In a historic, unanimous ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil and worsened an already-serious national divide. (AP Photo/Lee Jin-man)\nPolice officers move near the presidential Blue House in Seoul, South Korea, Friday, March 10, 2017. In a historic, unanimous ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil and worsened an already-serious national divide. (AP Photo/Lee Jin-man)\nSupporters of South Korean President Park Geun-hye are blocked by police as they march towards the Constitutional Court after a rally opposing her impeachment in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed the impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Ahn Young-joon)\nSupporters of South Korean President Park Geun-hye are blocked by police officers as they march toward Constitutional Court after a rally opposing her impeachment in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed the impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Ahn Young-joon)\nSupporters of South Korean President Park Geun-hye cry during a rally opposing her impeachment near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Ahn Young-joon)\nProtesters open a bottle of champagne to celebrate during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed the impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Lee Jin-man)\nA protester reacts after hearing the Constitutional Court's verdict during a rally calling for impeachment of South Korean President Park Geun-hye near the court in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed the impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Lee Jin-man)\nProtesters look at cutouts of impeached President Park Geun-hye, top, and acting leader and Prime Minister Hwang Kyo-ahn, bottom, in a mock jail as they march toward the presidential house after the Constitutional Court's verdict in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed the impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Lee Jin-man)\nA protester touches a cutout of impeached President Park Geun-hye in a mock jail as protesters march toward the presidential house after the Constitutional Court's verdict in Seoul, South Korea, Friday, March 10, 2017. In a historic ruling Friday, South Korea's Constitutional Court formally removed the impeached president from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (AP Photo/Lee Jin-man)","url":"https://www.dailymail.co.uk/wires/ap/article-4300054/The-Latest-Japan-says-work-needed-comfort-women.html"}
