{"authors":["Associated Press"],"date_download":"2018-10-23 05:28:35","date_modify":"2018-10-23 05:28:35","date_publish":"2016-01-29 21:24:15","description":"FORT WORTH, Texas (AP) — The Latest on the case of Ethan Couch, the 18-year-old who used an \"affluenza\" defense in a fatal 2013 drunken driving wreck in Texa...","filename":"data/vaneerConsumption/TheLatestParalyzedvictimtoattendCouchshearing.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:6b892f5a6c5648c4a4fb780d061e42fe-3bmscybNe842cce83474b5a04b47-215_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423146_The-Latest-Affluenza-teen-court-following-deportation_1540272515.html","title":"The Latest: Paralyzed victim to attend Couch's hearing","title_page":"The Latest: Paralyzed victim to attend Couch's hearing | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Paralyzed victim to attend Couch's hearing\nFORT WORTH, Texas (AP) — The Latest on the case of Ethan Couch, the 18-year-old who used an \"affluenza\" defense in a fatal 2013 drunken driving wreck in Texas and was recently deported from Mexico (all times local):\n3:15 p.m.\nOne of the severely injured victims from Ethan Couch's fatal drunken driving wreck plans to attend the next hearing in the case.\nThis frame grab from a Thursday, Jan. 28, 2016 taken from a video provided by Mexico's Instituto Nacional de Migracion, INM, shows a hooded Ethan Couch, as he is processed by Mexican immigration agents, in Mexico City. INM said that Couch, who used an \"affluenza\" defense in a 2013 fatal drunken-driving accident in Texas, was taken to the Mexico City airport from an immigration holding center, ending his month-long stay in Mexico. Couch was escorted onto a commercial plane, en route to Dallas, Thursday morning. (Instituto Nacional de Migracion, INM via AP)\nCouch is known for using an \"affluenza\" defense during a juvenile trial for the wreck that killed four people in 2013. The 18-year-old was recently deported from Mexico, where authorities believe he fled with is mother while prosecutors investigated whether he violated his probation in the case.\nSergio Molina was paralyzed in the wreck. His brother, Alex Lemus, says \"it's very hard to deal with all the changes\" to his brother, who can communicate only by blinking his eyes.\nBut he says Molina will be at a February hearing that will determine whether Couch's case moves to adult court. Lemus says his mother believes that had Molina been driving, \"he would have gotten the death penalty in Texas.\"\nTim McLaughlin, whose 15-year-old son survived the crash, says he also hopes Couch gets locked up. He says Couch needs \"a wake-up call.\"\n___\n11:45 a.m.\nA Texas prosecutor handling the case of \"affluenza\" teenager Ethan Couch says the public shouldn't feed his \"ego with notoriety.\"\nTarrant County District Attorney Sharen Wilson said in a statement Friday that the focus shouldn't be on the 18-year-old's \"squandered\" chances, but rather on the fallout from his drunken-driving crash in 2013 that killed four people.\nWilson says, \"behind every incident are the victims.\"\nWilson says her office will make every effort to hold Couch accountable, but she notes her office is limited by the 10-year probation issued to Couch by a juvenile court judge in the 2013 case.\nAuthorities believe Couch and his mother fled to Mexico last month as prosecutors investigated whether he violated his probation in the 2013 case. He was deported Thursday.\n___\n11 a.m.\nA judge has agreed to allow \"affluenza\" teenager Ethan Couch to remain in a juvenile detention facility as he awaits a judge's ruling on transferring his case to the adult system.\nJudge Timothy Menikos sided with Couch's attorneys during a court hearing Friday in Fort Worth. Prosecutors had asked that the 18-year-old Couch be moved to an adult jail.\nThe hearing marks the first time Couch appeared in court since being deported from Mexico on Thursday.\nAuthorities believe Couch and his mother fled to Mexico in early December, as prosecutors in Texas investigated whether he may have violated his probation in a 2013 drunken-driving wreck that killed four people.\nCouch was 16 at the time of the wreck, and the case has been handled so far in juvenile court.\n___\n10:50 a.m.\n\"Affluenza\" teenager Ethan Couch is in a Texas courtroom to face his first hearing since being deported from Mexico.\nThe 18-year-old was sentenced to probation for a 2013 drunken-driving wreck that killed four people near Fort Worth. Authorities believe he and his mother fled to Mexico in early December, as prosecutors in Texas investigated whether he may have violated his probation.\nA judge is expected to decide during Friday's hearing whether to keep Couch at the juvenile facility where he was taken after arriving back in Texas on Thursday.\nThe judge also could decide to move Couch to an adult jail to await a February hearing that will determine whether the case is transferred to the adult system, where Couch could face time behind bars.\nDuring the sentencing phase of Couch's 2013 trial, a defense witness argued Couch had been coddled into a sense of irresponsibility by his wealthy parents and deemed the condition \"affluenza.\"\n___\n1:30 a.m.\nThe Texas teenager who used an \"affluenza\" defense in a fatal drunken-driving wreck is expected to learn whether he'll be moved to an adult jail as he awaits a judge's ruling on transferring his case to the adult system.\nA hearing is scheduled Friday for 18-year-old Ethan Couch. He was deported from Mexico on Thursday and taken to a juvenile detention facility in Fort Worth.\nAuthorities believe Couch and his mother fled to Mexico as Texas prosecutors investigated whether he may have violated his probation in the drunken-driving case. Couch was 16 at the time of the wreck, so the case is being handled for now in juvenile court.\nA judge will decide Friday whether to move Couch to an adult jail, keep him at the juvenile facility or to let him go before a February hearing.\nThis frame grab taken from a Thursday, Jan. 28, 2016 video provided by Mexico's Instituto Nacional de Migracion, INM, shows Ethan Couch, as he is escorted by Mexican immigration agents, upon their arrival to the international airport in Mexico City. INM says it has taken the Texas teenager who used an \"affluenza\" defense in a fatal drunken-driving accident to the Mexico City airport, to fly him back to Texas to face charges. The institute said Thursday that Couch would be placed on a commercial flight to Dallas, Texas. (Instituto Nacional de Migración, INM via AP)\nThis frame grab taken from a Thursday, Jan. 28, 2016 video provided by Mexico's Instituto Nacional de Migracion, INM, shows Ethan Couch, escorted onto a plane by Mexican immigration agents, in Mexico City. INM says it has taken the Texas teenager who used an \"affluenza\" defense in a fatal drunken-driving accident to the Mexico City airport, to fly him back to Texas to face charges. Couch was placed on a commercial flight to Dallas, Texas. (Instituto Nacional de Migración, INM via AP)\nTarrant County Sheriff Dee Anderson speaks with media after Ethan Couch was taken into the Scott D. Moore Juvenile Justice Center on Thursday, Jan. 28, 2016, in Fort Worth, Texas. The Texas teenager who used an ¿affluenza¿ defense in a fatal drunken-driving wreck arrived in Texas following his deportation from Mexico more than a month after he and his mother fled the U.S. as prosecutors investigated whether he had violated his probation. (AP Photo/Ron Jenkins)\nEthan Couch is driven into the Scott D. Moore Juvenile Justice Center on Thursday, Jan. 28, 2016 in Fort Worth, Texas. The Texas teenager who used an ¿affluenza¿ defense in a fatal drunken-driving wreck arrived in Texas following his deportation from Mexico more than a month after he and his mother fled the U.S. as prosecutors investigated whether he had violated his probation. (AP Photo/Ron Jenkins)","url":"https://www.dailymail.co.uk/wires/ap/article-3423146/The-Latest-Affluenza-teen-court-following-deportation.html"}
