{"authors":["Associated Press"],"date_download":"2018-10-23 01:43:09","date_modify":"2018-10-23 01:43:09","date_publish":"2017-03-16 11:54:15","description":"GREENBELT, Md. (AP) - The Latest on federal court challenges to President Donald Trump's revised travel ban (all times local):6:20 p.m.A federal judge in...","filename":"data/vaneerConsumption/TheLatestJudgedoesntextendorderonnewtravelban.json","image_url":"https://i.dailymail.co.uk/1/2017/03/17/01/wire-231687-1489714463-461_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319862_The-Latest-Trump-suffers-new-defeat-revised-travel-ban_1540258989.html","title":"The Latest: Judge doesn't extend order on new travel ban","title_page":"The Latest: Judge doesn't extend order on new travel ban | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"GREENBELT, Md. (AP) - The Latest on federal court challenges to President Donald Trump's revised travel ban (all times local):\n6:20 p.m.\nA federal judge in Seattle has ruled that his order blocking President Donald Trump's original travel ban does not apply to the revised executive order.\nNadia Hanan Madalo, center, hugs her brother Gassan Kakooz at the airport after arriving from Iraq Wednesday, March 15, 2017, in San Diego. Madalo and her family, refugees forced to flee their town of Batnaya, Iraq, after the Islamic State invaded and destroyed it several years ago, arrived in San Diego to be reunited with Madalo's siblings and mother. As they flew to the U.S. on Wednesday, a federal judge in Hawaii put a hold on President Trump's newest ban - the latest development in a fight between the administration and the courts that has injected more uncertainty into the lives of refugees. (AP Photo/Gregory Bull)\nJudge James Robart entered his ruling Thursday, one day after a federal judge in Hawaii blocked Trump's new executive order that would've suspended new visas for people from six predominantly Muslim countries and halted the U.S. refugee program.\nRobart said his order last month blocking the original ban should not apply to the new one because there were enough differences between the two.\nRobart noted that Washington and several other states have also asked him to block the revised ban. He said he would rule on that request later.\n___\n10:15 a.m\nThe federal judge in Maryland who on Thursday blocked President Donald Trump's revised travel ban that targets six predominantly Muslim countries called Trump's own statements about his intentions to impose the restrictions \"highly relevant.\"\nU.S. District Judge Theodore Chuang noted Trump's second executive order does include changes from the first order, such as the removal of a preference for religious minorities in the refugee process. Chuang said the purpose of the second order \"remains the realization of the long-envisioned Muslim ban.\"\nChuang, who was appointed by then-President Barack Obama, granted a preliminary injunction prohibiting the enforcement of the travel ban nationwide pending further orders. He declined to issue an injunction blocking the entire executive order.\nGovernment lawyers argued that the second ban was substantially revised from an earlier version signed in January that was later blocked by a federal judge in Washington state.\n___\n9:45 a.m.\nOne of the attorneys in the Maryland lawsuit against President Donald Trump's revised travel ban says the court saw through what he called the government's \"maneuvering\" and recognized the new order for what it was. Lee Gelernt says the revised ban is \"a Muslim ban.\"\nGelernt is deputy director of the American Civil Liberties Union's Immigrants' Rights Project.\nGelernt said the judge's order also is important because it will remain in place \"through trial, and not just for a couple of weeks.\"\nJudge Theodore Chuang issued the order early Thursday, saying the ACLU and other groups were likely to prevail on their arguments that the ban was unconstitutional because it discriminates on the basis of religion.\n___\n7:45 a.m.\nA federal judge in Greenbelt, Maryland, has blocked President Donald Trump's revised travel ban targeting six predominantly Muslim countries.\nJudge Theodore Chuang ruled Thursday in a case brought near the nation's capital by the ACLU and other groups representing immigrants, refugees and their families. The groups argued that the underlying rationale of the ban was to discriminate against Muslims, making it unconstitutional. Chuang granted a preliminary injunction nationwide basis.\nIt was the latest ruling against Trump's revised travel ban.\nGovernment lawyers argued that the ban was substantially revised from an earlier version signed in January that was later blocked by a federal judge in Washington state. They said the ban was ordered in the interest of national security to protect the U.S. from \"radical Islamic terrorism.\"\nThe Maryland plaintiffs also argued the ban illegally reduces the number of refugees authorized to enter the U.S. this year.\nChuang granted a preliminary injunction nationwide basis pending further orders from this court. He declined to stay the ruling should an emergency appeal be filed.\n___\n1:40 a.m. EDT\nA federal judge blocked President Donald Trump's revised travel ban hours before it was to take effect, marking the second time courts have thwarted Trump's efforts to freeze immigration by refugees and citizens of some predominantly Muslim nations.\nThe ruling came from a judge in Hawaii who rejected the government's claims that the travel ban is about national security, not discrimination. U.S. District Judge Derrick Watson also said Hawaii would suffer financially if the executive order constricted the flow of students and tourists to the state, and that Hawaii was likely to succeed on a claim that the ban violates First Amendment protections against religious discrimination.\nWatson criticized what he called the \"illogic\" of the government's arguments and cited \"significant and unrebutted evidence of religious animus\" behind the travel ban. He also noted that while courts should not examine the \"veiled psyche\" and \"secret motives\" of government decision-makers, \"the remarkable facts at issue here require no such impermissible inquiry.\"\nNadia Hanan Madalo, center right, hugs her mother, Alyshooa Kannah, center left, at the airport after arriving from Iraq Wednesday, March 15, 2017, in San Diego. Madalo and her family, refugees forced to flee their town of Batnaya, Iraq, after the Islamic State invaded and destroyed it several years ago, arrived in San Diego to be reunited with Madalo's siblings and mother. As they flew to the U.S. on Wednesday, a federal judge in Hawaii put a hold on President Trump's newest ban - the latest development in a fight between the administration and the courts that has injected more uncertainty into the lives of refugees. (AP Photo/Gregory Bull)\nThis December 2015 photo shows U.S. District Judge Derrick Watson in Honolulu. Hours before it was to take effect, President Donald Trump's revised travel ban was put on hold Wednesday, March 15, 2017, by Watson, a federal judge in Hawaii who questioned whether the administration was motivated by national security concerns. (George Lee/The Star-Advertiser via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4319862/The-Latest-Trump-suffers-new-defeat-revised-travel-ban.html"}
