{"authors":[],"date_download":"2018-10-30 20:33:21","date_modify":"2018-10-30 20:33:21","date_publish":"2016-01-26 18:32:51","description":"RIO DE JANEIRO (AP) — The latest on the fight against the Zika virus that health officials suspect is linked to a wave of birth defects in Brazil. (All","filename":"data/vaneerConsumption/TheLatestObamacallsforaspeedingupofZikaresearch.json","image_url":"https://media.breitbart.com/media/2016/01/ap_ap-photo-49.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/news__1540931601.html","title":"The Latest: Obama calls for a speeding up of Zika research","title_page":"The Latest: Obama calls for a speeding up of Zika research - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"RIO DE JANEIRO (AP) — The latest on the fight against the Zika virus that health officials suspect is linked to a wave of birth defects in Brazil. (All times local):\n8:10 p.m.\nPresident Barack Obama is calling for speeding up research to diagnose, prevent and treat Zika virus.\nObama met with public health and national security officials about the mosquito-borne virus on Tuesday in the Situation Room. The White House says Obama was briefed on steps being taken to protect Americans and factors that could cause the virus to spread in the U.S. Officials also updated the president on how the virus’ spread in the hemisphere could affect the economy and development.\nLeaders from the National Institutes of Health, the Centers for Disease Control and Prevention and the Health and Human Services Department took part in the meeting.\nThe White House says Obama told the officials that all Americans should have information about the virus and how to protect themselves from infection.\nHealth officials suspect Zika is linked to a wave of birth defects in Brazil in which babies have small heads. U.S. officials have recommended pregnant women consider postponing trips to areas in the Caribbean and South America affected by Zika virus disease outbreaks.\n___\n6:30 p.m.\nHealth officials say a Virginia resident who traveled outside the United States has tested positive for Zika, a mosquito-transmitted virus.\nHealth Commissioner Dr. Marissa Levine says the resident traveled to a country where the Zika virus transmission is ongoing. She says this person poses no risk to other residents, because it is not mosquito season in Virginia.\nHealth officials suspect Zika is linked to a wave of birth defects in Brazil in which babies have small heads. The Centers for Disease Control and Prevention is recommending that pregnant women consider postponing trips to countries and areas in the Caribbean and South America where there are Zika virus disease outbreaks.\n5:25 p.m.\nThe U.S. government is beginning research into a possible vaccine for the mosquito-borne Zika virus that is suspected of causing an unusual birth defect as it spreads in Latin America.\nDon’t expect protection anytime soon — vaccine development typically takes years.\nDr. Anthony Fauci of the National Institutes of Health says in an interview Tuesday: “This is not going to be overnight.”\nBut there are vaccines in various stages of development for other viruses in the same family — dengue, West Nile and chikungunya — that offer a pattern for creating something similar against Zika, said Fauci, who directs NIH’s National Institute of Allergy and Infectious Diseases.\n___\n5:05 p.m.\nCosta Rica has confirmed the first known case of the Zika virus in the Central American nation.\nThe Health Ministry says the mosquito-borne virus was apparently contracted by a 25-year-old man during a trip to Colombia this month.\nIt said he showed the first symptoms of the virus on Jan. 22 while still in Colombia, returned to Costa Rica the following day and sought medical attention on the 24th.\nAuthorities conducted a sweep for possible mosquito breeding grounds for about 100 yards (meters) around the man’s home, and fumigated the area.\nThey also interviewed neighbors but did not find any other people with Zika symptoms.\n___\n4:45 p.m.\nU.S. health officials have again expanded their travel alert to pregnant women about trips to the Caribbean and Latin America.\nThe Centers for Disease Control and Prevention on Tuesday added the U.S. Virgin Islands and the Dominican Republic to the list of destinations with Zika virus disease outbreaks. Research in Brazil is suggesting a link between the infection in pregnant moms and a rare birth defect.\nPreviously, the CDC recommended that pregnant women should consider postponing trips to 22 destinations. In Latin America: Bolivia, Brazil, Colombia, Ecuador, El Salvador, French Guiana, Guatemala, Guyana, Honduras, Mexico, Panama, Paraguay, Suriname and Venezuela. In the Caribbean: Barbados, Guadeloupe, Haiti, Martinique, St. Martin and Puerto Rico. Also, Cape Verde, off the coast of western Africa; and Samoa in the South Pacific.\n___\n4:10 p.m.\nHealth authorities in Panama are recommending that members of an indigenous community hard-hit by Zika avoid getting pregnant.\nAt least 42 cases of the mosquito-borne virus have been detected in the sparsely populated province of Guna Yala along the Caribbean coast, one of them a 22-year-old pregnant woman. The area formerly known as San Blas is dominated by indigenous groups and popular with tourists.\nIsrael Cedeno, a Health Ministry expert, said that authorities are going house-to-house explaining how to prevent transmission but that it’s running up against cultural barriers and the lack of family planning among the Guna tribe.\n___\n4:30 p.m.\nThe Arkansas Department of Health says a person who recently traveled out of the United States has tested positive for the Zika virus.\nThe department says that the person has a mild case of Zika, which is spread by mosquitoes and is suspected of causing a spate of birth defects in Brazil. Spokeswoman Meg Mirivel would not say whether Tuesday if the infected person is a man or woman or give the person’s age.\nMirivel says the individual traveled to the Central America-Caribbean region, though she would not specify which country. Some U.S. travelers have been infected abroad with Zika but there are no cases of local infection in the U.S. so far.\nBrazilian officials have linked the virus with a rare birth defect, and the U.S. Centers for Disease Control and Prevention have urged pregnant women to consider postponing flights to areas where the virus is prevalent.\n___\n4:25 p.m.\nLatin America’s largest airline says it’s waiving cancellation or flight-change fees for pregnant women who want to cancel flights to countries where the Zika virus is present.\nGrupo LATAM says the policy applies to Brazil, Colombia, El Salvador, Guatemala, French Guyana, Haiti, Honduras, Martinique, Mexico, Panama, Paraguay, Puerto Rico, Suriname and Venezuela.\nThe U.S. Centers for Disease Control and Prevention has urged pregnant women to consider postponing visits to 22 destinations because of concern that the mosquito-borne virus could be linked to a wave in Brazil of microcephaly cases in which children are born with heads that are smaller than normal and often have developmental problems.\nThe World Health Organization cautions that the link is not yet scientifically proven.\n___\n4:00 p.m.\nColombian officials are raising the number of suspected cases of the Zika virus in their country. They say 16,490 people now apparently have had the disease that’s been linked to birth defects in Brazil. Of those 1,090 are pregnant women.\nThe new figures come as health minister begins a nationwide effort to rally local officials to battle the Aedes aegypti mosquito that transmits the virus.\nMinister Alejandro Gaviria said Tuesday he hopes Colombia will become “an example for Latin America” in the battle against Zika.\nPresident Juan Manuel Santo has said Colombian officials expect to see 600,000 cases of Zika this year, and are preparing for the possibility of infants born with microcephaly, a birth defect that has skyrocketed in Brazil along with cases of Zika.\nSo far, there’s only one case of microcephaly in Colombia suspected of being linked to Zika.\n___\n3:00 p.m.\nThe U.S. territory of Puerto Rico is reporting a jump in the number of mosquito-borne Zika virus cases.\nHealth Secretary Ana Rius says there are 18 confirmed new cases in addition to one known earlier. None involve pregnant women. Brazilian officials have linked the tropical illness to birth defects.\nPuerto Rico epidemiologist Brenda Rivera said Tuesday the majority of cases are in the island’s southeast region. She says many of the victims are elderly.\nOfficials said they are testing more than 200 other potential Zika cases that have tested negative to dengue and chikungunya.\nU.S. officials say pregnant women should consider postponing trips to 22 destinations with Zika infections, including Puerto Rico.\n___\n2:55 p.m.\nU.S. health officials are putting out advice to doctors on testing newborns for Zika virus, a tropical infection linked to a wave of birth defects in Brazil.\nThe guidance is for doctors caring for infants born to mothers who traveled to Zika outbreak areas in Latin America or the Caribbean during their pregnancy. The advice covers which situations call for Zika testing and when to do fetal ultrasounds.\nThe Centers for Disease Control and Prevention released the guidelines Tuesday.\nZika is spread by mosquitoes, and in most people causes no more than mild illness. But there’s been mounting evidence linking Zika infection in pregnant women to a birth defect in which a newborn’s head is unusually small and the brain may not develop properly.\n2:40 p.m.\nArgentina authorities say they are investigating a possible case of infection by the mosquito-borne Zika virus. It would be a first for the nation that shares a border with Brazil.\nSanta Fe Health Department official Andrea Uboldi tells La Red radio that the man is in the city of Rosario and had recently visited Brazil, where hundreds of thousands of cases of Zika are suspected and authorities are investigating a possible link to birth defects.\nMeanwhile, officials in the Argentine province of Corrientes have declared an epidemiological alert due to an outbreak of dengue in the area. Dengue and Zika are both transmitted by the Aedes aegypti mosquito.\n___\nThe item on Puerto Rico has been corrected to note that there was a previous case. The total is now 19.","url":"https://www.breitbart.com/news/the-latest-obama-calls-for-a-speeding-up-of-zika-research/"}
