{"authors":[],"date_download":"2018-10-30 01:05:56","date_modify":"2018-10-30 01:05:56","date_publish":"2018-08-10 00:05:57","description":null,"filename":"data/vaneerConsumption/TheLowDownonBigTechsTroubles.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/German-Money.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861556.html","title":"The Low Down on Big Tech’s Troubles","title_page":"The Low Down on Big Tech’s TroublesThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Mainstream big technology companies’ market value has exploded in 2018. At first glance, the rise seems understandable. The technologies developed are ubiquitous. When taking a closer look at the numbers, with particular reflection on the 2008 financial crisis, some serious questions arise pertaining to consumer sovereignty, growth longevity, and inflation. These dangers may pop the tech bubble.\nThe chief suspects are the FAANGs: Facebook, Apple, Amazon, Netflix, and Alphabet’s Google. The FAANG five make up about fifteen percent of the S&P 500 and account for almost all of its growth this year. The ten-year bull run since the meltdown is defined by the FAANGs. They may also define its undoing.\nThe Wall Street Journal reported on Wednesday that Facebook wants your bank account information. In light of the Cambridge Analytica scandal of this last year, Facebook’s liaison with the banking industry is deeply troubling. Yes, companies are incentivized to streamline purchase systems. But leaks and hacks, such as with credit giant Equifax this past year, are credible threats. The Journal’s report highlights the intrusiveness of big tech.\nConsumer sovereignty concerns don’t end there. The recent banning of Alex Jones’s “InfoWars” on Apple’s iTunes, Facebook, and Youtube are mere symptoms of undiagnosed problems. In short, consumers, regulators, and big tech are learning how to operate together. On the supply side, the narrowness of company product lineups worries investors. How did the iPhone carry Apple to a trillion dollar stock value? Can Google diversify from ad revenue alone? Are FAANG stocks value stocks — will they hit a certain value and sit — or are they growth stocks?\nTo be sure, the emperor has clothes. Profits, revenues, cash holdings, growth rates, and other metrics demonstrate the real values of these companies. The questions above are but brush strokes for the day trader. In the greater economic landscape, however, the question pertains to inflation: is the economy off center and if it is, how does this relate to the tech market?\nEconomics isn’t called the dismal science flippantly. The FAANGs are fine, but something is wrong with the entire picture.\nThe Federal Reserve quantitative easing policy post-2008 has created a huge bubble. Money, counting into the trillions of dollars, was printed to combat economic downturn. Now, that money, in combination with low interest rates, is pushing values higher than they are actually worth. We are sick from yesterday’s medicine.\nThe Great Recession and the policies post-crash continue to drag on the economy. The artificial pumping of money into the U.S. economy, by printing bills to bail out “too big to fail” banks, has created what economists call the Cantillon Effect, as defined by the American Council for Economic Research (AIER):\nThe Cantillon Effect refers to the change in relative prices resulting from a change in money supply. The change in relative prices occurs because the change in money supply has a specific injection point and therefore a specific flow path through the economy. The first recipient of the new supply of money is in the convenient position of being able to spend extra dollars before prices have increased. But whoever is last in line receives his share of new dollars after prices have increased.\nThe first ’49er to strike it rich at Sutter’s Mill, for example, was incentivized to make new purchases quickly because prices lagged far behind knowledge of the money supply. Over the last ten years, we have seen this story play out. Certain industries were given favorable status by the first users of the new money, the big banks. As of now, the most notable recipients would be the housing market, goaded onward with ultra low interest rates and down payments (is it 2007 or 2018?).\nHow does this involve the tech sector? While high tech may be running on retained corporate earnings and stock shares, they are a part of the economy. If you cannot afford rent, you cannot pay for Netflix. When one pillar collapses, the next will go.\nSo, is tech a leading or lagging indicator of a bust? Looking at this last year’s growth rates, it could be a mixture of both. The ten-year bull run is the longest in U.S. economic history and we are due for a pop. And, as stated, the FAANGs are the horns of this bull market.\nThe tech sector is the market to watch because of market psychology. As Mark Thornton of the Ludwig von Mises Institute put it, “The [Federal Reserve] created the bubble and the deregulation and tax reform has allowed the market to return close to its all-time highs. Psychologically, if the market can’t set a new all-time here it will disappoint the market. With the prospects of rate hikes coming the unraveling can begin.”\nIf the tech sector can’t keep chugging along, it could spell trouble.\nDon’t jump off the high rise, it’s not 1929 yet. The FAANGs still have solid growth on the back of deregulation, tax reform, and good business practice. For instance, Apple has been able to move billions of dollars from its offshore accounts back into the U.S. for the first time in years. Private firms are hitting the marks they should all the while addressing consumer concerns. Yet, be warned. The system is broken and big tech could be the first to go.","url":"https://spectator.org/the-low-down-on-big-tech-consumer-sovereignty-inflation-and-other-troubles/"}
