{"authors":["Associated Press"],"date_download":"2018-10-23 03:39:45","date_modify":"2018-10-23 03:39:45","date_publish":"2016-01-28 19:14:12","description":"CHICAGO (AP) — The Latest on the investigation of relatives of a northern Illinois police officer who staged his suicide after embezzling from a youth progra...","filename":"data/vaneerConsumption/TheLatestNochargesagainstsonofIllinoisofficer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:88503fc4a9344831ba7041f6b6bd4deb-4PuZeKVXE7cd9005b2c876098817-241_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421529_The-Latest-No-charges-against-son-Illinois-officer_1540265985.html","title":"The Latest: No charges against son of Illinois officer","title_page":"The Latest: No charges against son of Illinois officer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: No charges against son of Illinois officer\nCHICAGO (AP) — The Latest on the investigation of relatives of a northern Illinois police officer who staged his suicide after embezzling from a youth program (all times local):\n12:45 p.m.\nAuthorities say they don't have enough evidence to charge the son of a disgraced northern Illinois policeman with financial crimes even though text messages show father and son discussing money pilfered from a youth program before the officer killed himself.\nMelodie Gliniewicz, 51, of Antioch,Ill., appearars at the Lake County sheriff's office after she was indicted in Waukegan, Ill., by a Lake County grand jury. The grand jury on Wednesday, Jan. 27, 2016, indicted the 51-year-old Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit. (Mark Welsh/Daily Herald via AP)\nAuthorities say Fox Lake police Lt. Charles Joseph Gliniewicz staged his September suicide to look like he'd been killed in the line of duty because he feared his embezzlement was about to be uncovered. His death triggered a massive, weeks-long manhunt that left the community on edge.\nHis wife was indicted Wednesday, but her lawyer denies she took part in the theft from the Fox Lake Police Explorer Post her husband ran.\nLake County Sheriff's Office spokesman Christopher Covelli says investigators were not able to prove that the officer's son, 23-year-old Donald \"D.J.\" Gliniewicz, knew beforehand that money he was spending had been stolen.\n___\n1:45 a.m.\nThe wife of a northern Illinois police officer who killed himself after embezzling from a youth program has turned herself in after being indicted by a grand jury.\nMelodie Gliniewicz was taken to the Lake County jail Wednesday. She was released later in the day after posting 10 percent of her $50,000 bond.\nHer husband, Lt. Charles Joseph Gliniewicz, died Sept. 1. Authorities say he staged his suicide to look like a homicide. Investigators believe he feared discovery of the embezzlement.\nAuthorities say Melodie Gliniewicz served as an adviser to the Fox Lake Police Explorer Post her husband ran.\nA grand jury indicted the 51-year-old Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit.\nIn a statement, her attorneys vehemently denied she took part in her husband's scheme.\nFILE - In this Sept. 2, 2015 file photo, Melodie Gliniewicz, the wife of Fox Lake Police Lt. Charles Joseph Gliniewicz, leaves with her family during a vigil to honor her husband in Fox Lake, Ill. Authorities later said Gliniewicz staged his suicide to look like a homicide after embezzling from a youth program. On Wednesday, Jan. 27, 2016, a grand jury indicted Melodie Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit. (AP Photo/Nam Y. Huh, File)\nMelodie Gliniewicz, right, of Antioch,Ill., appears at the Lake County sheriff's office after she was indicted in Waukegan, Ill., by a Lake County grand jury. The grand jury on Wednesday, Jan. 27, 2016, indicted the 51-year-old Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit. (Gilbert R. Boucher II/Daily Herald via AP)\nMelodie Gliniewicz, right, of Antioch,Ill., appears at the Lake County sheriff's office after she was indicted in Waukegan, Ill., by a Lake County grand jury. The grand jury on Wednesday, Jan. 27, 2016, indicted the 51-year-old Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit. (Gilbert R. Boucher II/Daily Herald via AP)\nDetective Chris Covelli, left, of the Lake County Sheriff's office speaks aabout the wife of disgraced Fox Lake police Lt. Charles Joseph Gliniewicz. Melodie Gliniewicz, 51, of Antioch,Ill., appeared at the Lake County sheriff's office after she was indicted in Waukegan, Ill., by a Lake County grand jury. The grand jury on Wednesday, Jan. 27, 2016, indicted the 51-year-old Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit. (Mark Welsh/Daily Herald via AP)\nMelodie Gliniewicz, 51, of Antioch,Ill., appears at the Lake County sheriff's office after she was indicted in Waukegan, Ill., by a Lake County grand jury. The grand jury on Wednesday, Jan. 27, 2016, indicted the 51-year-old Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit. (Mark Welsh/Daily Herald via AP)\nMelodie Gliniewicz, 51, of Antioch,Ill., appears at the Lake County sheriff's office after she was indicted in Waukegan, Ill., by a Lake County grand jury. The grand jury on Wednesday, Jan. 27, 2016, indicted the 51-year-old Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit. (Mark Welsh/Daily Herald via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3421529/The-Latest-No-charges-against-son-Illinois-officer.html"}
