{"authors":["Associated Press"],"date_download":"2018-10-23 05:23:53","date_modify":"2018-10-23 05:23:53","date_publish":"2017-04-26 16:56:05","description":"LONDON (AP) - The Latest on a giant rabbit that died following a trans-Atlantic flight (all times local):6:20 p.m.An Iowa man who was getting a giant rabbit...","filename":"data/vaneerConsumption/TheLatestIowamanmourningafterdeathofgiantrabbit.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448382_The-Latest-Airline-says-giant-rabbit-alive-landing_1540272233.html","title":"The Latest: Iowa man \"mourning\" after death of giant rabbit","title_page":"The Latest: Iowa man \"mourning\" after death of giant rabbit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LONDON (AP) - The Latest on a giant rabbit that died following a trans-Atlantic flight (all times local):\n6:20 p.m.\nAn Iowa man who was getting a giant rabbit from Britain for his boss to show at the Iowa State Fair says \"we're still in the mourning process\" after hearing that the animal died en route.\nBryan Bergdale of West Des Moines had driven last Thursday to Kansas City to pick up Simon, a 10-month-old, 3-foot continental rabbit, when he received a call from United Airlines. Bergdale says \"we'd built a pen and had toys all ready.\"\nBergdale, who manages farmland investments, says the rabbit cost his boss 415 pounds ($530) and shipping was 1,400 pounds ($1,800). He says he had a 5-foot-by-8-foot pen built in a farm garage in Norwalk and had planned for air conditioning to be piped in.\nBergdale said the United Airlines representative who called was \"very nice\" but didn't say anything about compensating him. He says \"we're not quite sure what we're going to do.\"\n___\n4:45 p.m.\nUnited Airlines spokesman Charles Hobart says the airline is reviewing its handling of a giant rabbit that died following a flight from London to Chicago.\nThe animal was alive and showed no signs of distress upon landing but died at a pet holding facility at the airport, Hobart said.\n\"We won't know the cause of death because we offered to perform a necropsy free of charge - that's standard procedure - but the customer didn't want us to perform a necropsy, and we understand,\" he said.\nHobart said the airline offered compensation to the breeder but would not disclose the amount.\nBreeder Annette Edwards told The Associated Press by phone Wednesday that a veterinarian checked Simon, a 10-month-old, 3-foot (meter) -long continental rabbit, shortly before the flight to O'Hare, from where it was set to continue on to Kansas City. Simon had been purchased by a celebrity whom Edwards did not identify.\n___\n10:35 a.m.\nUnited Airlines is investigating a report that a giant rabbit died on one of its trans-Atlantic flights.\nDistraught breeder Annette Edwards from Worcestershire in central England told The Associated Press by phone Wednesday that Simon, a 10-month-old, 3-foot-long continental rabbit, had a vet check shortly before traveling from London's Heathrow airport to Chicago's O'Hare airport. She said Simon had been purchased by a celebrity whom she did not identify.\n\"Simon had his vet check just before getting on the plane,\" she said. \"He was fit as a fiddle.\"\nThe airline said in a statement that it was \"saddened\" by the news and had been in contact with Edwards and offered assistance. The company is dealing with public relations issues after a passenger who would not give up his seat was dragged forcibly from a plane in Chicago three weeks ago.","url":"https://www.dailymail.co.uk/wires/ap/article-4448382/The-Latest-Airline-says-giant-rabbit-alive-landing.html"}
