{"authors":["Associated Press"],"date_download":"2018-10-23 02:30:40","date_modify":"2018-10-23 02:30:40","date_publish":"2016-01-11 14:47:05","description":"MEXICO CITY (AP) — The latest on the capture of Mexican drug lord Joaquin \"El Chapo\" Guzman, his meeting with Sean Penn and efforts to send Guzman to the Uni...","filename":"data/vaneerConsumption/TheLatestNewspaperphotosappeartoshowPennmonitored.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:0cc17317a0ef4ac5843d5a1a4bbd1d5e-48qEJGFphM8d437f0aaf925fc3c3-205_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393957_The-Latest-At-year-El-Chapo-US_1540261840.html","title":"The Latest: Newspaper photos appear to show Penn monitored","title_page":"The Latest: Newspaper photos appear to show Penn monitored | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Newspaper photos appear to show Penn monitored\nMEXICO CITY (AP) — The latest on the capture of Mexican drug lord Joaquin \"El Chapo\" Guzman, his meeting with Sean Penn and efforts to send Guzman to the United States (all times local):\n8:15 a.m.\nActor Sean Penn says he worried that officials were monitoring his trip to interview fugitive drug lord Joaquin \"El Chapo\" Guzman.\nMexican drug lord Joaquin \"El Chapo\" Guzman, right, is escorted by soldiers and marines to a waiting helicopter, at a federal hangar in Mexico City, Friday, Jan. 8, 2016. The world's most wanted drug lord was recaptured by Mexican marines Friday, six months after he fled through a tunnel from a maximum security prison in an escape that deeply embarrassed the government and strained ties with the United States.(AP Photo/Marco Ugarte)\nHe was right; he just didn't know how closely.\nThe Mexican newspaper El Universal has published 10 photographs that appear to show Penn and actress Kate Del Castillo arriving at an airport in October and greeting the men who apparently took them to a small airstrip, from which they flew to the jungle camp to meet Guzman.\nThe photos appear to have been taken with a telephoto lens from long distance. The newspaper said Monday they were part of a Mexican government intelligence file that it obtained.\nFigures that closely resemble Penn and Del Castillo are seen wearing dark glasses, and in Penn's case, a baseball cap.\nThe newspaper says the intelligence file indicates that Mexican agents had been photographing Del Castillo since her first meeting with Guzman's lawyers in the city of Guadalajara, on June 16.\n8:00 a.m.\nThe head of extradition for the Mexican Attorney General's Office says it probably will take at least a year to extradite Joaquin \"El Chapo\" Guzman to the United States.\nOfficials had previously estimated a six-month minimum, but Jose Manuel Merino told local media that the extradition would probably take \"one year or longer.\" Merino told Radio Formula that the length of the process would depend on how hard the defendant's lawyers fight each stage. Merino said the process had lasted as long as six years, in one case.\nThe Attorney General's Office issued a statement Sunday it's started the extradition mechanism by notifying Guzman that two arrest warrants from the U.S. are being processed.\nGuzman was recaptured Friday, six months after breaking out of a Mexican prison.\nGuzman's attorney Juan Pablo Badillo has said that the defense already has filed six motions to challenge extradition requests.\nFILE - In this Oct. 8, 2015 file photo, Sean Penn speaks during a forum with young entrepreneurs during the IMF and World Bank annual meeting in Lima, Peru. Late Saturday, Jan. 9, 2016, Rolling Stone magazine published an interview that Guzman apparently gave to Penn in his hideout in Mexico months before his recapture. In the article and interview, Penn describes the complicated measures he took to meet the legendary drug lord. (AP Photo/Rodrigo Abd, File)\nJoaquin \"El Chapo\" Guzman is made to face the press as he is escorted to a helicopter in handcuffs by Mexican soldiers and marines at a federal hangar in Mexico City, Mexico, Friday, Jan. 8, 2016. Mexican President Enrique Pena Nieto announced that Guzman had been recaptured six months after escaping from a maximum security prison. (AP Photo/Eduardo Verdugo)\nMexican drug lord Joaquin \"El Chapo\" Guzman is loaded into a marine helicopter at a federal hangar in Mexico City, Friday, Jan. 8, 2016. The world's most wanted drug lord was recaptured by Mexican marines Friday, six months after he fled through a tunnel from a maximum secuirty prison in an escape that deeply embarrassed the government and strained ties with the United States. (AP Photo/Eduardo Verdugo)\nMexican Navy marines stand next to their vehicle after they participated in the recapture of Mexico's most wanted drug lord, Joaquin \"El Chapo\" Guzman in the city of Los Mochis, Mexico, Friday, Jan. 08, 2016. The world¿s most-wanted drug lord was captured for a third time, as Mexican marines staged heavily-armed raids that caught drug lord Joaquin \"El Chapo\" Guzman six months after he escaped from a maximum security prison. (AP Photo/Mahatma Millan)\nA Mexican army vehicle stands guard outside of a motel wheere Mexico's most wanted drug lord, Joaquin \"El Chapo\" Guzman was captured, in the city of Los Mochis, Mexico, Friday, Jan. 8, 2016. The world¿s most-wanted drug lord was captured for a third time, as Mexican marines staged heavily-armed raids that caught Guzman six months after he escaped from a maximum security prison.(Carlos Paulino via AP/EL DEBATE)","url":"https://www.dailymail.co.uk/wires/ap/article-3393957/The-Latest-At-year-El-Chapo-US.html"}
