{"authors":["Jerome Hudson"],"date_download":"2018-10-30 21:23:22","date_modify":"2018-10-30 21:23:22","date_publish":"2015-10-09 19:09:03","description":"The liberal media is engaged in a lynching of Dr. Ben Carson, the latest \"uppity negro\" to defy his white mainstream media masters.","filename":"data/vaneerConsumption/TheLiberalMediaLynchingofDrBenCarson.json","image_url":"https://media.breitbart.com/media/2015/08/Dr-ben-carson-profile-Justin-Sullivan-AP-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_10_09__1540934602.html","title":"The Liberal Media Lynching of Dr. Ben Carson","title_page":"The Liberal Media Lynching of Dr. Ben Carson | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"We are all witnessing an elaborate liberal media lynching of Dr. Ben Carson. The former Johns Hopkins neurosurgeon turned leading black Republican presidential candidate is just the latest “uppity negro” (Justice Clarence Thomas, Herman Cain) to defy the expectations of his white liberal mainstream media masters by deciding to ditch the political hymnal from which most blacks read and think for himself.\nNo matter that before he was surgically splitting brains, Ben Carson was being raised in poverty by a single mother. The disgusting, and yet prevailing, wisdom among far too many Americans is that if black people grow up impoverished like Ben Carson did, their unfortunate fate is a fixture of an America that is, always was, and always will be a devoutly racist place. And if you are black in America, you should never expect to achieve any meaningful socioeconomic success–like becoming a brilliant brain surgeon–simply because of the barriers American racism persistently permit.\nOf course, this is fallacy.\nMore pointedly, Ben Carson rebukes that bitter ethos and the victim-focused racial identity it breeds. And now that–as a national figure running for president–he has chosen not to be a mindless minstrel puppet, tap dancing, performing, like a good boy, for his white liberal media gatekeepers, he is being whipped, strung up, and left to hang.\nFor all the Left’s pseudo-social science drivel about how white America “otherizes” blacks–mercilessly demeaning their humanity, transforming them to subhuman status–one would assume there would be more influential African Americans defending Ben Carson from abhorrent attacks like being called a “coon” by an Ivy League professor.\nI dare you to imagine a GQ headline that read, “Fuck Barack Obama.”\nYou can’t.\nWhy is it this way? Carson’s political flogging, if you will, serves two purposes.\nFirst, it serves as a warning to blacks, Hispanics, women, and any other member of the Liberal Victimhood Class System that should you ever decide to leave The Liberal Thought Plantation, we’ll sic the dogs on you!\nSecond, the mainstream media is a 24-hour propaganda mill charged with protecting a false narrative about American life for blacks, Hispanics, and women in 2015 to benefit the Democratic party. There are Cardinals of Faith that liberal media elites must propagate and protect. And Ben Carson–his life story, his politically incorrect character–is a threat and is anathema to the preferred progressive orthodoxy.\nDr. Ben Carson is the rare black American, free from The Liberal Thought Plantation, unwillingly to dance for his liberal betters or apologize for America while portraying himself as a sufferer.\nDr. Ben Carson is an existential threat to the Democrat Media Complex. For this, he must be destroyed.","url":"https://www.breitbart.com/the-media/2015/10/09/liberal-media-lynching-dr-ben-carson/"}
