{"authors":["Associated Press"],"date_download":"2018-10-23 04:26:45","date_modify":"2018-10-23 04:26:45","date_publish":"2016-01-29 20:09:57","description":"CHICAGO (AP) — The latest on the Chicago Police Department and fatal police shootings in the city (all times local): 2 p.m. A Chicago police spokesman says t...","filename":"data/vaneerConsumption/TheLatestChicagopolicesaydashcamaudioapriority.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422844_The-Latest-More-mental-illness-training-Chicago-police_1540268805.html","title":"The Latest: Chicago police say dashcam audio a priority","title_page":"The Latest: Chicago police say dashcam audio a priority | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Chicago police say dashcam audio a priority\nCHICAGO (AP) — The latest on the Chicago Police Department and fatal police shootings in the city (all times local):\n2 p.m.\nA Chicago police spokesman says the department has placed high priority on making sure audio on squad car dashcams function properly and that more are now working as they should.\nThe absence of audio in a dashcam video showing white police officer Jason Van Dyke fatally shooting Laquan McDonald in 2014 sparked conversations in the public and in the department.\nPolice officials last month blamed the absence of audio in 80 percent of dashcam videos on officer error and \"intentional destruction.\"\nAnthony Guglielmi said Friday that the department now audits dashcams on a daily basis and that \"officers and supervisors will be held accountable.\"\nHe says 20 officers and supervisors have been disciplined since the closer scrutiny began last month, ranging from reprimands to a few days' suspension. He also said \"there is still work to do.\"\n___\n11:10 a.m.\nAn attorney for a white Chicago police officer who shot a black teenager 16 times says his client did not tamper with his squad car's dashcam in response to a Chicago news outlet's report this week that the device was intentionally damaged.\nDNAinfo Chicago obtained CPD maintenance records through a public information request. Those records show that the dashboard video and audio recording device in Van Dyke's vehicle was reported damaged months before the October 2014 shooting of Laquan McDonald.\nThe report says the records also show that a day after the device was fixed, it was intentionally damaged. It was fixed another time, but on the night of the shooting, the system did not record any audio.\nDefense attorney Dan Herbert said Friday that if the device was tampered with, then someone other than his client was responsible.\nOfficer Jason Van Dyke is charged with first-degree murder. He has pleaded not guilty.\n___\n10:15 a.m.\nThe attorney for a white Chicago police officer charged in the 2014 fatal shooting of a black teenager says the officer and his family are receiving death threats.\nJason Van Dyke's attorney said Friday outside Cook County Court after a status hearing that Van Dyke has no formal protection but police are aware of the threats and are \"taking precautions.\"\nAttorney Dan Herbert also said he's \"probably\" going to ask for a change of venue, but not until after he has received all evidence from the state.\nVan Dyke has pleaded not guilty in the death of 17-year-old Laquan McDonald. He's accused of shooting McDonald 16 times.\nA video of the shooting released in November sparked numerous protests and calls for Emanuel's resignation.\n___\n9:45 a.m.\nA white Chicago police officer facing a first-degree murder charge in the fatal 2014 shooting of a black teenager will return to court in March.\nOfficer Jason Van Dyke appeared Friday morning in Cook County Court, where numerous pretrial issues were discussed. The judge set a March 23 date for the next hearing.\nVan Dyke has pleaded not guilty in the death of 17-year-old Laquan McDonald.\nCity officials released squad car video of the shooting in November, hours after Cook County authorities announced charges. The footage showed McDonald veering away from officers as Van Dyke opened fire and shot McDonald 16 times.\nThe video sparked numerous protests and calls for Emanuel's resignation. The federal Justice Department is investigating the Chicago Police Department's practices and policies.\n___\n7:50 a.m.\nChicago police will be getting more training as the city reforms how it responds to people with mental illness.\nMayor Rahm Emanuel office said Friday that officers and 911 dispatchers will receive enhanced training on interacting with people in crisis, particularly those with mental illness.\nChicago public health, fire, police and emergency officials will collect data about mental health incidents to help improve responses. The city also says it will work with mental health experts and community leaders to improve access to mental health services when individuals come into contact with first responders.\nThe announcement comes after Emanuel last month asked police and the agency that investigates police misconduct to review the training on officers' response to mental health crisis calls. He made the request after a double fatal police shooting.\n___\n6:05 a.m.\nA white Chicago police officer accused of shooting a black teenager 16 times in 2014 is due in court.\nJason Van Dyke is expected to appear before a judge Friday morning for a status hearing. He has pleaded not guilty to first-degree murder in the death of 17-year-old Laquan McDonald.\nCity officials released squad car video of the shooting in November, hours after Cook County authorities announced charges. The footage showed McDonald veering away from officers as Van Dyke opened fire.\nThe release of the video sparked citywide demonstrations with protesters alleging a cover-up and calling for the resignations of Mayor Rahm Emanuel and Cook County State's Attorney Anita Alvarez.","url":"https://www.dailymail.co.uk/wires/ap/article-3422844/The-Latest-More-mental-illness-training-Chicago-police.html"}
