{"authors":["Mike Flynn"],"date_download":"2018-10-30 20:53:07","date_modify":"2018-10-30 20:53:07","date_publish":"2014-12-16 13:41:52","description":"In many important respects, the Democrat party is no longer a national party. There are entire regions of the country without statewide elected Democrats. |","filename":"data/vaneerConsumption/TheLongDarkTeaTimeoftheDemocratSoul.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-TV/2012/10/08/ObamaClintonConcerned.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_12_16__1540932787.html","title":"The Long, Dark Tea-Time of the Democrat Soul","title_page":"The Long, Dark Tea-Time of the Democrat Soul | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In many important respects, the Democrat party is no longer a national party. There are entire regions of the country without statewide elected Democrats. The entire South, most of the industrial Midwest and much of the Mountain and Southwest have Republican governors. Democrat office holders are almost exclusively confined to urban areas, college towns and very wealthy suburbs.\nThat wasn’t predictable in 2008. When Barack Obama was elected President, many pundits declared the dawning of a permanent Democrat majority. Since that election, however, Democrats have lost 14 Senate seats and around 70 seats in the House of Representatives. Republicans hold 31 governorships and the most state legislative seats in almost 100 years. The Democrat losses are breathtaking and may take a generation to reverse.\nGrowing up in Illinois, one used to be able to tell the political make-up of a county by the color of the dirt. (Long story.) Across the nation today, a simple zip code will betray an area’s political representation. The Democrat party has simply lost a huge swath of the public.\nMany on the left have tried to dismiss the 2014 election results as some kind of aberration. Days before the votes were even counted, the New York Times published an editorial arguing that “midterm” elections ought to be scrapped, because they were somehow unrepresentative of the public as a whole.\nIt is certainly true that the electorate in the midterms is different than that in recent Presidential elections. This fact should fill Democrats with dread, rather than hope, for the next election. In short, the Democrats’ electoral fortunes are now tied to the most fickle, least engaged voters. To be assured of victory, Democrats must not only remind these voters that there is an election, but convince them that they should participate. This is not a stable foundation for a governing party.\nThe failure of the Democrat party to mobilize the voters it needed to win elections this November is extraordinary given the amount of resources and the sophistication of the technology underlying its campaigns. The Democrat candidate wasn’t outspent in many races In very few races this Fall. The party poured millions of dollars into a sophisticated ground game, far surpassing Republican efforts in most races. Yet, a great many of the more competitive races weren’t even close in the end.\nA Republican won the Maryland governor’s race by almost 10 points. That isn’t a quirk of turnout. That is an historic rejection by a significant number of voters who were in the habit of voting Democrat. Just two years before, Obama had carried the state by more than 25 points. One can’t extrapolate too much from a single state, but the result in Maryland ought to set off alarm bells at DNC headquarters.\nPart of the Democrat problem is that many of its fundamental messages are stale and outdated. Support for a higher minimum wage is almost universal, in large part because so few people are affected by it. The issue was relevant 40 years ago, but affects just a fraction of people today. People may support the “democrat position” on the issue, but it means almost nothing to their lives.\nGender pay equity was also an important issue when most of us were in diapers. Most of us are “for” it, but it has almost no practical application in our lives. Political engagement does not rest on hypothetical ambiguities. No one believes in “shovel-ready” infrastructure projects anymore.\nAnother problem is that the Democrats have no response to the growing anxiety felt by much of the public. The next president will need to have a coherent foreign policy. The public is more uneasy about world affairs than politicians in either party realize. It is even possible that the next election will turn significantly on foreign affairs. While neither party is fully prepared for this, the Democrat party seems particularly out of touch.\nA more fundamental challenge for the Democrats, though, is that the party has waged a unilateral cultural war against huge chunks of the populace. Democrats increasingly speak with only one voice and it is tone-deaf to many people.\nMost people accept that some abortions should be legal, but Democrats demand that all abortions should be allowed at any time and with little regulation. Most people accept gay marriage, but Democrats demand that people approve of it and applaud it. Most people just want to be left alone, but Democrats demand the right to reorganize our lives.\nNone of this is to suggest that now Republicans are on the verge of a permanent majority. The Republicans have a host of their own problems, but the Democrats are close to forfeiting the game. Last year, the Center for American Progress, a left-wing think tank, launched the “Bobby Kennedy” project, seeking to broaden the party’s appeal to white working class voters. The effort was abandoned because of a lack of funding and the realization that the party would have to alter some of its now sacrosanct positions. The party’s culture war, in other words, precluded it from reaching out to working class voters.\nThat is the wrong side of demographics.\nSingle people vote Democrat. Married people vote overwhelmingly Republican. People with children vote Republican. Democrats win voters with post-graduate degrees and those with no high-school education. Republicans win everyone else. Republicans win middle class voters and the affluent. Democrats win the poor and extremely wealthy. Whites vote Republican, increasingly overwhelmingly. Minorities vote overwhelmingly Democrat, but even with amnesty, there aren’t enough to balance out white voters. Young people vote Democrat, but as they age they become Republican.\nThis is not concern-trolling. As a libertarian-conservative I’m thrilled that the Democrat party is marginalizing itself. I’m ecstatic that the left is tearing itself apart between a politician from last century and a former Harvard professor turned Senator from Massachusetts.\nMay the Democrat party long double-down on identity politics and class warfare. May it forever cede foreign policy to the United Nations and international bureaucrats and turn a blind eye to the external threats growing around our nation. May the aging baby boomers take their fading memories of Woodstock and academic post-modernism and exit stage left. I do not wish to praise the Democrat party that was, but bury what it has become.","url":"https://www.breitbart.com/politics/2014/12/16/the-long-dark-tea-time-of-the-democrat-soul/"}
