{"authors":["Associated Press"],"date_download":"2018-10-23 03:44:26","date_modify":"2018-10-23 03:44:26","date_publish":"2017-03-10 13:29:11","description":"ATHENS, Greece (AP) - The Latest on migration issues in Europe (all times local):3:25 p.m.Germany's upper house of Parliament has rejected a new law that...","filename":"data/vaneerConsumption/TheLatestGermanupperhouserejectsmigrantlaw.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/13/wire-196207-1489152555-880_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301322_The-Latest-German-upper-house-rejects-migrant-law_1540266266.html","title":"The Latest: German upper house rejects migrant law","title_page":"The Latest: German upper house rejects migrant law | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ATHENS, Greece (AP) - The Latest on migration issues in Europe (all times local):\n3:25 p.m.\nGermany's upper house of Parliament has rejected a new law that would have made it easier to deport some migrants by declaring Algeria, Morocco and Tunisia \"safe countries of origin.\"\nFILE - In this Sept. 24, 2015 file photo a man carries a child to board a train at a station near the village of Zakany, Hungary. UNICEF, the United Nations' children's agency, says it is alarmed by the new Hungarian law allowing the detention of all asylum seekers, including unaccompanied children older than 14, in border camps made of shipping containers. (AP Photo/Petr David Josek, file)\nThe decision means the measure will now have to go to a committee for the lower house and upper house to try and negotiate a compromise proposal.\nGermany's top security official Interior Minister Thomas de Maiziere accused some of the states that make up the upper house of playing politics, and said the decision \"makes today a bad day for our efforts to stop illegal migration.\"\nHe said citizens of the three countries are almost never deserving of asylum, like refugees fleeing war, and it was \"absolutely counterproductive to send a signal of indecision instead of resolve.\"\n___\n12 p.m.\nGreece's supreme court has heard the appeals of two Syrian refugees against their planned deportation to Turkey, a case that could affect thousands trapped on Greece's islands under a year-old European Union deal with Turkey.\nThe two men, aged 21 and 29, reached Greece's eastern island of Lesbos in July 2016, four months after the agreement designed to stem uncontrolled migration flows came into effect.\nTheir bids for asylum in Greece were rejected.\nUnder the March 20 agreement, migrants should be returned to Turkey, which is deemed a safe country for refugees, unless they can convince authorities that they merit asylum in Greece instead. Rights groups have criticized the deal.\nThe supreme court in Athens on Friday heard arguments by lawyers. A new hearing is planned for next Friday.","url":"https://www.dailymail.co.uk/wires/ap/article-4301322/The-Latest-German-upper-house-rejects-migrant-law.html"}
