{"authors":["Associated Press"],"date_download":"2018-10-22 20:36:36","date_modify":"2018-10-22 20:36:36","date_publish":"2016-01-28 02:06:14","description":"MILWAUKEE (AP) — The Latest on a man accused of planning to attack a Masonic temple in Milwaukee (all times local): 7:40 p.m. The man accused of wanting to s...","filename":"data/vaneerConsumption/TheLatestManaccusedoftempleattackplotdeniedcharges.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:fe43c0bbdbc7428290dba67c9c65603d-2vdWmEltwXfba0ce28e6322a3e92-605_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419258_The-Latest-Man-accused-Masonic-plot-moved-new-jail_1540240596.html","title":"The Latest: Man accused of temple attack plot denied charges","title_page":"The Latest: Man accused of temple attack plot denied charges | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Man accused of temple attack plot denied charges\nMILWAUKEE (AP) — The Latest on a man accused of planning to attack a Masonic temple in Milwaukee (all times local):\n7:40 p.m.\nThe man accused of wanting to shoot up a Milwaukee Masonic event center in the name of Islam told a judge the charges are \"not true.\"\nSamy Mohamed Hamzeh is seen in an undated photo provided by the Waukesha County (Wis.) Sheriff¿s Department. Federal prosecutors charged 23-year-old Samy Mohamed Hamzeh on Tuesday, Jan. 26, 2016, with unlawfully possessing a machine gun and receiving and possessing firearms not registered to him. Federal agents said Tuesday that Mohamed Hamzeh wanted to storm a Masonic temple with a machine gun and kill at least 30 people in an attack he hoped would show \"nobody can play with Muslims\" and spark more mass shootings in the United States. (Waukesha County (Wis.) Sheriff¿s Department via AP)\nThe Milwaukee Journal Sentinel (http://bit.ly/1nzrmNT ) posted audio on its website that it obtained of Samy Mohamed Hamzeh's first court appearance on Tuesday.\nHamzeh told U.S. Magistrate Judge David Jones that he had read and understood the federal complaint filed against him, but said he doesn't agree with it.\nFederal defender Daniel Stiller said Wednesday that Craig Albee, from his office, would represent Hamzeh.\nHamzeh is due back in court Feb. 9. He is being held without bail.\n___\n2:45 p.m.\nA former co-worker of the Milwaukee man accused of plotting to attack a Masonic temple says the defendant is a \"stupid kid\" who smoked marijuana, didn't show up for work and was fired from at least two jobs.\nThirty-two-year-old Jawad Jawad worked with Samy Mohamed Hamzeh at two Milwaukee restaurants and says he's known Hamzeh for a couple of years.\nJawad said Wednesday that he never had an idea the 23-year-old Hamzeh could be capable of the alleged plot. Hamzeh is charged with unlawfully possessing a machine gun and receiving and possessing firearms not registered to him.\nFederal authorities have not said which temple was targeted. But a secretary for the Valley of Milwaukee, which includes four Masonic chapters, says the FBI told the fraternity that the temple in question is the Humphrey Scottish Rite Masonic Center in downtown Milwaukee.\n___\n12:55 p.m.\nWisconsin's top federal defender says the defense for a Milwaukee man accused of plotting to attack a Masonic temple will examine the conduct of FBI informants ahead of his arrest.\nDaniel Stiller says his office doesn't yet know anything about Samy Mohamed Hamzeh's case beyond a criminal complaint. Federal authorities arrested Hamzeh on Tuesday, saying he had plotted to attack a temple and had purchased machine guns from two undercover FBI employees.\nThe criminal complaint includes several statements allegedly made by Hamzeh in Arabic.\nStiller says the translations \"don't read like spoken words\" and the defense will likely focus on the accuracy and completeness of translation from Arabic. He also says they will look at what the FBI informant was \"contributing to the dialogue.\"\nDefense attorneys in similar sting cases in the past have accused investigators of effectively steering a suspect into plotting attacks they might not have done on their own.\n___\n12:05 p.m.\nA Masonic official in Milwaukee says he is surprised to hear of an alleged plot to attack a Masonic center.\nFederal authorities say 23-year-old Samy Mohamed Hamzeh of Milwaukee was planning the attack but was arrested after he bought machine guns from undercover FBI agents.\nGavin DeGrave is secretary for the Valley of Milwaukee, which includes four Masonic chapters and has its headquarters in the Humphrey Scottish Rite Masonic Center in downtown Milwaukee.\nDeGrave said he was surprised to read in a criminal complaint that Hamzeh seemed to blame Masons as the \"root of all the world's problems.\"\n\"We can hardly plan a pancake breakfast,\" DeGrave said Wednesday. He said a center may have been targeted because it was thought to be \"easy pickings.\"\n___\n8:20 a.m.\nA Milwaukee man accused of buying machine guns for an attack on a Masonic temple has been moved to another jail in southeastern Wisconsin.\nU.S. Marshals Service Supervisor Doug Bachert said Wednesday that Samy Mohamed Hamzeh was moved a day earlier from Waukesha County Jail to the Kenosha County Jail for logistical reasons. Both facilities contract with the U.S. Marshals Service in holding federal inmates.\nCourt documents say the FBI recorded conversations between the 23-year-old Hamzeh and two federal informants talking about a plot to attack a Masonic temple in Milwaukee. Prosecutors say Hamzeh wanted to travel to the Middle East and kill Israelis but abandoned that plan as unworkable.\nHamzeh is facing federal charges of unlawfully possessing a machine gun and receiving and possessing firearms not registered to him.\n___\n1:25 a.m.\nFederal agents say a Milwaukee man arrested on a charge of trying to buy machine guns to attack a Masonic temple also wanted to travel to the Middle East and kill Israelis but abandoned that as unworkable.\nFederal prosecutors charged 23-year-old Samy Mohamed Hamzeh on Tuesday with unlawfully possessing a machine gun and receiving and possessing firearms not registered to him.\nThe FBI recorded conversations between Hamzeh and two federal informants talking about an attack on a Masonic temple in Milwaukee. Authorities say he bought guns from informants and then was arrested.\nCourt documents allege Hamzeh also wanted to go to Israel and kill Israeli soldiers but decided to focus instead on a domestic target.","url":"https://www.dailymail.co.uk/wires/ap/article-3419258/The-Latest-Man-accused-Masonic-plot-moved-new-jail.html"}
