{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 22:46:05","date_modify":"2018-10-22 22:46:05","date_publish":"2017-03-10 01:30:58","description":"Directed by Chris Bouchard and Blake Harris, this independent feature puts another twist on Hans Christian Anderson's story of a mermaid who yearned to obtain an immortal soul.","filename":"data/vaneerConsumption/TheLittleMermaidtrailerreleased.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E1F3BBB00000578-0-image-a-42_1489109364170.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299700_Trailer-indie-film-Little-Mermaid-released_1540248365.html","title":"The Little Mermaid trailer released","title_page":"The Little Mermaid trailer released | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"There are, it seems, a glut of Little Mermaid movies in the works.\nWhile Disney has commissioned Lin-Manuel Miranda to write original songs for a possible do-over of their franchise and Universal and Working Title plan a live-action version scripted by Richard Curtis, a trailer for yet another incarnation of the classic fairytale was released Thursday.\nDirected by Chris Bouchard and Blake Harris, this independent feature puts another twist on Hans Christian Anderson's story of a mermaid who yearned to obtain an immortal soul.\nClassic tale: A trailer for indie film The Little Mermaid dropped Thursday, with yet another version of the Hans Christian Anderson fairtytale\nThe film centers around William Moseley, who starred as Peter in The Chronicles of Narnia and Prince Liam in The Royals, and his young sister played by Loreto Peralta.\nThe siblings travel to Mississippi in the 1800s after hearing of a mermaid that's part of a circus attraction there.\nThe trailer opens with Shirley MacLaine as an old woman telling a story to her young granddaughters who doubt the existence of mermaids.\nThe trailer opens with Shirley MacLaine as an old woman telling stories to her young granddaughters who doubt the existence of mermaids\nThe action flips to the 19th century and English actor William Moseley who plays a young newspaper reporter Cam assigned to investigate a circus's claim to have a real mermaid\nBig adventure: Cam heads off to Mississippi taking along with him his young sister Elle, played by Loreto Peralta\nThe clip shows Moseley as a newspaper reporter tasked by his editor to check out the mermaid attraction and he takes along his sister who is also anxious to see a mermaid in real life.\nWhen they arrive at the circus, there is indeed a beautiful dark-haired woman on show in a water tank.\nLater, the same young woman is seen meeting Peralta's character in the woods, with the youngster remarking on the fact she now has feet instead of a tail.\nAt the circus, they do indeed find a beautiful woman with a fish tail on display in a large tank\nThe mermaid, played by Poppy Drayton, is then seen walking in the woods where she meets Elle who remarks on the fact that she has feet instead of a tail\nThe mysterious beauty tells the little girl not to divulge her secret\nThe ringmaster turns out to have some kind of supernatural powers and keeps the mermaid's soul in a vial as a means of keeping her in his charge.\nMoseley's character endeavors to help her escape to a better life.\nThe mermaid is played by Poppy Drayton, star of TV's The Shannara Chronicles.\nThe film is slated for a release at some future date in 2017.\nThe circus ringmaster claims to have the mermaid's soul contained within a vial and by which he maintains control over her","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299700/Trailer-indie-film-Little-Mermaid-released.html"}
