{"authors":["Associated Press"],"date_download":"2018-10-22 20:44:24","date_modify":"2018-10-22 20:44:24","date_publish":"2016-01-28 03:28:36","description":"WASHINGTON (AP) — Here are the latest developments from the 2016 race for president, less than a week out from the Iowa caucuses. All times local. 9:40 p.m. ...","filename":"data/vaneerConsumption/TheLatestSuperPACsoffer15MforCruzTrumpdebate.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:38aefb33624a4afcad33d07901ff81a6-2vdWmEltwXfba0ce28e632349eb1-367_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419110_The-Latest-Trump-campaign-defends-choice-boycott-debate_1540241064.html","title":"The Latest: Super PACs offer $1.5M for Cruz-Trump debate","title_page":"The Latest: Super PACs offer $1.5M for Cruz-Trump debate | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Super PACs offer $1.5M for Cruz-Trump debate\nWASHINGTON (AP) — Here are the latest developments from the 2016 race for president, less than a week out from the Iowa caucuses. All times local.\n9:40 p.m.\nTwo super PACs supporting Sen. Ted Cruz's presidential campaign are offering to donate $1.5 million to charities that help veterans if Donald Trump will debate Cruz head-to-head before the Iowa caucuses.\nRepublican presidential candidate Donald Trump speaks during a campaign stop on Wednesday, Jan. 27, 2016, in Gilbert, S.C. (AP Photo/Rainier Ehrhardt)\nThe political action committees, Keep the Promise I and II, are proposing a one-hour debate to be held in Iowa on or before Jan. 31, the day before the caucuses, with a moderator chosen by the candidates.\nCruz himself sent a letter to Trump Wednesday inviting him to debate in Sioux City, Iowa, on Saturday night. The Cruz campaign suggested conservative radio hosts Mark Levin, Sean Hannity and Rush Limbaugh as possible moderators.\nTrump dismissed Cruz's proposal earlier Wednesday. He is skipping Thursday's night's GOP debate amid a feud with debate host Fox News Channel.\n___\n9:25 p.m.\nBernie Sanders' campaign says it's willing to go along with Hillary Clinton and ask the Democratic National Committee to add another presidential debate before the New Hampshire primary. But there's a catch.\nSanders' campaign is requesting three additional debates in exchange for the proposed New Hampshire debate Feb. 4. The campaign wants one each in March, April and May and it doesn't want any debates to be held on a Friday, Saturday or holiday weekend. Sanders' campaign wants all three Democratic candidates to be invited.\nClinton said in a phone interview with MSNBC earlier Wednesday that she was \"anxious\" for another debate, adding, \"Let's try to make it happen.\"\nSanders' campaign has been resistant to the Feb. 4 proposal because the DNC hasn't sanctioned the debate.\nThe DNC has said it's sticking with its debate schedule. Former Maryland Gov. Martin O'Malley supports adding another debate.\n__\n9:15 p.m.\nBernie Sanders is taking a jab at Hillary Clinton, pointing out to his supporters that she is raising money at a Philadelphia investment firm on Wednesday night instead of campaigning in Iowa. He says, \"Frankly, I would rather be here with you.\"\nClinton's campaign responds that the former secretary of state also met with nearly 50 black ministers during her stop in Philadelphia \"to discuss the issues important to the African-American community.\" She held an event in Adel, Iowa, earlier in the day.\nClinton flew from Iowa to Pennsylvania on Wednesday to attend a fundraiser at the firm of Franklin Square Capital Partners. The event featured a performance by rocker Jon Bon Jovi.\nSanders was speaking to about 1,100 people in Mason City with five days remaining before the leadoff Iowa caucuses. He was introduced by actress Susan Sarandon, who said issues were more important than gender. She also took a swipe at Clinton, saying, \"It's one thing to be for gay rights and marriage when everyone else is for it.\"\n__\n8:50 p.m.\nNew Jersey Gov. Chris Christie says Donald Trump's decision to skip Thursday night's GOP debate reminds him of \"a 13-year-old arguing.\"\nThe Republican presidential candidate says he didn't \"whine and moan\" when he was booted from the mainstage ahead of one debate, but \"acted like a leader.\"\nChristie says the next president should not be \"a person that when one thing goes sideways, when one thing seems not fair, they're just going to walk away and take their marbles and go away.\"\nChristie was holding a town hall event at a bar in Dubuque with five days left to the Iowa caucuses.\nHe is hoping to beat expectations in the state to build momentum heading into the friendlier state of New Hampshire.\n__\n8:35 p.m.\nTexas Sen. Ted Cruz is blasting Republican rival Donald Trump for a second night in a row over his decision to skip Thursday's presidential debate and again challenging him to a one-on-one contest.\nCruz on Wednesday challenged Trump to debate him Saturday night in Sioux City, Iowa.\nCruz says if he and Trump can't agree on a moderator for a debate, they should take questions directly from Iowans.\nCruz told gathered supporters that \"it's not really that Donald is afraid of me. He's afraid of you. He doesn't want to answer questions from the men and women of Iowa about how his record doesn't match what he's selling.\"\nTrump earlier Wednesday laughed off Cruz's call to debate, saying in a message on Twitter that if they did it the contest should be held in Canada. where Cruz was born.\n___\n8:25 p.m.\nRepublican presidential candidate Donald Trump is defending his decision to skip Thursday's Fox News debate, saying he was \"not treated well\" by the network.\nTrump said in a Wednesday interview on Fox that he doesn't mind debating, but \"I just don't like being used.\"\nHe says television networks have made millions of dollars in advertising on debates he's participated in.\nTrump disputed the notion that he is hurting his candidacy by not being on the debate stage. He says Republicans already have had debates and \"at some point you've got to start doing other things.\"\nTrump plans to instead headline a rally in Des Moines, Iowa, raising money for military veterans. He says the event will be \"tremendous.\"\n___\n8:15 p.m.\nRepublican presidential front-runner Donald Trump told a campaign rally in South Carolina that he has \"not been treated fairly.\"\nBut he didn't get into details about his decision to skip Thursday's GOP debate amid an ongoing dispute with host network Fox News.\nTrump is the only GOP contender who has left Iowa and New Hampshire this week to campaign in South Carolina.\nThe lead-off Iowa caucuses are Monday, followed by New Hampshire's primary Feb. 9 and South Carolina's Feb. 20.\nTrump reminded the hundreds of supporters gathered a farm Wednesday night outside Columbia that he'll return to Iowa on Thursday to host a fundraiser for veterans groups.\nIt will be held at the same time as the debate just two miles away.\n___\n7:30 p.m.\nFlorida Sen. Marco Rubio is calling billionaire Donald Trump's decision to skip Thursday night's Republican debate, and Texas Sen. Ted Cruz's subsequent one-on-one challenge an \"interesting sideshow.\"\nBut he told an audience of mostly young people and families with children at a West Des Moines sports bar Wednesday evening that \"this is serious. We cannot lose this election.\"\nRubio is trying to refocus the discussion in the intensifying race ahead of Monday's Iowa caucuses, with jabs at the two rivals seen to be vying for first place.\nHe spoke to the gathering of about 400 supporters after a day spent largely cooped up in his hotel preparing for Thursday's debate.\nThe debate preparation Thursday marks a detour from what has been a torrid pre-caucus tromp through the state.\nHe'll resume a bus tour Friday and plans to fly around the state for appearances Saturday and Sunday.\n___\n7:10 p.m.\nBernie Sanders says he has no intention of going negative on Democratic rival Hillary Clinton even as the two remain in an increasingly tight race just days head of the first-in-the-nation Iowa caucuses.\nSanders was on Capitol Hill Wednesday after a meeting with President Barack Obama earlier in the day. He told reporters he has \"never run a negative ad\" in his life and will not do so against Clinton.\nHe says he's proud of running a positive campaign.\nSanders also was asked about GOP front-runner Donald Trump's decision to skip Thursday night's Republican debate on Fox News, but did not respond as he walked away from reporters.\n___\n6:15 p.m.\nDonald Trump's campaign has formally announced plans to host a special event at the same time as Thursday's presidential debate.\nThe move follows the Republican front-runner's promise to boycott the Fox News debate. He's been upset with Fox over what he calls unfair treatment from debate moderator Megyn Kelly and a sarcastic tweet from the network.\nThe campaign issued an advisory Wednesday night with details for what it's calling a special event.\nJust as the prime-time debate begins Thursday at 9 p.m. EST, Trump is scheduled to appear at Drake University in Des Moines at an event the campaign says will benefit veterans.\nThe appearance will be just two miles from where his Republican rivals gather for the debate.\n___\n6 p.m.\nAides to Donald Trump say South Carolina Lt. Gov. Henry McMaster will introduce and endorse the billionaire businessman at a Wednesday rally outside Columbia.\nMcMaster's nod gives Trump the backing of a longtime South Carolina politician widely viewed as an establishment Republican.\nHe previously served as state GOP chairman and has been an ally of Sen. Lindsey Graham — a failed 2016 White House hopeful and fierce Trump critic.\nPolls conducted by Fox News and Winthrop University in early December showed Trump with a strong lead in the first Southern primary state.\n___\n4:20 p.m.\nBernie Sanders says he and President Barack Obama talked foreign policy, the economy and \"a little bit of politics,\" during their first extended sit-down since the Vermont senator's presidential campaign jolted the race for the Democratic nomination.\nSanders spoke to reporters in the White House driveway after the 45-minute meeting Wednesday.\nThe White House said the president considered the 45-minute meeting a chance to discuss ways the two could work together, to reminisce about the thrill of campaigning in Iowa and to talk broadly about the state of the 2016 race.\nThe long-discussed meeting between Obama and his sometime critic was a moment for the president to display public neutrality in the heated and unexpectedly tight primary race to replace him. And rebut suggestions he's in the can for Sanders' rival Hillary Clinton.\nSanders says the president has been \"even handed\" in his treatment of the candidates.\n___\n4 p.m.\nSenate Democratic leader Harry Reid and Republican counterpart Mitch McConnell aren't in Iowa or New Hampshire, but can't avoid questions about the presidential race.\nThe two leaders gave lighthearted responses Wednesday when asked by Capitol Hill reporters to discuss the campaigns.\nReid joked that he's \"kind of pulling for Donald Trump,\" while McConnell avoided discussion of the White House contest altogether. McConnell said he wouldn't start talking about it because \"there'd be no place to end the discussion.\"\nWhen asked if the Senate GOP could work with a President Trump, McConnell answered \"good try,\" adding that they're \"anxious to have a Republican president but not at all sure who that's going to be yet.\"\nReid told reporters he's \"watching with pleasure the Republicans fumbling around,\" but later stood on the Senate floor and proclaimed in a more serious tone that \"the danger of a Donald Trump candidacy to our country is not a joke.\"\n___\n3:15 p.m.\nRepublican presidential candidate Mike Huckabee's campaign released a parody video based off singer Adele's 2015 hit song \"Hello\" ahead of Iowa's Feb. 1 leadoff caucus.\nHuckabee's campaign released a 3.5 minute online video Wednesday entitled \"Hello, Huck,\" with satirical lyrics sung over the Adele's hit, with direct jabs to Democratic contenders Hillary Clinton and Bernie Sanders. He doesn't mention any of his GOP rivals by name.\n\"Iowans are not for sale,\" the song says. \"They're stubborn and picky. There's just no difference between Obama and Hillary.\"\n\"Hello from caucus night. If Bernie wins I'm gonna die. This crazy circus, it's gone coo-coo-ca-choo, and Huckabee is the guy who's long overdue.\"\nHuckabee, who is lagging in the polls behind others in the crowded GOP field, previous ran for president in 2008. He won the Iowa caucus that year, but did not win his party's nomination.\n___\n1:40 p.m.\nAn Iowa man has been arrested on charges that he threw tomatoes at Republican presidential candidate Donald Trump during a campaign stop at the University of Iowa.\nHayley Bruce, a University of Iowa spokeswoman, says 28-year-old Andrew Joseph Alemao was charged Tuesday with disorderly conduct after officers say they saw him throwing two tomatoes toward Trump during a speech. It wasn't clear whether the tomatoes hit anyone.\nSecret Service and University of Iowa police officers arrested Alemao, and he was booked into the Johnson County Jail.\nJohnson County Jail officials say Alemao was released Wednesday morning without bond.\n___\n1:00 p.m.\nHillary Clinton says she wants the Democratic National Committee to add another presidential debate before the New Hampshire primary and urging Bernie Sanders to join her on stage.\nClinton says in a phone interview with MSNBC that she's \"anxious\" for another debate, adding, \"let's try to make it happen.\" She says she wants DNC chair Debbie Wasserman Schultz and the other campaigns to support another debate.\nSanders' campaign has said it has no plans to do so because the DNC hasn't sanctioned the debate. The Vermont senator's campaign has said it wouldn't want to jeopardize its participation in two debates planned for after the New Hampshire primary in Wisconsin and Florida.\nThe DNC has said it's sticking with its debate schedule.\nFormer Maryland Gov. Martin O'Malley supports adding another debate.\n___\n12:25 p.m.\nSnow is being forecast in Iowa for early next week, but people gathering for the presidential caucuses likely won't be hindered.\nMindy Beerends, a National Weather Service meteorologist in Des Moines, says there could be rain and a little snow during the caucuses, set to begin at 7 p.m. Monday, but early projections show no accumulating snow until early Tuesday.\nWeather is always an unpredictable factor of the caucuses, which typically draw hundreds of thousands of Iowans to precinct gatherings to choose presidential candidates and conduct political party business.\nThe bigger problem could be for the many campaign staffers and reporters in Iowa who want to leave after the caucuses. They could find their exit complicated by steadier snow Tuesday.\n___\n12:00 p.m.\nPresident Barack Obama will welcome Bernie Sanders to the White House Wednesday with days to go until the presidential hopeful takes on Hillary Clinton for the Democratic nomination in the Iowa caucus.\nSanders and his wife arrived to the White House earlier Wednesday ahead of the scheduled meeting with the president.\nThe long-discussed meeting between the sitting president and his sometime critic is a moment for the president to display public neutrality in the heated and unexpectedly tight primary race to replace him — refuting suggestions that he's in the can for Clinton.\nFor Sanders, it's a chance to show he's got some sway with a president still popular among Democrats.\nThe president this week rebuffed suggestions that Sanders' upstart campaign is a reboot of his own battle against Clinton in 2008.\n___\n10:00 a.m.\nRepublican presidential contender John Kasich is turning his attention to Iowa after a flurry of activity has signaled he may be headed toward the top-tier victory he seeks in New Hampshire.\nThe Ohio governor has planned town hall meetings in Davenport Wednesday and in Cedar Rapids Friday. He will also participate in the Republican presidential debate Thursday, which is in Des Moines.\nThe Iowa caucuses are scheduled for Feb. 1.\nKasich has focused most of his early attention on New Hampshire, where he's competing for votes from GOP moderates and independents against candidates including New Jersey Gov. Chris Christie, former Florida Gov. Jeb Bush and Sen. Marco Rubio.\nKasich landed endorsements in that contest from the Concord Monitor and the Boston Globe and some polling placed him second among New Hampshire voters behind Donald Trump.\n___\n8:45 a.m.\nTed Cruz is mocking Donald Trump's decision to skip Thursday's Fox News Republican presidential debate, taunting him on Twitter and creating an image of his face on the illustrated body of Disney tycoon Scrooge McDuck, sitting on top of bags of money.\nCruz on Tuesday responded to Trump's decision to skip the debate in Des Moines by challenging him to a one-on-one debate, \"mano-a-mano.\" Cruz is following that up on Wednesday with a satirical message on Twitter, linking to a clip of the song \"Brave Sir Robin Ran Away\" from a film by the British comedy troupe Monty Python.\nCruz created an online petition showing a mock-up of Trump with the Disney character's body, sitting on bags of money, on top of a mountain of gold coins, encouraging supporters to \"Tell Ducking Donald: Debate Ted Cruz.\"\n___\n7:20 a.m.\nDonald Trump's presidential campaign manager Corey Lewandowski is accusing Fox News anchorwoman Megyn Kelly of being \"completely obsessed\" with his candidate, and says most people tuned in to the first FOX News Republican debate because Trump was on stage.\nHis comments to ABC's Good Morning America Wednesday follow a statement by Trump a day earlier that he would not participate in the upcoming FOX News GOP debate, scheduled for Thursday.\nThe feud between Trump and Kelly began during the first FOX News debate in August, when Kelly asked the candidate if previous, disparaging comments he has made against women reflect the temperament of a president.\nOn Tuesday, Trump called Kelly a \"lightweight reporter.\"\nLewandowski said Wednesday that Trump will instead spend his time with wounded veterans in Des Moines, Iowa. The state hosts the country's lead-off presidential contest on Feb. 1.\nRepublican presidential candidate Sen. Marco Rubio, R-Fla., speaks at Wellman's Pub & Rooftop in West Des Moines, Iowa, Wednesday, Jan. 27, 2016. (AP Photo/Andrew Harnik)","url":"https://www.dailymail.co.uk/wires/ap/article-3419110/The-Latest-Trump-campaign-defends-choice-boycott-debate.html"}
