{"authors":["Associated Press"],"date_download":"2018-10-22 23:42:23","date_modify":"2018-10-22 23:42:23","date_publish":"2017-03-16 07:44:16","description":"TOKYO (AP) - The Latest on Secretary of State Rex Tillerson's Asian tour (all times local):6.48 p.mA North Korean diplomat in China says Pyongyang must act...","filename":"data/vaneerConsumption/TheLatestNKoreandiplomatblamesUSforrisingtension.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/10/wire-227613-1489658406-426_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319162_The-Latest-Tillerson-calls-NKorea-quit-nuke-program_1540251743.html","title":"The Latest: NKorean diplomat blames US for rising tension","title_page":"The Latest: NKorean diplomat blames US for rising tension | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TOKYO (AP) - The Latest on Secretary of State Rex Tillerson's Asian tour (all times local):\n6.48 p.m\nA North Korean diplomat in China says Pyongyang must act in self-defense against the U.S. and South Korea's joint military drills, which he said have brought the region to the brink of nuclear war.\nU.S. Secretary of State Rex Tillerson, left, and Japanese counterpart Fumio Kishida, right, shake hands prior to their bilateral meeting at the Foreign Ministry's Iikura Guesthouse in Tokyo, Thursday, March 16, 2017. Tillerson is in Tokyo for the first leg of the trip to Asia, which is occurring amid escalating tensions with North Korea.(AP Photo/Eugene Hoshiko)\nMinister Pak Myong-ho (Bahk My-ung Ho') has told reporters in a rare briefing at the North Korean Embassy in Beijing Thursday that the joint exercises are aimed at carrying out pre-emptive strikes against North Korea.\nPak says the drills were the reason the North had to take \"extremely tough measures\" to guard itself against such joint exercises that could \"evolve into actual combat.\"\nTensions have escalated over North Korean moves to accelerate its weapons development.\nTop U.S. diplomat Rex Tillerson said Thursday the isolated nation \"need not fear\" the United States.\n____\n5.50 p.m.\nU.S. Secretary of State Rex Tillerson says he is \"willingly\" taking on the challenge of a sharp cut in funding for the State Department.\nThe White House is unveiling a federal government budget Thursday in Washington. The department and the U.S. Agency for International Development are among the hardest-hit agencies, with funding reduced by 28 percent, or $10 billion.\nTillerson said the current level of spending is \"not unsustainable.\" He said the cut reflects expectations the U.S. will be involved in fewer military conflicts and its aid programs can become more effective and attract resources from other countries.\nHe expressed confidence that the department can become more efficient and \"do a lot with fewer dollars.\"\nTillerson was speaking in Tokyo, at the start of a three-nation tour of North Asia.\n____\n4:30 p.m.\nU.S. Secretary of State Rex Tillerson has called on North Korea to abandon its nuclear and ballistic missile programs, saying the isolated nation \"need not fear\" the United States.\nTillerson made that declaration after meeting his Japanese counterpart Thursday in Tokyo, where they discussed possible new approaches in dealing with the isolated nation.\nTillerson said that 20 years of U.S. diplomatic and other efforts to get North Korea to denuclearize have failed, but gave no specifics about how the Trump administration, which is currently doing a policy review, would tackle the issue.\nTillerson is making his first trip to Asia as the top U.S. diplomat.\nBoth Tillerson and Japanese Foreign Minister Fumio Kishida urged China to push Pyongyang to change.\n___\n2:49 p.m.\nU.S. Secretary of State Rex Tillerson says cooperation with allies Japan and South Korea is \"critical\" to addressing the threat from North Korea's nuclear and missile programs.\nTillerson was speaking as he met with Japanese Foreign Minister Fumio Kishida on his first trip to Asia as the top U.S. diplomat.\nNorth Korea is expected to top the agenda at Tillerson's talks in Tokyo. Last week, North Korea test-fired four missiles that landed in ocean off Japan.\nTillerson will also meet with Japanese Prime Minister Shinzo Abe.\nJapan and South Korea both host tens of thousands of U.S. troops. Washington has been urging the two nations to step security cooperation despite their historically strained relations. This week, the nations' three navies have conducted missile defense information-sharing drills in the region","url":"https://www.dailymail.co.uk/wires/ap/article-4319162/The-Latest-Tillerson-calls-NKorea-quit-nuke-program.html"}
