{"authors":["Associated Press"],"date_download":"2018-10-22 23:40:07","date_modify":"2018-10-22 23:40:07","date_publish":"2016-01-28 12:52:57","description":"MELBOURNE, Australia (AP) — The Latest from the Australian Open on Thursday (all times local): 11:20 p.m. Angelique Kerber knows she faces a daunting task tr...","filename":"data/vaneerConsumption/TheLatestAngeliqueKerberwaitsforSteffiGrafsadvice.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:f7dc1be65fe84c77a0996d96ce88bda6-2vdWmEltwXfba0ce28e6328c6c94-924_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420891_The-Latest-Angelique-Kerber-waits-Steffi-Grafs-advice_1540251607.html","title":"The Latest: Angelique Kerber waits for Steffi Graf's advice","title_page":"The Latest: Angelique Kerber waits for Steffi Graf's advice | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Angelique Kerber waits for Steffi Graf's advice\nMELBOURNE, Australia (AP) — The Latest from the Australian Open on Thursday (all times local):\n11:20 p.m.\nAngelique Kerber knows she faces a daunting task trying to beat 21-time major champion Serena Williams in her first Grand Slam final on Saturday.\nAngelique Kerber of Germany celebrates after defeating Johanna Konta of Britain in their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Vincent Thian)\nSo she's reaching out to someone who might be able to help — Steffi Graf, who leads Williams by one major title on the all-time list and was the last German to win the Australian Open in 1994.\nAsked after she beat Johanna Konta in the semifinals if she would seek out Graf's advice, Kerber laughed and said, \"Steffi, write me please.\"\nKerber actually hit with Graf last year in Las Vegas where Graf lives with her husband, four-time Australian Open champion Andre Agassi. Kerber said Graf \"is still in shape and she is hitting very hard and moving still like she was moving a few years ago.\"\nShe promised to do her best to prevent Williams from matching Graf's 22 Grand Slam titles, saying \"the Germans must be together.\"\n___\n10 p.m.\nFive-time champion Novak Djokovic has beaten four-time winner Roger Federer 6-1, 6-2, 3-6, 6-3 in the semifinals to advance to his 6th Australian Open final.\nThe top-ranked and defending champion Djokovic is bidding to win his sixth Australian Open, and to continue a run that earned him three of the four Grand Slam trophies in 2015.\nThis was the 45th meeting between Djokovic and Federer, and the outcome now gives the 28-year-old Serbian an edge of 23-22.\nDjokovic faces either No. 2 Andy Murray or No. 13 Milos Raonic in the final.\n____\n9:25 p.m.\nRoger Federer has come back to win the third set against Novak Djokovic 6-3 in their semifinal at Melbourne Park.\nWith Djokovic leading by two sets and serving at 2-3, Federer finally got his first break points of the match. The top-seeded Djokovic saved the first three break points he faced, but Federer converted on the fourth.\nThe crowd at Rod Laver Arena leapt to its feet and roared when the Swiss great coverted for a 4-2 lead.\nFederer had 18 winners in the set, to just eight for Djokovic.\nFederer still has his work cut out for him — he has never come back from two sets down against Djokovic to win a five-set match.\n___\n8:35 p.m.\nNovak Djokovic has won the second set 6-2 of his semifinal against Roger Federer after taking the first 6-1.\nThe No. 3-ranked Federer saved a break point in the first game and held serve, as the crowd roared trying to pull the Swiss star back into the match.\nBut the top-ranked Djokovic then raced to 5-1 lead and after Federer held serve to make the score 5-2, Djokovic served out the last game without dropping a point.\nDjokovic won the second set in 32 minutes.\n___\n8:05 p.m.\nNovak Djokovic has easily won the first set 6-1 in his semifinal against Roger Federer on Rod Laver Arena.\nThe top-ranked and defending champion Djokovic started strongly, holding his opening service game to love, then breaking No. 3-ranked Federer's service in the second game to take a 2-0 lead after four minutes. He won the first set in 22 minutes.\nThis is the 45th time the players have met, and they've each won 22 times.\n___\n7 p.m.\nDefending mixed doubles champions Martina Hingis and Leander Paes are out of the Australian Open in the quarterfinals, beaten 7-6 (1), 6-3 by the top-seeded team of Sania Mirza of India and Croatia's Ivan Dodig.\nMirza found herself on the opposite side of the net from Hingis, her partner on Friday in the women's doubles final. They'll play the seventh-seeded team of Andrea Hlavackova and Lucie Hradecka of the Czech Republic.\nDodig and Mirza will play Elena Vesnina of Russia and Bruno Soares of Brazil in the semifinals. The mixed doubles final is scheduled for Sunday.\nSoares will partner Jamie Murray in Saturday's men's doubles final against Daniel Nestor and Radek Stepanek.\n___\n4:40 p.m.\nSeventh-seeded Angelique Kerber has ended the strong run of Johanna Konta at Melbourne Park, beating the British player 7-5, 6-2 in the semifinals.Kerber, who has advanced to her first Grand Slam singles final, broke Konta's serve to open the second set and again in the fifth game to take a 4-1 lead.\nShe clinched the match in 1 hour, 22 minutes on her serve when Konta's backhand went long — her 22nd unforced error of the set.\nThe Sydney-born Konta was the first British woman to advance to a Grand Slam singles semifinal since Jo Durie at the 1983 U.S. Open.\nKerber will play Serena Williams in the final on Saturday. Williams, who will be seeking her seventh Australian title and 22nd major, beat Agnieszka Radwanska 6-0, 6-4 in the earlier semifinal.\n__\n4:10 p.m.\nAngelique Kerber has won the first set 7-5 in her Australian Open semifinal against Johanna Konta.\nNo. 7-seeded Kerber led 3-0 before Konta went on a four-game roll to get back into the set. Kerber broke Konta's serve in the 11th game, and held in the next to take the set in 49 minutes.\nThere was a brief delay when rain showers hit the court with the roof open before the 12th game. Ball boys and girls used towels to dry up a few water spots, and play resumed to allow Kerber to serve and take the set.\nThe winner will play Serena Williams in Saturday night's final.\n____\n2:50 p.m.\nSix-time champion Serena Williams has beaten Agnieszka Radwanska 6-0, 6-4 to advance to her seventh Australian Open final.\nWith the roof closed on Rod Laver Arena because of rain showers in the area, Williams broke Radwanska's service to open the match and was rarely troubled in the 21-minute first set.\nThe No. 4-ranked Radwanska broke Williams' serve to level the second set at 3-3, but Williams broke Radwanska's serve in the ninth game and closed with three aces and a forehand winner to win the match in 1 hour, 4 minutes.\nBritain's Johanna Konta plays Angelique Kerber in the second semifinal, with the winner facing Williams in Saturday night's championship match.\n___\n2:10 p.m.\nSix-time champion Serena Williams has taken the first set 6-0 in her Australian Open singles semifinal against Agnieszka Radwanska.\nWith the roof closed on Rod Laver Arena because of rain showers in the area, Williams broke Radwanska's service to open the match and was rarely troubled in the 21-minute set.\nThe No. 4-ranked Radwanska had just one winner in the opening set — a forehand cross-court shot in the fourth game. Williams had 18 winners in the first set.\n___\n12:35 p.m.\nJamie Murray and Brazil's Bruno Soares are through to the men's doubles final at the Australian Open after a 6-3, 6-1 win over the French team of Adrian Mannarino and Lucas Pouille.\nMurray and Soares will play the winners of a later semifinal Thursday between Daniel Nestor and Radek Stepanek and Pablo Cuevas and Marcel Granollers in Saturday's final.\nJamie Murray and his brother Andy are two of three British players in the later stages of this year's tournament.\nAustralian-born Johanna Konta, who now has British citizenship, plays a women's semifinal against Angelique Kerber on Rod Laver Arena after defending champion Serena Williams takes on Agnieszka Radwanska.\nAndy Murray will play a men's singles semifinal on Friday against Milos Raonic.\n___\n12:05 p.m.\nPlay is under way at the Australian Open on Thursday, with a men's doubles match involving Andy Murray's older brother Jamie providing a prelude to the women's singles semifinals.\nJamie Murray and Brazil's Bruno Soares are taking on the French team of Adrian Mannarino and Lucas Pouille in a semifinal on Rod Laver Arena.\nFollowing that, defending champion Serena Williams will attempt to stay in the hunt for a seventh singles title when she plays Agnieszka Radwanska. Another British player, Johanna Konta, is in the other semifinal against Angelique Kerber.\nThe first men's semifinal between defending champion Novak Djokovic and Roger Federer is scheduled later Thursday. It will be their 45th meeting, and the series is tied at 22.\nAndy Murray plays his semifinal on Friday against Milos Raonic.\nNovak Djokovic of Serbia plays a backhand return to Roger Federer of Switzerland during their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Aaron Favila)\nRoger Federer of Switzerland wipes the sweat from his face during his semifinal match against Novak Djokovic of Serbia at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Andrew Brownbill)\nNovak Djokovic of Serbia plays a backhand return to Roger Federer of Switzerland during their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Vincent Thian)\nMartina Hingis, right, of Switzerland and Sania Mirza of India wave as they celebrate after defeating Julia Goerges of Germany and Karolina Pliskova of the Czech Republic in their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Wednesday, Jan. 27, 2016.((AP Photo/Rafiq Maqbool)\nAngelique Kerber of Germany celebrates after defeating Johanna Konta of Britain in their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Vincent Thian)\nSerena Williams of the United States waits to receive a serve from Agnieszka Radwanska of Poland during their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Rafiq Maqbool)","url":"https://www.dailymail.co.uk/wires/ap/article-3420891/The-Latest-Angelique-Kerber-waits-Steffi-Grafs-advice.html"}
