{"authors":["Associated Press"],"date_download":"2018-10-23 04:33:04","date_modify":"2018-10-23 04:33:04","date_publish":"2017-03-16 15:49:16","description":"NEW YORK (AP) - The Latest on prosecutors' announcement that state and federal investigations of Mayor Bill de Blasio's fundraising will not result in...","filename":"data/vaneerConsumption/TheLatestNYCityHallsaysitwasconfidentamidprobes.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/15/wire-229343-1489679690-113_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320760_The-Latest-NY-City-Hall-says-confident-amid-probes_1540269184.html","title":"The Latest: NY City Hall says it was 'confident' amid probes","title_page":"The Latest: NY City Hall says it was 'confident' amid probes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW YORK (AP) - The Latest on prosecutors' announcement that state and federal investigations of Mayor Bill de Blasio's fundraising will not result in criminal charges against him or others acting on his behalf (all times local):\n11:45 a.m.\nA New York City Hall spokesman says it has always \"been confident\" that the actions of Democratic Mayor Bill de Blasio and his administration are \"within the law.\"\nFILE - In this Jan. 30, 2017 file photo, New York City Mayor Bill de Blasio testifies during a joint legislative budget hearing on local government in Albany, N.Y. On Thursday, March 16, prosecutors say state and federal probes of de Blasio's fundraising will not result in criminal charges for the mayor or others acting on his behalf. Manhattan District Attorney Cyrus Vance said the facts were insufficient to successfully argue a provable violation of election laws. But he said the actions appear to be \"contrary to the intent and spirit of the law.\" (AP Photo/Hans Pennink)\nProsecutors said Thursday that state and federal probes of de Blasio's fundraising will not result in criminal charges for the mayor or others acting on his behalf.\nCity Hall press secretary Eric Phillips said in a statement that New Yorkers \"deserve honest, progressive government\" and \"will always get it\" while de Blasio is mayor.\n___\n10:20 a.m.\nProsecutors say state and federal probes of New York City Mayor Bill de Blasio's fundraising will not result in criminal charges for the mayor or others acting on his behalf.\nManhattan District Attorney Cyrus Vance said the facts were insufficient to successfully argue a provable violation of election laws. But he said the actions appear to be \"contrary to the intent and spirit of the law.\"\nActing U.S. Attorney Joon Kim announced no charges against Mayor Bill de Blasio or others acting on his behalf.\nKim and Vance made the announcements Thursday.\nKim said federal prosecutors and the FBI had been investigating fundraising by and on behalf of the Democratic mayor for his 2013 election campaign and the 2014 state Senate effort.","url":"https://www.dailymail.co.uk/wires/ap/article-4320760/The-Latest-NY-City-Hall-says-confident-amid-probes.html"}
