{"authors":["Alex Kritselis"],"date_download":"2018-10-30 23:24:27","date_modify":"2018-10-30 23:24:27","date_publish":"2014-08-13 18:55:37","description":"Premium network HBO has renewed freshman drama series The Leftovers for Season 2, Deadline reports on Wednesday. Based on a novel by best-selling author Tom Perrotta, The Leftovers, which stars Jennifer Anniston's handsome fiancé, Justin Theroux…","filename":"data/vaneerConsumption/TheLeftoversRenewedforSeason2ButTheShowNeedstoMakeThese3Changes.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/b99de9ee-09b5-49a3-bef3-fe03525c65af.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35634-the-leftovers-renewed-for-season-2-but-the-show-needs-to-make-these-3-changes_1540941867.html","title":"'The Leftovers' Renewed for Season 2 But The Show Needs to Make These 3 Changes","title_page":"'The Leftovers' Renewed for Season 2 But The Show Needs to Make These 3 Changes","title_rss":"NULL","source_domain":"bustle.com","text":"Premium network HBO has renewed freshman drama series The Leftovers for Season 2, Deadline reports on Wednesday. Based on a novel by best-selling author Tom Perrotta, The Leftovers, which stars Jennifer Anniston's handsome fiancé, Justin Theroux (among others), takes place in a small New York suburb after a \"Rapture-like\" event has caused millions of people across the world to suddenly...disappear.\nHelmed by Perrotta and Lost co-creator Damon Lindelof, The Leftovers is a mysterious, emotional show, anchored by compelling characters and strong performances. Chances are you'll keep tuning in, even if you're left with a ton of unanswered questions at the end of each episode. It's addictive!\nAs someone who was never a big fan of Lost, but is a big fan of Perrotta novels like Little Children, I tentatively began watching The Leftovers earlier in August — and I devoured six episodes in no time flat. Though the show can be a little \"heavy\" at times, it's full of interesting relationships and little, unexpected plot developments that always keep me coming back for more. But don't get me wrong — it's not a perfect show by any means.\nNow that The Leftovers has been renewed for a Season 2 (hooray!), there are definitely a few changes that I'd like to see made in the future:\nCan The Teenagers, Like, You Know, Act Like Real Teenagers?\nTeenagers, including the daughter of police chief Kevin Garvey (Theroux), Jill (Margaret Qualley), but especially Jill's best friend, Aimee (Emily Meade), are probably the worst-written characters on The Leftovers. Perhaps my high school experience was exceptionally uninteresting, but I just don't know that THAT many teens are actually playing that silly iPhone \"Spin the Bottle\" game, where options include \"Burn\" and \"Choke.\" How provocative! I mean, am I the only person who never choked a dude in high school while he masturbated, a single, artful tear streaming down my face? C'mon!\nAlso, that strange ceremony to burn the baby Jesus doll? Double also, that abandoned refrigerator that teens like to lock each other in in the middle of the forest? I don't know, none of it really rings true for me, but I suppose I could be in the minority. I guess I'd just like to see The Leftover's teens occasionally doing some regular teen stuff, like, you know, eating pizza, watching television, and doing their freakin' homework!\nCan We Actually Get Some Answers Sometimes?\nI'm totally OK with the fact that there are probably some questions on The Leftovers that will forever remain unanswered — but can't we get just a teensie weensie bit more information sometimes? Just occasionally? Granted, the show's first season isn't over yet, but little questions like, \"What did Kevin say to Aimee while she was bandaging his hand?\" are EATING ME UP INSIDE. Can't we get a flashback or something? Anything??\nI guess if I were a bigger fan of Lost, this feeling of \"not knowing\" would be more familiar to me, and then, perhaps more palatable, but I'm having a little bit of a hard time here. Then again, the show's mysterious nature is part of what makes it so compelling, so maybe I should shut up. But then AGAIN, audiences don't want to feel like they've been strung along, episode after episode, with no substantial pay-off! It's complicated.\nCan The Guilty Remnant Switch to E-Cigs?\nFirst of all, cigarettes are expensive and the members of the Guilty Remnant don't have paying jobs. They literally just hang out all day. Think of the savings! Also, it would just make the show easier to watch. Even though I know that the actor's cigarettes are probably filled with kale or something (finally, a good use for kale!), my lungs ache at the sight of Laurie Garvey (Amy Brenneman) lighting up cigarette after cigarette. E-cigarettes are probably cheaper AND healthier in the long run. Don't these people want to stick around as long as possible to deliver their message of hopelessness and despair?\nThe Leftover's first season, which consists of 10 episodes, will conclude on September 7 on HBO.\nImages: HBO; theleftoversdaily/Tumblr; Giphy; theleftovers-hbo/Tumblr","url":"https://www.bustle.com/articles/35634-the-leftovers-renewed-for-season-2-but-the-show-needs-to-make-these-3-changes"}
