{"authors":["Associated Press"],"date_download":"2018-10-23 03:25:29","date_modify":"2018-10-23 03:25:29","date_publish":"2016-01-28 19:00:03","description":"ATHENS, Greece (AP) — The Latest on the influx of asylum-seekers in Europe (all times local): 8:45 p.m. Germany's vice chancellor says leaders of the governi...","filename":"data/vaneerConsumption/TheLatestGermancoalitionunblocksmigrantpackage.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:148d74c8d9c84bd592c9610a1d37924c-2vdWmEltwXfba0ce28e632bcd987-483_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420437_The-Latest-Migrant-boat-sinks-11-dead-10-people-rescued_1540265129.html","title":"The Latest: German coalition unblocks migrant package","title_page":"The Latest: German coalition unblocks migrant package | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: German coalition unblocks migrant package\nATHENS, Greece (AP) — The Latest on the influx of asylum-seekers in Europe (all times local):\n8:45 p.m.\nGermany's vice chancellor says leaders of the governing coalition have reached a deal to unblock a package of measures meant to streamline the handling of the migrant influx.\nA Syrian refugee woman with babies walks towards the border with Serbia from the transit center for refugees near northern Macedonian village of Tabanovce, while on their journey through the so-called Balkan migrant corridor, Thursday, Jan. 28, 2016. Greek authorities say neighboring Macedonia has stopped Wednesday letting in refugees heading north to central Europe, leaving about 2,600 people stranded on the Greek side of the border. (AP Photo/Boris Grdanoski)\nSigmar Gabriel said Thursday after meeting Chancellor Angela Merkel and Bavaria's governor, Horst Seehofer, that migrants who receive a restricted asylum status won't be able to bring relatives to Germany for two years.\nThe package, which was first tentatively agreed on in early November, also foresees using special centers to quickly process migrants who have little realistic chance of winning asylum. It's been held up because Merkel's coalition of left and right squabbled over who should initially be blocked from bringing relatives to Germany.\n___\n7:20 p.m.\nThe police chief in the German city of Kiel has rejected suggestions that authorities there haven't been taking action against some migrants who commit petty crimes.\nThe news agency dpa and other media reported Thursday on what they described as a tacit agreement between police and prosecutors not to take photos or fingerprints of migrants who commit minor crimes such as shoplifting and whose identity couldn't quickly be established. That drew criticism from local opposition politicians.\nPolice chief Thomas Bauchrowitz later Thursday rejected the idea that police were letting off migrants involved in minor offenses. He added that \"a criminal complaint was filed in every case.\"\n___\n3:35 p.m.\nGreece's coast guard has raised the death toll from a migrant boat sinking Thursday to 25, after recovering seven more bodies from the sea off the northern coast of Samos, an island near the Turkish coast. Ten of the dead are children.\nThe coast guard said the bodies of five girls, five boys, 10 men and five women have been recovered, while 10 people had been rescued.\nA search and rescue operation is continuing in the area, the coast guard said. Survivors' accounts of how many people had been on board were unclear, and authorities are uncertain of how many more people might be missing.\nThe passengers had been traveling in a wooden boat that partially sank. The exact circumstances of the incident were unclear.\n___\n1 p.m.\nThe Dutch EU presidency is working on a plan to ease the migrant crisis by which a core group of member states would accept up to 250,000 refugees coming from Turkey in return for sending back the migrants that now arrive by the hundreds of thousands in Greece.\nThe leader of the Socialist PvdA party, a key partner in the government of Prime Minister Mark Rutte, told De Volkskrant paper Thursday that current EU plans were not working because of intransigence of many member states refusing to take refugees. Instead, Diederik Samson said a core group of nations should be willing to accept a set number of refugees coming from Turkey, if the other migrants can be sent back.\nSamson said that once Turkey gains the full status as 'safe country' for migrants to be returned to, returns could happen speedily.\nEven if the core group of EU nations would voluntarily accept the refugees, the 28-nation EU as a whole would have to bear the financial burden, he said.\n___\n12:55 p.m.\nInternational Olympic Committee President Thomas Bach has praised Greece's efforts to help migrants and refugees during a visit to a transit camp in Athens.\nBach, in Athens to attend a sporting awards ceremony, said the Greek effort for migrants is \"really extraordinary.\"\nHis praise came as Greece is coming under mounting pressure from other European Union countries to speed up preparations to build more transit camps in the Greek mainland and screening centers on the islands in the eastern Aegean Sea.\nMore than a million refugees and migrants traveled to the EU last year, with over 80 percent of them traveling to Greece from nearby Turkey.\n___\n12:50 p.m.\nRomanian border police say they have rescued 119 asylum-seekers from Africa who were on an inflatable dingy in the Mediterranean, trying to reach Europe.\nA statement said the police who were aboard the \"Stefan cel Mare\" ship, picked up the migrants, all men and 34 of them children, on Tuesday evening, due to dangerous conditions including low temperatures and overcrowding on their vessel.\nThe migrants were dehydrated and had signs of hypothermia. They came from Gambia, Senegal, Liberia, Mali, Sierre Leona and Guinea Bissau and were planning to travel to the Schengen area.\nThe Romanian ship docked Wednesday evening near the port of Lampedusa where the migrants were handed over to Italian authorities.\n___\n12:45 p.m.\nCroatia's president is meeting with her Polish counterpart for talks on the migrant crisis in Europe and on security.\nThe two-day visit by Kolinda Grabar-Kitarovic opened Thursday with a military ceremony before the Presidential Palace, where she later met with President Andrzej Duda.\nApart from discussing the massive arrivals by migrants, who also pass through Croatia, they discussed the region's security in face of a resurgent Russia and closer cooperation of countries between the Mediterranean and the Baltic seas.\nGrabar-Kitarovic is also to meet with Poland's Prime Minister Beata Szydlo.\n___\n12:10 p.m.\nThe British government has announced plans to allow an unspecified number of vulnerable refugee children to come to Britain to live. Details were not announced.\nThe announcement Thursday comes after charities have urged Britain to take in some 3,000 children believed to be at risk.\nImmigration Minister James Brokenshire says Britain will work with the United Nations refugee agency to identify \"exceptional cases\" in which unaccompanied children would be given shelter in Britain. The new program is in addition to the 4,000 refugees per year that Britain has agreed to settle.\n___\n12:05 p.m.\nAuthorities in Greece have raised the death toll from a migrant boat sinking to 18, after recovering seven more bodies off the island of Samos in the eastern Aegean Sea.\nThe Coast Guard said Thursday that nine children were among the dead — four girls and five boys — while eight adult men and one woman also died.\nVessels from the European border agency Frontex were assisting the Greek Coast Guard in the search for others possibly missing, after 10 people were rescued.\nDespite toughening European border controls, refugees and migrants have continued to travel to the Greek islands near the Turkish coast, at a rate of roughly 1,500 per day since the beginning of the year, braving the bad weather in dinghies and old wooden boats.\n___\n11:00 a.m.\nBerlin police say an activist working with asylum-seekers made up a story that a 24-year-old Syrian refugee died after waiting for days in the cold outside the city's central registration point.\nPolice began investigating after an activist posted on social media a Syrian man died of cardiac arrest after suffering from a high fever, accusing the city of negligence.\nThe posting quickly went viral and ignited a tempest of online indignation, but police were immediately skeptical, saying they had been unable to locate any body.\nPolice spokesman Michael Maass said Thursday the activist was tracked down and questioned, and admitted making up the story.\nMaass wouldn't comment on the motivation of the activist, whose name wasn't released, saying \"he has to explain that himself.\"\n___\n10:00 a.m.\nSwedish Interior Minister Anders Ygeman says the country could deport between 60,000 and 80,000 asylum-seekers in coming years.\nYgeman told newspaper Dagens Industri that since about 45 percent of asylum applications are currently rejected, the country must get ready to send back tens of thousands of the 163,000 who sought shelter in Sweden last year.\n\"I think that it could be about 60,000 people, but it could also be up to 80,000,\" Ygeman was quoted as saying.\nHis spokesman, Victor Harju, confirmed the quotes Thursday, adding that the minister was simply applying the current approval rate to the record number of asylum-seekers that arrived in 2015. Harju adds: \"That rate could of course change.\"\nGermany and Sweden were the top destinations for asylum-seekers in Europe last year\n___\n9:45 a.m.\nGreece's coast guard says it is unclear how many people are missing from the latest migrant boat sinking off an eastern Greek island that has claimed at least 11 lives.\nTen people have been rescued from Thursday's sinking north of the island of Samos. The coast guard said the survivors were in shock and their accounts of how many people were on board were confused and vague.\nFive of the survivors were found clinging to a piece of wood, leading authorities to believe that the vessel that sank was made of wood.\nThe bodies of our boys, three girls, three men and one woman were recovered from the sea. A search and rescue operation was ongoing in the area by the Greek coast guard and vessels from the European border patrol agency Frontex.\n___\n9:05 a.m.\nGreece's coast guard says at least 11 people, most of them children, have died in the latest migrant boat sinking off an eastern Greek island.\nThe circumstances of Thursday's sinking were unclear. The Greek coast guard and vessels from the European border patrol agency Frontex were carrying out a search and rescue operation off the island of Samos. Ten people were rescued, while 11 bodies — those of four boys, three girls, three men and one woman — were recovered.\nThe sinking is the second in two days. Another boat sank off the island of Kos on Wednesday, leaving seven dead, including two children.\nGreece, with thousands of kilometers (miles) of coastline and islands very near the Turkish coast, is the main gateway into Europe for refugees and migrants.\nRefugees rest inside a giant tent at a refugee camp in the northern Greek village of Idomeni at the Greek-Macedonian border on Thursday, Jan. 28, 2016. Macedonia allows in migrants whom it deems to be bona fide refugees - Syrian, Iraqi and Afghan nationals. All others are considered economic migrants and left trapped in Greece, where they are told to seek asylum, agree to voluntary repatriation or be deported. (AP Photo/Giannis Papanikos)\nA coast guard vessel arrives with the dead bodies of migrants at the port of Vathi on the eastern Greek island of Samos on Thursday, Jan. 28, 2016. Authorities in Greece have raised the death toll from a migrant boat sinking to 18, after recovering seven more bodies off the island of Samos in the eastern Aegean Sea. (AP Photo/Michael Svarnias)\nRefugees with their babies go to receive food distributed by non-governmental organizations at a refugee camp in the northern Greek village of Idomeni at the Greek-Macedonian border on Thursday, Jan. 28, 2016. Macedonia allows in migrants whom it deems to be bona fide refugees - Syrian, Iraqi and Afghan nationals. All others are considered economic migrants and left trapped in Greece, where they are told to seek asylum, agree to voluntary repatriation or be deported. (AP Photo/Giannis Papanikos)\nRefugees walk towards the border with Serbia from the transit center for refugees near northern Macedonian village of Tabanovce, while on their journey through the so-called Balkan migrant corridor, Thursday, Jan. 28, 2016. Greek authorities say neighboring Macedonia has stopped Wednesday letting in refugees heading north to central Europe, leaving about 2,600 people stranded on the Greek side of the border. (AP Photo/Boris Grdanoski)\nRefugees walk towards the border with Serbia from the transit center for refugees near northern Macedonian village of Tabanovce, while on their journey through the so-called Balkan migrant corridor, Thursday, Jan. 28, 2016. Greek authorities say neighboring Macedonia has stopped Wednesday letting in refugees heading north to central Europe, leaving about 2,600 people stranded on the Greek side of the border. (AP Photo/Boris Grdanoski)\nRefugees walk towards the border with Serbia from the transit center for refugees near northern Macedonian village of Tabanovce, while on their journey through the so-called Balkan migrant corridor, Thursday, Jan. 28, 2016. Greek authorities say neighboring Macedonia has stopped Wednesday letting in refugees heading north to central Europe, leaving about 2,600 people stranded on the Greek side of the border. (AP Photo/Boris Grdanoski)","url":"https://www.dailymail.co.uk/wires/ap/article-3420437/The-Latest-Migrant-boat-sinks-11-dead-10-people-rescued.html"}
