{"authors":[],"date_download":"2018-10-30 01:24:55","date_modify":"2018-10-30 01:24:55","date_publish":"2015-02-27 09:00:00","description":null,"filename":"data/vaneerConsumption/TheLessonsofRecentHistory.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/02/isis-flag.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862695.html","title":"The Lessons of Recent History","title_page":"The Lessons of Recent HistoryThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"On Tuesday, we learned that Islamic State militants had kidnapped some 220 Assyrian Christians in northeastern Syria. The week before, ISIS released a video of 21 Egyptian Christians getting beheaded, in which a jihadist declares, “We will conquer Rome, by Allah’s permission.”\nPreceding these atrocities was another controversy, this one oratorical. At the National Prayer Breakfast earlier this month, President Obama beseeched his listeners to “remember that during the Crusades and the Inquisition, people committed terrible deeds in the name of Christ.” Many people took offense at this remark, not because of its historical veracity but because of its context. Here was the president, like a middle-aged man reminiscing about high school, discoursing on ancient history because he didn’t want to talk about the present.\nIt is important to remember, when remembering the Crusades and the Inquisition, that they happened a long time ago—as far back as the 11th century—so long ago that their respective dates are of importance only to historians and players of Trivial Pursuit.\nJihadist violence, on the other hand, is still in progress. The day before Obama’s speech, the United Nations issued a report detailing ISIS’s various crimes, including “mass executions of boys, as well as reports of beheadings, crucifixions of children and burying children alive.”\nWhat we in the West consider to be atrocities, many Muslims perceive as righteous acts. Throughout much of the Muslim world, suicide bombings are called “sacred explosions.” In 2002, a global survey by the Pew Research Center for the People and the Press found that 73 percent of Lebanese respondents believed “suicide bombing in defense of Islam” was justified. The percentage undoubtedly would have been higher had Saudis or Afghanis been polled.\nWhatever you think of the Pope or Joel Osteen, they are not advocating bombing or beheading in defense of Christendom. The closest we have to a declaration of holy war by a contemporary Christian is a remark Ann Coulter made three days after the 9/11 attacks. “We should invade their countries, kill their leaders and convert them to Christianity,” she wrote. The only people who took her comment seriously were her employers at National Review Online, who severed ties with her.\nWe do not dismiss the rhetoric of jihadists so readily. We know that writing a sentence poking fun at the Prophet carries a death sentence, not just a pink slip. After the attacks at the offices of Charlie Hebdo in January, a Muslim cleric named Anjem Choudary wrote in USA Today, “Muslims consider the honor of the Prophet Muhammad to be dearer to them than that of their parents or even themselves.” He quoted the Prophet as saying, “Whoever insults a Prophet kill him.” It is no wonder, then, that Muslims who take this injunction seriously are willing to carry it out.\nOne scours their holy books in vain for passages about turning the other cheek. The Koran is replete with sentences admonishing believers to take up arms against infidels: “Slay them wherever you find them…. Fight against them until idolatry is no more and God’s religion reigns supreme” (2:190-93). “Fighting is obligatory for you, much as you dislike it” (2:216). “We will put terror into the hearts of the unbelievers” (3:150). And so on.\nThe Hadith, which recounts the sayings of the Prophet, is similarly bellicose. It pronounces: “A single endeavor (of fighting) in Allah’s Cause in the forenoon or in the afternoon is better than the world and whatever is in it.” Elsewhere it affirms: “A day and a night fighting on the frontier is better than a month of fasting and prayer.”\nLest you accuse me of cherry picking, consider that is what the jihadists themselves are doing to justify their acts of savagery. From them we learn, much to our displeasure, two lessons of recent history—namely, that radical Islam, not medieval Christianity, is the enemy; and that recent history keeps repeating itself.","url":"https://spectator.org/61901_lessons-recent-history/"}
