{"authors":[],"date_download":"2018-10-30 00:54:05","date_modify":"2018-10-30 00:54:05","date_publish":"2015-10-06 00:00:00","description":null,"filename":"data/vaneerConsumption/TheLatestSkirmishesontheInequalityFront.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_10_the_latest_skirmishes_on_the_inequality_front_1540860845.html","title":"The Latest Skirmishes on the Inequality Front","title_page":"The Latest Skirmishes on the Inequality Front","title_rss":"NULL","source_domain":"americanthinker.com","text":"It is also an emotion that clouds rational thinking, which is why unscrupulous politicians on the left have always found it useful. Consumed by envy, voters cast their votes against the rich rather than for their own best interest.\nEnvy may be the most corrupt of human passions. There is a reason it is listed among the \"seven deadly sins.\" It sullies the man who falls prey to it. It is a source of divisiveness and violence. And it is purely negative – producing nothing but bitterness and resentment.\nAs unscrupulous as it is, the politics of wealth envy works. It worked for Obama in 2008 and 2012. It worked for Elizabeth Warren in Massachusetts, for Bernie Sanders in Vermont, and for Hillary Clinton in New York – and, despite her email setbacks, it is working in her current presidential campaign.\nHillary's \"women's campaign\" is simply another variation on wealth envy. Having witnessed the success of Obama's politics of racial division, Hillary seems determined to do the same thing with gender. Less affluent women must be made to feel that their station is someone else's fault. Then they can be promised their fair share.\nThat seems to be the idea behind California's equal pay bill, designed to ensure equal pay for \"substantially similar work.\" Only a Democratic legislature could dream that one up. Should a checkout clerk receive the same pay as a postal worker? Pretty similar jobs, I would say. Does a college teacher with a doctorate deserve the same pay as a neurosurgeon with a doctor's degree? Yes, they both work on brains.\nWho will determine what constitutes substantially similar work? And how will the salary level of one particular job be compared with thousands of others that might resemble it in some respect? It repeats the fallacy of FDR's National Recovery Administration, a colossal failure even before it was ruled unconstitutional by the Supreme Court in 1935. So it goes with all liberal efforts to control wages and prices.\nSome women may believe they are underpaid because of their gender. The Bureau of Labor Statistics has published research refuting that claim, but Hillary seems more than willing to ignore that research. She seems to believe that gender is her path to the White House.\nWhat Hillary promises less affluent women is a handout, not equality. Without working for it, and without educating themselves for it, some women (and some men as well) want incomes that are equal to more skilled or harder-working colleagues. Hillary promises to provide just that by seizing and redistributing the earnings of others. That is the politics of envy at its worst.\nHillary's official website features a photo of Hillary embracing a woman dressed in a service employee's uniform and states that \"[t]oo many families are working harder and harder, but still not getting ahead.\" That statement, like everything that comes out of the Clintons, seems a bit oily. Is it the \"families\" who are working harder, or their adult members? And is it all families, or mostly those headed by women? If so, why not say it, and let yourself be known as the champion of working women? Well, maybe there are working men who also need a champion.\nThat same envy of \"billionaires\" and \"corporations\" was the focus of Hillary's campaign kickoff speech on June 13 in New York City. Channeling FDR, Hillary declared her own \"rendezvous with destiny\" – focused almost exclusively on raising incomes for working Americans. For \"food servers,\" \"nurses,\" \"truckers,\" and \"everyone who's been knocked down, but refused to be knocked out.\"\nThen she reiterated that she wanted to be the champion of all these low-paid workers. After all, her grandfather was a mill worker, her father started a small business, and she and Bill left the White House without a nickel to their names.\nHillary's efforts to be one of the folks can be pretty amusing, as when she pops in a diner for some casual \"listening\" or affects a Southern accent at a South Carolina Democratic Women's Council. At that Greenville event, she revealed that she just loves the working people of the South. After fall, she's spent many a Renaissance Weekend at Hilton Head. That must be where she met all those food servers.\nHilton Head aside, her speech was another mean-spirited attack on \"those at the top,\" full of \"what's happening to American families\" and promises of an \"opportunity ladder.\"\nThe question is, opportunity for whom? Not for the working Americans who have lost ground since Barack Obama entered office. According to a report issued by the United States Conference of Mayors, jobs created under Obama are paying 23% less than those they replaced (under George W. Bush). So those 5 million green jobs Obama promised were a scam. Workers got Burger King and Merry Maids instead.\nHillary promises more of the same. The only ones getting rich under the politics of envy are Democratic politicians and their cronies. In Hillary's own words, she and Bill were \"dead broke\" when they left the White House. Now they possess an estimated $32 million. They did all right, while, in Hillary's words, most working families are \"struggling.\"\n\"Sharing and caring\" was the theme of Hillary's 2008 presidential campaign. It's pretty much the same theme now, but with a populist edge. But how much of her own wealth has Hillary shared with working Americans? With earnings of $28 million in 2014 alone, Bill and Hillary contributed $3 million to charity in 2014, but half of that went to their own foundation. Smaller amounts went to the American Ireland fund, the University of Arkansas (home of the William J. Clinton Presidential Center), and the American Friends of the Peres Center (a charity supporting the Peres Center in Israel). Not much for working families there.\nFrom what she says on the campaign trail, one would expect Hillary to be showering her $28 million on working stiffs. At the very least, she could support the Keystone XL pipeline, which would create and estimated 200,000 high-paying jobs. But after wavering for years when she had the authority to approve it, she's now come out against it. Even the Teamsters, perennial Democratic supporters, are thinking Donald Trump might be better for working Americans.\nStill, Hillary continues to phone in her comments about how she wants to help working families, and how Republicans are all for the rich hedge fund managers and \"big corporations.\" (Little corporations are apparently okay.) She seems determined to stay on message this time around. If she repeats it enough, maybe working Americans will actually believe it.\nOr maybe they will start thinking for themselves and ask, Who actually benefits from the Obamas and Clintons of this world? Maybe enough working Americans will realize who it is to elect a conservative who rejects wealth envy and wants to focus on growing the economy. Take your pick: Trump, Carson, Bush, Rubio – they're all better than another four years of wealth envy. Conservatives can win if they show who really wins under such vile politics.\nJeffrey Folks is the author of many books and articles on American culture including Heartland of the Imagination (2011).","url":"https://www.americanthinker.com/articles/2015/10/the_latest_skirmishes_on_the_inequality_front.html"}
