{"authors":["Associated Press"],"date_download":"2018-10-23 03:09:42","date_modify":"2018-10-23 03:09:42","date_publish":"2016-01-11 15:50:02","description":"BALTIMORE (AP) — The latest in the case of a Baltimore police officer charged in the death of Freddie Gray (all times local): 10:15 a.m. There's no timetable...","filename":"data/vaneerConsumption/TheLatestTrialdelayedindefinitelyinFreddieGraycase.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394014_The-Latest-Trial-delayed-officer-Freddie-Gray-case_1540264182.html","title":"The Latest: Trial delayed indefinitely in Freddie Gray case","title_page":"The Latest: Trial delayed indefinitely in Freddie Gray case | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Trial delayed indefinitely in Freddie Gray case\nBALTIMORE (AP) — The latest in the case of a Baltimore police officer charged in the death of Freddie Gray (all times local):\n10:15 a.m.\nThere's no timetable for the next steps in the trial of a police van driver accused of killing Freddie Gray in Baltimore.\nMaryland courts spokesman Terri Charles said Monday that Officer Caesar Goodson's trial is postponed indefinitely, pending further proceedings before the state Court of Special Appeals.\nThose are expected to include more written filings from both sides, followed by oral arguments.\nGoodson's trial was expected to begin Monday in Baltimore Circuit Court before the appeals court issued a stay.\nCharles says the trial is \"stayed until the Court of Special Appeals rules.\"\n___\n9:39 a.m.\nA Maryland appeals court has delayed the trial of the police van driver charged in the death of Freddie Gray.\nJury selection had been set to start Monday in Baltimore in the trial of Caesar Goodson. He's the second of six officers scheduled for trial. The manslaughter trial of Officer William Porter ended in December with a hung jury.\nGoodson's case has been complicated after a judge ruled last week that Porter must testify against Goodson, despite Porter's claim that he has a right not to incriminate himself. A state appeals court has temporarily blocked that ruling while its judges consider whether to uphold that decision.","url":"https://www.dailymail.co.uk/wires/ap/article-3394014/The-Latest-Trial-delayed-officer-Freddie-Gray-case.html"}
