{"authors":["Associated Press"],"date_download":"2018-10-23 03:42:04","date_modify":"2018-10-23 03:42:04","date_publish":"2017-04-26 15:10:50","description":"ANKARA, Turkey (AP) - The Latest on mass detentions in Turkey related to last year's failed coup (all times local):10:40 p.m.Turkey's state-run news agency...","filename":"data/vaneerConsumption/TheLatestTurkeysuspendsaround9000frompoliceforce.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447972_The-Latest-Germany-criticizes-mass-detentions-Turkey_1540266124.html","title":"The Latest: Turkey suspends around 9,000 from police force","title_page":"The Latest: Turkey suspends around 9,000 from police force | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ANKARA, Turkey (AP) - The Latest on mass detentions in Turkey related to last year's failed coup (all times local):\n10:40 p.m.\nTurkey's state-run news agency says more than 9,000 personnel from the country's police force have been temporarily suspended while they are investigated for suspected links to U.S.-based cleric Fethullah Gulen, who is blamed for last summer's failed coup attempt.\nAnadolu Agency said that the police personnel were removed from duty on Wednesday hours after Turkey launched nationwide operations, detaining 1,120 people with alleged ties to Gulen's movement.\nIt was not immediately clear if the suspensions were directly connected to the detention of the suspects whom Interior Minister Suleyman Soylu described as \"secret imams\" who had allegedly infiltrated the police force.\nMore than 100,000 people, including police, military personnel and teachers, have been purged from the civil service as part of the crackdown on Gulen's movement since the coup.\n___\n5 p.m.\nThe German government has criticized the detention of more than 1,000 people in Turkey as part of the probe into last year's coup attempt.\nA Foreign Ministry spokesman says that Germany believes the failed coup needs to be fully investigated \"but the measures must adhere to the rule of law.\"\nSebastian Fischer told reporters in Berlin that \"we don't believe arresting 1,000 people so long after the putsch is really proportionate.\"\nTurkish police launched simultaneous operations across the country, detaining people with suspected links to U.S.-based cleric Fethullah Gulen.\nRelations between Berlin and Ankara have worsened in recent years amid a number of spats, including the arrest of German-Turkish journalist Deniz Yucel in Istanbul.\n___\n9:55 a.m.\nTurkey's state-run news agency says police have launched simultaneous operations across the country, detaining hundreds of people with suspected links to U.S.-based cleric Fethullah Gulen.\nAnadolu Agency says as many as 803 people were detained in raids conducted in all of Turkey's 81 provinces early on Wednesday. The suspects are allegedly Gulen operatives who directed followers within the police force.\nSome 8,500 police officers participated in the operation, Anadolu said.\nThe detentions are part of a widespread crackdown in the wake of last summer's failed coup attempt, which Turkey says was orchestrated by Gulen's movement. More than 47,000 people have been arrested since the coup, Turkey's interior minister has said, including some 10,700 police officers and 7,400 military personnel.\nGulen has denied orchestrating the coup.","url":"https://www.dailymail.co.uk/wires/ap/article-4447972/The-Latest-Germany-criticizes-mass-detentions-Turkey.html"}
