{"authors":["Associated Press"],"date_download":"2018-10-23 04:06:24","date_modify":"2018-10-23 04:06:24","date_publish":"2017-03-16 15:24:18","description":"WASHINGTON (AP) - The Latest on President Donald Trump's budget proposal for the coming fiscal year (all times local):2:20 p.m.The U.N. says...","filename":"data/vaneerConsumption/TheLatestUNofficialworriedaboutUSfundingcuts.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/18/wire-230125-1489689562-581_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320688_The-Latest-Pelosi-Budget-conflicts-national-values_1540267584.html","title":"The Latest: UN official worried about US funding cuts","title_page":"The Latest: UN official worried about US funding cuts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - The Latest on President Donald Trump's budget proposal for the coming fiscal year (all times local):\n2:20 p.m.\nThe U.N. says Secretary-General Antonio Guterres is ready to discuss with the United States and any other U.N. member state \"how best we can create a more cost-effective organization.\"\nA portion of President Donald Trump's first proposed budget, focusing on the Department of Defense, and released by the Office of Management and Budget, is photographed in Washington, Wednesday, March 15, 2017. President Donald Trump is unveiling a $1.15 trillion budget, a far-reaching overhaul of federal government spending that slashes a dozen departments to finance a significant increase in the military and make a down payment on a U.S.-Mexico border wall. (AP Photo/Jon Elswick)\nThe budget proposed by President Donald Trump reduces funding to the U.N. and its affiliated agencies, and caps American contributions to U.N. peacekeeping missions at 25 percent of the total costs. The U.S. currently pays 22 percent of the U.N.'s regular budget and over 28 percent of the costs of its far-flung peacekeeping operations which are undergoing a review.\nU.N. spokesman Stephane Dujarric said Guterres is grateful for U.S. support as the U.N.'s largest financial contributor and concerned that abrupt funding cuts can undermine long-term reform efforts.\nApparently reacting to Trump's announcement of a big increase for the U.S. military in the proposed budget, Dujarric said Guterres believes that effectively combatting terrorism \"requires more than military spending.\"\n__\n12:55 p.m.\nThe top Democrat on the House Ways and Means Committee is slamming proposed budget cuts to the IRS, an agency that is down more than 17,000 employees since 2010.\nRep. Richard Neal of Massachusetts says: \"We have seen in recent years that when IRS funding goes down, call wait times rise for taxpayers.\"\nHe adds that: \"Congressional Republicans have been saying they want the IRS to be more focused on customer service, but slashing funding for the agency by hundreds of millions of dollars would result in the exact opposite outcome.\"\nPresident Donald Trump proposed budget would cut the agency's funding by $239 million from this year's spending level. The agency's budget of about $11 billion is about $1 billion less than it was in 2010.\n___\n11:20 a.m.\nHouse Minority Leader Nancy Pelosi says she doesn't see how President Donald Trump's recommended budget for the fiscal year can survive the light of day.\nPelosi says the budget represents a philosophical distrust of the role of the federal government in any way meeting the needs of Americans.\nPelosi says the budget should be a statement of national values. She says the strength of America doesn't just depend on a strong military, but on well-educated children, life-saving medical research and a healthy environment.\nTrump unveiled a $1.15 trillion budget on Thursday, a far-reaching overhaul of federal government spending that slashes many domestic programs. The budget recommends a $54 billion increase in defense spending, but Pelosi says the future demands the government also invest in the well-being of children and working families.\n___\n8:15 a.m.\nPresident Donald Trump has unveiled a $1.15 trillion budget, a far-reaching overhaul of federal government spending that slashes many domestic programs to finance a significant increase in the military and make a down payment on a U.S.-Mexico border wall.\nTrump's proposal seeks to upend Washington with cuts to long-promised campaign targets like foreign aid and the Environmental Protection Agency as well as strong congressional favorites such as medical research, help for homeless veterans and community development grants.\nThe $54 billion boost for the military is the largest since President Ronald Reagan's Pentagon buildup in the 1980s. It promises immediate money for troop readiness, the fight against Islamic State militants and procurement of new ships, fighter jets and other weapons.\nProposals for the Defense Department in President Donald Trump's first budget are displayed at the Government Printing Office in Washington, Thursday, March, 16, 2017. The $1.15 trillion presentation proposes a reordering of national spending priorities, pumping significantly more money into the military and homeland security while sharply cutting foreign aid, medical research and the arts. The document also proposes money for the U.S.-Mexico border wall Trump vowed in his campaign to have Mexico finance. The EPA also takes a big hit in the budget proposal. (AP Photo/J. Scott Applewhite)","url":"https://www.dailymail.co.uk/wires/ap/article-4320688/The-Latest-Pelosi-Budget-conflicts-national-values.html"}
