{"authors":[],"date_download":"2018-10-30 00:58:23","date_modify":"2018-10-30 00:58:23","date_publish":"2017-02-10 00:04:29","description":null,"filename":"data/vaneerConsumption/TheLordsDayMeetDarwinDayandShudder.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/02/Darwin_panel-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861103.html","title":"The Lord’s Day, Meet Darwin Day… and Shudder","title_page":"The Lord’s Day, Meet Darwin Day… and ShudderThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"February 12 is Darwin Day, and this year the international celebration falls on a Sunday. Look for theistic Darwinists to reassure churches that Charles Darwin believed in God, or at least that his theory of evolution harmonizes beautifully with Christian theology.\nThe reality is more complex.\nIn The Origin of Species, Darwin suggested the idea of a God who created a few original forms and then let the “laws” of nature govern the outcome. “It is just as noble a conception of the Deity to believe that He created a few original forms capable of self-development into other and needful forms,” he wrote, “as to believe that he required a fresh act of creation to supply the voids caused by the action of his laws.”\nBut later he wrote privately to friend Joseph Hooker, “I have long regretted that I truckled to public opinion, and used the Pentateuchal term of creation.” And in 1862, he told Harvard botanist Asa Gray there seemed to be “too much misery in the world.” He could not accept, for example, “that a beneficent and omnipotent God would have designedly created [digger wasps] with the express intention of their feeding within the living bodies of caterpillars, or that a cat should play with mice.”\nA Devil’s Chaplain\nFor Darwin it always came back to the problem of pain. “What a book a devil’s chaplain might write on the clumsy, wasteful, blundering, low, and horribly cruel works of nature!” he wrote to Hooker around 1856.\nWounded pride also may have played a role. In his autobiography, Darwin recalled that while on board H.M.S. Beagle he was “heartily laughed at by several of the officers for quoting the Bible as an unanswerable authority on some point of morality.”\nSo he reconsidered the Old Testament and later described it as a “manifestly false history of the world, with the Tower of Babel, the rainbow as a sign, etc., etc.” The Bible, he concluded, was “no more to be trusted than the sacred books of the Hindoos, or the beliefs of any barbarian.”\nMethodological Atheism\nGray told Darwin that he didn’t see why they couldn’t have both Darwin’s theory of evolution and a role for a designing intelligence. Darwin would have none of it, but realizing that a thoroughgoing materialism wasn’t an easy sell, he actively concealed this aspect of his thinking. In one notebook he reminded himself to “avoid stating how far, I believe, in Materialism.”\nDarwin promoted his materialistic worldview indirectly by supporting the principle that science should invoke only material causes. According to this methodological rule, you needn’t be an atheist to do science, but you should offer only hypotheses consistent with atheism when doing science. Call it methodological atheism. As he told geologist Charles Lyell, “I would give absolutely nothing for the theory of Natural Selection, if it require miraculous additions at any one stage of descent.”\nThis methodological dogma is in full bloom today. “We take the side of science in spite of the patent absurdity of some of its constructs, … in spite of the tolerance of the scientific community for unsubstantiated just-so stories, because we have a prior commitment, a commitment to materialism,” wrote Harvard geneticist Richard Lewontin. “Moreover,” he added, “that materialism is absolute, for we cannot allow a Divine Foot in the door.”\nA Blind Eye\nOne doesn’t hear much about the materialism of Darwin and Darwinism, likely because there has been a longstanding effort to ignore and suppress it. Many of today’s theistic Darwinists play this game, but they are hardly the first. So, for instance, Darwin’s mounting hostility to Christianity was suppressed by his widow, who removed some inflammatory comments from his Autobiography. The following passage was not generally known until restored by his granddaughter Nora Barlow in 1958: “Thus disbelief crept over me at a very slow rate, but was at last complete. The rate was so slow that I felt no distress, and have never since doubted even for a single second that my conclusion was correct.”\nRumors of Darwin’s deathbed conversion are without basis. Darwin put his faith in mindless evolution and lost his faith in God.\nIt’s a shame. Almost 160 years after The Origin of Species appeared, the case for intelligent design is stronger than ever. The origin of the first animal forms in the Cambrian explosion; the origin of the first microscopic life; the cellular world of sophisticated molecular machines; the origin of a finely tuned universe from nothing — each is part of a march of discovery since Darwin’s day that has taken us further and further from a world empty of final meaning, and deeper into one charged with the grandeur of some extraordinary design.\nThat’s something worth celebrating this Darwin Day, and every Sunday.\nPraised by Tom Wolfe as “one of our most brilliant essayists,” Tom Bethell is author of the new book Darwin’s House of Cards: A Journalist’s Odyssey Through the Darwin Debates.","url":"https://spectator.org/the-lords-day-meet-darwin-day-and-shudder/"}
