{"authors":["Associated Press"],"date_download":"2018-10-23 00:38:19","date_modify":"2018-10-23 00:38:19","date_publish":"2016-01-29 13:49:58","description":"MELBOURNE, Australia (AP) — The Latest from the Australian Open on Friday (all times local): 12:15 a.m. (Saturday) Andy Murray and his older brother Jamie ha...","filename":"data/vaneerConsumption/TheLatestMurraybrothersmakeGrandSlamhistory.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:9556c5fd914147e7b1020ad2451b4c4e-3bmscybNe842cce83474b56429bf-514_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422114_The-Latest-The-price-success-Serena-Williams_1540255099.html","title":"The Latest: Murray brothers make Grand Slam history","title_page":"The Latest:  Murray brothers make Grand Slam history | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Murray brothers make Grand Slam history\nMELBOURNE, Australia (AP) — The Latest from the Australian Open on Friday (all times local):\n12:15 a.m. (Saturday)\nAndy Murray and his older brother Jamie have become the first brothers to reach the finals in both the singles and doubles championships at a Grand Slam tournament in the Open era.\nAndy Murray of Britain signs autographs after winning his semifinal match against Milos Raonic of Canada at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Rafiq Maqbool)\nAndy Murray said that their \"parents will be extremely proud. There's not many tennis players that come out of Scotland.\"\nThe No. 2-ranked Andy Murray, who has won two Grand Slam singles titles added, \"Hopefully he can get the win tomorrow.\"\nJamie Murray is playing with Bruno Soares against the team of Daniel Nestor and Radek Stepanek. Both teams are bidding to win their first Grand Slam doubles title together.\nAfter Andy Murray survived a grueling five-set semifinal against Milos Raonic, his brother tweeted: \"Phew! Couldn't go to sleep until that finished! Great performance and fight from\" Andy Murray.\nAndy Murray has played in four previous Australian Open finals and never won.\nHe faces No. 1 Novak Djokovic, who has won all five of his finals at Melbourne Park, including three over Andy Murray.\n___\n11:45 p.m.\nAndy Murray has advanced to his fifth Australian Open final with a 4-6, 7-5, 6-7 (4), 6-4, 6-2 win over Milos Raonic.\nMurray, who lost all four previous finals he has contested at Melbourne Park, will play Novak Djokovic in Sunday's championship decider.\nFive-time champion Djokovic has never lost a final here, including three wins over Murray.\nMurray broke Raonic's serve to open the fifth set, and when Raonic walked back to his chair, he angrily smashed his racket on the hard court surface twice, breaking it. Murray went on a run of winning 20 of 25 points to go ahead 4-0 and all but clinch the match.\nRaonic, who made 78 unforced errors in the match to Murray's 28, received treatment for an upper right leg ailment after the ninth game of the fourth set, and he seemed to hobble at times for the remainder of the 4-hour, 3-minute match.\n___\n11:10 p.m.\nAndy Murray has leveled his Australian Open semifinal with Milos Raonic by winning the fourth set 6-4.\nRaonic won the first set 6-4, Murray the second 7-5 and the Canadian won the third set 7-6 (4).\nIn the fourth set, Murray broke Raonic's serve at love in the seventh game, saved one break point in the next game and then two in the 10th.\nThe match has been going for nearly 3 1/2 hours.\nRaonic received treatment for an upper right leg ailment after the ninth game of the fourth set.\nThe winner will face top-seeded and five-time champion Novak Djokovic in Sunday's championship match at Rod Laver Arena.\nMurray has advanced to the final four times here, but lost each time.\n___\n10:15 p.m.\nMilos Raonic has won a third-set tiebreaker 7-6 (4) and leads by two sets to one in his Australian Open semifinal against Andy Murray.\nMurray, a four-time losing finalist at Melbourne Park, won the second set 7-5 after Raonic took the first 6-4.\nRaonic took a 5-2 lead in the tiebreaker, allowed Murray to close to 5-4 before winning the final two points on a Murray error into the net and an ace.\nThe winner will face five-time champion Novak Djokovic in Sunday's final.\n___\n9:45 p.m.\nRod Laver wants some company in the Grand Slam group, and thinks it could be Novak Djokovic.\nRoger Federer and Rafael Nadal each had seasons when they won three of the four major titles, but couldn't complete the calendar-year Grand Slam. Djokovic's only loss in a major last year was in the final of the French Open. He's a five-time champion in Australia and has already secured his place in the final, where the pursuit of the season Grand Slam must begin.\nLaver, who twice completed calendar-year Grand Slams, says it's good for the sport if somebody else can achieve it.\nThe Australian great says \"This is not a club that I'm a member of — it's an open course. I think someone like Novak is well on his way to trying to accomplish that.\"\n___\n9:20 p.m.\nAndy Murray has leveled his Australian Open semifinal with Milos Raonic, winning the second set 7-5 after Raonic won the first 6-4.\nMurray broke Raonic's service in the last game after setting up set point with a crosscourt forehand winner and sealing it when the Canadian netted a backhand.\nRaonic won the first set on his second set point when he challenged an out call on his serve, and replays showed to have hit most of the line.\nMurray is trying to advance to the final at Melbourne Park for the fifth time — he's lost all four previous matches. Raonic is aiming to advance to his first Grand Slam final after losing in the semifinal at Wimbledon in 2014 in his only previous final-four match.\nThe winner will face top-seeded and five-time champion Novak Djokovic in Sunday's final.\n___\n8:20 p.m.\nMilos Raonic broke Andy Murray's serve at love in the opening game and went on to win the first set of their Australian Open semifinal 6-4 on Friday.\nDay-long rain at Melbourne Park subsided before the match began, allowing the roof to be open on Rod Laver Arena.\nRaonic won the first set on his second set point when he challenged an out call on his serve, and replays showed to have hit most of the line.\nMurray is trying to advance to the final at Melbourne Park for the fifth time — he's lost all four previous matches. Raonic is aiming to advance to his first Grand Slam final after losing in the semifinal at Wimbledon in 2014 in his only previous final-four match.\nThe winner will face top-seeded and five-time champion Novak Djokovic in Sunday's final. He beat Roger Federer in four sets on Thursday.\n___\n7:10 p.m.\nTennis Australia, Roger Federer's management firm and a Brazilian businessman have combined to establish the Laver Cup, a Ryder Cup-style team event expected to pit the top players from Europe against the best players from the rest of the world.\nThe first event over three days is expected to be staged in 2017 and continue every September except in Olympic years. The venue will not be fixed.\nOn the current rankings, Europe has nine of the top 10 players — with Kei Nishikori of Japan breaking it up at No. 7.\nLaver, the Australian great who twice won the calendar-year Grand Slam, said he was honored to put his name to the new competition and didn't think it would detract from the existing Davis Cup international men's team tournament.\n\"The Davis Cup format was country to country — this is Europe against the rest of the world,\" he said. \"Hopefully, the best players will want to participate.\"\nJorge Paulo Lemann is the Brazilian businessman behind the venture. He formerly played Davis Cup for Brazil and Switzerland.\n___\n6:30 p.m.\nThe No. 1-ranked team of Martina Hingis and Sania Mirza have won the Australian Open doubles title, beating the Czech pair of Andrea Hlavackova and Lucie Hradecka 7-6 (1), 6-3 to extend their winning streak to 36 matches on the way to a third Grand Slam title together.\nHingis, a three-time singles champion at the Australian Open, and Mirza dominated the first-set tiebreaker preceded by eight service breaks, four by each team.\nThe winners added to their Wimbledon and U.S. Open titles last year and the pair also won the Brisbane International title three weeks ago. They started playing together at Indian Wells last year.\nHingis is now a four-time doubles champion at the Australian Open. Mirza, who won the 2009 mixed doubles title with fellow Indian player Mahesh Bhupathi, played a later semifinal Friday in mixed doubles with Ivan Dodig of Croatia.\nHlavackova and Hradecka are now 2-3 in Grand Slam doubles finals. They won major doubles titles at the 2011 French Open and 2013 U.S. Open.\n___\n4:20 p.m.\nAmerican Coco Vandeweghe and Horia Tecau of Romania have advanced to Sunday's mixed doubles final at Melbourne Park with a 6-4, 6-4 win over Slovenian Andreja Klepac and Treat Huey of the Philippines.\nVandeweghe and Tecau will play either Sania Mirza of India and Ivan Dodig of Croatia or Russian Elena Vesnina and Bruno Soares of Brazil, who play their semifinal later Friday.\nIt'll be a busy day for Mirza, who is teaming with Martina Hingis in the women's doubles final to follow on Rod Laver Arena. They'll play the Czech pair of Andrea Hlavackova and Lucie Hradecka for the championship.\nSoares is also teamed with Jamie Murray of Britain in the men's doubles final on Saturday.\n___\n3:50 p.m.\nAngelique Kerber checked her phone and confirms she received a text message from Steffi Graf ahead of the Australian Open final against Serena Williams on Saturday.\nKerber summed up the message on Friday: \"She told me, 'Congrats,' and she is happy for me and good luck in the finals.\"\nAfter winning her semifinal Thursday, Kerber was asked during her on-court interview if she would seek the advice of Graf, who was the last German woman to win the Australian title, on how to beat Serena.\nKerber responded with a laugh and said, \"Steffi, write me please.\"\nWilliams has won 21 majors and is trying to match Graf's record of 22 titles in the Open era, which started in 1968.\n___\n1:55 p.m.\nSerena Williams, who plays Angelique Kerber in the women's final at the Australian Open on Saturday, says the price of fame means she doesn't get out much, but she'll take that scenario as long as she's at the top of the women's game.\nAt her pre-championship news conference on Friday, Williams was asked whether it bothers her that she's forced to stay in her hotel or house and not be able to wander the streets of Melbourne as she attempts to win her seventh title here.\nWilliams says \"yeah, definitely ... I don't really leave my house so much, even in Florida or L.A. or Paris. I kind of just stay at home a lot.\"\nShe adds: \"It will go away soon. But for now, I'd rather have this than something else because it means I'm doing well.\"\nWilliams has not dropped a set this year in six matches after winning three of four Grand Slam titles last year. She'll try to win her seventh final in seven attempts at Melbourne Park on Saturday.\n___\n1:20 p.m.\nAndy Murray and Milos Raonic are set to meet in a men's semifinal for the right to play five-time champion Novak Djokovic in an Australian Open men's final.\nThe roof was closed over Rod Laver Arena early Friday afternoon with rain showers in the area, but those were expected to clear in time to have an open stadium for the night match.\nDjokovic, who has won all five finals he's played at Melbourne Park, beat Roger Federer in four sets Thursday to advance to Sunday's championship decider.\nThe first final of 2016 will be played on Friday afternoon — the women's doubles championship between the No. 1-ranked team of Martina Hingis and Sania Mirza play Andrea Hlavackova and Lucie Hradecka.\nAndy Murray of Britain celebrates after winning a point against Milos Raonic of Canada during their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Vincent Thian)\nMilos Raonic of Canada plays a forehand return to Andy Murray of Britain during their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Aaron Favila)\nAndy Murray of Britain yells during his semifinal match against Milos Raonic of Canada at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Rafiq Maqbool)\nCraig Tiley, Tennis Australia CEO and Australian Open Tournament Director and former player Rod Laver, left, answer questions at a press conference at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016. Tennis Australia, Roger Federer's management firm and a Brazilian businessman have combined to establish the Laver Cup, a Ryder Cup-style team event expected to pit the top players from Europe against the best players from the rest of the world. The first event over three days is expected to be staged in 2017 and continue every September except in Olympic years. The venue will not be fixed.(AP Photo/Vincent Thian)\nSania Mirza, right, of India embraces her partner Martina Hingis of Switzerland as they watch a replay on a disputed line call during their match against Czech Republic¿s Andrea Hlavackova and Lucie Hradecka in the women's doubles final at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Rafiq Maqbool)\nAngelique Kerber of Germany speaks during a press conference, ahead of Saturday's women's singles final against Serena Williams of the United States at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Shuji Kajiyama)","url":"https://www.dailymail.co.uk/wires/ap/article-3422114/The-Latest-The-price-success-Serena-Williams.html"}
