{"authors":["Associated Press"],"date_download":"2018-10-23 05:24:57","date_modify":"2018-10-23 05:24:57","date_publish":"2017-03-16 16:24:16","description":"The Latest on the NCAA Tournament (all times EDT):12:55 a.m.It's been 20 years since a Pac-12 team won the national championship, and Arizona is out to match...","filename":"data/vaneerConsumption/TheLatestArizonatakes1ststepbeatsNorthDakota.json","image_url":"https://i.dailymail.co.uk/1/2017/03/17/05/wire-232413-1489727374-264_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320968_The-Latest-Whats-ahead-NCAA-Tournament_1540272297.html","title":"The Latest: Arizona takes 1st step, beats North Dakota","title_page":"The Latest: Arizona takes 1st step, beats North Dakota | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest on the NCAA Tournament (all times EDT):\n12:55 a.m.\nIt's been 20 years since a Pac-12 team won the national championship, and Arizona is out to match what the 1997 Wildcats pulled off.\nArizona guard Kadeem Allen lays the ball up during the second half against North Dakota in a first-round game in the NCAA men's college basketball tournament Thursday, March 16, 2017, in Salt Lake City. Arizona won 100-82. (AP Photo/Rick Bowmer)\nThey're off on the right foot, beating North Dakota 100-82 in the final game of a day that saw two teams make their NCAA Tournament debuts.\nNorthwestern's inaugural visit ended in a stunning victory over Vanderbilt. Vandy's Matthew Fisher-Davis inexplicably grabbed Wildcats guard Bryant McIntosh on purpose in the waning seconds of their game, thinking the Commodores were behind when they were actually ahead. That sent McIntosh to the free throw line for the go-ahead points with 15 seconds left.\nNorth Dakota was the other newcomer, but the Arizona juggernaut proved too much.\nTop seeds Villanova and Gonzaga also moved on.\nThere were two bracket upsets: No. 11 seed Xavier over No. 6 seed Maryland and No. 12 seed Middle Tennessee State beating No. 5 seed Minnesota.\nMiddle Tennessee was the betting favorite in Las Vegas.\n12:20 a.m.\nTournament-tested Wisconsin is moving on, and so are Florida State and Iowa State.\nBronson Koenig made a school record eight 3-pointers and scored 28 points and Nigel Hayes added 16 to lead the Badgers past Virginia Tech 84-74.\nThe eighth-seeded Badgers made all the big plays in the closing minutes to set up a meeting with top-seeded Villanova on Saturday.\nThe Seminoles held off a spirited effort by Florida Gulf Coast, which lost defensive standout Demetris Morant to an ankle injury early in the second half before falling 86-80. Dwayne Bacon led FSU with 25 points and nine rebounds.\nMonte Morris had 19 points, eight rebounds and eight assists, and Iowa State outlasted Nevada 84-73 to advance to the second round for the second straight year.\n___\n11:40 p.m.\nIowa State and Nevada are getting in each other's faces in the second half, with a double technical and a lot of trash talking.\nIowa State is threatening to pull away late. The Cyclones lead 69-59 with less than 5 minutes left.\nNevada got close early in the second half, trying to become just the latest No. 12 seed to take down a 5.\n___\n11:35 p.m.\nDemetris Morant is back on the Florida Gulf Coast bench with a walking boot on his right foot/ankle and using crutches.\nMorant had to be helped off the court with 17:19 remaining in the second half against third-seeded Florida State in Orlando, Florida.\nMorant was injured while fouling Terance Mann. The Seminoles lead the 14th-seeded Eagles 74-63 late in the second half.\n11:20 p.m.\nArizona has the first half high score for Thursday, putting up 53 points against No. 15 seed North Dakota in the opening 20 minutes. The Wildcats lead 53-37.\nIt's the best offensive first half this season for the Pac-12 regular season and tournament champions. The Wildcats came into the NCAA Tournament as one of the hottest teams in college basketball.\nArizona shot 61 percent for the half.\n___\n10:55 p.m.\nForward Demetris Morant has left Florida Gulf Coast's NCAA Tournament game with a right leg injury.\nMorant had to be helped off the court with 17:19 remaining in the second half against third-seeded Florida State in Orlando, Florida. Morant was injured while fouling Terance Mann on a play. He was initially taken to the bench and then helped by two teammates to the locker room.\nThe Seminoles led the 14th-seeded Eagles 47-40 at the time.\nMorant had five points and five rebounds.\n___\n10:35 p.m.\nDwayne Bacon might be saving Florida State's, well, bacon.\nBacon has 16 points on 8-of-10 shooting, carrying the third-seeded Seminoles to a 40-36 halftime lead against No. 14 seed Florida Gulf Coast in Orlando, Florida.\nBacon scored on a tomahawk dunk, a nifty, up-and-under move and another layup in the final 2 minutes, helping FSU build a late lead.\nBrandon Goodwin has 14 points to pace the Eagles.\n___\n9:40 p.m.\nThe upset by No. 11 seed Xavier over No. 6 seed Maryland is one many people saw coming - about 43 percent of people who filled out brackets on Yahoo and ESPN picked the lower seed to win.\nMany gamblers preferred the Musketeers, too. Nevada sports book William Hill says 54 percent of bets were placed on Xavier, and 58 percent of the money wagered backed the 2-point underdog.\nTrevon Bluiett scored 21 points and Sean O'Mara had 18 to help No. 11 seed Xavier upset sixth-seeded Maryland 76-65 during the first round of the NCAA Tournament on Thursday night.\n___\n9:25 p.m.\nUCLA could be without reserve forward Ike Anigbogu for its NCAA Tournament opener against Kent State due to a sprained foot.\nUCLA coach Steve Alford said Anigbogu injured the foot during practice on Tuesday and would be a game-time decision on Friday.\nA 6-foot-10 freshman, Anigbogu has provided the third-seeded Bruins with energy and a defensive presence off the bench, averaging 4.9 points and 4.3 rebounds per game.\nUCLA has played mostly with an eight-man rotation, so Alford said he might go with more four-guard lineups until he's back.\nAlford said forward TJ Leaf (ankle) and point guard Lonzo Ball (thumb) are both close to 100 percent and will play.\n___\n8:55 p.m.\nUCLA coach Steve Alford is focused on the NCAA Tournament, not what job is open - even if it is at Indiana.\nAlford played four seasons in Bloomington and led the Hoosiers to the 1987 NCAA title, so his name was one of the first to come up when Indiana coach Tom Crean was fired on Thursday.\n\"I love UCLA. I love Los Angeles. You're talking about arguably the greatest 'brand' anywhere on the planet, and we got things going at a very high level now and we're very excited about it,\" Alford said before the Bruins' NCAA Tournament game against Kent State. \"We're excited about being in this tournament and seeing what we can do in this tournament.\"\nAlford played at Indiana from 1983-87 and left as the school's all-time leading scorer, steals and 3-point shooting. After a brief stint in the NBA, he went into coaching, making stops at Southwest Missouri State, Iowa and New Mexico before becoming UCLA's coach in 2013.\nAlford was thought to be on the hot seat heading into this season after the Bruins failed to make the NCAA Tournament a year ago, but has turned the program around with a strong recruiting class headed by point guard Lonzo Ball.\nUCLA enters the NCAA Tournament 29-4 and expected to make a deep run into March.\n___\n8:45 p.m.\nUPSET ALERT: No. 11 seed Xavier, no stranger to pulling off upsets in the NCAA Tournament, leads sixth-seeded Maryland 65-58 with less than 4 minutes to play in Orlando, Florida.\nIt would be a huge victory for the Musketeers, who are without second-leading scorer Edmond Sumner and lost seven of 10 entering the tournament.\nXavier is playing in its fourth consecutive NCAA Tournament and is 23-20 in NCAA play since 1990.\n- Mark Long reporting from Orlando, Florida.\n___\n8:40 p.m.\nDefending champion and top overall seed Villanova has opened the second half on a 21-6 run after playing from behind for much of the first half to No. 16 seed Mount Saint Mary's.\nThe Wildcats are up by 13 points with 9 minutes left in the game.\n___\n8:20 p.m.\nVermont senior Kurt Steidl has left the Catamounts' game against Purdue with a left leg injury.\nSteidl went down after he jumped out to defend a 3-point attempt with about two minutes left in the first half. A trainer worked on his leg for a short while before the swingman was helped to the locker room, walking on his own, but with a pronounced limp.\nVermont trailed No. 4 seed Purdue 37-36 at halftime.\n- Jay Cohen reporting from Milwaukee\n___\n8:05 p.m.\nVillanova, the top-seeded team in this year's NCAA Tournament, is in some trouble at halftime.\nThe Wildcats have been outplayed by No. 16 seed Mount St. Mary's and only lead 30-29 after 20 minutes. The Mountaineers jumped to a 10-2 lead and are going to sneaker to sneaker with the defending NCAA champions, who are attempting to be the first school to win consecutive titles since Florida in 2007.\nVillanova missed its first eight shots and didn't take the lead until Eric Paschall powered in a dunk with 2:33 left in the half.\nSince the NCAA introduced seeding in 1985, no top seed has ever lost to a No. 16 seed, a record of 129-0.\n- Tom Withers reporting from Buffalo.\n___\n7:25 p.m.\nActor Bill Murray made the trip to Orlando to support Xavier and his son, Luke, who is an assistant for the team.\nMurray sat in the first row in the Musketeers section, but was mostly subdued during the first half.\nMurray is a huge sports fan, notably rooting for Chicago's pro sports teams. He was in attendance throughout the Cubs' postseason run, and was in Cleveland for the Game 7 World Series win.\nLuke Murray is in his second season on Chris Mack's staff at Xavier. Murray spent the previous two years at Rhode Island. He also has spent time at Towson, Wagner and Arizona.\n___\n7:20 p.m.\nVillanova has looked shaky in the opening minutes of its opener. The top-seeded Wildcats, attempting to become the first team to win consecutive titles since 2007, have missed their first eight shots, committed two turnovers and had three shots blocked by Mount St. Mary's in the opening five minutes.\n___\n7:13 p.m.\nIn a classy gesture, Villanova coach Jay Wright went into Bucknell's locker room following the school's loss to West Virginia to congratulate the Bison on their season.\nWright played at Bucknell and graduated from the school in 1983.\nNot long after the visit, Wright and the Wildcats began defense of their NCAA title with a matchup against No. 16 Mount St. Mary's.\n- Tom Withers reporting from Buffalo.\n___\n5:40 p.m.\nCinderella has taken the afternoon off at the NCAA Tournament.\nWhile that might be good for your bracket, maybe not so much in the drama department for March Madness.\nWhen fourth-seeded Florida polished off 13th seeded East Tennessee State as dinner time on the East Coast approached, the higher-seeded teams improved to 6-0 on the opening day of the tournament.\nThe closest call so far came in Buffalo, where 12th-seeded Princeton took fifth-seeded Notre Dame to the final buzzer before falling 60-58.\nAn upset on the brackets is brewing with No. 12 seed Middle Tennessee State up by double digits against No. 5 seed Minnesota, but Las Vegas casinos actually favored Middle Tennessee State.\n___\n5:35 p.m.\nMinnesota big man Reggie Lynch returned to the bench after picking up third foul with 18:51 left in the second half of the Golden Gophers' first-round game against Middle Tennessee.\nLynch is the Big Ten's defensive player of the year. But he played just 9 minutes in the first half because of foul trouble.\nThe Blue Raiders found more room to maneuver in the lane in the second half again when Lynch went to the bench, building a 14-point lead with 15:31 to go.\nOne Minnesota fan yelled from the crowd, 'What are you doing?\" after Lynch picked up his third foul. Coach Richard Pitino also shot Lynch a look of disbelief and a few choice words when Lynch picked up his third foul.\n___\n5:08 p.m.\nMinnesota has a new unofficial assistant coach on its bench.\nSenior Akeem Springs is out for the NCAA Tournament after tearing his right Achilles during the Big Ten tourney last week. Springs said earlier this week that he would join his teammates on the bench wearing a suit, and that's exactly what he did when the fifth-seeded Golden Gophers faced 12th-seedeed Middle Tennessee in first-round action.\nSprings sported a pink tie and had a black walking boot over his right foot. He's sure to have his voice heard in the locker room with Minnesota trailing 37-31 at halftime.\n___\nFor more AP college basketball coverage: http://collegebasketball.ap.org and http://twitter.com/AP_Top25\nWisconsin guard Bronson Koenig (24) drives to the basket against Virginia Tech forward Zach LeDay (32) during the first half of a first-round men's college basketball game in the NCAA Tournament, Thursday, March 16, 2017, in Buffalo, N.Y. (AP Photo/Bill Wippert)\nNevada's Cameron Oliver (0) rejects a shot by Iowa State's Matt Thomas (21) during the second half of an NCAA college basketball tournament first-round game Thursday, March 16, 2017, in Milwaukee. (AP Photo/Morry Gash)\nArizona guard Rawle Alkins shouts after his dunk during the first half against North Dakota in an NCAA men's college basketball tournament first-round game Thursday, March 16, 2017, in Salt Lake City. (AP Photo/George Frey)\nFlorida State guard Dwayne Bacon goes up for a shot during the first half of the first round of the NCAA college basketball tournament against Florida Gulf Coast, Thursday, March 16, 2017 in Orlando, Fla. (AP Photo/Gary McCullough)\nXavier forward Sean O'Mara (54) dunks the ball against Maryland forward Damonte Dodd (35) during the first half of the first round of the NCAA college basketball tournament, Thursday, March 16, 2017 in Orlando, Fla. (AP Photo/Gary McCullough)\nVermont's Kurt Steidl drives past Purdue's Dakota Mathias during the first half of an NCAA college basketball tournament first round game Thursday, March 16, 2017, in Milwaukee. (AP Photo/Kiichiro Sato)\nMount St. Mary's Mountaineers guard Elijah Long (55) drives to the basket against Villanova Wildcats guard Jalen Brunson (1) and guard Donte DiVincenzo (10) during the first half of a first-round men's college basketball game in the NCAA Tournament, Thursday, March 16, 2017, in Buffalo, N.Y. (AP Photo/Bill Wippert)\nBucknell center Nate Sestina, left, and guard John Azzinaro, right, react during the second half of a first-round men's college basketball game against West Virginia in the NCAA Tournament, Thursday, March 16, 2017, in Buffalo, N.Y. West Virginia won, 86-80. (AP Photo/Bill Wippert)\nFormer Florida football coach Steve Spurrier, center claps during team introductions before the start of a game between Florida and East Tennessee State in the first round of the NCAA college basketball tournament, Thursday, March 16, 2017 in Orlando, Fla. (AP Photo/Wilfredo Lee)\nSouth Dakota State guard Michael Orris (50) goes to the basket as Gonzaga guard Josh Perkins (13) defends during the first half of a first-round men's college basketball game in the NCAA Tournament Thursday, March 16, 2017, in Salt Lake City. (AP Photo/Rick Bowmer)","url":"https://www.dailymail.co.uk/wires/ap/article-4320968/The-Latest-Whats-ahead-NCAA-Tournament.html"}
