{"authors":["Associated Press"],"date_download":"2018-10-22 23:26:22","date_modify":"2018-10-22 23:26:22","date_publish":"2017-03-10 02:59:07","description":"SEOUL, South Korea (AP) - The Latest on South Korean President Park Geun-hye's removal from office Friday by the Constitutional Court (all times local):11:55...","filename":"data/vaneerConsumption/TheLatestUSsaysParksremovalwontchangerelations.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/03/wire-193677-1489115052-262_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4299856_The-Latest-US-says-Parks-removal-wont-change-relations_1540250782.html","title":"The Latest: US says Park's removal won't change relations","title_page":"The Latest: US says Park's removal won't change relations | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SEOUL, South Korea (AP) - The Latest on South Korean President Park Geun-hye's removal from office Friday by the Constitutional Court (all times local):\n11:55 a.m.\nThe United States says the removal of South Korean President Park Geun-hye is a domestic issue that doesn't affect its strong alliance with the country.\nFILE - In this Jan. 1, 2017, file photo provided by the South Korean Presidential House, impeached South Korean President Park Geun-hye, center, listens to a reporter's question during a meeting with a selected group of reporters at the presidential house in Seoul, South Korea. In a historic ruling Friday, March 10, 2017, South Korea's Constitutional Court formally removed impeached President Park Geun-hye from office over a corruption scandal that has plunged the country into political turmoil, worsened an already-serious national divide and led to calls for sweeping reforms. (South Korean Presidential House via AP, File)\nThe Constitutional Court formally removed the impeached Park from office Friday over a corruption scandal.\nState Department spokesman Mark Toner says the U.S. will continue to work with the acting president, Prime Minister Hwang Kyo-ahn, and looks forward to whomever South Koreans choose in a presidential election to be held within two months.\nToner says Park's removal is \"a domestic issue on which the United States takes no position,\" and that it's up to the South Korean people to determine their country's future.\nHe says the two nations' alliance \"will continue to be a linchpin of regional stability and security.\"\nA protester wearing a mask, attends during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. People gathered Friday ahead of a court ruling on whether impeached Park will be removed from office over a corruption scandal or allowed to complete her term. The letters read \"Arrest Park Geun-hye.\" (AP Photo/Lee Jin-man)\nFILE - In this Nov. 29, 2016, file photo, South Korean President Park Geun-hye makes a live televised address in Seoul, South Korea. South Korea's Constitutional Court rules to formally end impeached President Park's rule. (Pool Photo via AP, File)\nProtesters shout slogans during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. Sensing history, hundreds of people gathered Friday ahead of a court ruling on whether impeached South Korean President Park will be removed from office over a corruption scandal or allowed to complete her term. The letters read \"Impeachment, Park Geun-hye.\" (AP Photo/Lee Jin-man)\nProtesters shout slogans during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. Sensing history, hundreds of people gathered Friday ahead of a court ruling on whether impeached South Korean President Park will be removed from office over a corruption scandal or allowed to complete her term. The letters read \"Impeachment, Park Geun-hye.\" (AP Photo/Lee Jin-man)\nSupporters of South Korean President Park Geun-hye wave national flags during a rally opposing her impeachment near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. People gathered Friday ahead of a court ruling on whether impeached Park will be removed from office over a corruption scandal or allowed to complete her term. (AP Photo/Ahn Young-joon)\nSupporters of South Korean President Park Geun-hye shout slogans during a rally opposing her impeachment near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. People gathered Friday ahead of a court ruling on whether impeached South Korean President Park will be removed from office over a corruption scandal or allowed to complete her term. (AP Photo/Ahn Young-joon)\nSupporters of South Korean President Park Geun-hye wave national flags during a rally opposing her impeachment near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. People gathered Friday ahead of a court ruling on whether impeached Park will be removed from office over a corruption scandal or allowed to complete her term. (AP Photo/Ahn Young-joon)\nProtesters shout slogans during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. People gathered Friday ahead of a court ruling on whether impeached Park will be removed from office over a corruption scandal or allowed to complete her term. The letters read \"Impeachment.\" (AP Photo/Lee Jin-man)\nSupporters of South Korean President Park Geun-hye stage a rally opposing her impeachment near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. People gathered Friday ahead of a court ruling on whether impeached Park will be removed from office over a corruption scandal or allowed to complete her term. The sign reads \" South Koran President Park Geun-hye.\" (AP Photo/Ahn Young-joon)\nProtesters shout slogans during a rally calling for impeachment of President Park Geun-hye near the Constitutional Court in Seoul, South Korea, Friday, March 10, 2017. People gathered Friday ahead of a court ruling on whether impeached Park will be removed from office over a corruption scandal or allowed to complete her term. The letters read \"Impeachment, Park Geun-hye.\" (AP Photo/Lee Jin-man)","url":"https://www.dailymail.co.uk/wires/ap/article-4299856/The-Latest-US-says-Parks-removal-wont-change-relations.html"}
