{"authors":["Associated Press"],"date_download":"2018-10-23 03:35:43","date_modify":"2018-10-23 03:35:43","date_publish":"2017-04-26 15:00:52","description":"AMIENS, France (AP) - The Latest on the French presidential runoff on May 7 (all times local):8:30 p.m.Former French President Nicolas Sarkozy says he will...","filename":"data/vaneerConsumption/TheLatestSarkozytovoteforMacroninFrenchrunoff.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/19/wire-467245-1493232065-644_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447912_The-Latest-Frances-Le-Pen-upstages-rival-Macron-factory_1540265743.html","title":"The Latest: Sarkozy to vote for Macron in French runoff","title_page":"The Latest: Sarkozy to vote for Macron in French runoff | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"AMIENS, France (AP) - The Latest on the French presidential runoff on May 7 (all times local):\n8:30 p.m.\nFormer French President Nicolas Sarkozy says he will vote for centrist candidate Emmanuel Macron in France's May 7 presidential runoff because the platform of far-right leader Marine Le Pen would bring about \"very serious consequences\" for the country.\nFar-right French presidential candidate Marine Le Pen, left, is greeted by workers outside a whirlpool home appliance factory in Amiens, France, Wednesday April 26, 2017. While her centrist presidential opponent Macron was meeting with union leaders from the Whirlpool plant in northern France, Le Pen popped up outside the factory itself, amid its workers and declared herself the candidate of France's workers.(AP Photo)\nSarkozy retired from active political life after failing to win the conservative presidential candidacy in a November primary, but is still seen as a key player.\nSarkozy insisted in a Facebook post that his stance for Macron is a \"choice of responsibility\" and \"not in any way support\" for his project.\nHe said he decided to take a stand \"in view of the extraordinary situation we're facing.\"\n___\n7:30 p.m.\nFar-right presidential contender Marine Le Pen has rebranded herself with a new slogan - \"Choose France\" - before the May 7 runoff balloting to embrace a wider swath of voters and boost her chances for victory.\nA new poster showing the populist Le Pen in a presidential pose aptly describes the image dual with her rival, independent centrist Emmanuel Macron. Le Pen made a surprise visit to a Whirlpool factory in northern France as Macron met in town with union leaders. The factory is doomed to closure in favor of cheaper labor in Poland.\nCampaign director David Rachline said the \"protective France\" of the anti-globalization candidate represented by the slogan stands in contrast to the \"fratricidal and inhuman project\" of Macron, a former economy minister and banker.\n\"Choose France\" replaces \"Put France back in Order\" and \"In the Name of the People.\"\n___\n4:10 p.m.\nFrench presidential candidate Emmanuel Macron is defending his campaign platform in a heated impromptu meeting outside a factory with workers who face losing their jobs to a plant in Poland.\nIn chaotic scenes broadcast live on French TV, the centrist, pro-European Union former finance minister is telling workers outside the Whirlpool factory in northern France that he wouldn't ban job losses if he is elected president on May 7. Macron says \"I won't lie to you.\"\nMacron is defending his plans for more retraining of workers struggling with France's chronic unemployment. He also shot down the plans of this far-right opponent - Marine Le Pen - to re-establish French borders.\nMacron and Le Pen face off May 7 in the French presidential runoff.\n__\n1:30 p.m.\nFar-right French presidential candidate Marine Le Pen has upstaged her centrist opponent Emmanuel Macron. She has made a surprise campaign stop to a home appliance factory that's the latest hot-button symbol of French job losses to plants overseas.\nAs Macron was meeting with union leaders from the Whirlpool plant in northern France, Le Pen popped up outside the factory itself. Standing amid its workers in yellow hazard vests, she declared herself the candidate of France's workers.\nThe wily campaign maneuver, which French television news channel BFM broadcast live, had the immediate effect of stealing Macron's thunder.\nThe two face off in France's presidential runoff on May 7.\n___\n10 a.m.\nFrench presidential front-runner Emmanuel Macron is going hunting for blue-collar votes, planning to meet with workers from a home appliance factory that is the latest hot-button symbol of the loss of French jobs to plants overseas.\nMacron's discussions with union leaders from the Whirlpool plant in northern France, a region where his anti-European Union opponent Marine Le Pen got the most votes, is not without risk. The pro-EU centrist must walk a fine line between defending his program to tackle France's chronic unemployment without falling into the trap that befell winners in previous elections of struggling to keep campaign promises.\nLe Pen, needing millions more votes to beat Macron on May 7, has vowed to keep the Amiens plant open if elected, come what may.\nA man walks past electoral posters of French centrist presidential candidate Emmanuel Macron, right, and far-right candidate Marine Le Pen in Saint Jean de Luz, southwestern France, Wednesday, April 26, 2017. (AP Photo/Bob Edme)\nFrench presidential election candidate Emmanuel Macron, right, listens to union representatives from the Whirlpool plant next to National Assembly member Barbara Pompili, center, at the Chamber of Commerce and Industry in Amiens, northern France, Wednesday April 26, 2017. Man at left is unidentified. (Eric Feferberg, Pool via AP)\nFrench presidential election candidate Emmanuel Macron, center, listens to union representatives from the Whirlpool plant next to National Assembly member Barbara Pompili, left,, at the Chamber of Commerce and Industry in Amiens, northern France, Wednesday April 26, 2017. Man at right is unidentified. (Eric Feferberg, Pool via AP)\nFrench presidential election candidate Emmanuel Macron, second right sitting, talks with union representatives from Whirlpool plant next to National Assembly member Barbara Pompili, third right, at the Chamber of Commerce and Industry in Amiens, northern France, Wednesday April 26, 2017. (Eric Feferberg, Pool via AP)\nFrench presidential election candidate Emmanuel Macron, third left sitting, talks with union representatives from Whirlpool plant next to National Assembly member Barbara Pompili, second left, at the Chamber of Commerce and Industry in Amiens, northern France, Wednesday April 26, 2017. (Eric Feferberg, Pool via AP)\nMembers of National Front party unveil the new campaign poster and slogan of the far-right presidential candidate Marine Le Pen in Paris, France, Wednesday, April 26, 2017. Anti-European French presidential candidate Marine Le Pen upstaged her centrist opponent Emmanuel Macron by making a surprise campaign stop Wednesday to a home appliance factory that is the latest hot-button symbol of French job losses to plants overseas. (AP Photo/Michel Euler)\nA man walks past electoral posters of French centrist presidential candidate Emmanuel Macron, right, and far-right candidate Marine Le Pen in Saint Jean de Luz, southwestern France, Wednesday, April 26, 2017. (AP Photo/Bob Edme)\nA woman walks past electoral posters of French centrist presidential candidate Emmanuel Macron, right, and far-right candidate Marine Le Pen in Saint Jean de Luz, southwestern France, Wednesday, April 26, 2017. (AP Photo/Bob Edme)\nJournalists cast shadows on the new campaign poster and slogan of the far-right presidential candidate Marine Le Pen during a presentation in Paris, France, Wednesday, April 26, 2017. Anti-European French presidential candidate Marine Le Pen upstaged her centrist opponent Emmanuel Macron by making a surprise campaign stop Wednesday to a home appliance factory that is the latest hot-button symbol of French job losses to plants overseas. (AP Photo/Michel Euler)\nFrench presidential election candidate Emmanuel Macron, right sitting, gestures towards to union representatives from the Whirlpool plant next to National Assembly member Barbara Pompili, second right, at the Chamber of Commerce and Industry in Amiens, northern France, Wednesday April 26, 2017. Man at right is unidentified. (Eric Feferberg, Pool via AP)\nJournalists cast shadows on the new campaign poster and slogan of the far-right presidential candidate Marine Le Pen during a presentation in Paris, France, Wednesday, April 26, 2017. Anti-European French presidential candidate Marine Le Pen upstaged her centrist opponent Emmanuel Macron by making a surprise campaign stop Wednesday to a home appliance factory that is the latest hot-button symbol of French job losses to plants overseas. (AP Photo/Michel Euler)\nMembers of National Front party take cellphone photos during a presentation of the new campaign poster and slogan of the far-right presidential candidate Marine Le Pen in Paris, France, Wednesday, April 26, 2017. Anti-European French presidential candidate Marine Le Pen upstaged her centrist opponent Emmanuel Macron by making a surprise campaign stop Wednesday to a home appliance factory that is the latest hot-button symbol of French job losses to plants overseas. (AP Photo/Michel Euler)\nThe new campaign poster and slogan of the far-right presidential candidate Marine Le Pen is pictured druing a presentation in Paris, France, Wednesday, April 26, 2017. Anti-European French presidential candidate Marine Le Pen upstaged her centrist opponent Emmanuel Macron by making a surprise campaign stop Wednesday to a home appliance factory that is the latest hot-button symbol of French job losses to plants overseas. Poster reads, \"choose France\". (AP Photo/Michel Euler)\nFar-right French presidential candidate Marine Le Pen is greeted by workers outside a whirlpool home appliance factory in Amiens, France, Wednesday April 26, 2017. While her centrist presidential opponent Macron was meeting with union leaders from the Whirlpool plant in northern France, Le Pen popped up outside the factory itself, amid its workers and declared herself the candidate of France's workers.(AP Photo)","url":"https://www.dailymail.co.uk/wires/ap/article-4447912/The-Latest-Frances-Le-Pen-upstages-rival-Macron-factory.html"}
