{"authors":["Associated Press"],"date_download":"2018-10-23 03:24:47","date_modify":"2018-10-23 03:24:47","date_publish":"2016-01-28 18:50:27","description":"MARIETTA, Ga. (AP) — The Latest on a highway shooting that left a Georgia State Patrol trooper wounded and the suspect dead. (all times local): 1:30 p.m. Sta...","filename":"data/vaneerConsumption/TheLatestOfficerscreamstrooperdowninradiocalls.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:c25b62a6f2c54959be0c40860406a9b6-2vdWmEltwXfba0ce28e632bbad03-726_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420880_The-Latest-Semis-left-I-75-trooper-shot_1540265087.html","title":"The Latest: Officer screams 'trooper down!' in radio calls","title_page":"The Latest: Officer screams 'trooper down!' in radio calls | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Officer screams 'trooper down!' in radio calls\nMARIETTA, Ga. (AP) — The Latest on a highway shooting that left a Georgia State Patrol trooper wounded and the suspect dead. (all times local):\n1:30 p.m.\nState troopers scream \"Shots fired! Shots fired!\" in frantic radio calls at the end of a high-speed pursuit on Interstate 75. Seconds later, a dire message comes from one of the troopers: \"Trooper down!\"\nPolice work at the scene of an officer-involved shooting on I-75 in Cobb County on Wednesday, Jan. 27, 2016. Georgia State Police say they were trying to stop a speeder following a 10-mile chase when the speeder struck another vehicle and exited his truck with a gun. A state trooper and a suspect were shot Wednesday, in a police chase in suburban Atlanta, the Georgia State Patrol said. The GSP said in an email that the trooper and suspect were shot in a pursuit on Interstate 75 in Marietta. (Ben Gray/Atlanta Journal-Constitution via AP)\nAuthorities say Trooper Jacob Fields was shot when he exchanged gunfire with a man who had been driving a picking truck. Fields was wounded and is in the hospital. The driver, 26-year-old Israel Vladimir Rodriguez, was also wounded and died at a hospital.\nThe Associated Press obtained the police radio communications on Thursday under Georgia's open records law.\nCapt. Mark Perry says Fields, who was shot twice, is doing well after surgery.\n___\n9:15 a.m.\nA Georgia State Patrol spokesman says a trooper wounded in a gun battle on Interstate 75 has been moved to a regular medical floor of a hospital.\nCapt. Mark Perry said 26-year-old Trooper Jacob Fields of Jasper, Georgia, was doing well enough after surgery late Wednesday that the medical staff was able to move him to a regular floor rather than intensive care at WellStar Kennestone Hospital in Marietta.\nPerry said the wounded lawman's fellow troopers volunteered overnight to stay with him and the family at the hospital, and help out in any way they could.\nAuthorities say Fields began pursuing a speeding pickup Wednesday afternoon until it crashed. They say the driver got out and fired at troopers, who returned fire. Authorities said suspect 26-year-old Israel Vladimir Rodriguez of Acworth was shot and later died.\n___\n7:20 a.m.\nDozens of semi-trailers remained parked on the side of Interstate 75 — more than 12 hours after a car chase and gun battle involving a Georgia State trooper led to a massive traffic jam.\nThe sight of the big rigs on the south-bound shoulder lanes of I-75 shortly after 5 a.m. Thursday was reminiscent of the 2014 snow and ice storm that led to motorists leaving their vehicles for a time. Traffic was flowing freely around the semis early Thursday morning.\nMany drivers pulled over and parked on the shoulder of the interstate as the southbound lanes were shut down for several hours Wednesday afternoon as police investigated the shooting.\nAuthorities said Trooper Jacob Fields was wounded by gunfire but is expected to survive. The suspect, 26-year-old Israel Vladimir Rodriguez of Acworth, died of his wounds.\n___\n5:15 a.m.\nA highway chase in suburban Atlanta ended with a Georgia state trooper being shot and the suspect fatally wounded in an exchange of gunfire.\nGeorgia State Patrol spokesman Capt. Mark Perry says Trooper Jacob Fields was patrolling Interstate 75 southbound Wednesday afternoon in Cobb County when he saw a Chevrolet Silverado speeding. Perry says that when Fields tried to pull it over, the driver fled.\nGeorgia Bureau of Investigation spokesman Scott Dutton says the driver was 26-year-old Israel Vladimir Rodriguez.\nPerry says Fields chased the truck for about 10 miles with two other troopers joining in. The Silverado hit a civilian vehicle and came to a stop.\nPerry says Rodriguez got out and began shooting at the troopers, who returned fire. Fields was shot in the leg and abdomen just below his vest, and Rodriguez was hit multiple times in the abdomen.\nFields is expected to recover. Rodriguez died at a hospital.\nFirst responders are shown working on a suspect that was shot following a chase on Interstate 75 in Cobb County. A state trooper and a suspect were shot Wednesday, Jan. 27, 2016, in a police chase in suburban Atlanta, the Georgia State Patrol said. The GSP said in an email that the trooper and suspect were shot in a pursuit on Interstate 75 in Marietta. (Johnny Edwards/Atlanta Journal-Constitution via AP)\nThis photo released by the Georgia Department of Public Safety shows Trooper Jacob Fields. Fields and a driver who led him on a chase on a highway in suburban Atlanta both suffered gunshot wounds after exchanging fire Wednesday, Jan. 27, 2016, a Georgia State Patrol spokesman said. (Georgia Department of Public Safety via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3420880/The-Latest-Semis-left-I-75-trooper-shot.html"}
