{"authors":["Associated Press"],"date_download":"2018-10-22 20:43:02","date_modify":"2018-10-22 20:43:02","date_publish":"2016-01-28 03:08:36","description":"NEW ORLEANS (AP) — The Latest on a stubborn fire that broke out in a building in downtown New Orleans on Wednesday. All times are local. 8:20 p.m. The fire c...","filename":"data/vaneerConsumption/TheLatestSuspectarrestedinCanalStreetblaze.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:19f797053d12461082faa3cc0bb99b17-2vdWmEltwXfba0ce28e63231dd0f-207_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420318_The-Latest-Suspect-arrested-Canal-Street-blaze_1540240982.html","title":"The Latest: Suspect arrested in Canal Street blaze","title_page":"The Latest: Suspect arrested in Canal Street blaze | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Suspect arrested in Canal Street blaze\nNEW ORLEANS (AP) — The Latest on a stubborn fire that broke out in a building in downtown New Orleans on Wednesday. All times are local.\n8:20 p.m.\nThe fire chief in New Orleans says a 25-year-old man, who was apparently homeless, has been arrested for setting a fire in a building that forced the closure of historic Canal Street.\nFirefighters battle a fire on Canal Street in downtown New Orleans, Wednesday, Jan. 27, 2016. (AP Photo/Gerald Herbert)\nFire Chief Timothy McConnell said Wednesday that Darren Denley was booked on municipal charges of setting fires and crossing police lines.\nMcConnell says Denley is accused of setting a fire in the alcove of a largely empty four-story building in order to keep warm. He says the fire grew unchecked for more than two hours until a window broke and an employee in another business noticed the flames and alerted authorities.\n___\n4:15 p.m.\nThe fire chief in New Orleans says arson isn't suspected in the blaze that blanketed part of the city with smoke and forced the closure of historic Canal Street.\nHowever, Timothy McConnell said Wednesday his department wasn't yet ready to release a suspected cause of the fire.\nSome lanes of Canal Street were re-opened Wednesday afternoon and streetcar traffic was resuming. Officials are assessing damage to the building — and whether Mardi Gras parades that start Friday will have to be re-routed away from the structure.\n___\n12:15 p.m.\nThe fire chief in New Orleans says a fire that shut down part of historic Canal Street has been declared under control.\nThe six-alarm blaze was reported in a mostly empty century-old building about 3:20 a.m. Wednesday. High flames and thick smoke were greatly diminished by daybreak, but the fire spread to an adjacent building and kept 90 firefighters busy all morning. The fire was declared under control shortly before noon.\nNobody was injured and no evacuations were ordered, but the thick smoke prompted some nervous residents of a nearby apartment building to leave the building until they were sure they were safe.\n___\n9:10 a.m.\nThe fire chief in New Orleans says the danger of a building collapse is complicating the battle against a fire that blanketed part of the downtown area in smoke.\nFlames were no longer visible by mid-morning Wednesday. But firefighters continued to spray water on the structure and an adjacent building where the fire had spread.\nFire chief Timothy McConnell says the damage was so heavy that a collapse was possible, so firefighters could not go inside the building.\nThe six-alarm fire was first reported at 3:20 a.m. on Canal Street, the broad, historic boulevard separating New Orleans' central business district from the French Quarter. The building was largely empty, and there were no injuries reported.\n___\n7:20 a.m.\nFirefighters in New Orleans continue to battle a stubborn six-alarm fire in buildings on historic Canal Street.\nFlames were no longer visible by daybreak Wednesday, but fire chief Timothy McConnell says the fire spread to an adjacent building.\nThe fire was first reported at 3:20 a.m.\nNo injuries are reported.\nThe fire broke out in a mostly empty four-story building on a block near the Roosevelt hotel. Ground-floor businesses, including a beauty supply store and a cellphone repair business, were closed when the fire broke out.\nNo evacuations were ordered. But some nervous residents of a nearby apartment building abandoned their building, braving cold weather and eye-stinging smoke until they were certain it was safe to return.\n__\n5 a.m.\nFirefighters are battling a fire on Canal Street in downtown New Orleans.\nFire trucks were heading to the scene around 4 a.m. Wednesday. The fire department the blaze is at a commercial building.\nLive television pictures from the scene show flames leaping from the roof. Several blocks of Canal Street, which borders the city's French Quarter, have been closed.\nNo injuries have been reported.\nFirefighters battle a blaze on Canal Street in downtown New Orleans, Wednesday, Jan. 27, 2016. (AP Photo/Gerald Herbert)\nFirefighters battle a fire on Canal Street in downtown New Orleans, Wednesday, Jan. 27, 2016. (AP Photo/Gerald Herbert)","url":"https://www.dailymail.co.uk/wires/ap/article-3420318/The-Latest-Suspect-arrested-Canal-Street-blaze.html"}
