{"authors":["Associated Press"],"date_download":"2018-10-23 03:53:14","date_modify":"2018-10-23 03:53:14","date_publish":"2016-01-28 19:37:47","description":"SACRAMENTO, Calif. (AP) — The Latest on a hearing on driverless cars in California (all times local): 11:25 a.m. Advocates for the blind are asking Californi...","filename":"data/vaneerConsumption/TheLatestAdvocatesforblindlobbyfordriverlesscars.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:72d951e761c342d0b7903727ad9ef67f-2vdWmEltwXfba0ce28e632c2c21a-362_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421525_The-Latest-California-hearing-begins-self-driving-cars_1540266794.html","title":"The Latest: Advocates for blind lobby for driverless cars","title_page":"The Latest: Advocates for blind lobby for driverless cars | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Advocates for blind lobby for driverless cars\nSACRAMENTO, Calif. (AP) — The Latest on a hearing on driverless cars in California (all times local):\n11:25 a.m.\nAdvocates for the blind are asking California's Department of Motor Vehicles to allow them access to self-driving cars sooner rather than later.\nFILE - This May 13, 2015 file photo shows Google's new self-driving car during a demonstration at the Google campus in Mountain View, Calif. Regulators puzzling through how to give Californians safe access to self-driving cars of the future will hear from Google and other companies that want the state to open the road to the technology. The California Department of Motor Vehicles will hold a hearing Thursday, Jan. 28, 2016, at California State University, Sacramento. (AP Photo/Tony Avelar, File)\nThe DMV is wrestling with how to bring the technology to the public safely.\nAt a Thursday workshop in Sacramento, several people said the technology could change the lives of those who cannot now drive.\nJessie Lorenz is blind. She told DMV regulators that she now has to take public transit to get her 4-year-old daughter to school. She'd like to take her in a self-driving car.\nThe DMV is seeking public input on draft regulations the agency released last month. Those regulations will govern the cars' eventual rollout to residents, once they get past prototype testing.\nSo far, the agency has taken a cautious approach.\n11 a.m.\nCompanies that are developing self-driving cars of the future want government regulators to clear the road for public access to the technology, once it emerges from prototype testing.\nCalifornia's Department of Motor Vehicles is wrestling with how to keep the public safe as the imperfect technology matures — but not regulate so heavily that the agency stifles development of vehicles with potentially huge safety benefits.\nOn Thursday, DMV officials in Sacramento began hearing from advocates and skeptics with strong opinions about precedent-setting draft regulations the agency released last month. Those regulations will govern the cars' eventual rollout to residents.\nSo far, the agency has taken a cautious approach — one that Google in particular says will stymie the technology.\n___\n12:30 a.m.\nCompanies that are developing self-driving cars of the future want government regulators to clear the road for public access to the technology.\nCalifornia's Department of Motor Vehicles is wrestling with how to keep the public safe as an imperfect technology matures — but not regulate so heavily that the agency stifles the development of vehicles with potentially huge safety benefits.\nOn Thursday, DMV officials in Sacramento will hear from advocates and skeptics with strong opinions about precedent-setting draft regulations the agency released last month. Those regulations will govern the cars' rollout to residents, once they emerge from current prototype testing.","url":"https://www.dailymail.co.uk/wires/ap/article-3421525/The-Latest-California-hearing-begins-self-driving-cars.html"}
