{"authors":["Associated Press"],"date_download":"2018-10-22 23:54:40","date_modify":"2018-10-22 23:54:40","date_publish":"2017-03-16 08:19:16","description":"THE HAGUE, Netherlands (AP) - The Latest on the Dutch national election (all times local):3:45 p.m.A prominent member of Prime Minister Mark Rutte's...","filename":"data/vaneerConsumption/TheLatestTopDutchconservativetoleadcoalitiontalks.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/14/wire-229045-1489676062-523_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319186_The-Latest-German-leaders-welcome-Ruttes-Dutch-victory_1540252480.html","title":"The Latest: Top Dutch conservative to lead coalition talks","title_page":"The Latest: Top Dutch conservative to lead coalition talks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"THE HAGUE, Netherlands (AP) - The Latest on the Dutch national election (all times local):\n3:45 p.m.\nA prominent member of Prime Minister Mark Rutte's conservative VVD party has been appointed to investigate possible coalitions following the party's victory in Parliamentary elections.\nPolitical party leaders pose for a group picture with Khadija Arib, center left, the chairwoman of parliament, prior to discussing first steps in forming a new dutch coalition government in The Hague, Netherlands, Thursday, March 16, 2017. Dutch political parties were preparing Thursday to start what will likely be a long process of coalition talks after Prime Minister Mark Rutte's right-wing VVD easily won national elections, defying polls that suggested a close race with anti-Islam populist Geert Wilders. (AP Photo/Peter Dejong)\nEdith Schippers was appointed on Thursday afternoon by the chairwoman of Parliament's lower house, Khadija Arib, after meetings with the leaders of political parties to discuss the election result.\nSchippers will now assess what coalitions may be possible in the splintered Dutch political landscape, paving the way for substantive talks between parties.\nWith 33 seats, the VVD is the largest party and that means that Rutte is in line to lead the next coalition and begin a third term as prime minister.\n___\n2:20 p.m.\nSpanish Prime Minister Mariano Rajoy has praised the choice of voters in The Netherlands to re-elect his Dutch counterpart and ideological ally Mark Rutte to form a fresh national government.\nIn a telegram sent to Rutte on Thursday, Rajoy congratulated him for the election victory.\n\"In a key moment for Europe as a whole, the Dutch people made a show of responsibility and maturity,\" wrote Rajoy, whose conservative Popular Party is aligned with Rutte's VVD in the pan-European conservative EPP.\nWithout mentioning the defeat of anti-Islam lawmaker Geert Wilders, Rajoy said that \"Europe needs stable governments committed to the European integration project.\"\n___\n1:35 p.m.\nPutting a brave face on a result widely interpreted as a setback for far-right populism, the Netherlands' anti-Islam lawmaker Geert Wilders has popped the cork on a bottle of sparkling wine at a meeting of his new Parliamentary bloc, celebrating increasing his bloc from 15 in 2012 to 20 at Wednesday's vote.\nWilders told lawmakers Thursday: \"We are the second party in the Netherlands. Congratulations!\" But the far-right populist conceded, \"We would have preferred to be the first party.\"\nIn mid-December, polls suggested Wilders' Party for Freedom was on course to easily become the largest party, but his support ebbed away as Wednesday's election approached.\nThe party finished second behind the right-wing VVD of Prime Minister Mark Rutte and now looks likely to spend the next parliamentary term in opposition as all mainstream parties have ruled out forming a coalition with Wilders.\n__\n11:30 a.m.\nGerman Chancellor Angela Merkel says the Dutch election was \"a good day for democracy.\"\nMerkel said during a speech in Berlin on Thursday: \"I was very glad, and I think many people are, that a high turnout led to a very pro-European result.\"\nShe added that it was \"a clear signal - and that after days in which the Netherlands had to endure accusations from Turkey that are completely unacceptable, and after days in which we showed it our solidarity.\"\nMerkel has demanded that Turkey cease directing Nazi gibes not just at Germany but also at allies such as the Netherlands.\n___\n11:15 a.m.\nA top European Union official is congratulating Dutch Prime Minister Mark Rutte on an election result that he says is \"an inspiration for many.\"\nJean-Claude Juncker, the head of the European Commission, wrote in a letter to Rutte on Thursday: \"The people of the Netherlands voted overwhelmingly for the values Europe stands for: free and tolerant societies in a prosperous Europe.\"\nJuncker said he looks forward to \"continuing our excellent working relations, in particular our work on the future of Europe.\"\nThe Netherlands helped found what would become the EU 60 years ago.\n___\n10:55 a.m.\nThe leader of the anti-immigrant Northern League has welcomed the result of the Dutch election as a sign of healthy growth for populist movements.\nMatteo Salvini said Thursday that \"good ideas were growing,\" citing \"changing Europe, saving jobs and blocking the invasion.\" The latter was a reference to the ongoing influx of migrants, many arriving in Italy after being rescued at sea with most hoping to continue to northern European countries like the Netherlands.\nThe results were widely read as a rebuke for anti-Islam leader Geert Winders, who finished second to Prime Minister Marke Rutte's right-wing VVD, failing to achieve the close race many had forecast.\nBut Salvini focused on Wilders' gains, from 10 percent of the vote in previous elections to 13 percent this round, gaining five seats in parliament for a total of 20. While easily winning, Rutte dropped from 41 to 33 seats.\n___\n10:30 a.m.\nThe foreign ministers of Sweden and Norway say Dutch voters opted for \"responsible leadership and European cooperation against populism.\"\nSwedish Foreign Minister Margot Wallstrom tweeted that the Netherlands \"voted against far-right populism and for an open society,\" while her Norwegian counterpart Borge Brende congratulated the Dutch and hoped the vote was \"a new trend.\"\nLithuanian President Dalai Grybauskaite tweeted congratulations while Latvian Foreign Minister Edgars Rinkevics? exclaimed on Twitter \"Well done Netherlands, congratulations!\"\nEstonian Prime Minister Juri Ratas also added his voice, wishing congratulations to Dutch Prime Minister Mark Rutte.\n___\n9:35 a.m.\nTurkish Foreign Minister Mevlut Cavusoglu, commenting on the results of the Dutch elections, says Europe is heading toward an abyss and religious wars.\nCavusoglu noted in comments carried by the state-run Anadolu Agency on Thursday that most parties running in Wednesday's parliamentary elections received between 17 and 20 percent of the votes.\nHe said: \"There is no difference between the social democrat (party) and the fascist (Geert) Wilders. They are of the same mentality.\"\nHe argued that European parties are leading the continent toward its collapse.\nCavusoglu said: \"You are taking Europe toward an abyss. Soon religious wars will break out in Europe. That's the way it's going.\"\nTurkey and the Netherlands are involved in a diplomatic standoff over Dutch authorities' refusal to let Turkish ministers address Turkish citizens in rallies.\n___\n9:15 a.m.\nGerman political leaders are welcoming the outcome of the Dutch election, which saw Prime Minister Mark Rutte fend off a challenge from right-wing populist Geert Wilders.\nChancellor Angela Merkel called Rutte to congratulate him shortly before midnight.\nGovernment spokesman Steffen Seibert quoted Merkel as saying she was \"looking forward to continued good cooperation as friends, neighbors, Europeans.\"\nMerkel's chief of staff Peter Altmaier wrote on Twitter: \"Netherlands, oh Netherlands, you are a champion.\"\nThe foreign ministry commented on Twitter that \"the people of the Netherlands have said no to the anti-European populists. This is good, we need a strong Europe. \"\nGermany holds a general election Sept. 24. in which the anti-immigrant Alternative for Germany party is expected to enter Parliament for the first time.\n___\n9:05 a.m.\nDutch political parties are preparing to start what will likely be a long process of coalition talks after Prime Minister Mark Rutte's right-wing VVD party easily won national elections, defying polls that suggested a close race with anti-Islam populist Geert Wilders.\nWith most votes counted for the 150-seat legislature early Thursday, Rutte's VVD has 33 seats, eight fewer than in 2012. The far-right populist Party for Freedom of Wilders is second with 20 seats, five more than the last time but still a stinging setback.\nThe Christian Democrats and centrist D66 parties - likely future coalition partners for Rutte - have 19 seats each.\nParty leaders are expected to meet early afternoon to discuss first steps in the coalition formation process.\nAn activist of the AVAAZ network with a mask of Dutch anti-Islam lawmaker Geert Wilders attends an event to celebrate the election results in the Netherlands in front of the Brandenburg Gate in Berlin, Thursday, March 16, 2017. (AP Photo/Markus Schreiber)\nSupporters of Prime Minister Mark Rutte of the free-market VVD party cheer during Rutte's first appearance after exit poll results of the parliamentary elections were announced in The Hague, Netherlands, Wednesday, March 15, 2017. (AP Photo/Patrick Post)\nGerman Chancellor Angela Merkel talks to students at the student cafe at the 'Zukunftshaus' (lit. 'Future House') of the Paul Gerhard foundation in the district of Wedding in Berlin, Germany, Thursday, March 16, 2017. The 'future house' was created to generate an intergenerational network in the neighborhood. (Michael Kappeler/pool photo via AP)\nDutch Prime Minister Mark Rutte gives 'high five' to children after casting his vote for the Dutch general election in The Hague, Netherlands, Wednesday, March 15, 2017. (AP Photo/Patrick Post)\nGeert Wilders casts his vote for the Dutch general election in The Hague, Netherlands, Wednesday, March 15, 2017. (AP Photo/Peter Dejong)\nA couple of voters leaves the Kerkhovense Molen, a windmill turned polling station in Oisterwijk, south central Netherlands, Wednesday, March 15, 2017. Amid unprecedented international attention, the Dutch go to the polls Wednesday in a parliamentary election that is seen as a bellwether for the future of populism in a year of crucial votes in Europe. The sign at right reads \"polling station\" (AP Photo/Peter Dejong)\nPrime Minister Mark Rutte of the free-market VVD party speaks to his supporters after exit poll results of the parliamentary elections were announced in The Hague, Netherlands, Wednesday, March 15, 2017. (AP Photo/Patrick Post)\nPrime Minister Mark Rutte of the free-market VVD party celebrates after exit poll results of the parliamentary elections were announced in The Hague, Netherlands, Wednesday, March 15, 2017. (AP Photo/Patrick Post)\nActivists of the AVAAZ network celebrate the election results in the Netherlands in front of the Brandenburg Gate in Berlin, Germany, Thursday, March 16, 2017. (AP Photo/Markus Schreiber)\nA man poses as crying firebrand anti-Islam lawmaker Geert Wilders during a small demonstration outside parliament in The Hague, Netherlands, Thursday, March 16, 2017. Dutch political parties were preparing Thursday to start what will likely be a long process of coalition talks after Prime Minister Mark Rutte's right-wing VVD easily won national elections, defying polls that suggested a close race with anti-Islam populist Geert Wilders. (AP Photo/Peter Dejong)","url":"https://www.dailymail.co.uk/wires/ap/article-4319186/The-Latest-German-leaders-welcome-Ruttes-Dutch-victory.html"}
