{"authors":["Associated Press"],"date_download":"2018-10-22 20:40:41","date_modify":"2018-10-22 20:40:41","date_publish":"2016-01-28 02:44:42","description":"INDIANAPOLIS (AP) — The latest on Indiana legislative proposals on LGBT rights and modifications to the state's religious objections law (all times local): 9...","filename":"data/vaneerConsumption/TheLatestSenatecommitteeapprovesgayrightsbill.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419381_The-Latest-Senate-panel-kills-religious-objections-proposal_1540240841.html","title":"The Latest: Senate committee approves gay rights bill","title_page":"The Latest: Senate committee approves gay rights bill | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Latest: Senate committee approves gay rights bill\nINDIANAPOLIS (AP) — The latest on Indiana legislative proposals on LGBT rights and modifications to the state's religious objections law (all times local):\n9:00 p.m.\nAn Indiana Senate committee has approved a bill to extend civil rights protections to gay, lesbian and bisexual people while leaving transgender rights unaddressed.\nThe Senate Rules and Legislative Procedures committee passed the bill by Sen. Travis Holdman, a Markle Republican, on a 7-5 vote Wednesday.\nThe measure was proposed in the wake of a religious objections law passed last year that critics said would allow discrimination against gay people.\nRepublicans say it's a sign of progress. But Democrats criticized the measure for not addressing transgender people. They also objected to broad religious exemptions it contains that they say would still allow discrimination.\nThe bill was panned by the business community for not going far enough. Evangelicals also oppose it. They say it will diminish religious freedoms.\n___\n5:45 p.m.\nAn Indiana legislative committee moved to repeal a religious objections law that drew widespread and unwanted attention to the state last spring after critics said it would sanction discrimination against gay people.\nThe Senate Rules Committee adopted an amendment Wednesday that would effectively repeal the law. The provision was added to a bill that would grant civil rights protections to gay, lesbian and bisexual people but does not address transgender rights.\nThe bill is still a long way from becoming law. That would require the committee to vote approve the bill. It would also need to be passed by the full Senate and House.\nGov. Mike Pence, who was a supporter of the original law, could veto the bill, though that could be overridden by a simple majority of lawmakers.\n___\n4:45 p.m.\nThe Indiana state senator who is sponsoring two LGBT civil rights measures says he has \"grave concerns\" about diminishing religious freedoms, but also believes extending the protections is \"the right thing to do.\"\nSen. Travis Holdman, a Markle Republican, described himself as a socially conservative Christian during a Wednesday committee hearing. And he says he struggled with balancing the sometimes-competing principles of religious freedom and protections for lesbian, gay, bisexual and transgender people.\nOne bill he sponsored would extend discrimination protections to LGBT people in public accommodation, housing and employment. The other is similar, but excludes transgender people. Both contain religious exemptions.\nHoldman hopes the committee will vote in favor of the bills Wednesday.\n___\n1:10 p.m.\nA Washington state florist who became a national figure for refusing to provide flowers for a same-sex wedding is scheduled to testify in Indiana against two LGBT rights bills that will be taken up by a state Senate committee.\nBarronelle Stutzman, who was at the center of storm over gay rights for refusing the service, will speak Wednesday against the measures before the Indiana Senate Rules Committee. She says people should not be forced to participate in events that conflict with their beliefs.\nThe measures would extend civil rights protections to lesbian, gay, bisexual and transgender people.\nLawmakers have struggled to address the issue since a furor last spring over a religious objections law that critics said would sanction discrimination against gay people.\n___\n10:40 a.m.\nAn Indiana Senate committee has killed a bill that would have thrown out the state's contentious religious objections law and replaced it with more robust protections for the rights of worship, speech and bearing arms.\nState Sen. Mike Young, an Indianapolis Republican, said Wednesday that critics who \"demagogue\" and \"fear monger\" had mischaracterized his proposal.\nIt's an awkward time for GOP lawmakers, who are under pressure to adopt LGBT civil rights protections after an uproar last spring over the religious-objections law. Critics said the law would permit discrimination against gays.\nThe Senate Judiciary Committee did not vote on Young's bill, and public testimony was not taken. The Senate is set to take up separate proposals Wednesday afternoon that would extend civil rights protections to lesbian, gay, bisexual and transgender people.\n___\n2 a.m.\nThe Indiana Senate is set to take up proposals that could establish statewide civil rights protections for lesbian, gay, bisexual and transgender people, a move supporters say may help the state's image after a religious objections law last year drew national attention and backlash.\nBut passage of either bill is far from certain. Gov. Mike Pence said recently that he will prioritize religious freedom over LGBT rights, and many lawmakers have expressed reservations.\nOne bill to be heard Wednesday would extend discrimination protections to LGBT people in public accommodation, housing and employment. The other would do the same but exclude transgender people. Both contain several religious exemptions.\nLawmakers have struggled to address LGBT rights since the furor last spring over the law, which they quickly made changes to.\n__","url":"https://www.dailymail.co.uk/wires/ap/article-3419381/The-Latest-Senate-panel-kills-religious-objections-proposal.html"}
