{"authors":["Julia Emmanuele"],"date_download":"2018-10-31 01:38:19","date_modify":"2018-10-31 01:38:19","date_publish":"2018-09-14 21:45:36","description":"The Mad Divorceé of the Upper West Side is heading back to the small screen — and fans can likely see more of Midge and the rest of the marvelous Maisel family later this year. Though an official release date for Season 2 of The Marvelous Mrs.…","filename":"data/vaneerConsumption/TheMarvelousMrsMaiselSeason2PremiereDateHasntBeenAnnouncedYetButItsComingSoonVIDEO.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/12/e820730b-0d3d-4aa6-85b3-5cba364a0b9f-763064ad-e4f0-4f40-912d-9e1f14bf386b-screen-shot-2018-01-11-at-125234-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-marvelous-mrs-maisel-season-2-premiere-date-hasnt-been-announced-yet-but-its-coming-soon-video-11891080_1540949899.html","title":"'The Marvelous Mrs. Maisel' Season 2 Premiere Date Hasn't Been Announced Yet, But It's Coming Soon - VIDEO","title_page":"'The Marvelous Mrs. Maisel' Season 2 Premiere Date Hasn't Been Announced Yet, But It's Coming Soon — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"The Mad Divorceé of the Upper West Side is heading back to the small screen — and fans can likely see more of Midge and the rest of the marvelous Maisel family later this year. Though an official release date for Season 2 of The Marvelous Mrs. Maisel has yet to be formally announced, Amazon released a teaser trailer in August, which revealed that the next season is \"coming soon.\"\nThe Amy Sherman-Palladino created series follows Midge Maisel (Rachel Brosnahan) as she attempts to break into the world of standup comedy in 1950s' New York after her husband, Joel (Michael Zegen), suddenly leaves her. Over the course of the show's critically acclaimed first season, Midge teams up with manager Susie (Alex Borstein) to refine her act and develop her onstage persona, while also trying to balance her newfound career with her life as a mother of two. Season 1 was a smash hit, earning The Marvelous Mrs. Maisel an astounding 11 Emmy Award nominations this year, including a Leading Actress in a Comedy nod for star Brosnahan, as well as Supporting Actor and Supporting Actress nominations for Tony Shalhoub (who plays Midge's father, Abe) and Borstein, respectively, as well as one for Outstanding Comedy. Thus far, the show has actually won three Emmy awards, for the show's casting, editing and music supervision.\nPrime Video on YouTube\nAnd fans of The Marvelous Mrs. Maisel can expect even more of the things that they love about the show in Season 2, as the show's cast and crew has dropped a few hints about what's in store for Midge and her family.\nAccording to Brosnahan, Midge's ambitious partnership with Susie will take center stage in Season 2. \"The first season is largely about Midge working with Susie, and them developing a friendship and a professional relationship,\" Brosnahan told Bustle back in November 2017. \"By the end we’re only just beginning to see what Midge as a professional comedian will look like. I think in Season 2 [how others respond] will be something that will probably be pretty prominent.\"\nAnother major theme for Season 2 will be how Midge balances her career with her home life — and whether or not her parents will discover that she moonlights as an up-and-coming comedian in the West Village. \"By the time we leave her at the end of Season 1, she’s a working woman with a job, and she’s also trying her hand at stand-up comedy,” Brosnahan told IndieWire in December. “And those three worlds, they don’t work together very well. So I look forward to watching her struggle to maintain those three different identities simultaneously.”\nAnd yes, that does mean that Joel will still be a major presence in Midge's life. Though he only makes a few brief appearances in the Season 2 teaser, Joel will remain a major part of Midge's home life, especially when it comes to how she balances work and motherhood. \"They will never be able to be without each other in some capacity, and [that] creates a dramatic tension,\" Variety quoted Brosnahan as saying during a Critics Association Tour Panel in July 2018. (Creating even more tension for the former lovebirds? A new male character, played by Zachary Levi, who Midge is seen sitting in a boat with in the new teaser.)\nAmazon via YouTube\nSherman-Palladino also revealed that they plan to touch on the tumultuous, changing political landscape of the late 1950s, both in Midge's comedy and in the show's storylines. \"We are dramatizing a woman's struggle at a time when she wasn't supposed to have that voice or make those changes,\" Sherman-Palladino said at the TCA panel, according to Variety. The writer and show runner added, \"As writers you want the diversity because you want to express the world. It's interesting to try and find that balance and try and represent a 1959 that is true to what 1959 was in a sense because what you don’t want to do is pretend there are no problems and pretend these things didn’t exist.\"\nAll of which seems to promise a Season 2 of The Marvelous Mrs. Maisel which raises the stakes from the first season, both in terms of Midge's personal life and the shifting world around her. Will the new changes in social dynamics be the thing to help her break out into the big time — and if so, will she still be able to hide her burgeoning fame from her parents for much longer?\nIt's hard to say just yet how many of those questions will be answered when the show finally returns to Amazon Prime, but one thing is for sure: Whatever happens, it will be marvelous.","url":"https://www.bustle.com/p/the-marvelous-mrs-maisel-season-2-premiere-date-hasnt-been-announced-yet-but-its-coming-soon-video-11891080"}
