{"authors":["Chris Tognotti"],"date_download":"2018-10-30 23:13:06","date_modify":"2018-10-30 23:13:06","date_publish":"2014-08-13 22:26:58","description":"Since last weekend, a huge portion of the nation's attention has been directed on the city of Ferguson, Missouri. A predominantly black suburb in St. Louis county, Ferguson's been gripped with protests and racial tension since Sunday, when an…","filename":"data/vaneerConsumption/TheMikeBrownShootingIsFergusonStLouisLatestRacialIncidentInALongPainfulHistory.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0f7f9d1d-190f-4cd8-b544-6d15d34cb027.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35664-the-mike-brown-shooting-is-ferguson-st-louis-latest-racial-incident-in-a-long-painful-history_1540941186.html","title":"The Mike Brown Shooting Is Ferguson, St. Louis’ Latest Racial Incident In A Long, Painful History","title_page":"The Mike Brown Shooting Is Ferguson, St. Louis’ Latest Racial Incident In A Long, Painful History","title_rss":"NULL","source_domain":"bustle.com","text":"Since last weekend, a huge portion of the nation's attention has been directed on the city of Ferguson, Missouri. A predominantly black suburb in St. Louis county, Ferguson's been gripped with protests and racial tension since Sunday, when an unarmed 18-year-old black man named Mike Brown was fatally shot by a local police officer. The details of what exactly happened prior to Brown's shooting are unclear, but the versions of events reported by the two sides in the incident are wildly different.\nAccording to The Riverfront Times, St. Louis police chief Jon Belmar alleges Brown tried to shove an officer back into his car, blocking the door, then reached in to grab for his gun. Belmar maintains one shot went off from inside the car, and that Brown was slain by subsequent shots as he attempted to flee.\nBrown's family and their attorney Benjamin Crump (who also represented the family of slain Florida teen Trayvon Martin) have rejected this version of events, as has the sole public eyewitness to the shooting — Brown's friend, Dorian Johnson, told a very different story to KSDK 's Farrah Fazal. Johnson alleges that he and Brown were walking down an empty street when a police car pulled up, and the officer inside yelled at them to \"get the fuck on the sidewalk.\"\nSo the officer's trying to pull him in, and he's trying to pull away from the window. He never once attempted to reach for this officer's weapon. He's still holding my friend with one arm, and now with the other hand he's pointing his weapon. The second time he says \"I'll shoot\" it wasn't even a second later before the gun just went off, and the officer let go.\nAnd that's how we were able to run.... My friend stopped running, his hands went immediately in the air and he turned around towards the officer, face-to-face. He started to tell the officer he was unarmed and that you should stop shooting me. Before he can get his second sentence out, the officer fired several more shots into his head and chest areas. It was definitely like being shot like an animal. It was almost putting someone execution.\nIn the shooting's aftermath, things have gotten intense in Ferguson. Initial protests were met with a strong police response, and some people — though not all, and not reflecting on the countless people peacefully protesting what they view as a traumatic and unjust killing — ended up getting violent, looting and setting fire to a nearby QuikTrip. Now, three days on, a militarized police response and the outrage of Ferguson's black community has left the town in a tense and combative state.\nScott Olson/Getty Images News/Getty Images\nBut the underlying origins of these tensions, now explosively playing out under the public eye — social media in particular has provided a pretty constant stream of on-the-ground coverage of the scene, just check out #Ferguson — aren't just about Mike Brown, the yet-unnamed officer who killed him, or a burnt storefront. To the contrary, Ferguson (and St. Louis more broadly) knows these tensions all too well.\nFerguson, a Mostly-Black City Under White Stewardship\nAccording to Time, Ferguson's been a racially-diverse city for generations, with some of its residents descended from the same slaves who were auctioned off in the area in the 1800s. The result is a city that's majority black — about 67 percent — and just under 30 percent white. But despite this, the city's management and authorities are predominantly controlled by white officials.\nScott Olson/Getty Images News/Getty Images\nAs the Los Angeles Times reports, a mere three of the 53 police officers on the force in Ferguson are black, only one of its six city council members is black, and the mayor and police chief are both white. And most suggestively, the overwhelmingly white policing of a majority black population might be falling prey to racial bias — in 2013, a staggering 93 percent of traffic stops resulting in arrests were of black people. Black people also accounted for 80 percent of stops overall.\nSt. Louis, a City of Hard Lines and Segregation\nThe city of St. Louis and its surrounding counties, as well, have long held a reputation as hotbeds of racial strife — in 2012, a Manhattan Institute study concluded that St. Louis was the most segregated city in the United States, with its white and black populations squared away separately along hard geographic lines — East St. Louis, in particular, is almost exclusive black (over 97 percent during the 2000 census), and riddled with levels of crime and poverty entirely distinct from the reality their nearby, majority-white neighborhoods have to deal with.\nScott Olson/Getty Images News/Getty Images\nSt. Louis County, Where Things Have Been \"Building Up\"\nScott Olson/Getty Images News/Getty Images\nAccording to St. Louis alderman Antonio French, who's rose to prominence in recent days for photographing and reporting from Ferguson, the tension between black residents and the police is nothing new, or all that specific to the suburb. He was quoted by the Washington Post:\nThis isn’t unique to Ferguson. This is no different than if it happened in Dellwood, Jennings or St. Louis. This has really been bubbling up for a long time.\nEchoing French's comments, but with a considerably more grim appraisal, is ex-Ferguson resident George Chapman, who told Time that he left his longtime home due to mistreatment by its police force.\nFerguson is notorious for being prejudiced against blacks. The police stop us all the time. The police show us no respect. They treat us like we’re nothing.\nIn short, what we're seeing in Ferguson has a history that stretches well back into the consciousness of its community. But if social media illuminates anything about this, here's the biggest thing: even beyond Ferguson, Mike Brown's death has opened familiar wounds regarding police brutality in black communities across America. While the tumult may be local, the conversation it's sparked is borderless.\nMichael B. Thomas/Getty Images News/Getty Images\nImages: Getty Images (5)","url":"https://www.bustle.com/articles/35664-the-mike-brown-shooting-is-ferguson-st-louis-latest-racial-incident-in-a-long-painful-history"}
