{"authors":["Mark Duell For Mailonline"],"date_download":"2018-10-22 21:09:02","date_modify":"2018-10-22 21:09:02","date_publish":"2016-01-28 06:48:53","description":"The five Scotland Yard analysts are helping the Cologne police force identify the suspects from 400 hours of grainy video footage taken on mobile phones and CCTV security cameras.","filename":"data/vaneerConsumption/TheMetPolicesmemorymenaredraftedintohelpGermandetectives.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/07/30A74AAF00000578-0-image-a-44_1453964417980.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420423_The-Met-Police-s-memory-men-drafted-help-German-detectives-Cologne-New-Year-migrant-sex-attackers_1540242542.html","title":"The Met Police's 'memory men' are drafted in to help German detectives","title_page":"The Met Police's 'memory men' are drafted in to help German detectives | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A team of five ‘super-recognisers’ from Scotland Yard have been sent to help German detectives find the New Year’s Eve sex attackers in Cologne.\nThe Metropolitan Police analysts are helping the city’s police force identify the suspects from 400 hours of grainy video footage taken on mobile phones and CCTV security cameras.\nThe super-recognisers, whose skills cannot be learnt, are believed to be members of a tiny part of the population who have advanced powers of memory and recognition.\nTension: People gather in front of the main railway station in Cologne on New Year's Eve. Almost 1,000 criminal complaints have been filed over the New Year's Eve events, more than half alleging sexual assaults\nOn guyard: Police officers survey the area in front of the main train station and the Cathedral in Cologne on January 6, where apparently coordinated sexual assaults were perpetrated against women on New Year's Eve\n'Recogniser' Sergeant Eliot Porritt told Bild: ‘In London, there are now over one million surveillance cameras. We have many years of experience in collecting and evaluating the recordings.’\nThe report by Times Berlin correspondent David Charter follows a court officer’s announcement that a Moroccan and a Tunisian have been charged over a theft on New Year's Eve in Cologne.\nThese are the first indictments related to assaults blamed largely on foreigners that caused public uproar and heightened tension over Germany's migrant influx.\nThe two men were charged over the alleged theft from a man of a bag containing a camera near the city's main station and are now in custody, news agency Deutsche Presse-Agentur reported.\n'Have respect and nice sex': A woman holds a written sign during a demonstration in Cologne on January 5\nProtest: Women hold up signs that read 'Mrs Merkel: Where are you? What are you saying? This worries us!'\nAlmost 1,000 criminal complaints have been filed over the New Year's Eve events, more than half alleging sexual assaults. Authorities have identified 35 suspects, of whom 32 are from North Africa.\nWe have many years of experience in collecting and evaluating the recordings Sergeant Eliot Porritt\nMeanwhile, it was revealed migrants arriving in Germany are being given an instruction manual telling them not to grope women.\nIn the series of 14 cartoons intended to promote integration, migrants are also told to look women in the eyes rather than any other part of their body when talking to them.\nOne warns that women should be respected ‘no matter what they are wearing’. A picture of a man touching a woman’s bottom has a big cross through it.\nDemonstration: People wave German flags next to a banner saying 'Rapefugees Not Welcome' as supporters of anti-immigration Right-wing movement Pegida and other groups protest against the sex attacks in Cologne\nAlso yesterday, the German Cabinet approved measures meant to make it easier to deport foreign criminals - a package that ministers drew up amid outrage over the Cologne assaults.\nJustice Minister Heiko Maas said the measures approved yesterday, which must still be passed by Parliament, are also in the interest of hundreds of thousands of migrants in Germany.","url":"https://www.dailymail.co.uk/news/article-3420423/The-Met-Police-s-memory-men-drafted-help-German-detectives-Cologne-New-Year-migrant-sex-attackers.html"}
