{"authors":["Sabienna Bowman"],"date_download":"2018-10-31 01:48:35","date_modify":"2018-10-31 01:48:35","date_publish":"2018-09-14 00:08:39","description":"The Dunphy-Pritchett-Tucker family will be saying goodbye to one of their own this season. As reported by Entertainment Weekly, Modern Family Season 10 will feature a death that will affect the characters across multiple episodes. Series co-creator…","filename":"data/vaneerConsumption/TheModernFamilySeason10DeathMayMeanSayingaTearfulGoodbyeToThisCrucialCharacter.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/13b5e967-5db1-462e-90e3-a7f8e471531c-148805_1608r1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-modern-family-season-10-death-may-mean-saying-a-tearful-goodbye-to-this-crucial-character-11915454_1540950515.html","title":"The 'Modern Family' Season 10 Death May Mean Saying a Tearful Goodbye To This Crucial Character","title_page":"The 'Modern Family' Season 10 Death May Mean Saying a Tearful Goodbye To This Crucial Character","title_rss":"NULL","source_domain":"bustle.com","text":"The Dunphy-Pritchett-Tucker family will be saying goodbye to one of their own this season. As reported by Entertainment Weekly, Modern Family Season 10 will feature a death that will affect the characters across multiple episodes. Series co-creator Christopher Lloyd wouldn't offer EW any clues, but it seems safe to say the show won't be killing off a core cast-member — it's hard to imagine the show moving forward without say, Ed O'Neill. Instead, the show may say goodbye to an important, but lesser seen character, like Claire and Mitchell's mother, DeDe.\nDeDe is far from the only option. The show could say goodbye to Phil's beloved dad or even — brace yourselves — Stella, but in terms of a loss that would touch the lives of every branch of the extended family, DeDe's makes the most sense from a story standpoint. After all, Lloyd explained that the reasoning behind killing off a character this season is to explore how family's deal with death. He told EW,\n\"We're handling some bigger life events in this season. We do deal with a death, which is certainly a topic that families have to deal with, and on television, it's not easy to do because that’s a heavy subject. But at the same time, it would seem unusual for a family not to go through it.\"\nIn the interview, he further elaborated that it would be a \"significant character\" and it \"will be a moving event — and an event that has repercussions across several episodes.\" Again, that could describe a number of characters, but DeDe is the one that stands out the most.\nOver the course of the first nine seasons, comedy icon Shelley Long has appeared as DeDe seven times. That may not seem like a lot, but her strained relationships with her children, Claire and Mitchell, has been the topic of much discussion within the family. She's also a person who has a rich history with Jay, and a complex one with his second wife, Gloria.\nHaving Claire and Mitchell lose their mom could be a potentially powerful storyline, and it's one that would open up a discussion about what it's like to deal with the death of a parent as an adult. That's not an easy topic to discuss, especially for a sitcom, but it's actually something that Modern Family has touched on before. In the Season 2 episode \"Mother's Day,\" Jay makes his mother's famous sauce to honor her on the holiday, which causes him and the rest of his family to become emotional. Meanwhile, Phil lost his mom in Season 4's \"Goodnight, Gracie.\"\nDeDe's relationship with her two adult children is complicated. She's closest to Mitchell, while she's always butted heads with Claire. Compared to Jay, she's also not had as much involvement in their lives as adults. But she's still their mom, and seeing them mourn her in their own ways would be grounded in the show's rich 10-year history.\nIt would be a shame to say goodbye to Long, who has brought so many laughs to the show over the years, but if Modern Family truly wants to tell a story about the entire family coping with grief, it might be time to bid DeDe farewell.","url":"https://www.bustle.com/p/the-modern-family-season-10-death-may-mean-saying-a-tearful-goodbye-to-this-crucial-character-11915454"}
