{"authors":["Lauren Barbato"],"date_download":"2018-10-30 22:33:52","date_modify":"2018-10-30 22:33:52","date_publish":"2014-08-15 01:00:03","description":"Washington Post journalist Wesley Lowery was reportedly charging his phone in a Ferguson, Missouri, McDonald's on Wednesday when armed police officers swooped in, asked him to leave, and then detained him. His arrest, as well as fellow journalist…","filename":"data/vaneerConsumption/TheMediaBlackoutInFergusonObstructedOutletsFromAlJazeeraToTheWashingtonPost.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/c8119f67-86f5-4225-a4ed-7664806c6171.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35841-the-media-blackout-in-ferguson-obstructed-outlets-from-al-jazeera-to-the-washington-post_1540938832.html","title":"The \"#Media Blackout\" In Ferguson Obstructed Outlets From Al Jazeera To 'The Washington Post'","title_page":"The \"#Media Blackout\" In Ferguson Obstructed Outlets From Al Jazeera To 'The Washington Post'","title_rss":"NULL","source_domain":"bustle.com","text":"Washington Post journalist Wesley Lowery was reportedly charging his phone in a Ferguson, Missouri, McDonald's on Wednesday when armed police officers swooped in, asked him to leave, and then detained him. His arrest, as well as fellow journalist Ryan J. Reilly's, made national news on Thursday, revealing the scope of Ferguson's media blackout as protests continue in the St. Louis suburb. So far, Lowery and Reilly are the only journalists to be arrested by St. Louis County police — and the Missouri Highway Patrol is now taking over security operations from police, according to Gov. Jay Nixon — but local reports say the media has repeatedly been targeted.\nThe night Reilly and Lowery were arrested for allegedly \"trespassing in a McDonald's,\" an Al Jazeera news team came in direct contact with tear gas fired by local police. According to The Huffington Post, the Al Jazeera team members were setting up their cameras when tear gas and rubber bullets smashed into their equipment. The crew abandoned their equipment, and SWAT team members came minutes later to dismantle their light kits and point their cameras to the ground. Raw footage of the events, captured by local news station KSDK, can be found here.\nAn Al Jazeera America spokesperson released this statement Thursday morning:\nAl Jazeera America is stunned by this egregious assault on freedom of the press that was clearly intended to have a chilling effect on our ability to cover this important story. We believe that this situation must be investigated along with those involving our colleagues at other media outlets.\nThe Guardian's Jon Swaine, covering the protests in Ferguson, said on Twitter Wednesday night that he saw the Al Jazeera crew hit with tear gas.\nAlthough local police have denied purposefully hitting the Al Jazeera America news team — or targeting the media altogether — the accounts from journalists at the scene craft a different narrative on social media. Numerous journalists from The Huffington Post to The Sunday Times of London have tweeted about being in the line of tear gas and bruised by rubber bullets.\nSt. Louis County Police Chief Jon Belmar said in a press conference on Thursday that \"the media is not being targeted\" by local police. He added that he didn't know about the Al Jazeera America crew being hit by tear gas Wednesday night, and it's still unclear whether or not Belmar was aware about the arrests of Lowery and Reilly.\nWhen asked why the two journalists were arrested, Belmar said: \"If anybody was arrested, from what I understand, it was because they were in an area that was being cleared by the police.\" However, Belmar did not address why the local police officers were telling journalists to stop taking pictures and videos — as Lowery was doing at the time of his arrest — or removing their cameras altogether.\nScott Olson/Getty Images News/Getty Images\nPresident Barack Obama made it clear on Thursday that police should never arrest journalists who are reporting on the ground. During his address from Martha's Vineyard, the president said St. Louis County police have \"a responsibility to be open and transparent,\" adding that they should \"never bully journalists\" or use excessive force against protesters.\nBut at this point, what is bullying and excessive force to the St. Louis County police?\nImages: Getty Images","url":"https://www.bustle.com/articles/35841-the-media-blackout-in-ferguson-obstructed-outlets-from-al-jazeera-to-the-washington-post"}
