{"authors":[],"date_download":"2018-10-30 21:14:21","date_modify":"2018-10-30 21:14:21","date_publish":"2014-12-10 10:44:33","description":"Most developers in Silicon Valley know feminist agitator and Twitter troll Shanley Kane's name from Hacker News, a sort of reddit for the people building |","filename":"data/vaneerConsumption/TheMadnessOfQueenShanley.json","image_url":"https://media.breitbart.com/media/2014/12/shanjpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_12_10__1540934061.html","title":"The Madness Of Queen Shanley","title_page":"The Madness Of Queen Shanley | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Most developers in Silicon Valley know feminist agitator and Twitter troll Shanley Kane’s name from Hacker News, a sort of reddit for the people building social networks. She and her supporters regularly appear to derail discussion and spew the sort of nonsense about “oppression” and “patriarchy” that leaves some asking whether her entire internet persona is a satirical creation designed to discredit feminism.\nMedia types know her from Twitter, where she seems incapable of going a day without publishing a string of four-letter obscenities, and with which she holds forth at length and in ugly, childish language about the things she says are working against women and minorities in the technology industry: mainly, the “racism” and “sexism” of the “white men” she has dedicated her life to hating. (Investor Marc Andreessen is a particular bête noire.)\nSome of the battles Kane has fought on behalf of the sisterhood include objecting to the use of the device terminology “master” and “slave” (they’re “oppressive”, apparently), flouncing off websites for being called out on parasitic financial practices, telling women that if they have a male co-founder he will probably rape them one day and attacking prominent academics such as Vivek Wadhwa, who works tirelessly on behalf of women and minorities in Silicon Valley.\nBy any reasonable person’s definition, and even by the standards of Silicon Valley, Kane is an abusive engine of discord, creating precisely the opposite conditions to those needed for happy co-operation between the sexes. So how did she land a feature-length profile in Matter, Silicon Valley’s long-read organ of choice—even though her paranoia and control freakery eventually screwed up what would probably have been a fawning profile and left journalists and readers alike aghast at her childishness and self-destructiveness?\n(In case you’re not familiar with the story, follow those two links, which have to be read to be believed. Evidently Matter started calling around, asking people about Kane’s personal and professional life in preparation for their profile of her and her work—doing journalism, in other words—and she threw a hissy fit and started defaming and smearing the journalists in question, who were respectable professionals, beyond reproach in their dealings with her.)\nAnd why did the eminently reasonable Jason Pontin at MIT Technology Review make space for her in the pages of his esteemed magazine, and ask her a set of ludicrously softball questions she might almost have provided herself? What is it that these bright people are seeing in Kane’s work that so eludes the rest of us?\n“I wanted her point-of-view to be communicated as clearly as possible, and with all the feeling she brings to the subject,” Pontin told me privately, reflecting the view of other journalists, who preferred not to be named, that Kane may be combative on Twitter but that she is doing “important work.”\nI’ll take your word for it on “important,” dudes. Mainly because I don’t understand what most of her tweets mean. This, for example, is evidently designed for more erudite folks than me.\nAnyway, that explanation about important work seems to miss the point: Kane’s behaviour would not be tolerated by any other person in the technology industry, and it is not justified by any serious achievements. Only because she professes to be a feminist activist is her abusive behaviour put up with, and even tacitly endorsed, by the establishment.\nThis reflects the low expectations we’ve developed of feminists elsewhere in public life. That sounds unfair, because of course everyone believes in the fundamental equality of the sexes. But, these days, feminism has become associated with shrieking third-wave harpies, misandrists and lesbians, with the result that fewer than 1 in 5 women now identifies as a feminist. Modern feminism has lost the argument with ordinary women by openly declaring its hatred of men and getting hung up on weird academic irrelevances rather than, say, the plight of millions of genuinely oppressed women in the Middle East.\nWe effectively allow these far-left social engineers, who spend their lives trying to make men feel inferior about their gender and skin colour (yes, the irony is lost on them), to say what they want and behave as they please out of misplaced middle-class guilt—a sneaking suspicion that they probably have a point. But they don’t: they’re bullies and attention seekers, hawking snake oil.\nOne of the most infuriating things about women like Kane, according to female journalists I have spoken with over the past few years, is how her aggressive radicalism prevents ordinary people with more reasonable opinions from speaking up. She drowns out valid perspectives of other women with remorseless, relentless ideological fury, and leaves other women apprehensive about expressing their views.\nAnyone who has spent time working in the technology industry, or writing about it, will be familiar with receiving a text or email from a female colleague that says: “Do you think I can say this? Or will Shanley go after me?” That is a horribly destructive legacy, far better befitting the word “oppression” than any of the meaningless trivialities Kane squeals and shrieks about on Twitter all day.\nThat’s why so many people object to her voice being prioritised over others, and that’s what observers mean when they call her an intolerant bully. Kane whines about the silencing of women by men, but it is she who has the greatest gagging effect on other ladies in the tech industry.\nKane’s tweets paint a picture of a woman in abject misery and pain, who needs therapy more than she needs further public exposure. Drama is never far away. So it almost seems cruel for reporters and editors to continue to indulge her neuroses and personal mythologising. But Jason Pontin’s sympathetic questioning, designed to avoid another Matter-style meltdown at least did readers the service of showing how poorly developed Kane’s economic thinking is.\nBut why would technology companies act against their best interests and not hire and promote competent women or people from other marginalized groups? It comes down to what their interests actually are. If their interests were better serving the world, using technology as a force for social justice, and equitably distributing technology wealth to enrich society … sure, they’d be acting against their interests. But the reality is that tech companies centralize power and wealth in a small group of privileged white men. When that’s the goal, then exploiting the labor of marginalized people and denying them access to power and wealth is 100 percent in line with the endgame. A more diverse tech industry would be better for its workers and everyone else, but it would be worse for the privileged white men at the top of it, because it would mean they would have to give up their monopoly on money and power. And they will fight that with everything they’ve got, which is why we see barriers to equality at every level of the industry.\nKane has been responsible for instigating or sustaining a number of witch-hunts, including one against Pax Dickinson, the fired former chief technology officer of Business Insider, who was thrown under the bus for some (admittedly idiotic and tasteless) Twitter comments. He sees his downfall as a free speech issue and Kane as a public menace.\n“I wanted to work towards a tech industry that exhibited true tolerance of everyone and allowed free expression, but Shanley and people like her have made it impossible,” Dickinson says. “The people in the tech industry who actually contribute to innovation need to realize that if they don’t fight back against the Shanleys of the industry, they’ll be allowing people like her to kill the goose who lays the golden eggs.\n“[Former Mozilla CEO, forced out of his job for his objection to gay marriage] Brendan Eich is the canonical example. If they can force him out they can force anyone out, no matter their technological contributions.”\nThere are problems not only with Shanley Kane’s brand of feminism, which is sociopathic and divisive in the extreme, but with her approach to argument, too. It’s not just that she doesn’t like men discussing women’s issues. She doesn’t even like other women discussing them, complaining when she is not treated as the de facto authority on women in the technology industry, despite her loathsome treatment of everyone around her.\nIt’s true that her writing at Model View Culture, the media startup she cofounded, and which she says is profitable, is more measured than her Twitter persona. And she was evidently on best behaviour for her interview in Technology Review, cognisant of how well her usual language would go down with that magazine’s readership. But her standard mode of operation is vicious attack on anyone who does not agree with her pronouncements, and her lust for attention seems insatiable. When Kane says she wishes people would stop writing about her, it is obviously a brazen lie.\nPerhaps if men knew a bit more about the sort of woman in tech their well-meaning initiatives support, they would be a bit more cautious about supporting the feminist cause. Kane, after all, isn’t grateful for their help. “Men in tech don’t support women in tech,” she claims. “They assault, rape, harass, stalk us, make jokes about it, say silent about what happens to us.”\nThat will come as a surprise to the thousands of hand-wringing liberals in the tech industry who bang on endlessly about the importance of redressing the gender balance in technology jobs. But in any case, the women in tech movement probably does women more harm than good, as prominent women in successful technology jobs, a category Kane has never belonged to, keep quietly admitting.\nBut there’s no reasoning with someone who believes that sexism against men is structurally impossible. Here’s Kane’s solution to the gender problem in California’s tech companies: “I would change the allocation of venture capital. What if we said that we are not going to invest in cisgender, heterosexual white men for the next 10 years, and we’re going to fund a diversity of technologists instead?” This is, apparently, a serious proposal.\nKane has no understanding of how business and investment work, so she ascribes everything that has gone wrong in her career and those of her fellow travellers to sexism. The prism of feminist rage robs her of self-awareness and the ability to think critically about how to make sure everyone has equal access to the tools of wealth creation—a premise with which few would argue.\nThe problem is, she’s being taken seriously by the media as an authentic voice of feminism, when most women in the tech industry are as horrified by her as the men. As with any troll, in sucking oxygen and enthusiasm out of worthwhile discussions about, say, female education or minority hiring policies, Kane makes life worse for everyone.\nSilicon Valley’s most abusive, foul-mouthed and obnoxious critic is a good example of the sort of rabid harpy that puts normal women off careers in technology. Yet she and her hate-filled Twitter account are indulged relentlessly by the media establishment, given the sort of platform other campaigners can only dream of. It is mystifying.\nI experienced some of her and her acolytes’ language and tactics personally when I indicated that I would be writing this profile in what was, I thought, rather a neutral tweet. “Jesus fucking Christ,” she broadcast to her followers. “Let the harassment campaigns begin!” And when a reader pointed out that journalism wasn’t equivalent to harassment, she sent him a message that was 30% profanity.\nIn Kane’s world, journalism is harassment, questioning is dissent, and dissent is unforgivable treachery of the noble struggle against heteropatriarchal oppression. Here’s a typical example of what passes for debate in Shanley Kane’s world: mindless fury, expletives and a total absence of argument, directed at a fellow feminist for the crime of questioning, crowned with an almost unbelievably infantile “your face” insult.\nThis is playground-level discourse at its most preposterous. But then, Shanley Kane doesn’t like journalists or academics very much. We have an annoying habit of calling out hypocrisy, thinking for ourselves—rejecting the “listen and believe” approach favoured by feminist agitators—and, well, calling out bullies when we see them.\nIt’s reasonable to expect a journalist to look into, for example, suggestions that Shanley’s home life doesn’t quite match the furious public pronouncements she makes, especially given that she goes out of her way to ruin the lives of men like Pax Dickinson. She’s said to be shacked up with a—yes, you guessed it—white male VC. And as for her statements about inherited wealth, well. I’ll leave that one as an exercise to the reader.\nThere are plenty of theories floating around about why Shanley hates white men, and in particular Marc Andreessen, so much. Whatever Matter discovered when it started asking questions about her, it was apparently enough to send her into paroxysms of panic and rage and move her to terminate their interview arrangements. To my mind, only one explanation covers all the bases. It’s controversial, sure, but hear me out: Andreessen must be her real dad.\nI mean, what else could possibly explain such sustained bitterness and vitriol? The swearing, the name-calling, the foot-stomping? The more I think about it, the more it makes sense. She probably pays her half of the mortgage on whatever palatial Pac Heights digs she shares with her investor husband from daddy’s millions, resenting every cent of her dependence on the success of others.\nAndreessen, miserabile dictu, did not return a request for comment.","url":"https://www.breitbart.com/europe/2014/12/10/the-madness-of-queen-shanley/"}
