{"authors":["Sophie Goulopoulos For Daily Mail Australia"],"date_download":"2018-10-23 02:16:24","date_modify":"2018-10-23 02:16:24","date_publish":"2016-01-29 16:40:39","description":"Even the most committed of fitness fanatics need company sometimes, so on Friday, Larry Emdur and his wife Sylvie enjoyed a leisurely walk around Bondi Beach in Sydney.","filename":"data/vaneerConsumption/TheMorningShowcohostLarryEmdurenjoysastrollwithwifeSylvie.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B30F3200000578-0-image-a-45_1454079316000.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422837_The-Morning-host-Larry-Emdur-enjoys-stroll-wife-Sylvie_1540260984.html","title":"The Morning Show co-host Larry Emdur enjoys a stroll with wife Sylvie","title_page":"The Morning Show co-host Larry Emdur enjoys a stroll with wife Sylvie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He shared the story of his amazing body transformation, even being crowned Men’s Health Celebrity Man Of The Year after losing 13 kilograms.\nBut even the most committed of fitness fanatics need a bit of company sometimes, so on Friday, Larry Emdur and his wife Sylvie enjoyed a leisurely walk together around Bondi Beach in Sydney.\nThe 51-year-old Morning Show host looked healthy and happy as he strolled hand-in-hand with his lady love before storms ravaged the city.\nScroll down for video\nFit and fantastic at 51! Larry Emdur took a stroll hand-in-hand with his wife Sylvie around Bondi Beach on Friday\nWearing a grey marle v-neck T-shirt, Larry's prominent pectorals showed through the jersey cotton.\nHe opted for a pair of tan cargo shorts and navy Nike sneakers, shielding his eyes from the harsh sun with a pair of black aviator sunglasses.\nSylvie meanwhile wore a white v-neck T-shirt and flaunted her slim legs with a black frayed denim mini skirt.\nShe tied her raven locks up in a sporty ponytail and shaded her eyes with a pair of over-sized tortoiseshell sunglasses.\nLooking buff: Wearing a grey marle v-neck T-shirt, Larry's prominent pectorals showed through the jersey cotton\nSupportive: The 51-year-old said he made the decision to 'give Sylvie back the young, healthy boy that she married 20 years ago'\nLast year, Larry decided that there was no time like the present to overhaul is lifestyle, saying that his wife was a big influence in his decision.\nSpeaking to Daily Mail Australia in March, the popular personality revealed what made him decide to pursue the body transformation.\n'We were coming up to our 20th wedding anniversary and the idea was to give Sylvie back the young, healthy boy that she married 20 years ago. That was the start of it,' he said.\nSporty chic: Sylvie wore a white v-neck T-shirt and flaunted her slim legs with a black frayed denim mini skirt\nTransformation: The Morning Show host was awarded Men’s Health Celebrity Man Of The Year after losing 13 kilograms in 2015\nThe television presenter also said credit is due to his supportive family, who have helped make his transformation possible.\nLarry and his wife Sylvie have a 21-year-old son Jye and younger daughter Tia.\n'I was stupid before because it's always been there for me. Sylvie doing the great food, Jye ever since he was a teenager doing the great training, and it just passed me by,' he admitted\n'I wish I started when I was 35 or 40, but now I'm 50 it's 10 times harder but its good.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422837/The-Morning-host-Larry-Emdur-enjoys-stroll-wife-Sylvie.html"}
