{"authors":["Bianca London For Mailonline"],"date_download":"2018-10-23 01:05:26","date_modify":"2018-10-23 01:05:26","date_publish":"2017-03-16 10:49:34","description":"Lee Biggins, founder of CV-Library, has carried out extensive research across a range of recruiters to determine the common mistakes that will put a recruiter off your job application.","filename":"data/vaneerConsumption/Themostcommonjobapplicationmistakes.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E5357F600000578-0-image-a-5_1489661115430.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4319490_The-common-job-application-mistakes_1540256726.html","title":"The most common job application mistakes","title_page":"The most common job application mistakes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"If you've been endlessly applying for jobs with no luck, it could be down to some very crucial mistakes you're making.\nLee Biggins, founder and managing director of CV-Library, has carried out extensive research across a range of recruiters to determine the common mistakes that will put a recruiter off your job application.\nFrom listing unrelated skills to the specific length of your CV, Lee says it's essential to avoid these mistakes if you want to maximise the chances of hearing back and getting that all important interview.\nLee Biggins has carried out extensive research across a range of recruiters to determine the common mistakes that will put a recruiter off your job application\nSpelling mistakes\nWhen applying for a job, attention to detail is of paramount importance. This means your spelling should leave no doubt in the recruiter’s mind that you’re the right person for the job.\nLee found that 71 per cent of recruiters interviewed highlighted this as the number one job application mistake that would be likely to put them off of a prospective interviewee.\nMake sure before you send off the application you double check it, triple check it, and even get a friend or family member to run through it and make sure everything is correct and makes perfect sense.\nBeing under-qualified\nAmbition is obviously key to any successful applicant, but make sure you’re being realistic with the jobs you apply for.\nIf you’re aiming high, that’s great – you should always be trying to push yourself to the next level – just make sure you’re being tactical. Don’t apply for jobs expecting years of experience when you’ve only been doing the job for a few months, it’s not going to get you to where you want to be.\nTHE GOLDEN MISTAKES Spelling mistakes Being under-qualified Unrelated skills Lengthy CVs\nDon’t waste your time going for jobs well over your current skills set; focus your time on the jobs you know are within your reach and work your way up to those top level jobs over time.\nUnrelated skills\nYour CV should sell yourself to the recruiter, and this means tailoring it to every job you apply for. A long list of skills wholly unrelated to the job isn’t going to help you in this endeavour.\nBefore you send off the application, look at the job posting really carefully. Highlight any key skills the job demands and make sure you’re including any relevant experience or talent you have in these areas.\nWith over 40 per cent of recruiters stating that a list of unrelated skills is one of the biggest turn-offs for them, you need to make sure you’re really tailoring your application to the job at hand, starting with your relevant skills and experience.\nLengthy CVs\nAlongside unrelated skills, the length of your CV is hugely important. A good rule of thumb here is try not to exceed two pages of A4.\nBeing concise and to the point puts across your professional manner, which many recruiters are keen to see. Ensuring that you can succinctly present who you are, your employment history and experience neatly in two pages or less is going to massively improve your chances of getting that interview.\nTake time to go through your CV with laser-like focus and ensure that everything you’re including is relevant. Making sure your CV is short and to the point means that a recruiter is going to be able to get a good handle on the type of employee you will be.","url":"https://www.dailymail.co.uk/femail/article-4319490/The-common-job-application-mistakes.html"}
