{"authors":[],"date_download":"2018-10-30 01:25:52","date_modify":"2018-10-30 01:25:52","date_publish":"2018-08-21 00:01:32","description":"First, the grand jury report; the accounts of abuse, humiliation, and degradation visited on young people, then hidden from view as far as possible.","filename":"data/vaneerConsumption/TheMyWayGospelStrikesAgain.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Shapiro.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862752.html","title":"The My Way Gospel Strikes Again","title_page":"The My Way Gospel Strikes AgainThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The Pennsylvania horrors go hand in hand.\nFirst, the grand jury report; the accounts of abuse, humiliation, and degradation visited on young people, then hidden from view as far as possible — made to seem just, oh you know, sort of digestible with a little effort and a lot of pretense.\nThe identity of the offenders is the second horror — priests who betrayed God and their sacred vocation. Injuring the innocent; spoiling their lives and prospects; eating up in single gulps the accumulated trust of those who, whether abused personally or not, have regarded priests and their requests as God-centered. All this, why? For personal gratification, it would seem. For joy and for excitement maybe. For the thrill, possibly, of committing moral treason and getting away with it.\nAnd then the third horror: the abasement of an ancient, beloved, and worldwide Christian community — by its own. Or anyway by those who represented themselves as the community’s own, to the ridicule, now, and vituperation of bystanders who wished this particular community no good in the first place and would be glad, any number of them, to watch it dry up and blow away. “No decent person should be a Catholic any longer,” wrote one commentator on the New York Times’ website the other day. The sin of the priests enabled a second commentator to proclaim: “No other corrupt organization has evaded the scrutiny of federal prosecutors the way the church has.” And so on.\nThe society of the 21st century is not shown as often as it needs to be shown the consequences of the chest-pounding claim to personal autonomy: the “me” of everything, as distinguished from the “us” that underpins civilization.\nHey, you, c’mere. See, I need thus-and-so. And I want it this minute. That’s our present moral mode. My claims, my needs, my way of seeing things. It’s the American way, right?\nNope. Never was before. The American way encouraged individualism all right; individuals, nevertheless, acting as such, were generally bound by society’s rulebook (the Scriptures were basic here, whether or not you were Roman Catholic) to take into account the rights and needs of others.\nThe rulebook made no room for filling the mind of a 10-year-old with lies and nonsense about… let’s just say, whatever one imagined one’s own dark needs to be. Nor had the rulebook anything in it about the beauty and splendor of treachery, imposed externally or manufactured internally. Traitors are and forever will remain louses. However, it seems to me the louse element in our society flourishes with a freedom once denied it by the larger society. That’s thanks to what we suspiciously call our “moral freedom” — our supposed right to make ourselves happy in the way we envision happiness.\nThere are two necessary views of the Pennsylvania horrors and of like horrors known lately to have enveloped sports, politics, entertainment, you name it. There’s the short-term view: grim, sickening; despoiled lives; traitors at large — quite a lot of them pleased with themselves. The short-term view has to do with betrayal in a society less and less connected to the obligations of compassion and respect, more and more adrift on a sea of endless personal choice, where What I Wanna Do seems generally to come first. The irony here is that the moral code setting these considerations in large, bold face type is the code the errant priests signed on, supposedly, to declare and adorn with their words and actions.\nFar more compelling is the view where the road winds up the distant hill toward, maybe — want to bet? — a future at least partly cleansed of the moral stupidity that allows the best- and the worst-seeming alike to have what they want. At everyone else’s expense.\nThe Catholic Church will purge itself — as it has done numerous times throughout numerous centuries. The task will be painful, like the lives of so many newly acknowledged victims of the My Way gospel. At least we know better now than before how cruel is that gospel. It is one reason we have churches — to show us such truths.\nWilliam Murchison’s latest book is The Cost of Liberty: The Life of John Dickinson\nCOPYRIGHT 2018 CREATORS.COM","url":"https://spectator.org/the-my-way-gospel-strikes-again/"}
