{"authors":["Lea Rose Emery"],"date_download":"2018-10-31 01:51:49","date_modify":"2018-10-31 01:51:49","date_publish":"2018-09-13 21:32:22","description":"Who gets the most right swipes on Tinder? You've probably thought that people who kill it on Tinder are super hot, have something special in their photos, or have the wittiest bio ever. But someone's job may also play a role. Tinder just released…","filename":"data/vaneerConsumption/TheMostRightSwipedJobsOnTinderIn2018.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/86682fd1-b89f-4762-91af-9a5644b8544c-fotolia_197960793_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-most-right-swiped-jobs-on-tinder-in-2018-11502867_1540950709.html","title":"The Most Right-Swiped Jobs On Tinder In 2018","title_page":"The Most Right-Swiped Jobs On Tinder In 2018","title_rss":"NULL","source_domain":"bustle.com","text":"Who gets the most right swipes on Tinder? You've probably thought that people who kill it on Tinder are super hot, have something special in their photos, or have the wittiest bio ever. But someone's job may also play a role. Tinder just released its most right-swiped professions for both male and female users — and it seems like some professions are getting a whole lot more love than others.\nWhich makes sense, because what you choose to do for work says a lot about who you are. \"We love seeing all the different occupations of our users,\" a Tinder spokesperson tells Bustle. \"From interior designers and photographers to engineers and dentists, this year’s list of most right-swiped jobs is comprised of such a variety of different occupations in different fields — it’s always surprising to learn more about our user base and who gets the most right swipes.\"\nNot only is it it interesting to see the general trends, but adding your job to your profile is also a good way to spruce up your dating game. \"Adding your job to your Tinder profile is a great way to provide additional insight for potential matches and better showcase your interests and talents,\" the spokesperson says. \"Jobs in fields such as interior design, photography and makeup artistry show strong creativity, while jobs in the medical field, such as dentists, nurses and physician assistants show a desire to help others. It all depends on what you’re looking for in a potential match!\"\nSo what careers are winning a place in our hearts? Here's what Tinder found.\nThe Most Right-Swiped Jobs For Women\n1 Registered Nurse Giphy There's no denying that being a nurse is a laudable and important profession. And it looks like Tinder users are recognizing that, as it was the most popular profession for women.\n2 Dentist Dentists came in as the second most attractive profession for women on Tinder.\n3 Photographer It's unclear if they mean professional photographer or \"Like you don't even understand, my Instagram pictures are *really* good.\" photographer, but it came in at number three on the list for women.\n4 College Or Graduate Student Giphy Considering how many college students there are out there on dating apps, it makes sense that college and graduate students made it into the top five.\n5 Pharmacist There are a lot of medical professions happening on this list, with pharmacists also making the top choices for women.\n6 Teacher Giphy Teaching is one of the most amazing and difficult fields you can go into, so it's nice to see teachers getting a little credit.\n7 Flight Attendant Finally, flight attendants rounded out the top seven most right-swiped careers for female users. Hey, it's hard to resist those frequent flyer miles.\nMost Right-Swiped Jobs For Men\n1 Interior Designer How many interior designers have you met? But, wherever they are, they're getting some attention.\n2 Pilot Giphy It sounds like something out of a 70s porn, but people just love swiping right on pilots.\n3 Physician’s Assistant *Pretends to know the difference between a physician's assistant and a nurse.* With all of the medical professions on here, perhaps it was no surprise to see physician's assistant come in the top three for men.\n4 Lawyer Giphy Much to the delight of lawyers (and overbearing mothers) across the globe, lawyers were one of the most desired career choices.\n5 PR/Communications PR and communications professionals came in at number five, which is not really a shocker when you remember that they know how to market themselves.\n6 Producer Producers of what? Apparently, it doesn't matter — we're swiping right for them.","url":"https://www.bustle.com/p/the-most-right-swiped-jobs-on-tinder-in-2018-11502867"}
