{"authors":["Emily Sohn"],"date_download":"2018-10-22 21:58:36","date_modify":"2018-10-22 21:58:36","date_publish":"2015-09-21 00:00:00","description":"It could be. The moringa tree grows like a weed and has nutritious leaves and seed pods. But in both the developing and developed world, folks aren't always eager to try it.","filename":"data/vaneerConsumption/TheMarketingOfMoringaIsThisTheNewKale.json","image_url":"https://media.npr.org/assets/img/2015/09/18/moringa-diptych_wide-670cc693df346153d22f5e4114f51ecea3bddd0d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_goatsandsoda_2015_09_21_441496768_the-marketing-of-moringa-is-this-the-new-kale_1540245516.html","title":"The Marketing Of Moringa: Is This The New Kale?","title_page":"The Marketing Of Moringa: Is This The New Kale? : Goats and Soda : NPR","title_rss":"NULL","source_domain":"npr.org","text":"The Marketing Of Moringa: Is This The New Kale?\nEnlarge this image toggle caption Mahafreen H. Mistry/NPR Mahafreen H. Mistry/NPR\nThe moringa tree is a scrappy plant that grows like a weed in dry, tropical climates and produces bitter leaves that taste like horseradish. Moringa is also contending for a spot as the next hot \"superfood,\" with an emerging focus on its potential to make life better for people in developing countries. Moringa supplements and bars are also becoming more popular here in the U.S.\nAlthough most parts of the plant are edible, moringa's power is in its leaves and seed pods, which are high in digestible protein, calcium, iron, vitamin C and antioxidants and have a nutritional profile that rivals milk and eggs, says Jed Fahey, a nutritional biochemist at the Johns Hopkins Bloomberg School of Public Health who has been studying the plant for 20 years.\nWith a long history of traditional use, moringa has also been touted for some 300 medicinal benefits, of which Fahey suspects a handful will survive scientific scrutiny. He is putting together a small trial to test its anti-diabetic properties.\nEven better, moringa is a drought-tolerant tree that grows well in sandy soils in the tropics of West Africa, South Asia and South America, often where malnutrition is widespread. It's already a staple in some of these parts, but advocates think moringa could make an even bigger nutritional impact in those regions, particularly for children, pregnant women and nursing mothers. Ounce for ounce, according to some analyses, moringa leaves have double the protein in yogurt, four times more calcium than milk, and seven times more vitamin C than oranges.\n\"One doesn't need to do very much to prove that if you are hungry or nutritionally replete, then eating moringa as a source of vegetable protein in a varied diet is a good thing to do,\" says Fahey, who will speak at an international symposium on moringa in November in Manila, Philippines. \"We're beyond the need to prove that.\"\nWhat's needed now, experts say, is better motivation for people to grow and eat it. In many places, moringa carries the stigma of a \"poor person's crop\" and like Brussels sprouts, people tend to eat it only if they have to, says Lisa Curtis, founder of a company called Kuli Kuli Foods, which sells moringa products in the United States.\nCurtis got her first taste of moringa four years ago, a few months into her post as a Peace Corps volunteer in a small village in Niger. As a vegetarian, she was eating mostly rice, millet and some beans — a diet that left her feeling sluggish. When she mentioned her uncharacteristic fatigue to some women working at the community health center where she volunteered, they told her to try moringa. She bought some leaves from a neighbor's backyard tree, then mixed them with a popular snack called kuli kuli, a type of fried peanut ball. She soon felt better and began to work with villagers to encourage them to use moringa, too.\nThen came a terrorist attack and a Peace Corps evacuation. Surrounded by disposable incomes back home in California, Curtis realized that she might be able to cultivate a market in the U.S. that would keep the moringa spirit going in Africa. Kuli Kuli Foods sells bars, powders and teas in 15 states, with 18 more slated to carry the products by October.\nCurtis' goals are lofty. In Ghana, where she has been sourcing moringa from female farmers for three years, her company pays 30 percent over the market price, and it prepays for harvests to ensure that the crop remains sustainable. Kuli Kuli is also working with nonprofits to get moringa into schools and to educate villagers about how and why to use it.\nThe company recently announced a partnership with the Clinton Foundation to launch a similar program in Haiti. Eventually, Curtis envisions relationships with farmers around the world. On the fulfillment and shipping side in the U.S., autistic adults do much of the work.\n\"Our mission statement is to use moringa to improve nutrition and livelihoods worldwide,\" Curtis says. \"For us, moringa is a very cool new superfood in the same way that quinoa was a cool new superfood 10 years ago and chia was a cool new superfood five years ago.\"\nCurtis doesn't expect moringa to overhaul the health of most Americans, who already tend to get enough nutrition from a produce-rich diet. In places like the U.S., Fahey adds, so-called \"superfoods\" are often overhyped and from a nutritional standpoint, unnecessary. \"If my wallet is restricted, the last thing I'm going to do is spend money on expensive moringa,\" he says. \"I'm going to buy broccoli or kale.\"\nInstead, Curtis is betting on conscientious American consumers to jump on the moringa bandwagon as a way to both add a little variety to their meals and to help support developing countries by, among other effects, encouraging farmers to feed their own communities with moringa.\nAs for taste, Curtis compares the flavor of moringa leaf powder to green tea. In the Kuli Kuli energy bars she sent me, I detected notes of smokiness that reminded me of Chinese gunpowder tea. My kids had reactions of their own. My 7-year old son, normally an adventurous eater, took a bite of a black cherry bar, described it as bitter and said, \"Not my favorite.\"\nMy granola bar-loving 2 1/2-year-old enthusiastically sampled all three flavors and, one by one, spit them out. The next day, he asked for a moringa bar. I asked if he was sure. \"I do like it,\" he said, popping a bite of the chocolate-flavored bar in his mouth. \"It's good for me!\"","url":"https://www.npr.org/sections/goatsandsoda/2015/09/21/441496768/the-marketing-of-moringa-is-this-the-new-kale"}
