{"authors":["Lucia Peters"],"date_download":"2018-10-30 23:00:37","date_modify":"2018-10-30 23:00:37","date_publish":"2014-08-14 14:08:43","description":"If you were under the impression that all Starbucks locations would be equal in their corporate, coffee-laden appearance, I have some bad news for you: They’re not. At all. Because a brand new ‘Bux has just opened, and by all accounts, it appears to…","filename":"data/vaneerConsumption/TheMostDepressingStarbucksintheWorldMightMakeYouThinkTwiceAboutThatPumpkinSpiceLatte.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/41a187be-867b-420b-be78-4985fa5f3fbb.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35756-the-most-depressing-starbucks-in-the-world-might-make-you-think-twice-about-that-pumpkin-spice_1540940437.html","title":"The Most Depressing Starbucks in the World Might Make You Think Twice About That Pumpkin Spice Latte","title_page":"The Most Depressing Starbucks in the World Might Make You Think Twice About That Pumpkin Spice Latte","title_rss":"NULL","source_domain":"bustle.com","text":"If you were under the impression that all Starbucks locations would be equal in their corporate, coffee-laden appearance, I have some bad news for you: They’re not. At all. Because a brand new ‘Bux has just opened, and by all accounts, it appears to be the most depressing Starbucks store in the world. It’s in the Los Angeles neighborhood of Highland Park, and after you see a few pictures of it, you might think twice about stopping by for your favorite seasonal drink.\nFrom what we can see, there are no tables. No comfy chairs. There isn’t a bar for milk and sugar, the lighting is dim, and there are no cases displaying baked goods or other food items. There isn’t any coffee-themed artwork hanging on the walls. There’s Wi-Fi, but there are no outlets, so good luck if you were hoping to be able to use your laptop there. There apparently isn’t even a menu, so you’d best know what you want before you step up to the window to order. Oh, that’s right — there also isn’t a friendly-looking open counter at which to order and retrieve your drink. There’s a walk-up window with what may or may not be bullet-proof glass. Uh… yikes.\nAlthough Highland Park has been undergoing something of a renaissance in recent years, it suffered from a rash of gang violence in the ‘80s and ‘90s. Starting in the early 2000s, though, a crackdown on crime has made the area considerably safer; it has also attracted a huge number of artists and young professionals, turning it into what LA Weekly called in 2013 “LA’s greatest neighborhood.” It’s hip; it’s trendy; but its new coffee location, which was formerly a burger joint called Classic Burger, definitely doesn’t reflect the character of the area. As Eastsider LA noted, it’s “not only disappointing, but insulting to Highland Park.” Ouch. Here's the outside:\nAnd here's the inside, insofar as there is an inside:\nAs Business Insider pointed out, a sizable chunk of Yelp reviewers were also… shall we say, less than impressed by the coffee chain’s newest outpost. Here’s a sampling of what they had to say:\nBut most damning is this: According to a number of the reviews, the promises made at meetings discussing the new location prior to its construction included a bungalow-style appearance, seating for 30 inside, bike corrals outside, and local hires to create jobs for the community. Those who left these reviews said that none of these promises were kept — not even the local hires one. Now, granted, these are Yelp reviews we’re talking about, so they may or may not be accurate — but if they are, then hoo boy. Starbucks, you messed up.\nOn a brighter note, the Pumpkin Spice Latte is returning a lot sooner than we thought; according to Foodbeast, it will be available at Starbucks locations everywhere starting on August 25. Is it just me, or does Pumpkin Spice Latte season get longer each year? Not that I have a problem with that — quite the contrary. I just wonder if there’s ever going to be a time when Starbucks just says, screw it, it’s always Pumpkin Spice Latte season. Sure, it might lose some of its “limited edition” charm — but if there’s one thing that could convince me to buy ‘Bux more often, it would be the constant availability of my favorite overpriced, overly caloric coffee drink. Your move, Starbucks.\nImages: Ivana Di Carlo/Flickr; EeveeLOVE, todd_johnson/Twitter; Yelp","url":"https://www.bustle.com/articles/35756-the-most-depressing-starbucks-in-the-world-might-make-you-think-twice-about-that-pumpkin-spice"}
