{"authors":["Laura House For Daily Mail Australia"],"date_download":"2018-10-22 22:57:16","date_modify":"2018-10-22 22:57:16","date_publish":"2016-01-29 10:25:34","description":"The Merrymaker Sisters are well-known for their support of the paleo lifestyle. But after becoming 'too obsessed' and worried about negative attention, they have decided to give it up.","filename":"data/vaneerConsumption/TheMerrymakerSistersEmmaandCarlaPapasaregivingupPaleo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30AFF02600000578-0-image-a-5_1454050431517.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422144_The-Merrymaker-Sisters-Emma-Carla-Papas-giving-Paleo_1540249036.html","title":"The Merrymaker Sisters Emma and Carla Papas are giving up Paleo","title_page":"The Merrymaker Sisters Emma and Carla Papas are giving up Paleo | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Since 2012, sisters Emma and Carla Papas have been creating a health business empire.\nThe pair, who go by The Merrymaker Sisters on social media, run a successful blog, have over 100,000 followers and have sold thousands of copies of both their paleo recipe books and subscriptions to their paleo meal plans.\nBut the successful Canberra-based duo, who label themselves 'health and happiness advocates' and 'health coaches', have now given up the paleo lifestyle - despite inspiring hundreds of thousands of others to adopt it.\nScroll down for video\nThe Merrymaker sisters: Since 2012, sisters Emma (left) and Carla (right) Papas have been creating a health business empire\nGiving it up: The duo run a successful blog, have over 100,000 followers and have sold thousands of copies of both their paleo recipe books and subscriptions to their paleo meal plans - but have decided to give up 'strict palep'\n'We started eating paleo and didn’t look back. It changed our lives in epic ways. It led us to further health study, where we realised that it’s not just food and exercise that makes us healthy (or not healthy),' they wrote on their blog.\n'That our thoughts, relationships and what we do/how we spend our days also play a part to health and happiness. Which led us to following our bliss and quitting the jobs we hated.'\n'We’re still advocates of the paleo diet, after all, it changed our lives. But we want to make sure y’all know we’re not just paleo.'\nLetting you know: 'We’re still advocates of the paleo diet, after all, it changed our lives. But we want to make sure y’all know we’re not just paleo,' they said\nToo much: The sisters admitted that when they went 'strict paleo' they got 'way too obsessed'\nThe sisters admitted that when they went 'strict paleo' they got 'way too obsessed.'\n'Although we were \"eating right\" it kind of took us a couple steps backwards,' they said, 'We were like “OH MY GOSH… I CAN’T EAT THAT SALAD! It has one chickpea in it!'\"\n'Now that we’re more chilled about things like corn chips, a few cheeky drinks here and there (because fun), sushi, chick peas in our salad etc. we are in a way better head space.'\nThe Papas' said that while the strict paleo diet has been a part of their journey, they have decided to 'move forward.'\nHonesty: 'Now that we’re more chilled about things like corn chips, a few cheeky drinks here and there (because fun), sushi, chick peas in our salad etc. we are in a way better head space,' they said, even though they had inspired many others to adopt the lifestyle (pictured)\nThe women also said negativity surrounding the paleo diet was also a contributing factor.\n'To be quite frank, we’re totally over the negative flack in the media/within the paleo world/within the whole wide world that paleo receives,' they wrote.\n'We’ve read enough self help books and learned enough to know that surrounding yourself with negativity is never a good thing.'\nNot just the obsessiveness: 'To be quite frank, we’re totally over the negative flack in the media/within the paleo world/within the whole wide world that paleo receives,' they wrote\n'It's all about finding what works for you': The sisters have now decided to adopt a 'Merrymaker Lifestyle' instead\nThe sisters have now decided to adopt a 'Merrymaker Lifestyle' instead.\n'It’s all about finding what works for you and knowing that this could change month to month, or even daily,' they said.\n'We are all different, have different values, different financial circumstances, access to different things. We’re all on our own journey with different goals.'\nZero issue: Despite being well-known for their paleo lifestyle, the pair's fans offered them overwhelming support\nDespite being well-known for their paleo lifestyle, the pair's fans offered them overwhelming support.\n'Very wise decision! I've made the same decision a few months ago,' one fan said on Instagram.","url":"https://www.dailymail.co.uk/femail/article-3422144/The-Merrymaker-Sisters-Emma-Carla-Papas-giving-Paleo.html"}
