{"authors":["Ben Kew"],"date_download":"2018-10-30 18:20:42","date_modify":"2018-10-30 18:20:42","date_publish":"2016-02-17 15:47:21","description":"Peter Tatchell is a veteran human rights campaigner and supposed darling of the British left. Yet even he has come under attack from the young regressive |","filename":"data/vaneerConsumption/TheNUSsNoPlatformofPeterTatchellisaNewLowfortheRegressiveLeft.json","image_url":"https://media.breitbart.com/media/2015/02/Peter-Tatchell.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_02_17__1540923642.html","title":"The NUS's 'No-Platform' of Peter Tatchell is a New Low for the Regressive Left","title_page":"The NUS's 'No-Platform' of Peter Tatchell is a New Low for the Regressive Left | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Peter Tatchell is a veteran human rights campaigner and supposed darling of the British left. Yet even he has come under attack from the young regressive left on campus, for little more than his support of free expression.\nTatchell has worked endlessly to promote human rights and social justice, primarily focusing on LGBT issues. He has survived over 300 physical attacks, and suffered brain damage after a vicious beating from Robert Mugabe’s bodyguards after he attempted to perform a citizens arrest on the Zimbabwean tyrant, and attacks from Neo-Nazis in Moscow whilst campaigning for gay rights.\nA member of the Green Party of England and Wales, many conservatives might still consider his politics far from sound. However there can be little doubt that Tatchell is a principled man who has over the years consistently endangered himself in order to fight for what he believes in — a far cry from coddled campus activists.\nAs a human rights campaigner, one of Tatchell’s core principles is freedom of expression. He was one of the signatories of an open letter to The Observer opposing the censorship of speakers, ideas or discussions on campus. This was his first step towards alienating the regressive left on campus.\nAs part of his work for LGBT rights, Tatchell was recently invited to partake in a discussion on the topic of “re-radicalising queers” at Canterbury Christ Church University. However, National Union of Students (NUS) LGBT officer Charlotte Cowling, said she refused to share the stage with a man whom she labelled as “racist” and “transphobic.”\nCowling argued in an email to the University that “she was speaking on behalf of the NUS and its policies.” When asked by Tatchell to produce evidence of this claim, she failed to do so, and rebuffed Tatchell’s efforts to find an amicable solution.\nAlthough the meaning of the word “transphobia” is open to interpretation, if it does bare any meaning, Tatchell, a veteran LGBT campaigner, is anything but. He has, as he says himself, “supported every anti-racist and pro-transgender campaign in my 49 years of work.”\nPeter Tatchell is neither racist nor anti-trans. However he is supportive of people’s right to stand on the other side of his campaigns. And it is that support for people’s freedom of thought and expression that led to the NUS officer refusing to share a platform with him – because he thinks people should be allowed to disagree with him. As Tatchell said himself “Bad ideas are defeated by good ideas.”\nA new low for the NUS and progressive left? It’s certainly strange to see them attempt to shut down a figure such as Tatchell, given that many would classify him as one of their own. Furthermore, the letter that called him into question was also signed by the likes of feminists Caroline Criado-Perez, Beatrix Campbell, and renowned classicist Professor Mary Beard among others. It therefore leaves us wondering who these censorious loons really are.\nYou can follow Ben Kew on Twitter at @ben_kew or email him at ben@yiannopoulos.net","url":"https://www.breitbart.com/tech/2016/02/17/nuss-no-platform-peter-tatchell-new-low-regressive-left/"}
