{"authors":[],"date_download":"2018-10-30 01:01:36","date_modify":"2018-10-30 01:01:36","date_publish":"2018-08-03 15:30:22","description":null,"filename":"data/vaneerConsumption/TheNewYorkTimesEditorHiringFiascoAndReflectingOnDoubleStandardsInOurPublicSquare.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/1533218763951-612x330-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861296.html","title":"The New York Times’ Editor Hiring Fiasco And Reflecting On Double Standards In Our Public Square","title_page":"The New York Times’ Editor Hiring Fiasco And Reflecting On Double Standards In Our Public SquareThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The public square has been alight in recent days as controversy has brewed over The New York Times’ hiring of Harvard Law-educated Sarah Jeong and her history of questionable Tweets.\nBased on Twitter’s publicly available information, since joining the platform in June 2009 she has sent out over 103,000 Tweets. It seems many dozens of those have disturbing, cruel, and racist messages towards various groups. The New York Times has issued a quasi-apology but apparently will retain Jeong, who has alleged much of it was satirical and also apologized.\nThis saga is extraordinarily complex because of both the immense amount of information and numerous norms, issues, and deeper societal questions involved.\nOn one hand, it is a reminder again about the strange power of certain social media platforms in now affecting our media discourse as well as business and public policy to some degree.\nA platform like Twitter, in contrast to Facebook, is inherently designed to be far more of a public square in contrast to Facebook’s more “node-like” system. Many users have, over the years, accumulated extensive histories and thousands upon thousands of Tweets on the platform that are easily searchable and retrievable.\nBecause of the nature of viral “movements” on the platform, it is easy to create a ruckus that will cause an institution to feel they have to react even when it’s but a tiny, vocal smattering of folks. We see this on both the left and right, as institutions feel compelled to react based on an over-estimation of the business threat of said movement but want to avoid the risk in testing how impactful any revenue impact may actually be.\nOn the other hand, this incident has also served clear evidence again of a double-standard that exists in much of our public discourse. It shows how different norms apply to those on the various ends of the policy and ideological spectrum.\nWhen someone on the left commits an egregious act, often there will be much more leeway, second chances, and other “safety nets” given. In contrast, if someone in the center or right does so, often the consequences, accelerated by the social media mob, will be more severe and unforgiving.\nWe saw this just a few months ago in The Atlantic’s firing of columnist Kevin Williamson, among numerous incidents before and since. While it is the legal right of such companies to act in such ways, as a cultural norm it moves in a dangerous direction in closing the “Overton window.”\nThe dangers are not only in the ideas being discussed in the public square being restricted, but also in the societal reactions that come from it. Just as how people say “Twitter is not real life,” so ‘media is also not completely real life.’ Just as the daily discussions and representations on cable news are not a completely whole and accurate reflection of daily American life and world affairs, it is the same with much of our media.\nShutting down voices is but a speed bump to a vehicle of ideas. If the idea is truly powerful enough, in a generally free society it will continue to spread and grow regardless with eventual impact on society at-large, even if it’s outside of the media.\nFor example, then-candidate Donald Trump’s historic rise in the 2015 GOP primaries and victory in the 2016 election despite heavy negative coverage demonstrated how reactions can happen – whether with election results, readership and subscription metrics, or other business and social impacts.\nIn those cases, it means media platforms are becoming disconnected from large segments of the general population, which is extremely worrying because of the essential role a free and open discourse plays in providing news, information, and commentary to our citizenry.\nThe New York Times has stuck by its hiring of Sarah Jeong as it stuck by its hiring of conservative, albeit “Never Trump,” columnist Bret Stephens last year despite immense outrage from the left. Yet the questions of how the norms of our public square are to be shaped in the Internet-age persist, remaining extremely uncertain and difficult to resolve.\nThis most recent controversy will soon likely be forgotten and replaced by a new one, but the lessons it reminds us of – the nature of the Internet and social media, as well as ensuring our public square is at the right balance of being free and open – are worth dwelling on.","url":"https://spectator.org/the-new-york-times-editor-hiring-fiasco-and-reflecting-on-double-standards-in-our-public-square/"}
