{"authors":["Johnny Brayson"],"date_download":"2018-10-31 01:38:26","date_modify":"2018-10-31 01:38:26","date_publish":"2018-08-28 17:29:02","description":"It wasn't that long ago when online dating was considered strange. Less than a decade ago, the prevalent stereotype attached to online dating was that it was only for socially awkward nerds who were unable to meet people in real life, or for…","filename":"data/vaneerConsumption/TheNewHBODocumentarySwipedWillMakeYouRethinkHowYouUseDatingAppsEXCLUSIVETRAILER.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/6552af02-c821-4f51-9add-1aa536b38998-screen-shot-2018-08-28-at-101727-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-new-hbo-documentary-swiped-will-make-you-rethink-how-you-use-dating-apps-exclusive-trailer-10256905_1540949906.html","title":"The New HBO Documentary 'Swiped' Will Make You Rethink How You Use Dating Apps - EXCLUSIVE TRAILER","title_page":"The New HBO Documentary 'Swiped' Will Make You Rethink How You Use Dating Apps — EXCLUSIVE TRAILER","title_rss":"NULL","source_domain":"bustle.com","text":"It wasn't that long ago when online dating was considered strange. Less than a decade ago, the prevalent stereotype attached to online dating was that it was only for socially awkward nerds who were unable to meet people in real life, or for possible psycho killers looking for their next victim. But in just a few short years, online dating has become the norm among single people, and it's now the people who don't engage in the online dating scene who are labeled weirdos. But what does this mean for society as a whole? That's what the new HBO documentary Swiped, out Sept. 10, is looking to find out.\nThe doc's full title is Swiped: Hooking Up in the Digital Age, and it might just give you pause before the next time you open up Tinder. As some experts in the doc suggest, the whole online dating process might not be the healthiest way to go about looking for a relationship. So what about online dating apps is unhealthy? For one, the apps' often male-oriented focus on physical appearance and sex above all else can lead to serious problems like women being treated as sex objects. One expert in the doc's trailer, exclusively on Bustle below, suggests that the reason why dating apps like Tinder are often focused on purely physical hookups over substantive relationships is because those companies were started by \"boys, not men,\" implying that there is a level of horny immaturity embedded in the apps' code.\nHBO on YouTube\nAnother side effect of this over-reliance on physical attractiveness is that it can cause users a high level of stress as they strain to always present themselves looking their best online. \"I'm so caught up in how I look, and then I'm also caught up in how they look,\" says one young female dating app user in the trailer. \"It's hard work, that self-presentation,\" adds an expert. Others noted issues with the highly specific exclusivity people sometimes include in their dating preferences, with one young male user giving a hypothetical example of, \"No fat women, no black, only 18-25.\" This type of public exclusion can certainly cause people humiliation or give them a complex if they find themselves not fitting into the preferred dating pools of people they're interested in.\nThe doc also stresses just how huge online dating has become. According to the trailer, adults between the ages of 18 and 30 spend an estimated 10 hours a week on dating apps. That is a significant chunk of time, especially when it's devoted to something that is potentially harmful to one's overall wellbeing. But for better or worse, it's the new norm when it comes to dating, as the old world of getting a person's phone number and calling them has essentially gone extinct. \"I do remember when you used to call people on the phone,\" says one young male in the trailer. \"I think if you called someone these days you'd probably get labeled a psychopath.\"\nOnline dating apps have become so popular because they're so easy to use, but as Swiped discusses, they may be doing more harm than good.","url":"https://www.bustle.com/p/the-new-hbo-documentary-swiped-will-make-you-rethink-how-you-use-dating-apps-exclusive-trailer-10256905"}
