{"authors":["Kristian Wilson"],"date_download":"2018-10-31 01:42:27","date_modify":"2018-10-31 01:42:27","date_publish":"2018-09-14 17:05:54","description":"It's finally fall, and avid readers know that book awards season begins shortly after the PSL peeks its head over the Starbucks counter. The National Book Award for Fiction longlist came out on Friday, and I've got a look at all 10 books below, plus…","filename":"data/vaneerConsumption/TheNationalBookAwardForFictionLonglistIsACelebrationOfTheBestNovelsOfTheYear.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/71489b5c-5500-49ef-8e86-e0d92a4c9fe5-pjimage-36.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-national-book-award-for-fiction-longlist-is-a-celebration-of-the-best-novels-of-the-year-11917877_1540950147.html","title":"The National Book Award For Fiction Longlist Is A Celebration Of The Best Novels Of The Year","title_page":"The National Book Award For Fiction Longlist Is A Celebration Of The Best Novels Of The Year","title_rss":"NULL","source_domain":"bustle.com","text":"It's finally fall, and avid readers know that book awards season begins shortly after the PSL peeks its head over the Starbucks counter. The National Book Award for Fiction longlist came out on Friday, and I've got a look at all 10 books below, plus information on when the winner will be announced.\nThe National Book Award for Fiction is the last of the National Book Foundation's prestigious honors to put out its longlist. The National Book Award for Young People's Literature longlist and National Book Award for Translated Literature came out on Wednesday, with the National Book Award for Nonfiction longlist and the National Book Award for Poetry longlist following it on Thursday morning.\nThe winner of the 2018 National Book Award for Fiction will join the ranks of the best and brightest books published in the U.S. since 1950. The most recent winners were Sing, Unburied, Sing by Jesmyn Ward in 2017, The Underground Railroad by Colson Whitehead in 2016, and Fortune Smiles by Adam Jonson in 2015.\nHalf of the books on the longlist below will be cut away to create the five-title National Book Award for Fiction shortlist, which will be released on Oct. 10. The winners of the 2018 National Book Awards will be announced at the National Book Awards Ceremony and Benefit Dinner on Nov. 14.\n'A Lucky Man' by Jamel Brinkley One of three story collections on the National Book Award for Fiction longlist this year, Jamel Brinkley's A Lucky Man focuses on black men and boys living in New York City. Click here to buy.\n'Gun Love' by Jennifer Clement In this poignant novel, a 14-year-old girl named Pearl lives with her culture-minded mother in a car parked on the edge of a Florida trailer park, where a local pastor runs a \"Guns for God\" program. Click here to buy.\n'Florida' by Lauren Groff Fates and Furies author Lauren Groff's collection contains 11 tales of motherhood and abandonment, all set in the titular state of Florida. Click here to buy.\n'The Boatbuilder' by Daniel Gumbiner After a stint in rehab fails to cure him of his opioid addiction, 28-year-old Berg begins breaking into other people's homes looking for drugs. In a last-ditch effort to clean up his act, Berg takes up an apprenticeship — and a shot at redemption — with a boat builder named Alejandro. Click here to buy.\n'Where the Dead Sit Talking' by Brandon Hobson Set in the 1980s, this coming-of-age tale centers on Sequoyah, a Cherokee teenager sent to live with a foster family after his mother's substance abuse becomes too much to bear. Click here to buy.\n'An American Marriage' by Tayari Jones Celestial and Roy have only been married for a short while before he is jailed for a crime he did not commit. While Roy is incarcerated, Celestial embarks on a relationship with his best man, Andre. But when Roy is released from prison just five years into his 12-year sentence, the three lovers are forced to come to terms with their arrangement. Click here to buy.\n'The Great Believers' by Rebecca Makkai Set in 1985 Chicago and 2015 Paris, The Great Believers examines the height and aftermath of the AIDS epidemic, as Yale, his lover Charlie, and their friend Fiona reckon with the loss of their late friend and brother, Nico. Click here to buy.\n'The Friend' by Sigrid Nunez When a writing professor dies, he leaves his beloved dog, a Great Dane named Apollo, to his friend and mentee, The Friend's unnamed protagonist. Mourning together, the novel's main character and her newly acquired pet must learn to live with the loss. Click here to buy.\n'There There' by Tommy Orange Revolving around 12 characters, Tommy Orange's There There moves around and through the lives of Native Americans living in Oakland, Calif. Click here to buy.","url":"https://www.bustle.com/p/the-national-book-award-for-fiction-longlist-is-a-celebration-of-the-best-novels-of-the-year-11917877"}
