{"authors":["Abc News","Maryalice Parks","More Rick","More Maryalice"],"date_download":"2018-10-30 00:54:50","date_modify":"2018-10-30 00:54:50","date_publish":"2018-10-29 01:32:29","description":"Trump rallies seem out of step with a national moment of mourning, and of debate over the proper bounds of political rhetoric.","filename":"data/vaneerConsumption/TheNoteTrumpbetsondivisionsinangrymidtermclimate.json","image_url":"https://s.abcnews.com/images/Politics/trump-nc-rally-02-ap-jef-181026_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Politics_note-trump-bets-divisions-angry-midterm-climate_story_id=58819396_1540860890.html","title":"The Note: Trump bets on divisions in angry midterm climate","title_page":"The Note: Trump bets on divisions in angry midterm climate - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Interested in The Note? Add The Note as an interest to stay up to date on the latest The Note news, video, and analysis from ABC News. Add Interest\nThe TAKE with Rick Klein\nIt's a casual observation at this stage to remark upon the anger that animates politics -- anger that serves as an energizing and motivating factor in the coming midterms.\nThat anger was largely non-violent -- until this past week. The façade of words being separate than deeds was shattered by a spate of awful violence and tragedy that has subsumed other campaign messaging with eight days to go.\nIt has not, though, quieted President Donald Trump.\n\"I could really tone it up,\" he said Friday, after the arrest of a Florida man suspected of sending pipe bombs to prominent Democrats. A day later, hours after 11 were killed in a Pittsburgh synagogue, Trump kept his scheduled campaign event.\nTrump rallies seem out of step with a national moment of mourning, and of debate over the proper bounds of political rhetoric. But that's always been a big part of the president's point -- that voters want the Trump show, and won’t punish him for actions taken by those who support him.\nNo one is responsible for horrific actions except those responsible for those actions. But by continuing to bet on divisions, Trump has kept his style of politics on the midterm ballot.\nNicholas Kamm/AFP/Getty Images\nThe RUNDOWN with MaryAlice Parks\nThird rail no more.\nFor decades, gun safety reform largely was seen as too politically perilous to delve into deeply.\nIn this midterm cycle full of firsts and new beginnings, the conversation around gun reform has changed markedly too.\nNo longer are Democratic candidates only bringing it up when asked. In fact, from Georgia to Florida we hear stories of candidates who specifically entered electoral politics to run on the issue. The influx of female candidates seems to have propelled conversation, as well as Democratic moms tending to incorporate policy ideas around gun violence into their stump speeches.\nThe March for Our Lives advocates, spurred into action after the mass casualty shooting at a high school in Parkland, Florida, in February, have held events almost daily across the country encouraging young people to vote. Former Congresswoman Gabby Giffords, in particular, has solidified her place as a prolific fundraiser and strong advocate for those candidates running on a gun-safety platform.\nThe issue, in the forefront of voters’ minds again after the violent headlines this week, and specifically, the unspeakable act of hate at the Tree of Life synagogue, is one of the clearest dividing lines between the two parties, as the Republican Party continues to advocate for easier access to guns and the loosening of rules.\nAP\nThe TIP with Kendall Karson\nDonald Trump might not be on the ballot in Mississippi, but for the two front-runners in the Senate special election, a race that could potentially decide the balance of power in the U.S. Senate, the contest is all about the president.\nStumping in Mississippi's Gulf Coast, a deeply red enclave, Democratic candidate Mike Espy condemned Trump's divisive rhetoric.\n\"I think his rhetoric has caused our discourse to become harsher,\" Espy said after a rally in Biloxi.\nHe struck a similar tone in his response to the tragic shooting in Pittsburgh, writing, \"I’m praying for Pittsburgh, especially today’s victims, their families, and first responders. Our country’s leaders must do more to condemn bigotry and anti-Semitism and bring Americans together.\"\nEspy’s run could potentially be historic: if elected in November, he will be the first African-American senator to represent the state since the Reconstruction Era. But standing in his way are three other opponents including Trump-endorsed GOP Sen. Cindy Hyde-Smith, who made her final pitch to voters this weekend, with a focus on her loyalty to the White House.\n\"We’ve got a president that is a leader,\" she told a small crowd in Nesbit. \"They talk about the caravan headed for the border down there, we’ve got somebody that can handle that caravan. There’s no doubt in my mind.\"\nRogelio V. Solis/AP, FILE\nTHE PLAYLIST\nABC News’ \"Start Here\" Podcast. Monday morning’s episode features a closer look at Saturday’s synagogue shooting in Pittsburgh that left 11 people dead. ABC News Senior National Correspondent Matt Gutman tells us about his conversation with a rabbi was who inside the synagogue at the time. ABC News Chief Global Affairs Correspondent Martha Raddatz and ABC News contributor John Cohen say social media is playing a big role in fueling hate in this country. And, ABC News Chief White House Correspondent Jonathan Karl explains President Trump’s shifting rhetoric around this tragedy and the spate of suspected explosive devices sent through the mail. https://bit.ly/2M7OS5c\nWHAT YOU NEED TO KNOW TODAY\nVice President Mike Pence heads to Grand Rapids, Mich., to rally for Rep. Mike Bishop, the incumbent who is running for reelection in Michigan’s 8th Congressional District, at 7 p.m.\nAttorney General Jeff Sessions delivers remarks to the Boston Lawyers Chapter of the Federalist Society at noon in Boston.\nFormer Vice President Joe Biden will campaign in Youngstown, Ohio, with Democratic gubernatorial candidate Richard Cordray. Cordray is locked in a tight race with Ohio's Republican Attorney General Mike DeWine to succeed Gov. John Kasich and be the Buckeye State's next chief executive.\nCalifornia Sen. Kamala Harris, continuing her campaign swing through a number of key battleground states, will campaign Monday morning in Miami, Florida, with Democratic gubernatorial candidate Andrew Gillum, who has held a slight lead over Republican Congressman Ron DeSantis in recent polls of the critical race. Former Attorney General Eric Holder will also hit the campaign trail with Gillum in South Florida Monday afternoon.\nThe Note is a daily ABC News feature that highlights political analysis of the day ahead. Please check back tomorrow for the latest.","url":"https://abcnews.go.com/Politics/note-trump-bets-divisions-angry-midterm-climate/story?id=58819396"}
