{"authors":[],"date_download":"2018-10-22 21:50:42","date_modify":"2018-10-22 21:50:42","date_publish":"2014-05-08 16:17:48","description":"Boehner would not say Thursday if the House GOP’s campaign arm should stop including the Benghazi attacks in fundraising appeals.","filename":"data/vaneerConsumption/TheNewestBenghaziControversyPoliticalFundraising.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_43/413806/140501-benghazi-mn-1320_abdb7f29874be61cfea38264b12c4e72.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_newest-benghazi-controversy-political-fundraising-n100456_1540245042.html","title":"The Newest Benghazi Controversy: Political Fundraising","title_page":"The Newest Benghazi Controversy: Political Fundraising ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHouse Speaker John Boehner would not say Thursday if the House GOP’s campaign arm should stop including the Benghazi attacks in fundraising appeals.\nAsked three times whether the National Republican Congressional Committee should be fundraising based on what they call Democratic obstruction of the Benghazi investigation, Boehner answered only: “Our focus is on getting the answers to those families who lost their loved ones. Period.”\nAn NRCC email sent Wednesday morning included a link to “become a Benghazi watchdog” – which led to a page where supporters can donate cash. A separate website called “BenghaziWatchdogs.com” still contains a link encouraging visitors to “help fight liberals by donating today.”\nDemocrats say that’s inappropriate and calls attention to the political nature of the GOP focus on Benghazi.\nIn a statement sent minutes before Boehner’s weekly press conference began, Rep. Steve Israel, who chairs the Democratic counterpart to the NRCC, called the Republican cash appeal “callous.”\n“Fundraising off the Benghazi tragedy is despicable and insulting and has no place in the national conversation,” he said. “Speaker Boehner and Chairman Walden should immediately take down their BenghaziWatchdogs.com website and stop insulting the memory of the brave Americans who were lost there.\"\nRepublican Rep. Trey Gowdy, who has been named as the chairman of a special committee to investigate Benghazi, said on MSNBC’s Morning Joe Wednesday that Republicans should stop using the attacks in asks for cash. “I have never sought to raise a single penny on the backs of four murdered Americans,” he said.\nNBC's Andrew Rafferty contributed.","url":"https://www.nbcnews.com/politics/congress/newest-benghazi-controversy-political-fundraising-n100456"}
