{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:22:02","date_modify":"2018-10-30 21:22:02","date_publish":"2016-02-10 23:48:38","description":"Supporters of Sen. Bernie Sanders (I-VT) are targeting Hillary Clinton's support among minorities with a new media blitz.","filename":"data/vaneerConsumption/TheNationHillaryClintonDoesntDeservetheBlackVote.json","image_url":"https://media.breitbart.com/media/2016/01/Hillary-and-Black-Lives-Matter-YouTube.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_10__1540934522.html","title":"'The Nation': 'Hillary Clinton Doesn’t Deserve the Black Vote'","title_page":"'The Nation': 'Hillary Clinton Doesn’t Deserve the Black Vote' - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Supporters of Sen. Bernie Sanders (I-VT) are targeting Hillary Clinton’s support among minorities with a new media blitz in the wake of Sanders’ landslide win in New Hampshire.\nClinton considers minorities, and black voters in particular, her “firewall,” especially as Sanders’ core support is among the white liberal gentry. However, just as Barack Obama cast the Clintons as racists to overtake her in the 2008 primary, Sanders supporters are firing away, hoping to break through to black voters in South Carolina and beyond.\nFor example, legal scholar Michelle Alexander has published a lengthy criticism in The Nation entitled: “Why Hillary Clinton Doesn’t Deserve the Black Vote.” She recounts all of the Clintons’ sins against the left–and against the leftist agenda within the black community in particular–as examples of why Clinton is not to be trusted:\nThe love affair between black folks and the Clintons has been going on for a long time. It began back in 1992, when Bill Clinton was running for president. He threw on some shades and played the saxophone on The Arsenio Hall Show. It seems silly in retrospect, but many of us fell for that. At a time when a popular slogan was “It’s a black thing, you wouldn’t understand,” Bill Clinton seemed to get us. When Toni Morrison dubbed him our first black president, we nodded our heads. We had our boy in the White House. Or at least we thought we did …. What have the Clintons done to earn such devotion? Did they take extreme political risks to defend the rights of African Americans? Did they courageously stand up to right-wing demagoguery about black communities? Did they help usher in a new era of hope and prosperity for neighborhoods devastated by deindustrialization, globalization, and the disappearance of work? No. Quite the opposite.\nRead the whole article here.","url":"https://www.breitbart.com/politics/2016/02/10/the-nation-hillary-clinton-doesnt-deserve-the-black-vote/"}
