{"authors":[],"date_download":"2018-10-30 01:13:15","date_modify":"2018-10-30 01:13:15","date_publish":"2018-09-06 00:05:04","description":"The “what if?” questions of fact and fiction fascinate authors. Any good “what if” is enough to cause a writer to drift off into an hour-long reverie.","filename":"data/vaneerConsumption/TheNewMarshalinTown.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/713gEKiFhYL-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861995.html","title":"The New Marshal in Town","title_page":"The New Marshal in TownThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The “what if?” questions of fact and fiction fascinate authors. Any good “what if” is enough to cause a writer to drift off into an hour-long reverie.\nWhat if Sherlock Holmes hunted Jack the Ripper? What if Hitler had not invaded Russia in 1941 and invaded England instead? And what if George Armstrong Custer didn’t die in the battle of the Little Big Horn and — through a series of odd events — became a frontier marshal?\nWe’ll never know the answer to the first two questions but H. W. Crocker has supplied a hilarious adventure in answer to the third in his new book, Armstrong (The Custer of the West).\nThe book is written in Custer’s voice as a long letter to the wife, Libby, who believes he was killed in the June 1876 battle known to many Indian tribes as the “Battle of the Greasy Grass.” We know that Custer graduated (barely) from West Point in 1861 after achieving more demerits than any cadet had before (and probably has since). His lack of soldierly skill notwithstanding, he rose quickly in the wartime army to become a brigadier general, the youngest in the Union Army. Custer’s bravery isn’t questionable. He led repeated reckless cavalry charges at Gettysburg in July 1863.\nCuster had more than his fair share of ego. Crocker, telling the tale as Custer would have, puts that ego on display often with a sense of humor that Custer could never have had about himself. In Armstrong, Custer frequently talks about his own manly physique, his military expertise, and effect on women as only a raging egotist could. While Custer pretends to be modest, his self-portrait is so over the top many of the other main characters mock him but Custer never gets their jokes. He also constantly claims that a betrayal was the reason for the defeat at Little Big Horn rather than his own foolishness in command of the Seventh Cavalry.\nThe other dramatis personae are worthy of a Mel Brooks screenplay. Beauregard Gillette, a former rebel soldier and Doc Holliday-like character, becomes Custer’s sidekick. There’s Miss Sallie Saint-Jean, the corset-clad owner of a traveling road show of can-can dancers, Chinese acrobats, a flamboyant Chinese magician and a strongman. The rest are an odd assortment of gun-slinging thugs, a crooked government contractor, and a Crow Indian named (of course) Billy Jack who has the annoying habit of repeating everything he says in French, Spanish, and Latin.\nCuster, having been fitted out by Miss Sallie with a U.S. marshal’s badge, enters the town of Bloody Gulch which is enslaved by Logan, the crooked company man. In a series of events that include night-time cavalry raids, a phony siege cannon supposedly belonging to a Chinese emperor named Hu Dhat Man, and the desperate herding of a flock of chickens along the road to Bloody Gulch, Custer and his band of misfits free the town from the bad guys.\nCuster, according to his letter to Libby, is no Harry Flashman, the immortal fictional womanizer and anti-hero of the George MacDonald Flashman series. You can read between the lines of his obvious lust for various ladies in the book, but he’s never shown seducing one of them.\nThe book ends with Custer riding off into the sunset (and, we hope, a series of sequels) before a troop of cavalry arrive who could discover his real identity.\nCrocker is a highly-talented writer of both fact and fiction as displayed in his previous works, such as The Old Limey, The Yanks Are Coming, and Don’t Tread on Me. All are very much worth reading, but none is nearly as funny as Armstrong (The Custer of the West).\nJed Babbin is The American Spectator’s “Loose Canons” columnist.","url":"https://spectator.org/the-new-marshal-in-town/"}
