{"authors":[],"date_download":"2018-10-30 01:23:27","date_modify":"2018-10-30 01:23:27","date_publish":"2016-05-04 20:10:00","description":null,"filename":"data/vaneerConsumption/TheNewYorkTimesSensationallyIncorrectHeadlineAndOtherClimateNotes.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/05/Wisdom-Icon.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862607.html","title":"The New York Time's Sensationally Incorrect Headline And Other Climate Notes","title_page":"The New York Time's Sensationally Incorrect Headline And Other Climate NotesThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The silliest news items are those that belie their headlines, as is the case with a sensational front-page story in Tuesday’s New York Times, titled “Resettling the First American ‘Climate Refugees.’” From the eye-popping title, one would think that the subjects of the article are refugees fleeing the impacts of climate change. This would indeed be news! After all, just two weeks ago, I read in The New York Times that Americans don’t care about climate policy because the primary effect of global warming has been to render the weather more pleasant. It would be strange, and quite news-worthy, if climate change were leading to refugees at the same time it is making the weather more comfortable.\nBut it turns out that the headline is grossly misleading. Half-way down the article, the reporters clarify that:\n[S]ince 1955, more than 90 percent of the [Isle de Jean Charles]’s original land mass has washed away. Channels cut by loggers and oil companies eroded much of the island, and decades of flood control efforts have kept once free-flowing rivers from replenishing the wetlands’ sediments. Some of the island was swept away by hurricanes. What little remains will eventually be inundated as burning fossil fuels melt polar ice sheets and drive up sea levels, projected the National Climate Assessment, a report of 13 federal agencies that highlighted the Isle de Jean Charles and its tribal residents as among the nation’s most vulnerable.\nSo… the island has been losing land mass for six decades, for reasons that have nothing to do with climate change. Nor is the island in imminent danger. Rather, The New York Timesreports that HUD’s reading of “the climate data” leads the agency to “project” that the island “will eventually be inundated” due to decades of past land-use practices and also the possibility of future sea level rise beyond natural variability. Indeed, residents aren’t fleeing anything. Rather, they’re taking advantage of a federal grant that works out to about $800,000 per person.\nThe upshot is that the subjects of the article are “climate refugees” only due to the fact that they were designated as such by the Department of Housing and Urban Development in the course of awarding them a “climate resiliency” grant. It’s a bureaucratic label. And a sensational headline. But it’s not the truth.\nBaltimore’s Priorities\nBaltimore has a number of nicknames, including “The City That Reads” and “America’s Greatest City,” that come to mind naturally whenever one thinks of this quaint Maryland burg. Now we can add another: “America’s Most Prepared City for Climate Change.” According to a study published this week in Nature Climate Change, Baltimore ranks #1 among 44 cities evaluated for climate preparedness. Way to go “Charm City”! I can think of no more pressing an issue, especially for Baltimore, than preparing for global warming.\nVenezuela Doing Its Part in Fight Against Climate Change\nWhen it comes to mitigating climate change, the People’s Democratic Republic of North Korea is number one. Lately, however, the Bolivarian Republic of Venezuela has been giving the North Korean government a run for its money in the fight against global warming. In an attempt to conserve electricity in the midst of supply constraints, Venezuela’s President Nicolas Maduro on Tuesday shortened the work week to two days (Monday and Tuesday). But that’s not the only energy efficiency measures being imposed by the world’s second greenest government. In addition to the two-day workweek, the Maduro administrative hasplanned daily rolling blackouts through the end of May, at least.\nThese items first ran on the Competitive Enterprise Institute’s blog.","url":"https://spectator.org/the-new-york-times-sensationally-incorrect-headline-and-other-climate-notes/"}
