{"authors":["Will Martin"],"date_download":"2018-10-30 23:39:24","date_modify":"2018-10-30 23:39:24","date_publish":"2018-07-17 00:00:00","description":"The Office for National Statistics released its latest snapshot of the state of the UK's jobs market on Tuesday morning, showing employment and job vacancies at record highs.","filename":"data/vaneerConsumption/ThenumberofpeoplewithjobsintheUKjusthitanalltimehigh.json","image_url":"https://amp.businessinsider.com/images/5b4da7544474db3d008b4871-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ons-uk-employment-data-from-july-2018-2018-7_1540942764.html","title":"The number of people with jobs in the UK just hit an all-time high","title_page":"    ONS UK employment data, July 2018: Employment rate at all-time high - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Jobs! Jobs everywhere! Reuters/Peter Nicholls\nThe number of people in employment in the UK rose to a fresh all-time high in the three months to May, according to the latest data from the Office for National Statistics (ONS), released on Tuesday.\n32.4 million people were in work during the period, a highest since the current method of calculating the UK's employment rate began in the early 1970s. It represents an employment rate of 75.7%.\n\"We've had yet another record employment rate, while the number of job vacancies is also a new record. From this, it's clear that the labour market is still growing strongly,\" Matt Hughes, a senior statistician at the ONS, said in a statement.\nAs employment rose, unemployment fell, with 12,000 fewer people out of work than in the previous period, the ONS said. The UK's unemployment rate remained at just 4.2%.\nThere were also a record number of job vacancies, meaning that the number of Brits in employment could rise significantly in the near future. Employers reported 824,000 job vacancies for the period between April and June, the highest number since comparable records began in 2001.\nHere's the chart:\nOffice for National Statistics\nDespite the positive topline numbers, there was an unexpected rise in the number of people in the UK claiming benefits. The claimant count rose by 7,800 people in the data period.\nWage growth also moderated slightly, with the average UK earnings increasing by 2.7%, compared to 2.8% at the last data release in June. However, wages are still growing faster than inflation, meaning Brits are seeing real wage increases.\n\"Real earnings remain modestly up on the year, both including and excluding bonuses,\" Hughes said in his statement.\nBen Brettell, a senior economist at Hargreaves Lansdown, said in an email shortly after the data was released: \"All in all these numbers don't alter the economic picture of anemic growth, a relatively tight labour market and under-control inflation.\"\nA Bank of England rate hike is coming\nThe data is the last jobs report before the Bank of England meets on August 2 to discuss raising interest rates for just the second time in a decade. Markets expect the central bank to do so.\nTuesday's numbers are likely to have helped that cause, according to Andrew Wishart, a UK economist at Capital Economics.\n\"The final set of labour market figures before the Monetary Policy Committee's August meeting will not deter the Committee from pressing ahead and raising interest rates,\" he wrote in an email, pointing in particular to the reasonably steady wage growth.\n\"Leading indicators of pay suggest that it is on track to at least meet the Bank of England's forecast for underlying wage growth of 2.75% y/y in Q4. As such, we continue to expect the MPC to vote to raise interest rates next month,\" he said.","url":"https://www.businessinsider.com/ons-uk-employment-data-from-july-2018-2018-7"}
