{"authors":[],"date_download":"2018-10-30 01:04:46","date_modify":"2018-10-30 01:04:46","date_publish":"2018-08-06 00:05:39","description":null,"filename":"data/vaneerConsumption/TheNextGenerationClosestheCitiOpen.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Alexander_Zverev_19368125802.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861486.html","title":"The Next Generation Closes the Citi Open","title_page":"The Next Generation Closes the Citi OpenThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Andrey Rublev, who looks rather like a handsome ruthless Soviet commissar preparing the assassination of a Spanish anarchist in Barcelona, c. 1937, as described in a novel by Alan Furst, stares across the net as a hawk would a sparrow. The sparrow in question, however, is Alex de Minaur, the hottest thing in teenage tennis since Alexander Zverev, the defending champion here at the Washington Open, who awaits the winner.\nFrom the number of very young men in the draw, you might get notion that this rain-soaked (and -delayed) week was a Next-Gen party, to use the term invented by the ATP (major league tennis) to market the sport as their last big drawing card, the “Big Four S men” (the aces from Spain, Serbia, Scotland and, the biggest, Switzerland), settles into its long goodbye.\nIt is not clear whether any of the principals take this advertising campaign with the required seriousness. When last year he won Zverev said, “Next gen? Why not now gen?” And indeed, he is ranked No. 3 this week, right behind Rafael Nadal and Roger Federer. The other day he made the point with his racquet, dispatching Stefanos Tsitsipas, who at 19 is the best Greek tennis player since Taki Theodoracopulos (full disclosure: Taki, better known today as a razor-edged commentator on mores and mentalities in modern societies, coached the author on return of serve) and bona fida ATP next-genner. And, come to think of it, he looks kind of Russian too.\nActually, if you follow the Tour news, it appears the ex-Bigs are still the Four Tops — the Swiss defended his Australian Open title in January, the Spaniard kept his French Open trophy in June, the Serb won his fourth Wimbledon in July, and the Scot was well on his way to winning this tournament as prep for a second U.S. Open trophy when he walked out.\nBut it is factual that the Nexters are jumping over the shoulders of the Betweeners. There is a Lost Cohort. (If the ATP uses this in one of their publicity stunts, they should credit Ernest Hemingway. In A Moveable Feast, he relates the conversation with Gertrude Stein where she uses the term “generation perdue,” in French because she got it from her garagiste.)\nIt is a fine cohort, in which France and America are well represented. But the Bigs are holding on, and the Smalls (figuratively, viz. Sascha Zverev, six-six) are coming on and fast. These two kids, de Minaur and Rublev — whose father, a boxer, is a personal friend of Mike Tyson — are simply, how did I put it, perpetual motion machines. They hit groundstrokes with unrelenting fierceness, they move like cheetahs, never see a shot that is not worth chasing. De Minaur runs back after a passing lob that reaches the baseline just ahead of him, straddles its descending arc and fires a shot through his legs, only to turn around and see it crashing into the net, shrugs. He won the game, too, came back from 0-30.\nRublev played earlier in the day, beating Dennis Kudla, a local boy, in two quick sets. Kudla, who at 25 is a bit too old for Nexter but too young for Betweener, was not finished for the day. Even as Andrey and Alex went at it with controlled wildness on the Stadium Court, he was teamed up with American Nexter Frances Tiafoe in doubles against a team composed of Ivan Dodig, one of the world’s great doublists, and Ben Mclachlan. Close match — they went to what is called a third-set tiebreak, first side to ten, two-point lead to clinch. By the time de Minaur and Rublev were in their third set, Tiafoe and Kudla were battling the old school old guys, Mike Bryan and, standing in for his injured brother, Edouard Roger-Vasselin, one of the class acts of the Age.\nMike B. won Wimbledon with Jack Sock this year, but the Nebraskan, who like Kudla stands somewhere between the Next Gen and the Lost Cohort and ran for President in 2016, had vowed last year he would never play at the Washington tournament again due to lousy conditions.\nHe was referring to the playing surfaces, which he found poorly maintained. This year Andy Murray withdrew after winning three fantastic three-set matches in the Stadium. The last of these, against a resilient Marcus Copil, lasted until three in the morning, and Murray announced a few hours later he was disgusted with the scheduling and would forfeit his quarter finals match, which is why Rublev played Kudla while de Minaur rested.\nIt was not exactly anyone’s fault. The weather was stormy all week. There were delays. Matches had to be rescheduled. Why, during dry spells, more than five courts were not put to use, since there are several more, remains an enigma. And why were matches not played during the mornings, when it did not rain? These are questions, and the Tennis Establishment might consider whether they are more, or less, important than calling talented athletes Next Gens or Lost Cohorts or what-all.\nHowever, after dropping the first set in the tiebreak, de Minaur, who is Australian but has more than a few sketches of Spain in his background, came back from 5-6 in the second and then 2-6 in the second set tiebreak, a gritty, inspired, brilliant performance that left Rublev with no option but to go for a knockout in the last round. Instead, he got knocked out, as de Minaur ran away with what had been a neck-and-neck contest.\nIt took something out of him, though. This was inevitable. And Sascha Zverev, who was spared a doubles semifinal match when his team-mate and brother Mischa (whom he had beaten in an early singles round) withdrew for undefined personal reasons, was in a fine, upbeat mood. Alexander, having conquered the Greek, was set fresh and fit to take on the Aussie.\nYou can look it up, as Ring Lardner used to say. There were some heroics and inspired points by the young Alex, but the year-older Alex (Sascha) has, apart from the day of rest and the seven inches, the more complete game. Where Rublev and de Minaur pounded away, each one generating pace off the other, you had to see Zverev’s more complete game to understand the difference between a mere teenager and a 20-year-old. Sascha plays the court like a Wurlitzer. His powerful deep, high groundstrokes, and booming serves — first and second — confound the opposition, keep it from seizing control. He attacks the net, hits smash volleys and low volleys and long-arm stretch volleys.\nThey got talent. He got game.\nOf course, time will tell. There is talent, there is superior talent, and there is experience. It was interesting to watch the mighty vets, Mike Bryan and Edouard Roger-Vasselin, demolish the young team of Frances Tiafoe and Denis Kudla, precisely because the older men’s win was so clearly due to experience, wisdom, the inner deeper mental geometry of the court, in a word, smarts.\nAnd skills. Tiafoe and Kudla showed how good they could be, but they did not sustain a consistent plan. In consequence, they won fewer points. They beat the great Ivan Dodig and his assistant Ben Maclachlan with sheer youthful energy and talent. You cannot do that against two vets who have plenty of energy and talent too and also know, always, where they should put the ball. There is no one like Mike Bryan to close a rally with an exclamation point, which in this sport means putting the ball away, and there are few doubles men as graceful as Edouard Roger-Vasselin with the down-the-line passing shot.\nIt did not work against Jamie Murray and Bruno Soares the next day, because these two have it too. In the battle of vets, it was close, but for reasons known only to themselves, the American and the Frenchman lost their groove after a masterful first set, while the Scot and the Brazilian increasingly found theirs.\nWell, it was a great old tournament even if Andy Murray was right to be distressed by the scheduling. Three nights in a row capped by that 3 a.m. redeye, was too much for a man recovering from hip surgery. He said he would not go to Toronto for the Canada Open this week, though he expects to make it to Queens for the U.S. Open, the end of the Slam circuit.\nYou should not mix sports and politics, though it’s done, but this, at a fraught time in U.S.-Canada relations, is not good. And who do you think the Canadians will blame?\nIt was a great old tournament and we at TAS are distressed that, for lack of resources, we could not cover the ladies, who ended with a wonderful and emotional and tear-jerking final between the lovely young Croatian, Donna Vekic, and the nicest person on the women’s tour, Svetlana Kuznetsova, a two-time Grand Slam winner. Miss Vekic had to overcome the great Polish star, Magda Linette, and China’s Saisai Zheng, so that tells you how much heart she put into it. She almost had it, but choked. Or was tired. (Scheduling fiascos affect girls, too, even in this day and age.) Or, hey, Svetlana was the better, the shrewder, the wiser, when it counted.\nSo in the WTA no less than the ATP it is the young and the old and the rich and the poor and the class acts and that guy who broke all his racquets in frustration and kicked his tennis bag and knocked down trash cans and got fined sixteen and a half thousand dollars. It’s only money, though admittedly more than he made for bombing out of the first round. Had he won — had he beat Sascha — he would have nearly 400 thousand.\nWell, live and learn. And practice.","url":"https://spectator.org/the-next-generation-closes-the-citi-open/"}
