{"authors":["James Zumwalt"],"date_download":"2018-10-30 19:33:18","date_modify":"2018-10-30 19:33:18","date_publish":"2017-02-27 15:23:04","description":"February has proven to be a big month for North Korea. In two very different but frightening ways, it has demonstrated a capability to strike out at targets. It has made clear no one is safe should Pyongyang wish to reach out and touch—or kill—someone. | National Security","filename":"data/vaneerConsumption/TheNorthKoreaIranLinkWillTestTrump.json","image_url":"https://media.breitbart.com/media/2016/11/north-korea-kim-jong-un-boat-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_02_27__1540927998.html","title":"The North Korea-Iran Link Will Test Trump","title_page":"The North Korea-Iran Link Will Test Trump","title_rss":"NULL","source_domain":"breitbart.com","text":"February has proven to be a big month for North Korea. In two very different but frightening ways, it has demonstrated a capability to strike out at targets. It has made clear no one is safe should Pyongyang wish to reach out and touch—or kill—someone.\nOn February 12th, Pyongyang successfully conducted an intermediate-range ballistic missile test. It followed two nuclear tests and two dozen missile launches conducted in 2016. The last nuclear test exceeded in yield weapons the U.S. used in World War II. Having developed a nuclear arsenal, Pyongyang is eager also to develop a missile delivery system capable of striking the U.S.\nUndeterred by the international attention the missile test attracted, the very next day, Pyongyang demonstrated its reach by assassinating the estranged older half-brother, Kim Jong-nam, 46, of its dictator, Kim Jong-un.\nThe half-brother was at Kuala Lumpur International Airport in Malaysia, waiting to catch a flight to Macau. While Malaysian police are still investigating, it seems clear from airport video the attack by two women — one of whom exposed the victim to a poisonous chemical — was closely monitored by at least one senior North Korean embassy official. Four North Korean suspects all flew out of Malaysia afterward.\nThe oldest son of the late North Korean leader Kim Jong-il, Kim Jong-nam appeared to be the heir apparent until he fell out of favor with his father. This apparently occurred after he embarrassed his father by getting arrested while trying to enter Japan on a forged Dominican Republic passport. He went into hiding, spending most his time in Macau, mainland China, and Singapore under the protection and watchful eye of the Chinese.\nKim Jong-un was then groomed for the leadership role, coming to power when his father died in 2011. Upon doing so, Kim Jong-nam criticized his younger half-brother as being unqualified to lead. The comment obviously did not set well with the new leader who, as head of a brutal dictatorship, was used to only hearing good things about himself.\nAs the South Korean government accused Pyongyang of masterminding the attack, North Korea outrageously accused Seoul of being responsible.\nOf course, impeached South Korean President Park Geun-hye well understands of what the North Koreans are capable. Assassinations have long been an arrow in North Korea’s foreign policy quiver. Her father, also president of the country (1961-1979), was the last of its dictators. He was the target of several assassination attempts by Pyongyang before being killed by his own intelligence chief. Sadly, during a 1974 assassination attempt, her mother was killed.\nChinese officials obviously may not be too happy about Kim Jong-nam’s death. They undoubtedly granted him safe haven, viewing him as their “ace in the hole” should Kim Jong-un die or be killed. North Korea is the only communist country in history in which the people seem unable to deter leadership succession as a blood right.\nThus, Beijing sought to protect Kim Jong-nam to install as Pyongyang’s leader in the event of his half-brother’s demise. While North Korean leaders all seem to die natural deaths, it was logical for the Chinese to have a back-up plan. Kim Jong-un has proven brutal, not hesitating to kill family members or senior officials on a whim (one just for falling asleep during a meeting).\nUndoubtedly, Kim Jong-un has made those in his inner circle edgy, not knowing whether one of them will be next. Such anxiety might well trigger an assassination attempt against the leader. A South Korean newspaper suggests one such attempt has already been made.\nA RAND Corporation report examining the various ways North Korea might collapse cites the most threatening impact to the country and its neighbors would be one triggered by the current leader’s assassination. RAND indicates since no clear successor has yet been designated, “the potential division of the senior North Korean leadership into factions that would likely wage civil war against each other.”\nThe report continues, “Of all the North Korean control failures, the most serious are the reported assassination attempts on the North Korean leaders. Such a government would collapse into a humanitarian disaster, one that would likely force ROK [South Korean], U.S. and Chinese intervention to resolve the resulting threats both within the region and beyond.”\nChina saw Kim Jong-nam as an alternative in such a situation to install in power to restore calm.\nBeijing fears anything disturbing North Korea’s status quo will not bode well for it. Clearly, the chaos created on the Korean peninsula in the wake of an assassination would be unwelcome; but, then too, so would a peaceful reunification of the Koreas. The last thing China wants is a democratic, re-unified Korea—a U.S. ally—on its border.\nChina worries North Korea no longer affords it the reverence it is due; accordingly, Beijing is reducing trade (suspending coal imports) with what it now considers a wayward son. What China may not fully grasp at this point, however, is that Pyongyang’s portly protagonist is undaunted by Beijing’s move. The “Incredible Bulk” has turned his country into an R&D nuclear and missile testing facility for Iran. In return for this, Tehran probably has committed to cover any cash shortages created by decreased trade with China. (No problem for an Iran flush with cash received under the nuclear deal we struck with them.)\nIran’s mullahs have undoubtedly undertaken their own acts of aggression in the past because they saw nothing being done by the U.S. to hold North Korea accountable for theirs.\nFor both North Korea and Iran during the past eight years, their aggression has been met with U.S. inaction. They will now wait to see whether, under a new U.S. administration, it will continue to be business as usual.\nBut, as the U.S. Navy has now determined a conflict on the Korean Peninsula is the most likely “fight tonight” scenario they will face, U.S. 3rd Fleet forces along with the most advanced platforms have been shifted into the Western Pacific to augment the U.S. 7th Fleet. Pyongyang and Tehran may wish to take notice.\nLt. Colonel James G. Zumwalt, USMC (Ret.), is a retired Marine infantry officer who served in the Vietnam war, the U.S. invasion of Panama and the first Gulf war. He is the author of “Bare Feet, Iron Will–Stories from the Other Side of Vietnam’s Battlefields,” “Living the Juche Lie: North Korea’s Kim Dynasty” and “Doomsday: Iran–The Clock is Ticking.” He frequently writes on foreign policy and defense issues.","url":"https://www.breitbart.com/national-security/2017/02/27/zumwalt-north-korea-iran-link-will-test-trump/"}
