{"authors":["Shannon Carlin"],"date_download":"2018-10-31 01:39:07","date_modify":"2018-10-31 01:39:07","date_publish":"2018-08-29 21:27:43","description":"Spoilers for Season 2 of Riverdale ahead. Next season of Riverdale Bughead fans might actually be able to breathe a sigh of relief, but those who are Team Varchie may want to grab the tissues. Based on the show's new teaser, which premiered…","filename":"data/vaneerConsumption/TheNewRiverdaleSeason3TrailerHintsThatArchieVeronicasRelationshipIsInBigTroubleVIDEO.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/29/8b8dbc98-caf7-4d96-9989-b662e31ddeaa-riverdale-varchie.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-new-riverdale-season-3-trailer-hints-that-archie-veronicas-relationship-is-in-big-trouble-video-10937750_1540949947.html","title":"The New 'Riverdale' Season 3 Trailer Hints That Archie & Veronica's Relationship Is In Big Trouble - VIDEO","title_page":"The New 'Riverdale' Season 3 Trailer Hints That Archie & Veronica's Relationship Is In Big Trouble — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Spoilers for Season 2 of Riverdale ahead. Next season of Riverdale Bughead fans might actually be able to breathe a sigh of relief, but those who are Team Varchie may want to grab the tissues. Based on the show's new teaser, which premiered exclusively on E!, Archie and Veronica's relationship may be in trouble in Riverdale Season 3, which may or may not have something to do with him being in prison. Or, is it that creepy masked figure in this Riverdale first look that's tearing them a part? After all, Archie himself, KJ Apa recently teased that Veronica may have a new man in her life before the season is through. Oh, poor Archiekins, it seems he's in for a doozy of a year.\nThe first shot of the 30-second Riverdale Season 3 promo is Archie, the new student council president, in a bow tie and handcuffs being carted away to prison after being framed for a murder he didn't commit by Hiram Lodge. But, there's also shots of him in bed with Veronica (Camilla Mendes), snuggling her close, and playing (shirtless, mind you) at the watering hole with the gang that seems like a good sign for Archie and his relationship with Veronica. Especially, since Veronica appears to tell her dad in this clip that \"we,\" likely meaning her and Archie, will \"survive whatever [Hiram] has planned\" because the two are \"endgame.\"\nUnfortunately, these moments don't tell the full story of what's going on with Varchie in Season 3. Last month, Mendes revealed to E! that \"there's Varchie conflict, that will make [fans] go crazy.\" But it's Apa that dropped the biggest bombshell. \"You hook up with someone else,\" he said. \"Are you allowed to say that?\" Mendes asked with concern. \"Yeah, but we're not saying who,\" Apa said. Though, Mendes did end the conversation by saying Veronica will have a \"possible new love interest.\"\nTV Promos on YouTube\nBack in June, Riverdale showrunner Roberto Aguirre-Sacasa told TVLine in that “the prospect of Archie in a juvenile detention center is pretty delicious,” while hinting that there “might be a courtroom thriller element to” Season 3, which will cover Archie's murder trial, which honestly, might make it a little hard for him to be a good boyfriend.\nApa told Entertainment Tonight last month at Comic-Con that even though Archie's behind bars Veronica is a still a good girlfriend, visiting him in the slammer. But, \"I think the distance is going to shake things up a little between the two of them,\" Apa said, hinting that distance might make the heart grow fonder, but jail definitely puts a wrench in their future plans.\nAs for who Veronica might be hooking up with next season, there are definitely a bevy of bachelors in Riverdale for her to choose from. Like say, Reggie who couldn't stop flirting with Veronica in Season 2. Last month, Aguirre-Sacasa told The Hollywood Reporter that Reggie will find himself in \"an unlikely romance\" that also coincides with him taking a job at Veronica's speakeasy. Coincidence? Let's guess it's not.\nRiverdale on YouTube\nThough, Charles Melton thinks better of his character. In a June interview with TVLine at the CW Upfront presentation Melton swore that Reggie's actually a good friend to Archie. \"Reggie's a ride or die guy,\" he said, who's \"always had Archie's back.\" Of course, fans won't know what kind of guy Reggie is or whether or not Veronica and Archie are really endgame until Season 3 of Riverdale returns on October 10. The countdown officially begins for Varchie fans who will hope for the best, but should definitely prepare themselves for the worst. This is Riverdale after all.","url":"https://www.bustle.com/p/the-new-riverdale-season-3-trailer-hints-that-archie-veronicas-relationship-is-in-big-trouble-video-10937750"}
