{"authors":["Bianca London For Mailonline"],"date_download":"2018-10-23 01:17:38","date_modify":"2018-10-23 01:17:38","date_publish":"2017-03-10 09:11:10","description":"Kate has been championing her pearl drop earrings ever since 2012 - and the timeless accessories always elevate her look because they are 'elegant and classic', say experts.","filename":"data/vaneerConsumption/TheONEitemthatKateMiddletonalwayswears.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E22616300000578-0-image-a-10_1489143793834.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4298202_The-ONE-item-Duchess-Cambridge-wears_1540257458.html","title":"The ONE item that Kate Middleton always wears","title_page":"The ONE item that Kate Middleton always wears | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's regarded as one of the world's most sartorially clued-up women thanks to her polished and classic style.\nAnd experts say it's all thanks to one simple accessory that the Duchess of Cambridge turns to again and again.\nAs Pop Sugar points out, Kate has been championing her pearl drop earrings ever since 2012, going on to sport them at garden parties, race days, charity visits, and even to make her debut in front of the cameras with a newborn Princess Charlotte in May 2015.\nAnd when the Duchess attended a reception at Buckingham Palace to mark the UK-India Year of Culture less than a fortnight ago, she reached for her favourite earrings once again.\nGem experts say the 35-year-old mother-of-two is right to reach for pearls, thanks to their timeless quality and the fact they're synonymous with 'purity and innocence'.\nTimeless: Just like the Queen and the late Princess Diana, the Duchess of Cambridge, seen here less than a fortnight ago at Buckingham Palace, favours pearl earrings\nWhen Kate attended a reception to mark the launch of the UK-India Year of Culture at Buckingham Palace last month, she reached for her favourite accessories, pearl drop earrings\nRebecca Share, gemologist at thefinejewellerycompany.com, told FEMAIL that they're a great option for women of all ages because they're elegant and classic.\nRebecca also notes that Kate has seemingly taken a leaf out of the late Princess Diana and also the Queen's book when it comes to accessorising.\nShe explained: 'Some of the Queen's favourite personal jewels are pearls, which may also be why Kate tends to choose them. Diana was also a fan of pearls and was very often photographed wearing them on her walkabouts.'\nThe gem expert notes that you can wear pearls with hair up or down and because Kate chooses cream colours more often than not, they enhance her skin tone and match any outfit she chooses to wear - regardless of colour.\n2016: Kate looked beautiful in pear earrings during a royal visit to Canada last September, left, and at Royal Ascot last June, right. Rebecca Share, of thefinejewellerycompany.com, told FEMAIL that they're such a great option for women of all ages because they're elegant\nWith her girl and her pearls: The earrings added a feminine touch to Kate's outfit as she stepped out with daughter Princess Charlotte during the Royal tour of Canada last year\nInspiration: Rebecca Share says that some of the Queen's favourite personal jewels are pearls, right, which may also be why Kate tends to choose them. Diana, left, was also a fan of pearls and was very often photographed wearing them on her walkabouts\nSappho Brammar, Founder and Head Designer of Sparkling Jewellery, adds that a pearl drop earring is synonymous with purity and innocence, which, she says, is the perfect image for a member of the Royal family.\n'We all know that the Duchess of Cambridge is extremely elegant, but to a normal member of the public, someone who wears pearls is always perfectly presented - and the pearl drop earring is a subtle signal to let everyone know that their wearer is sophisticated and refined,' she said.\nAnd Kate has one particular pair of earrings she turns to in particular - and they're not as pricey as you'd expect.\n2015: The duchess proves pearls are for any occasion, wearing them to an official engagement, left, and as she left the hospital after the birth of Princess Charlotte, right. Expert Sappho Brammar says that a pearl drop earring is synonymous with purity and innocence\n2014: Pearl earrings proved to be the perfect accessory as Kate attended a First World War memorial event in August 2014. Experts say pearls make any outfit seem instantly chic\nBelinda Scott from Heavenly Necklaces believes that Kate was gifted the brand's £58 'Pearl and Diamond' earrings in 2012.\nShe said: 'We spotted her wearing them many times before they were \"outed\" by royal bloggers, who argued online about whether the Duchess would actually wear £48 fakes.\n'They are now £58 as we had to add VAT after the world found out, and we sold more pairs in a week as we usually sold in a year.'\nBelinda also cites The Countess of Wessex as a friend and client. 'With so many occasions and outfits on the go at all times, she gets pieces from us - especially to travel with,' said Belinda.\n2013: The duchess picked out a pair of pearl earrings for an engagement in March 2013. An expert said the accessory is a 'subtle signal' that the wearer is 'sophisticated and refined'","url":"https://www.dailymail.co.uk/femail/article-4298202/The-ONE-item-Duchess-Cambridge-wears.html"}
