{"authors":["Pauline Bartolone"],"date_download":"2018-10-30 22:54:40","date_modify":"2018-10-30 22:54:40","date_publish":"2016-02-04 00:33:58","description":"What’s behind the jaw-dropping cost of new “specialty drugs” like Orkambi, which has a sticker price of $259,000 per year for cystic fibrosis patients? Orkambi, which was approved by the U.S. Food…","filename":"data/vaneerConsumption/TheotherhighcostdrugsWhatspecialtydrugsmeanforCalifornia.json","image_url":"https://cdn-images-1.medium.com/max/1200/1*3SfgqmH15cQAYHXSwBFWfQ.jpeg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/medium.com/california-s-legal-drug-dilemma_the-other-high-cost-drugs-what-specialty-drugs-mean-for-california-df18ddf1e632_1540940080.html","title":"The other ‘high-cost’ drugs: What specialty drugs mean for California","title_page":"The other ‘high-cost’ drugs: What specialty drugs mean for California","title_rss":"NULL","source_domain":"calmatters.org","text":"The other ‘high-cost’ drugs: What specialty drugs mean for California\nCredit: John via Flickr\nWhat’s behind the jaw-dropping cost of new “specialty drugs” like Orkambi, which has a sticker price of $259,000 per year for cystic fibrosis patients?\nOrkambi, which was approved by the U.S. Food and Drug Administration last July, is expected to take up to $36 million from the state’s general fund this fiscal year and next. Seventy-four Californians with health coverage under the Department of Health Care Services are estimated to receive the drug this year, and next year, 220 people will benefit, some of whom may be the same patients as this year.\nOrkambi is listed as a “specialty tier” drug in some private health plans. That category is reserved for high-cost drugs, or, in the federal government’s view, for drugs that cost more than $600 a month and are used by a small proportion of patients.\nSpecialty drugs are already proving to be a financial burden on one California agency, the California Public Employees’ Retirement System, which purchases health benefits for active and retired state workers. The state public pension system says that specialty drugs made up less than 1 percent of all prescriptions for its members but 30 percent of the total drugs costs in 2014.\nTop ten specialty drugs (in terms of total spending) in CalPERS, as identified in a CalPERS Pension and Health Benefits Committee in December 2015.\nThe health benefits from specialty drugs justify the cost, according to the pharmaceutical industry.\n“Patients are gaining access to medicines that are better treating their diseases or frankly even curing them,” said Priscilla VanderVeer, deputy vice president of communications at the Pharmaceutical Research and Manufacturers of America (PhRMA). “Patients are now healthier. They’re more productive. They’re functioning.”\nVanderVeer said companies price drugs not just on the cost of production, but on the value the industry believes the drug brings to the health care system, such as:\nEfficacy of the treatment\nHow it increases the quality or length of life\nThe “unmet need” in the drug market\nThe price of the drug also accounts for the cost of developing other drugs, and the high risk that a particular drug won’t make it to market, VanderVeer said. Only 12 percent of drugs that go through clinical trials get approved, according to PhRMA.\n“Because of that high rate of failures there would be no innovative incentive for companies to continue to try to invest” if they could not recoup costs and make a profit, VanderVeer said.\nFinally, she added, the sticker price doesn’t reflect the final price paid for the drug, which can be heavily discounted through negotiations or because of mandated rebates for Medicaid programs.\nDrugmakers are following the money, said Joel Hay, professor of pharmaceutical economics and policy at USC. Companies invest in specialty drugs that target a small population because their high price tags can be spread over a large insurance pool, he said.\n“Even though (specialty) drugs are ridiculously expensive per treatment episode, the cost per member-per-month for the whole plan is just a few cents,” Hay said. Raising 10 cents on a diabetes drug would have a bigger budget impact, he said, because more people have diabetes than cystic fibrosis, for example.\nHay says manufacturers are now less inclined to invest in drugs that treat millions of people, because there is more pushback on price.\n“Drug companies are for-profit companies obligated to make money for their stockholders,” Hay said. “They’re not virtuous charitable organizations.”\nDrugmakers are also investing more in treating uncommon illnesses because there is less competition and therefore more opportunity for profit, said Dr. Helene Lipton, professor of health policy at the School of Pharmacy and Institute for Health Policy Studies at the University of California, San Francisco.\nThe high price of the drugs affects patients, she noted, because health plans put controls on the drugs so that they’re used as a last resort.\n“That may mean going through two or more rounds of care with other medications before being able to use the specialty drug,” Lipton said.\nIt’s not just specialty drugs that are straining health plans’ budgets, said Steve Miller, chief medical officer at Express Scripts, a pharmaceutical benefits manager that negotiates drug prices for 7.5 million Californians.\n“The price of drugs is just continuing to go up,” said Miller, explaining that the trend is due to both new high-cost drugs coming on the market, and mark-ups of old drugs.\nTable taken from pharmaceutical benefits manager Express Scripts’ 2014 Drug Trend Report. Express Scripts negotiates drug prices for 85 million people in the U.S. This data represents their clients, in terms of annual percentage change in drug spending.\nThere’s been an explosion of drugs costing $100,000 a year over the last decade, for things like cystic fibrosis and cancer, Miller said. And there was a 127 percent price increase of branded drugs that had been on the market between 2008 and 2014, he says.\nLimiting the cost of pharmaceuticals is the basis of a California ballot initiative scheduled to go before voters this November that would limit the amount the state pays for a drug to no more than the lowest price paid for the same drug by the U.S. Department of Veterans Affairs.\nWe’ll be exploring how a specialty drug’s cost affects patient access. If you are a chronic disease patient who is having difficulty getting specialty drugs, we’d like to hear from you.\nComment below, tweet or email us.\nCALmatters is a nonprofit journalism venture dedicated to explaining state policies and politics. Pauline Bartolone wrote this article while participating in the California Data Fellowship, a program of the Center for Health Journalism at USC’s Annenberg School of Journalism.","url":"https://medium.com/california-s-legal-drug-dilemma/the-other-high-cost-drugs-what-specialty-drugs-mean-for-california-df18ddf1e632"}
