{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:08:41","date_modify":"2018-10-30 18:08:41","date_publish":"2015-10-29 18:01:52","description":"Speaker Paul Ryan has an incredibly difficult task ahead of him. But he can succeed if he does three things others have not.","filename":"data/vaneerConsumption/TheOnly3ThingsSpeakerPaulRyanNeedstoDo.json","image_url":"https://media.breitbart.com/media/2015/10/Speaker-Paul-Ryan-Alex-Wong-Getty-e1446320625176.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_29__1540922921.html","title":"The Only 3 Things Speaker Paul Ryan Needs to Do","title_page":"The Only 3 Things Speaker Paul Ryan Needs to Do | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Rep. Paul Ryan (R-WI) was elected Speaker of the House on Thursday, after convincing enough conservatives to support his bid. It was the latest milestone for the wonkish Jack Kemp protégé. Five years ago, Ryan could barely scrape together a dozen Republicans to support his budget proposals. Today, he is third in line for the presidency.\nRyan has an incredibly difficult task ahead of him. But he can succeed if he does three things others have not.\n1. Keep “regular order.” The Republican leadership promised voters that budgets would be handled as routine business, not as crisis; that bills would be posted for days online, instead of passed in the dead of night; that bills would not be brought to the floor without the approval of the majority of the ruling party. If Ryan can fulfill the promise of regular order, he will have set Congress back on the path to responsible governance and accountability.\n2. Create a new debt commission. The deeply flawed budget deal passed under outgoing Speaker John Boehner bought Ryan two years before another debt ceiling crisis hits. Now is the time for Ryan to re-convene a Simpson-Bowles-style commission on our chronic fiscal mess–one that will consider entitlement reform, and whose members are chosen by Congress, not President Barack Obama, who ignored the suggestions of the last panel.\n3. Keep the Sabbath. Before agreeing to run for Speaker, Ryan insisted that he be promised time with his family on the weekends. His colleagues agreed. But the hardest part of the bargain will be keeping up his end of it. Ryan needs to protect the boundary around his private life, so that he can better preserve the constitutional boundaries our government has so often violated. Adding a degree of religious obligation will help him maintain his commitment.","url":"https://www.breitbart.com/politics/2015/10/29/the-only-3-things-speaker-paul-ryan-needs-to-do/"}
