{"authors":[],"date_download":"2018-10-30 01:17:48","date_modify":"2018-10-30 01:17:48","date_publish":"2018-08-22 00:05:57","description":null,"filename":"data/vaneerConsumption/TheOpioidLawsuitCircus.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/1280px-Various_Opioid_Cessation_Products_24897156547.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862268.html","title":"The Opioid Lawsuit Circus","title_page":" The Opioid Lawsuit CircusThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Money-grabbing politicians looking to cover the whopping costs of the opioid crisis are filing over a thousand lawsuits against the prescription painkiller industry. That’s like suing the fast food industry to pay all the societal costs of obesity. It’s a shakedown.\nLast week, New York’s governor, Andrew Cuomo, jumped on the litigation bandwagon. Cuomo bashed “ unscrupulous ” drug companies for “ pumping human misery into our communities .”\nWrong, Governor. These painkillers are made to alleviate misery. Before the current generation of medical opioids, patients with pain were severely undertreated . In the 1990s, medical groups pleaded for wider use of opioids to curb suffering.\nPinning the entire overdose crisis on drug companies is scapegoating. It ignores scientific evidence that the biggest cause of opioid deaths are illegal drugs like fentanyl and heroin that are trafficked to young people. Prescriptions for high doses of opioids needed for chronic pain are down 41% since 2010 . Yet overdose deaths are higher than ever. Medical users are not the ones overdosing.\nHarvard and John Hopkins researchers find a minuscule six-tenths of one percent of patients prescribed opioids after surgery misuse them.\nOf the overdose victims who land in an emergency room, 89% are not pain patients , according to the Journal of the American Medical Association – Internal Medicine. They’re younger than typical pain patients , and they’re overdosing on stolen pills and street opiates. Blame pushers, not doctors and drug companies.\nThe problem is that these pushers aren’t getting punished. A Hartford man convicted of trafficking fentanyl and heroin that caused overdose deaths in four Connecticut towns was sentenced in May to probation only . Pushers are being treated as “nonviolent” criminals, a mistake. New York City Mayor Bill de Blasio yawns while drugs are sold in public parks .\nDe Blasio is one of the politicians trying to put the squeeze on drug companies with deep pockets. Pols are looking to collect billions of dollars to pay the staggering costs of opioid addiction, including Medicaid, policing, naloxone to reverse overdoses, and even foster care for addicts’ kids.\nFor politicians, the lawsuits are about publicity for themselves and filling the public trough. For their accomplices, trial lawyers, it’s personal gain. Politicians are selecting private law firms to handle these lawsuits. If these lawyers win, they will become wildly rich, taking home 25% to 33% of every payout.\nSeveral lead lawyers are veterans of the 1990s anti-tobacco litigation. The big difference is that opioid medications are not coffin nails. Nine million Americans with chronic pain need these drugs to get through their days.\nThe current lawsuits accuse manufacturers of “ misleading ” the public about the addictive nature of opioids. That’s a flimsy allegation, because the Food and Drug Administration constantly scrutinizes manufacturers’ websites, marketing brochures, and television ads for any false or misleading claims.\nPurdue Pharma — the manufacturer of OxyContin — has had run-ins with regulators . But most of the other companies being sued complied with FDA rules. Who are politicians to second guess medical experts at the FDA and accuse these companies of misleading statements? A federal judge in Chicago has already dismissed “misinformation” claims against all defendants except Purdue .\nBut another allegation could stick. Neither drug companies nor the federal Drug Enforcement Agency lifted a finger when huge orders of opioids were shipped to rural towns or mom-and-pop pharmacies where it’s implausible they were being medically consumed. The drugs were being diverted to the black market.\nLawsuits won’t solve that problem. Litigation’s a money grab. Huge sums change hands without any guarantee that policies will change for the better. Most of the money will land in the hands of the same politicians who have failed to stop the overdose crisis.","url":"https://spectator.org/the-opioid-lawsuit-circus/"}
