{"authors":["Christine Distasio"],"date_download":"2018-10-30 22:38:45","date_modify":"2018-10-30 22:38:45","date_publish":"2014-08-14 21:25:43","description":"I'm getting all choked up just thinking about this. There have been whispers around the Internet and even at The Originals' panel at San Diego Comic-Con 2014 that on Elijah and Hayley might not make it through Season 2. And, well, I simply refuse to…","filename":"data/vaneerConsumption/TheOriginalsSeason2TheoryHayleyElijahWillSurviveBecauseHeLovesChallengingWomen.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/2843b915-0bcb-4ddb-af51-690d324c66c9.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35739-the-originals-season-2-theory-hayley-elijah-will-survive-because-he-loves-challenging-women_1540939125.html","title":"'The Originals' Season 2 Theory: Hayley & Elijah Will Survive Because He Loves Challenging Women","title_page":"'The Originals' Season 2 Theory: Hayley & Elijah Will Survive Because He Loves Challenging Women","title_rss":"NULL","source_domain":"bustle.com","text":"I'm getting all choked up just thinking about this. There have been whispers around the Internet and even at The Originals' panel at San Diego Comic-Con 2014 that on Elijah and Hayley might not make it through Season 2. And, well, I simply refuse to believe it — mostly because the other alternative to Haylijah seems to be a romance between Klaus and Hayley when The Originals premieres its second season on Oct. 6. Calling all Klaroline 'shippers, do I even need to explain why that would be a catastrophe? But, thankfully, there may not be a reason for anyone who supports Klaroline's sister-'ship, Haylijah, to be worried at all. Not even a little bit.\nExecutive producer Michael Narducci dropped a huge bomb at Comic-Con that made it sound like fans might lose the only established, viable 'ship on The Originals in Season 2 all because Hayley's a hybrid now. Narducci told fans that Elijah will have a moment where he questions his feelings and asks, \"Is there a connection between my brother and Hayley that I could never surpass?” And will subsequently wonder whether or not he can really help Hayley go through the loss of her baby and her transition into being a hybrid better than Klaus can. (Klaus does get it, but let's not forget who's been with Klaus this whole time.)\nAnd while I'm disappointed that Elijah won't be as steadfast as he usually is in Season 2 — he's kind of operated as an Original family moral center for awhile now — shit is really going to hit the fan with Hayley. In the official trailer for The Originals Season 2, Hayley's all over the place — she's depressed about losing Hope, she's killing people left and right, and she seems to have lost her humanity entirely. This isn't the same girl he fell in love with and, well, he's got a lot of other crap to deal with — like Esther and Mikael coming back and holding the White Oak Stake to his throat. It's not exactly the ideal situation to address their kiss at the end of Season 1 and the feelings they so obviously have for each other.\nBut here's why we absolutely shouldn't be worried, Haylijah 'shippers — Elijah has a history of sticking by his challenging women and Klaus. And, unlike the rest of the complicated and downright evil relationships he's kept together in the past, at least Hayley has a reason for acting out and she actually needs his help.\nHere's what fans know for sure about Elijah's love life: Before he became a vampire, he fell in love with a vampire. Or rather, he fell in love with another doppelgänger named Tatia, who lived in their family's village and whose blood Esther gave her children to make them immortal. Aside from the fact that she turned him into a vampire, thus damning him to thousands of years of being hunted by Mikael, she also couldn't choose whether she loved him or Klaus. Sigh — the struggle and the Original challenging woman in his life.\nElijah later met Katherine, when she was still going by Katerina (way, way back, ya know) and ended up falling in love with her while he and Klaus were luring her to death to break the hybrid curse. Any TVD fan knows that Katherine is probably the absolute worst, most manipulative human/vampire that ever walked the Earth. Essentially, Katherine manipulated Elijah and escaped, leaving him to pick of the pieces of his relationship with Klaus. But, apparently, he really loved her because when TVD Season 4 rolled around, Elijah and Katherine had secretly rekindled their relationship and were hiding out together. Centuries later, Elijah was ready to stick by the woman that ruined his relationship with Klaus — that's commitment.\nLast but not least, we come to Celeste, who we only met last season on The Originals. Celeste was basically queen bitch — oh wait, did I just say that? I meant queen witch. He mourned her when Klaus killed in the early 1900s and was clearly disappointed when he learned that she'd been jumping from body-to-body and had been alive this entire time without contacting him. He'd loved her, he'd apologized to her corpse for what she'd gone through as a result of their relationship. And even when he discovered her last season in Sabine's body AND he knew that she wanted to kill him and Klaus, he still had a hard time letting go. This guy really doesn't know how to pick his women. Just saying.\nSo, I can't see him just giving up on Hayley in her condition. These three women were just evil and cruel and manipulative, Hayley, on the other hand, is none of those things. She's been dealt a really terrible hand, but that doesn't make her feelings for Elijah any less real or negate everything he did for her during Season 1 — including prevent Klaus from killing her and Hope in the pilot. And, while she may be a hybrid now and that changes things, it doesn't change them any more than when she was a werewolf and he, a vampire. In fact, they might actually have more in common now than they did before and there's also the added bonus that Elijah's been by Klaus' side since Day 1 of his hybrid life.\nElijah gets hybrids, he gets complicated women, and he gets Hayley — there's no reason for him to feel inferior. And, well, there was also that kiss. In case he needs further reassurance that this 'ship is endgame.\nImages: Bob Mahoney/The CW; Fanpop; Degrassi/Wikia; fuckyeahhayleyandelijah/Tumblr","url":"https://www.bustle.com/articles/35739-the-originals-season-2-theory-hayley-elijah-will-survive-because-he-loves-challenging-women"}
