{"authors":[],"date_download":"2018-10-30 00:51:20","date_modify":"2018-10-30 00:51:20","date_publish":"2018-08-21 00:05:37","description":"The German government has just decreed that all \"cheating\" VW diesels not turned in by their owners for \"fixing\" will be de-registered.","filename":"data/vaneerConsumption/TheOtherShoeHasDroppedintheVWDieselWars.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/1024px-Volkswagen_Jetta_diesel_registered_July_2011_1968cc_cropped.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860680.html","title":"The Other Shoe Has Dropped in the VW Diesel Wars","title_page":"The Other Shoe Has Dropped in the VW Diesel WarsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The German government has just decreed that all “cheating” VW diesels not turned in by their owners for “fixing” will be de-registered. This means they can’t legally be driven, have been rendered inert — several thousand pounds of deadweight their owners can no longer use.\nAt least, not without risking more serious repercussions.\nGermany’s federal motor vehicle authority, the KBA, had already de-registered Audi and VW cars fitted with the “affected” Euro 5 diesel engines after owners ignored successive reminders to heed a voluntary recall.\nRecalls, of course, usually pertain to cars that have something wrong with them which makes them unsafe to drive. This is the first time a car that works perfectly has been subject to a recall — one which results in the “fixed” cars working less well.\nThe “fix” entails making various adjustments to the “affected” car’s computer code — or the grafting on of a Diesel Exhaust Fluid (DEF) injection system. The end result is a mauled car that delivers lower mileage but is now compliant — like the 87-year-old lady recently Tasered by armed government workers in Georgia.\nFurther vehicles are at risk of being taken off the road in the German state of Bavaria but have been given a “grace period” to get the “fix” done.\nHow nice.\n“The recall [for affected VW diesel cars] is compulsory. Cars that are not fixed can eventually be taken out of service. Subject to the release date of the updates, the car owner has had about a year and a half. Plenty of time, to take part in the recall,” the KBA told the trade publication Automotive News Europe in an emailed statement.\nThe question now is: Will the American government pursue a similar policy? To make American VW owners more… compliant.\nCurrently, there is no sanction directed at U.S. owners of the “affected” VW and Audi (and Porsche) vehicles who declined the still-voluntary “fix” — and who did not accept the buyback offer VW was forced to make.\nBut what will happen going forward?\nMany owners of these vehicles like them just fine, just as they are — and have no interest in getting them “fixed.” For the same reason most people prefer to remain… intact, so to speak.\nThere is even less incentive to have the cars “fixed” as there’s zero benefit to the owner. The car will not perform better or deliver higher fuel economy. The “fix” affects the car’s exhaust emissions, correcting the fractional increase under certain driving conditions of oxides of nitrogen (NOx) emissions, at the expense of fuel economy and drivability. You’ll lose a couple of MPGs. It’s not a big difference, but it’s not a positive difference.\nWhich is why many people have decided not to bring their cars in for fixing. But this amounts to a challenge to the Authority of Uncle — and so it’s a good bet something like “de-registering” will eventually be used here as well.\nTo nudge owners of the “affected” vehicles into compliance.\nOf interest — or should be of interest — is the fact that the un-fixed VWs have no trouble passing the emissions tests required in most states to get (and) renew vehicle registration.\nWhich begs the question: If the actual emissions of these “affected” VWs is so low as to be undetectable by the tests — or at least, within whatever the spec is that determines whether a car passes or fails the test — what is the problem?\nThe fact that the cars do pass these tests is strongly persuasive evidence that the “cheating” amounts to hair-splitting differences that are literally immeasurable.\nAs always, the problem is defying Uncle — whether any harm has been caused being immaterial. VW is being taught a lesson about “cheating” in the same manner as the person who neglects to pay his “fair share” come April.\nIf you happen to own one of the “affected” VWs, consider what’s going on in Germany a preview of what will probably go on here.","url":"https://spectator.org/the-other-shoe-has-dropped-in-the-vw-diesel-wars/"}
