{"authors":["Pauline Bartolone","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:54:08","date_modify":"2018-10-30 22:54:08","date_publish":"2016-01-20 08:00:00","description":"California will be a flashpoint in the policy debate this year around reining in the cost of high-priced prescription drugs. A measure expected to be","filename":"data/vaneerConsumption/TheobscurityofdrugspendinginMediCal.json","image_url":"https://calmatters.org/wp-content/uploads/pillhand.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940048.html","title":"The obscurity of drug spending in Medi-Cal","title_page":"The obscurity of drug spending in Medi-Cal | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"California will be a flashpoint in the policy debate this year around reining in the cost of high-priced prescription drugs.\nA measure expected to be before voters this November would restrict the state’s payments for drugs to no more than the lowest prices paid for the same drug by the U.S. Department of Veterans Affairs.\nAnd an unlikely coalition of health insurers, labor and consumer advocates promises to keep pushing for controls on high-cost drugs, after a state Assembly bill that would have forced pharmaceutical manufacturers to disclose their costs stalled in committee last week.\n“California is truly ground zero for this fight,” says Mike Roth, spokesperson for the campaign to pass the California Drug Price Relief Act, about efforts to lower prescription drug costs. The ballot initiative’s campaign is funded by the AIDS Healthcare Foundation. “It is clear Congress as a whole is not going to take meaningful action.”\nOver the coming months, CALmatters will investigate how specialty and other high-cost drugs are affecting the state budget, particularly Medi-Cal, which covers almost one in three Californians.\nBut as we’ve learned so far, just as there may be a lack of transparency about how drug makers price drugs, what is actually spent on a particular drug is also obscured — by confidentiality laws.\nSources with the California Department of Health Care Services told us that both federal and state laws prevent the public from knowing the ultimate price the state pays for a particular drug. Drug price negotiations contain proprietary information, trade secrets.\n“There’s a lack of transparency all through this,” says Joel Hay, professor of pharmaceutical economics and policy at the University of Southern California. “You don’t know anything about these confidential price rebates, and you never will.”\nHay said researchers only have “vague ideas” of the drug price discounts given to health care programs like Medi-Cal, but there is a public benefit to keeping them confidential: It helps ensure that health programs that cover the poor keep receiving discounts.\nIf, for example, California’s discounted drug prices were public, Hay said, insurance companies and other health care payers would demand the same price. In that scenario, manufacturers may decide to sell the drug at the same amount to everyone. Without a discount, the price may be too high for Medicaid, and California might be forced to limit access to brand-name drugs.\n“The State of California, to protect the taxpayers, and to protect the funding for its Medi-Cal recipients, is not going to reveal the confidential rebates it gets,” Hay said.\nThere are other challenges to identifying overall state drug spending trends in Medi-Cal. The program has two payment systems for its 12.8 million members. Roughly 80 percent of recipients have coverage through health plans, and services for the rest are reimbursed directly by the state.\n10.1 million Medi-Cal members get care from 22 managed-care organizations, and their spending on prescription drugs — on a “granular” level — is neither aggregated nor public.\nThe state Department of Health Care Services puts the fee-for-service population’s prescription usage data online, but it doesn’t disclose the final price it pays for drugs.\nThere’s reason to believe the state is feeling the cost pressure of new Hepatitis C drugs like Sovaldi, drugs which California says cost $85,000 per course of treatment.\n“It’s a very serious problem,” said California Health and Human Services Secretary Diana Dooley about the high cost of prescription drugs.\nDooley says drug prices are a problem for many health care payers; CalPERS, Medi-Cal and private insurers, too. The state is addressing the issue “in every way (it) can.”\n“There are very few tools in our toolbox,” Dooley said.\nOver the next few months, CALmatters will find out more about measures the state is taking to manage high-cost drugs. We’ll blog pieces of the drug spending picture along the way on Medium and CALmatters.org; on how per-member prescription drug spending has changed over time, which drugs account for the most spending, who they benefit, and how patient access is affected by a drug’s cost. Our blog posts will culminate in a story we’ll distribute to CALmatters’ print, online and radio news partners throughout California.","url":"https://calmatters.org/articles/the-obscurity-of-drug-spending-in-medi-cal/"}
