{"authors":["Bryan Logan"],"date_download":"2018-10-30 20:45:50","date_modify":"2018-10-30 20:45:50","date_publish":"2016-12-28 00:00:00","description":"No, the BMW 330e is not a fully electric car like the Tesla Model 3, but this could be a preview of what's to come.","filename":"data/vaneerConsumption/TheotherModel3BMWsplugin3Seriesisthehybridyoudidntknowabout.json","image_url":"https://amp.businessinsider.com/images/5863f526ee14b62a008b5884-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bmw-330e-plug-in-review-2016-12_1540932350.html","title":"The other Model 3: BMW's plug-in 3 Series is the hybrid you didn't know about","title_page":"    The other Model 3: BMW's plug-in 3 Series is the hybrid you didn't know about - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The Tesla Model 3's debut was, hands down, the biggest electric-car unveiling this year. Its splashy reveal in March brought Tesla millions of dollars in deposits from potential buyers — many of whom lined up at Tesla stores like customers do ahead of a new iPhone launch.\nBut, the Model 3 is still a long way off. Those who didn't get in on the initial wave of orders, likely won't take one home until well into 2018 or later. There are still quite a few electric and plug-in hybrid vehicles to tide the market over until the Model 3 comes through and steals everybody's thunder.\nAmong them — the BMW 330e. The plug-in hybrid version of the iconic sports sedan you probably didn't know about.\nBMW unveiled the 330e in 2015 — months before Tesla would shatter expectations with a Model 3 prototype that quickly garnered hundreds of thousands of preorders. The 330e is one example of BMW's move toward more mainstream green cars, which include the all-electric i3 compact and the plug-in hybrid i8 sports coupe.\nThe 330e and its SUV counterpart, the X5 xDrive40e, could potentially be a preview of more plug-ins (or perhaps fully electric) BMWs to come.\nThe automaker recently dropped off a 330e for us to test. Here's how it went.","url":"https://www.businessinsider.com/bmw-330e-plug-in-review-2016-12"}
