{"authors":["Peter Allen In Calais For Mailonline"],"date_download":"2018-10-22 23:29:34","date_modify":"2018-10-22 23:29:34","date_publish":"2016-01-29 11:24:32","description":"Mo Ahmed and Ahmed Shah, both 10, live in the Jungle in Calais, France, and are among a growing number of Syrian children fleeing from their homelands in the hope of reaching Britain.","filename":"data/vaneerConsumption/TheorphanrefugeechildreninCalaisjungleDavidCameronwonttake.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1871600000578-0-image-a-94_1454066426672.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422601_Fleeing-war-refugee-children-Calais-jungle-NO-parents-3-000-orphans-Cameron-won-t-take_1540250974.html","title":"The orphan refugee children in Calais jungle David Cameron won't take","title_page":"The orphan refugee children in Calais jungle David Cameron won't take | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Looking scared and utterly alone in life, little Mo Ahmed wanders around the jungle refugee camp in Calais dreaming of a country he simply calls 'UK'.\n'UK, UK,' says the child, as he points in the direction of England, less than 30 miles across the Channel.\nThe ten-year-old Syrian is one of a growing number of orphans who hope to claim asylum in their chosen European country.\nMo Ahmed (left) and Ahmed Shah (right), both 10, live in the jungle in Calais, France, and are among a growing number of Syrian children fleeing from their homelands in the hope of reaching Britain\nHe does not speak any more English, and relies on fellow travellers to keep an eye on him as he waits for a chance to leave France.\nThrough an interpreter, he told MailOnline that many members of his family had been killed during the bitter fighting in his homeland.\n'My mother and father died, and I was left to get away by myself,' said Mo. 'It has been very hard, but people have been very kind.\n'Now I want to go to the UK, where I will have a chance to go to school and to have a safe life with good people'\nSave the Children has urged Britain to take in 3,000 orphaned refugee children who are in Europe.\nBut the plea has been rejected by David Cameron amid fears it could encourage more to make the treacherous journey across the continent.\nTen-year-old Syrian is one of a growing number of orphans who hope to claim asylum in their chosen European country - the UK\nThe number of children has dropped markedly around the Jungle over the past few weeks, as the French try to move them into more secure accommodation\nInstead, the UK could take in unaccompanied children from refugee camps nearer to the Syrian border.\nIt is impossible for the authorities to verify Mo's story – many children give false names, and make up other details of their lives because they are scared of officials.\n'We were always being attacked by men with guns and bombs,' said Mo. 'Of course there may be some of them who will come here to hurt us. We need protection – security is very important.'\nMy mother and father died, and I was left to get away by myself Ten-year-old orphan, Mo Ahmed\nMo has befriended Ahmed Shah, another ten-year-old Syrian boy, and the pair stand out as they play in the squalid refugee camp, just a couple of miles from the ferry port in Calais.\n'We're great friends and we love to play together,' said Mo. 'We both come from the same country, and have had some terrible times.'\nThe number of children has dropped markedly around the Jungle over the past few weeks, as the French try to move them into more secure accommodation.\nBut Syrians like Mo and Ahmed continue to arrive by the day, as the five-year long war in their country intensifies.\nThe UN Human Rights Commissioner estimates more than 4million people have left the country since the conflict broke out in 2011, with an additional 7.6million people displaced within the country.\nMo (pictured) relies on fellow travellers to keep an eye on him as he waits for a chance to leave France\nThe main fear is that children will fall prey to criminals including pimps and paedophiles targeting the young and vulnerable\nMeanwhile, thousands of refugee children have simply walked out of camps in the Middle East, blending in to vast crowds heading towards Europe.\nRefugees cannot be detained in migration centres by force so if they want to leave, there is nothing the authorities can do.\nOnce in Europe, Syrians have joined up with other migrant children from countries such as Eritrea, Sudan, Afghanistan and Somalia.\nSome 13,000 unaccompanied minors reached Italy alone in 2015, and often the only word of English they had was the name of their chosen destination.\nThe main fear was that they would fall prey to criminals including pimps and paedophiles targeting the young and vulnerable.\nSave the Children has urged Britain to take in 3,000 orphaned refugee children who are in Europe. Refugees staying in the Calais jungle are pictured making a break from the camp towards the Euro Tunnel\nRefugees queue for aid at the Calais jungle. The number of children has dropped markedly around the Jungle over the past few weeks, as the French try to move them into more secure accommodation\nMichela Vittoria Brambilla, head of a parliamentary commission on children in Italy, which is often the place of entry for children such as Mo and Ahmed, said: 'It's a crisis within the broader migration crisis. I appeal to the government to dedicate more attention to the problem.'\nA spokesman for the British charity Save the Children said: 'Unaccompanied children are at the greatest risk from people traffickers. Some are being forced into manual labour, domestic work, drug smuggling and prostitution.'\nCalais council meanwhile insisted that it was working with aid groups to make sure that youngsters like Mo and Ahmed were well looked after.\n'In terms of humanitarian aid, children without guardians are our priority,' said a council spokesman.\n'That's why there are fewer of them around the camp. Our priority is to make sure all are housed, and given help in working out their futures.'\nCalais council insists that it was working with aid groups to make sure that youngsters like Mo and Ahmed were well looked after\nThe British government has said it will accept more unaccompanied child refugees from Syria and other conflict zones\nThe British government has, meanwhile, said it will accept more unaccompanied child refugees from Syria and other conflict zones.\nThe Home Office will work with the UN High Commissioner for Refugees to identify 'exceptional cases' from camps in Syria and neighbouring countries.\nThe government also said it was giving £10m to help vulnerable refugee minors already in Europe – some could be brought to\nthe UK 'where it is in their best interests', said a spokesman.","url":"https://www.dailymail.co.uk/news/article-3422601/Fleeing-war-refugee-children-Calais-jungle-NO-parents-3-000-orphans-Cameron-won-t-take.html"}
