{"authors":["Angelica Florio"],"date_download":"2018-10-31 01:43:17","date_modify":"2018-10-31 01:43:17","date_publish":"2018-09-14 15:47:40","description":"Spoilers ahead. Since Arnold Schwarzenegger starred in 1987's Predator, various sequels have come out over the years, each with their own variation of the same title. There was 1990's Predator 2, then 2010's Predators, and now on Sept. 14, The…","filename":"data/vaneerConsumption/ThePredatorPostCreditsSceneDoesntExistButTheMovieStillTotallySetsUpASequel.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/3e65e81d-c540-4d1d-b79a-48f26a19a51e-screen-shot-2018-09-13-at-41021-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-predator-post-credits-scene-doesnt-exist-but-the-movie-still-totally-sets-up-a-sequel-11909602_1540950197.html","title":"'The Predator' Post-Credits Scene Doesn't Exist But The Movie Still Totally Sets Up A Sequel","title_page":"'The Predator' Post-Credits Scene Doesn't Exist But The Movie Still Totally Sets Up A Sequel","title_rss":"NULL","source_domain":"bustle.com","text":"Spoilers ahead. Since Arnold Schwarzenegger starred in 1987's Predator, various sequels have come out over the years, each with their own variation of the same title. There was 1990's Predator 2, then 2010's Predators, and now on Sept. 14, The Predator hits theaters around the U.S. The movie has a lot of exciting additions to the series, such as a killer cast that includes Trevante Rhodes, Boyd Holbrook, Keegan-Michael Key, Olivia Munn, and Sterling K. Brown, among others. The Predator doesn't have a post-credits scene though, so you can factor that in while making plans to see the new action/sci-fi thriller.\nEven though The Predator follows Predators in the chronology of all the Predator movies, this new installment refers to both Predator 2 and the original Predator the most. What happened in 2010 Predators doesn't even really matter to the new alien-invasion movie, so in a sense The Predator serves as a revitalization of the original series. It makes sense, then, that you might expect a post-credits scene to follow the The Predator's end setting up a sequel.\nYet while another installment to the series very well could get made in the coming years, it seems that no plans for one exist now. The Predator totally still does set up another movie, though, since the ending includes two main characters discovering a new potential strategy for defeating their adversaries.\n20th Century Fox on YouTube\nMost audiences will probably want to see another Predator movie to come out in the near future following this one considering that the current cast of the new film is chock full of major stars. There's no doubt that fans will leave the theater wanting to see more of this all-star cast acting together.\nIn addition from the ending of The Predator hinting at a potential fifth Predator movie, the new movie has a potential for becoming a somewhat realistic apocalypse series, unfortunately. See, part of The Predator's story relies on the fact that the alien invasions become more frequent due to the climate's increasing changes. As global warming progresses, the Predators must harvest as many humans as they can, while humans still exist. That storyline doesn't make up the entire plot of The Predator, but it certainly could become more of a main story of a future Predator film should director Shane black choose to make one.\nAccording to CBR.com, Black doesn't want to get ahead of himself as far as directing sequels go, however, and that could explain why The Predator doesn't have a post-credits scene. In July, the director said, \"I would love to say we’ve been planning a trilogy, but I take one day at a time... in motion-picture terms, that’s one movie at a time.\"\nTime will tell if Black and the cast of The Predator will want to join together for yet another version of the '80s series. Considering that the movie has faced controversy upon its release, it might not happen. So for now, you'll just have to enjoy The Predator as it is, without a post-credits scene and an uncertain future.","url":"https://www.bustle.com/p/the-predator-post-credits-scene-doesnt-exist-but-the-movie-still-totally-sets-up-a-sequel-11909602"}
