{"authors":["David Lesher","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:12:43","date_modify":"2018-10-30 23:12:43","date_publish":"2016-09-18 16:25:55","description":"We are excited to launch a new project about California’s pension debt crisis that is a collaboration between CALmatters, the Los Angeles Times and","filename":"data/vaneerConsumption/ThePensionCrisisAboutthisproject.json","image_url":"https://calmatters.org/wp-content/uploads/pensionprojectIllus.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540941163.html","title":"The Pension Crisis: About this project","title_page":"The Pension Crisis: About this project | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"We are excited to launch a new project about California’s pension debt crisis that is a collaboration between CALmatters, the Los Angeles Times and Capital Public Radio\nIn print, online and over the airwaves, this series will explore the consequences of a historic expansion of retirement benefits for California public employees. A series of pension enhancements, beginning with a 1999 law known as SB 400, has created a huge gap between California’s obligations to current workers and retirees and the funding available to pay them. Future articles will examine the impact of pension costs on local government, the politics of pension reform and related subjects.\nYou can see the project here\nAs we pass our one year anniversary at CALmatters, this is our first project collaboration and we are grateful to partner with two of the state’s major media organizations. Our mission is to raise public awareness about important California issues. With this collaboration, we have an opportunity to inform audiences throughout the state on print, digital and broadcast platforms over the coming months. As we all know, media is evolving and this collaboration is a model of the change, leveraging resources beyond an individual organization and reaching a bigger, combined audience. In addition to our collaboration partners, CALmatters is also making all of the content produced in this series available to print and broadcast media throughout the state.\nAs a nonprofit, our work is supported by philanthropy from individual donors and foundations. Our donors must agree to a statement of editorial independence that prohibits any influence or interference with our work. You can read the statement here . For this project, journalists interviewed two CALmatters donors–Gerald Parsky and David Crane–for these stories. Parsky led a bipartisan commission on public employee retirement benefits in 2008 and Crane was special advisor to former Gov. Arnold Schwarzenegger on pension financing.\nThank you for your interest in CALmatters. And please share any feedback about this project or about our work.\nThank you,\nDavid Lesher","url":"https://calmatters.org/articles/the-pension-crisis-about-this-project/"}
