{"authors":[],"date_download":"2018-10-22 21:17:38","date_modify":"2018-10-22 21:17:38","date_publish":"2014-06-04 21:47:00","description":"Griffin Furlong never missed a day of class or a day of baseball practice: find out how he overcame some of life's toughest obstacles.","filename":"data/vaneerConsumption/ThePowerofAmbitionHomelessValedictoriantoAttendFSU.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/488241/florida_teen_615fce3916b073375b4c49a8179c1ba5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_power-ambition-homeless-valedictorian-attend-fsu-n122881_1540243058.html","title":"The Power of Ambition: Homeless Valedictorian to Attend FSU","title_page":"The Power of Ambition: Homeless Valedictorian to Attend FSU","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGriffin Furlong is a Florida teenager who knows something about heartaches and joy.\nThe 18-year-old is homeless, but he graduated at the top of his class from Florida Coast High School in Jacksonville.\nFurlong managed to achieve a 4.65 grade point average -- putting him at the top of his class and making him the valedictorian. He’ll attend Florida State University in the fall and plans to study civil engineering.\n“Everyone thinks I try to make good grades because I’m smart. Not true,” he told his fellow graduates.\n“I perform the way that I do in the classroom because I have everything to lose. I make the grades I do because I was once lost and had nothing.”\nFurlong’s mother died of leukemia when he was just 6 years old.\nSoon afterward, Furlong, his father, and older brother lost their home and ended up in homeless shelters.\nFurlong said he often went to bed hungry and there were times when he wanted to give up.\n“I never had a full childhood. I felt like I wasn’t even human anymore. And I would just think to myself at night, 'Do I continue to do this or do I make something of myself?'\"\nFor a while the family had a rental home, but this past April, just before finals and AP exams, Furlong was homeless again.\n“No kid should have to live like this,” Furlong said.\nHe sought temporary shelter with his girlfriend’s parents then moved in with an aunt and uncle, who said Furlong had laser-like focus on his school work.\n“He had nothing else but to study,\" said his aunt, Nancy Nancarrow. “He didn’t have the things that most children have: the TV, you know all those things. He would go to his room when he was home and he studied. That is his entertainment. We’re proud of him.”\nFurlong never missed a day of class or a homework assignment.","url":"https://www.nbcnews.com/nightly-news/power-ambition-homeless-valedictorian-attend-fsu-n122881"}
