{"authors":["Judy Lin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:48:01","date_modify":"2018-10-30 22:48:01","date_publish":"2016-01-30 08:00:00","description":"VALLEJO, Calif. -- Vallejo High School teacher Lewis Brown starts his morning government class with a question of the day that takes advantage of newly","filename":"data/vaneerConsumption/Thepriceofeducation.json","image_url":"https://calmatters.org/wp-content/uploads/education_feature_image.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939681.html","title":"The price of education","title_page":"The price of education | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"VALLEJO, Calif. — Vallejo High School teacher Lewis Brown starts his morning government class with a question of the day that takes advantage of newly assigned iPads.\n“Today is the one year anniversary of the French magazine terrorist assassination,” Brown says. “What was the name of the magazine?”\nThe seniors type on their tablets. In seconds, 17-year-old SioFilisi Anitoni answers from the back row, “Mr. Brown, Charlie Hebdo.”\nVallejo City Unified School District is using increased state funds to assign iPads to each of its roughly 1,000 high school students. The district in a working-class community along the north San Francisco Bay is also hoping to improve classroom learning by raising teacher salaries and spending more than $2.5 million on new computer and science labs.\nUp and down California, public schools are enjoying a rapid rise in state funding. With the state’s economic gains and a temporary tax increase approved by voters in 2012, Gov. Jerry Brown’s proposed $71.6 billion education budget for the next fiscal year is up more than 50 percent since 2011. Spending per student has increased more than $3,800 to a projected $14,550 this year.\nSchools that handed out tens of thousands of pink slips in the depths of the recession are now scrambling to find qualified teachers, a problem driven in part by low recruitment and high turnover. Teachers are receiving raises and schools are offering signing bonuses. Counselors, librarians and other support staff are being added along with new textbooks and technology equipment.\nThe welcome lift has made up much of the hardship that schools suffered in the recession. But California still ranked 41st in the nation for per-pupil spending in 2013, the most recent year available. And looking ahead, educators see financial challenges that are significant enough that they hope to qualify a ballot measure this year to extend some temporary taxes.\nVoters approved temporary income and sales taxes under Proposition 30 in 2012 to generate about $8 billion per year for schools. They will phase out by the end of 2018. At the same time, a recent agreement to pay down more than $67 billion in unfunded debt for teacher pensions is expected to consume about 38 percent of the projected growth in the school budget through 2019.\nThat’s if the economy stays healthy. If there is a recession, as Brown has warned, budget forecasters say schools could be forced once again to lay off teachers and cut costs.\n“We are enjoying a couple of brief years of impressive recovery in school funding after many years of deep cuts, but these year-over-year gains are not sustainable over time,” said Jack O’Connell, former state superintendent for public instruction now a partner at the government consulting and lobbying firm Capitol Advisors Group, LLC. “If you look at the potential cut off of Prop. 30 tax revenues and huge growing costs of the retirement debt, schools will see most of their annual increases evaporate.”\nThe pension agreement reached by Brown and state lawmakers in 2014 is intended to eliminate the debt in 30 years. It raises pension contributions for teachers and for the state, but only slightly. Most of the obligation was given to school districts, where contributions will more than double from 8.25 percent of their payroll in 2013 to 19.1 percent in 2020.\nIn other words, school districts will pay $3.1 billion more to the pension system in the 2019-20 fiscal year than they do today while the minimum school budget guaranteed by Proposition 98, is projected to be about $8.3 billion higher in that same year, according to projections by the Legislative Analyst’s Office, the Legislature’s nonpartisan budget analyst.\nIf California slips back into recession, the legislative analyst warned that the pension obligations could grow faster than school budgets, likely forcing districts to cut elsewhere.\nSome also worry that California’s pension plan relies on robust returns. It assumes an annual 7.5 percent investment return in a system that has earned 7.8 percent over 20 years. If the pension system only yields 7 percent, the plan could fall 20 percent short of the goal to eliminate the debt by 2046, according to the California State Teachers’ Retirement System.\nIn his 2016 State of the State address, Brown said “it is our moral obligation” to chip away at $220 billion in outstanding debt for teacher pensions as well as retiree health care and pension benefits for all state workers. “Each year, the budget must allocate billions to slowly chip away at these obligations,” he said.\nThe concern about funding comes as California is implementing a set of new policies to improve academic outcomes.\nThe lagging performance of low-income, Latino and African-American students is stark. In the state’s most recent batch of standardized tests, less than one in four low-income or Latino children and less than one in five African-American children scored high enough to be considered proficient in math. About half of white students and more than two-thirds of Asian students measured as proficient on the same test.\nUnder Brown, California has dramatically changed how it allocates money by giving every school a base grant with additional funds for each student who is low-income, an English learner or a foster child.\nThe plan — known as the Local Control Funding Formula — gives considerable discretion to districts about how they spend the money. They are also not required to report their spending choices to the state, raising concern among some lawmakers about whether the money will benefit the intended students.\n“How it will play out is the biggest question,” said Assemblywoman Shirley Weber (D-San Diego), a former school board member and chair of the Assembly Budget Committee. “Clearly, some money will go into staff development, but it is our hope that it’ll make its way into the classroom and make a difference for our children.”\nThe lion’s share of increased funding has gone to teacher and staff salaries and benefits, which includes new hires and increased pay and benefits for existing staff.\nNationally, California ranks among the highest in teacher salaries and the California Department of Education reports that the average salary for teachers and some credentialed staff has grown 10.6 percent, from $66,995 in 2008 to $74,090 in 2014. In terms of keeping up with inflation, however, those salaries are just below their purchasing power in 2009.\nQuestions have been raised about how much of the school budget should be allowed for raises. Weber voiced concern last year after state Superintendent of Public Instruction Tom Torlakson declared that money intended for low-income students, English learners and foster children could be used for across-the-board teacher raises. His decision “makes no connection to more equitable (academic) outcomes and use of those funds for salaries,” Weber wrote in an editorial on behalf of the Legislative Black Caucus.\nSchool officials, including those from disadvantaged communities, say better pay is necessary in order to hire and retain qualified teachers in a state with a high cost of living.\nDuring the recession, when Vallejo City Unified School District Superintendent Ramona Bishop said the district laid off and furloughed staff, starting credentialed teacher salaries were under $40,000. They are now at $46,475. The top of the scale has gone from $71,855 to $79,756.\nBishop says she’s proud to be able to offer $2,000 signing bonuses for math and science teachers and to log three consecutive years of pay increases for teachers in a district where nearly 20 percent of students are English learners and more than 71 percent qualify for free or reduced-priced meals.\nSanta Clara Unified School District, a more affluent community that has received limited state increases, chose to use all of its additional funding to provide its 891 teachers a raise. Andrew Lucia, the assistant superintendent for human resources, said after going without salary increases for seven years, the school board approved a 3 percent salary increase in 2013, followed by an 8 percent boost in 2014. There were bonus checks and insurance benefits as well.\nEven with the recent budget increases, however, some school districts say they are still facing difficult financial choices. And in some districts, concern about a possible recession and other financial challenges ahead caused educators to use at least some of their recent increases on one-time expenses.\nBrown is warning that a downturn is inevitable. To drive home his point, he displayed a chart at his budget press conference in January projecting a $43 billion deficit if the state committed to new spending before a recession. If the state enters a recession, the Legislative Analyst’s Office projects school funding will fall by $4.6 billion in 2017 and not recover to current levels until 2019.\n“We’re being very conservative,” says Long Beach Unified School District Assistant Superintendent Jill Baker. “A lot of it is coming in with one-time funds so we’re thinking about things we couldn’t do before, but not for ongoing expenses.”\nFor example, she said the district is using increased funds to add a training center. The district is also spending $6 million to convert 14 year-round schools back to a traditional schedule to offset the district’s declining enrollment, the primary way schools get funding. The district has lost more than 15,000 students in the past decade. It’s now down to 77,400.\nClass sizes haven’t been reduced dramatically. During the recession, Long Beach raised class sizes in kindergarten through third grade to 30-to-1 from 20-to-1. Baker says the ratio is only down to about 26-to-1. Instead, the district invested in updating curriculum, like a computer coding program for students as young as kindergarten.\nIn Sacramento’s suburb, Folsom Cordova Unified School District Superintendent Deborah Bettencourt said the district added licensed family therapists to help middle and high school students struggling with bullying or to cope with chaos at home. Bettencourt says she has no plans to resume daily classroom cleaning by janitors because it’s not as high a priority as improving technology or providing academic support.\nLos Angeles Unified School District, home to more than 10 percent of the state’s 6.2 million kindergarten through high school students, continues to face structural imbalances despite increased state funding. According to a November independent financial report, the mammoth district is facing declining student enrollment and a long-term deficit that could force the system into bankruptcy.\nIf voters don’t approve an extension of the temporary taxes on this year’s ballot, John Walsh, the district’s chief financial officer, said Los Angeles will see “a significant hit to the bottom line, no doubt about it.”\nThe California Teachers Association, the California Federation of Teachers, California State Parent Teacher Association as well as other public employee unions, hospitals and doctors are pushing an initiative to stop the scheduled expiration of temporary taxes.\nThe groups will need to turn in at least 585,000 valid signatures by June 30 to qualify a version of the measure for the November ballot. The proposed measure would extend higher income taxes on individuals earning more than $250,000 a year through 2030. It would let a quarter-cent sales tax in Proposition 30 expire.\n“The (economic) crisis going on in China and ripple effect worldwide suggest there is a degree of volatility in the economy we have to consider,” said Joshua Pechthalt, president of the California Federation of Teachers. “What we’re asking is people at the top end of the economic spectrum pay a little bit more. There hasn’t been an exodus of people living in Malibu and Beverly Hills.”\nBetween the tax extension and the economy, the Legislative Analyst says about $12 billion in annual funding is at stake for schools by 2019.\nWithout the tax extension, Brown’s proposal for a $71.6 billion budget next year will still grow to about $77.5 billion in 2019. In addition to that annual budget, Proposition 98’s complex funding formula is designed to capture an added benefit for schools during an extended strong economy. So if the economy continues as it is, the state would owe another $6.3 billion to schools by 2019 that could be paid over several years.\nIf voters approve the tax extension, the budget analyst estimates the school funding would grow between $2.5 billion and $5.5 billion, meaning state school funding would be between $80 billion and $83 billion in 2019. Without a tax extension and with a recession, the budget in 2019 is projected to be about $71 billion.\nOpposition to the tax extension is still developing. Republicans and anti-tax groups have already voiced concern, saying Proposition 30 was intended to help during a fiscal emergency. Now that schools have enjoyed a recovery, they say, temporary taxes should be allowed to expire.\nEven Brown, a Democrat, has signaled he isn’t keen on extending taxes. “We ought to look at what’s the capacity of the state, and what’s the willingness of taxpayers to pay more,” Brown said at his January budget proposal.\nAn opinion poll by the Public Policy Institute of California in December found 54 percent of likely voters favor an extension of the taxes but just 37 percent said they think it is important.\nA ballot measure to extend taxes could benefit from the higher voter turnout in a presidential year. But it is always tough to pass a tax increase.\nGuadalupe Aragon, the mother of a fifth grader at the under-performing 20th Street Elementary School in Los Angeles, said she doesn’t think she’d vote for it.\n“The problem is not bringing any more money,” she said. “To a person, the more money you have, the more money you’re going to spend. Are you spending it wisely? That’s the question.”","url":"https://calmatters.org/articles/the-price-of-education/"}
