{"authors":["Candice Jackson For Daily Mail Australia"],"date_download":"2018-10-23 04:43:38","date_modify":"2018-10-23 04:43:38","date_publish":"2017-04-26 16:20:30","description":"It's the nightly current affair program that prides itself on being the 'news delivered differently.'  But during Wednesday's live cross with Steve Price, The Project hosts became fashion experts.","filename":"data/vaneerConsumption/TheProjectshostsmockStevePricesoutfit.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA059B000000578-0-image-a-98_1493219306491.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4448286_The-Project-s-hosts-mock-shock-jock-Steve-Price-s-outfit_1540269818.html","title":"The Project's hosts mock Steve Price's outfit","title_page":"The Project's hosts mock Steve Price's outfit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's the nightly current affair program that prides itself on being the 'news delivered differently.'\nBut during a live cross to shock jock Steve Price on Wednesday night, The Project hosts interrupted a news segment to mock the Steve's choice of jacket.\nRugged up in a puffer jacket, The Project's Carrie Bickmore, Waleed Aly and Peter Helliar all took aim at Steve's unusual TV attire mid-chat.\nScroll down for video\n'You sure we can't get you a Gatorade, Steve?' The Project's Carrie Bickmore, Peter Helliar and Walleed Aly interrupt live cross on Wednesday night to mock shock jock Steve Price for wearing a puffer jacket\n'There won't be any hiking involved': Waleed kicked off the quick-witted quips by mocking Steve for 'being prepared' in his sports jacket\nSteve was asked to pitch into the panel's discussion regarding comments rugby league commentator Phil Gould made about female spectators at the Anzac Day clash between the Roosters and the Dragons.\nHowever, less than a minute into the interview, Waleed cut off the journalist to focus on his apparent sportswear.\n'I like that you've come prepared for this interview, Steve, but there won't be any hiking involved,' he joked about Steve's large jacket.\nHis observation caused his panel co-stars to burst into fits of laughter, with Carrie seen leaning over the desk as she giggled uncontrollably.\nGiggles at the desk: Waleed's observation caused his panel co-stars to burst into fits of laughter, with Carrie seen leaning over the desk as she giggled uncontrollably\nSteve attempted to join in on the joke, by pointing to the jacket and insisting: 'This is my new jungle sponsor.'\nCarrie appeared confused, retorting as she continued to chuckle: 'Sponsor of what? The new sponsor of Steve Price?'\nSteve, clearly wanting to get back to the discussion at hand, attempted to wrap things up: 'It is just a jacket. Let's get on with it, please!'\n'This is my new jungle sponsor': Steve attempted to join in on the joke, but soon after attempted to wrap the taunting up by suggesting 'It is just a jacket. Let's get on with it, please!'\n'When have you ever worn an outfit like that in normal life let alone TV?' Carrie took aim at the puffer jacket, hinting that not only was it not TV appropriate, but that not many people would wear them 'in normal life'\n'Only a jacket?... When have you ever worn an outfit like that in normal life let alone TV?' Carrie continued with a smile.\nOf course, comedian Peter Helliar was sure to add a quick jab to the ongoing joke.\nHe asked with a straight face, before giggling: 'You sure we can't get you a Gatorade, Steve?'\nAfter the one-minute banter break from the actual news story at hand was over, Steve continued the informed chat.\nHowever, Carrie got the last laugh when farewelling Steve, signing off with: 'Thanks Pricey, we’ll leave you to go get warm.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4448286/The-Project-s-hosts-mock-shock-jock-Steve-Price-s-outfit.html"}
