{"authors":[],"date_download":"2018-10-30 14:20:20","date_modify":"2018-10-30 14:20:20","date_publish":"2017-01-19 00:00:00","description":null,"filename":"data/vaneerConsumption/Thepopethepresidentandtheinternationalleft.json","image_url":"https://www.americanthinker.com/images/bucket/2017-01/197837.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_01_the_pope_the_president_and_the_international_left_1540909220.html","title":"The pope, the president, and the international left","title_page":"The pope, the president, and the international left","title_rss":"NULL","source_domain":"americanthinker.com","text":"Readers might recall a previous post of mine in which a story was highlighted about how the Vatican reacted to Trump’s victory: a “lot of incomprehension” and “bitter shock,” viewing the United States as “angry and radicalized.”\nPope Francis is going to “wait and see” before judging President Trump, according to reports . That’s comforting, I guess.\nCould there have been an alliance of sorts between the Holy See and the Democrats?\nFrom The Remnant Catholic newspaper:\nSpecifically, we have reason to believe that a Vatican ‘regime change’ was engineered by the Obama administration. We were alarmed to discover that, during the third year of the first term of the Obama administration your previous opponent, Secretary of State Hillary Clinton, and other government officials with whom she associated, proposed a Catholic ‘revolution’ in which the final demise of what was left of the Catholic Church in America would be realized. Approximately a year after this email discussion, which was never intended to be made public, we find that Pope Benedict XVI abdicated under highly unusual circumstances and was replaced by a pope whose apparent mission is to provide a spiritual component to the radical ideological agenda of the international left…. During the 2016 presidential campaign we were astonished to witness Pope Francis actively campaigning against your proposed policies concerning the securing of our borders, and even going so far as to suggest that you are not a Christian. We appreciated your prompt and pointed response to this disgraceful accusation…. With all of this in mind, and wishing the best for our country as well as for Catholics worldwide, we believe it to be the responsibility of loyal and informed United States Catholics to petition you to authorize an investigation into the following questions: To what end was the National Security Agency monitoring the conclave that elected Pope Francis? What other covert operations were carried out by U.S. government operatives concerning the resignation of Pope Benedict or the conclave that elected Pope Francis? Did U.S. government operatives have contact with the ‘Cardinal Danneels Mafia’? International monetary transactions with the Vatican were suspended during the last few days prior to the resignation of Pope Benedict. Were any U.S. government agencies involved in this? Why were international monetary transactions resumed on February 12, 2013, the day after Benedict XVI announced his resignation? Was this pure coincidence? What actions, if any, were actually taken by John Podesta, Hillary Clinton, and others tied to the Obama administration who were involved in the discussion proposing the fomenting of a “Catholic Spring”? What was the purpose and nature of the secret meeting between Vice President Joseph Biden and Pope Benedict XVI at the Vatican on or about June 3, 2011? What roles were played by George Soros and other international financiers who may be currently residing in United States territory?... Please understand that we are not requesting an investigation into the Catholic Church; we are simply asking for an investigation into recent activities of the U.S. government, of which you are now the chief executive.\nA number of years ago, I probably would have dismissed the above material as malarkey. Yet given the current state of affairs in the Church and in the world, I believe that it should be taken seriously. Pope Benedict XVI’s perplexing resignation has been disastrous for Catholic orthodoxy, much as Obama’s presidency was disastrous for America.\nSome well intentioned Catholics have criticized Francis for being naïve with regard to the media. They’ve said Francis has a habit of shooting from the hip and speaking in ambiguous terms, which has allowed the media to misrepresent his words.\nBut I don’t think this is the case. Francis does indeed shoot from the hip, but I think he knows how the media will likely report what he says. He’s actually quite media-savvy. He likes to use the media to “stir the pot” and float trial balloons.\nThe problem is, by his words and actions, he appears to be drawing the Catholic Church dangerously close to formal schism (one could easily make the case that there’s been a de facto schism for many years now) – and that’s not a good thing.\nIt’s very possible that many (most?) in the Vatican were expecting a Hillary victory to help complete the progressive revolution by completely marginalizing faithful Catholics (which certain prelates are trying to do anyway) while the Democrats and media would crush their political opposition once and for all.\nIt seems the election of Donald John Trump threw a big wrench into their unholy plans. Interestingly, despite the massive efforts of “Catholic” leftists and their many secular accomplices, Trump won the Catholic vote. Not by a large margin, but he won it nonetheless.\nGod can indeed write straight with crooked lines.","url":"https://www.americanthinker.com/blog/2017/01/the_pope_the_president_and_the_international_left.html"}
