{"authors":["Tatiana Tenreyro"],"date_download":"2018-10-31 01:42:16","date_modify":"2018-10-31 01:42:16","date_publish":"2018-09-14 17:49:12","description":"The Predator franchise returns on Sept. 14, with the sixth movie in the series, The Predator. With so many movies before this one, spanning over three decades, it might be difficult to understand the full Predator movie timeline, and see The…","filename":"data/vaneerConsumption/ThePredatorsTimelineIsLessComplicatedThanItSeems.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/2c4f8bd9-a453-4511-a0ec-70fd4557c4b6-the-predator-2018-movie-stills-18038.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-predators-timeline-is-less-complicated-than-it-seems-11923271_1540950136.html","title":"'The Predator's' Timeline Is Less Complicated Than It Seems","title_page":"'The Predator's' Timeline Is Less Complicated Than It Seems","title_rss":"NULL","source_domain":"bustle.com","text":"The Predator franchise returns on Sept. 14, with the sixth movie in the series, The Predator. With so many movies before this one, spanning over three decades, it might be difficult to understand the full Predator movie timeline, and see The Predator fits within the franchise. But it turns out that you don’t have to take all the previous films into consideration to understand where this new one picks up.\nFans of the franchise might already know that the Alien vs. Predator flicks aren’t canon, so they don’t count in this timeline. 2018's The Predator actually follows 1997’s Predator 2. The film’s writer and director Shane Black explained to Entertainment Weekly that this sequel is set in present day — where the visits from the Predators are more common than they were in previous installments.\n“This current one picks up where the visits from the predators are often enough that now people have actually noticed, to the extent that the military and scientific committee has actually put together a group whose job it is to monitor and keep track of this sort of phenomenon,” explains Black to EW. “A kind of watch the skies kind of program that is aware that something is out there that sometimes comes and is waiting for that next incursion, so that we can be prepared and jump on it as opposed to being surprised.”\n20th Century Fox on YouTube\nEven though it took nearly 20 years for a third film to continue the storyline, fans of the franchise can expect more to come. The film’s producer, John Davis, told Variety that The Predator was made to set up two sequels, meaning that we could possibly get a sequel soon. But Black doesn’t want to rush that process yet, saying, “I would love to say we’ve been planning a trilogy, but I take one day at a time.”\nIn the aforementioned interview with Entertainment Weekly, the director expanded on this further, confirming that the Predator franchise won’t be going away anytime soon. “But of course we would leave room for continuing this, because as I mentioned, the Predator seems to have this uncanny longevity in the zeitgeist that people like new iterations of it, they like the hunting aspect of it, they break down every aspect of whatever costume he’s wearing this time and make toys of it. It’s strange, but it’s so longstanding and won’t go away,” explained Black.\nSpoilers ahead! The previous films (with the exception of the Alien vs. Predator flicks) were released a decade apart, but The Predator hints at sequels coming sooner this time around. This installment reveals a lot more than the previous Predator installments about the creatures’ motivations to invade Earth. Upon knowing that humans are at risk of extinction due to global warming, this gives them the opportunity to take over Earth. But, the Predators want to speed up the process. They hunt down humans to gain their DNA to make themselves stronger — showing why it’s so important for them to hunt. But right before the credits roll, it is revealed that the mysterious box in the film contained a Predator armor that helps humans fight and kill Predators.\nThis ending is the perfect setup for a sequel and more to come. It opens up plenty of questions, particularly what will happen to humans once one gains access to this armor that’ll give them a leg up to fend off Predators. It also shows that the films will continue to be set in current day, possibly continuing right where it left off.\nThe first two Predator films may not have a direct impact on The Predator’s timeline, but the next films will likely form their own timeline within the franchise, creating a fresh, exciting storyline for fans.","url":"https://www.bustle.com/p/the-predators-timeline-is-less-complicated-than-it-seems-11923271"}
