{"authors":[],"date_download":"2018-10-30 01:26:14","date_modify":"2018-10-30 01:26:14","date_publish":"2015-08-31 08:00:00","description":null,"filename":"data/vaneerConsumption/ThePresidentsCleanEnergyFarce.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/08/p2a6656.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862774.html","title":"The President’s Clean Energy Farce","title_page":"The President’s Clean Energy FarceThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"President Obama’s Clean Energy Summit last week was a farce and a flop, rivaled only by the mythical theatrical productions of Bialystock & Bloom. However, after enduring Obama’s speech at the Mandalay Bay Resort Convention Center in Las Vegas last Monday, no one was heard humming, in the manner of Matthew Broderick’s accountant-cum-show business-impresario character Max Bloom, “I want to be a producer” of alternative energies. And there certainly isn’t going to be a revival of the show on the strip there any time soon.\nGreen energy investments are a guaranteed flop, the kind of failure only a shady Broadway producer could envision. This current green energy production really got underway when the economic “stimulus” set aside $80 billion to subsidize politically connected energy projects, according to the Heritage Foundation. Since the halcyon days of the stimulus, 1,900 investigations have been opened to probe stimulus fraud and about 600 convictions have been secured by prosecutors.\nWhat is more, about 10 percent of the Obama-backed green companies have gone bankrupt or out of business.\nBut Obama does not let the facts get in the way of a good, green story.\n“For decades, we’ve been told that it doesn’t make economic sense to switch to renewable energy. Today, that’s no longer true. And you don’t have to take my word for it,” said the president. “Many of our biggest businesses are backing up that fact. Walmart has the most installed on-site solar capacity of any company in America. They’re not in the business of giving away money. Google is the largest corporate buyer of renewable energy in the world; companies like Apple and Costco close behind.”\nYes, that’s very strong and persuasive evidence there, Mr. President, when a company that used to have Hillary Clinton on the board of directors, Walmart, and another that has Al Gore on its board, Apple, endorsed progressive political priorities with shareholders money.\nThat’s something commonly known as socialism. But criticism of socialism is considered — and this is surely a rhetorical innovation — un-American by this president.\n“When you start seeing massive lobbying efforts backed by fossil fuel interests, or conservative think tanks, or the Koch brothers pushing for new laws to roll back renewable energy standards or prevent new clean energy businesses from succeeding — that’s a problem,” said Obama. “That’s not the American way. That’s not progress. That’s not innovation. That’s rent seeking and trying to protect old ways of doing business and standing in the way of the future. I mean, think about this. Ordinarily, these are groups that tout themselves as champions of the free market. If you start talking to them about providing health care for folks who don’t have health insurance, they’re going crazy — ‘this is socialism, this is going to destroy America.’ But in this situation, they’re trying to undermine competition in the marketplace, and choke off consumer choice, and threaten an industry that’s churning out new jobs at a fast pace.”\nBut the fact is that despite Obama’s hype, green jobs, to the extent that these kinds of jobs actually exist, destroy organic economic growth. A study by the American Enterprise Institute notes that green jobs programs in Spain in fact destroyed 2.2 jobs for each new job created. Since Spain started its green jobs creation agenda, the country has sunk economically. And the government there recently reported a 30 percent unemployment rate, a rate that is surely an underestimate, my colleague at the Heartland Institute, research fellow for energy policy James Taylor, says. The Spanish example is not an outlier, either. The capital needed to finance one green job in Italy could create five regular jobs, AEI researchers observe.\nWind and solar power have raised household energy prices by more than 7.5 percent in Germany, and elsewhere in the European Union. This is creating what is called energy poverty, a situation where the elderly and the poor see their energy costs soar, due to regulations subsidizing solar, wind, and biomass projects, while their income from pensions remains fixed.\nPresident Obama should take note of these sobering experiences overseas. But he probably won’t. Green jobs are “junk jobs,” notes Wayne Allyn Root, the New York Times best-selling author, and 2008 vice-presidential candidate for the Libertarian Party, in remarks at an affordable energy event, held on the same day as the president’s confab, at the same hotel. These are not high-paying gigs at $100,000 per year that make for a career. They are part-time positions, with no benefits. Just like being an extra in a Bialystock & Bloom production.","url":"https://spectator.org/63925_presidents-clean-energy-farce/"}
