{"authors":["Press Association"],"date_download":"2018-10-23 03:00:39","date_modify":"2018-10-23 03:00:39","date_publish":"2017-03-16 13:38:17","description":"With just 11 games of the Premier League season remaining, who will be able to keep the club out of relegation trouble?","filename":"data/vaneerConsumption/ThepossiblecontenderstoreplaceAitorKarankaatMiddlesbrough.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/13/wire-228671-1489671499-266_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4320326_The-possible-contenders-replace-Aitor-Karanka-Middlesbrough_1540263639.html","title":"The possible contenders to replace Aitor Karanka at Middlesbrough","title_page":"The possible contenders to replace Aitor Karanka at Middlesbrough | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Aitor Karanka’s departure as head coach has left Middlesbrough chairman Steve Gibson with a key appointment to make, with just 11 games of the Premier League season remaining and the club in relegation trouble.\nHere’s a look at some of the contenders.\nSteve Agnew\nMiddlesbrough caretaker manager Steve Agnew (Steve Paston/Empics)\nAssistant head coach Agnew has been handed the reins on a temporary basis ahead of Sunday’s clash with Manchester United. He returned to Boro in 2014 after two earlier spells on the coaching staff, but his only game in charge to date resulted in a 2-0 defeat at Charlton last season after Karanka has been told to stay away following a dressing room bust-up.\nGuus Hiddink\nShould Gibson look to make a temporary appointment in a bid to stave off relegation, 70-year-old Hiddink’s credentials are second to none. The Dutchman, who has managed PSV Eindhoven, Real Madrid, Holland, South Korea, Russia and Australia among others, was drafted in by Chelsea on a short-term contract following Luiz Felipe Scolari’s exit in February 2009 and guided the club to FA Cup glory and a third-place finish in the Premier League.\nSteve McLaren\nSteve McLaren (David Davies/PA)\nIt is difficult to argue that McClaren is not the most successful manager in Boro’s history having led them to Carling Cup glory in 2004 and the UEFA Cup final two years later before accepting the England job. However, the job was always going to be a stepping stone for him and his track record since, his first spell at FC Twente apart, has done little to enhance his reputation.\nRoy Hodgson\nThe FA have released a statement following the resignation of @England manager Roy Hodgson this evening. https://t.co/2qaGFKIuIt — The FA (@FA) June 27, 2016\nHodgson has not returned to management since stepping down as England boss following a dismal Euro 2016 finals campaign. He has vast experience and is much travelled. In recent days he has been linked with the current vacancy at Norwich, but reports have distanced him from that job.\nAlan Pardew\nCONFIRMED: Alan Pardew has been released from his contract to become Crystal Palace manager. http://t.co/zDKPhSmy0P. pic.twitter.com/z5mYQvEuoP — Newcastle United FC (@NUFC) January 3, 2015\nAnother man who has been touted as a possible replacement for Alex Neil at Carrow Road, Pardew knows the North East from his eventful spell in charge at Newcastle. He may not be a popular appointment with the fans as a result, while he repeatedly expressed his frustration at being head coach rather than manager at St James’ Park.\nNigel Pearson\nNigel Pearson (Simon Cooper/PA)\nFormer Middlesbrough defender Pearson is hugely respected on Teesside for his performances and leadership as the club’s captain. His contribution to Leicester’s remarkable rise has been acknowledged in the East Midlands, although his sometimes abrasive management style may not be what Boro are looking for.","url":"https://www.dailymail.co.uk/wires/pa/article-4320326/The-possible-contenders-replace-Aitor-Karanka-Middlesbrough.html"}
