{"authors":[],"date_download":"2018-10-21 02:47:18","date_modify":"2018-10-21 02:47:18","date_publish":"2018-07-20 16:33:06","description":"Balz was previously a Harvard IPO Residential Fellow in the fall of 2017.","filename":"data/vaneerConsumption/ThePostsDanBalznamedSeniorFellowattheHarvardKennedyInstituteofPolitics.json","image_url":"https://www.washingtonpost.com/resizer/dKf8W1fUhqATYWIVCph4qr_vKcs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TOT32ZUZT46BFEGIVHPLPLONHU.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_07_20__1540090038.html","title":"The Post’s Dan Balz named Senior Fellow at the Harvard Kennedy Institute of Politics","title_page":"The Post’s Dan Balz named Senior Fellow at the Harvard Kennedy Institute of Politics - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"The Washington Post’s Chief Correspondent Dan Balz, will return to the Harvard Kennedy Institute of Politics as a Senior Fellow for the upcoming 2018-2019 academic year. While continuing in his role at The Post, Balz will lead discussions at the Institute of Politics, helping students build a broader understanding of politics and media ahead of the 2018 midterm and 2020 presidential elections.\nMark D. Gearan, Director of the Institute of Politics, said in a press release, “Dan Balz brings a unique perspective to our work at the IOP. As a veteran reporter and astute observer of American civic life, he will bring his vast experience covering political campaigns to our work at an important time in electoral politics. We are fortunate to have his many talents and his deep understanding of the IOP, as a very popular fellow, and engaged member of the Harvard community,”.\nBalz joined The Post in 1978 and has covered 10 presidential campaigns.","url":"https://www.washingtonpost.com/pr/wp/2018/07/20/the-posts-dan-balz-named-senior-fellow-at-the-harvard-kennedy-institute-of-politics/"}
