{"authors":["Stephanie Linning For Mailonline"],"date_download":"2018-10-23 02:12:12","date_modify":"2018-10-23 02:12:12","date_publish":"2017-03-16 12:35:10","description":"The Queen, who turns 91 next month, came face-to-face with the Army uniform she wore as a young princess during the Second World War during a visit to the National Army Museum in London today.","filename":"data/vaneerConsumption/TheQueenreopenstheNationalArmyMuseuminLondon.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/20/3E57EF8400000578-0-image-a-2_1489694616107.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4319868_The-Queen-reopens-National-Army-Museum_1540260732.html","title":"The Queen reopens the National Army Museum in London","title_page":"The Queen reopens the National Army Museum in London | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Over the course of her reign, the Queen has had the privilege of exploring the world's finest museums.\nBut her visit to the National Army Museum in London today held a special personal significance.\nFor during her tour the Queen, who turns 91 next month, came face-to-face with the Army uniform she wore as a young princess during the Second World War.\nReflection: The Queen stops to inspect the uniform that belonged to her as Honorary Brigadier in the Women's Royal Army Corps, at the National Army Museum in London today\nMilitary duty: The Queen, then Princess Elizabeth, is photographed in uniform as she undergoes training as Second Subaltern in the Women’s Auxiliary Territorial Service in 1943\nThe monarch looked deep in thought as she stole a private moment to inspect the green jacket, skirt and hat, which were hung on a mannequin in a glass display case.\nShe wore the uniform while carrying out her duties as an Honourary Brigadier in the Women's Royal Army Corps from 1949 to 1953.\nPRINCESS ELIZABETH AND THE ARMY Princess Elizabeth was just 18 when she joined the Women's Auxiliary Territorial Service (ATS) in February 1945. When the Women's Royal Army Corps (WRAC) was founded in 1949 as a successor to the ATS, she became an Honorary Senior Controller and later Honorary Brigadier. She resigned these appointments on becoming Queen in 1953.\nShe resigned the appointment on becoming Queen in 1953.\nThe wool barathea tunic made by Saville Row tailors Sandon & Co. is adorned with The Queen’s own medal ribbons including Royal Order of Victoria and Albert; King George V Silver Jubilee Medal 1935; King George VI Coronation Medal 1937 and the British War Medal 1939-1945.\nThe museum acquired the uniform in 1993, following the disbandment of the WRAC in 1992.\nThe Queen was joined by Prince Philip as she reopened the museum today following a three-year multi-million pound redevelopment.\nIn bloom: The Queen smiles as she is presented with a posy of flowers by a young girl at the opening of the National Army Museum in London today\nAffectionate: The Queen and Prince Philip were greeted outside the museum by Prince Edward, Duke of Kent, who kissed his cousin on the cheek\nElegant: The monarch donned a powder blue tweed coat and matching hat for the occasion\nYoung fans: Dressed in matching pink outfits, the little girls looked excited to meet the Queen\nThey were met at the entrance by their youngest son, Prince Edward, who greeted his mother with an affectionate kiss on the cheek.\nMaking the most of the spring weather, the Queen donned a light-weight powder blue tweed coat and matching hat for the occasion.\nShe accessorised the outfit with a pearl necklace and earrings, and wore a black leather handbag on her arm.\nOfficial reopening: The Queen and Prince Philip leave the Army Museum in London today\nBeaming: The monarch looked in excellent spirits as she met with staff and volunteers\nGracious: The Queen waves from her car as she leaves the National Army Museum today\nThe royal couple met donors in the museum cafe before speaking to staff and volunteers outside. The Queen also unveiled a plaque to mark her visit.\nThe museum was founded in 1960 by Royal Charter and established to collect, preserve and exhibit objects and records relating to the land forces of the British Crown.\nNow it has been transformed into five bright thematic galleries - soldier, army, battle, society and insight - that provide a space to explore and discuss the British Army and its relevance to society from fashion and films to flood defences and conflict.\nFamily visit: The Queen and Prince Philip looked excited to see Prince Edward, Duke of Kent at the museum\nCollections: The Queen was given a tour of the museum by assistant director Ian Maine","url":"https://www.dailymail.co.uk/femail/article-4319868/The-Queen-reopens-National-Army-Museum.html"}
