{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 21:17:51","date_modify":"2018-10-30 21:17:51","date_publish":"2016-12-21 00:00:00","description":"May was asked about the potential for a transitional deal by a panel of UK MPs on Tuesday. May said there was a 'necessity for adjustments.'","filename":"data/vaneerConsumption/TheresaMayhintedthattheUKwillpushforatransitionalBrexitdeal.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_theresa-may-hints-uk-will-push-for-a-transitional-brexit-deal-article-50-passporting-2016-12_1540934271.html","title":"Theresa May hinted that the UK will push for a transitional Brexit deal","title_page":"    Theresa May on transitional Brexit deal: Passporting, Article 50, Single Market - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Britain's Prime Minister Theresa May arrives at a European Union leaders summit in Brussels, Belgium December 15, 2016. Reuters LONDON - Prime Minister Theresa May hinted the UK will push for a transitional Brexit deal to make it easier to implement any new arrangements.\nMay was asked about the potential for a transitional deal by a panel of UK MPs on Tuesday.\nSecuring a transitional deal would allow several years for new arrangements with the European Union to take effect after the two-year deadline for negotiating Brexit ends in 2019, making it easier for businesses and public services to adapt.\nMay said there was a \"necessity for adjustments.\"\n\"There are some people who will talk about transition as a deliberate way of putting off actually leaving the European Union,\" May said.\n\"For others transition is an expectation that you can't get the deal in two years and therefore you've got to have a further period to do it. But if you think about the process we've got to go through once you've got the deal, once we've got the new arrangements, there will of course be a necessity for adjustments for the new arrangements, for implementation of some practical changes.\"\nMay also said she would give a speech early next year that outlines the UK's approach to negotiating leaving the EU. \"I will be making a speech early in the new year setting out more about our approach and about the opportunity I think we have as a country to use this process to forge a truly global Britain that embraces and trades with countries across the world,\" May said.\nInternational businesses, banks and other financial firms will be waiting to see whether the UK attempts to secure some passporting rights to sell financial services into the single market of 27 European countries.\nThe EU's passporting rules allow businesses to sell services across the union from anywhere within it and only require companies to be regulated in one country, rather than everywhere they operate.\nJPMorgan and UBS have both publicly warned they will have to move jobs elsewhere in Europe if passporting rights are lost. Goldman Sachs itself is also said to be planning behind closed doors to move 2,000 jobs to the continent if the rights are lost.","url":"https://www.businessinsider.com/theresa-may-hints-uk-will-push-for-a-transitional-brexit-deal-article-50-passporting-2016-12"}
