{"authors":[],"date_download":"2018-10-23 05:15:51","date_modify":"2018-10-23 05:15:51","date_publish":"2014-10-12 00:00:00","description":"For more than a century, the Royal Shakespeare Company has commissioned music for plays. Its archive tracks the way music changes over time and across many productions.","filename":"data/vaneerConsumption/TheRoyalShakespeareCompanyReleasesMusicFromItsArchive.json","image_url":"https://media.npr.org/assets/img/2014/10/10/163205699_wide-b0dd1fce27ba4e5f569090dbda87cfb76cb65141.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=355165335_1540271751.html","title":"The Royal Shakespeare Company Releases Music From Its Archive","title_page":"The Royal Shakespeare Company Releases Music From Its Archive : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ARI SHAPIRO, HOST:\nFor more than a century, the Royal Shakespeare Company in England has hired composers to write original music for its productions. That sheet music has sat in a vault for decades. Recently, the Royal Shakespeare Company has started releasing CDs that combine music from its contemporary productions with much older works.\n(SOUNDBITE OF SONG)\nSHAPIRO: This piece was written a century ago for a production of \"Richard II\" in 1913. Bruce O'Neill is head of music for the Royal Shakespeare Company. He described the dusty archive where all the old sheet music is stored.\nBRUCE O'NEILL: It is a bit like a bank vault. You know, you've got these various rooms with sort of very thick doors with a big wheel on the front to let you in. And they're all sort of organized along the shelves and categorized by dates and by composer in some instances.\nAlthough they're organized to a certain extent, some of them really haven't actually been looked through since the production happened.\nSHAPIRO: You have some compositions in this collection from extremely well-known composers. That first piece we heard was by Vaughan Williams, one of the great early 20th century English composers.\nLet's listen to another piece by him. This was also from the 1913 production of \"Richard II.\" This is Vaughan Williams' adaptation of \"Greensleeves.\"\n(SOUNDBITE OF SONG, \"GREENSLEEVES\")\nUNIDENTIFIED WOMAN: (Singing) Alas my love you do me wrong to cast me off discourteously.\nO'NEILL: That sort of demonstrates that at that time there was still a propensity to use existing pieces of music. Vaughan Williams was obviously hugely interested in folk music. So he was arranging a lot of folk music.\n(SOUNDBITE OF SONG, \"GREENSLEEVES\")\nUNIDENTIFIED WOMAN: (Singing) Greensleeves was my heart of gold and who was my lady Greensleeves.\nO'NEILL: The beauty of it was for that first production of \"Richard II,\" we thought, right, who should we choose? We look back exactly 100 years and there we had Ralph Vaughan Williams, music for \"Richard II\" from 1913. So it was a beautiful start for us.\nSHAPIRO: It's amazing to listen to the juxtaposition on these CDs of the contemporary and the old. Let's hear a song that Shakespeare wrote, \"Who Is Sylvia?\" as adapted for a production of \"Two Gentlemen Of Verona\" this year by the composer Michael Bruce, who turned the song into an indie-rock ballad.\n(SOUNDBITE OF SONG, \"WHO IS SYLVIA\")\nUNIDENTIFIED MAN #1: (Singing) Who is Sylvia? What is she that all our swains commend her?\nSHAPIRO: And then you have a 1938 version of the same song, same Shakespeare lyrics with music written by different composer, Anthony Bernard. This is between World War I and World War II. Let's listen to how he treated the song.\n(SOUNDBITE OF SONG, \"WHO IS SYLVIA?\")\nUNIDENTIFIED MAN #2: (Singing) Who is Sylvia? What is she that all of our swains commend her? Holy, fair and wise is she.\nSHAPIRO: You cannot imagine a greater chasm between those two adaptations.\nO'NEILL: This is why I knew that we had to delve into the archive because in 1938, that was modern. And classics only become classics after a length of time.\nSHAPIRO: You're saying that an audience in 1938 would have heard that the version of \"Who is Sylvia?\" in the same way that we hear the indie-rock ballad version of \"Who Is Sylvia?\"\nO'NEILL: Absolutely. And that's the beauty of it. And when people are listening to Michael Bruce's version in, say, 100 years time, I wonder what they will think of that.\nSHAPIRO: How quaint and antiquated.\nO'NEILL: That's the beauty of these works that stand up to interpretation again and again and again by subsequent generations.\n(SOUNDBITE OF SONG, \"WHO IS SYLVIA?\")\nUNIDENTIFIED MAN #1: (Singing) Then to Sylvia, let us sing. That Sylvia is excelling.\nSHAPIRO: You've described this archive of music as a sort of bank vault. How does it feel to finally have that vault cracked open to the public for the first time?\nO'NEILL: It's really interesting and one of the really great things about it is that obviously in our very modern, technological age, the way we produce the music now is using software. So it looks beautiful and it looks professionally published and all that sort of thing. But of course it wasn't that long ago before people had to write by hand. And when you delve into that archive and you get a piece of paper which has the ink on it, it really makes you feel very connected to what they were doing.\n(SOUNDBITE OF SONG)\nSHAPIRO: Bruce O'Neill is head of music for the Royal Shakespeare Company. We should add that these recordings are also available for download. Thanks so much for joining us.\nO'NEILL: It's been a pleasure.\n(SOUNDBITE OF SONG)\nSHAPIRO: Rachel Martin will be back next week. This is WEEKEND EDITION from NPR News. I'm Ari Shapiro.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=355165335"}
