{"authors":["Lianna Brinded"],"date_download":"2018-10-30 20:53:08","date_modify":"2018-10-30 20:53:08","date_publish":"2016-12-24 00:00:00","description":"May used her Christmas message to the nation to address Brexit concerns.","filename":"data/vaneerConsumption/TheresaMaysChristmasmessageBrexittradeArticle50.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_theresa-mays-christmas-message-brexit-trade-article-50-2016-12_1540932788.html","title":"Theresa May's Christmas message: Brexit, trade, Article 50","title_page":"    Theresa May's Christmas message: Brexit, trade, Article 50 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"YouTube/ 10 Downing Street LONDON — Prime Minister Theresa May used her Christmas message to the nation to urge Britons to \"unite\" as the nation breaks away from the European Union.\nShe said \"coming together is also important for us as a country. As we leave the European Union we must seize an historic opportunity to forge a bold new role for ourselves in the world and to unite our country as we move forward into the future.\"\n\"And, with our international partners, we must work together to promote trade, increase prosperity and face the challenges to peace and security around the world.\"\nBritain voted for a Brexit by a slim majority on June 23 and, since then, there has been much speculation on when the new prime minister, Theresa May, will trigger Article 50. March 2017 is the current target date but a Supreme Court case will rule in January 2017 whether she will have to get permission from parliament to do this. This could slow things down.\nMay says she will not give a \"running commentary\" on how negotiations are going but she has made it clear in various speeches that her government is prioritising immigration restrictions. This would imply a \"hard Brexit\" because the EU's official line is that it will not allow the UK to curb immigration and keep membership of the single market at the same time.\nEven the Queen allegedly does not know what May's key tactics are for negotiating a Brexit deal.\nChristmas messages from the other main political party leaders\nIn her message, May also thanked those working during the Christmas period:\n\"Having grown up in a vicarage, I know how demanding it can be for those who have to work over the Christmas period.\n\"So it's right for all of us to express our gratitude to those who will have to spend Christmas away from the people they love in looking after others, those in our health and care services, those who work with the vulnerable, as well as those who will be caring for a loved one.\n\"And we thank those in our armed forces, security agencies and emergency services who work all year round to keep our country safe - especially those who will be separated by their duty from their families and friends.\n\"Wherever you are this Christmas, I wish you joy and peace in this season of celebration, along with health and happiness in the year ahead.\"\nMay also recorded a separate message to troops saying \"you are the finest in the world:\"\nMeanwhile, the leader of the Labour party, Jeremy Corbyn used his Christmas message to highlight homelessness in the UK.\nJeremy Corbyn. ITV News He said \"it's the goodwill and generosity of ordinary people, public service and charity workers who give tirelessly to help the most vulnerable and the lonely.\n\"They remind us of Christmas values: love for your neighbour, working together and hope, hope that things can be different,\" he added, after citing the homelessness charity Shelter's figures saying that 120,000 children would spend Christmas without a home.\nElsewhere, the leader of the Liberal Democrats, Tim Farron filmed his Christmas message at a child refugee centre in Paris, and asked Britain to open its doors to refugees.\nHe said the children wanted to come to the UK \"because of Britain's reputation as a place of peace and of security and tranquility\" to start afresh.","url":"https://www.businessinsider.com/theresa-mays-christmas-message-brexit-trade-article-50-2016-12"}
