{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 21:07:57","date_modify":"2018-10-30 21:07:57","date_publish":"2016-12-22 00:00:00","description":"An unnamed senior executive at one of the big consultancies thinks Deloitte's self-imposed ban will hurt choice in Whitehall.","filename":"data/vaneerConsumption/TheresaMaysgovernmentiscuttingoffitsnosetospiteitsfaceovertheDeloittememo.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_deloitte-brexit-memo-consultancy-exec-says-government-cutting-off-its-nose-to-spite-its-face-over-leak-2016-12_1540933677.html","title":"Theresa May's government is 'cutting off its nose to spite its face' over the Deloitte memo","title_page":"    Deloitte Brexit memo: Consultancy exec says government 'cutting off its nose to spite its face' over leak - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Prime Minister Theresa May. REUTERS/Victoria Jones/Pool LONDON — An unnamed senior executive at a British consultancy has told the Financial Times they believe the government is \"cutting off its nose to spite its face\" over the leaked Deloitte Brexit memo.\nA memo penned by a partner at consultancy and accountant Deloitte suggesting that Whitehall was woefully under prepared for Brexit was leaked to the press earlier this year. It enraged the government and apparently personally offended Prime Minister Theresa May by suggesting she wanted to \"settle matters herself.\"\nDeloitte announced on Wednesday that it has agreed not to bid for any government contracts for the next six months, a self-imposed punishment that could cost it tens of millions of pounds and reached after meetings with senior civil servants.\nBut an unnamed executive told the FT that the punishment could do more harm than good, saying:\n\"They are removing one of the top consulting firms and this will be disruptive to government business and give them less choice when looking for people to bid for work. It won't encourage consulting firms to bid for work or speak with clarity and truth to ministers.\"\nIt is not clear if the executive in question is from Deloitte or another leading firm but their point is that by punishing Deloitte for speaking out the government could dissuade other consultants from speaking the mind at a time when good advice will be at a premium.","url":"https://www.businessinsider.com/deloitte-brexit-memo-consultancy-exec-says-government-cutting-off-its-nose-to-spite-its-face-over-leak-2016-12"}
