{"authors":["James Tapsfield","Political Editor For Mailonline"],"date_download":"2018-10-23 02:23:43","date_modify":"2018-10-23 02:23:43","date_publish":"2017-03-16 12:55:24","description":"The First Minister accused Mrs May of 'untenable' behaviour as the bitter war of words between the two leaders escalated again.","filename":"data/vaneerConsumption/TheresaMayputsdampeneronindependencereferendum.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E551E5700000578-0-image-a-6_1489681650290.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320128_PM-hits-Sturgeon-independence-referendum_1540261423.html","title":"Theresa May puts dampener on independence referendum","title_page":"Theresa May puts dampener on independence referendum | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Furious Nicola Sturgeon let rip at 'undemocratic' Theresa May today after the PM made clear she will ignore demands for a fresh independence vote before Brexit.\nThe First Minister accused Mrs May of 'untenable' behaviour and 'running scared' of the electorate as the bitter war of words between the two leaders escalated again.\nThe clash erupted when Mrs May took to the airwaves to warn Mrs Sturgeon that 'now is not the time' to push for a ballot on breaking up the UK.\nShe insisted Scots had to know what Brexit looked like before another referendum could even be contemplated.\nIn a coordinated attack by ministers, the government then went further by stating that it will not even enter negotiations about the timing of a vote until after we leave the EU in 2019.\nTheresa May insisted 'now is not the time' for a second Scottish independence referendum in an interview with ITV news today\nFour polls this week have delivered serious blows to Nicola Sturgeon's ambition of Scotland becoming independent\nMrs May's stinging rebuke, in a pooled broadcast interview, comes after Miss Sturgeon dramatically hardened her threats about a referendum on Monday, insisting Scotland must be given a choice about its future.\nShe called for a ballot to be held between Autumn next year and the following spring. But that would be before the two year Brexit process is complete - a prospect that is completely unacceptable to Downing Street.\nThe Westminster government has the power to prevent a binding poll being held.\nBut rather than blocking it outright - which ministers fear would just fuel nationalist sentiment - Mrs May is deploying more subtle tactics to kick it into the long grass.\nAs she prepares to embark on potentially fraught talks with Brussels, Mrs May told the First Minister that they should be 'working together, not pulling apart'.\n'We should be working together, not pulling apart. Now is not the time,' she said.\nMiss Sturgeon hit back by warning any block on a referendum would be 'untenable, undemocratic and totally unsustainable'.\nSpeaking at First Minister's questions in Holyrood, she said: 'If on Wednesday next week this Parliament votes for an independence referendum to give the people of Scotland a choice over the future of their future - will the Conservatives block the will of this Parliament? Or are the Conservatives running scared?'\nIn an interview later with BBC Scotland, Miss Sturgeon said: 'This is like winding the clock back to the bad old days of Margaret Thatcher.\n'It is an argument for independence really in a nutshell, that Westminster thinks it has got the democratically elected mandate of the Scottish Government and the majority in the Scottish Parliament.\n'History may look back on today and see it as the day the fate of the union was sealed.'\nMiss Sturgeon responded to the PM on Twitter today saying it would be 'undemocratic' to block a referendum happening\nThe First Minister has already suffered a series of setbacks in her campaign to tear up the UK.\nAn array of surveys have shown there is still a solid majority in Scotland in favour of remaining in the union - and people do not want a ballot staged before Brexit happens.\nMeanwhile, Spain has flatly dismissed the prospect of Scotland being allowed to keep EU membership if it breaks away.\nA confident Prime Minister, boosted today by news that the historic Brexit Bill has gained Royal Assent and became law, swiped at Miss Sturgeon for manufacturing a row about Brexit to further her independence ambitions.\nShe said 'all our energies should be focused on our negotiations with the EU about our future relationship'.\n'To be talking about an independence referendum will make it more difficult for us to be able to get the right deal for Scotland, and the right deal for the UK,' she said.\nNicola Sturgeon, seen at the Scottish Parliament today, caused a storm this week by declaring her determination to hold a second referendum as early as Autumn next year\nMiss Sturgeon is facing a coordinated attack from the government to fend off her demands for an early vote on independence\n'And more than that, I think it wouldn't be fair to the people of Scotland because they're being asked to make a crucial decision without all the necessary information - without knowing what the future partnership would be, or what the alternative of an independent Scotland would look like.'\nShe added: 'This union we have is very precious. We've been joined together for over 300 years. We've had a great history together - I believe we have a great future together.\nSTURGEON MUST ASK SCOTS PARLIAMENT BEFORE GOING TO UK GOVERNMENT There is a strict process that needs to be followed to hold a binding referendum: The First Minister must first get the consent of the Scottish Parliament. While she does not have an overall majority, this will be straightforward. In 2014, this was followed by a written agreement between London and Edinburgh known as the 'Edinburgh Agreement', setting the terms for the referendum taking place. Westminster must then give permission as constitutional reform is not devolved to Scotland. This means a 'section 30' order must be agreed in Parliament under the Scotland Act. If powers are passed to Holyrood, the Scottish Parliament will pass a law setting out the rules of the referendum - including the date, question and franchise.\n'Together, we should put our energies into making sure we get the right deal for Scotland and for the whole of the UK.'\nIn a coordinated attack on the SNP position, Scottish Secretary David Mundell and Scottish Tory leader Ruth Davidson held a news conference in Edinburgh later.\nMr Mundell delivered the bluntest rejection yet of Miss Sturgeon's demands, making clear that even if the Scottish Parliament approves a call for a referendum, the Westminster government will refuse to pass the Section 30 order needed to stage a binding vote.\n'This argument isn't about mandates, it's about holding a referendum on established criteria which were set on in the Edinburgh Agreement,' he said.\n'That established that a referendum must be legal, fair and decisive.\n'The proposal brought forward is not fair, people will not be able to make an informed choice.\n'Neither is there public or political support for such a referendum.\n'Therefore we will not be entering into discussions or negotiations about a section 30 agreement and any request at this time will be declined.'\nSpeaker John Bercow announced that the Brexit Bill had received Royal Assent - formally becoming an Act of Parliament - in the Commons this morning\nMiss Sturgeon fired back with an official statement of her own.\nShe said: 'If the Prime Minister refuses to engage on the terms of a referendum before Brexit takes place then she is effectively trying to block the people of Scotland having a choice over their future. That would be a democratic outrage.\n'It is for the Scottish Parliament – not Downing Street – to determine the timing of a referendum, and the decision of the Scottish Parliament must be respected.\n'It would be outrageous for the Scottish Parliament to be frozen out of the process.'\nPosting on Twitter, Miss Sturgeon insisted she only wanted a referendum when the terms of Brexit are clear and 'before it is too late to choose an alternative path'.\n'If the Tories refuse to do so, they would effectively be blocking Scotland's right to choose when the Brexit terms (are) clear.\n'This would be undemocratic given @scotgov (the Scottish Government's) clear mandate and also proof positive that the Tories fear the verdict of the Scottish people.'\nThe Queen, pictured visiting a museum in Chelsea today, has given Royal Assent to the Brexit Bill, paving the way for our divorce from the EU\nResearch for the Scottish Daily Mail suggested 53 per cent want to stay in the union once you exclude those yet to decide. By a margin of 46 per cent to 41 per cent people oppose Mrs Sturgeon's call for a referendum to be held before the divorce process from the EU is complete.\nA YouGov poll for The Times put the majority against independence even higher at 57-43.\nComRes research for the Sun found just 25 per cent of Scots thought the country should be fully independent, against 58 per cent who thought it should not and 17 per cent who were not sure.\nMeanwhile, the huge annual Scottish Social Attitudes Survey included evidence of a sharp rise in Euroscepticism.\nTwo thirds of the public north of the border would want Brussels to have reduced powers or for the UK to leave the EU completely, according to the research.\nThe last referendum in 2014 - which the SNP said would settle the issue for a 'generation' - delivered a 55 per cent majority for staying the UK, equivalent to two million votes.\nSNP sources have been trying to play down reports that Miss Sturgeon will downscale her ambitions to Scotland joining the European Free Trade Association if it becomes independent.\nSwitzerland, Norway, Iceland and Liechtenstein are all in that group, giving them access to the single market.\nBut they have to comply with rules imposed by Brussels and have no real input into legislation which is drawn up in the Belgian capital.\nEarlier today, history was made after theQueen gave Royal Assent to the Brexit Bill - clearing the way for Mrs May to trigger the divorce from Brussels.\nSpeaker John Bercow told the Commons that the monarch has formally signed off the European Union (Notification of Withdrawal) Bill.\nBut although the PM now has the powers to invoke the two-year Article 50 process for leaving the Brussels club, she has indicated she will wait until the end of the month to do so.","url":"https://www.dailymail.co.uk/news/article-4320128/PM-hits-Sturgeon-independence-referendum.html"}
