{"authors":[],"date_download":"2018-10-30 19:38:26","date_modify":"2018-10-30 19:38:26","date_publish":"2018-08-09 19:34:00","description":"The Super Bowl will be played at Mercedes-Benz Stadium on Feb. 3, less than six months from now.","filename":"data/vaneerConsumption/TheroadtoAtlantasSuperBowlFiveupdates.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/MyAJC/2018/07/17/Images/newsEngin.22493714_832036074.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_the-road-atlanta-super-bowl-five-updates__1540928306.html","title":"The road to Atlanta's Super Bowl: Five updates","title_page":"The road to Atlanta's Super Bowl: Five updates","title_rss":"NULL","source_domain":"ajc.com","text":"The Super Bowl will be played at Mercedes-Benz Stadium on Feb. 3, less than six months from now. It will be the third time that Atlanta has hosted the event and the first time in 19 years. As planning continues and the NFL season approaches, here are five updates on the road to Super Bowl LIII.\n1. WHAT ARE ODDS OF FALCONS GETTING THERE?\nIn the Super Bowl’s first 52 years, no team has played in the game on its home field. The Falcons seek to become the first to do so.\nThey currently have the fifth best odds among NFC teams to reach the Super Bowl this season, according to Vegas Insider. Minnesota and Philadelphia are the co-favorites to win the NFC championship at 11-2, followed by the Los Angeles Rams at 13-2, Green Bay at 8-1 and both Atlanta and New Orleans at 10-1.\nNew England is the favorite to win the AFC championship at 3-1 odds and the favorite to win Super Bowl LIII at 7-1. The Falcons’ odds to win the Super Bowl are 16-1.\nIf the Falcons have home playoff games, that will affect Super Bowl preparations. The current schedule calls for setup around Mercedes-Benz Stadium to begin Jan. 5.\nThe Vikings were within one win of playing in last season’s Super Bowl in their home venue, U.S. Bank Stadium in Minneapolis, but they lost at Philadelphia in the NFC Championship game. The Vikings were the first team to even reach a conference title game in the season its stadium hosted the Super Bowl.\nDecades ago, two teams did reach Super Bowls that were played in their home markets, albeit not in their home stadiums. The 1979 Rams played in Super Bowl XIV at Rose Bowl Stadium in Pasadena, Calif., and the 1984 San Francisco 49ers played in Super Bowl XIX at Stanford Stadium in Stanford, Calif.\n2. LOOKING FOR TICKETS YET?\nThe NFL doesn’t put Super Bowl tickets on sale at face value to the general public, but tickets already are being offered on the secondary market. Several resale sites had tickets listed as of Thursday, ranging from $3,000 (upper-level end zone) to $16,039 (field-level club).\nTickets offered on the secondary market at this point are for general areas, but not yet matched to specific seats or rows.\nThe NFL’s official hospitality partner, On Location Experiences, currently is selling ticket packages that include specific seats and a range of perks. Prices range from $5,000 to $17,500, depending on seat location and the level of luxury.\nThe $17,500 packages, for example, include a lower-level seat at the 50-yard line, access to a three-hour pregame party, in-game club access and post-game access to the field for the winning team’s celebration. There were about 70 of the highest-end packages available as of Thursday on On Location’s website.\n» Follow: AJC’s continuing coverage of Super Bowl 53 in Atlanta\n3. VOLUNTEER APPLICANTS TOP 31,000\nWhen the Atlanta Super Bowl Host Committee closed online applications for volunteers at the end of July, more than 31,000 people had applied.\nFrom that total, the host committee expects as many as 15,000 to show up for brief face-to-face interviews and as many as 10,000 to be chosen to serve in a variety of volunteer roles during a 10-day stretch preceding the game. Interviews, being conducted by about 450 volunteer “captains,” started in July and will continue throughout this month.\nVolunteer roles will include assisting with host-committee events and welcoming visitors or answering their questions.\n4. EVENTS BEYOND THE GAME\nPlans are still being made for the major ancillary events leading to the Super Bowl.\nSuper Bowl Live, a nine-day celebration in Centennial Olympic Park, will include free concerts and other activities. The past two Super Bowl cities incorporated high-profile attractions – Houston’s virtual-reality journey to Mars and Minneapolis’ zip-line rides across the Mississippi River -- and the NFL is working with the Atlanta host committee on developing ideas.\nBrett Daniels, chief operating officer of the host committee, said “six or eight different concepts” are being considered. One important factor, he said, is whether a concept can efficiently accommodate large numbers of people.\n“We’re trying to find ideas that have a high throughput,” Daniels said. “If there’s a two-hour wait, it’s a bit of a buzz kill for everybody.”\nOther major ancillary events will include Super Bowl Experience (a football theme park in the Georgia World Congress Center from Jan. 26-Feb. 3) and Super Bowl Opening Night (an event formerly known as Media Day, to be held in Philips Arena on Jan. 28).\n5. AN OPEN-OR-SHUT DECISION\nA decision likely won’t be made until a few days before the game, at the earliest, but the recent completion of work on the Mercedes-Benz Stadium roof raises the possibility that the Super Bowl could be played with the roof open.\nThe NFL, which will make the call, and the Falcons’ organization have said they would like to have the roof open if the weather is favorable – a large variable for Atlanta in February.\nMainly, all parties hope an open roof remains a consideration on Feb. 3, because that would mean no repeat of the ice storm that marred the 2000 Super Bowl here.","url":"https://www.ajc.com/sports/the-road-atlanta-super-bowl-five-updates/H7fKODF87QcFm0ks0CHnMM/"}
