{"authors":["Press Association"],"date_download":"2018-10-23 03:50:26","date_modify":"2018-10-23 03:50:26","date_publish":"2017-03-16 14:53:09","description":"Philip Hammond was forced to drop the increase in National Insurance contributions for the self-employed just a week after his first Budget.","filename":"data/vaneerConsumption/TheresaMaysaysshehasabsolutefaithinChancellordespiteBudgetUturn.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/14/wire-229027-1489675992-624_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4320582_Theresa-May-says-absolute-faith-Chancellor-despite-Budget-U-turn_1540266626.html","title":"Theresa May says she has `absolute faith´ in Chancellor despite Budget U-turn","title_page":"Theresa May says she has `absolute faith´ in Chancellor despite Budget U-turn | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Theresa May said she has “absolute faith” in Chancellor Philip Hammond despite the humiliating Budget U-turn on the National Insurance hike.\nThe Prime Minister gave her public support to the embattled Chancellor, who was forced to drop the increase in contributions for the self-employed just a week after his first Budget.\nThe plan had angered Tory backbenchers who believed it not only breached a manifesto pledge not to increase income tax or National Insurance contributions but would also hit traditional Tory supporters.\nAsked if she had ever thought he should resign, the Prime Minister told ITV News: “I have absolute faith in the Chancellor. We made very clear yesterday – he and I – about the tax lock, that we recognised the spirit of the manifesto and the change has been made.”\nMr Hammond was trying to turn the page on the row as he met US counterpart Steven Mnuchin for talks in Number 11.\nThe Chancellor used a newspaper column to explain why he had backed down over the measure, one of the key money-raising elements of his Budget.\nMr Hammond acknowledged the concern about the manifesto promise in an article for The Sun, which had campaigned against what it dubbed the “strivers’ tax”.\nPhilip Hammond\n“Trust matters in politics. And this Conservative Government sets great store in the faith and trust of the British people,” he said.\nHe insisted the measure was consistent with the tax pledges made in the 2015 election manifesto, and the legislation which followed only referred to the main rate of National Insurance for employees.\nBut he added: “For the Prime Minister and me, it’s not enough simply to meet to stay within the letter of our tax lock law. It’s important that we meet the spirit of our commitment as well.”\nThe policy had been set to bring in £2 billion for the Exchequer and narrow the gap in the tax paid by self-employed workers and those in employment.\nLabour said the decision meant there was now a “black hole” in his financial plans.","url":"https://www.dailymail.co.uk/wires/pa/article-4320582/Theresa-May-says-absolute-faith-Chancellor-despite-Budget-U-turn.html"}
