{"authors":["Kevin Hunt For The Conversation"],"date_download":"2018-10-23 03:38:42","date_modify":"2018-10-23 03:38:42","date_publish":"2016-01-11 16:25:58","description":"The iconic singer died of cancer yesterday, aged 69. Here, one expert explains why Bowie's eyes looked so different - a medical condition called anisocoria which makes the pupils different sizes.","filename":"data/vaneerConsumption/TheremarkablestorybehindDavidBowiesdistinctiveeyesrevealed.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/3005A65300000578-0-image-a-120_1452528057477.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3394180_The-remarkable-story-David-Bowie-s-iconic-feature_1540265922.html","title":"The remarkable story behind David Bowie's distinctive eyes revealed","title_page":"The remarkable story behind David Bowie's distinctive eyes revealed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Thousands of fans have paid tribute to David Bowie following his death from cancer aged 69.\nWhile he was undoubtedly one of the most influential musicians of his time - his latest album Blackstar was released just last week - he was also a style icon.\nBut aside from his flamboyant outfits, he also had a unique feature which he said gave him 'mystique'.\nHis eyes, which appeared to be different colours, were difficult not to notice.\nBowie had a condition called anisocoria - which meant his pupils were different sizes.\nThis gave the illusion of a difference in colour, explains Kevin Hunt, senior lecturer in design and visual culture at Nottingham Trent University,\nHere, writing for The Conversation, he explains what anisocoria is, and tells the remarkable story of how Bowie came to have it...\nDavid Bowie died in New York yesterday after an 18-month battle with cancer. Aside from his flamboyant taste in fashion, he had particularly distinctive eyes\nThe unusual appearance of Bowie's eyes were due to a condition called anisocoria\n'At the centre of it all, your eyes, your eyes …'\nMany aspects of the life and incredible achievements of David Bowie will be considered in the weeks and months ahead following the news of his death.\nYet the cryptic lyric above from the lead single on David Bowie's new album is a reminder that the unusual appearance of his eyes was a key part of the singer's star persona.\nIndeed their iconic presence features in the advertising campaign for ★[Blackstar], the tile track of his latest album.\nFor many people it is that look – that the eyes formed a core part of – that will be an abiding memory of Bowie.\nSo, why were they apparently two different colours?\nComplete heterochromia is a fairly rare condition (in humans) whereby each iris is a distinctly different colour, such as having one blue iris and the other brown.\nBut this isn't why Bowie's eyes looked different.\nInstead, the unusual appearance of Bowie's eyes were due to a condition called anisocoria.\nAnisocoria is a condition characterised by an unequal size in a person's pupils. In Bowie's case, his left pupil was permanently dilated.\nThis can create the illusion of having different coloured eyes because the fixed pupil does not respond to changes in light, while the right pupil does.\nAnisocoria is a condition characterised by an unequal size in a person's pupils. In Bowie's case, his left pupil was permanently dilated\nAnisocoria can create the illusion of having different coloured eyes because the fixed pupil does not respond to changes in light, while the other pupil does\nSo Bowie's left eye often appeared to be quite dark, due to the blackness of his dilated pupil, when compared to the blue of his right iris.\nThe dilated pupil of his left eye was also potentially more prone to the effect of 'red eye'.\nThis sometimes adds to the appearance of a different colour when contrasted to his right eye.\nRed eye occurs when light reflects off of the fundus (the back of the eye), through an open pupil, and captures a red coloration by picking up tonality from the blood in the choroid lining of the eyeball.\nThis can clearly be seen in the Aladdin Sane – Eyes Open photograph by Brian Duffy (shot in 1973 but unpublished until 2011) that was used as the lead image on the posters for the V&A David Bowie is (2013) exhibition.\nSo what happened?\nAnecdotally, the cause of Bowie's anisocoria was attributed to the fallout from a lusty scrap in the spring of 1962.\nBowie had come to blows with a friend, George Underwood, over a girl they were both hoping to date.\nBoth were just 15 at the time and their friendship seemingly remained intact.\nThe condition occurred after Bowie’s left eye became damaged in a fight over a girl when he was 15\nThe two performed together in various bands before Underwood turned from music to painting and graphics. But Bowie's left eye remained seriously damaged.\nAn impulsive punch had accidentally scratched the eyeball, resulting in paralysis of the muscles that contract the iris. From that day, Bowie's left pupil remained in a fixed open position.\nOver time, Bowie apparently thanked his friend for his notorious eye injury, telling Underwood that it gave him 'a kind of mystique'.\nThis mystique helped fuel some of Bowie's greatest creations and enhance iconic images, such as the album cover for Heroes (1977).\nHis eyes could appear eerie and mismatched, producing a captivating or mesmeric gaze from on stage or through the lens of a camera.\nAnd the uncanny appearance of Bowie’s eyes was ideal for a performer who embraced ideas of the alien, the outsider, the otherworldly and the occult.","url":"https://www.dailymail.co.uk/health/article-3394180/The-remarkable-story-David-Bowie-s-iconic-feature.html"}
