{"authors":["Nick Cunningham"],"date_download":"2018-10-30 22:59:33","date_modify":"2018-10-30 22:59:33","date_publish":"2018-07-25 00:00:00","description":"Oil prices could rise over $200 over the next year and a half, according to a new report. New regulations aimed at cutting sulfur emissions could cause a shortage of diesel fuel. The report says as many as half of world refineries cannot produce fuel that would meet the new regulations.","filename":"data/vaneerConsumption/Theresanewregulationthatcouldpushoilto200by2020.json","image_url":"https://amp.businessinsider.com/images/5b58c56cb354cd1f008b45a9-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_theres-a-new-regulation-that-could-push-oil-to-200-by-2020-2018-7_1540940373.html","title":"There's a new regulation that could push oil to $200 by 2020","title_page":"    There's a new regulation that could push oil to $200 by 2020 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Flared natural gas is burned off at Apache Corporations operations at the Deadwood natural gas plant in the Permian Basin on February 5, 2015 in Garden City, Texas. Spencer Platt/Getty\nOil prices could spike as high as $200 per barrel over the next 18 months, which would cause an \"economic crash of horrible proportions,\" according to a new report.\nA research paper from economist and oil market watcher Philip K. Verleger predicts there could be a shortage of low-sulfur diesel fuel in 2020 as a result of regulations from the International Maritime Organization (IMO) aimed at cutting sulfur emissions. The regulations, due to take effect at the start of 2020, lowers the allowed concentration of sulfur in maritime fuels from 3.5 percent to just 0.5 percent.\nThose rules have already sparked a scramble for low-sulfur options. But the current global refining capacity may not be able to churn out enough low-sulfur fuels to allow a smooth transition from high-sulfur fuels by the world's shipping fleet.\nThe shipping industry accounts for about 5 percent of total global oil demand, and most ships burn heavy fuel oil that is high in sulfur. Switching over 5 percent of total demand to low-sulfur diesel and gasoil - a distillate similar to diesel - is a massive shift.\nShip-owners will have a few options: install expensive scrubbers to remove sulfur, switch to low-sulfur fuels such as diesel or gasoil, or switch over to LNG. Scrubbers and LNG are generally thought to be the most expensive options, requiring capital outlays to overhaul entire fleets.\nThat will put the onus on low-sulfur fuels. But the problem is that not all crude oil is the same - heavier and sour varieties hold more sulfur and are unable to produce lower sulfur diesel without extra processing. And not all refineries are equipped to handle that processing.\nUp until now, the maritime industry has been burning the residual fuel oil left over after the refining process. Fuel oil is the bottom of the barrel - it's the cheapest, most viscous and dirtiest part of the barrel.\nBy 2020, diesel production will need to rise by at least seven percent, according to Philip K. Verleger, on top of the three percent increase needed for road transport and other uses. All of it will need to be low-sulfur. \"It is not clear that the greater volumes can be produced,\" Verleger wrote in his paper. \"Instead…very large price hikes may be required to suppress non-maritime use.\"","url":"https://www.businessinsider.com/theres-a-new-regulation-that-could-push-oil-to-200-by-2020-2018-7"}
