{"authors":["Aly Semigran"],"date_download":"2018-10-30 22:31:21","date_modify":"2018-10-30 22:31:21","date_publish":"2014-08-15 14:20:41","description":"This summer marks the 11th anniversary of the worst film of all time (and by worst I mean best): Tommy Wiseau's cinematic disasterpiece The Room . That's 11 glorious, baffling years of framed pictures of spoons, flower shop doggies, terrible green…","filename":"data/vaneerConsumption/TheRoomIsTheBestMovieEverBecauseItsTheWorst17ThingsOnlyTheRoomFansUnderstand.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/de18d30b-db02-4080-88ca-7fac1435d0c3.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_31649-the-room-is-the-best-movie-ever-because-its-the-worst-17-things-only-the-room_1540938681.html","title":"'The Room' Is The Best Movie Ever Because It's The Worst: 17 Things Only 'The Room' Fans Understand","title_page":"'The Room' Is The Best Movie Ever Because It's The Worst: 17 Things Only 'The Room' Fans Understand","title_rss":"NULL","source_domain":"bustle.com","text":"This summer marks the 11th anniversary of the worst film of all time (and by worst I mean best): Tommy Wiseau's cinematic disasterpiece The Room . That's 11 glorious, baffling years of framed pictures of spoons, flower shop doggies, terrible green screen shots, close-range football games, and indistinguishable accents. The Room , much like The Rocky Horror Picture Show , has become a cult classic and midnight movie favorite. It's all about a man named Johnny (played by Wiseau) and his, uh, struggles with his best friend Mark (Greg Sestero), his bride-to-be Lisa (Juliette Danielle), and some weird kid named Denny.\nHonestly, that makes The Room sound like a somewhat comprehensible or structured movie. It is not. It is one of the worst acted, written, and directed movies you'll ever lay your eyes on. Even so, fans of The Room love it for its infinite weirdness, its memorable lines, and its horrifically unforgettable sex scenes. (So much butt thrusting.)\nThe movie — which got its very small beginning at a movie theater in Los Angeles and has become a staple of the midnight movie circuit since — is about to go well beyond its cult status. Actor Greg Sestero quite literally wrote the book on The Room with his memoir The Disaster Artist: My Life Inside The Room, The Greatest Bad Movie Ever Made. The book, which was a hit with readers, is now being turned into a James Franco-produced movie. Tommy Wiseau, the man behind The Room, will also be invading the small screen with the creepy-sounding sitcom The Neighbors .\nBut for us fans that have been living in The Room for years, there are certain things only we can truly understand. Things like . . .\nWe Know This Wasn't an Intentional Comedy\nYouTube\nIf you've read Sestero's book or the in-depth Entertainment Weekly piece, anyone who worked on The Room will tell you that Wiseau thought he was making a brilliant, important drama. Hell, even in the trailer he proclaims himself on par with the likes of Tennessee Williams. Wiseau plays the movie off as a \"dark comedy\" now, but we know, deep down inside, this movie was deadly serious to him.\nand that nothing will ever match the First Time You Experienced the room\nThe first time I saw The Room was in 2009 at a midnight screening at New York City's Village East Cinema with one of my best friends. It remains one of the greatest moviegoing experiences of my entire life. The crowd was pumped. When Lisa's mom Claudette nonchalantly drops into conversation that she has cancer, I literally laugh-screamed until I had to catch my breath. I still crack up all of these viewings later, but I still miss my first time.\nyou know The Room Has the Best Fans\nWhile Rocky Horror fans may have us beat when it comes to pomp and circumstance, Rocky Horror is still a watchable movie. It takes real dedication to sit through a truly awful movie. Plus, we have some awesome bragging rights to famous fans. Paul Rudd, Kristen Bell, David Wain, Jonah Hill, David Cross, Patton Oswalt, Rob Lowe, and Justin Hill are just a few stars who are fans of The Room.\nReading The Disaster Artist Made You Appreciate The Room Even More\nYou always figured working on The Room was a totally insane experience, but Greg Sestero's firsthand account of the madness is truly eye-opening. It's a miracle that movie got made, let alone finished. That said, Greg and Tommy's bizarre, one-of-a-kind friendship and their bond is actually really heartwarming and sweet.\nthough No Matter How Many Times You Watch The Room, You Still Find Yourself Utterly Baffled\nmagicpuppy90 on YouTube\nWhat candles? What music? What sexy dress?! But the most important question still remains: Seriously, who the hell is Steven?\nThere Are Many Memorable Scenes in The Room, But NOTHING Tops the Flower Shop Scene\nYouTube\nOh, hi, doggy.\nWhen You See the Framed Pictures of Spoons, You Instinctively Throw Plastic Spoons at the Screen\nSpooooooooooon.\nyou know that the Best Place to Leave Stupid Comments is in Your Pocket\nMark knows what's up.\nand If You're Going To Throw The Ol' Pigskin Around, Best To Do It At Very Close Range\nAfter all, you wouldn't want to look stupid.\nyou know Lisa Has the worst Taste in Pizza\n\"Half Canadian bacon with pineapple, half artichoke with pesto, and light on the cheese.\" BARF. At least her taste in men is impeccable.\nand believe \"Anyway, How Is Your Sex Life?\" is a Perfectly Acceptable Non-Sequitur\nTommy knows what's up.\nyou know \"Me Underwears Guy\" Has the Best/Worst Oral Sex Face in the History of Cinema\nYou are Michelle's rose, Me Underwears Guy.\nThough the \"WHERE'S MY MONEY?\" Guy Actually Gives a Pretty Solid Performance\nYouTube\nFor a movie filled with stiff, downright confused performances the gun-toting, tank top-wearing drug money collector — better known as Chris R, despite the fact that there are no other characters named Chris in this movie — actually looks like he's trying for some reason. Granted, he only has one scene and he is ultimately pointless to the \"plot,\" but still.\nyou know The San Francisco Skyline is Actually Just One Giant Green Screen\nOccasionally, it is just a lot of b-roll footage of various locations, but the real San Francisco is seen from Tommy's roof.\nbut that's ok, because Love is Bliiiiind\nTommy's love life is so traumatic he offs himself and legitimate words of wisdom in this movie include gems like \"Marriage has nothing to do with love.\" (Betrayal is a big, running theme here.) And lest you be reminded of what happened to the girl that Mark knew that wound up in a hospital on Guerrero Street.\nyou believe The Room is a Perfect Litmus Test For Who Your Real Friends Are\nfooldeth on YouTube\nIf you've introduced a friend to The Room and they didn't absolutely lose their minds at the classic lines like \"You're tearing me apart, Lisa!\" or \"I did NAAAAAHHHHT!\" or \"Cheep, cheep, cheep!\" or \"I fed up with this world,\" they're really no friend at all.\nand most of all, you know this much: There's No One Weirder Than Denny\nDenny is a major league creeper whose presence in Tommy's life is questionable and unsettling at best. If Tommy is like a father figure to Denny, what the hell did Denny mean when he said he liked to watch him and Lisa in the bedroom? Never mind, it's best to just leave that as one of The Room's great mysteries.\nImages: IFC.com; aseatenontv.wordpress.com; Gifmovie.tumblr.com; Zdouf.com; Weheartit.com; fuckyeahtheroommovie.tumblr.com; paperdemons.tumblr.com; TheHuffingtonPost.com; Imgur.com; Gifsoup.com; Giphy.com; Gifmovie.tumblr.com; Wifflegif.com","url":"https://www.bustle.com/articles/31649-the-room-is-the-best-movie-ever-because-its-the-worst-17-things-only-the-room"}
