{"authors":["Ephraim Hardcastle For The Daily Mail"],"date_download":"2018-10-22 20:32:05","date_modify":"2018-10-22 20:32:05","date_publish":"2016-01-28 01:39:09","description":"Honoured guest Sir David Attenborough had his speech drowned by the racket from boozy, broadcasting hangers-on, writes EPHRAIM HARDCASTLE.","filename":"data/vaneerConsumption/TheRadioTimesannualpartywasarowdyaffairwritesEPHRAIMHARDCASTLE.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/309DCB3A00000578-0-image-a-60_1453945138748.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-3420256_EPHRAIM-HARDCASTLE-Radio-Times-annual-party-rowdy-yobby-affair_1540240325.html","title":"The Radio Times annual party was a rowdy affair writes EPHRAIM HARDCASTLE","title_page":"The Radio Times annual party was a rowdy affair writes EPHRAIM HARDCASTLE | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Radio Times annual party honouring those who have appeared on its covers, held in the expensive grandeur of Claridge’s, was a rowdy, yobby affair.\nHonoured guest Sir David Attenborough had his speech drowned by the racket from boozy, broadcasting hangers-on.\nSo did Jeremy Paxman of University Challenge, Poldark’s Aidan Turner and guest speaker Graham Norton.\nHonoured guest Sir David Attenborough had his speech drowned by the racket from boozy, broadcasting hangers-on\nSays comedian Barry Cryer: ‘I’ve complained to Radio Times editor Ben Preston. It was the rudest crowd I’ve ever seen.’\nBBC director-general Tony Hall should have a word with those responsible.\nThe Duke of York drove himself to Mile End, in London’s East End, to meet business types on Tuesday.\nHe covered the six miles through crowded City traffic in just 20 minutes.\nMy source explains: ‘Andrew, who had police outriders clearing his way, was able to pass through red lights and not worry about speed limits, finding a parking space or change for a meter when he arrived. Still, credit where it’s due!’\nDavid Cameron’s former ‘director of strategy’ Steve Hilton is asked on Radio 4’s Today programme about the public anger surrounding Google’s enviably lax tax arrangements here.\nCalifornia-based Hilton, 46, tells John Humphrys: ‘The first thing I just want to make clear for your listeners, John, just in terms of disclosure, is that my wife (Tory activist Rachel Whetstone, 47, who was godmother to Cameron’s late son, Ivan) was, for many years, a senior executive at Google.’\nAnd Google, he added, was ‘abiding by the law then…’ Of course.\nTory activist Rachel Whetstone, 47, who was godmother to Cameron’s late son, Ivan\nWith husband-to-be Rupert Murdoch having reportedly bought her a £2.4million engagement ring, Texan ex-model Jerry Hall must find the media mogul a generous soul compared with her stingy former partner, rock Scrooge Sir Mick Jagger.\nPop biographer Debra Sharon Davis, who toured with the Stones, says Sir Mick was even prone to ‘micro-managing transactions with call girls’.\nTrump-hairstyled Tory MP Michael Fabricant praises Waitrose’s managing director Mark Price, who has become a ‘director’ at the Cabinet Office.\nShould confirmed bachelor Fabricant declare an interest? His companion, Andy Street, is managing director of John Lewis, which owns Waitrose.\nRE Gerry Adams’s Little Book of Tweets, which I mentioned yesterday, a Southampton reader says: ‘It put me off my cornflakes hearing those saps on Radio 4’s Today programme going all gooey-eyed over this monster’s pathetic twitterings.\n'Doubly sickening that our enforced patronage is subsidising his free publicity.’\nArchbishop of Canterbury Justin Welby, making light on ITV’s Good Morning about parents wearing pyjamas when dropping off their children at school, says: ‘I wear a cassock in public places... who knows what I’ve got underneath it?’ Or wants to know!\nHarry Potter star Daniel Radcliffe, 26, plays a floating corpse in his new film, Swiss Army Man.","url":"https://www.dailymail.co.uk/debate/article-3420256/EPHRAIM-HARDCASTLE-Radio-Times-annual-party-rowdy-yobby-affair.html"}
