{"authors":["Simon Black","Sovereign Man"],"date_download":"2018-10-30 22:59:10","date_modify":"2018-10-30 22:59:10","date_publish":"2018-07-25 00:00:00","description":"Corporate pension plans are facing a $553 billion shortfall. And state, federal and local government pension plans are $7 trillion short in funding. The reason for the pension crisis is simple — investment returns are not high enough.","filename":"data/vaneerConsumption/TheresoneobviousculpritbehindtheUSpensioncrisis.json","image_url":"https://amp.businessinsider.com/images/5b58b34704f16238008b4572-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_theres-one-obvious-culprit-behind-the-us-pension-crisis-2018-7_1540940350.html","title":"There's one obvious culprit behind the US pension crisis","title_page":"    There's one obvious culprit behind the US pension crisis - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Allison Shelley/Getty Images\nI've been talking a lot about the looming pension crisis…\nMy short thesis is, if you're depending on a pension for your retirement, it's time to start looking elsewhere.\nPensions are simply giant funds responsible for paying out retirement benefits to workers.\nAnd today, the nation's 1,400 corporate pension plans are facing a $553 billion shortfall. And, according to Boston College, about 25% will likely go broke in the next decade.\nThink about that… A full one-quarter of US, non-government employees expecting a pension to fund their retirement will likely get zilch.\nAnd it's even worse for the government…\nAccording to credit-rating agency Moody's, state, federal and local government pension plans are $7 trillion short in funding.\nThe reason for this crisis is simple - investment returns are too low.\nPension funds invest in stocks, bonds, real estate, private equity and a host of other assets, hoping to generate a safe return.\nBut with interest rates near their lowest levels in human history, it's been difficult for these pensions to generate a suitable return without taking on more and more risk.\nAnd that's another big problem with pensions - their investment returns are totally unrealistic.\nMost pension funds require a minimum annual return of about 8% a year to cover their future liabilities.\nBut that 8% is really difficult to generate today, especially if you're buying bonds (which is the largest asset for most pensions). So pensions are allocating more capital to riskier assets like stocks and private equity.\nAnd so far it's working.\nThe California State Teachers' Retirement System (CalSTRS) and California Public Employees' Retirement System (CalPERS) both earned more than 8% for the second fiscal year in a row. CalPERS is the largest public pension in the US. And, together, the two funds manage $575 billion for 2.8 million public workers and retirees.\nTwo 8%+ years isn't the norm. Over the past 10 years ending June 30, CalSTRS returned an annualized 6.3% a year - well below its target. And CalPERS has returned a dismal 5.1% over the same period.\nAnd that's been with the tailwind of one of the longest equity and fixed-income bull markets in history.\nIt's clear these inflated gains can't last.\nAnd the two California pension giants are even admitting the game is up.\nNo, no more 8% target return, as we teeter on the edge of what could be the largest market correction of our lifetime.\nCalSTRS is making the bold move to drop its future goal to… 7%.\nAnd CalPERS is ratcheting down its return goals in steps to… wait for it, 7% by 2021.\nListen, it's a nice gesture for these big funds to lower their expected returns and admit things are tough out there.\nBut 7% is still totally unrealistic. And that's not even taking into account the tough times I see ahead for markets. Pensions haven't been able to hit a 7% return in the best of times.\nAs of June 2017, the 10-year annualized median return for all public pensions tracked by the Wilshire Trust Universal Comparison Service was 5.57%.\nThat's nearly 250 basis points below the 8% target.\nBut there's another way pensions make money… they collect funds from active workers and taxpayers.\nWhen these funds drop their return expectations, it has real life implications. With a lower, projected return, a pension fund needs more cash to pay out its future liabilities.\nFor example, CalPERS, which is dropping its expected return to 7% by 2021, said the state and school districts paying into the pension will have to pay at least $15 billion more over the next 20 years once the 7% target kicks in.\nSo, people depending on a pension not only likely won't get the money owed to them in the future… but they'll also get stuck paying more into the system today. It's a true lose/lose.","url":"https://www.businessinsider.com/theres-one-obvious-culprit-behind-the-us-pension-crisis-2018-7"}
