{"authors":["Andrew Meola"],"date_download":"2018-10-30 21:17:40","date_modify":"2018-10-30 21:17:40","date_publish":"2016-12-21 00:00:00","description":"With mobile searches overtaking desktop, its only a matter of time before mobile commerce does the same. See the emerging trends in m-commerce and mobile shopping.","filename":"data/vaneerConsumption/TheRiseofMCommerceMobileShoppingStatsTrends.json","image_url":"https://amp.businessinsider.com/images/57d0167db996eb0e228b62f1-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_mobile-commerce-shopping-trends-stats-2016-10_1540934260.html","title":"The Rise of M-Commerce: Mobile Shopping Stats & Trends","title_page":"    The Rise of M-Commerce: Mobile Shopping Stats & Trends - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII E-commerce has been on the rise massively in recent years, but it may not be the next true frontier for shopping as m-commerce continues to become more popular.\nBut just what is m-commerce, and how do we compare e-commerce vs. m-commerce?\nSimply put, m-commerce involves shopping through a mobile device (typically a smartphone), while e-commerce involves shopping online through your computer.\nAnd m-commerce is poised to burst into the mainstream thanks to a host of technological advances that are making it easier for people to shop on their phones. Below, we've outlined the road ahead for m-commerce growth and detailed some mobile shopping statistics.\nMobile Commerce Industry Advantages and Disadvantages\nM-commerce has the potential to become a major channel for shopping and to change consumer shopping habits, but one overwhelming factor has prevented this shift.\nThe mobile shopping experience is a nightmare.\nUsers get so frustrated when trying to shop on their phones that they far more often than not abandon the process. In the second quarter of 2015, U.S. adults spent 59% of their time on mobile and 41% on desktop, but just 15% of their dollars on mobile and a staggering 85% of their dollars on desktop.\nMultiple factors contribute to this poor mobile shopping experience. The most prevalent of these is smartphones' small screen size. This makes product details difficult to read and payment information frustrating to enter, especially because many sites are not mobile optimized. This is far and away the main reason that customers give up: completing a purchase on a phone just takes too much work.\nSpeed is also a problem. Mobile users often shop on the go, which provides convenience but also puts them at the mercy of spotty Wi-Fi and LTE connections.\nAnd finally, users feel less secure when entering their payment information on a phone when compared to a desktop or laptop.\nBut companies are starting to address these problems and are providing a boost to m-commerce as a result. Smartphone manufacturers are enlarging their phones to improve the user experience, which helps not just mobile shopping, but gaming, mobile video, and more.\nSocial media sites such as Facebook, Twitter, and Pinterest have all introduced \"buy buttons\" that let shoppers make purchases without having to leave the platform.\nAnd many retailers have introduced one-click checkout to their sites. This method requires shoppers to enter their payment information once, and then they can use the one-click option to make purchases without having to re-enter it.\nBII\nM-Commerce Market Share and Size\nM-commerce will rise in the coming years as e-commerce grows to become a larger portion of total U.S. retail sales. In 2014, m-commerce made up 11.6% of the $303 billion U.S. e-commerce total, according to data from the U.S. Census Bureau and comScore.\nBI Intelligence, Business Insider's premium research service, used this data to forecast that m-commerce will reach $284 billion, or 45% of the total U.S. e-commerce market, by 2020.\nM-Commerce Statistics\nA recent LexisNexis study demonstrated how m-commerce is on the cusp of becoming the go-to habit for shoppers.\nThe study polled more than 1,000 U.S. merchants and found that 16% of them already have a mobile shopping channel, while 32% are thinking of adding one in the next year.\nM-commerce adoption is also high among e-commerce merchants, as 80% of e-commerce retailers with at least $50 million in annual sales either currently offer or plan to offer m-commerce. This makes sense given that these companies have already heavily invested in digital, so mobile would be the next logical step for them.\nMore to Learn\nMobile shopping trends are pointing to m-commerce as the wave of the future for shoppers. But mobile shopping is just one aspect of the broader payments ecosystem.\nThat's why BI Intelligence spent months compiling the best and most exhaustive guide on the world of payments entitled The Payments Ecosystem Report: Everything You Need to Know About The Next Era of Payment Processing.\nTo get your copy of this invaluable guide to the payments industry, choose one of these options:\nSubscribe to an ALL-ACCESS Membership with BI Intelligence and gain immediate access to this report AND over 100 other expertly researched deep-dive reports, subscriptions to all of our daily newsletters, and much more. >> START A MEMBERSHIP Purchase the report and download it immediately from our research store. >> BUY THE REPORT\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of the fast-moving world of the payments ecosystem.","url":"https://www.businessinsider.com/mobile-commerce-shopping-trends-stats-2016-10"}
