{"authors":["Dave Burke For Mailonline"],"date_download":"2018-10-23 01:15:45","date_modify":"2018-10-23 01:15:45","date_publish":"2017-04-26 11:30:27","description":"A fascinating series of photographs, taken by photographer Alfred T. Palmer in 1943, reveals the key role women played in the American war effort.","filename":"data/vaneerConsumption/TherealRosietheRivetersinfullcolor.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9EFF9500000578-0-image-a-70_1493202590236.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446932_The-real-Rosie-Riveters-color_1540257345.html","title":"The real Rosie the Riveters - in full color","title_page":"The real Rosie the Riveters - in full color | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A fascinating series of photographs reveals the key role women played in the American war effort during the conflicts in Europe and the Pacific.\nThey show female workers in factories, drawing comparison to the famous Rosie the Riveter posters, representing the women who produced weapons used on the frontline.\nThe candid colour photographs, snapped at workplaces across the United States, were taken by photographer Alfred T. Palmer in 1943.\nHe was an Office of War Information photographer, and showed the scale of the operation required to resource the US Army.\nWomen are shown working on Vengeance dive bombers, building fighter planes and publicising the Salvage for Victory campaign, which encouraged Americans to dig out materials to help on the road to victory.\nA woman working on an airplane motor at a North American Aviation Inc in California during 1943\nA woman operating a hand drill at Vultee-Nashville in Tennessee, where she was working on a Vengeance dive bomber, Tennessee\nThe Rosie the Riveter pictures were produced during the Second World War to reflect the work women were doing to support the war effort\nThese colleagues were working on a Vengeance dive bomber during the American war effort at the height of the conflict in 1943\nWomen at work on a bomber at Douglas Aircraft Company in Long Beach, California, in the fascinating series of photographs\nOperating a hand drill at Vultee-Nashville, this woman is pictured working on a Vengeance dive bomber in Tennessee\nA female worker at the Vultee-Nashville plant making final adjustments in the wheel well of an inner wing before the installation of the landing gear in Nashville, Tennessee. This was one of the numerous assembly operations in connection with the mass production of Vultee Vengeance dive bombers\nA plant worker producing self-sealing gas tanks at the Goodyear Tire and Rubber Co in Akron, Ohio in the 1943 photograph series\nA young woman at North American Aviation Incorporated carries out work on the landing gear mechanism of a P-51 fighter plane in Inglewood, California\nTwo women are shown capping and inspecting tubing which goes into the manufacture of the Vengeance dive bomber made at Vultee's Nashville division in Tennessee\nA female worker in a glass house is seen putting the finishing touches to the bombadier nose section of a B-17F navy bomber in Long Beach, California\nA riveting machine operator at the Douglas Aircraft Company plant joins sections of wing ribs to reinforce the inner wing assemblies of B-17F heavy bombers in Long Beach, California\nOffice worker Annette del Sur publicizing a salvage campaign in the yard of Douglas Aircraft Company in Long Beach, California\nOperating a hand drill, this woman worker at Vultee-Nashville is shown working on the horizontal stabilizer for a Vultee Vengeance dive bomber in Tennessee\nA plant worker at North American Aviation Inc during 1943 is one of the fascinating images that features in the collection of photographs\nAn electronics technician at Goodyear Aircraft Corp in Akron, Ohio, in 1943 (left) and a worker absorbing the California sunshine during a break at Douglas Aircraft Company in Long Beach, California (right)\nA woman is seen finishing the US Army Air Forces insignia on the side of a fuselage of a Vengeance dive bomber made a Vultee's Nashville division in Tennessee","url":"https://www.dailymail.co.uk/news/article-4446932/The-real-Rosie-Riveters-color.html"}
