{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 22:00:43","date_modify":"2018-10-30 22:00:43","date_publish":"2016-12-16 00:00:00","description":"May made the move in a meeting with the other leaders on Thursday in Brussels, the FT said, but there was no response.","filename":"data/vaneerConsumption/TheresaMayisseekinganearlyBrexitdealforexpats.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_theresa-may-is-seeking-an-early-brexit-deal-for-expats-article-50-2016-12_1540936843.html","title":"Theresa May is seeking an early Brexit deal for expats","title_page":"    Theresa May is seeking an early Brexit deal for expats article 50 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty Images LONDON — Prime Minister Theresa May tried to get early assurances from other European Union leaders that they would agree to let British expats stay in Europe, according to a report in the Financial Times.\nMay made the move in a meeting with the other leaders on Thursday in Brussels, the FT said.\nThere was no immediate response to May's request.\nIrish Prime Minister Enda Kenny told reporters that May said she would \"like to have the question of UK citizens living in Europe and European citizens living in the UK\" resolved early on in the Brexit negotiations.\nIt is not the first time the prime minister has faced silence on the fate of expats and European citizens in the UK in the Brexit process.\nLast month German Chancellor Angela Merkel and Donald Tusk, the European Council president, rejected an early deal on citizens' rights. Tusk said that the Brexit vote had created \"anxiety and uncertainty\" for Europeans living in Britain.\nSimilarly May has been attacked for not guaranteeing the rights of Europeans living in the UK.\nLabour MP Gisela Stuart, who campaigned to Leave the European Union, said earlier this week that \"Britain should make clear at the start of the Brexit negotiations that EU citizens already here before that date can stay.\n\"We should expect reciprocal deals for Britons living in European countries, but Britain should make the first move to demonstrate goodwill.\"","url":"https://www.businessinsider.com/theresa-may-is-seeking-an-early-brexit-deal-for-expats-article-50-2016-12"}
