{"authors":[],"date_download":"2018-10-23 00:48:35","date_modify":"2018-10-23 00:48:35","date_publish":"2016-11-18 00:00:00","description":"One of Trump's closest advisers during the campaign was Jared Kushner, who is married to Trump's daughter Ivanka. The close political relationship is expected to continue into the White House.","filename":"data/vaneerConsumption/TheRiseOfJaredKushnerDonaldTrumpsSonInLaw.json","image_url":"https://media.npr.org/assets/img/2016/11/18/gettyimages-621870646_wide-24564710bdd129915d785028eb9be1ae17dbf5b9.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=502539418_1540255715.html","title":"The Rise Of Jared Kushner, Donald Trump's Son-In-Law","title_page":"The Rise Of Jared Kushner, Donald Trump's Son-In-Law : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nDonald Trump places great faith in his son-in-law Jared Kushner. The New York Times reports that Trump wants Kushner in the White House, and he's exploring whether he can take a position. It's problematic, though, because even an unpaid job could fall under a law prohibiting nepotism. People are supposed to be loyal to the country above their family. NPR's David Folkenflik has a profile of an understated powerbroker.\nDAVID FOLKENFLIK, BYLINE: Though also a developer, Jared Kushner is many things that Donald Trump is not. He's 35 years old. That's half Trump's age. He's an Orthodox Jew. Trump has been accused of promoting anti-Semitic themes. He shies away from the limelight. The president-to-be would not be described that way. Jared Kushner does few interviews and declined our request through a spokeswoman. Here's what he sounds like.\n(SOUNDBITE OF ARCHIVED RECORDING)\nJARED KUSHNER: It's funny. When I think back kind of on starting my career, the last place I thought I would be would be spending a lot of time in Brooklyn.\nFOLKENFLIK: This is from a keynote address he gave at a real estate conference in 2014.\n(SOUNDBITE OF ARCHIVED RECORDING)\nKUSHNER: About four years ago, through our different media companies and our venture business, you know, I started noticing that a lot of the kids in the companies were really living and wanting to work here.\nSTEVE KORNACKI: I think Jared is an unusually polished person.\nFOLKENFLIK: That's MSNBC anchor and correspondent Steve Kornacki. He covered Jared Kushner's family as a political reporter in New Jersey and later worked for him at The New York Observer newspaper.\nKORNACKI: I've heard so many stories of Jared being groomed from a very young age - really, from from when he was a child - to be playing a prominent role in the business world, in sort of the elite world - in elite circles.\nFOLKENFLIK: Kushner's father, Charles, was a developer who made a fortune in New Jersey real estate. Charles Kushner gave to charities, hospitals and universities, including Harvard, which admitted Jared Kushner after a $2.5 million gift, according to a book by the journalist Daniel Golden. And Charles Kushner also gave to politicians, mostly Democrats. The elder Kushner spoke of his family as the Jewish Kennedys with respectable children of a roguish father. Charles Kushner's lawyer once described him this way.\n(SOUNDBITE OF ARCHIVED RECORDING)\nBENJAMIN BRAFMAN: I think, as everyone knows, Mr. Kushner is one of the most successful businessmen in the United States and one of the great philanthropists of this century.\nFOLKENFLIK: That lawyer, Ben Brafman, said those words on the federal courthouse steps in Newark. A top federal prosecutor had caught the elder Kushner in his sights, then U.S. Attorney Chris Christie. Here's what Christie had to say about Charles Kushner in 2004.\n(SOUNDBITE OF ARCHIVED RECORDING)\nCHRIS CHRISTIE: Mr. Kushner engaged in a conspiracy, with co-conspirators, to hire prostitutes to entice witnesses who were cooperating with the federal investigation.\nFOLKENFLIK: Charles Kushner had set up his own brother-in-law and intended to blackmail him by threatening to expose him to his sister. Steve Kornacki covered the saga.\nKORNACKI: Chris Christie's rise in politics in New Jersey, in many ways, was built on his takedown of Charles Kushner. He got national headlines for that prosecution.\nFOLKENFLIK: Charles Kushner went to jail. Christie would become governor. Jared Kushner, just in his mid-20s, led his family's vast holdings and, according to people who know him, quietly nursed a grievance.\nKORNACKI: To the extent anybody had heard of the Kushner name at that point, it was a very tarnished name.\nFOLKENFLIK: The younger Kushner made the conscious decision to push east from New Jersey into New York City. He bought The New York Observer, read faithfully by the city's elites in media, real estate and finance. In 2007, the family acquired a giant complex on Fifth Avenue in Manhattan for $1.8 billion.\nKORNACKI: They overpaid - and probably knowingly overpaid for it - because they - it was the exact same idea as the as the Observer. They wanted something that just commanded instant status and recognition.\nFOLKENFLIK: In 2009, Kushner married Ivanka Trump. She converted to Judaism with her father's support, and the two men enjoyed a warm rapport. During the campaign, one young Observer writer challenged Kushner in his own pages, accusing him of giving Trump's most hateful supporters the tacit approval of his Jewish son-in-law.\n(SOUNDBITE OF TV SHOW, \"INSIDE EDITION\")\nUNIDENTIFIED REPORTER: Do you think that Donald Trump is an anti-Semite?\nDANA SCHWARTZ: As an individual, no.\nFOLKENFLIK: Observer culture reporter Dana Schwartz appeared on the TV show \"Inside Edition\" in July.\n(SOUNDBITE OF TV SHOW, \"INSIDE EDITION\")\nSCHWARTZ: His supporters, many of them, absolutely are. And his willingness to continue to wink at them and acknowledge them is horrifying.\nFOLKENFLIK: Kushner invoked his grandparents' experience surviving the Holocaust and vouched for Trump's lack of bigotry. In recent days, Donald Trump's transition chief lost his responsibilities and standing. That would be Chris Christie, the person who had put Kushner's father in federal prison. Kushner's associates have told reporters Chris Christie's history with the Kushners had nothing to do with his humbling. But then, Jared Kushner always did speak quietly.\nDavid Folkenflik, NPR News, New York.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=502539418"}
