{"authors":["Matthew Frankel","The Motley Fool"],"date_download":"2018-10-30 23:10:30","date_modify":"2018-10-30 23:10:30","date_publish":"2016-12-07 00:00:00","description":"The maximum Social Security tax in 2017 will see big increase over 2016.","filename":"data/vaneerConsumption/TheresabigchangehappeningtoSocialSecurityin2017hereswhatyouneedtoknow.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_maximum-social-security-tax-2017-2016-12_1540941030.html","title":"There's a big change happening to Social Security in 2017 - here's what you need to know","title_page":"    There's a big change happening to Social Security in 2017 — here's what you need to know - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Allison Shelley/Getty Images The maximum Social Security tax in 2017 will be $7,886.40 per employee, which represents a pretty big increase over 2016.\nThat's the simple answer. Below, find out why the maximum Social Security tax is increasing so much, whether the increase will affect you, and what to expect in the coming years.\nThe maximum Social Security tax in 2017\nThe current Social Security tax rate is 6.2% for both employers and employees, and the 2017 maximum earnings amount subject to Social Security tax is $127,200. This translates to a maximum Social Security tax of $7,886.40 for an individual.\nSelf-employed individuals are responsible for paying both the employer and employee portion of the Social Security tax, or a rate of 12.4% altogether, up to the maximum taxable amount. In other words, the highest Social Security tax a self-employed individual would have to pay in 2017 would be twice that of an individual employee, or $15,772.80. Technically, this is the maximum Social Security tax that could be assessed to any single person for the 2017 tax year.\nIn 2016, the maximum Social Security tax was $7,347 for an employee, or $14,694 for a self-employed individual. 2017's maximum Social Security tax represents an increase of $539.40 and $1,078.80, respectively.\nWhy such a big jump from 2016?\nThe maximum taxable Social Security earnings amount was formerly $118,500, so the 2017 wage cap represents a 7.3% increase. This may seem excessive, given that the cost-of-living adjustment (COLA) given to current beneficiaries was just a paltry 0.3%. In fact, this is the largest one-year increase to the earnings limit in the program's history.\nWhy the big jump? In a nutshell, wages have grown significantly in the U.S., and the 7.3% increase represents two years' worth of wage growth. Unlike the COLA, which is tied to inflation, the taxable earnings limit is based on wage growth.\nHowever, the law states that the taxable earnings cap cannot increase in years when there is no COLA. Since Social Security beneficiaries did not receive a COLA in 2016, the maximum taxable earnings was stuck at $118,500 for two years.\nMembers of the audience listen during a briefing on 'Rising Inequality and Its Impact on Social Security' February 10, 2015 on Capitol Hill in Washington, DC. Alex Wong/Getty Images\nIt could go much higher in the future\nAs a final thought, it's important to note that the maximum Social Security tax could be much higher in the future as Congress tries to fix the program's financial troubles. According to the latest projections, Social Security is expected to run out of cash reserves by 2034, at which point massive benefit cuts would be necessary.\nPresident-elect Donald Trump has vowed not to cut Social Security benefits, which is also the preference of the majority of Americans of all age groups, income levels, and political affiliations. And while he has promised to do so without raising taxes, a Social Security tax increase is a real possibility in the future.\nThere are two ways to increase Social Security taxes. The actual tax rate could be raised, or the taxable wage cap could be increased or eliminated. Whether or not one or both of these will happen within the next few years is anyone's guess, and they seem less likely with a completely Republican government.\nFor the next several years, the earnings cap will likely continue to rise with wage growth as it has in the past, unless new legislation is passed.\nNevertheless, something will eventually need to be done to fix the problem, and because benefit cuts are widely unpopular, Americans (particularly those with higher incomes) should prepare for their Social Security taxes to increase significantly at some point in the future.","url":"https://www.businessinsider.com/maximum-social-security-tax-2017-2016-12"}
