{"authors":["Nick Cunningham"],"date_download":"2018-10-30 22:52:29","date_modify":"2018-10-30 22:52:29","date_publish":"2018-07-28 00:00:00","description":"Two of the world's most critical potential chokepoints are suddenly at risk. Nearly two-thirds of global oil trade travels through maritime routes, so knowing where the top chokepoints could happen is crucial in the oil market.","filename":"data/vaneerConsumption/Thereare4keychokepointsforoil.json","image_url":"https://amp.businessinsider.com/images/5b5b3c2e8ea82f1b008b4762-320-160.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_there-are-4-key-chokepoints-for-oil-2018-7_1540939949.html","title":"There are 4 key chokepoints for oil","title_page":"    There are 4 key chokepoints for oil - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Iranian military personnel participate in the Velayat-90 war game in unknown location near the Strait of Hormuz in southern Iran December 30, 2011. REUTERS/Fars News/Hamed Jafarnejad\nWhile everyone has been watching the Strait of Hormuz amid rising tension between the U.S. and Iran, a chokepoint on the other side of the Arabian Peninsula is now at the center of the action.\nSaudi Arabia temporarily halted all oil shipments through the Bab al-Mandeb strait after Saudi Aramco reported attacks from Houthi rebels on two oil tankers. The two ships in question were very large crude carriers (VLCCs), each carrying 1 million barrels of oil, and one of them sustained minor damage. The Houthis said that they have the naval capability to hit Saudi ports and other targets in the Red Sea, according to Reuters.\nIn response, Saudi energy minister suspended oil shipments through the strait. \"Saudi Arabia is temporarily halting all oil shipments through Bab al-Mandeb strait immediately until the situation becomes clearer and the maritime transit through Bab al-Mandeb is safe,\" Khalid al-Falih said. The Kuwait Oil Tanker Company said that it might also suspend tanker traffic through the narrow chokepoint.\nThe sudden risk to two of the world's most critical chokepoints has pushed up oil prices a bit this week, although serious outages have yet to materialize.\nNearly two-thirds of the world's oil trade travels via maritime routes. Here is a quick rundown of the top global chokepoints for the oil trade.\n1. Strait of Hormuz. The most vital chokepoint in the world sees nearly 19 million barrels per day (mb/d) of oil traffic, according to the EIA. At its narrowest point, Hormuz is only 21 miles wide. Through that narrow passage, oil exports from Iraq, Iran, Kuwait, Bahrain, Qatar (including large volumes LNG exports), the UAE and Saudi Arabia must pass. The U.S. Navy patrols the area because of its strategic importance. Iran has threatened to disrupt oil traffic through the Strait, but for now the market is assuming that is all bluster.\n2. Strait of Malacca. The second most important chokepoint in terms of oil volumes is the Strait of Malacca, between Indonesia and Malaysia, which saw 16 mb/d of oil in 2016. The Strait links the Indian and Pacific Oceans, and is the main route for oil from the Middle East to reach Asian markets. The Strait is only 1.7 miles wide at its narrowest point, \"creating a natural bottleneck with the potential for collisions, grounding, or oil spills,\" according to the EIA. China, the largest oil importer in the world, has a strategic interest in seeing uninterrupted tanker traffic through the Strait.","url":"https://www.businessinsider.com/there-are-4-key-chokepoints-for-oil-2018-7"}
