{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 19:22:23","date_modify":"2018-10-30 19:22:23","date_publish":"2015-03-28 19:46:22","description":"\"I think Harry Reid's getting out of town ahead of the posse,\" former U.S. Attorney Joe diGenova tells Breitbart News. The Senate Minority Leader says he'll retire in 2017, at the conclusion of his current term. |","filename":"data/vaneerConsumption/TheRealReasonHarryReidisRetiring.json","image_url":"https://media.breitbart.com/media/2015/02/Reid-Schumer-AP-Photo-J.-Scott-Applewhite.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_28__1540927343.html","title":"The Real Reason Harry Reid is Retiring","title_page":"The Real Reason Harry Reid is Retiring | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Senate Minority Leader Harry Reid (D-NV) explains his shocking decision to not seek re-election and retire when his term ends in 2016 by telling the New York Times, “he was worried his race would consume campaign money that would be needed in other competitive states as Democrats try to regain control of the Senate.”\n“I think it is unfair for me to be soaking up all the money to be re-elected with what we are doing in Maryland, in Pennsylvania, in Missouri, in Florida,” Reid told the Times.\nReid said neither his recent eye injury nor concern over his chances of winning played a factor in his decision.\nBut the real reason Reid is retiring may have nothing to do with any of these excuses and everything to do with his concerns that a possible Republican Presidential victory in 2016 would lead to the appointment of a Republican Attorney General in January 2017.\nA Republican Attorney General would be almost certain to initiate a criminal investigation into Reid’s abuse of his political power in a brazen intervention in the Department of Homeland Security’s (DHS) issuance of EB-5 visas to investors in a Las Vegas casino and hotel that was represented by his son, Rory Reid, as was highlighted in a report released by the Inspector General of DHS last week.\n“I think Harry Reid’s getting out of town ahead of the posse,” former U.S. Attorney Joe diGenova tells Breitbart News.\nOn Thursday, the non-profit group Cause of Action called on the Department of Justice (DOJ) to launch a criminal investigation of Reid. Citing the specific federal statutes that were violated, the group said Reid “participat[ed] in unlawful political activity, possible coercion and fraud related to the U.S. Citizenship and Immigration Services’ EB-5 Immigrant Investor Program.”\nThe DOJ under President Obama and Attorney General Eric Holder is so highly politicized it would never launch a criminal investigation into the many scandals in which Harry Reid is at the center.\nBut, as diGenova told Breitbart News on Friday, “[t]here is no doubt in my mind that an independent Department of Justice or an independent U.S. Attorney would open a preliminary criminal investigation into Harry Reid’s intervention into the expediting of EB-5 visas and would in addition convene a grand jury.” (emphasis added)\nReid announced his surprising decision to retire just days after the DHS Inspector General released a report that concluded: “Reid pressured a compliant DHS official to override normal departmental procedures and rush through 230 EB-5 foreign visa applications, thereby freeing up $115 million the applicants invested in the SLS Hotel and Casino in Las Vegas.”\nAs Breitbart News reported, “the owner of that casino project had hired Reid’s son, Rory Reid, to provide legal representation for the project.”\nThen there’s Reid’s complicity in Senator Robert Menendez’s (D-NJ) abuse of his political office by intervening in an ongoing Department of Health and Human Services adjudicatory process involving $8.9 million in Medicare overbilling by his friend and campaign funds donor, Dr. Salomon Melgen.\nAs Breitbart News reported, Reid “hosted a meeting between Senator Robert Menendez (D-NJ) and Secretary of Health and Human Services Kathleen Sebelius. At the meeting, Menendez made the case for his friend and donor, Dr. Salomon Melgen, who was at the time embroiled in what was supposed to be an independent adjudicatory process at HHS involving $8.9 million the department said he overbilled Medicare.”\nReid’s intervention came “immediately after Melgen donated $300,000 to the Senate Majority PAC, a Super PAC that has close ties to Reid. By the end of 2012, Melgen’s donations to the Senate Majority PAC totaled $700,000.”\nFor his part in that intervention, Senator Menendez has been the subject of an ongoing criminal investigation by the DOJ. Press reports indicate that Menedez is expected to be indicted on charges of public corruption very soon, though last minute negotiation efforts by his attorneys may delay or possibly forestall such action.\nThe damaging information an independent DOJ investigation could turn up with the exercise of subpoena power on hundreds of investors and business associates involved in the numerous Harry Reid scandals could be substantial.\nA recent report by ABC News indicates the kinds of embarrassing information likely to turn up when DOJ investigators start turning over the rocks in Reid’s landscape of insider deals.\nOne of the 230 foreign investors who obtained a visa in return for investing in the SLS Hotel and Casino of Las Vegas, the company represented by Rory Reid, was linked to child pornography in China. Two others, ABC reported, had knowingly submitted false documentation to the DHS as part of their visa application process.\nAccording to the DHS Inspector General’s report, Reid pressured DHS official Alejandro Mayorkas, (then the head of the department’s United States Citizenship and Immigration Services agency, now Deputy Secretary at DHS) to expedite these questionable visa applications and rush them through without the normal rigorous review.\nGiven the improper level of scrutiny given these three foreign investors in the casino deal by DHS, it is unclear if the remaining 227 foreign investors in this casino deal are equally suspect.\nMore ominously, this lack of scrutiny may have allowed foreign investors who pose a national security threat to the country to obtain visas and a path to citizenship.\nReid’s retirement announcement was a sudden and dramatic reversal of even his most recent statements about his plans.\nTo hear Reid tell it, he was planning to stay in the Senate for many years to come. As recently as two months ago, Reid emphatically declared he was running in 2016.\n“We have quite an operation in Nevada that hasn’t lost a step, and we’re off and running. At this stage, I’m fully intending to run,” he told the New York Times on January 22.\nReid’s response to the DHS report has been to double-down with impunity in defense of his potentially criminal conduct.\n“If it had it to do over again, I’d try even harder,” he told a Nevada public radio station on Friday about his role in pressuring the DHS to expedite the E5-5 visas for the Las Vegas casino his son represented.\nReid went even further and besmirched the integrity of the Inspector General of the DHS, the author of the report.\n“The Homeland Security report came from a bunch of whiners at the Department of Homeland Security,” he asserted brazenly.\n(You can hear the full interview at the 13:04 mark here.)\nWith Barack Obama serving in the White House and Eric Holder as Attorney General, Harry Reid can get away with flaunting the law and attacking the integrity of the “whiner” Inspector General at DHS whose report documents how Reid abused his political power to benefit his political allies and family.\nBut if a Republican is elected President in 2016, there will be a new sheriff in town. Harry Reid knows the posse assembled by this newly appointed Attorney General is unlikely to consider Reid’s critics at DHS to be “whiners.” In fact, they are likely to be part of the posse.","url":"https://www.breitbart.com/politics/2015/03/28/the-real-reason-harry-reid-is-retiring/"}
