{"authors":["Ben Carlson","A Wealth Of Common Sense"],"date_download":"2018-10-31 00:31:44","date_modify":"2018-10-31 00:31:44","date_publish":"2018-07-09 00:00:00","description":"Some money managers are huge success, some huge failures, and others are just interesting.  David Einhorn's performance has been struggling as of late.","filename":"data/vaneerConsumption/Thereareonly4storieswrittenaboutfundmanagers.json","image_url":"https://amp.businessinsider.com/images/5b43849f64444521008b496e-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_there-are-only-4-stories-written-about-fund-managers-2018-7_1540945904.html","title":"There are only 4 stories written about fund managers","title_page":"    There are only 4 stories written about fund managers - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters/ Lucas Jackson\nThere are really only four different stories that are written about fund managers:\nThe huge success story The huge fund failure The redemption story The can't-figure-out-what's-wrong story\nJohn Paulson was the huge success story coming out of the financial crisis. Fund failures seem to occur on a regular basis, especially in the hedge fund community (which is strange because these failed funds were obviously not hedging anything). There's a comeback story about Bill Miller written every 18 months or so because his performance is so erratic from his concentrated bets.\nThis week brought us another round of the can't-figure-out-what's-wrong story starring hedge fund manager David Einhorn. The Wall Street Journal did a long profile on the performance struggles Greenlight Capital has experienced filled with commentary from current investors, asset allocators, and industry experts. There were even some PR-scrubbed comments from Einhorn himself.\nI shared some thoughts on Einhorn's struggles with Institutional Investor in May:\nBut Einhorn's shorts on Amazon and Netflix — part of what he calls his \"bubble basket\" of some 20 to 40 stocks — are head-scratchers to those who think those companies are growth machines that are here to stay. \"Obviously when we do have a market turn, you'd think those highfliers will get dinged,\" says Ben Carlson, director of institutional asset management at Ritholtz Wealth Management. \"But they've had such a huge gain, they'd have to have enormous losses for him to break even.\"\nAs long ago as 2012, Ritholtz Wealth Management's Carlson says he noticed an Einhorn tell when the manager penned an article for the Huffington Post called \"The Fed's Jelly Donut Policy.\" In it, Einhorn took issue with the Fed's easy-money policy, comparing it to sugar addiction. He had already been stocking up on gold — which other value investors like Warren Buffett eschew because it's an asset that doesn't produce anything. (Einhorn has a locker in Queens to hold physical gold and has offered investors a gold-denominated share class.)\nCarlson says this \"style drift\" was common among hedge fund managers he surveyed while doing due diligence in his previous job as an institutional financial adviser to nonprofits and foundations. The managers were bottom-up stock pickers precrisis, but their 2008 losses amid the financial meltdown turned their worldview upside down, leading them to a macro analysis that for years has been wrongheaded.\nI don't have much more illuminating to say about Einhorn's plight. He could definitely be setting himself up for a comeback story if tech stocks ever take a huge dive. Or maybe he's lost the magic touch. I really don't know, which is one of the reasons it's so difficult to make decisions on discretionary managers like this who aren't transparent with their investors.\nBecause of this, asset allocators come up with fancy due diligence methods and tracking tools to monitor performance and process (but mostly performance). Then there are the not-so-fancy forms of monitoring like this guy mentioned in the WSJ piece:\n\"The liquidity terms are onerous and out of the norm today,\" Mr. Pearlstone said. \"Investors would be more comfortable with those terms if the returns were better.\"\nAdding to distress among some investors is Mr. Einhorn's pending divorce. \"If someone goes through a divorce, I usually get out,\" said Mr. Kielland, Mr. Einhorn's early backer. \"I made an exception with David, but I made a mistake…He has to be distracted: I'm convinced that's 30% to 40% of\" why Greenlight has been underperforming.\nThis seems rather unscientific to me. I'm guessing if Einhorn's performance was going gangbusters you wouldn't hear his investors mention his personal life. Citadel's Ken Griffin went through a rather public divorce a few years back but his performance hasn't suffered like Einhorn's. So no one really mentions it when handicapping his hedge fund.\nThis is why rules of thumb for money managers can sound so intelligent but turn out to be more or less useless depending on the situation.\nDuring my endowment investing days I recall a number of unorthodox due diligence practices.\nOne fund said they monitored a national golf handicapping database. If a hedge fund manager golfed more than a certain number of days a year, they wouldn't invest because that meant they didn't care enough about the fund (although most investors would probably be better off paying less attention to their portfolio, making a few investments, and going to the golf course, but I digress…)\nAnother endowment fund used private detectives to perform background checks. I even heard one story where they went through a famous hedge fund manager's trash. Not sure what they were looking for but this seemed a tad excessive to me.\nSome simpler methods involve multiple site visits, massive questionnaires, and checklists for things like manager tenure, track records, portfolio characteristics, and risk profiles.\nWhen it comes down to it, most of these decisions are made based on performance, whether the decision-makers implicitly understand it or not. Einhorn's fund will likely continue to see outflows until his performance improves.\nFor asset allocators that believe in his process that's the exact opposite of what they should be doing. If you have a manager performing poorly that you think has just hit a rough patch you should be rebalancing into the pain.\nThe reason more investors aren't doing that is that (a) many institutional investors simply chase performance and (b) no one really knows if Einhorn's best days are behind him or not. I've been involved in these decisions in the past and there are never any easy answers.\nThere are so many variables involved when assessing the process, performance, portfolio, and people when investing with well-known discretionary money managers that I'm surprised more institutions haven't completely given up and gone more rules-based and systematic.\nQuant and index funds aren't as sexy as a star fund manager, but at least you'll never have to hire Magnum P.I. to dig through their garbage or worry about the headline risk from their personal lives.","url":"https://www.businessinsider.com/there-are-only-4-stories-written-about-fund-managers-2018-7"}
