{"authors":[],"date_download":"2018-10-22 23:38:36","date_modify":"2018-10-22 23:38:36","date_publish":"2016-01-11 06:41:28","description":"Epic survival thriller \"The Revenant\" and space blockbuster \"The Martian\" won big at the Golden Globes, boosting their chances for Oscars glory next month. \"...","filename":"data/vaneerConsumption/TheRevenantTheMartianwinbigatGoldenGlobes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z5qc-56CX32zFKLb7123928b84cb5ad06-478_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393275_Matt-Damon-wins-Globe-best-actor-comedy-The-Martian_1540251516.html","title":"'The Revenant,' 'The Martian' win big at Golden Globes","title_page":"'The Revenant,' 'The Martian' win big at Golden Globes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'The Revenant,' 'The Martian' win big at Golden Globes\nEpic survival thriller \"The Revenant\" and space blockbuster \"The Martian\" won big at the Golden Globes, boosting their chances for Oscars glory next month.\n\"The Revenant\" -- the story of 19th century fur trapper Hugh Glass, played by Leonardo DiCaprio -- won three top awards at the star-studded gala on Sunday, for best drama, best actor (DiCaprio) and best director (Alejandro Gonzalez Inarritu).\n\"The Martian,\" the tale of an astronaut stranded alone on Mars, won two top prizes -- best comedy film and best actor in a comedy for actor Matt Damon.\n'The Revenant' director Alejandro Gonzalez Inarritu (L) and leading actor Leonardo DiCaprio pose with their awards during the 73nd annual Golden Globe Awards, at the Beverly Hilton Hotel in Beverly Hills, California, on January 10, 2016 ©Frederic J Brown (AFP)\nThe two films -- split in separate categories by Globes organizers, meaning they were not competing against each other -- are now in prime position as Hollywood's annual awards season heats up ahead of the Oscars on February 28.\n\"I cannot say how surprised I am and how proud I am to have survived this movie,\" Inarritu said, referring to the harsh conditions in which the movie was filmed, mainly in Canada and Argentina.\nInarritu's movie \"Birdman\" won four Oscars last year including for best picture and best director, and many critics believe the Mexican director could emerge triumphant again this year.\nDiCaprio, who got a standing ovation from his Hollywood peers at the first major awards show of the year, said he wanted to share the award with indigenous communities around the world.\n\"It is time that we recognize your history and that we protect your indigenous lands from corporate interests and from people that are out there to exploit them,\" said DiCaprio.\nCritics believe the 41-year-old actor may finally win his first Oscar for the movie. He went all out for the role, even eating raw bison liver for a scene.\nA-listers Kate Winslet and Sylvester Stallone also took home acting prizes at the ceremony held in Beverly Hills, which is seen as a good indicator of which movies and actors will fight for Oscars glory.\nWinslet won for best supporting actress in a film for her role in the biopic \"Steve Jobs\", and Stallone won for best supporting actor in \"Creed,\" in which he reprised his iconic role of boxer Rocky Balboa.\n\"Spotlight,\" an early Globes favorite about journalists from The Boston Globe who uncovered sexual abuse in the Catholic Church, went home empty-handed despite three nominations.\nAlso snubbed was \"The Big Short,\" based on a book about the financial crisis of 2007-2008.\n- Sharp humor -\nHosting the glittering gala considered Hollywood's biggest party of the year was British comedian Ricky Gervais, who dished out his trademark raunchy humor, targeting Caitlyn Jenner, Mel Gibson and Sean Penn, among many others.\n\"Shut up, you disgusting, pill-popping deviant scum!\" he said by way of greeting the champagne-guzzling crowd at the event organized by the Hollywood Foreign Press Association.\nHe also poked fun at Bill Cosby, saying he would rather spend an evening in a hotel room with Gibson -- the target of his hosting gags in the past -- than with the disgraced US comedian accused of sexual assault by some 50 women.\nIn the United States, the event was broadcast with a delay of a few seconds to bleep out Gervais's dirtiest jokes -- and other on-air obscenities -- for a primetime audience.\nOther films that vied for the best drama prize -- and should figure in the Oscars conversation -- were 1950s lesbian romance \"Carol,\" harrowing kidnap tale \"Room,\" and the summer action blockbuster \"Mad Max: Fury Road.\"\nBrie Larson won the Globe for best actress in a drama for her portrayal of a young mother held captive with her child in \"Room,\" besting \"Carol\" co-stars Cate Blanchett and Rooney Mara.\nIn the best foreign movie category, Hungarian Holocaust drama \"Son of Saul\" was the winner.\nUnlike the Oscars, the Golden Globes also honors television shows.\n\"Mr Robot,\" about a computer programmer and vigilante hacker, took home the prize for best drama series. Amazon's comedy \"Mozart In The Jungle\" took the prize for best comedy series.\nJon Hamm won his second Golden Globe for best actor in a drama for his portrayal of womanizing advertising executive Don Draper in \"Mad Men,\" whose finale aired last year.\nAnd for best actress in the TV drama category, Taraji P. Henson won the Golden Globe for her role in \"Empire,\" which looks at the struggle inside the family behind a major hip-hop label.\nThe awards are decided by the Hollywood Foreign Press Association, made up of some 90 entertainment editors and writers from 55 countries who report on the industry year-round.\nMatt Damon has won the Golden Globe for best actor in a comedy or musical film for his role in \"The Martian\" ©Jason Merritt (Getty/AFP)\nBrie Larson poses with the award for Best Actress in A Motion Picture ¿ Drama, for her role in 'Room,' during the 73nd annual Golden Globe Awards, at the Beverly Hilton Hotel in Beverly Hills, California, on January 10, 2016 ©Frederic J Brown (AFP)\nSylvester Stallone walked away from the Golden Globes with best supporting actor in \"Creed,\" in which he reprised his iconic role of boxer Rocky Balboa ©Frederic J Brown (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3393275/Matt-Damon-wins-Globe-best-actor-comedy-The-Martian.html"}
