{"authors":["Victoria Friedman"],"date_download":"2018-10-30 18:30:54","date_modify":"2018-10-30 18:30:54","date_publish":"2018-07-18 09:59:15","description":"Relations between the Jewish community and the Labour Party have been brought to a new low since socialist Jeremy Corbyn became leader.","filename":"data/vaneerConsumption/TheRiseofAntiSemitisminLabour.json","image_url":"https://media.breitbart.com/media/2018/07/Corbyn.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_18__1540924254.html","title":"The Rise of Anti-Semitism in Labour","title_page":"Corbyn Is ‘an Anti-Semite’: The Rise of Anti-Semitism in Labour","title_rss":"NULL","source_domain":"breitbart.com","text":"The leftist ruling body of Britain’s Labour Party has voted not to adopt the international definition of anti-Semitism in its code of conduct, bringing relations between the Jewish community and the party to a new low since socialist Jeremy Corbyn became leader.\nLabour’s National Executive Committee defied pleas by senior Jewish leaders to reject a watered-down definition of anti-Semitism and backed the motion Tuesday afternoon with the support of Corbyn.\nJewish Labour MP Dame Margaret Hodge confronted Corbyn after the NEC ruling and called him “an antisemite and a racist” — comments she confirmed to Sky News.\n“You have proved you don’t want people like me in the party,” Dame Margaret said, with Corbyn reportedly responding: “I’m sorry you feel like that.”\nThe NEC stated it would support a further review in consultation with Jewish groups, but only after the backlash from the Jewish community which said Labour was failing to listen to them.\nThe code of conduct came about following protests and complaints from Jews and allies that the party was not dealing with accusations of anti-Semitism in an appropriate manner.\nThe definition takes much from the International Holocaust Remembrance Alliance’s (IHRA) working definition of anti-Semitism, but omits four key points related to Jewish identity and Israel — leaving wide open the ability to express hatred of Jews in the guise of criticism of the Jewish state.\nMP Joan Ryan, chairman of Labour Friends of Israel, said Tuesday night she was “appalled” by the NEC’s decision which she said “once again, undermines the claims of Labour’s leadership that it intends to tackle the problem of antisemitism” — particularly in light of Labour MPs voting overwhelmingly to reject the leadership’s position.\nLabour — once headed by Jewish heritage Ed Miliband — has been embroiled in anti-Semitism scandals, notably since the election of Corbyn as the party’s leader in September 2015.\nCorbyn’s “friends” from Hamas and Hezbollah\nAt a meeting hosted by the Stop the War coalition in 2009, Corbyn referred to Lebanese terror organisation Hezbollah and Palestinian terror group Hamas as “friends”.\nCalling Hezbollah “an organisation that is dedicated towards the good of the Palestinian people and bringing about long-term peace and social justice”, Corbyn said it was “really a big, big historical mistake” to designate it a terrorist organisation. The leftist defended his comments nearly a decade later and long after he had become leader of one of Britain’s major political parites.\nThe socialist MP for Islington North is also a “patron” of the Palestine Solidarity Campaign, attended numerous anti-Israel events, backed Holocaust denying pro-Palestinian activist Paul Eisen, and in some 100 other instances outlined by the Guido Fawkes political blog has sided with Islamist, as well as Irish Republican Army (IRA), terrorists.\n‘Red Ken’: Hitler “Collaborated” with Zionists\n“Red” Ken Livingstone, former London Mayor, was suspended from the Labour Party in 2017 after a disciplinary hearing found he had brought the party into disrepute over comments he had made about anti-Semitism, Hitler, and Zionism.\nHe was censured by the party for saying that Hitler at one point supported Zionism, and for defending the Labour MP Naz Shah over an anti-Semitic Facebook post she shared in 2016. Livingstone’s suspension was later extended for an indefinite period and he resigned in May 2018.\nThe far-left former mayor made the comments on BBC radio saying Adolf Hitler “was supporting Zionism before he went mad and ended up killing six million Jews” and then later doubled down on his position saying there was “real collaboration” between Nazis and Zionists before World War II.\nMP Naz Shah Calls for “Transportation” of Israelis out of the Middle East on Social Media\nIn 2016, Guido Fawkes uncovered that Shah had reposted a Facebook meme suggesting that the “problem” of Israel could be “solved” by the country’s “transportation” out of the Middle East and to the United States — in language echoing the mass transportation of Jews to European death camps during the Holocaust as part of Hitler’s “final solution”.\nThe Bradford MP had also used a Twitter post to urge supporters of Palestinians to vote in an online poll about Israeli military action, claiming “the Jews are rallying” to influence the result.\nShah was suspended in April 2017, yet in July 2018 was made a shadow women and equalities minister after her readmittance to the party.\nIt was also in the lower ranks of the party — local councillors and candidates — that Labour members were found to have made anti-Semitic comments.\nLuton Councillor Aysegul Gurbuz resigned from her seat and was suspended from the party in April 2016 after tweets emerged where she called Hitler the “greatest man in history”.\nAnd Nasreen Khan, a shortlisted Labour Party candidate for a Bradford council seat and former activist for anti-Israel George Galloway’s Respect Party, posted on Facebook: “It’s such a shame that the history teachers in our school never taught us this but they are the first to start brainwashing us and our children into thinking the bad guy was Hitler. What have the Jews done good in this world??”\nIn 2016, Breitbart London reported that the Labour Party had suspended 50 members for anti-Semitism. Senior party sources had identified a massive influx of hard-left activists during Corbyn’s leadership campaign as the reason for Labour’s compliance unit becoming swamped.\nAnti-Semitism on Campus — the Bastions of Socialism\nThe Oxford University Labour Club was embroiled in an anti-Semitism row following accusations in 2016 that anti-Semitism and support of Islamist terror amongst left-wing students was becoming routine.\nAlex Chalmers resigned as co-chairman of the group and criticised “senior members of the club [for] expressing their ‘solidarity’ with Hamas and explicitly defending their tactics of indiscriminately murdering civilians”, said the club’s Executive was prone to “throwing around the term ‘Zio’… with casual abandon”, and stated that “a large proportion of both OULC and the student left in Oxford more generally have some kind of problem with Jews”.\nThe Labour Party’s NEC was accused of a cover-up over its investigation of anti-Semitism at OULC by choosing only to publish the report’s recommendations rather than the full report which outlined that students within the OULC were engaging in anti-Semitism, often times, but not exclusively, dressed up as anti-Zionism.\nFormer Labour leader and centrist Ed Miliband was said to have been “deeply disturbed” that same year by “reports of anti-Semitism in the Oxford University Labour Club”, leading to the Jewish heritage Oxford alumnus to cancel a speaking appearance at the university.\n‘Whitewash’ for Peerage\nIn April 2016, Corbyn appointed human rights activist Shami Chakrabarti to investigate allegations of institutionalised anti-Semitism in the party — sparked by the suspension of Naz Shah.\nHowever, Chakrabarti revealed at a press conference in the following July that her investigation had concluded that “the Labour Party is not overrun by antisemitism, Islamophobia or other forms of racism”.\nDuring the press conference, Corbyn compared the Israeli government to Islamic State and a Jewish MP fled the conference room in tears after being accused by a far-left, Corbyn-supporting Momentum activist of conspiring with the right-wing press — another common anti-Semitic trope — sparking fresh accusations of institutionalised anti-Semitism.\nLess than a month later, Corbyn nominated Chakrabarti for a seat in the House of Lords — prompting accusations the human rights activist conducted a “whitewash” review in exchange for elevation to a peerage by Jewish groups including the Board of Deputies of British Jews and the Campaign Against Antisemitism.\nSubsequent polls revealed that British Jews are fleeing the Labour Party in droves, with the Antisemitism Barometer finding that four in five Jews believe that the party harbours anti-Semites in its ranks.","url":"https://www.breitbart.com/europe/2018/07/18/corbyn-anti-semite-racist-anti-semitism-scandals-labour-far-left/"}
