{"authors":["Tim Sculthorpe","Deputy Political Editor For Mailonline"],"date_download":"2018-10-23 01:54:12","date_modify":"2018-10-23 01:54:12","date_publish":"2017-04-26 12:34:12","description":"Theresa May has been backed as the best person to be Prime Minister by 61 per cent of voters, outscoring the highest recorded ratings of Margaret Thatcher and Tony Blair.","filename":"data/vaneerConsumption/TheresaMayoutscoresevenThatcherandBlairinnewpoll.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA0B6C200000578-0-image-a-60_1493222088808.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447374_May-outscores-Thatcher-Blair_1540259652.html","title":"Theresa May outscores even Thatcher and Blair in new poll","title_page":"Theresa May outscores even Thatcher and Blair in new poll | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Theresa May has been backed as the best person to be Prime Minister by 61 per cent of voters, outscoring the highest recorded ratings of Margaret Thatcher and Tony Blair.\nMr Blair secured a score of 52 per cent at his highest point and Mrs Thatcher managed 48 per cent in the Ipsos Mori survey.\nEach leaders was tested against their opponents of the day. While Mrs May has the highest personal score on the test, Mr Blair held a bigger lead over William Hague.\nThis poll shows Mrs May crushing her rival Jeremy Corbyn by 38 points after he was backed for No 10 by just 23 per cent of people.\nThe new poll, for today's Evening Standard, showed the Conservative Party was on 49 per cent and Labour 26 per cent.\nTheresa May has been backed as the best person to be Prime Minister by 61 per cent of voters, outscoring the highest recorded ratings of Margaret Thatcher and Tony Blair on the same question when they were leader. Each of them was measured against their main opponent of the day\nThe new poll, for today's Evening Standard, showed the Conservative Party was on 49 per cent and Labour 26 per cent\nThe huge 23-point lead from Ipsos Mori is in line with most other polls since Mrs May shocked Westminster by calling a snap election last week.\nGideon Skinner, head of political research at Ipsos MORI, said: 'The Conservatives' focus on leadership seems to be working for them – it was a key strength of theirs in 2015, and now their lead has increased even further.\n'Voters also say leadership is a more important issue.\n'The commitment of their supporters is also striking, compared with other parties.\n'This has all helped them to match their biggest lead we've ever recorded in an election campaign, back in 1983.'\nTwo other new polls have shown similar leads for the Tories ahead of the June 8 election.\nSenior Labour sources played down the state of the polls today, insisting politics was in a 'volatile' state and claiming Labour's position would improve when its was able to speak with its 'own voice'.\nThey said: 'We are confident that we can win this election once Labour's message is clearly heard.'\nThe poll shows Mrs May crushing her rival Jeremy Corbyn (both pictured today leaving home) by 38 points after he was backed for No 10 by just 23 per cent of people.\nA Panelbase survey had the Tories on 49 per cent - 10 points higher than the firms last survey in January - against Labour on 27 per cent, down four.\nA Kantar poll found a 22-point Tory lead, with the Conservatives on 46 per cent and Labour on 24 per cent.\nAs well as huge Tory leads, the polls suggest a cratering in support for Ukip which scores 8, 5 and 4 per cent in the new polls. The party secured almost 13 per cent of the vote in 2015.\nThe huge 23-point lead from Ipsos Mori is in line with most other polls since Mrs May shocked Westminster by calling a snap election last week\nAt a campaign rally in Bridgend yesterday, Mrs May warned Tory supporters against complacency in the face of the polls and said she needed every vote.\nShe said: 'Every vote I receive will help me secure the best deal to strengthen our economy.\n'Every vote I receive will be a vote to give me the mandate to deliver for Britain.\n'Ten months after voters across Wales helped to start this journey, Labour in Wales – and their partners in Plaid Cymru – remain determined to disrupt the result.'","url":"https://www.dailymail.co.uk/news/article-4447374/May-outscores-Thatcher-Blair.html"}
