{"authors":["Chris Arnold"],"date_download":"2018-10-23 05:45:31","date_modify":"2018-10-23 05:45:31","date_publish":"2016-08-11 00:00:00","description":"With rising home prices and low interest rates, Americans are spending a record amount of money fixing up their kitchens, bathrooms and man-caves. But a lack of skilled workers is limiting the boom.","filename":"data/vaneerConsumption/TheresAHomeRenovationBoomButGoodLuckFindingAContractor.json","image_url":"https://media.npr.org/assets/img/2016/08/10/ap_569940969629_wide-916577aece5a8d6be3a25de24840fe8318749567.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_08_11_489472679_theres-a-home-renovation-boom-but-good-luck-finding-a-contractor_1540273531.html","title":"There's A Home Renovation Boom, But Good Luck Finding A Contractor","title_page":"Economy And Housing: There's A Home Renovation Boom, But Good Luck Finding A Contractor : NPR","title_rss":"NULL","source_domain":"npr.org","text":"There's A Home Renovation Boom, But Good Luck Finding A Contractor\nEnlarge this image toggle caption Gerry Broome/AP Gerry Broome/AP\nWith rising home prices and low interest rates, Americans are spending a record amount of money fixing up their kitchens, bathrooms and man-caves. And business would be booming more but there aren't enough carpenters and tradespeople to do all the work.\nNathaniel May survived the housing crash, but just barely. He's a general contractor who does home renovations in the Boston area. As recently as four years ago, he and his partner were feeling a little desperate.\nEnlarge this image toggle caption Chris Arnold/NPR Chris Arnold/NPR\n\"We were both working out of the back of our truck doing handyman projects to pay the bills,\" May says. \"At that time I was renting a house and I worked out a deal with my landlord to re-shingle about 50 percent of the house in exchange for rent.\"\nMay says bartering for a place to live was some of the best work he could get at the time.\nToday, though, May is back in business in a big way. On a recent morning he stopped by a home where his company, Aurora Custom Builders, is finishing up a $140,000 kitchen renovation. The homeowner, Teri Larson, is beaming over her new stone backsplash and countertops. \"I think it looks spectacular,\" she says.\nLarson says after the housing crash she was feeling the pain in her own way. She didn't have enough equity in her house to get a loan to pay for a renovation. So for years her family was knocking into each other in a very tiny and badly designed kitchen with fake wood plastic countertops.\n\"It was horrible,\" she says. \"We had refrigerator doors banging into dishwasher doors and two people couldn't move around in here. It was hideous.\"\nExtreme makeover America: Millions fixing up their homes\nWith home prices and sales on the rise, millions of American are now fixing up their houses again. And actually, as big and overheated as the housing boom was at its peak, homeowners are now spending even more on renovations than they were back then. Though, experts say, these days, instead of frenzied condo flipping, the renovation boom is more sustainable.\ntoggle caption NPR/Remodeling Futures Program at the Joint Center for Housing Studies of Harvard University\nNino Sitchinava, an economist with the renovation and design company Houzz, says the home renovation market has rebounded to its pre-recession peak and is currently estimated at $324 billion.\nAnd she says that level of annual spending and demand is creating jobs and pushing up wages for carpenters, electricians and plumbers. Sitchinava says Houzz has about 1 million active home renovation professionals associated with it and many say they'd be hiring if they could find skilled workers.\n\"Four out of five of the remodelers on Houzz have reported that the labor shortages are either moderate or severe in their area,\" she says.\nNathaniel May, the general contractor in Boston, says he's got so much work he's turning down good projects, in part because he can't find any more good carpenters to hire.\n\"We get two to three requests to look at projects a week right now,\" he says. \"And most of them are good quality leads because they're coming from referrals.\"\nLoss of 2 million construction workers being felt now\nThe labor shortage isn't too surprising given how bad the housing bust was, says Abbe Will, an analyst with the Harvard Joint Center for Housing Studies who tracks home renovation activity. She says the construction industry lost 2 million workers after the crash.\n\"Those 2 million exited the industry. It's not that they're on the sidelines unemployed looking to get back in,\" she says. \"They either went to another industry altogether, retired [or] potentially went home to their native country. So we lost a ton of construction workers.\"\nAlso, Will says there aren't enough young people getting into the skilled trades, despite good-paying jobs. She says the industry is grappling with how to attract and train more young people and more women to the trades.\n\"Women make up such a small share of the construction industry\" — about 2 percent, she says.\nSeveral factors make tackling a home renovation project do-able for many people right now. In addition to rising home values, interest rates for home equity loans are low. And homeowners are feeling more confident about spending money.\nAll that's a good sign for the economy, Will says. But good luck finding a good contractor who's not too busy to take on your project.","url":"https://www.npr.org/2016/08/11/489472679/theres-a-home-renovation-boom-but-good-luck-finding-a-contractor"}
