{"authors":["Charlotte Owen"],"date_download":"2018-10-31 01:38:47","date_modify":"2018-10-31 01:38:47","date_publish":"2018-08-29 09:45:29","description":"Theresa May hasn't had the easiest summer, and as anyone just half aware of the political climate could tell you, things are about to get a whole lot trickier with Brexit negotiations looming. With a \"no deal\" Brexit looking like a more real…","filename":"data/vaneerConsumption/TheresaMayDancingInSouthAfricaHasTakenOverTwitter.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/28d99316-9003-478b-ba41-278c5a4300c5-getty-1005557172.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_theresa-may-dancing-in-south-africa-has-taken-over-twitter-10918824_1540949927.html","title":"Theresa May Dancing In South Africa Has Taken Over Twitter","title_page":"Theresa May Dancing In South Africa Has Taken Over Twitter","title_rss":"NULL","source_domain":"bustle.com","text":"Theresa May hasn't had the easiest summer, and as anyone just half aware of the political climate could tell you, things are about to get a whole lot trickier with Brexit negotiations looming. With a \"no deal\" Brexit looking like a more real possibility with every day, May took it upon herself to jet off to Africa for her first visit there as Prime Minister, as the BBC reports. While there, she pledged £4 billion investment in African economies, but unsurprisingly, it was Theresa May's dancing that generated more conversation across social media and beyond.\nWhile on her three day visit to the continent, during which May will also visit Nigeria and Kenya, the Prime Minister stopped in Cape Town, where she was greeted by several South African school children. So far, so ordinary. Alas, throw some music into the mix, and soon May was doing what the Guardian described as \"an impression of a wobbly fridge.\" If you are yet to see the footage, brace yourself, because it is, admittedly, rather awkward. Unsurprisingly, the internet wasn't content to simply watch the footage and comment. Instead, Twitter did what it enjoys most: it offered up commentary, remixes, and plenty of humour.\nMany decided a musical remix was required in order to better improve the footage.\nSome decided the Steptoe and Son theme song was the best replacement.\nUnsurprisingly, someone thought to do the whole Dancing Queen thing — which, in case you missed it, is reportedly Her Majesty The Queen's favourite track, according to NME. Yep, really.\nThen there were the memes.\nMay took the inevitable commentary that came along with her dancing in her stride, responding to a question about how her moves would measure up on Strictly Come Dancing with good humour.\nWhile it's easy to laugh at May's dancing — and hey, it seems even May is able to laugh at herself in this instance — as Bustle have previously reported, mocking her physical aptitude is actually a pretty unhelpful in the long run, even if you oppose her politics. As Aimée Grant Cumberbatch argued, all those jokes about her royal curtsy actually feed into the idea we need our politicians to be physically elegant in some way, and that \"social awkwardness has no place in politics.\"\nThere are many areas where it could definitely be argued that May doesn't measure up, but dancing isn't one where we need her to. Sure, there's sometimes joy to be found when politicians do it well — who wasn't moved watching Barack and Michelle Obama dance while Beyoncé sang \"At Last\" during his presidential inauguration ball — but it barely seems important when you look at the scale of our political problems.\nPlus, I can't help but think if this were Jacob Rees-Mogg or Boris Johnson filmed throwing shapes with school children in South Africa, Twitter would be lauding their individuality and their confidence to be seen doing something \"badly.\" They'd likely be called a maverick, their awkward manoeuvring a sign of their character and personality. Holding May to a different standard is sexist, which is something we shouldn't forget.","url":"https://www.bustle.com/p/theresa-may-dancing-in-south-africa-has-taken-over-twitter-10918824"}
