{"authors":[],"date_download":"2018-10-30 21:16:47","date_modify":"2018-10-30 21:16:47","date_publish":"2018-08-24 02:17:00","description":"The Rev. Jasper Williams Jr.","filename":"data/vaneerConsumption/TheRevJasperWilliamsseeksprayersashepreparestodeliverAreth.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/08/16/Videos/4462771.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_rev-jasper-williams-asks-for-prayers-pre__1540934207.html","title":"The Rev. Jasper Williams seeks prayers as he prepares to deliver Areth","title_page":"The Rev. Jasper Williams seeks prayers as he prepares to deliver Areth","title_rss":"NULL","source_domain":"ajc.com","text":"The Rev. Jasper Williams Jr. asked people to pray for him as he prepares to deliver the eulogy for Aretha Franklin next week.\nWilliams, pastor emeritus of Salem Bible Church, formerly Salem Baptist Church, was handpicked by Franklin and was informed of her request a few days before her death on Aug. 16 .\nFranklin died at age 76 from pancreatic cancer.\nHer funeral will be held at 10 a.m. Aug. 31 at Greater Grace Temple in Detriot. It will be a star-studded service with performances by Stevie Wonder, Faith Hill, Ronald Isley, Chaka Khan, Jennifer Hudson, and metro Atlanta-based Jennifer Holliday.\nWilliams, 75, said he’s asked gospel legend Dottie Peoples to join him at the service.\n“I felt highly honored,” Williams said. “I felt I wasn’t qualified. It was a very humbling situation for me. I’m hoping and praying that I will be able to rise to the occasion.”\nHe asked people to also pray “that God gives me the strength to do what needs to be done.”\nThe Franklin and Williams families go back decades. Franklin’s father, the Rev. C.L. Franklin, and Williams’ uncle were best friends in Memphis. Williams said he considered the influential pastor a mentor.\nFor several years, C.L. Franklin, a powerful religious and civil rights figure, enlisted Williams to preach during revivals at New Bethel Baptist Church in Detriot, where the elder Franklin served as pastor from 1946 until 1979.\n040827 Lithonia Ga: Rev. Jasper Williams Jr, Pastor of Salem Bible Church East is standing in front of the newly built church located on Hillandale Dr. Aug 27, 2004 (Renee' Hannans Henry/AJC Staff) (RENEE' HANNANS HENRY/AJC)\nWilliams also delivered the eulogy, entitled “Good Soldier,” for Aretha Franklin’s father on Aug. 4, 1984.\nWilliams said the last time he and Aretha Franklin talked was late last year. Franklin planned to come to Atlanta for a performance. She wanted him to join her on stage to sing a song, “One Lord, One Faith, One Baptism.” There was a problem with the promoter, however, and she didn’t come but promised the megachurch pastor that they would perform together somewhere else.\nHe called the legendary singer, musician and composer “a great spirit on the inside and a great giver.”\nHer support of the civil rights movement was well-known. She would give money for gas, pay bills, perform to raise money and once offered to bail out activist Angela Davis.\n“Her dad had nutured her and parented her in a lot of great ways,” said Williams, who is a gifted singer in his own right.\nHe said he wasn’t nervous but did feel “overwhelmed because of who she was and the stature that God privileged her to ascertain in her life,” he said. “She didn’t have to ask me. It’s overwhelming, really.”\nHe said he may break out in song, if the Spirit moves him.\nHis favorite song of hers was “Ain’t No Way,” he said, chuckling.\nHe has many fond memories of their time together.\nFranklin’s parents divorced when she was young and she didn’t know her mother that well. He said they used to have talks about her mother, Barbara Franklin.\n“My uncle told me many things about her,” Williams said. “She was always curious to talk to me about that. Her mother had a great voice. She was a gospel singer in her own right. She could also play the piano by ear like Aretha. I would tell her that much of her gift came from her mother. All the preachers’ wives were envious of her because she was so multi-talented.”","url":"https://www.ajc.com/lifestyles/rev-jasper-williams-asks-for-prayers-pre/VSylJi0kcVo3fS4HXIzs7J/"}
