{"authors":["Carolyn De Lorenzo"],"date_download":"2018-10-31 01:52:16","date_modify":"2018-10-31 01:52:16","date_publish":"2018-09-13 20:30:55","description":"Personality tests are fascinating. While many people take personality tests to assess suitability for particular jobs or workplaces, others (hello) may just take them for fun, to see what insights it might hold about your personality. But if you…","filename":"data/vaneerConsumption/TheRapidResponseMeasureBig5PersonalityTestIsSuperHardToTrick.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/864c1e11-68f2-458d-b514-2d31add7e988-zaeh_bustle_apr2016-107.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-rapid-response-measure-big-5-personality-test-is-super-hard-to-trick-11912091_1540950736.html","title":"The Rapid Response Measure Big 5 Personality Test Is Super Hard To Trick","title_page":"The Rapid Response Measure Big 5 Personality Test Is Super Hard To Trick","title_rss":"NULL","source_domain":"bustle.com","text":"Personality tests are fascinating. While many people take personality tests to assess suitability for particular jobs or workplaces, others (hello) may just take them for fun, to see what insights it might hold about your personality. But if you think you know yourself pretty well, you might be inclined to answer the questions according to what you *think* your personality type is — and that can have an adverse effect on your results. Now, psychology researchers at North Carolina State University have created a new personality test that's not only faster to take than existing tests, but is also harder to trick.\nLead researcher Adam Meade, a professor of psychology at North Carolina State, tells Bustle that the Rapid Response Measure Big Five Personality Test is \"a lot faster [and] more modern\" than previous personality tests. The Big Five model, which looks at agreeableness, conscientiousness, extraversion, openness, and neuroticism, was originally developed as a way for personality researchers to find common ground as to how personality traits get organized during testing. Since personality traits tend to exist along a continuum, and methods of personality testing can vary widely, the Big Five, “gives us a pretty good common framework that’s [...] broad enough to cover a lot of what we think of as personality without being too specific,” Meade says.\nSean Gallup/Getty Images News/Getty Images\nAccording to NC State News, the new personality test is an online program that uses a technique called rapid response measurement (RRM), which shows a series of personality descriptors one after the other in quick succession. Users have just a few seconds to click on whether the adjective is “like me” or “not like me.” Per NC State News, this intake process results in a more honest assessment of people’s personality traits, while also saving time. The test can be useful for research, and also for workplace training and hiring processes.\nCarl Court/Getty Images News/Getty Images\nPsychCentral reports that when Meade’s RRM-based Big Five personality test was studied against established Big Five tests, the new test showed comparable accuracy while also taking less time. (The paper published in Organizational Research Methods, looks at the results of four studies, involving a total of 425 subjects.) When researchers asked study participants to try and manipulate the outcome of the new test, they found that it was four times more difficult to skew the results of this test when compared to the standard Big Five workplace version.\nMeade further tells Bustle that the new personality test will be available for wider use soon. While he intends for it to be free for research purposes, different versions will also be sold to businesses and organizations for hiring and training purposes in the coming months. He also notes that while the commercial and free versions are a bit different in how they’re structured, “they’re both based on the same underlying methodology and philosophy.”\nWhile we all love a good personality test, the new method isn’t available to the public yet. But who knows — you just might encounter it during your next job interview or workplace training program. (And no, you probably won't be able to trick it.)","url":"https://www.bustle.com/p/the-rapid-response-measure-big-5-personality-test-is-super-hard-to-trick-11912091"}
