{"authors":["Sarkis Zeronian"],"date_download":"2018-10-30 18:41:22","date_modify":"2018-10-30 18:41:22","date_publish":"2015-08-10 17:35:38","description":"A newly book asks why double standards exist for people who identify as straight men or women experimenting with members of the same sex.","filename":"data/vaneerConsumption/TheReasonWhyStraightMenAreHavingSexWithEachOther.json","image_url":"https://media.breitbart.com/media/2015/06/men-kiss-behind-lgbt-rainbow-flag-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_08_10__1540924882.html","title":"The Reason Why Straight Men Are Having Sex With Each Other","title_page":"The Reason Why Straight Men Are Having Sex With Each Other - It's Not What You Think","title_rss":"NULL","source_domain":"breitbart.com","text":"A newly published book asks why double standards exist for people who identify as straight men or straight women experimenting with members of the same sex. Basically, when straight women hook up with each other no explanation is required; but when straight men do it, that’s a different story.\nDr Jane Ward, Associate Professor of Women’s Studies at the University of California, Riverside has written what may be the definitive (or perhaps the only) book on the subject – ‘Not Gay: Sex between Straight White Men‘.\nShe argues homosexual contact between men is a normal part of male experience – not a gay thing, a guy thing – albeit one society has felt the need to explain away ever since the concepts of homo- and heterosexuality were first defined.\nIn her interview with Science of Us, Ward points out that when straight women ‘dabble’ it is either frowned upon as attention-grabbing or excused as an exploration of the fluidity of female sexuality. She explains, perhaps scientifically:\n“If you look at this belief that women’s sexuality is more receptive – it’s more fluid, it’s triggered by external stimuli, that women have the capacity to be sort of aroused by anything and everything – it really just reinforces what we want to believe about women, which is that women are always sexually available people. “With men, on the other hand, the idea that they have this hardwired heterosexual impulse to spread their seed and that that’s relatively inflexible, also kind of reinforces the party line about heteronormativity and also frankly, patriarchy.”\nAnd there’s the first clue – ‘patriarchy‘. The reason why men having sex with men is frowned upon more than women having sex with women in the same circumstances is, says this Associate Professor of Women’s Studies, because of our social system in which males hold primary power.\nInevitably the explanation does not stop there. Dr Ward finds another explanation for society’s double standards. She argues:\n“…because white men have been understood as the idealised, most normal, sort of exemplars of normal human sexuality, there’s a lot of work and attention that goes into excusing anything they do or rationalising anything they do that might disrupt that view, and that’s not the case for women or for men of colour.”\nIt is for this reason she believes that hazing in college fraternities, sports teams, the military and even prisons shows that straight white men fool themselves into thinking gay activity is really proof of how straight they are. Or as Dr Ward puts it “straight white men can perform homosexual contact in heterosexual ways.”\nSo, in Ward’s perfect world, what would she want to see? She tells us:\n“…what I would like to see first is acknowledgement, more mainstream acknowledgement that everybody has homosexual sex. And when I say that I don’t mean that truly everybody does — there are some people who have no sex and of course there are some people who never have homosexual sex, but if we’re going to talk about who has homosexual sex, we often just think, well, only gay, lesbian, and bisexual-identified people have homosexual sex, but it turns out straight women have a lot of homosexual contact with other women, and so do straight men, and so that means that kind of everybody does, and so I think it would be helpful to just start with greater awareness that homosexual desire is just part of the human condition.”\nOne could be forgiven for thinking Dr Ward wants to turn the world gay, or at least bisexual, but to be fair to her that’s not the case. This social justice warrior merely wants to break down boundaries and normality for straight white men, perhaps as means to ending that awful ‘patriarchy’ we labour under.\nShe concludes in the interview that being straight or, as she puts it, ‘queer’, is very much a defined matter. Simply having homosexual sex does not get you membership of that club:\n“…if straight people want in on queer life, that’s about something more than homosexual sex. That’s about queer subculture, which is anchored to a long tradition of anti-normative political practices and anti-normative sex practices and appreciation for a much broader array of bodies and kinds of relationships and so forth, and so I think most straight people don’t actually want to be part of it. “I think straight people who engage in homosexual sex, what makes them straight is precisely that they have no interest whatsoever in being part of queer subculture, and so in the last chapter I’m making the point that they could if they wanted to, but they don’t, and that’s part of how we know that this is homosexual sex being enacted in the service of heteronormativity.”\nIf acceptance of “queer subculture” is the only way not to be straight in Dr Ward’s world, there are plenty of gay people out there who fail to meet her definition.","url":"https://www.breitbart.com/europe/2015/08/10/the-reason-why-straight-men-are-having-sex-with-each-other-its-not-what-you-think/"}
