{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:21:51","date_modify":"2018-10-22 23:21:51","date_publish":"2016-01-11 05:32:14","description":"Kenya Moore, 44, was left heartbroken on Sunday after making a final and failed attempt to connect with her biological mother in an emotion-packed episode of The Real Housewives Of Atlanta.","filename":"data/vaneerConsumption/TheRealHousewivesOfAtlantasKenyaMoorebreaksdown.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/04/3004DCD900000578-0-image-a-34_1452487041811.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393402_Kenya-Moore-breaks-estranged-mother-locks-door-refuses-Real-Housewives-Atlanta_1540250511.html","title":"The Real Housewives Of Atlanta's Kenya Moore breaks down","title_page":"The Real Housewives Of Atlanta's Kenya Moore breaks down | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kenya Moore was left heartbroken on Sunday after making a final and failed attempt to connect with her biological mother in an emotion-packed episode of The Real Housewives Of Atlanta.\nThe 44-year-old reality was reduced to tears as her mother - who gave her up at three days old to be raised by her paternal grandmother - refused to open the door to her as Moore jetted to Detroit for a family reunion.\nThe former Miss USA told the cameras she hoped to finally fix her 'dysfunctional' relationship with Patricia, who refuses to have anything to do with her famous daughter.\nGetting emotional: Kenya Moore broke down on Sunday's episode of The Real Housewives Of Atlanta after a failed attempt to connect with her estranged biological mother\nBut it came to nothing as she went to her mother's home with the cameras rolling only for her estranged mother to lock the door on her and refuse to see her.\nAfter flying to Detroit to catch up with family Kenya explained for the cameras that she had been given to her grandmother to raise at just three days old.\n'She has acted like I don't exist ever since,' she said sadly of her estranged mother.\nFamily reunion: The reality star made good on her pledge to organise a family reunionin Detroit\nKenya admitted she was anxious ahead of the family reunion but not about her mother as she did not even have a contact number for her.\n'I desperately want my mother in my life but my mother does not want me in her life and my aunt does not want to be put in the middle and the rest of my family wants me to leave my mother alone,' she said.\nKenya said despite her family's efforts to keep her away from her mother she was not flying back to Atlanta without making contact.\nBaby photo: Kenya was abandoned by her mother when she was three days old and raised by her paternal grandmother\nKenya's father, Ronald, and his family arrived from Texas to support Kenya even though she ran away from his home as a youngster.\n'So many years have gone by and been wasted where we could have been able to talk,' she told them.\n'We are never going to get that time back but we can make new memories.\nNew memories: The reality star was looking forward to making new memories with family and letting go of the past\n'I spent years not talking to my father and a lifetime not talking to my mother. So my dad and I have a relationship that is more in line with what I have always wanted,' Kenya said.\n'There is no reason I cannot have the same with my mother,' she added.\nHer father later explained that Kenya's mother had given her up in order to maintain her own relationship with her father.\nHistory lesson: Kenya's father Ronald explained that her mother gave her up to maintain her own relationship with her father\n'For me this is about getting my family together and whatever it is with Patricia (her mother) it is going to end this trip,' said Kenya.\nShe then got the bus driver to pull over at her mother's home.\n'I feel for the first time I have got the support I need and my family back together where I can let that go and whatever happens from here it won't be because of me reaching out,' Kenya said.\nMaking a stop: The reunion bus was stopped so Kenya could make an attempt to contact her estranged mother\nKenya surprised her family by pulling over in the reunion bus to confront her mother at home as they watched on.\nAfter repeatedly knocking on the door Kenya said her mother had locked it and refused to talk.\n'Sooner or later you have to stop,' her father said as he went to fetch her.\nThere she goes: Kenya got off the bus and knocked on her mother's door\nTime to go: Ronald fetched his daughter after her mother bolted the door and refused to answer\n'She is in there, there was no response, then I heard her say ''Don't answer the door.''\n'I am not surprised,' she told her family.\n'How do you justify that at 20, or 30, or 40, or 50, or 60?' Kenya asked her family.\nNo response: Kenya banged on the door only to hear the bolt locked and her mother say 'Don't answer the door'\nNot surprised: Kenya told her family members that she wasn't surprised that her mother ignored her\n'When I do become a mother I don't want to be the type of mother that she was to me,' said an emotional Kenya.\n'Whoever they are, good, bad or ugly, I want them to know that I see them. This is the last time I will extend myself,' she said.\nLater Kenya could not hold back the tears.\nLife lesson: The former Miss USA said when she does become a mother she won't treat her child the way her mother has treated her\n'Even though my mother does not respond, in some crazy way I feel blessed. Because if you can survive someone trying to destroy you, who would have been the first love of your life, then you can survive anything,' she said sadly.\n'My mother is clearly in my past now, but this is my family in my present and they are my future,' she added.\nDuring the reunion it became clear her aunt had left after just 10 minutes.\nCatching up: Kenya caught up with her grandmother at the family reunion\n'She knew how important this was to me,' said a disappointed Kenya.\nFamily friend, Lisa, said her aunt was upset at Kenya's visit to see her mother.\nNo one from her mother's side attended the reunion, which Kenya said had given her 'closure.'\nFamily affair: The reality star was glad that her father's side of the family showed up and stayed\nIn scenes from the next episode Kenya and her aunt were shown in a shouting match over Kenya's attempts to see her mother.\nThe show kicked off with pregnant Kandi Burruss, who has had her baby since filming, shopping for baby clothes with Mama Joyce.\n'The situation with my mother and everyone around me has changed for the better,' Kandi told the cameras.\nCrib shopping: Kandi Burruss and her mother Mama Joyce went crib shopping together\n'It is a huge stress relief that my mother is getting along with everyone now,' Kandi said.\nJoyce jumped in and told Kandi she knew best which crib the baby would need.\n'I think my mother probably sees some of the mistakes she made with Riley, as far as not having as close a relationship as she would want them to have. So I think she just wants to do things differently,' Kandi said.\nBaby on board: The pregnant reality star said her mother was being helpful after realizing past mistakes\nKandi then told her mother that she and Phaedra Parks were not as close as they had been and that Phaedra had been telling people it was because she still owed Todd money for production on her prenatal workout DVD.\nMama Joyce told Kandi not to stress over it and that she would talk to Phaedra to square things away.\n'Mama, no,' Kandi told her.\nNo stress: Mama Joyce was alarmed to hear that Kandi and Phaedra had a falling out\n'My mom has been doing real good and I don't feel like she needs to talk to Phaedra about anything as you never know with my mom she can go from zero to one hundred real quick,' Kandi told the cameras.\nMama Joyce then dropped by Phaedra's office unannounced to confront her over her failed relationship with Kandi.\n'Well I was wondering what happened between you and Kandi? 'Cause ya'll were always so close,' said Mama Joyce.\nOffice visit: Phaedra Parks welcomed Mama Joyce into her office for a candid conversation\n'I went through hell last year, and I just had so much going on. We just had a misunderstanding, and that happens in relationships. We're on the right track now,' responded Phaedra.\n'I'm definitely not getting ready to discuss the past with Mama Joyce, because she has been known to become heated in an argument,' Phaedra told the cameras.\nBut Mama Joyce said she was not looking to fight, she was just worried that Kandi's feelings towards Phaedra could impact her pregnancy.\nJust worried: Mama Joyce assured Phaedra that she wasn't looking for a fight but just worried about Kandi and her high-risk pregnancy\n'With this pregnancy, because it's kind of a high risk, I just don't want Kandi to get stressed out. I don't want Kandi to have any, any problems or to hurt her,' she told Phaedra.\n'I don't either,' replied Phaedra.\n'I would never want anyone to do anything to hurt her. To cause her to be upset in any way. Because you know mama bear. You know me,' said Mama Joyce.\nLittle worried: Phaedra admitted she was a little worried about Mama Joyce visiting her\n'Yeah well we gone keep her cool, calm and collected,' Phaedra told her.\nIt all ended with smiles as Phaedra agreed to organize a baby shower for Kandi, suggesting a Coming To Atlanta theme for the bash.\nPhaedra then stopped by to see Todd to revisit the workout DVD they shot together and they reviewed the footage.\nWorkout video: Todd and Phaedra watched the workout DVD they worked on together\nThe video did not look as she wanted it to and Phaedra said she would not be releasing it, but she wanted to pay Todd for his work.\n'I know Mama Joyce went to talk to Phaedra and if I get this check I may owe her a percentage as I know she made this happen,' said a surprised Todd.\nTodd and Phaedra then said they can move on from it.\nDebt settled: Todd was ecstatic upon learning that Phaedra was going to pay him the roughly $8,000 due for his work\nPorsha meanwhile got her sweat on as she worked out with her personal trainer DP.\n'He has helped me sculpt this cornbread ass,' she said in high praise as the pair went through a string of intense exercises.\nPorsha was then joined by her pregnant younger sister, Lauren, and the pair had a blunt talk about their working relationship.\nWorkout partner: Porsha took part in an unusual workout with her personal trainer DP\nIt did not take long for the shouting to start.\n'Since you have been pregnant I cannot really rely on you,' Porsha told her as Lauren asked her who else would run her business.\nLauren then snapped at her sister that she had to ride in coach on their business trips while Porsha sat at the front of the plane.\nPregnant sister: Lauren met up with her sister Porsha during her workout\n'Oh, you have resentment about riding coach?' Porsha scoffed.\n'You act as if I have not paid no dues to get where I am, and that the money to pay for this business has not been off of my back.\n'I always have to feel resentment off of you and I don't think that is fair,' Porsha huffed.\nAired it out: Porsha and Lauren soon got into a tiff about their working relationship\nLauren then told her sister that she did not care at all about her life unless it affected Porsha.\n'We just need to move forward and we will brush everything under the rug like we normally do and the business will take care of itself,' said Porsha.\nPorsha later brought flowers to her sister as they sat down to try and work out their work issues.\nFixing it: The reality star was determined to end the riff between her and Lauren\n'A few packages being missed is not that big an issue. The bigger issue is what has drawn a wedge between Lauren and I?' asked Porsha.\nPorsha told her she wanted to connect as a sister and asked her to share more of her life with her, saying she had been hurt that Lauren hid her pregnancy from her.\nHer sister admitted she had not been sure if Porsha would be happy for her.\nWedge talk: Porsha and Lauren had an honest conversation about their relationship\n'I am completely excited for you and your baby, I am not sure why you would think any other way,' Porsha told her indignantly.\n'I am living a good life everything is going pretty well,' Porsha said as she admitted she had been gaining weight.\nHer sister warned her she needed to think about children because of her collapsed marriage and her age.\nChildren talk: Lauren warned Porsha that she need to think about having children\n'You are not even in the position to think about babies, that is why I did not want to even bring it up,' Lauren told her.\nPosha then admitted to the cameras that her sister being pregnant was like someone else 'living your dream.'\n'I know my clock is ticking and I want a baby and I would trade everything around me that is going good for that family,' said Porsha.\nClock ticking: Porsha said she'd trade her career for a family\nCynthia and daughter Noelle helped her pack for a 'sexy' surprise trip with Peter.\nNoelle told her mother that she did not believe in second chances and Cynthia told her that as an adult you have to be ready to work on things when they turn bad.\n'I think it is important for Noelle to know that when you commit to a marriage that you should give it your all before you walk away,' she said.\nCloset conversation: Cynthia Bailey and her daughter Noelle went over clothing options for an unexpected trip with her husband Peter\n'That is where Peter and I are, we don't know what is going to happen but we want to give it all we have got.\n'If things between Peter and I are going to get better then we really need this time to reconnect, Cynthia said.\n'Alone. Completely alone,' she added.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393402/Kenya-Moore-breaks-estranged-mother-locks-door-refuses-Real-Housewives-Atlanta.html"}
