{"authors":["Natalie Corner For Mailonline"],"date_download":"2018-10-23 00:47:05","date_modify":"2018-10-23 00:47:05","date_publish":"2017-03-16 10:15:48","description":"The BBC drama's creator Joe Ahearne has spoken out after viewers flocked to Twitter to question how the main character knew where to find her kidnapped baby and bring down her nemesis.","filename":"data/vaneerConsumption/TheReplacementwriteranswersconfusedfansquestions.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E5351EB00000578-0-image-a-11_1489658905478.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4319330_The-Replacement-writer-answers-confused-fans-questions_1540255625.html","title":"The Replacement writer answers confused fans’ questions","title_page":"The Replacement writer answers confused fans’ questions | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The ambiguous ending of BBC's chilling drama The Replacement posed more questions than it answered.\nFans of the show flocked to Twitter to express their confusion following the dramatic finale on Tuesday night, which saw architect Ellen reunited with her kidnapped baby daughter and her 'evil' maternity cover Paula finally placed in handcuffs.\nViewers questioned how Ellen knew where to find her baby once she'd managed to escape from the car Paula had locked her in, and were desperate to know if the final scene - which showed Ellen's former boss David approaching her and her child - meant they had become a couple.\nThe show's creator Joe Ahearne has now attempted to clear up fans' confusion in the wake of the ending - and revealed that in early drafts Paula's daughter was the villain of the piece, not Vicky McClure's character.\nEllen (Morven Christie, left) was determined to bring down her nemesis Paula (Vicky McClure, right) and was proven right in the end but there was some loose ends\nWriter Joe Ahearne explained how Ellen knew where to find her baby daughter who had been kidnapped by Paula thanks to a 'hallucination'\nHe confirmed that Paula, played by Vicky McClure, did murder her boss Kay by deliberately pushing her off the roof, and said Ellen (played by Morven Christie) managed to guess where her daughter was thanks to a 'hallucination' brought on by the cocktail of sleeping pills her nemesis forced her to swallow.\nAnd he said the final scene, in which bereaved David, played by Dougray Scott, is seen approaching Ellen as she reads to her little girl, was intended only to imply there was 'hope' for their friendship.\nThough viewers weren't party to Paula's ultimate fate, the writer implied she would have been given 'professional help' for her problems.\nAhearne also told the Radio Times that the ending was set to have a completely different twist: 'In a very, very, very early version of the story, we flirted with Paula's daughter being the one who did the deed.\nHe said Paula's scheming behaviour would then be explained by her urge to protect her child.\n'But, the more we thought about it we thought, well, really the drama is between these two women, so it's really got to be Paula at the end because it's about the two of them,' he said.\nPaula turned up with the police and was handcuffed in front of Ellen, but it seems she handed herself in rather than them hunting her down\nAfter three weeks of trying to unpick the mystery surrounding the evil architect Paula, viewers finally learned in Tuesday night's finale that her daughter had been killed in a hit-and-run accident - and that Paula had been pretending she was still alive.\nProtagonist Ellen's discovery about Paula saw the villain throw herself down the stairs in an attempt to frame her nemesis for the 'assault'.\nBut following that Paula trapped Ellen in a car and forced her to take pills, and after passing out she miraculously escaped using a torch battery and the car air bag.\nAhearne explains that although Paula didn't tell Ellen where her daughter Leah was, Ellen was able to figure it out due to her drugged state.\n'In that hallucinatory experience she sort of has a very good guess and realises that’s where the child is, in the library, because Paula says things like, \"I’ll take her back there\" and gives a couple of unconscious clues about where the child is.'\nPaula is last seen being taken away in handcuffs but her ultimate fate was not made clear, though Ahearne has now implied she would have received 'professional help' to solve her issues.\nAhearne says Ellen doesn't need a man and as she refused her husband Ian's attempts at reconciliation there was implication she might end up with David (played by Dougray Scott, pictured in the background)\nAs for Paula, one question that loomed after she refused to take back her husband Ian (Richard Rankin), was whether she turned to David, her former business partner and her friend Kay's widow.\n'David sinned against her less. All I’m intending with that ending is to say that there could be hope for them as friends.'\nThe final scene also sent fans into a frenzy after eagle-eyed viewers claimed their were two babies in Ellen's arms as she sat beside the grave of her best friend, not one.\nSome claimed a second baby was visible in the arms of the central character, who was seen sitting next to the grave of her best pal Kay while reading a story to her daughter Lia - yet others have since disputed the claims, insisting it was in fact a teddy.\nUnfortunately for fans of the drama, it has already been confirmed that it will not be returning for a second series.\nThe Replacement is available to watch on BBC iPlayer","url":"https://www.dailymail.co.uk/femail/article-4319330/The-Replacement-writer-answers-confused-fans-questions.html"}
