{"authors":[],"date_download":"2018-10-30 01:25:30","date_modify":"2018-10-30 01:25:30","date_publish":"2016-10-06 17:48:01","description":null,"filename":"data/vaneerConsumption/TheRightofParentstoChooseTheirChildsEducation.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/10/6749689975_2393a32ba0_b.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862730.html","title":"The Right of Parents to Choose Their Child’s Education","title_page":"The Right of Parents to Choose Their Child’s EducationThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"There is a growing divide within the education reform movement between the so-called technocrats and free-marketeers, causing confusion with parents and grassroots activists and making reform much more difficult to achieve.\nFree-market reformers support creating a marketplace within which parents are empowered to hold schools and educators accountable. Technocrats don’t trust parents to make the correct decision. They believe only repeated testing and massive data collection is the answer to solving America’s various education-related deficiencies.\nWhile well-intentioned people exist on both sides of this debate, free markets offer a much better way to hold educational institutions accountable for their failures. Under this model, inadequate schools lose money or are forced to close after consistently failing to perform to the standards parents expect. The sort of government intervention supported by technocrats almost never results in true accountability, because special-interest groups, especially teachers unions, can heavily influence lawmakers.\nFor instance, parents in Arizona who are eligible to select a charter school for their child don’t wait on a government board to review and shut down a horrific, failing school. They don’t wait for several years of poor test scores. They simply choose another school or education option. When enough parents choose to leave a failing school, the school shuts down, just as any other failing institution would under the same circumstances.\nPrivate schools, charter schools, online schools, and other education options already close when they reach an unsustainable level. Not only is this a much more efficient way to run an education system; it’s also fair. Why should we reward terrible schools with an indefinite stream of tax dollars?\nThis model should be applied to traditional public schools. When a school no longer has enough students to sustain it—because parents can remove their kids and enroll them in other, more successful schools—it should be closed, but this can only happen if parents are empowered with open enrollment and the ability to choose the education option their child needs. Parents will gradually do what government bureaucrats can’t and won’t do: close schools, fixing and innovating the U.S. education system rapidly and without increasing government mandates.\nTechnocrats, in their desire for more tests and data collection, convince bureaucrats to mandate new data points to allow bureaucrats to decide the fate of schools and the children who attend them. But these tests and data end up serving only technocrats and government bureaucrats. It does not help parents, students, or teachers in America’s classrooms, because the release of data is often delayed for months after the school year ends, is reviewed by bureaucrats first, and when it is finally sent back to the schools, it often no longer paints an accurate picture of a student’s knowledge level and is typically aggregated to a point that essentially makes it useless.\nUnfortunately, many parents and grassroots activists who are rightly concerned about the push for more testing and data collection view these intrusions as part of the “school reform” movement, souring their view of all reforms, which unwittingly helps the technocrats gain more power and influence.\nFree-market education reform is the only solution to fixing the U.S. education system quickly and sustainably. Parents should be in charge of the education system. If they are, they will ultimately determine the direction it takes and will be able to better hold it accountable for its failings. The only way this can happen, however, is if parents choose not to shy away from education reform. Sitting on the sidelines is not a solution; it’s part of the problem. Real reform is possible, but it will never happen until parents demand they receive the power they deserve.\nLennie Jarratt (Ljarratt@heartland.org) is the project manager for education transformation at The Heartland Institute.","url":"https://spectator.org/the-right-for-parents-to-choose-their-childs-education/"}
