{"authors":[],"date_download":"2018-10-30 14:21:03","date_modify":"2018-10-30 14:21:03","date_publish":"2017-01-26 00:00:00","description":null,"filename":"data/vaneerConsumption/TherealsignificanceoftheExecutiveOrderonEnhancingPublicSafetyintheInterioroftheUnitedStates.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_01_the_real_significance_of_the_executive_order_on_enhancing_public_safety_in_the_interior_of_the_united_states__comments_1540909263.html","title":"The real significance of the ‘Executive Order on Enhancing Public Safety in the Interior of the United States’","title_page":"Blog: The real significance of the ‘Executive Order on Enhancing Public Safety in the Interior of the United States’","title_rss":"NULL","source_domain":"americanthinker.com","text":"The executive order titled \"Enhancing Public Safety in the Interior of the United States,\" establishes the Trump administration as truly formidable. If you haven't heard or read about it, you soon will. The order requires, among other things, the secretary of the Department of Homeland Security to publish a weekly list of crimes committed by undocumented aliens. There is an old adage: you should never pick a fight with anyone who buys his ink by the barrel. The corollary is that the U.S. government \"speaks\" with an authority that threatens even the independent media and their billions of barrels of ink. It is for this reason that scholars developed the doctrine of \"government speech,\" which acknowledges the risks posed by a government engaged in propaganda. That is why, for example, U.S. propaganda efforts like Voice of America are prohibited by law (the Smith-Mundt Act) from broadcasting in the U.S. Simply,... (Read Full Post)","url":"https://www.americanthinker.com/blog/2017/01/the_real_significance_of_the_executive_order_on_enhancing_public_safety_in_the_interior_of_the_united_states__comments.html"}
ce.\nThe Trump administration believes that many in the media actively conceal news about crimes committed by undocumented aliens, or conceal the status of the perpetrators. Now, in order to deluge what they contend is an ignorant public with evidence of an existential threat, the government will weekly generate and publish information and statistics supporting the administration's immigration narrative. Some in the media will refuse to publish the information, but there is little doubt that the information will reach the public. Of course, the megaphone of the U.S. government means that the information will likely have a profound impact. For those who believe that any status should be irrelevant in decision-making due to the possibility of latent prejudice, or who believe that reference to status only feeds prejudice and discrimination, the impact will be further evidence that the U.S. cannot, and this administration will not, seek a more tolerant and less discriminatory culture. Regardless, some of these may, if the statistics are compelling, be swayed to support government action to meet the threat. For others, the information will confirm their belief in the threat. There will be many, no doubt, who find the information illuminating and wonder why the threat was not sooner or more carefully identified. Of course, the Trump administration is banking on there being many who are illuminated or swayed to support government action. Regardless, the mere act of directing the government to develop the facts upon which to build a powerful narrative establishes the Trump administration as self-aware, proactive, and formidable. The prescience and power of this strategy rival similar acts by former president Obama and the very prolific Senator Warren, who were directly or indirectly responsible for publishing countless reports documenting the existence and dangers of income inequality and of a rogue Wall Street. These reports informed and motivated Progressives, anarchists, and anti-corruption conservatives alike, and supported movements like Occupy Wall Street and the Sanders insurgency. Most importantly, the effort signals clearly that the administration is not feckless, inexperienced, or helpless. It means the administration is intent and willing to change the narrative, and therefore the electorate. It means that the administration sees a long-term objective, and is not satisfied with simply taking immediate action, however confident Trump is in the action, over compelling and supporting lasting change. The Order represents governance at a very high level, a level many thought Trump incapable of reaching. It will, of course, please his supporters. It will only further disturb his opponents, though, including those in the Republican Party. After scratching their heads at just how badly they have repeatedly underestimated Trump, the order will send a shudder through the collective being of Trump opponents. Now there is, and can be, no corner of consolation that Trump's inexperience will render him ineffective. There can be no comfort that his political naïveté renders him toothless. The order means that the Trump administration is and can be dangerous. If Trump is the reform candidate he promised, it is now clear that his administration is capable of changing the way politics and governance are conducted, and perhaps changing these for a very long time.","url":"https://www.americanthinker.com/blog/2017/01/the_real_significance_of_the_executive_order_on_enhancing_public_safety_in_the_interior_of_the_united_states_.html"}
