{"authors":[],"date_download":"2018-10-30 18:39:41","date_modify":"2018-10-30 18:39:41","date_publish":"2016-09-08 15:59:00","description":"The hotel is considered an eyesore and has an interesting history.","filename":"data/vaneerConsumption/TherundowntoweratSpaghettiJunction.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/09/08/Images/photos.medleyphoto.11293259.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_actual-factual-d_4f7b1ea44de0ce90a92ae67023741402__1540924781.html","title":"The rundown tower at Spaghetti Junction","title_page":"Actual Factual DeKalb: The rundown tower at Spaghetti Junction","title_rss":"NULL","source_domain":"ajc.com","text":"OK, y’all. This might be a little awkward, but we’re going to get through it together. Let me explain: A few weeks back, I arrived at The AJC to cover DeKalb County. Boss says I should write this column called “Actual Factual DeKalb.”\nThe idea is you folks send questions and I run down the answers. Then I write the column, which you love and share with all your friends on Facebook, Twitter, Pinterest, etc. Or mail it to your Uncle Bill. He loves this kind of stuff and it would mean so much to hear from you. Anyhow, the problem of the first column is, I'm forced to ask myself a question, as my esteemed colleague Tyler Estep did in his Gwinnett column.\nHumor me.\nJoshua Sharpe writes: What’s with the weird rundown cylindrical tower at Spaghetti Junction?\nI’ve actually wondered the same thing, brother.\nI did a little digging and found out plenty. Particularly of interest is the once bumping club that operated on the ground floor.\nIt thrust a spotlight into the night sky, which I imagine as beaming a signal – no, a beacon of hope – to all the partiers stalled in I-285 traffic, dying to dance. Imagine them, say, in 2004, back in the heyday. Maybe 50 Cent’s “In Da Club” is playing on the Suburban stereo.\nBut we’ll come back to all that. Let’s take it from the top:\nThe iconic 15-story tower was built back in 1973 on Presidential Parkway.\nIt’s gone by various names, including Presidential Hotel. Mostly recently it was the skillfully-named Presidential Boutique Condotel.\nAs you could probably figure out, the owners turned the hotel into condos.\nCondo + hotel = condotel.\nWhat was the problem?\nApparently, it took more complicated math to run the building.\nIn 2012, co-owners Habib Osta and Vincent Lu couldn’t get together on the Georgia Power bill. It went unpaid and residents were driven from their homes – homes they had ownership in because of the “condo” part of the equation.\nHere came the vandals.\nRock + window = eyesore.\nSo what is the problem now?\nGarbage litters the parking lot. The pool is scary. Used tires are piled up. I saw a decorative candleholder resting on a discarded mattress and a lone can of Febreze air freshener. Odd.","url":"https://www.ajc.com/news/local/actual-factual-dekalb-what-with-the-rundown-tower-spaghetti-junction/AcHez2crIJZrBg9NXvywGL/"}
