{"authors":[],"date_download":"2018-10-30 01:02:57","date_modify":"2018-10-30 01:02:57","date_publish":"2018-07-20 00:00:00","description":null,"filename":"data/vaneerConsumption/TheRussianshackedmycomputerandTrumpisdoingnothing.json","image_url":"https://www.americanthinker.com/images/bucket/2018-07/208004.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2018_07_the_russians_hacked_my_computer_and_trump_is_doing_nothing_1540861377.html","title":"The Russians hacked my computer, and Trump is doing nothing","title_page":"The Russians hacked my computer, and Trump is doing nothing","title_rss":"NULL","source_domain":"americanthinker.com","text":"The Russians hacked my computer, and Trump is doing nothing\nSeveral weeks ago, Russians tried unsuccessfully to hack my computer, and Trump did nothing. When I went into my emails, there was an official-looking email from Microsoft telling me that my service was going to be canceled if I didn't click a link. The thing is, it wasn't a service I ever signed up for, and there was an identical email right after it. As a reasonably competent user of most things internet, I did not click open the emails and immediately sent them both into the email dust bin. This happens millions of times a day, yet Trump does nothing. Where is the government when you need it? Am I right?\nThis incident was probably the exact thing that Claire McCaskill's Senate office experienced, but instead of deleting the suspicious emails somebody in her office probably opened the email and clicked on the link. We know this because McCaskill admitted that the link took them to one of Vladimir Putin's personal – Donald Trump-approved – hacking operations. The problem is that once you click on the link, the phish is hooked, Comrade. She claimed in the interview that the Russians didn't get anything because the Senate's anti-virus software protected her computers, but I'm skeptical, because if it had been doing its job, it would have blocked the email or the subsequent attempt to connect to the nefarious website. The computer likely had to be scrubbed once it started acting funny. At that point, the computer nerds probably were able to trace it back to somewhere in Ukraine. Being the swamp creature that McCaskill is, she took this highly damaging screw-up in her Senate office, which her opponents could have used as yet another example of her incompetence, and turned it into another chance to blame Trump for letting his Kremlin bestie attack her election. This is a brilliant strategy by a candidate scrambling to find a lifeline for her drowning campaign. By putting whipped cream on manure, she is taking a page from Trump's playbook by getting millions of dollars of free airtime from all the lefty news and talk shows spending countless hours discussing how this is all Trump's fault and somehow proves his election collusion with Vladdy. The question is, can a Senate staffer falling for obvious phish bait turn around McCaskill's campaign? Not likely. This one smells like week-old phish. I predict that it's more likely to be her jump the shark moment. Or is it jump the phish?","url":"https://www.americanthinker.com/blog/2018/07/the_russians_hacked_my_computer_and_trump_is_doing_nothing.html"}
