{"authors":["Julie Cart","Dan Morain","Byrhonda Lyons"],"date_download":"2018-10-30 22:27:42","date_modify":"2018-10-30 22:27:42","date_publish":"2018-09-14 02:39:02","description":"The state wants 5 million clean vehicles on the road by 2030. There's a long way to go.","filename":"data/vaneerConsumption/TheroadtoCaliforniascovetedelectrichighwayiscongestedwillanewpacthelpcleartheway.json","image_url":"https://calmatters.org/wp-content/uploads/electric-car-e1536892356133.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938462.html","title":"The road to California's coveted electric highway is congested; will a new pact help clear the way?","title_page":"The road to California's coveted electric highway is congested; will a new pact help clear the way? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"California officials have made it no secret that for the state to adequately reduce its greenhouse gases, a wholesale change is needed in how we transport ourselves and the goods we consume. Namely, gas-powered cars, trucks and buses must be swapped for their zero-emission counterparts.\nThe road to California’s coveted electric highway—like traffic in the Golden State—is congested. How to clear the way was addressed in two discussions hosted by California Air Board Chairwoman Mary Nichols at the Global Climate Action Summit in San Francisco on Thursday.\nOfficials from around the world laid out their own plans to speed adoption of electric cars, mostly mirroring what California has already accomplished. And Nichols’ remarks highlighted the dramatic, but still lagging, increase in electric cars in a state that has set a goal of 5 million such vehicles on the road by 2030.\n“It took a long time to get to that first million,” she told a packed auditorium at the George Moscone Convention Center. “It took decades. Then to get from 1 to 2 million took about 17 months, and now we are adding another million electric cars every six months. I think it’s going to go faster than that.”\nNichols has acknowledged that squeezing emissions from transportation will be the most difficult lift of all the state’s near-term climate goals , saying the gains require no less than a “deep transformation.”\nShe announced that California this week joined an alliance of cities, countries and businesses that pledge to reduce fossil fuels in transportation. Called “a coalition of the willing,” the international group will advocate for accelerated electrification of transportation around the world.\nThat sector is California’s single largest producer of planet-warming carbon—about half of the total emissions.\nGov. Jerry Brown signed a clutch of legislation Thursday aimed at making clean vehicles more affordable to a broad range of Californians and shoring up the state’s charging infrastructure.\nPanelists told Nichols that their governments have made electric vehicles a high priority, too.\nLeanne Enoch, minister for environment and the Great Barrier Reef, in the Australian state of Queensland, said her state’s government aims to eventually transition all 10,000 vehicles in its fleet to electric.\nThat transition strategy is the first of its kind in Australia, Enoch said. The government has built one of the world’s longest “electric super highways ,” a 1,200-mile, coast-hugging road outfitted with charging stations.\nShe said officials anticipate that drivers will eventually be won over—if not for environmental reasons, then for savings in their “hip pocket….Electric vehicles will see a 60-90 percent decrease in costs.”\nPaul Wheelhouse, Scotland’s minister for energy, said his nation hopes to eliminate gas-powered cars by 2032. Although only 1.1% of Scotland’s vehicles are low in emissions, he said, the growth curve is steep, and the government offers low-cost financing. Officials envision a changed ownership system in which electric cars will be offered like cell phones—with usage plans: “You would buy miles or days of a car, or types of cars.”\nElectric vehicles must ultimately plug into something, and Nichols moderated a second panel, this one featuring two electric-utility executives. She dubbed their businesses “the oil companies of the future.”\nTom Fanning, chairman, president and CEO of Southern Company, an Atlanta-based utility that is the second-largest power company in the U.S., said his firm decided to increase its ability to provide power to what he sees as fleets of electric cars on the horizon.\n“It is clear to me as a matter of policy, and as good business for us—we should own the plug,” Fanning said, reflecting the excitement that many utilities have about a potentially enormous new market.\nRonald O. Nichols, president of Southern California Edison, said the governor’s goal of 5 million clean vehicles wouldn’t be enough to bring about the transformation the state needs.\nHe put the number at 7 million in 12 years, including some 2.5 million in the utility’s Southern California service territory. He also noted that the company has made a commitment to install 50,000 charging stations in the region.\nMary Nichols ended the session with an exhortation: “Take this stuff seriously, and be more ambitious than you thought was possible.”","url":"https://calmatters.org/articles/california-electric-highway-new-pact/"}
