{"authors":["John Hayward"],"date_download":"2018-10-30 18:15:34","date_modify":"2018-10-30 18:15:34","date_publish":"2015-04-27 19:27:13","description":"The practical and spiritual benefits of work and independence are undervalued in America today. It is better for the economy, and for the heart and soul of the individual, to work for $8 an hour than to be paid $12 an hour by the government to do nothing. |","filename":"data/vaneerConsumption/TheScienceIsSettledWelfareDiscouragesWork.json","image_url":"https://media.breitbart.com/media/2015/01/job-fair-sign-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_27__1540923334.html","title":"The Science Is Settled: Welfare Discourages Work","title_page":"The Science Is Settled: Welfare Discourages Work | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Obama era has given us a very expensive lesson in how employment has a strong demand component. Unemployment rises not just because the supply of jobs has diminished, but because people aren’t looking for work as aggressively as they might be.\nThat seems like a common-sense observation, but it has huge public policy implications. It’s an article of faith on the Left that welfare and redistribution programs have no significant negative impact on the workforce. Nearly everyone wants to work, we are told; the only reason they can’t get jobs is that greedy fat cat capitalists tuck their filthy money into treasure vaults instead of using it to hire people. The notion that welfare might make poverty worse, by providing incentives to remain poor and dependent instead of working, is anathema to our titanic social welfare state.\nOne of the many arguments born from this belief, which we heard quite a bit of during the recent observation of the Great Society’s 50th anniversary, is that compassionate government’s core mission is to make poverty more comfortable, rather than seeing to reduce it. This was offered as the counter-argument to charges that the Great Society was a failure because poverty is at least as widespread as ever, despite trillions spent in a “war” against it. Evidence that generous welfare benefits increase dependency and erode the workforce is extremely damaging to arguments that poverty is essentially a constant, and the best we can do is try to make it more bearable.\nWhen considering a population of millions, social policy can’t be evaluated based on anecdotes or heartfelt ideological beliefs. Of course there are people on welfare, and trapped in the grim “working poor” twilight of employed dependency, who would very much like the opportunity to work hard and earn better lives for themselves. An economy shifting toward part-time work, to avoid hefty mandated costs on full-time jobs, offers fewer such opportunities; so does an economy slogging through a low-growth “recovery” that stretches on for years.\nConversely, we all know there are people who prefer living on the dole to having a job. Food Stamp Nation offers stories of both outrageous abuse, and people who really need help getting the help they need. Even most hardcore welfare-state liberals would be reluctant to deny that any such people exist. The question is, are there enough potential workers choosing welfare over work to make a real, statistically significant difference… and, if so, isn’t it both immoral and counter-productive to tax working Americans to maintain such a welfare state?\nDan Mitchell of the Cato Institute wrote on Monday of a new study from the National Bureau of Economic Research that offers “interesting findings on the link between redistribution programs and labor supply.” With due acknowledgement of the difficulty inherent in measuring the precise effects of any given social program – there are so many of them, the population of the United States is huge, and countless other factors influence national employment – the study found a highly significant correlation between welfare and the desire to work.\n“The mid-1990s welfare reform apparently helped labor supply by pushing recipients to get a job,” Mitchell writes. “Disability programs, by contrast, strongly discourage productive behavior, while wage subsidies such as the earned-income credit ostensibly encourage work but also can discourage workforce participation for secondary earners in a household.”\nAnother interesting observation from the report concerned the Earned Income Tax Credit, which is supposed to provide incentives to work for the lowest income brackets by relieving them of tax burdens for their meager income. Instead, the report found that “EITC explains 71 percent of the decline in low-educated married mothers’ desire to work between 1988-1993 and 1994-2010.” The authors theorize this happened because EITC “raised family income and reduced secondary earners’ (typically women) incentives to work.”\nOverall, the report found that “changes in the provision of welfare and social insurance explain about 60 percent of the decline in desire to work among prime-age females.”\nMitchell reviews some other studies and analyses confirming that people who receive welfare benefits – including the new ObamaCare subsidies that turned a huge swath of the “middle class” into government dependents – are very conscious of losing those benefits due to means-tested phase-outs. Some of these scaled benefits provide very obvious incentives against working more hours, or pursuing a higher salary – who wants to work harder for a net loss in disposable income? We should also carefully study the less blatantly obvious disincentives to work. How many people will work a lot harder, to earn a very small net gain in disposable income? Why trade reliable government benefits for enhanced income from a job that might go away in the near future, for a variety of reasons?\nAnd why should working Americans be forced to pay for a high-overhead, much-abused welfare system that reduces our overall national productivity, even if it could be administered efficiently and honestly? The practical and spiritual benefits of work and independence are undervalued in America today. It is better for the economy, and for the heart and soul of the individual, to work for $8 an hour than to be paid $12 an hour by the government to do nothing.\nWe should be more honest about the difficulty of persuading people on that $12 dole to give it up and work for $8. They are not irrational to find that bargain unappealing, especially when a private-sector economy groaning under the titanic burden of government has a hard time producing good employment opportunities for marginal workers.\nOur welfare system and economic policies are working very well, if you assumed the entire system was designed to fail. We are very far from the desirable practical and moral equilibrium of a system that places the lightest, fairest, most evenly-distributed burden of government possible upon the shoulders of a prosperous economy in which the greatest number of citizens are looking for work, and finding it. That is what we all want, isn’t it?","url":"https://www.breitbart.com/politics/2015/04/27/the-science-is-settled-welfare-discourages-work/"}
