{"authors":["Judith Gelernter Reisman","Mary E. Mcalister"],"date_download":"2018-10-30 21:31:36","date_modify":"2018-10-30 21:31:36","date_publish":"2016-01-01 13:00:16","description":"CNN’s The Hunting Ground has won critical acclaim from filmmakers, winning the Stanley Kramer award from the Producers Guild of America while garnering criticism from Ivy League elites who worry that their reputations are being sullied by the depiction of a “rape culture” on their campuses (Harvard Crimson).","filename":"data/vaneerConsumption/TheSexualRevolutionGaveUstheRapeCulture.json","image_url":"https://media.breitbart.com/media/2015/12/Porn-watching-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_01__1540935096.html","title":"'The Sexual Revolution' Gave Us 'the Rape Culture'","title_page":"'The Sexual Revolution' Gave Us 'the Rape Culture' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"CNN’s The Hunting Ground has won critical acclaim from filmmakers, winning the Stanley Kramer award from the Producers Guild of America while garnering criticism from Ivy League elites who worry that their reputations are being sullied by the depiction of a “rape culture” on their campuses ( Harvard Crimson ). That, in turn, has prompted a response from students in the form of a discrimination complaint under the Federal anti-discrimination law known as Title IX\nThe attention that The Hunting Ground has attracted raises the question, “has it always been so on college campuses?” Even radical sexologists such as Prof. Ira Reiss have to admit that it has not. Reiss reports that unmarried WWII 18-22 year-old Army lads were largely “still virgins.” Even Hugh Hefner was a college virgin at age 22. Dutch “sexperts” Drs. Kronhausens’ 1960 survey revealed, “The average modern college man is apt to say that he considers intercourse “too precious” to have with anyone except the girl he expects to marry and may actually abstain from all intercourse for that reason.” (p. 219). However, by the 1970s youth were generally sexually radicalized–once normalized, most thought unwed sex was “natural.”\nHow did this transformation occur? A brief chronology shows the historical context:\n1950: “Age Disparity (Relations Involving One Adult) …. [P]ersons under the age of 7 are legally regarded as not responsible….but many are by endowment and training fully capable of….responsibility for sexual behavior.”\nManfried Guttmacher, Group for the Advancement of Psychiatry (GAP).\n1953: “The cultural tendency to overprotect women and children [is] often…more detrimental to the…victim than the offense itself….Kinsey’s findings…permeate all present thinking on this subject.” The Illinois Commission on Sex Offenders\n1955: “Despite the indication that 12 is…the onset of puberty….it is known that significant numbers of girls enter the period of sexual awakening as early as the tenth year.” Group for the Advancement of Psychiatry; the ALI, Model Penal Code\n1983: “[T]he older term “rape” was fraught with negative emotion and [is] unrealistic for this era. . . . [T]he female is [not] … harmed in some unique way by untoward sexual behavior.” C. Nemeth, How New Jersey Prosecutors View the New Sexual Offense Statutes; N.J. Law Journal.\nFast forward from a Hugh Hefner as a 22 year old virgin to today, where high-profile college and professional athletes like Tim Tebow and Russell Wilson are ridiculed for announcing they will abstain from sex until they are married. Does this contempt for virginity reflect somehow a kind of “sexual exploitation pedagogy” of esteemed professors and administrators? And how have these prestigious graduates of a sexploitive pedagogy affected society? Have elitist sex abuse fantasies evolved into ideology, seeping into leading minds of the legal, political, educational, legislative, religious, scientific, medical, justice, law enforcement, entertainment, etc. worlds? And is pornography in university offices and dorms seeding its widespread sexual ideology?\nStatistics tell the story. Roughly 80% of college men and 34% of co-eds use porn on campus or off, sanctioned by “free speech” Harvard professors and administrators—that’s campus sex culture! And, ominously, Data4Justice documents many “professors and staff…arrested for trading in brutal child sex abuse, including of infants.”\nFrom University of Virginia’s Assistant Dean, Michael Morris downloading infant anal rape to Kirk Nesset, creative writing professor at Allegheny College with over 500,000 videos/images including” rape of infants. Professors and staff are involved in child sex trafficking….Since 2015 August, at least two professors per week have been arrested, arraigned or sentenced.”\nMoreover, FBI’s Joseph Campbell says “the level of pedophilia is unprecedented right now.” A “survey of high school graduates” found 13.5% had sex with a teacher. If some administrators and professors are viewing child rape on campus computers does this become an intellectualization of a “rape culture”? A 2014 op-ed by Yale Professor Jed Rubenfeld, drew heated objections from Yale Law Students. He reminds our largely historically ignorant populace of the fallout following the nostalgic 1969 “Woodstock” “sexual revolution”.\nIt’s part of the revolution in sexual attitudes and college sex codes that has taken place over the last 50 years. Not long ago, nonmarital sex on college campuses was flatly suppressed. Sex could be punished with suspension or expulsion….Rape was a matter for the police, not the university. Beginning in the late 1960s however, sex on campus increasingly came to be permitted….The problem then became how to define consent. [Emphasis added]\nSo almost three generations ago, youth were lied to (read Dr. Reisman’s books for details) and persuaded that the WWII generation were closet sexual adventurers. This belief in their parental hypocrisy (see, The Graduate, 1967) helped youth reject the American legacy of sex restrictions in exchange for “sex drugs ‘n rock-n-roll.” Since then, each subsequent generation has been increasingly sexually permissive. Sexpert ideologues now teach sex to children in school, videos, social media, film, novels, text books, even pulpits while “every five days, a police officer in America is caught engaging in sexual abuse or misconduct.” And sexual victimization of males occurs in the military today, not just in prisons. Well over 14,000 in 2012, “[a]ccording to the Pentagon, thirty-eight military men are sexually assaulted every single day. So, it’s not just more reporting. Is it possible pornography is training a rape culture?\nMeanwhile, back at Harvard, nineteen Law Professors posted an irate protest of CNN’s portrayal of the sexualized campuses as a “rape culture.” Their most illustrious professorial signatory is Prof. Laurence Tribe, an admitted plagiarizer, who taught American Legal History to Obama and two Supreme Court Justices. Tribe apparently is inexcusably ignorant of, or deliberately hiding, the worst child sex crimes and frauds in American Legal History—of pedophile Prof. Alfred Kinsey of Indiana University, the “father of the sexual revolution.” American past and present sexual law was revolutionized based upon experiments on up to 2,035 children raped and tortured for alleged “orgasms” published in Kinsey’s Sexual Behavior in the Human Male (1948) Kinsey, a sadistic obsessive masturbating pedophile and pornography addict was the scientific authority for these disastrous changes. His Tables 30-34 record the worst, unprosecuted, infant and child sexual experimentation ever conducted in American Legal History, (Reisman, 2013)\nBy 1952 Herbert Wechsler’s Harvard Law Review article relied on Kinsey’s sex tome to justify liberalizing all sex laws. By 1955 Wechsler, chief author of the first-ever American Law Institute Model Penal Code (MPC), reported that sex protections for females were onerous for men. The new, innovative MPC argued that reduction of sex crime required more sexual freedom, lighter penalties, parole, and tax paid therapy for all sex criminals. Under Wechsler the neoteric MPC proposed age ten for consent as her “seductive” conduct might push men to rape. Kinsey claimed of 4,441 female interviewees none was really injured by a sexual assault, hence the Kinsey-MPC plan was to eliminate “unrealistic” rape and statutory rape laws. No rape harm, no need for rape laws! With this “cultural” pedagogy promoted by our prestigious legal lights and backed by Kinseyan “sex science” our legacy would inevitably be a “rape culture”—rape on college campuses, middle schools, libraries, bedrooms, barrooms, church pews, court rooms, etc. Be careful what you ask for. After the MPC advised a lowered age of consent (to allow “peer” sex), as Reisman documents, America’s legislatures and courts loosened state laws that had favored women (harsh laws against rape, adultery, child sex abuse, incest) and eased criminal penalties for sex offenders in more than two-thirds of U.S. states.\nWechsler and others used Kinsey’s alleged “sex science” to justify these actions and claims such as “[t]he cultural tendency to overprotect women and children [is] often…more detrimental to the…victim than the offense itself… Kinsey’s findings … permeate all present thinking on this subject.” Recall, until Kinsey, society allowed “the marital act” only in the “institution” of marriage, severely limiting even “fun consensual” fornication. Morris Ploscowe wrote, in the 1948 “Pre-Kinsey era” three states gave mandatory death sentences for rape—nineteen states provided the death penalty, life, or very long terms. Twenty-eight states gave the rapist 20 years or more, and one 15 years or more. Post-Kinsey’s “data” stated that 95 percent of men were already sex offenders and most women were promiscuous, or wanted to be. According to Ploscowe, justification for strict rape, child abuse or obscenity law was largely old fashioned.\nHow many millions of college lassies were spared disease, pregnancy, heartbreak, rape, suicide even homicide by such “old fashioned” ideas?\nNow, trained by these elite academics and since “tween-age” by media such as Cosmopolitan magazine (be a “fun, fearless female”– booze up and hook-up), millions of Cosmo followers reveal how well they have learned by accepting or appearing in student pornography magazines such as Harvard’s “Diamond” launched in 2004. At least 10 American universities followed suit, featuring nude photo-spreads of ordinary students. Dozens more host “sex events,” such as naked parties at Yale, “sex week” at Tufts or “Outdoor Intercourse Day” at Western Washington University. Other examples include photographs of half-naked gay couples at the University of Chicago, Squirm at Vassar and, arguably, the most explicit, Boink….College Guide to Carnal Knowledge at Boston University.\nElitist administrators, perhaps some of those who complained about The Hunting Ground, award free speech funds and/or advocate for abusive porn events. Yale graduate Nathan Harden reports on “Sex Week” at Yale, recruiting naïve students into today’s vicious sexploitation. Here “porn stars and sex industry CEOs are invited on campus for a marathon of sex-related film screenings, seminars, and product demonstrations — all sanctioned by the university as ‘sex education.’” Harden notes that the university polity (steeped in the sex-saturated, rape culture they deplore yet breed) no longer understand the reason for education.\nThis is an unanticipated cost of the ‘60’s sexual revolution along with an explosion of inventive, barbaric sex crimes against women, children, even infants, and increased recidivism.\nSome academic elites are waking up. Feminist lawyer and former Democratic presidential Campaign Manager for Michael Dukakis (1988), Susan Estrich was perplexed by the MPC influence on rape laws. She wondered at the “fresh complaint” clause that said, “a complaint must be filed within three months,” if the crime were sexual. This clause had not been part of America’s Common Law. Moreover, now that liberal lawyers were in charge, only “if serious bodily injury is inflicted” would rape be a “first degree felony.”\nMoreover, noted Estrich, the lawyerly libidos had new rules for rape. If the victim had a “racy” past she might be classed as a “prostitute.” Therefore, even when she was the victim of a “gang” or fraternity “group” rape, the guilty predator might be cleared of the crime. These and other new laws followed on Kinsey’s claims that rape was a harmless, natural and normal reaction to seductive females (by age 10). Also, the New York Times reported, March 8, 1949, Kinsey had proven that not more than 5 percent of arrestees cause any real damage and thus sex offense laws had no function other than to preserve custom.\nToday—60 years later, the same Ivy League Schools are embroiled in controversy regarding the “rape culture” they helped create through training students, lawyers, judges, politicians and legislators in Kinseyan pansexuality and the MPC. Many of these 2nd generation learned professors are now signatories on letters protesting claims that there is a rape culture caused by the very sexual revolution they helped institute on campus.\nFor a truly touching video on the reality of the damage done to all by the elites’ promotion of the sexual revolution, do take time to view former porn “star” Shelley Lubben’s reverential video, Dead Porn Stars Memorial.\nJudith Gelernter Reisman, PhD\nResearch Professor, Director Liberty Child Protection Center, Liberty University School of Law\nMary E. McAlister, Esq.\nSenior Litigation Counsel, Liberty Counsel","url":"https://www.breitbart.com/politics/2016/01/01/the-sexual-revolution-gave-us-the-rape-culture/"}
