{"authors":["Lucia Peters"],"date_download":"2018-10-30 22:28:50","date_modify":"2018-10-30 22:28:50","date_publish":"2014-08-15 16:21:28","description":"We’ve already established that you will drink an awful lot of questionable beverages during your college years. It’s unavoidable, unfortunately; even if you stick to non-boozy options, you’re still probably going to try something like, oh, putting a…","filename":"data/vaneerConsumption/TheseHonestAlcoholLabelsAreUpfrontAbouttheFactThatTequilaIsMadeof100PercentRegret.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/23/3f93ddd3-8fec-4d17-8d07-a8047d7b68f9-fotolia_106721949_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35945-these-honest-alcohol-labels-are-upfront-about-the-fact-that-tequila-is-made-of-100-percent_1540938530.html","title":"These Honest Alcohol Labels Are Upfront About the Fact That Tequila Is Made of 100 Percent Regret","title_page":"These Honest Alcohol Labels Are Upfront About the Fact That Tequila Is Made of 100 Percent Regret","title_rss":"NULL","source_domain":"bustle.com","text":"We’ve already established that you will drink an awful lot of questionable beverages during your college years. It’s unavoidable, unfortunately; even if you stick to non-boozy options, you’re still probably going to try something like, oh, putting a little bit of everything from the dining hall drink machine in your cup and drinking it on a dare at least once during your four years away. But the worst part about all the gross things you’ll drink in college? Their labels will sometimes be awfully deceitful. But have no fear — honest alcohol labels are here, and they can tell you aaaaaaaaaaall about whatever you just put in your red Solo cup. Drinking responsibly should really be its own reward, but just in case you need a little more convincing that it’s the right thing to do, here you go.\nDreamed up by Total Sorority Move, these glorious creations detail the pitfalls of some of the most commonly consumed adult beverages in no uncertain terms. They also quite accurately depict the progression of most college students’ drinking-related mistakes. Early in your university career, for example, you will probably imbibe an awful lot of “cocktails” (I use the term loosely, because there are cocktails, and there are cocktails) starring the age-old favorite, NEWBFFS Bonding in the Bathroom Vodka:\nNEWBFFS mixes well with just about everything, and it will lead to many joyful and hilarious conversations over the reapplication of lipstick and vomiting in the toilet.\nThen there’s Text Your Ex Tennessee Whiskey:\nWhich will, for some reason, turn you into an overly sentimental goof who probably should have equipped her phone with one of those anti-drunk-texting apps.\nLater, we move onto Dancing On Tables Tequila:\nWhich is, in fact, made of 100 percent regret.\nAnd lastly, we move on to Crying Alone Wine:\nAlthough Total Sorority Moves’ entry on wine doesn’t specify type, I don’t think it’s an accident that the bottle they chose is both white and sweet. Misery tastes of moscato.\nThere are more where those came from, so head on over to Total Sorority Move to see 'em. Also, as awful as it may seem, the good news is that there's a light at the end of the tunnel: If one of the best things about college is the resilience of your liver, as long as you drink responsibly, you’ll probably come out the other end unscathed. Just, y’know … don’t drink anything that came out of a plastic garbage can. There are no labels for territory that far off the beaten path.\nImages: anaumenko/Fotolia; Imgur (4)","url":"https://www.bustle.com/articles/35945-these-honest-alcohol-labels-are-upfront-about-the-fact-that-tequila-is-made-of-100-percent"}
