{"authors":[],"date_download":"2018-10-30 00:54:29","date_modify":"2018-10-30 00:54:29","date_publish":"2014-05-23 08:00:00","description":null,"filename":"data/vaneerConsumption/TheShockingMonsieurShakespeare.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/05/Screen20shot202014-05-1420at205.05.3620PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860869.html","title":"The Shocking Monsieur Shakespeare","title_page":"The Shocking Monsieur ShakespeareThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Bardolaters are enjoying a movable feast in this 450th anniversary year of William Shakespeare’s birth. It began appropriately enough in Stratford-upon-Avon last April with fireworks, a giant horse-drawn birthday cake, and the beflowering of his grave at Holy Trinity Church, after which the Royal Shakespeare Company performed Henry IV, Part 1. London’s Globe Theater is undertaking no less than to stage his plays in every country in the world, from Bulgaria’s Roman theaters of Philippopolis to Washington’s Folger Shakespeare Library and points in between. New Yorkers can choose among eight Broadway and Off Broadway productions, while China, ever striving to one up the West, will stage nearly forty plays this year with the help of troupes from England, Scotland, and the U.S.\nThe Bard of Avon’s universal appeal extends across the Channel even unto the French, usually accustomed to holding their noses over things British, with an exception made for Scotch whisky. Paris will host a series of lectures, conferences, and exhibits, along with special productions of Macbeth. Newspapers are running supplements telling readers more than they want to know about him, including the novel assertion that Julius Caesar holds a special place in American hearts because actor John Wilkes Booth played Brutus before assassinating Lincoln. But to truly appreciate the French commemoration of Will, you must understand that they have surmounted deeply held prejudices to come to terms with him. Even more painfully, they also had to digest the outrageous possibility that French culture might not after all be the pinnacle of civilization. And that took the better part of 300 years.\nShakespeare was virtually unknown in France until a century after his death, as John Pemble points out in his instructive, highly readable book, Shakespeare Goes to Paris: How the Bard Conquered France. A senior research fellow in history at the University of Bristol, Pemble asserts that even until the latter twentieth century—only fifty years ago—the French warily regarded Shakespeare “as the Other, the alien, the personification of everything that Frenchness was not and could not be.” He was dangerous because of the threat his plays, especially the despairing tragedies, posed to “familiar and reassuring assumptions about history, about providence, about moral values and social order.” For Pemble, the slow, tortuous French acceptance of the Bard was nothing less than “the other French Revolution….It signified changes in habits of thought and attitudes to life every bit as widespread and profound as those that decreed the abolition of the Old Regime.” A large claim, to be sure, but he makes a convincing, and often very droll, case.\nEarly French commentators scarcely knew what to make of Shakespeare. Nicolas Clement, the Sun King’s royal librarian, sniffed in 1684 that the Englishman was a fluent, imaginative poet, but his merit was obscured by verbal ordures (garbage). He was an unheard-of affront to classical French drama as represented by Racine and Corneille, who wrote only of noble sentiments in rhyming six-foot Alexandrine couplets grandly declaimed by mostly immobile actors. Structure was dictated by the strict Aristotelian unities of place, time, and action—sans violence, bad language, emotion, or any other resemblance to real life. Corpses, blood, brawling on the stage? A knight (a nobleof the realm, mind you) named Falstaff drinking, swearing, and whoring? Just too, too uncouth, mon cher. The verdict by France’s eighteenth-century bewigged cultural tastemakers: The man obviously was a vulgar barbarian who had never been exposed to true Culture. But what else could you expect of a playwright from a fog-bound northern island peopled by boorish beer drinkers?\nIt was Voltaire, an avid Anglophile who had lived in England for three years and knew its culture well, who led the French discovery of Shakespeare. But even he was decidedly of two minds. On the one hand, he had to admit that Shakespeare was “a genius full of strength and fecundity, of naturalness and sublimity.” On the other, he was “a drunken savage…without the tiniest particle of good taste.” Just think: Mad royalty was openly portrayed, along with horrors like unwashed Roman plebeians haranguing high-born patricians, even a jealous Moor strangling his innocent wife. Non, this would never do. Where was the exquisite, mincing refinement of French manners and the Enlightenment? As Voltaire scathingly told the Académie Française in 1777, French masterpieces were performed the world over, but it would be a long time before the same recognition was accorded to “that abominable Shakespeare, who is nothing but a provincial clown.”\nBut such a towering writer could hardly be ignored. Translators cleaned him up, “improved” his earthy vocabulary, and generally tried to make him acceptable in polite company. As late as the 1840s, they were still eliminating objectionable references to humble body parts. Thus Othello’s mention of his sword on his thigh wouldn’t do, so they put the weapon in his hand instead. As for Desdemona’s handkerchief, crucial to the play’s plot, they struggled with the fact that mouchoir was a word that well-bred people never used in public. It became a tissue or even a diamond headband. Just as problematic was that the object in question was embroidered with strawberries, because fraise was considered even lower and more ill-mannered than mouchoir. So from euphemism to periphrasis, it took some 200 years for French audiences to learn exactly what Desdemona had lost, driving Othello mad.\nAlong the way, the plays were gutted of much of their lusty Shakespearean vitality—and meaning. In the name of bienséance, or propriety, Hamlet was produced with no ghost, no actors doing the play within the play, no gravediggers, and, at the end, no dead prince. Friar Laurence and the balcony scene were cut from Romeo and Juliet, which was turned into a romantic comedy with a happy ending. There were no witches in Macbeth, no fool in King Lear. No tragedy here, either, since relieved French audiences saw him regain both his sanity and his crown.\nBut even such bowdlerized versions were eventually enough for some in the audience to be contaminated with the notion that here was a new approach to theater, maybe even to their conception of life itself. While the French were mulling that, Germany was idolizing Shakespeare. Goethe, for one, proclaimed, “When I first read Shakespeare, I was like one who, having been born blind, by a miracle is suddenly granted sight.” In France the budding Romantic movement of the 1820s made believers of cultural leaders like Victor Hugo and Hector Berlioz. An inflamed Hugo attacked Voltaire’s denigration of the Bard. “Shakespeare is a drunken savage? Yes, he’s savage! He lives in the virgin forest. Yes, he’s drunk! He’s the drinker of the Ideal.” Berlioz recalled the moment of his conversion: “Shakespeare suddenly fell on me like a thunderbolt…I recognized true greatness, true dramatic beauty and dramatic merit.” In his diary he exclaimed, “Thou alone art the God worthy of artists.”\nThere remained the obdurate problem of translation. The French language was too smooth, its vocabulary too limited, to convey the raw emotion and range of the Bard’s rough-hewn English, while his iambic pentameter and frequent inversion of it were impossible to render. Not to mention his allusions and word-play, which drove translators crazy. From the mid-eighteenth century to the mid-twentieth, the whole Shakespeare canon of thirty-seven plays was translated no less than ten times, while individual plays were tackled even more often: thirty-nine times each for Hamlet and Macbeth, all with varying degrees of success. It was, John Pemble says, “one of the most strenuous attempts ever made to transfer an author from one language to another.” One breakthrough came in 1946 with writer André Gide’s version of Hamlet. And even he admitted himself baffled and frustrated: “How is it possible,” he lamented, “to formulate a French text that is clear, easily understood straight away…and whose imagery is not too shocking for the logical French mind?”\nToday Shakespeare’s chaotic plotting and nihilistic themes clearly fit a French mentality shorn of its cozy certainties and shaken by existentialism and other contemporary philosophical trends. The French cultural elite accept that he is the most universal and, with his anguished questioning of life’s meaning, most modern of writers. “Because his themes are so universal, Shakespeare is the only playwright staged all over the world,” admits Jean-Michel Déprats, director of the complete works of Shakespeare for France’s Bibliotheque de La Pléiade, a prestigious book collection that consecrates the greatest authors. “You can’t imagine a film version of a play by Molière, but you can for Shakespeare.” But it may be too soon to believe that the Bard’s troubles in France are over. The latest version of Othello currently in Paris is judged a flop by Le Figaro’s theater critic. The protagonist is seen as a homeless black immigrant trying in vain to assimilate, while Iago becomes a slapstick buffoon, completely avoiding the lancinating question of evil. “A catastrophe,” she rightly concludes.\nOh well. Give the doggedly ethnocentric French credit for at least trying to understand a barbarous foreigner, an Englishman at that, named William Shakespeare.","url":"https://spectator.org/59219_shocking-monsieur-shakespeare/"}
