{"authors":[],"date_download":"2018-10-30 01:03:35","date_modify":"2018-10-30 01:03:35","date_publish":"2014-10-03 08:00:00","description":null,"filename":"data/vaneerConsumption/TheSecondReichsThreeFatalMistakes.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/10/Screen20Shot202014-10-0220at206.26.0720PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861415.html","title":"The Second Reich’s Three Fatal Mistakes","title_page":"The Second Reich’s Three Fatal MistakesThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"In the years leading up to 1914, many in the German high command thought a war more or less like World War One was inevitable—and when the war came, Germany almost won it. So how did the Second Reich end up losing? There were three key reasons.\nThe first might seem counterintuitive, given many people’s image of Germany as a belligerent power. After the Franco-Prussian War, Germany was the peacemaker of the Continent. Then-chancellor Otto von Bismarck’s foreign policy had four goals: present Germany as a “satisfied” power, isolate France, keep Germany allied with Austria and Russia, and avoid Balkan wars that were “not worth the healthy bones of a Pomeranian musketeer.”\nKaiser Wilhelm II, however, dismissed Bismarck in 1890. Not content with being militarily dominant on the Continent, the Kaiser decided that Germany needed a navy to rival Great Britain’s. He declared himself the protector of Muslims, over and against the French and British empires. He made Germany look like an aggressive power, isolating his own country, rather than France, which achieved an alliance with Russia and an entente with Britain.\nWhile he did not think Austria-Hungary needed to go to war against Serbia in 1914—after Serbia’s capitulation to most of Austria’s demands in the wake of the assassination of Archduke Franz Ferdinand—the Kaiser was responsible, as much as anyone, for the Second Reich’s militarism, which in the end was its undoing.\nThe second reason for the defeat of the Second Reich is related to the first. The German high command was committed to the Schlieffen Plan for a two-front war, which included invading France through neutral Belgium. German Chancellor Theobald von Bethmann-Hollweg said that “Necessity knows no law” and was appalled that “Just for a scrap of paper, Britain is going to make war on a kindred nation.” That scrap of paper was Britain’s guarantee of Belgian neutrality. The Second Reich did not feel bound by scraps of paper and plowed right through them.\nBut the Schlieffen Plan’s amorality created a two-front war that needn’t have been one. All the great powers in the First World War, with the exception of Great Britain, and later the United States, entered the war thinking they had something to gain from it. France, for its part, wanted to recover Alsace-Lorraine (a territory lost in the Franco-Prussian War) from Germany. France, however, was in no position to start a war, and actually withdrew its troops from the Franco-German border as tensions rose. Britain would surely have stayed out of a land war it was unprepared to fight were it not for the invasion of Belgium.\nFinally, what sank the Second Reich was its own sinking of American ships and the related Zimmermann telegram inviting Mexico to invade the American southwest in case of a German-American war.\nThe Second Reich’s decision to pursue unrestricted submarine warfare in early 1917 was based on the same sort of amorality that guided it into war against Belgium and France. It was also based on contempt for the United States. The American armed forces were small in numbers and ill-equipped for a European war. Their commander in chief, President Woodrow Wilson, was a man who professed not to know what the war was about, as he said in a speech in 1916. His moral lecturing of the world was based on America not being a combatant power. His missionary spirit had led him to try to help the European powers find “peace without victory” (a non-starter). After the German sinking of the luxury passenger ship the Lusitania in 1915, which killed 1,195 passengers and crew, including 95 children and 124 Americans, he said there was “such a thing as a man being too proud to fight.”\nHe was outflanked on the left by his secretary of state, William Jennings Bryan, (whom Theodore Roosevelt considered a communist). Bryan, at the time of the Lusitania’s sinking, was a man too proud to even protest, as Wilson did, that the “lives of noncombatants cannot lawfully or rightfully be put in jeopardy by the capture and destruction of an unresisting merchantman.” Bryan feared such a protest might goad the Germans into declaring war on the United States, and resigned. The Germans, less apoplectic, agreed, at least temporarily, to Wilson’s restrictions.\nBut in 1917, General Erich Ludendorff, de facto the second most powerful man in the Reich after General Paul von Hindenburg, dismissed America as a threat: “What can she do? She cannot come here!… I do not give a damn about America.” That proved to be the Second Reich’s final, fatal mistake. As General Hindenburg later conceded, “The American infantry in the Argonne won the war.”\nThe final irony, however, is that today many people in the nations that won the war (or at least many Americans; the French aren’t so sentimental) tend to think of the Second Reich as the injured party—because of the punitive terms of the Treaty of Versailles (even though those terms were, in part, reduced or eventually unenforced)—and as a consequence, they think that America’s role in ending the U-boat threat and rolling back Germany’s attempted military subjugation of continental Europe was somehow discreditable and that reductio ad absurdum it was the United States, Britain, and France that were responsible for Hitler becoming chancellor of Germany in 1933.\nOne might think that our victorious doughboys of 1918—men like Sergeant Alvin York, Eddie Rickenbacker, George S. Patton, George Marshall, Harry Truman, Billy Mitchell, Douglas MacArthur, and “Wild Bill” Donovan—deserve a better, more accurate, memory than that.","url":"https://spectator.org/60549_second-reichs-three-fatal-mistakes/"}
