{"authors":[],"date_download":"2018-10-30 14:15:50","date_modify":"2018-10-30 14:15:50","date_publish":"2018-08-20 00:00:00","description":null,"filename":"data/vaneerConsumption/Thesewomenarehiredguns.json","image_url":"https://www.americanthinker.com/images/bucket/2018-08/208124.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2018_09_these_women_are_hired_guns_1540908950.html","title":"These women are hired guns!","title_page":"These women are hired guns!","title_rss":"NULL","source_domain":"americanthinker.com","text":"These women are hired guns!\nThe despicable charges leveled against Judge Kavanaugh since he performed so brilliantly throughout the Judiciary Committee hearings are so patently false that it would be amusing to watch the Democrats support and defend the accusers if this were not so deadly serious – for Brett Kavanaugh, for his family, and for the country. We know from Brian Fallon, a Hillary Clinton operative, that the left has planned to destroy any person Trump nominates to the Court. One has to wonder what the left's strategy would be had he nominated Amy Coney Barrett. Perhaps leftists would have reported that she had worked her way through college as a stripper or a prostitute. One thing is certain: they would have pulled out every sleazy trick in their playbook to see that she was not confirmed, either. This is who the Democrats are these days. They will go to any lengths, no matter how seedy or illegal or fabricated, to ruin the people they fear. Whom do they fear? Good, honest men like Brett Kavanaugh. People they cannot manipulate, bribe, or threaten to do their bidding.\nWho represents Christine Blasey Ford? Debra Katz, a far-left socialist and HRC fundraiser whose firm once represented Julie Swetnick, the most recent and most ridiculous accuser. Swetnick is the one who, after she was in college, continued to attend high school parties where, she claims, boys drugged girls and then lined up to \"train rape\" them. She went to such parties at least ten times but told no one, reported nothing, even though she must have been the only adult present. That in itself pretty much proves that this planned and plotted smear is all part of an overall strategy to keep anyone Trump nominates from being confirmed. None of these women is remotely believable. Their calculated accusations are purposefully vague, without any details that might lead to any corroboration or investigation. The next one, Deborah Ramirez, is even less valid. That woman had to be cajoled for six days to become \"confident\" enough to name Kavanaugh as the man who perhaps exposed himself to her when she was drop-dead drunk on the floor of a party house. She has wisely refused to testify to anyone. Who convinced her to speak up? The same bevy of Democrat and media operatives tasked for months to dig up dirt on the cleanest man in D.C. So whom did they get to accuse him of made up allegations? Most likely the most vulnerable, troubled women they could find. Who else but persons of questionable sanity would agree to levy such unverifiable charges against a man they clearly never knew? Sadly, there are many women who lie, women who seek unwarranted attention, women who are mentally ill and easily manipulated to the do the bidding of others with contemptible motives. The Democrats found these three or four, and now they using and abusing them. The left today, which encompasses the entirety of the Democratic Party and the mainstream media, has no scruples, no ethics, no moral sense. Leftists' defense of the Clintons' criminality; Bill Clinton's serial abuse of women; and Obama's anti-constitutional, race-hustling activity throughout his eight-year tenure has rendered them corrupt and disreputable. If this circus of false accusations against Kavanaugh has demonstrated anything, it is the complete wickedness of the Democratic Party and the mainstream media. There are really no words to adequately describe the rage the decent people of this nation feel toward today's left. There will be no blue wave. Of that we can be sure. The Democrats in D.C. may think they are clever in mounting this monstrous smear, but liberals with families – sons and daughters – are hopefully not so easily led by scams. They will leave the Democratic Party in droves in disgust. Trump is right. This is a Democrat \"con game.\" Chuck Schumer is likely behind this entire travesty along with an assembled group of financiers like the Clintons, Soros, and \"resisters\" like Katz. Someone is paying these women and their lawyers. That they have offered up stories that are so absurd and unprovable just certifies their conviction that the rest of us are really dumb, and they think they are cunning when they are merely conniving. This is the usual Democrat error in judgment. This is why Democrats were so convinced that Hillary would win the 2016 election in a landslide. They have no idea of the contempt so many millions of us have for them and their tactics. What they have done to Kavanaugh is the final straw. Only hardcore radicals will support what they have done to this man. Self-respecting liberals, along with all conservatives, are horrified by the vicious character assassination of a man who has led an exemplary life. Liberals have smeared him relentlessly for politics, because they lost an election they felt entitled to win. Thanks to Trump, Americans may yet win. This morning's hearing has yet to take place, but it seems that at least one man has come forward to say he may have been the person for whom Christine Blasey Ford has mistaken Kavanaugh. If this turns out to be true, Kavanaugh and his legions of supporters will be vindicated.","url":"https://www.americanthinker.com/blog/2018/09/these_women_are_hired_guns.html"}
