{"authors":["Kavitha George"],"date_download":"2018-10-31 01:52:52","date_modify":"2018-10-31 01:52:52","date_publish":"2018-09-06 02:21:06","description":"In a rare move on Wednesday The New York Times published an anonymous opinion piece, which it said came from a senior member of the Trump administration. The piece, which is highly critical of the president, naturally had Twitter speculating about…","filename":"data/vaneerConsumption/TheseLodestarTweetsOnMikePenceTheNewYorkTimesOpEdPresentAWildTheory.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/d4464ab6-c42e-4d44-ad40-206842f447dd-af1bc253-28f2-4531-8898-b7ddc4e3224e-getty-1027172268.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_these-lodestar-tweets-on-mike-pence-the-new-york-times-op-ed-present-a-wild-theory-11770036_1540950772.html","title":"These \"Lodestar\" Tweets On Mike Pence & The 'New York Times' Op-Ed Present A Wild Theory","title_page":"These \"Lodestar\" Tweets On Mike Pence & The 'New York Times' Op-Ed Present A Wild Theory","title_rss":"NULL","source_domain":"bustle.com","text":"In a rare move on Wednesday The New York Times published an anonymous opinion piece, which it said came from a senior member of the Trump administration. The piece, which is highly critical of the president, naturally had Twitter speculating about the identity of its author. Focusing on the author's use of the word \"lodestar,\" some tweets speculate Mike Pence wrote theTimes op-ed — and the theory is driving Twitter bonkers. Bustle has reached out to the White House for comment.\nWhite House Press Secretary Sarah Sanders responded to the op-ed in a statement, calling it \"pathetic, reckless, and selfish,\" and a \"new low for the so-called 'paper of record.'\" She demanded that The Times issue an apology for publishing the piece. The president also reacted on Twitter, questioning the existence of the anonymous official and saying that if they do exist, they should be handed over to the government for \"National Security purposes.\"\nIn Wednesday's piece, the writer lauded Sen. John McCain for his bipartisan approach to politics, and warned Americans to \"break free of the tribalism trap.\" They continued, \"We may no longer have Senator McCain. But we will always have his example — a lodestar for restoring honor to public life and our national dialogue. Mr. Trump may fear such honorable men, but we should revere them.\"\nAccording to Dan Bloom, a senior producer at Panoply Media, that paragraph rules out as authors policy advisor Stephen Miller and social media director Dan Scavino, who Bloom says would not bother praising McCain. Instead, Bloom narrows in on the word \"lodestar.\" Lodestar is an astronomy term, used to describe something that serves as an inspiration and a guide, according to Merriam-Webster Dictionary. It \"just seems like an unusual word to use in general, not to mention in an op-ed that's going to be widely read,\" Bloom tweeted Wednesday afternoon. \"It has this whiff of sanctimony.\"\nBloom said he searched for the word \"lodestar\" in relation to chief of staff John Kelly, and Secretary of Defense John Mattis, but found nothing. However, when he included Pence's name, Bloom said he found multiple examples of the vice president giving speeches over the years featuring the word.\nBloom then proceeded to tweet a series of excerpts from those statements, which include a speech at the United Nations in September 2017, a talk at the Jack Kemp Leadership Award Dinner later that year, and Pence speaking in Tokyo next to prime minister Shinzo Abe in 2018.\nSome Twitter users questioned whether the piece could have been penned by Pence's speechwriter, and not Pence himself. But Bloom responded, pointing out that Pence's speechwriter, Stephen Ford, has only worked for Pence since 2017, and Pence's \"lodestar\" use dates back at least as far as 2001.\nDespite how riveting Twitter seems to find it, Bloom's theory is still just speculation around a White House known for its frequent leaks. Business Insider reported that Trump administration staffers giving anonymous statements are known to use idioms and phrases that other Trump administration officials would typically use, in order to avoid blame. \"To cover my tracks, I usually pay attention to other staffers' idioms and use that in my background quotes,\" an anonymous White House official told Axios in May. \"That throws the scent off me.\"","url":"https://www.bustle.com/p/these-lodestar-tweets-on-mike-pence-the-new-york-times-op-ed-present-a-wild-theory-11770036"}
