{"authors":["Seth Millstein"],"date_download":"2018-10-31 01:41:46","date_modify":"2018-10-31 01:41:46","date_publish":"2018-09-14 19:10:45","description":"As the Trump administration was proposing deep cuts to federal agencies across the board, the State Department spent $52,701 on curtains for the U.N. Ambassador's residence in New York, the Washington Post reports. The allocation of that money was…","filename":"data/vaneerConsumption/TheStateDepartmentInstalledCurtainsThatCost52701InTheUNAmbassadorsApartment.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/ddfcd718-973e-4e32-b430-15f5f5c8f8bf-getty-903916722.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-state-department-installed-curtains-that-cost-52701-in-the-un-ambassadors-apartment-11924706_1540950106.html","title":"The State Department Installed Curtains That Cost $52,701 In The UN Ambassador's Apartment","title_page":"The State Department Installed Curtains That Cost $52,701 In The UN Ambassador's Apartment","title_rss":"NULL","source_domain":"bustle.com","text":"As the Trump administration was proposing deep cuts to federal agencies across the board, the State Department spent $52,701 on curtains for the U.N. Ambassador's residence in New York, the Washington Post reports. The allocation of that money was made in 2016, before current U.N. Ambassador Nikki Haley was appointed to the position and moved into the building.\nPast U.N. ambassadors have stayed in the Waldorf Astoria hotel, but that changed in 2016 after the hotel was bought by a Chinese insurance company with unclear ownership. For security reasons, the State Department decided in 2016 to provide the U.N. Ambassador with her own residence. Patrick Kennedy, a manager at the State Department under Barack Obama, told the Times that the government leased the First Avenue apartment, a full-floor penthouse with nearly 6,000 square feet.\nIt didn't come cheap — the apartment was listed a year ago for $58,000 a month. In addition, the State Department spent $52,701 on mechanized curtains for the penthouse, according to contracts reviewed by the Times. The curtains themselves cost $29,900, while the hardware to open and close them automatically ran the government $22,801. The State Department had them installed between March and August of 2017, the Times reports.\nKennedy defended the purchase, arguing that the curtains are necessary as a security precaution.\n“All [Haley's] got is a part-time maid, and the ability to open and close the curtains quickly is important,” Kennedy told the Times.\nBrett Bruen, a former diplomat in the Obama administration, criticized the purchase. He noted that former Secretary of State Rex Tillerson was proposing deep cuts to the State Department's own budget shortly before the curtains were installed, and that a month later, Tillerson drastically reduced the number of diplomats that the U.S. sent to the U.N. General Assembly.\n“How can you, on the one hand, tell diplomats that basic needs cannot be met and, on the other hand, spend more than $50,000 on a customized curtain system for the ambassador to the U.N.?,” Bruen asked the Times rhetorically.\nNorm Eisen, formerly the U.S. Ambassador to the Czech Republic, criticized the curtain purchase on Twitter, claiming that he spent hundreds of thousands of dollars on his own curtains when he was ambassador.\n\"I paid for my own damn curtains when I was an ambassador—& much more,\" tweeted Eisen, who now chairs the watchdog group Citizens for Responsibility and Ethics in Washington. Cost me hundreds of thousands of dollars a year. (My wife is still mad.) What the hell is the matter with these people—they see taxpayers as chickens to be plucked. Well, voters are soon gonna say 'pluck you.'\"\nSome on Twitter compared the curtain purchase to earlier reports that Housing and Urban Development Secretary Ben Carson spent $31,000 of taxpayer money on a dining room set for his office. However, a spokesperson for Haley said that she had no say in the purchase of the curtains, which doesn't appear to have been the case with Carson's dining set.\nThe monthly rent for Haley's apartment is roughly the same as the median yearly income in America, according to U.S. Census data from 2016.","url":"https://www.bustle.com/p/the-state-department-installed-curtains-that-cost-52701-in-the-un-ambassadors-apartment-11924706"}
