{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:43:33","date_modify":"2018-10-30 21:43:33","date_publish":"2016-06-27 15:08:31","description":"The Spence has closed its doors in Midtown after four years in business.","filename":"data/vaneerConsumption/TheSpenceclosesinMidtown.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/06/27/Images/WPIMAGE_cmgajcfoodandmore_9117.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_the-spence-closes-midtown__1540935813.html","title":"The Spence closes in Midtown","title_page":"The Spence closes in Midtown","title_rss":"NULL","source_domain":"ajc.com","text":"The Spence has closed its doors in Midtown after four years in business.\nThe restaurant, which opened in 2012 at 75 5th St. NW in Atlanta with then-executive chef Richard Blais at the helm, served its last meals over the weekend.\nBob Amick, owner and founder of Concentrics Restaurants, which operated The Spence, released a statement addressing the closure:\n\"The Spence proved to be an exciting concept just as we had hoped. We weren't actively looking for buyers but when we were approached the deal made a lot of sense. We are not at liberty to discuss who the buyers are at this time as it's still confidential. However, we wish the new owners all the best as we look toward focusing on three new Atlanta concepts ( NEXTO and two hotel properties with details to be announced soon) as well as several concepts across the country opening in 2016-2018.\"\nFormer executive chef Richard Blais cooks at The Spence in 2013. HYOSUB SHIN / HSHIN@AJC.COM\nNEXTO is the ramen concept from Chef Mihoko Obunai set to open this summer. Concentrics owns several other restaurant in Atlanta, including One Midtown Kitchen, Parish and Two Urban Licks.\nBlais, who brought a high-profile reality television pedigree to the restaurant during his tenure due to his run on \"Top Chef,\" developed a menu that was \" all over the board --- punny and kind of silly, creative in ways that don't totally work, and then sophisticated and brilliant ,\" former AJC food critic John Kessler wrote in 2012.\nChef Wesley True took over the kitchen after Blais moved to San Diego in 2015 , but only stayed on a few months before going to work for The Optimist .\nReturn for updates.\nClick here to read the AJC’s Ultimate Guide to Brunch in Atlanta\nClick here to read about dining in Atlanta around the clock\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter. Find us on Instagram @AJCdining.","url":"https://www.ajc.com/blog/atlanta-restaurants/the-spence-closes-midtown/c4OmQH35htCsR8QOknyuaM/"}
