{"authors":[],"date_download":"2018-10-30 14:23:22","date_modify":"2018-10-30 14:23:22","date_publish":"2016-04-23 00:00:00","description":null,"filename":"data/vaneerConsumption/TheSweetFaceofIslam.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_04_the_sweet_face_of_islam__1540909402.html","title":"The Sweet Face of Islam","title_page":"The Sweet Face of Islam","title_rss":"NULL","source_domain":"americanthinker.com","text":"I chose the peace sign because it represents my #Islam. The one that taught me to oppose #injustice and yearn for #unity. The one that taught me that killing one innocent life is equivalent to killing humanity.\nAfter a nasty terrorist attack one can expect to read about how unrepresentative of the true doctrines of Islam such acts are. Not infrequently we are treated to the remarks of an attractive young Muslim woman explaining that Islam is the religion of peace, inclusion and justice for all. Usually we are reassured that Muslims love America and are patriotic, Constitution-supporting citizens. Recently, Republican Muslim Coalition President Saba Ahmed draped in an American flag, proclaimed that she was a proud, patriotic American. After Trump’s misguided remarks that due to terrorist attacks (San Bernardino) Muslims in America needed to wear identification, the Facebook post of Marwa Balkar went viral:\nOne is naturally inclined to believe that someone who is a Muslim and is brought up in a Muslin community knows whereof he/she speaks. And that may be quite correct as regards their assessment of the attitudes of their own community. But it does not follow that that they speak with great knowledge of the Koran or Sunnah or of Sharia law. Even less does it follow that they understand the ultimate agenda of the various Islamic front groups in the U.S. that are affiliated with the Muslim Brotherhood or the Wahhabi supported fronts of Saudi Arabia. They may be recruited by such organizations to put a nice face on Islam but that hardly means that that is what the ultimate agenda is of such organizations.\nAs a case in point, here is an interesting account of the rude awakening of a Muslim American who grew up in a patriotic Muslim community in Hamtramck, Michigan.\nAs a Muslim growing up in the United States, I was taught by my imams and the community around me that Islam is a religion of peace. My family modeled love for others and love for country, and not just by their words. My father served in the U.S. Navy throughout my childhood, starting as a seaman and retiring as a lieutenant commander. I believed wholeheartedly a slogan often repeated at my mosque after 9/11: “The terrorists who hijacked the planes also hijacked Islam.” Yet as I began to investigate the Quran and the traditions of Muhammad’s life for myself in college, I found to my genuine surprise that the pages of Islamic history are filled with violence. How could I reconcile this with what I had always been taught about Islam?\nThe point being that in the last analysis the rank and file and acolytes of Islam can be led to believe whatever their handlers at the time find it tactically expedient for them to believe as they are led down road to Islam Uber Alles. In particular, what matters is the real agenda and beliefs of Islam’s front organizations and their leaders. And what is maddeningly incompressible about that is the extent to which the Muslim Brotherhood and the Saudis have been able to dupe U.S. leadership. Hiding behind the Islamophobia ruse, front groups in the U.S. have suckered the Obama administration into believing in the patriotic, constitution supporting sweet face of Islam, here are the real agendas.\nThe Saudi agenda. For decades, the Saudis sent ambassadors who were “just like us,” drinking expensive scotch, partying hard, playing tennis with our own political royalty, and making sure that American corporations and key individuals made money. A lot of money. In return the Saudi’s got to fund their Wahhabi supremacist, Jew hating, female subjugating message in their mosques and madrassahs. This despite the fact that the Saudis would never let us fund a church or synagogue in Saudi Arabia.\nAnd the 28 pages excised from the 9/11 Commission’s report? Those pages allegedly document Saudi complicity. Our own government kept those revelations from the American people. Because, even after 9/11, the Saudis were “our friends.”\nThe Muslim Brotherhood agenda. The Muslim Brotherhood was founded in 1928 by Islamic cleric (and Hitler admirer) Hassan al-Banna after the collapse of the Ottoman Empire.\nThe group seeks as its end-game to install a Sunni Islamic caliphate throughout the world. The explicit goal of the Muslim Brotherhood. as stated by al-Banna, is that given that is the nature “of Islam to dominate, not to be dominated, to impose its law on all nations and to extend its power to the entire planet.” Both former Al Qaeda leader Osama Bin Laden and ISIS “caliph” Abu Bakr Al Baghdadi were members of the Brotherhood. Its current spiritual leader, Yusuf Al-Qaradawi, has a knack for bashing Jews and praising Nazis. The Muslim Brotherhood’s motto remains: “Allah is our objective. The Prophet is our leader. Qur’an is our law. Jihad is our way. Dying in the way of Allah is our highest hope.”\nYet the president continues to regard the various front groups of MB as legitimate organization combating Islamophobia and acting as “rational agents” in the political arena. In fact, he has just had the leaders of the following Islamic front organization over to the White House on Muslim Brotherhood Day: CAIR (Council on American Islamic Relations); MPAC (Muslim Public Affairs Counci); ISNA (Islamic Society of North America).\nAll these groups have funneled money to terrorist groups, regard Israel as a terrorist nation and reject the designation of Hamas and Hizb’allah as terrorist groups. And, most importantly, support the imposition of Sharia.\nHijacked Islam? When Muslims (Sunni, Shia) have the upper hand is there any other kind? Meanwhile Islam’s useful idiots dance the taqiyya on the yellow brick road to dhimmitude.","url":"https://www.americanthinker.com/articles/2016/04/the_sweet_face_of_islam_.html"}
