{"authors":[],"date_download":"2018-10-30 21:49:17","date_modify":"2018-10-30 21:49:17","date_publish":"2016-12-20 17:16:00","description":"It happens every year.","filename":"data/vaneerConsumption/These15placesinAtlantaareawillhelpyoumeetyour2017goals.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/20/Images/newsEngin.16529338_123016-resolutions-CC2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_attractions_t_3236dc25a419455ad02cbf2852892edf__1540936157.html","title":"These 15 places in Atlanta area will help you meet your 2017 goals","title_page":"These 15 places in Atlanta area will help you meet your 2017 goals","title_rss":"NULL","source_domain":"ajc.com","text":"It happens every year. A new year sparks a desire for change in our lives — lose weight, get more exercise, read more and spend less.\nSometimes, dramatic lifestyle changes are made but not sustained, and people often fall short in their goals. Here’s the good news: New Year’s resolutions can work, and it doesn’t have to be brutally hard to change your habits.\nMeeting your goals for 2017 will take planning, willpower, focus and realizing it won’t always be easy. But why not have some fun and try something new on your quest to make some healthy changes?\nMetro Atlanta is home to great walking trails, restaurants that will inspire you to eat more vegetables, and many attractions that can be both budget-friendly and help you spend less time on a screen. Here are five resolutions and ideas for meeting them around town.\nJayden Smith, 9, of Covington takes in the sky at sunset from a granite outcropping near the top of the Arabia Mountain Trail southeast of Atlanta near Lithonia. The PATH Trails network meanders through rock outcroppings, colorful wildflower fields, rushing streams, and towering pines from the Mall at Stonecrest into Panola Mountain State Park and beyond featuring 7,000 acres of green space and Arabia Mountain. CURTIS COMPTON/CCOMPTON@AJC.COM (Curtis Compton/The Atlanta Journal-Constitution)\nExercise more\nIf you are like most Americans, getting more exercise will be a top priority for you this year. If you are seeking an alternative to the gym, you are in luck here in metro Atlanta, home to many picturesque walking trails.\nPATH trails include the quiet countryside of the Silver Comet Trail, as well as the South Peachtree Creek Trail. To read more about the more than dozen PATH trails in metro Atlanta, go to https://pathfoundation.org/trails.\nHere are a couple of PATH trails worth exploring.\nArabia Mountain Trail: Featuring 7,000 acres of green space southeast of Atlanta, the Arabia Mountain PATH network meanders through rock outcroppings, colorful wildflower fields, rushing streams and towering pines as it makes its way from the Mall at Stonecrest into Panola Mountain State Park and beyond. The trail system is over 33 miles long, and plans are underway to extend the trails. How to get there: From I-285 and I-20 East, go east on I-20 to the Evans Mill Road exit. Turn right on Evans Mill Road. Go straight through the light at Mall Parkway onto Woodrow Road. Woodrow Road will dead-end into Klondike Road. Turn right on Klondike Road. There is a trailhead on the left less than one-quarter mile and on the right at 1.25 miles.\nMatt Trivett (right) of Decatur and Jon Chames of Clarkston follow stone path markers while hiking a section of the Arabia Mountain Trail southeast of Atlanta near Lithonia. The PATH Trails network meanders through rock outcroppings, colorful wildflower fields, rushing streams, and towering pines from the Mall at Stonecrest into Panola Mountain State Park and beyond featuring 7,000 acres of green space and Arabia Mountain. CURTIS COMPTON / CCOMPTON@AJC.COM (Curtis Compton/The Atlanta Journal-Constitution)\nSouth Peachtree Creek Trail: This meanders through Mason Mill Park as a boardwalk along the banks of the creek. Take a scenic, leisurely walk along this trail that connects the ballfields and parking area at Medlock Park to the historic Decatur Waterworks and the Tennis Center at Mason Mill Park. How to enter: Take I-85 to Clairmont Road then go south to McConnell Drive. Then go left on McConnell Drive to parking at Mason Mill Tennis Center.\nEat more healthy\nEating more fruits and vegetables is a common goal after the holidays. Keeping calories in check can be a challenge when eating out. But True Food Kitchen in Lenox Square mall offers plates of fresh food, many options for vegetarians and meat eaters alike with the menu featuring seared albacore tuna salad, turkey burgers and roasted Brussels sprouts. And even if it is a chain, it offers a nice alternative to greasy, high-calorie Chinese food at the food court. 11 a.m.-10 p.m. Mondays-Thursdays; 11 a.m.-11 p.m. Fridays; 10 a.m.-11 p.m. Saturdays; 10 a.m.-9 p.m. Sundays. Lenox Square, 3393 Peachtree Road N.E., Suite 3058B, Atlanta. 404-481-2980, www.truefoodkitchen.com.\nVegan dining at Herban Fix, a swanky, Zen Asian restaurant down the road from the Fox Theatre, will offer you plenty of green, and also substantial meat substitutes — for example, the soy “fish,” the mushroom “steak,” and “poultry” that began as tofu. Other dishes include a salad of seasonal vegetables with roasted nuts or crispy purple yam cakes, and a clear consommé infused with the aromas of lemongrass and cilantro and studded with nothing but a few jewel-green dumplings.\nHerban Fix: Lunch, 11 a.m.-3 p.m. Mondays-Saturdays; dinner, 5-9:30 p.m. Sundays-Thursdays, 5-10:30 p.m. Fridays-Saturdays; brunch, 11 a.m.-3 p.m. Sundays. 565 Peachtree St. N.E., Atlanta. 404-815-8787, herbanfix.com.\nMetroFresh: This Midtown epicenter of healthy dining has always done salads well. A rotating menu offers classics and the unexpected, including light vegetarian soups like Garden Veggie and Tomato Basil, Caribbean Butternut Squash and Pumpkin Topped With Macadamia Nuts. Creative salads include marinated kale with Balsamic Soaked Dried Fruit, and Crumbled Blue Cheese. Breakfast, 7-11 a.m. Mondays-Fridays; 8 a.m.-1 p.m. Saturdays; 10 a.m.-3 p.m. (brunch) Sundays. Lunch and dinner: 11 a.m.-9 p.m. Mondays-Saturdays. 931 Monroe Drive N.E., A106, Atlanta. 404-724-0151, www.metrofreshatl.com.\nMORE: Salads to fall in love with\nBesides the spa experiences, there’s a restaurant inside Jeju Sauna in Duluth. AJC FILE PHOTO (The Atlanta Journal-Constitution)\nManage your stress better\nIf you are seeking a day of relaxation and a very different kind of spa experience, try a day at Jeju Sauna in Duluth. It’s a place where you can step inside an igloo-shaped sauna encrusted with gemstones or take a nap on yellow jade-tiled floors (heated by water below). Jeju Sauna, which stretches over 35,000 square feet, is a gender-segregated traditional Korean public bathhouse, furnished with hot tubs and showers. The coed community space houses hut-shaped saunas where temperatures can sizzle as high as 145 degrees and a traditional Korean restaurant. $25 covers admission. (Food, massages and other services are extra.) Jeju Sauna is open every day — 24 hours a day. 3555 Gwinnett Place Drive. Duluth. 678-336-7414, http://jejusauna.com/.\nAnother way to get a break from your busy life is to get in the car and drive north out of the city where there are plenty of spots offering serenity. At Amicalola Falls State Park in Dawsonville, just an hour north of Atlanta, you’ll find the Southeast’s tallest cascading waterfall. The falls can be enjoyed from both easy and difficult trails. A short, flat path leads to a boardwalk offering the most spectacular views. There’s also an easy-to-reach overlook at the top. For a tougher challenge, start from the bottom of the falls and hike up the steep staircase. 280 Amicalola Falls State Park Road, Dawsonville. 706-265-4703, http://gastateparks.org/AmicalolaFalls.\nYou can also find solitude closer to home.Big Trees Forest Preserve is located in Sandy Springs. This is a 30-acre tree, plant and wildlife sanctuary in Sandy Springs. And while you may be able to hear Roswell Road traffic whirring in the distance, walking through this serene forest offers an abundance of color along 1.5 miles of hiking trails winding around two creeks and forests of white oaks, some older than a century. Open sunrise to sunset daily. 7645 Roswell Road, Sandy Springs. 770-673-0111, bigtreesforest.com.\nWhatever you decide, make sure to unplug, and better yet, leave your smartphone at home.\nChildren scamper in and out of the surreal sculptures/play structures in the courtyard of the High Museum. The installation, by Spanish designer Jaime Hayon, is called “Tiovivo.” The installation’s run has been extended until March 5, 2017. CONTRIBUTED BY JONATHAN HILYER (The Atlanta Journal-Constitution)\nSave money\nHow about a free trip to the High Museum of Art? Everyone receives free admission to the High Museum on the second Sunday of each month (open noon-5 p.m. Sundays) as part of Family Fun at the Woodruff Arts Center. Also enjoy special (free) family-friendly programming from 1 to 4 p.m.\nBank of America and Merrill Lynch cardholders receive free walk-up admission on the first full weekend of each month. (Free admission offered for cardholder only.)\nAnd the High Museum of Art offers free admission for all active and veteran military personnel, along with one guest, during regular admission hours. Limited to two admission tickets total. Must provide proof of service.\nHigh Museum, 1280 Peachtree St. N.E., Atlanta. 404-733-4400, www.high.org.\nRELATED: Review: Technology versus nature in photographer Struth’s High exhibit\nRELATED: Art review: Children’s book author Eric Carle subject of retrospective\nRELATED: Art review: Ronald Lockett’s ‘Fever Within’ a striking testament to power of empathy\nSpend your birthday at the Georgia Aquarium for free on your birthday: Yes, that’s right — Georgia residents get free entry to the aquarium on their birthdays. Just show proof of your birthday (ID or birth certificate) at any ticket window and you get a Total Ticket, which gives you access to all galleries and shows. 225 Baker St. N.W, Atlanta. 404-581-4151, www.georgiaaquarium.org.\nRELATED: Sea lion, dolphin presentations at Georgia Aquarium\nRELATED: A timeline of the Georgia Aquarium\nThe Starlight drive-in, shown in 2012, has a mix of modern features, such as digital projection, and yesteryear charm. BOB ANDRES / BANDRES@AJC.COM (The Atlanta Journal-Constitution)\nDrive-in movies: Watch movies under the stars at Atlanta’s only drive-in theater, the Starlight Drive-In, at bargain prices. Open since 1949, the Starlight has both changed with the times — adding more screens and switching to digital projection — and held onto its yesteryear charm. The $9 adult ticket and $1 kids ticket each get you two movies. Yep, there’s always a double feature. There’s a concession, but it’s OK to bring your own food and snacks (and save more money). The Starlight is open seven days a week, 365 days a year. 2000 Moreland Ave. S.E., Atlanta.\nhttps://starlightdrivein.com/.\nMonique Lee of College Park rides her bike along the Beltline near Piedmont Park. The mural behind her was painted by Alex Brewer. Also known as the artist Hense, he has several colorful murals in the Atlanta area. One of the most popular murals is this one under Virginia Avenue near Piedmont Park. JOHN SPINK /JSPINK@AJC.COM (John Spink/The Atlanta Journal-Constitution)\nSpend more time together as a family\nTurn off the TV (and other screens) and take a stroll along the Beltline, enjoy the sights, and stop at one of many restaurants along the way for a bite to eat. Think of it as a (free) living, breathing outdoor museum you can stroll, bike or jog through. With public art, a skateboarding park and lots of good people watching, the Beltline is a fun outing for all ages. Good places to enter are by Krog Street Market or the other side of the paved trail across from Piedmont Park at Monroe Drive and 10th Street.\nYou can’t go wrong with Krog Street Market (99 Krog St., Atlanta, www.krogstreetmarket.com). There, you’ll find a hip food hall where you can collect meals from chef-driven food stalls; drinks from Hop City, with its dozens of local craft beers on tap; and artisan desserts from shops like the Little Tart Bakeshop and Jeni’s Splendid Ice Creams. Expect to smell cacao — roasted, ground and conched on-site — at Xocolatl’s chocolate micro-factory.\nRELATED: Read more about the couple behind Xocolatl at specials.myajc.com/xocolatl/.\nAnother idea — rollerskating. Enjoy hours of entertainment, exercise and fun family time rollerskating. All American Skating Center in Stone Mountain with upbeat music and lights offers family Friday skates on Friday evenings. $2-$8 admission depending on day and time of day. Skate rentals, $3 extra. Hours: 6-9 p.m. Mondays; 6-9 p.m. Wednesdays; 7-11 p.m. Fridays; 11 a.m.-11 p.m. Saturdays; 1-10 p.m. Sundays. (Check website for additional hours during winter break.) 5400 Bermuda Road, Stone Mountain. 770-469-9775, www.aaskate.com/.\nAnother roller skating place to consider is Cascade Family Skating in Atlanta. Prices: two for $5 (and free skates) on Tuesday evening; $10 (skates included) Saturday teen night; otherwise $8 per person plus $3 skate rental. Hours: 7-10 p.m. Tuesdays; 8 p.m.-midnight Wednesdays; 7:30-11 p.m. Fridays; 1-6 p.m. and then 7:30-11 p.m. Saturdays; 3-7 p.m. family skate and then 8 p.m.-midnight Sundays for adult skate. Cascade Family Skating in Atlanta. 3335 MLK Jr. Drive S.W., Atlanta. 404-699-9559, http://atlantafamilyfuncenters.com/cascade/.\nMORE: Prepare to be wowed: 6 must-see festivals of trees around Atlanta\nMORE: Centennial Olympic Park to host Atlanta’s 1st Chinese Lantern Festival","url":"https://www.ajc.com/entertainment/attractions/these-places-atlanta-area-will-help-you-meet-your-2017-goals/FVO6y17emnmF1Zzed2vGgN/"}
