{"authors":[],"date_download":"2018-10-30 01:01:16","date_modify":"2018-10-30 01:01:16","date_publish":"2018-06-24 21:30:30","description":null,"filename":"data/vaneerConsumption/TheSarahHuckabeeSandersIncidentIsASignOfBothOverpoliticizationAndOurCoarseningNationalSpirit.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/06/800.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861276.html","title":"The Sarah Huckabee Sanders Incident Is A Sign Of Both Overpoliticization And Our Coarsening National Spirit","title_page":"The Sarah Huckabee Sanders Incident Is A Sign Of Both Overpoliticization And Our Coarsening National SpiritThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"One thing I’ve come to realize over the years is that all people of fame, wealth, or power are, in the end, people too. Whether CEO or politician, actor or famed scientist, they go about their days like many of us do, experience the ups and downs, run errands, and eat.\nA person of current public attention in the United States last Friday decided to eat dinner at a small restaurant in Lexington, Virginia. That person, White House Press Secretary Sarah Sanders, was then informed by the owners of the establishment that she was to leave, as they would refuse to serve her because of her political work.\nJust a few days prior a similar situation happened in Washington, D.C. as Secretary of Homeland Security Kristjen Nielsen was protested as she dined too. A few weeks ago Fox News Contributor Tomi Lahren also was heckled for her political beliefs, and even had a glass of water thrown at her, while she was out for food with her parents.\nWe live in a country that deeply embraces freedom of speech and with as contentious the issues as are currently in play in our policy discourse there are many opinions to be heard. Nonetheless, when we allow our politics to overflow from their proper channels to the broader society at large, only bad things can possibly happen.\nThe coarseness and hyperpolarization of our discourse is something that has been long discussed. However another increasingly worrying trend is the politicization of everything, from what we eat to what we wear, from the cars we drive to where we shop.\nWhen that begins to spill over to our daily lives, and where confrontational protests, sometimes physical, become normalized and encouraged, it seems to create potential gain for short-term political priorities at risk of longer-term decay and radicalization.\nWhere true and major injustice exists, we should do what we can to push against it. Indeed, throughout history that is what those ranging from great patriots to ordinary citizens have done.\nHowever the issues that currently fill our political discourse are not horrific terrors that merit such harsh reaction, but rather merely regular policy proposals that have been distorted to create over-excitement among our people.\nNo matter what is said, it is simply incomprehensible and blatantly disgraceful to compare the great injustices of the past worth all-out battling with debates such as business tax legislation and global trade policy.\nIf some radical partisans terrorize the other side for merely expressing differing policy opinions within still the grand umbrella of American republican and constitutional political philosophy, then how will our country ever be able to engage in serious civic discourse?\nThe natural logic of silencing differing views in such an authoritarian fashion is that eventually the range of acceptable viewpoints eventually becomes narrower and narrower, and soon we find that even expressing sensible alternatives or disagreement is met with similar force as to truly distasteful ideas.\nIn the process, not only are the policy and societal benefits of republican governance and democratic debate quelled, but the line between worthwhile alternatives and radical ideas is blurred.\nIn my many years of work in politics and government, I am aware that those radicals who disrupt and cause a ruckus are a tiny, tiny group in our large country – perhaps no more than even just 5%, combining them on both the far left and far right. They seem more prominent than they are because their disturbances create media attention and they try to garner the power of a small but skilled and precise force, but they lack even the remotest popular general support.\nIf the rest of the population is willing to simply shut out the social-media-mob leaders and professional protesters, we’ll realize they actually are infinitesimal in true number and gain their power only from fear and intimidation. They themselves may often be too lost to be worth our time, but for our society as a whole we can still fix ourselves of this scourge that has been corrupting our national spirit.","url":"https://spectator.org/the-sarah-huckabee-sanders-incident-a-sign-of-both-overpoliticization-and-our-coarsening-national-spirit/"}
