{"authors":["Bethanne Patrick"],"date_download":"2018-10-23 01:20:17","date_modify":"2018-10-23 01:20:17","date_publish":"2018-07-17 00:00:00","description":"Megan Abbott's new novel follows two women with a troubled past who meet again, working in the lab of a powerful scientist. It's a slow-burning story whose final explosion is a true surprise.","filename":"data/vaneerConsumption/TheScienceOfFemaleAngerAndAmbitionInGiveMeYourHand.json","image_url":"https://media.npr.org/assets/img/2018/07/11/38b8fd9d7854f612143ab1a730f7381d_wide-b8dc7700deaeedd81adcc197f789709af19ea01c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_07_17_628218930_the-science-of-female-anger-and-ambition-in-give-me-your-hand_1540257617.html","title":"The Science Of Female Anger And Ambition, In 'Give Me Your Hand'","title_page":"In 'Give Me Your Hand,' The Science Of Female Anger And Ambition  : NPR","title_rss":"NULL","source_domain":"npr.org","text":"The Science Of Female Anger And Ambition, In 'Give Me Your Hand'\nThe genius of Megan Abbott's previous bestselling novels (You Will Know Me, The Fever, Bury Me Deep) lies in acknowledging that strong women cannot escape the web of patriarchy. And Abbott knows: Just because we currently push our girl children towards STEM classes and careers doesn't mean they are immune to the same cultural pressures to which they've always been subjected. A woman who is a scientist remains a female raised in our male-dominated society.\nAbbott's newest book, Give Me Your Hand, not-so-delicately traces the path back to the past of two women, Kit and Diane. Both were academic stars in their high-school math and science classes, but their friendship ran off the rails after Diane shared a dreadful secret with Kit.\nKit now works in a Dr. Lena Severin's prestigious lab researching the origins of pre-menstrual dysphoric disorder (PMDD). PMDD, for those unfamiliar with the term and its abbreviation, is PMS on steroids — literally. PMDD can involve high levels of testosterone and androgens. Symptoms can include rage, feeling out of control, and increased mood swings.\nAbbott spoke about it it in an interview with critic Ruth Franklin, saying she'd been attracted to the disorder after learning it had been used as a criminal defense. \"There's this notion of women's bodies being out of control, so out of control that men don't understand it at all,\" she said. \"So it's a very smart defense, because if no one wants to talk about it, then they just assume women are capable of anything.\" Or, in the novel itself: \"Don't we all feel we have something banked down deep inside just waiting for its moment, the slow gathering of hot blood?\"\nMeanwhile, the acclaimed Dr. Severin and her team have everything under control, to the extent that they've received a huge new grant allowing them to expand. Lena Severin, all coolness with her flapping coats and leather boots, makes a fantastic foil to her study participants. Soon she introduces a new team member, Diane. While Kit doesn't love this development, she also knows that Diane's credentials are impeccable. She's going to have to try.\nUnfortunately, Diane isn't content with Kit's initial cold-shoulder acceptance. She wants to renew their old bond, a relationship Kit would prefer to leave buried in the past. Without providing any spoilers, it's fair to reveal that readers know early on what the prior conflict is all about. Kit explains it with remarkable restraint, given that the events took place while she was still a teenager. Her footing is firm. She's the golden child of Severin's lab, the scientist next in line for directing her own team and beloved of the men who make up the rest of the current one.\nKit particularly cherishes Serge, who cares for the lab mice — but she can't keep her hands off Alex, who brings her a milky coffee each morning.\nThe best part of this slow-burning novel is that just when you think you've seen the explosion, another one happens.\nKit believes she has both of those men, and others, eating out of her hands as surely as those mice do Serge's. She doesn't want to wind up \"so bored\" like a former colleague who followed a spouse and took a Big Pharma job. But just after telling us that, we hear Alex describe the lab as \"a nest of vipers.\" Foreshadowing, anyone? Abbott has once again gifted her audience with a remarkably unreliable narrator, in this case a woman whose single-minded focus on professional success blinds her to real danger, and vital truths.\nBy the time Kit has looked away from her microscope long enough to focus on what Diane's presence in the lab really means, Dr. Severin believes she's already hooked her claws into the women's \"young and fat and juicy\" brains. \"I intend to feed off them mercilessly,\" she proclaims. Kit wants her mentor's \"delicious forecast of a life of professional achievement and acclaim,\" and so she allows herself to forget the distant past and the recent past, in which she and Diane became even more entangled. She longs to be like her heroine, Marie Curie — in a dramatized biography of Curie that she reads, the character of Marie says \"My head is so full of plans that it seems aflame.\"\nMegan Abbott's Give Me Your Hand sees heads aflame, more than once. The best part of this slow-burning novel is that just when you think you've seen the explosion, another one happens — and you definitely won't guess the last, no matter what foreshadowing exists.\nBethanne Patrick is a freelance writer and critic who tweets @TheBookMaven.","url":"https://www.npr.org/2018/07/17/628218930/the-science-of-female-anger-and-ambition-in-give-me-your-hand"}
