{"authors":["Emily Mae Czachor"],"date_download":"2018-10-31 01:47:46","date_modify":"2018-10-31 01:47:46","date_publish":"2018-08-27 17:46:23","description":"So, it looks like the Spice Girls are finally, gloriously getting back together. But Victoria Beckham won't be joining the Spice Girls reunion tour, according to a recent report from The Sun. Over the weekend, the newspaper seemed to make most every…","filename":"data/vaneerConsumption/TheSpiceGirlsReunionTourWontIncludeVictoriaBeckhamButTheShowWillGoOnREPORT.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/eb103d7f-373a-44da-a222-977b44df267e-getty-77943096.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-spice-girls-reunion-tour-wont-include-victoria-beckham-but-the-show-will-go-on-report-10246157_1540950466.html","title":"The Spice Girls Reunion Tour Won't Include Victoria Beckham, But The Show Will Go On - REPORT","title_page":"The Spice Girls Reunion Tour Won't Include Victoria Beckham, But The Show Will Go On — REPORT","title_rss":"NULL","source_domain":"bustle.com","text":"So, it looks like the Spice Girls are finally, gloriously getting back together. But Victoria Beckham won't be joining the Spice Girls reunion tour, according to a recent report from The Sun. Over the weekend, the newspaper seemed to make most every Spice fan's wildest dreams come true when it reported that the Spice Girls' long-rumored reunion tour is actually happening — and it's allegedly happening pretty soon. Bustle reached out to representatives for Beckham, Mel B, Geri Horner, Emma Bunton, and Melanie Chisholm for confirmation, but had not received any response at time of publication.\nPer The Sun's report, the powerhouse pop group will take the stage once again sometime next year, courtesy of a 13-date tour around the U.K. No word yet as to the specifics of those dates, and the tour has yet to be confirmed by the iconic group, so eager fans across the pond unfortunately can't purchase a ticket to the reunion show just yet. According to The Sun, pretty much the only concrete tidbit of information we know right now about the Spice Girls' highly anticipated reunion is that it's reportedly set to wrap up with three shows at Wembley Stadium in London. Well, that and the whole Victoria Beckham thing.\nIf the Sun's report is true, then it looks like next year's Spice reunion will be sorely lacking in the Posh department. \"Victoria Beckham will not be performing with her former bandmates,\" the report reads. That said, fans can still rest assured that the rest of the Spice clan — that's Mel B., Geri Horner, Emma Bunton, and Melanie Chisholm, for '90s kids who need a memory jog — will be reuniting for next year's comeback tour, sans Beckham.\nFor those who've been following the summer's chaotic Spice-related proceedings, news of a reunion tour (and Beckham's absence from it) probably doesn't come as too much of a surprise. After all, rumors about some sort of reunion have been flying for several months now. Back in June, Mel B addressed the rumors of a Spice Girls reunion for the first time during an appearance on The Today Show and seemed to confirm that the Spice Girls were indeed getting back together. At least, in some capacity. \"We are touring,\" she said, adding, \"Yes, we are going to be doing performances together for sure.\"\nOn one hand, Mel B's (aka Scary Spice) comments on a future reunion tour were pretty exciting, for obvious reasons. But on the other, they were also a little confusing. Back in February, during an interview with Vogue, Beckham told the publication point-blank, \"I'm not going on tour.\" So, what did that mean for a potential reunion, then?During her Today Show appearance, Mel B also took a second to respond to Beckham's comments about the tour with a quick shut-down. \"She's always saying that. Stop it,\" said Mel B, before seeming to confirm that a reunion for the Spice Girls was, in fact, somewhere on the horizon.\nThen, during an interview with ITV's Loose Women about a month later, in July, Mel B reiterated once again that yes, the Spice Girls are getting back together. \"We are for sure,\" she told the outlet. \"We are getting back together.\" At the time, exactly which OG Spice Girls would be getting back together — and for what, exactly — remained a bit unclear. Still, Mel B's comments to Loose Women suggested pretty plainly that perhaps not all the original bandmates were on board with the whole \"getting back together\" idea.\n\"There's one [Spice Girl] that's being a bit difficult,\" Mel B told Loose Women, though she refrained from naming names. \"But I'm hoping she's going to get roped in.\" Judging by Beckham's reported opposition to a Spice Girls reunion tour in the press, it certainly seems plausible that it might've been Posh Spice who Mel B thought needed a bit more persuading. Unfortunately, if The Sun's report about next year's Spice-y reunion tour does end up proving true, then it sounds like Beckham didn't get roped into the idea the way Mel B might've hoped.\nStill, here's to another round of Spice Girls goodness, Posh or not.","url":"https://www.bustle.com/p/the-spice-girls-reunion-tour-wont-include-victoria-beckham-but-the-show-will-go-on-report-10246157"}
