{"authors":["Shivali Best For Mailonline"],"date_download":"2018-10-23 01:15:16","date_modify":"2018-10-23 01:15:16","date_publish":"2017-04-26 11:20:35","description":"Researchers from Yale University were interested in understanding the physics behind various throwing techniques, from tossing paper into the bin, to bowling in cricket.","filename":"data/vaneerConsumption/Thesciencebehindtheperfectfreethrow.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9ED93A00000578-0-image-a-19_1493200990418.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4446976_The-science-perfect-free-throw_1540257316.html","title":"The science behind the perfect free-throw","title_page":"The science behind the perfect free-throw | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In 1971, Rick Barry shocked crowds during an NBA match when he stepped up to take a free-throw, choosing to shoot underarm.\nWhile his technique was controversial, it was extremely effective, allowing Barry to score 23 consecutive throws.\nA new study has analysed the physics of the perfect throw, and suggests that the underarm free-throw may be the most effective as it is a perfect trade-off between speed and accuracy.\nScroll down for video\nIn 1971, Rick Barry shocked crowds during an NBA match, when he stepped up to take a free-throw, choosing to shoot underarm. While his technique was controversial, it was extremely effective, allowing Barry to score 23 consecutive throws\nSPEED VS ACCURACY One common theory suggests that the faster you throw a ball, the more difficult it is to release it at the exact right time. But the researchers actually found that even if a person is equally good at controlling the release at all speeds, faster throws will be less accurate. But this difference in accuracy happens after the ball is released. When a ball is thrown at speed, it travels in a nearly straight line, so errors in the angle at which it is released are amplified. In contrast, when a ball is thrown slowly, small errors in the angle of release have little effect.\nThrowing fast and accurately is a uniquely human ability that other species struggle to do.\nResearchers from Yale University were interested in understanding the physics behind various throwing techniques, from tossing paper into the bin, to bowling in cricket.\nOne common theory suggests that the faster you throw a ball, the more difficult it is to release it at the exact right time.\nBut Dr Madhusudhan Venkadesan, lead author of the study, said his team's findings actually found that even if a person is equally good at controlling the release at all speeds, faster throws will be less accurate.\nBut this difference in accuracy happens after the ball is released.\nDr Venkadesan said: 'Once you launch the ball, there's nothing you can do.\n'The ball's just going to carry out the consequences of what you did.'\nWhen a ball is thrown at speed, it travels in a nearly straight line, so errors in the angle at which it is released are amplified.\nIn contrast, when a ball is thrown slowly, small errors in the angle of release have little effect.\nDr Venkadesan said: 'What we find is that almost the slowest arc is often the most accurate.\n'We've compared these calculations to published data of people throwing into wastebaskets, we've compared it to a study on dart throwing.'\nDespite these findings, throwing slowly wouldn't work for most baseball pitchers.\nDr Venkadesan added: 'You don't just want to be fast or just accurate, you want to be fast and accurate, and this work tells us that this is particularly challenging.\nDespite these findings, throwing slowly wouldn't work for most baseball pitchers. Pictured is Hector Daniel Rodriguez of Venados de Mazatlan\n'The faster you are, the less accurate you are, so how can we be both?\n'That's a question we're pursuing.'\nAs for the question of whether to throw overarm or underarm, the researchers say this depends on several other factors – including the target's shape, height and distance.\nExperienced dart players, such as Phil Taylor, throw overhand, optimally releasing the dart 17 to 37 degrees before the arm becomes vertical, at a speed of about 5.5 metres/second\nTHROWING WORLD RECORDS Most bullseyes hit with a dart in one minute - 23 Most 'granny style' free-throws made in one minute - 13 Fastest baseball pitch - 105.1 miles/hour (169.14 km/hour) Most free-throws made in an NBA game by player - 28 Furthest throw of a playing card - 65.96 metres (216 ft 4 in) Source: Guinness World Records\nFor example, experienced dart players throw overhand, optimally releasing the dart 17 to 37 degrees before the arm becomes vertical, at a speed of about 5.5 metres/second.\nOn the other hand, if your bin is less than three arm lengths away and below shoulder height, an underhand throw is your best strategy.\nEven without working out such calculations, most people tend to throw in ways close to the mathematically optimal method.\nThe researchers believe this is likely a result of learning through trial and error over our lifetimes.\nOne exception to this, is the underhand free throw in basketball, that Rick Barry set records with in the 1970s.\nIf your bin is less than three arm lengths away and below shoulder height, an underhand throw is your best strategy\nDespite being the most effective technique, it has all but disappeared from professional basketball.\nThe researchers blame its nickname – the 'granny throw'.\nDr Venkadesan added: 'One suspects there are social and cultural reasons you don't see that practiced too often.'","url":"https://www.dailymail.co.uk/sciencetech/article-4446976/The-science-perfect-free-throw.html"}
