{"authors":["Aoife Hanna"],"date_download":"2018-10-31 01:50:28","date_modify":"2018-10-31 01:50:28","date_publish":"2018-09-06 13:21:35","description":"So here's a story from A to Z ya wanna get up for work it's not so easy — one second those are not the lyrics, aren't they? OK, maybe they're not the OG lyrics but they're definitely more than appropriate for the average working gal. Yes, turns out,…","filename":"data/vaneerConsumption/TheSpiceGirlsAreBasicallyMetaphorsForTheDaysOfTheWeekItsActuallyPrettyHelpful.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/7e1f9ab2-dfa8-4f3c-8ca3-66e602a6027f-499876hr-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-spice-girls-are-basically-metaphors-for-the-days-of-the-week-its-actually-pretty-helpful-11770795_1540950628.html","title":"The Spice Girls Are Basically Metaphors For The Days Of The Week & It's Actually Pretty Helpful","title_page":"The Spice Girls Are Basically Metaphors For The Days Of The Week & It's Actually Pretty Helpful","title_rss":"NULL","source_domain":"bustle.com","text":"So here's a story from A to Z ya wanna get up for work it's not so easy — one second those are not the lyrics, aren't they? OK, maybe they're not the OG lyrics but they're definitely more than appropriate for the average working gal. Yes, turns out, grown up life is low-key hard. Don't get me wrong, I don't wanna neg you out, it's full of fun, and joy, and wonder but also, it can be a pain in the butt. So, let's make it more fun, I'm going to explain why the Spice Girls are metaphors for the days of the week. Oh yes, from maudlin Monday to Fri-YAY, there is a Spice Girl for all of that. And what's life without spice? Bland.\nSometimes in life, it's a bit easier when there is a frame work in place for you to copy, but it's 2018 and who the heck wants to subscribe to any boring old patriarchal nonsense frame work. I know I don't. That just sounds ridiculous. Wouldn't you far rather look to the stars when it comes to this stuff? No babes, I am not talking astrology I mean actual real life '90s superstar legends, the Spice Girls.\nWhether it be their name, their essence, or their sassy AF attitude, each of them is uniquely here to get you through that weekly grind. OK, hold on hun, you can do this.\nMonday — Sporty Giphy Monday, oh Monday, you're not the worst of the week but generally, it is hard to love you. Sure as death and taxes (also not so fun), and that one family member who riles you up, the first day back at work after a few days off is always a struggle. But you know what? New week, new you. You are going to start that week like Sporty Spice. Yes, it is actually even proven that Monday is the most common day to start a new healthy regime. Honestly, you're not alone on this. The American Journal Of Preventative Medicine flipping went and proved it didn't they? In a study in 2014 they found that health-related Google searches only go and peak on Monday and Tuesday. After this, they decline steadily, reaching pretty hardcore lows on a Saturday/Sunday (shock) but then climbing back up that tread mill/hill/climbing wall on a Monday.\nTuesday — Baby Giphy Some might say your Tuesday experience may depend on what sort of a weekend you had. I postulate that the second day of the week, which is super early on and post novelty of catching up re: weekend activities with ya work pals, is actually the worst day of them all. Oh yes, terrible Tuesdays are resolutely not the one. For this reason, you need to self-indulge, allow yourself to be vulnerable and get your Baby Spice on. Allow yourself to be cocooned in the arms of your family, friends, and loved ones. Try not to burst into tears at work after spilling coffee all over yourself, probably somewhere Tuesday-ish like the crotch of your trousers. Also, maybe, pizza. You did Sporty yesterday, let yourself Baby today.\nWednesday — Ginger Giphy OK, it's not her name we are emulating here, it's her sassy, strong feminist attitude. Yes, what comes down (Tuesday) must come back up, and this is your time to harness that negative Nancy attitude from Tuesday and use it to make you come out the other side a fighter. I live strongly by the motto \"how do you know a good day if you haven't had a bad one?\" You need bad days to refuel for great days, this is a superpower that you can totally harness RN. Girl Power in all its glory is going to surge from you like a great beam of light because yes, it's hump day, but you are over that hump. Why don't you take this day to do something positive. Wednesday is a perfect day to take up a new hobby or start an excellent new book. You are in the final push towards the end of the week and you are nailing it.\nThursday — Posh Giphy After that surge of Girl Power flowing through your veins you are empowered, strong, and ready to roll into the weekend. Everyone knows that Thursday is the new Friday, so it is like the weekend is kicking off. However, considering it's a school night, it needs to be a considerably more civilised start to the weekend, or should I say, a more Posh start to the weekend? Maybe some excellent self-care, a bit of what you deem to be pampering to get the juices flowing for a pretty lit weekend. Now depending on your glam scale from low (mine) to high (Victoria actual Beckham), this could mean any number of things. Maybe painting your nails? Maybe doing some yoga? Maybe getting low-key dinner and drinks with ya gang? Maybe braless movie watching and red wine with your best mate? Whatever your low-key-lit activity is, make sure it is your version of indulgence because everyone deserves a little bit of Posh-esque luxe every now and again. Am I right?\nFriday/Saturday/Sunday — Scary Giphy OK, work on Friday might well be a bit Scary depending on if your Thursday went a little to the left of Posh, however, who flipping cares. Get your hardcore shoulder-shrug dance moves at the ready, you're about to embody '90s Mel B, aka the wonderful Scary Spice. TGI Friday or TFI Friday, however you want to phrase it, it is about to be next level, lose-your-voice-shouting, two mega lie—ins, and multiple pitchers at Wetherspoons lit. You have worked hard all week, got through the ups and downs the week threw at you, and guess what? Out of office is on, as is your fave outfit and going out perfume. Go out and be your scariest self because you flipping deserve it.","url":"https://www.bustle.com/p/the-spice-girls-are-basically-metaphors-for-the-days-of-the-week-its-actually-pretty-helpful-11770795"}
