{"authors":["Julia Emmanuele"],"date_download":"2018-10-31 01:42:02","date_modify":"2018-10-31 01:42:02","date_publish":"2018-09-14 18:01:06","description":"Sister, Sister, never knew how much everyone missed ya. But luckily, fans might not have to miss the Landry/Campbell family for much longer. On Thursday, actor Jackée Harry shared a photo on Twitter that seems to hint that the Sister, Sister reboot…","filename":"data/vaneerConsumption/TheSisterSisterRebootCouldBeHappeningRightNowAllTheCluesAreOnJackeeHarrysTwitterPHOTO.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/438741bf-678a-4d70-90df-aa8b5fe2f475-getty-176197246.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-sister-sister-reboot-could-be-happening-right-now-all-the-clues-are-on-jackee-harrys-twitter-photo-11920573_1540950122.html","title":"The 'Sister, Sister' Reboot Could Be Happening Right Now & All The Clues Are On Jackee Harry's Twitter - PHOTO","title_page":"The 'Sister, Sister' Reboot Could Be Happening Right Now & All The Clues Are On Jackee Harry's Twitter — PHOTO","title_rss":"NULL","source_domain":"bustle.com","text":"Sister, Sister, never knew how much everyone missed ya. But luckily, fans might not have to miss the Landry/Campbell family for much longer. On Thursday, actor Jackée Harry shared a photo on Twitter that seems to hint that the Sister, Sister reboot could be happening — right now. The actor, who starred as Lisa Landry on the hit sitcom, posted a photo with Tia Mowry-Hardrict and Tim Reid — a.k.a. Tia Landry and Ray Campbell — which seemed to confirm that a Sister, Sister reboot is on its way at last. (Bustle reached out to Harry, Mowry-Hardrict, Reid, and Tamera Mowry-Housley for a comment, but has not heard back.)\nHarry shared a snap of the trio bundled up in winter coats and scarves, along with the caption \"We do our own style, in our own time.. even if that means doing Christmas in 85° September weather.\" Her caption is a reference to the show's iconic theme song (which will now be stuck in your head for the rest of the day — you're welcome), which definitely seems to suggest that whatever she's doing with her old cast-mates, it's Sister, Sister related.\nFor those who weren't fans of the Mowry sisters' breakthrough show, which premiered in 1994 and ran for 6 seasons, Sister, Sister centered around twin girls, Tia and Tamera, who were separated at birth and adopted by single parents, Lisa and Ray. As teenagers, they discovered each others' existence and they and their parents moved in together and formed an unconventional family unit. The sisters were also followed around by their neighbor Roger (a pre-R&B Marques Houston), who had a puppy-dog crush on both twins, and would often climb into their room to hang out, before being banished with the refrain of \"Go home, Roger!\"\nRumors of a reboot for the family sitcom first started swirling back in November, when Mowry-Hardrict told Us Weekly that she was hoping for a reunion, saying, \"My sister and I are taking meetings as we speak, so it’s definitely closer than ever to making this reboot happen. We are being told that they want it to be or happen next year in the fall. So, it’s going by so fast, everything.\"\nIn January, Harry seemed to confirm the rumors when she told Steve Harvey that a revival \"is happening.\" According to Entertainment Weekly, the actress didn't have any definite information about the revival, but did say, \"I’m excited. Tia and Tamera [Mowry] … my babies, too.\"\nHowever, Mowry-Hardrict contradicted Harry's confirmation a few days later, tweeting \"Hey guys! Been seeing loads of tweets about the Sister, Sister, reunion. I hate to say it, but I have no NEW news to report to you. Sis and I have been trying to get this going as we still are, BUUUT no NEW news. Trust, you will hear it from us first if it’s a solid go:).\"\nIn May, her sister, Tamera Mowry-Housley told Wonderwall.com that the twins were still working on making the reboot happen, but that things were on hold for the moment. \"I think timing is everything. With my schedule being so crazy and then, now Tia's schedule is shifted right now. I wouldn't say it's never going to happen, but the focus has shifted right now.\"\nHowever, Harry's post seems to insinuate that something is in the works to bring the cast back together — but it might not be the Sister, Sister reboot fans are hoping for.\nOn Thursday, Reid posted his own version of the selfie, in which he explained that the trio were filming a movie called Family and Faith. \"It only took 18 years, but what great fun to once again work with Jackée and Tia. Missing Tamera,\" Reid captioned the adorable photo. \"Shooting in Salt Lake City, and the film is called, 'Family and Faith,'\" along with the hashtags \"#tvfamily\" and \"#lifeisgood.\" It might not be a Sister, Sister reboot, but it is a reunion. Plus, there's always a chance that Reid could just be trying to throw fans off the scent! (Fans can only hope.)\nSo, while it doesn't appear as if a Sister, Sister reboot is in the works at this moment — and anyway, what would a reboot even be without Tamera and Roger? — that doesn't mean that a revival is completely out of the realm of possibility. After all, both Harry and Mowry-Hardrict have both confirmed that talks about a reboot are happening, so hopefully, '90s kids everywhere won't have to hold out much longer before getting to shout \"Go home Roger!\" at the screen once again.","url":"https://www.bustle.com/p/the-sister-sister-reboot-could-be-happening-right-now-all-the-clues-are-on-jackee-harrys-twitter-photo-11920573"}
