{"authors":["Kristian Wilson"],"date_download":"2018-10-31 01:47:42","date_modify":"2018-10-31 01:47:42","date_publish":"2018-08-27 18:00:53","description":"You may have heard about The Great American Read — the PBS program that highlights the 100 most loved books in the English literary canon. But have you heard that PBS has also enhanced some of those classic novels with travel posters, and their new…","filename":"data/vaneerConsumption/TheseClassicNovelsWereReImaginedAsVintageTravelPostersToCelebratePBSsTheGreatAmericanRead.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/88b78035-cb85-432a-9785-00f07ab718ee-wutheringheights.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_these-classic-novels-were-re-imagined-as-vintage-travel-posters-to-celebrate-pbss-the-great-american-read-10229904_1540950462.html","title":"These Classic Novels Were Re-Imagined As Vintage Travel Posters To Celebrate PBS's \"The Great American Read\"","title_page":"These Classic Novels Were Re-Imagined As Vintage Travel Posters To Celebrate PBS's \"The Great American Read\"","title_rss":"NULL","source_domain":"bustle.com","text":"You may have heard about The Great American Read — the PBS program that highlights the 100 most loved books in the English literary canon. But have you heard that PBS has also enhanced some of those classic novels with travel posters, and their new designs are absolutely stunning? Bustle is pleased to reveal the travel posters for locations in And Then There Were None by Agatha Christie and Wuthering Heights by Emily Brontë below, and there's also five additional posters from The Great American Read for you to check out as well!\nAccording to former PBS Chief Programming Executive Beth Hoppe, The Great American Read is \"a multi-platform, system-wide initiative that explores and celebrates the diversity of thought, perspective and experiences of America through the lens of our most treasured literary classics and contemporary titles.\" The list includes a number of American staples, such as The Color Purple and The Grapes of Wrath, plus Canadian — Anne of Green Gables — and U.K. — The Hitchhiker's Guide to the Galaxy — titles as well.\nFor their travel posters — which would make fantastic book covers, by the way — PBS has selected books with iconic locations, including Alice in Wonderland, Jurassic Park, and Dune. The designs will make anyone want to take a vacation inside these books, even if Soldier Island and the titular Wuthering Heights aren't exactly the most inviting places on Earth.\nCourtesy of PBS\nIn addition to the travel posters, PBS has opened up the option to vote for your favorite book among the 100 titles in The Great American Read. Readers may vote online on the PBS website, or use book-related hashtags on social media. You may also text your hashtag to 97979. An option to vote toll-free via phone will open on Sep. 11. Voting will remain open through Oct. 18 at midnight PT. You can find out more about voting in The Great American Read here.\nCourtesy of PBS\nAs I said earlier, the travel posters for Wuthering Heights and . . . And Then There Were None aren't the only ones PBS has put out for Great American Read titles. I have picked out five great posters for locations in your favorite novels for you to check out below, but you should definitely head over to PBS' Great American Read website to view the full list.\n'A Game of Thrones' by George R.R. Martin\nCourtesy of PBS\nPBS re-imagines King's Landing as Westeros' vacation destination, but the inclusion of the dragon silhouette begs the question: is this an ad from the Targaryens' reign, or from Daenerys' pending assault on the city?\n'The Hunger Games' by Suzanne Collins\nCourtesy of PBS\nThere's more than a bit of bittersweetness to this cheeky poster, because, as any Hunger Games fan knows, visiting the Capitol isn't something just anyone in Panem could do.\n'The Hitchhiker's Guide to the Galaxy' by Douglas Adams\nCourtesy of PBS\nThis travel poster inspired by The Hitchhiker's Guide to the Galaxy contains a number of in-jokes that Douglas Adams fans will love. (Did you spot the thumb hidden in the stars?)\nThe Harry Potter Series by J.K. Rowling\nCourtesy of PBS\nA seven-year vacation to Hogwarts? Sign me up, Potter or no Potter.\n'Nineteen Eighty-Four' by George Orwell\nCourtesy of PBS\nThis eerie poster will send chills down the spine of anyone who has read George Orwell's 1949 novel about a London-based dystopia.","url":"https://www.bustle.com/p/these-classic-novels-were-re-imagined-as-vintage-travel-posters-to-celebrate-pbss-the-great-american-read-10229904"}
