{"authors":["Chloe Coleman","Photo Editor Focusing On International News","Photo Editor"],"date_download":"2018-10-21 02:56:28","date_modify":"2018-10-21 02:56:28","date_publish":"2018-06-18 10:00:44","description":"For the past year and a half, Rory Doyle has been documenting black cowgirls and cowboys in the Mississippi Delta.","filename":"data/vaneerConsumption/ThesecowboysandcowgirlsoftheMississippiDeltadontrideherdtheyrideforfun.json","image_url":"https://www.washingtonpost.com/resizer/jtwI731tRbL5XRz2eWUX31xr7_s=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QOCDUZMZPIZJZH6TFA7JIUVL5E.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_06_18__1540090588.html","title":"These cowboys and cowgirls of the Mississippi Delta don’t ride herd, they ride for fun","title_page":"These cowboys and cowgirls of the Mississippi Delta don’t ride herd, they ride for fun - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Photo editor\nYoung cowboys from Cleveland, Miss., enjoy a ride at dusk outside city limits. (Rory Doyle)\nA young girl waits in a trailer as a group of cowboys and ATV riders prepare for a trail ride in rural Tallahatchie County, Miss. (Rory Doyle)\nFor the past year and a half, Rory Doyle has been documenting cowgirls and cowboys. But this work challenges the stereotype of the culture, removing it from the American West and the romanticization of Hollywood, focusing instead on the daily life of black cowboys in the Mississippi Delta.\nDoyle explained to In Sight how he became immersed in the scene. It began when he attended a rodeo in Greenville, Miss., that celebrated the region’s black cowboy heritage. “Since then, I’ve been photographing black cowboys/cowgirls exclusively in the Mississippi Delta (18 counties in the northwest part of the state). I’ve seen some projects on urban black cowboys in Philly and the bigger groups of black cowboys in Oklahoma, Texas and Louisiana. I’ve yet to see a Delta-centric story.”\nWhen Doyle says “cowboy,” he does not necessarily mean it as a vocation.\n“I use the term cowboy loosely. It’s not like Texas here, where cowboys ranch cattle. A cowboy in the Delta is more about recreation — either as a hobby or competing in a rodeo or horse show. In other words, everyone I’ve photographed has a different day job.”\n“Delta Hill Riders” will be on display in an exhibition curated by Anna Van Lenten at “The Half King Photo Series” in Manhattan, opening June 19.\nA cowboy and ATV driver rise up at a trail ride in Charleston, Miss. (Rory Doyle)\nBria looks back for her friends at a horse show in Charleston, Miss. (Rory Doyle)\nA young cowgirl poses for a portrait at the black heritage rodeo in Greenville, Miss. (Rory Doyle)\nAn elder cowboy named Rogers pauses for a break after practicing training skills with his grandson Javaris in Renova, Miss. (Rory Doyle)\nAfternoon light shines on a customized trailer with horse patterns in Bolivar County, Miss. (Rory Doyle)\nA cowboy named Archie rides his horse in a pig pen in Indianola, Miss. (Rory Doyle)\nHorses wait in a makeshift parking lot before a sunset horse show at Smith Farm in Charleston, Miss. (Rory Doyle)\nYoung cowboys dance atop their horses in a McDonald’s parking lot in Cleveland, Miss. (Rory Doyle)\nA cowboy named Gee rides his horse backward in Charleston, Miss. (Rory Doyle)\nRogers Beamon and his grandson Javaris pose for a portrait after the 2017 Christmas parade in Cleveland, Miss. (Rory Doyle)\nJoe “Dancing Cowboy” Wrenn and his wife, Barbara, take the dance floor at the Valentine’s Day dance at Club Black Castle in Ruleville, Miss. (Rory Doyle)\nFrank Simpson’s cowboy hat sits atop a lamp at his home in Shelby, Miss. (Rory Doyle)\nMore on In Sight:\nMeet the female pro wrestlers of Mexico\nThey look back with blue eyes or brown eyes or no eyes at all: Glimpses of the Island of the Dolls in Mexico City\nA photographer finds resilience in the youth of Venezuela amid crisis and chaos\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/06/18/the-cowboys-and-cowgirls-of-the-mississippi-delta/"}
