{"authors":["Amanda Chatel"],"date_download":"2018-10-31 01:38:13","date_modify":"2018-10-31 01:38:13","date_publish":"2018-09-14 21:03:51","description":"When we think about the zodiac signs that are most compatible, it's often in the context of romantic relationships. But what about our other relationships? Which zodiac signs make the best friends?\n\"When it comes to everyday relationships — those we…","filename":"data/vaneerConsumption/TheseAreTheMostCompatibleZodiacSignsAsFriends.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/b93d7d66-129e-4ca6-9081-cfb5f7439432-stock_ab-0229.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_these-are-the-most-compatible-zodiac-signs-as-friends-11916108_1540949893.html","title":"These Are The Most Compatible Zodiac Signs As Friends","title_page":"These Are The Most Compatible Zodiac Signs As Friends","title_rss":"NULL","source_domain":"bustle.com","text":"When we think about the zodiac signs that are most compatible, it's often in the context of romantic relationships. But what about our other relationships? Which zodiac signs make the best friends?\n\"When it comes to everyday relationships — those we work with, chum up with, or just have daily contact with — we find something out very quickly that we either click or we don't,\" astrologer and psychic, Cindy Mckean, tells Bustle. \"While astrology is popular for helping you discover more about yourself and sharing romantic compatibility, it also extends to other areas of life including friendship compatibility. In astrology, 'favorable' connections between two people can make a pair more dynamic and get along better.\"\nAlthough there's no guarantee that, if you're a Libra, you're going to be BFF with every Aquarius or Gemini who comes your way, there's still something to be said about how the stars affect our friendships. \"There's more to making friends than just one factor,\" says Mckean, \"but looking at your compatibility can help you determine who is likely to be compatible as friends based on your zodiac sign.\"\nHere are the most compatible zodiac signs when it comes to being friends, according to McKean.\nAries (March 21 - April 19): Libra Tina Gong for Bustle \"Your ideal friend is going to need a high amount of energy,\" says Mckean. \"As the first sign of the western zodiac, your energy levels are always going to be high with a quick recovery time when you need to rest. Being a fire element, you're going to get along with other fire signs Leo and Sagittarius. Aries also get along well with air signs Gemini and Aquarius.\" As for another potential friendship connection, Aries, you just might find one in Libra — or not. According to Mckean, when it comes to Aries and Libra, there's no middle ground: you'll either complement each other or clash. But when you do find someone you connect with, it's your enthusiasm that's the best part about being friends with you. Although Mckean warns to be wary of being impatient or self-centered.\nTaurus (April 20 - May 20) Tina Gong for Bustle Although you're known for being dependable and generous, Taurus, you can also be stubborn (hello, bull!) and lean toward being possessive, even with your friends. While this is the case, you'll still find friendships in other earth signs like Virgo and Capricorn. \"Cancer and Pisces will flow well with you too,\" says Mckean. \"Cancer may have the same values as you and accommodating Pisces enjoys your rock-steadiness.\" When it comes to a maybe it will work, maybe it won't friendship, that would be Scorpio. \"Scorpio will either complement or clash with you,\" says Mckean, \"but they're a safe bet as a friend so long both of you can give each other more leeway.\"\nGemini (May 21 - June 20) Tina Gong for Bustle When it comes to friendships, Gemini, your ability to adapt gives you the chance to have connections with more than a few zodiac signs. \"As an air element, communication is essential for you, so other air signs such as Libra and Aquarius are going to keep the conversations, thoughts, and ideas flowing in your friendships with them,\" says Mckean. \"Geminis like excitement and you can get that with Aries and Leo. Sagittarius will either complement or clash with you, but you'll both naturally deal with each other in small doses.\" But where you sort of, well, suck as a friend is your need for a good time all the time. According to Mckean, this could lead you to canceling plans if something better and more exciting comes along.\nCancer (June 21 - July 22) Tina Gong for Bustle Cancers may be sensitive, but sometimes they're a bit shy about opening up and really letting their feelings show. Mckean suggests reminding yourself, Cancer, that that's what friend are for — to be there for you. Also, your fellow water signs are right there with you in understanding your sensitivity. \"Fellow signs that are also water elements, Scorpio and Pisces, will get you without any words being exchanged,\" says Mckean. \"You'll also get along well with Taurus and Virgo as they'll share a lot of the same values as you do. While you might hit it off with a Capricorn, they won't understand your changing moods and that might hurt your feelings.\" Cancer, it's normal to be emotional and have feelings. So if a friend can't handle that part of you, let them go... because that part of you isn't going anywhere.\nLeo (July 23 - August 22) Tina Gong for Bustle Ultimately, Leo is looking for friends who enhance all the things they think are so great about themselves. But fellow fire signs, Aries and Sagittarius are right there to deliver. \"You'll also get along very well with Gemini and Libra because of your sense of style and confidence,\" says Mckean. \"You might find it difficult to get along with an Aquarius, your polar opposite on the zodiac wheel, but they can also provide fresh insight you need.\"\nVirgo (August 23 - September 22) Tina Gong for Bustle \"Always one that enjoys a routine, you will get along well with fellow earth elements,\" says Mckean. \"Your ability to predict Taurus' steady choices will be comforting. Capricorn's pragmatism aligns well with yours. With your careful approach and tendency to look before you leap, you'll get along well with Cancer and Scorpio as they do the same.\" Where you might find an issue, Virgo, will be in Pisces, as they're the polar opposite of you on the zodiac. But that doesn't mean you should run out and ditch every Pisces you know. It means your friendship might require more work than your other friendships.\nLibra (September 23 - October 22) Tina Gong for Bustle Even if there isn't a friendship connection, Libras really enjoy being liked by everyone — even if they don't necessarily like that person back. But when it does come to their friends, they're great communicators because they're ruled by Venus. \"Libras will get along with Gemini and Aquarius, fellow air signs that can keep a conversation going,\" says Mckean. \"They'll also get along well with Leo, sharing a love of trends, and Sagittarius, because of the positive energy they have with Libra. Though they'll get along with Aries... Aries also likes to have their way and would be assertive about it.\" Libras often need friends to step in and make a decision for them, because making up their mind isn't their strong suit. Interestingly, the assertiveness of Aries can help a lot here.\nScorpio (October 23 - November 21) Tina Gong for Bustle Although you play it close to the chest, when it comes to your feelings so you don't rock the boat, nothing throws you for a loop quite like shallow people. You truly have no time for them. \"Fellow water element signs such as Cancer and Pisces won't need you to explain that to them and will understand how you feel,\" says Mckean. \"Virgos aren't one to make waves and a good friend for that reason. Capricorn's pragmatic approach towards goals is something you'd admire and they will admire your strength.\" But where you can go the deepest with a friendship is with Taurus. \"Taurus and you can go deeper together than any other zodiac pair, but be very careful of what you wish for,\" says McKean. \"Unmonitored, the combination of you two as friends can take you out of this world or to the lowest dredges.\"\nSagittarius (November 22 - December 21) Tina Gong for Bustle \"Always seeking to go beyond the horizon, your sense of adventure will fare very well with fellow fire element signs Aries and Leo,\" says McKean. \"As an added plus, even if they don't go as far as you do with your adventures, none of you hold it against the other when you follow your own paths — as a matter of fact, you all gleefully celebrate each other's choices.\" Libra and Aquarius, too, make for good friends of Sagittarius. The latter, similar to Aries and Leo, really appreciates Sagittarius' willingness to push boundaries and try new things. \"The one thing Sagittarius has to be aware of is their frankness,\" says Mckean. \"While truth is beautiful, sometimes it's better to keep it to yourself.\"\nCapricorn (December 22 - January 19) Tina Gong for Bustle \"Efficiency and economy are key pillars in the life of a Capricorn,\" says Mckean. \"Therefore, people that also have those qualities as key pillars in their lives are a great practical combination for the Capricorn. Namely, fellow earth element signs Taurus and Virgo will naturally be aligned with those pragmatic ideals.\" But because, like all zodiac signs, Capricorn has multiple qualities, they can also find friendships with Scorpio, Pisces, and even Cancer — in limited doses. \"Scorpio can easily match their intensity towards goals and Pisces is a friend that brings calmness to Capricorns,\" says Mckean. \"While Cancer can help bring balance to their rigid side, the emotional spectrum Cancers are comfortable expressing are too colorful for the monochrome preference Capricorn works best with.\" Also, if you're a Capricorn or friends with a Capricorn, know that the fun side is still to come. \"Capricorns are known for reverse aging,\" says Mckean. \"While younger, they'll be serious, but as they get older, they're more carefree.\" They're also known to really look out for their friends, even if they're sometimes regarded as bossy.\nAquarius (January 20 - February 18) Tina Gong for Bustle \"In the eyes of Aquarius, everyone is their friend,\" says Mckean. \"This is because they view everyone as equals. In their eyes, we're all humans, thus nothing should stand in the way of being friends. ... As an air element, they'll get along well with other air element signs Gemini and Libra. They'll also get along well with Aries, as they enjoy the Aries' fresh energy, and Sagittarius as they appreciate their will to step outside their comfort zones.\" But, on the flip side, Aquarius is known for their black and white perspectives, which can be a problem when it comes to Taurus, Leo, and Scorpio. \"Aquarius may be called to be more emotionally involved, but their emotional detachment sets them apart as the most objective sign in the zodiac, a quality anyone can use in a friend,\" says Mckean.","url":"https://www.bustle.com/p/these-are-the-most-compatible-zodiac-signs-as-friends-11916108"}
