{"authors":["Johnny Brayson"],"date_download":"2018-10-31 01:45:34","date_modify":"2018-10-31 01:45:34","date_publish":"2018-09-06 17:00:53","description":"Netflix is uniting two of its homegrown all-stars in one of the streaming site's latest original films, Sierra Burgess Is a Loser. The new comedy unites Stranger Things fan favorite Shannon Purser of \"Justice for Barb\" fame, and recent internet…","filename":"data/vaneerConsumption/TheSierraBurgessIsALoserSoundtrackShowsOffShannonPursersHiddenTalent.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/17e6b33d-fff5-4c0f-974f-342853cc6c13-sierra-burgess-is-a-loser-movie-photo-1533237372.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-sierra-burgess-is-a-loser-soundtrack-shows-off-shannon-pursers-hidden-talent-10883445_1540950334.html","title":"The 'Sierra Burgess Is A Loser' Soundtrack Shows Off Shannon Purser's Hidden Talent","title_page":"The 'Sierra Burgess Is A Loser' Soundtrack Shows Off Shannon Purser's Hidden Talent","title_rss":"NULL","source_domain":"bustle.com","text":"Netflix is uniting two of its homegrown all-stars in one of the streaming site's latest original films, Sierra Burgess Is a Loser. The new comedy unites Stranger Things fan favorite Shannon Purser of \"Justice for Barb\" fame, and recent internet phenom Noah Centineo, fresh off his breakout performance as Peter K. in To All the Boys I've Loved Before. But its two streaming stars aren't all the new film has going for it because the Sierra Burgess Is a Loser soundtrack is also one of the most exciting and surprising movie playlists to hit the charts this year.\nNetflix movies have never really been known for their soundtracks, but this film is an exception in a big way. Some of the hottest up-and-comers in music today lent their talents to the film's track list, including Allie X, Sabrina Carpenter, and Leland. Speaking of Leland, he also executive produced the soundtrack and co-scored the movie along with film composer Bram Inscore, according to billboard.com's Rania Aniftos. This marks the first time that Leland, who was previously best known for his work on RuPaul's Drag Race or for his collaborations with other artists like Troye Sivan (who co-wrote three of the film's songs), has scored a motion picture.\nNetflix on YouTube\nYou can check out the full track list for the film's soundtrack below:\n\"The Other Side\" - Betty Who \"Lights\" - Leland \"Kid Wonder\" - Allie X \"Half of You\" - MNEK \"The Phone Call\" (score from the motion picture) \"Lie for Love\" - Sabrina Carpenter \"Sunflower (Movie Version)\" - Shannon Purser \"Latitude\" - Leland \"Sunflower (Synth Reprise)\" - Allie X \"I Don’t Change\" - K.I.D \"Middle of Love\" - Leland and Vincint \"The Parking Lot\" (score from the motion picture) \"Paper Love\" - Allie X \"Goodbye\" - Carlie Hanson\nPerhaps the biggest surprise on the track list is that Purser herself performs a song, implying that the film has at least a somewhat musical bent. The movie is a modern adaptation of the classic, non-musical play Cyrano de Bergerac (hence the character's name Sierra Burgess). Both stories revolve around unrequited love and mistaken identity, with Purser's Burgess, the biggest loser in school, funneling her personality and words through the school's most popular cheerleader (Kristine Froseth) to get her crush (Centineo) to fall in love with her — something that's rightly called out as \"catfishing\" in the film, a term that didn't exist in 1897 when the original play was written. It's not clear if Purser actually sings her song within the film itself or if the track simply plays during the film without her character singing on screen. What is clear, though, is that Purser actually has some pipes, which she has shown off before on social media.\nAs far as the actual songs from the film go though, you can't listen to them all just yet. The soundtrack's first single, Betty Who's \"The Other Side,\" was released on Aug 31, but the rest of the soundtrack won't be available for purchase or download until Sept 7 — the same day that Sierra Burgess Is a Loser arrives on Netflix. Until then, you'll just have to make do with Purser's Twitter posts.","url":"https://www.bustle.com/p/the-sierra-burgess-is-a-loser-soundtrack-shows-off-shannon-pursers-hidden-talent-10883445"}
