{"authors":["Abc News","More Genevieve"],"date_download":"2018-10-30 00:55:30","date_modify":"2018-10-30 00:55:30","date_publish":"2018-10-29 08:09:22","description":"It's been shared almost half a million times.","filename":"data/vaneerConsumption/Thestorybehindtheviralphotoofmancradlingbabythatsbeensharedaroundtheworld.json","image_url":"https://s.abcnews.com/images/GMA/man-holds-baby-for-mom-ht-jef-181026_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/GMA_Family_story-viral-photo-shared-world_story_id=58823633_1540860930.html","title":"The story behind the viral photo of man cradling baby that's been shared around the world","title_page":"The story behind the viral photo of man cradling baby that's been shared around the world - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"It's the photo seen 'round the world.\nInterested in Be Inspired? Add Be Inspired as an interest to stay up to date on the latest Be Inspired news, video, and analysis from ABC News. Add Interest\nIt seems simple enough: A woman in an office, filling out forms. A man, sitting next to her, holds her baby while she does so.\nBut for some reason, this seemingly simple photo has touched people everywhere. It's been shared almost half a million times on Facebook in just a few short days.\nNatasha Crittenden Wilson\nNatasha Wilson of Florence, Alabama, was the person who snapped the now-viral shot. She originally covered up the woman's face in the photo because Wilson didn't know her.\n\"I was sitting in the waiting room at the doctor's office, a lady walked in with a sleeping baby on her shoulder,\" Wilson told \"Good Morning America.\"\nThe woman, Wilson said, was trying to figure out how to hold the baby and do the paperwork at the same time.\n\"That's when this gentleman from across the room spoke up and said, 'Ma'am, would you like for me to hold that baby for you while you do that?' The mother smiled with relief and answered, 'That would be wonderful!'\"\nWilson told \"GMA\" the gentleman \"went over and picked up the sleeping baby and sat and hummed to him and rocked him until he was called back to his room. This was something I had never witnessed in my life. I have seven of my own children and people just don't normally offer help anymore to someone they don't know.\"\nThe woman in the photo, eventually identified as Jade West, is black. The baby is Jayce Billings. The man who held him is Joe Hale, who is white.\n\"I felt relieved and appreciated at the fact that he wanted to help, he seemed really genuine,\" West told \"GMA\" of Hale. \"He talked about how he never stops being a 'paw paw' and how he loved kids and just about my baby in general! He was literally just loving on him and talking to him as if he was his own grandchild and had known him his whole life. He was just the sweetest.\"\nWilson said she wishes people would see people for people and not color.\n\"For a stranger, a white man at that, asking a young black mother if he could hold her baby to help her out, then the way he loved on that baby like it was his own, it almost puts me to tears every time I think about the love you could see radiate from him for that baby,\" she said.\nWest said while it's OK for people to think differently, it's important we take care of one another.\n\"I want people to know that, yes, everyone is different; yes, we all have our own opinions and ways of doing things. But when you come across a person with a genuine spirit of caring like the one that I encountered that day, all judgments and prejudices are immediately departed from,\" she said.\n\"I just hope people can see this and realize that we can all come together,\" Wilson said. \"Regardless of skin color, we are all just human and can love one another! I truly believe that if each one of us do our part and teach our children that color doesn't exist, our next generation could be colorblind.\"","url":"https://abcnews.go.com/GMA/Family/story-viral-photo-shared-world/story?id=58823633"}
