{"authors":["Associated Press","Mary Kekatos For Dailymail.Com"],"date_download":"2018-10-23 03:35:48","date_modify":"2018-10-23 03:35:48","date_publish":"2017-04-26 15:03:22","description":"Public health officials have revealed that a superbug - Candida auris, a harmful yeast - is on the CDC's radar after spreading to US hospitals, particularly in New York and New Jersey.","filename":"data/vaneerConsumption/ThescariestsuperbugonCDCsradarisadeadlyfungus.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F9FF4B200000578-0-image-a-2_1493213403220.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4447772_The-scariest-superbug-CDC-s-radar-deadly-fungus_1540265748.html","title":"The scariest superbug on CDC's radar is a deadly fungus","title_page":"The scariest superbug on CDC's radar is a deadly fungus | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A new 'superbug' fungus is sweeping the East Coast of America - and CDC officials warn it is the deadliest on their radar at the moment.\nCandida auris, a harmful form of yeast, is emerging as a new menace, mostly in New York and New Jersey.\nFirst identified in Japan in 2009, the fungus has spread to more than twelve countries around the globe.\nThe US has identified 66 cases since 2013, with increasing frequency.\nHealth officials sounded alarms last year because two of the three kinds of commonly used antifungal drugs had little effect in treatment.\nCandida auris, a harmful form of yeast, is the latest superbug on the CDC's radar after dozens of cases broke out in hospitals in New York and New Jersey\nCases of the superbug were first reported in the US in 2013, but most of the 66 incidences were reported last year.\nWhat also makes the fungus so dangerous is that its difficult to recognize and is often misidentified as other related yeasts - many might not determine that they actually have a serious infection on hand.\n'It's acting like a superbug' bacteria, said Dr Paige Armstrong of the Centers for Disease Control and Prevention.\nWHAT IS C AURIS? Candida auris (C auris) is a harmful form of yeast, identified by the CDC as a 'superbug' fungus. It tends to be diagnosed in patients after they've been in hospitals for several weeks. The fungus can infect wounds, ears and the bloodstream and take root in the urinary tract. The source of the infection for C auris isn’t the person who got sick but rather the hospital environment, including catheters, counters, and other surfaces. It was first identified in Japan in 2009 and has since spread to more than a dozen countries worldwide. Two of the three kinds of commonly used antifungal drugs have had little effect in treatment. About 60 percent of those who've been infected with C auris have died.\nThe fungus has been found on surfaces in hospital rooms and on the skin of nurses and patients - even after patients were treated with antifungal medications.\nThe most vulnerable to the superbug are fragile hospital patients, particularly newborns and the elderly.\nIt tends to be diagnosed in patients after they've been in hospitals for several weeks. The fungus can infect wounds, ears and the bloodstream and take root in the urinary tract.\nUS clinicians have been warned to watch for the fungus in hospitals. Patients who have undergone recent surgery, used central venous catheters, or been hospitalized for lengthy periods, as well as those with diabetes, are particularly at risk.\nAbout 60 percent of those who've been infected with C auris have died, the CDC said.\nThe agency warned US hospitals in June 2016, and again in November, to begin watching for the pathogen because of how differently it behaves from other fungal infections.\nAside from one case in Rochester, all were in New York City, at 15 hospitals and a doctor's office. No site has had more than six cases.\nSeventeen New York patients have died, but state officials say everyone infected had other illnesses and the fungus was not necessarily the cause of death.\nNew Jersey has had 15 cases, and there have been four in Illinois as well as one case each in Indiana, Maryland and Massachusetts, according to the CDC.","url":"https://www.dailymail.co.uk/health/article-4447772/The-scariest-superbug-CDC-s-radar-deadly-fungus.html"}
