{"authors":[],"date_download":"2018-10-30 19:53:49","date_modify":"2018-10-30 19:53:49","date_publish":"2017-03-21 19:04:00","description":"Atlanta real estate is on the rise, says RE/MAX Georgia. The real estate agency has listed its top spots of where to live in metro Atlanta.","filename":"data/vaneerConsumption/ThesearemetroAtlantasrealestatehotspotsin2017saysREMAX.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/AP_Top_News/2017/03/16/Images/cd60005c151c435a82ebead919d2ed6c.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_real-estate_these-_0c25efc1ab69a906ddd5559e5efce445__1540929229.html","title":"These are metro Atlanta's real estate hotspots in 2017, says RE/MAX","title_page":"These are metro Atlanta's real estate hotspots in 2017, says RE/MAX","title_rss":"NULL","source_domain":"ajc.com","text":"Where do people want to live in metro Atlanta these days?\nRE/MAX Georgia claims its analysis has answered just that.\nThe study uses First Multiple Listing Service data to determine which cities will be most in demand in 2017. The cities are in Cobb, DeKalb, Forsyth and north Fulton counties.\nThe Braves’ SunTrust Park weeks before first pitch (Hyosub Shin/AJC)\n“Atlanta’s housing market was strong throughout 2016 and shows no signs of slowing down,” Susan Goiser, region vice president of RE/MAX Georgia, said in a news release.\nThe top city was Smyrna, which RE/MAX described as “an excellent option for younger buyers with its diverse neighborhoods.”\nSmyrna’s median home sale price jumped 10 percent from $292,000 in 2015 to $320,375 in 2016, according to RE/MAX’s findings. In 2015, a home stayed on the market an average of 50 days, compared to 45 days the year after.\nThere’s a reason for all that.\n“The development of nearby SunTrust Park makes Smyrna very appealing to younger buyers looking to stay close to the city,” said Kristen Jones, owner of real estate agency RE/MAX Around Atlanta.\nNext up is Chamblee, which describes itself on its website as a “vibrant urban city with a diverse community and international flair.”\nApparently homes there barely hit the market before being snatched up.\nChamblee homes in 2015 stayed on the market 40 days, according to RE/MAX. In 2016, homes on average weren’t there 25 days after being put up for sale. That’s a 38 percent difference.\nThe redevelopment of the General Motors assembly plant in the city is a major factor, Jones said.\nThird is Cumming, which RE/MAX said has a “small-town feel” while still offering goodies for young families like a water park and fairgrounds.\nThe median home sale price was $307,725 in 2016, which is up eight percent from $284,177 the year before.\n“Families continue to flock north and head to Cumming for great schools as well as more home/property for the money,” Jones said.\nThe fourth and final city recognized by RE/MAX is in north Fulton.\n“Alpharetta is home to world-class dining, must-visit concerts, and endless parks and outdoor recreation. Expect to see Alpharetta’s growth continue rapidly in 2017,” said Tim Meek, a RE/MAX agent, in a news release.\nIn 2015, Alpharetta’s median price was $366,250 compared to $384,475 in 2016.\n“We expect continued growth in each of these cities as buyer demand increases throughout the coming year,” Gosier said.","url":"https://www.ajc.com/business/real-estate/these-are-the-hottest-real-estate-markets-metro-atlanta-per-max/mzYc9JV2FERo2t55PQ9QWM/"}
