{"authors":[],"date_download":"2018-10-30 14:17:58","date_modify":"2018-10-30 14:17:58","date_publish":"2016-07-13 00:00:00","description":null,"filename":"data/vaneerConsumption/TheslickandthesleazyhandmaidensofObama.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_07_the_slick_and_the_sleazy_handmaidens_of_obama_1540909078.html","title":"The slick and the sleazy handmaidens of Obama","title_page":"The slick and the sleazy handmaidens of Obama","title_rss":"NULL","source_domain":"americanthinker.com","text":"The slick and the sleazy handmaidens of Obama\nEric Holder is a bad guy. He is a far-left racist ideologue who never should have been our attorney general. He did significant harm to the nation. He refused to prosecute the Black Panthers, who clearly intimidated white voters during the 2008 election, giving them carte blanche to continue their bad acts. He refused to admit the administration's role in the Fast and Furious gun-running scheme. That plan was apparently purposefully to let thousands of guns be sold illegally to the Mexican cartels via straw purchasers, knowing they would be used to slaughter innocents, and then to blame those deaths on American gun laxity. The ultimate goal? To strip Americans of their guns by convincing voters that our Second Amendment is responsible for gun deaths around the world. Holder declared that his DOJ would prosecute no blacks for crimes like voter intimidation. His prevailing rule was that blacks could not possibly be racist because they have no institutional power. Threaten voters at a polling place? Go for it. OK with Holder and Obama. That is how racist they are. That scandal was the tip of the Holder iceberg. He was appalling at every turn.\nHolder is gone; Loretta Lynch is the new A.G. Many of us hoped that she would be a different kind of A.G. She had a great reputation even though she had been appointed by Bill Clinton as a U.S. attorney. We hoped she would actually adhere to the Constitution. We were sadly mistaken. She is even more beholden to the far left than Holder. She is putty in the hands of Obama. She will go to the ends of the earth to do his bidding, no matter the cost to her reputation, her ethics, her soul. She has been bought and paid for, her tarmac meeting with Bill Clinton being the ultimate proof. Her appearance on Tuesday before the House Judiciary committee proved this once and for all; she is an agent of the corrupt left. She answered no questions in that silky voice that kept deflecting the questions to Comey. She is a slick piece of work. Whatever her \"handlers\" require, she will do. She is bereft of character. She is Holder's, and Obama's, handmaiden. She does what she is told and does it well. The country and the Constitution are not her concerns; keeping her job is her aim. She is wholly without honor, a sad commentary on the character of our \"betters.\" Lynch has mind-numbingly absolved Hillary Clinton of her proven crimes by endlessly deferring to the FBI investigation, and to what end? Everyone knows that Hillary is guilty of numerous national security breaches that have put the nation at risk and that she did it to enrich herself. She sells access and secrets for money. Some people care about her lack of ethics. Too many people do not care one bit. They know she is sleazy but will vote for her anyway. She may well become president, and Lynch will retain her job as A.G. And America will be ten steps farther into banana republic territory. President Obama chooses his underlings well. He knows who will operate at his behest. He does not need to give them explicit orders. They know what is expected of them. Think Lois Lerner. Lynch knew what she was doing when she refused to answer questions seventy-four times on Tuesday. She knows she will suffer no consequences, that she will likely keep her job. These are precarious times. With people like Holder, Lynch, Kerry, Jeh Johnson, Jim Hanson, James Clapper, Ash Carter, Samantha Power, Susan Rice, Thomas Perez, Gina McCarthy, Sally Jewel, Penny Pritzker, etc., we are a nation under siege. Each of these people is a totalitarian at heart. If they prevail, America is over.","url":"https://www.americanthinker.com/blog/2016/07/the_slick_and_the_sleazy_handmaidens_of_obama.html"}
