{"authors":[],"date_download":"2018-10-30 01:21:07","date_modify":"2018-10-30 01:21:07","date_publish":"2018-09-10 00:05:19","description":"Last month, protesters at the University of North Carolina in Chapel Hill, took it upon themselves to pull down a controversial 1913 memorial to alumni killed in the Civil War. The university carted the bronze soldier away on a flatbed truck in the rainy night to a still secret location.","filename":"data/vaneerConsumption/TheSilentSamImpasseGrowsatUNC.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/1024px-2018-08-20_Silent_Sam_removed_from_pedestal_08.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862467.html","title":"The ‘Silent Sam’ Impasse Grows at UNC","title_page":"The ‘Silent Sam’ Impasse Grows at UNCThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Last month, protesters at the University of North Carolina in Chapel Hill took it upon themselves to pull down a controversial 1913 memorial to alumni killed in the Civil War. The university carted the bronze soldier away on a flatbed truck in the rainy night to a still secret location.\nThe statue, called “Silent Sam,” has long polarized one of the nation’s finest universities. Many students and professors think it is a testament to white supremacy, a symbol of racism, and toxic reminder of past American evils. Confederate flag wavers and rowdies from off-campus in the dozens have clustered around Silent Sam on and off for months, while protesters chant and dance, with police trying to keep the forces apart.\nThose who oversee the state university system and many state legislators did not like the campus vandalism. President Margaret Spellings and board of governors chairman Harry Smith called what happened “unacceptable, dangerous and incomprehensible.” Such “mob rule and the intentional destruction of public property,” they declared, “will not be tolerated.”\nOr will it? UNC has not yet decided what to do. Chapel Hill chancellor Carol Folt has made it clear that she doesn’t want the statue to return to the center of campus, which is what some state officials want. About 450 University of North Carolina faculty members have sent a letter to Folt and other campus officers, insisting UNC not restore the monument to its former place and that it also dismiss charges against acts — they argue — of civil disobedience, not mob rule.\nMany professors, reportedly including Folt, would like the memorial never to return. In an open letter, 59 black faculty members declared:\nA monument to white supremacy, steeped in a history of violence against Black people, and that continues to attract white supremacists, creates a racially hostile work environment and diminishes the University’s reputation worldwide. For us, arguments of moral equivalency are extremely problematic; there are not two morally valid sides to the history the monument represents.… To reinstall the Confederate monument to any location on UNC’s campus is to herald for the nation and for the world that UNC is not a welcoming place for black people.\nSo opens the 2018-19 academic year. As UNC departments meet for the first time after summer break, the subject is not curriculum or instruction, beauty or truth, but something far more dear to faculty activists: the phantom of white supremacy and racism.\nThe Department of English and Comparative Literature wants to “remove the statue to a place where it could be properly contextualized.” To explain its dictum, it states: “Our department’s educational mission is to study and critique the rhetoric, construction, and historical and social context of our cultural narratives in all of their complexity.”\nHow dreary. To think, reading this department statement, that human enrichment and exposition of character from great literature — from Plutarch to T.S. Eliot and Tom Stoppard, say — was what these faculties were created to do. (It is also an exhibit of why college and university humanities enrollments are plunging, a subject for another day.)\nThe Department of History says that the “continued presence of the monument in its current location is a threat to the safety of the people of our university and a daily affront.” UNC historians evidently do not contextualize. They do not stop to think that the 1913 memorial and countless others like it in the North and South reflected a national effort to honor the dead and heal trauma induced half-a-century earlier by the War between the States. “Moved to an appropriate place, the ‘Silent Sam’ monument can become a useful historical artifact,” say the UNC historians, perhaps as an atonement shrine for the ascriptively challenged, who can be sure?\nNot to be outdone, Women’s and Gender Studies plays its identity card. “As feminists, we wish to emphasize that ‘Silent Sam’ also celebrated men’s violence against women,” it states, projecting the memorial embodies “racist ideology that black people are less than human, the sexist ideology that women who deviate from idealized femininity deserve punishment, and the racist-sexist ideology that denies black women, and by extension all women of color, the right to exist at all.”\nAllying itself with Real Silent Sam Coalition, a militant black group whose Facebook page is #KickOutTheKKK, the Department of Anthropology “seeks to confront the racist histories of the memorials commemorating white supremacy on campus,” As acting director of the Center for Jewish Studies, anthropologist Michele Rivkin-Fish implored officials directly to “repudiate the values of those who established the Confederate Monument on UNC Campus as an homage to the ‘white race.’” Rivkin-Fish urges her colleagues “to commit to helping end the ongoing racism that marks our university and society, from the racial achievement gap to the murderous acts of white nationalists.”\nDoctoral-level virtue-signaling and revolutionary theater are having a field day in Chapel Hill. Activist professors — estranged from fields of studies created expressly to elucidate the best of what is thought and said — find salvation in partisan causes. Their interest in arts and letters is vehicular. Silent Sam’s infamy is what fills their heads.\nTenured activists at UNC and other campuses want the world to know they are moral cynosures. They picture themselves noble and alive at the barricades, the wind blowing in their hair — when we were young, my dear, and the times are a-changing, but here we are, still woke, passing the baton to a younger generation of angries.\nMany reasonable UNC faculty of course realize what a harmful distraction Silent Sam has become. Why not place the statue in the university-owned old Chapel Hill cemetery on the edge of campus, some ask, a quiet, beautiful, and largely forgotten place, requiescat in pace. (It turns out the North Carolina legislature, anticipating such a fiasco, passed a law prohibiting removal of state monuments to cemeteries or museums — effectively keeping monuments in place.) But resolution is not what Confederate flag wavers or activists want. They don’t seek campus harmony. They want the fire next time — and a spot on the evening news.\nThe war on historical monuments has less to do with esthetics or history than it does with the question of who will dominate the present. Ultimately it’s about power — and who will leverage the past to overpower opponents and adversaries.","url":"https://spectator.org/the-silent-sam-impasse-grows-at-unc/"}
