{"authors":["Sarah Friedmann"],"date_download":"2018-10-31 01:52:46","date_modify":"2018-10-31 01:52:46","date_publish":"2018-09-06 03:58:15","description":"When Donald Trump won the presidency, his adult children were thrust further into the limelight — and people started paying even closer attention to their every word and action. While much of this attention has centered on Trump's daughter, Ivanka,…","filename":"data/vaneerConsumption/TheseEricTrumpQuotesAboutHisDadShowHesGotHisBackThroughThickThin.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/621bb446-b531-43ff-bd89-01c1b1870192-getty-585212670.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_these-eric-trump-quotes-about-his-dad-show-hes-got-his-back-through-thick-thin-10182318_1540950766.html","title":"These Eric Trump Quotes About His Dad Show He's Got His Back Through Thick & Thin","title_page":"These Eric Trump Quotes About His Dad Show He's Got His Back Through Thick & Thin","title_rss":"NULL","source_domain":"bustle.com","text":"When Donald Trump won the presidency, his adult children were thrust further into the limelight — and people started paying even closer attention to their every word and action. While much of this attention has centered on Trump's daughter, Ivanka, who works for his administration, his other kids have nonetheless been outspoken about their father. Indeed, these Eric Trump quotes about his dad reveal he's got a lot of respect for him as both a president and father.\nEric is Donald Trump's third child. His mother is Trump's ex-wife, Ivana Trump, and Ivanka and Donald Trump Jr. are his older siblings. Tiffany and Barron Trump are his younger half siblings. Eric and Donald Jr. currently serve as trustees of the Trump Organization, with the duo running the company while their father serves as president of the United States. Eric is married to Lara Trump and they have one child, a son named Luke.\nHe seems to keep a relatively low profile, though he does occasionally speak to the media about his dad. From those interviews, it is quite apparent that he is staunchly loyal to him, as he has frequently defended his father and expressed pride in him. The quotes below offer snippets of insight into how Eric perceives his dad and demonstrate his unflinching familial support.\nOn His Upbringing Jeff J Mitchell/Getty Images News/Getty Images In an interview with the Philippine Star in July 2012, Eric described his upbringing under his father's tutelage, emphasizing that Trump expected his children to work from a young age. There were no handouts in our family ... That's the thinking he [Trump] passed on to us. As children, I remember we had to mow lawns, cut down trees, and do all kinds of chores. Out of all my friends, I believe I'm the only kid whose dad made us work to cut rebars; we laid bricks in construction sites and did other real work every summer for minimum wage. Our dad said that it's important in the future that when we tell people to dig a hole, that you personally know how long it will take to dig that hole.\nOn His Dad's Patriotism Fox Business on YouTube During an interview with FOX Business Network’s Cheryl Casone in July 2015, Eric briefly reflected on the qualities he felt his father would bring to the presidency, characterizing him as an atypical politician. My father is an amazing guy — he’s a total, total patriot … He loves America … and he says what’s on his mind … He’s not like the typical politician who has to pander to everybody …\nOn Trump's Wall Building Intentions CBSN on YouTube While speaking to CBSN in February 2016, Eric discussed, among other things, his father's intent to build a wall along the U.S.-Mexico border (something which has not been constructed during Trump's presidency). In the interview, Eric asserted that he had no doubt that Trump would rapidly build the wall, saying: The man [Trump] is a man of absolute action. Believe me, he will build that wall. He will build it so fast people's heads will spin and by the way he will make Mexico pay for it ...\nOn Hispanic Voters Supposedly Being Excited About His Dad's Presidency During an interview with Irish radio’s RTE Radio1’s \"Drivetime\" in May 2016, Eric suggested that many Hispanics wanted his father to be elected president, despite polls at the time revealing largely unfavorable opinions toward Trump. As Eric described: People often talk about Hispanics ... You know, I have more Hispanics come up to me telling me, ‘Listen, I can’t wait for your father to be president. He’s going to bring jobs back to the United States. He’s going to end the nonsense. He’s going to create good trade deals. He’s going to create better education. He’s going to create a better family structure.’\nOn His Dad's \"Humble\" Roots CNN on YouTube In an interview on Fox News in September 2016, Eric received some pushback for claiming his father built his real estate empire from \"just about nothing,\" despite receiving a $1 million loan from his own father (Eric's grandfather) to jumpstart his business. Well, I think he's a guy who has been an entrepreneurial guy. He's built an amazing company. He's become the epitome of the American dream ... He's gone from just about nothing ... Listen, he's built an unbelievable empire.\nOn His Father's Fighting Spirit ABC News on YouTube During an interview with ABC's George Stephanopoulos in October 2016, Eric characterized his father as someone who has fought against many odds, including political machinery and the media. As Eric told Stephanopoulos: ... My father is an amazing fighter and what he's already accomplished is nothing short of remarkable. He's fought maybe the greatest political machine in the history of the world, which, you know, one that you obviously know better than anyone. He's fought, quite frankly, the entire mainstream media, who is always, you know, who's always counted him out, never thought he could do this, who's always put him down whether it be the primaries or — or now ...\nOn His Pride In His Father John Moore/Getty Images News/Getty Images During the same Stephanopoulos interview, Eric also spoke of the pride he had in his father, telling the host that, to him, his father is a winner regardless of the election's outcome. To me, as a son, he wins no matter what. I mean I'm so incredibly proud. I mean he's carried the weight of this country for the last 18 months ...\nOn His Dad's Golf Habit In an interview with the Irish Independent in April 2017, Eric defended his dad's propensity to frequently play golf, something for which the president has received much criticism, especially after Trump condemned Obama for doing the same. Eric characterized his dad's golf game as a diplomatic tool, saying: You can sit with somebody in a golf cart where there might be cultural differences and language barriers and have a good time and build a friendship in a way that you could never do sitting across an office table from someone ... If he can befriend people and find common respect, common ground and friendship – if you can have a good time together – then you are always going to see somebody in a very different light than you would with this kind of a relationship or a relationship over the phone, and that’s an immensely powerful tool.\nOn His Dad's Role In International Security Jeff Vinnick/Getty Images News/Getty Images In the same 2017 interview with the Irish Independent, Eric reflected on why he thinks his dad, in the role of commander in chief of the U.S. military, will make the world a safer place. As Eric described: I think the world will be a safer place because of him because he will actually show real leadership and he will take action when action needs to be taken, when others haven't been willing to in the past.\nOn Democrats \"Coming After\" His Father Fox News on YouTube During a June 2017 interview with Fox News' Sean Hannity, Eric characterized his father's critics as \"not even people\" and accused Democrats of \"coming after\" his father and his family. I've never seen hatred like this. To me, they're not even people. It's so, so sad. I mean, morality is just gone. Morals have flown out the window. We deserve so much better than this as a country. You know it's so sad. You see the Democratic Party. They're imploding ... They have no message, so what do they try and do? They try and obstruct a great man, they try and obstruct his family, they come after us viciously, and it's truly, truly horrible.\nOn His Father's 'Access Hollywood' Tape In October 2017, a recording emerged in which Trump could be heard boasting to Access Hollywood host Billy Bush that he could do whatever he wanted to women, including \"grabbing them by the p*ssy,\" due to his fame. As the Hollywood Reporter noted, shortly after the tape emerged, Eric sought to defend his father. Eric asserted that, while Trump was right to apologize for the remarks, they merely reflected \"locker room banter.\" As the president's son put it: And listen, my father apologized for it. He was right to apologize for it, and I’m glad he apologized for i.t At the same time, if you look at her track record with women [Clinton's], it’s horrible. It’s absolutely horrible ... At the same time, I think it’s locker room banter ... I think sometimes when guys are together they get carried away, and sometimes that’s what happens when alpha personalities are in the same presence. At the same time, I’m not saying it’s right. It’s not the person that he is.\nOn How His Dad Supposedly Only Sees \"One Color\" During a January 2018 interview on Fox and Friends, Eric sought to defend his father after the president reportedly characterized several Latin American and African states as \"sh*thole countries,\" prompting many to condemn him for being racist. Trump denied ever making the comment. In seeking to defend the notion that his father is not racist during the aforementioned interview, Eric insisted that the president only cares about money and nothing else, saying, My father sees one color: green ... That’s all he cares about.\nOn His Father's \"Tone\" CNBC on YouTube During an interview on CNBC's Squak Box in February 2018, Eric defended his father's sometimes brash tone and behavior. He characterized the president as a businessman, not a politician. You may not always like his tone, but at the end of the day, no one on either side of the aisle can argue with the results right now. This country is $8 trillion richer ... That's what people loved about my father ... If he wanted to have that perfect tone every single time, he could go be a boring politician. And, quite frankly, I don't think he would have been elected.","url":"https://www.bustle.com/p/these-eric-trump-quotes-about-his-dad-show-hes-got-his-back-through-thick-thin-10182318"}
