{"authors":[],"date_download":"2018-10-30 01:12:53","date_modify":"2018-10-30 01:12:53","date_publish":"2018-10-29 00:05:40","description":"Addressing a Missouri rally last month, President Trump praised the people of the FBI and Justice Department.","filename":"data/vaneerConsumption/TheStenchStillLingers.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/10/RodRosenstein.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861973.html","title":"The Stench Still Lingers","title_page":"The Stench Still LingersThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Addressing a Missouri rally last month, President Trump praised the people of the FBI and Justice Department, saying many of the bad ones — inferentially James Comey, Andrew McCabe, and others — had been fired. Trump said, “But we had some real bad ones — you see what’s happened at the FBI, they’re all gone, they’re all gone, they’re all gone. But there’s a lingering stench and we’re going to get rid of that, too.”\nThat isn’t happening.\nThe rally was held just after it was revealed that Deputy Attorney General Rod Rosenstein had suggested that he should wear a wire to record his conversations with the president about the Comey firing.\nThe political corruption of a law enforcement agency — the kind that led the FBI to ignore the obvious felonies of one candidate and try to invent crimes in an effort to target her opponent — is, by far, the corruption most damaging to democracy. The stench of that political corruption still lingers over the FBI and the Justice Department, but neither Trump nor anyone in his administration is willing or able to deal with it. The problem has gotten worse, not better.\nAs I wrote on September 24, Trump ordered that the Justice Department declassify — and thus make available to congressional investigators — the hundreds of important documents that Congress had asked for, demanded, subpoenaed and waited for the DoJ to produce for more than a year.\nThe House Permanent Subcommittee on Investigations (HPSCI), under Chairman Devin Nunes (R-CA), subpoenaed the documents in April 2017. Nunes could have enforced them by citing Attorney General Jeff Sessions or Deputy AG Rod Rosenstein or FBI Director Christopher Wray — or all of them, for that matter — for contempt of Congress. He could even have begun the process to impeach any or all of them, but he didn’t.\nAmong the documents included in Trump’s September declassification order were the Foreign Intelligence Surveillance Act search warrants against former Trump campaign advisor Carter Page and the thousands of text messages and the fully unredacted version of text messages exchanged between FBI Agent Peter Strzok and his mistress, FBI lawyer Lisa Page.\nHPSCI Chairman Nunes waited all that week for the documents. They didn’t come. And the Friday after Trump’s order to declassify the documents, Trump withdrew his order at Rosenstein’s urging and at the urging of “key allies,” unidentified by the president.\nThe FBI and Justice Department have been using every means in their power to cover up their unethical and probably illegal actions against the Trump campaign and, possibly, against the president since his inauguration.\nBy withdrawing his order, Trump rubber-stamped their cover up. It was an act of weakness. And now we know what scared him off.\nIt’s not only Congress that has been trying to uncover what the FBI and DoJ have been covering up. Several quasi-political and “watchdog” organizations have, with equal lack of success, been asking for the relevant documents via the Freedom of Information Act. Some have sued to get them.\nOne such organization, the “James Madison Project,” had asked for (among other things) all orders of the FISA court authorizing surveillance or information gathering on the Trump campaign, the Trump business organization, people associated with Trump and Trump himself.\nIn a court filing last week in the James Madison Project’s FOIA lawsuit against DoJ asking for those documents, DoJ made an extraordinary assertion. It said that it had “… determined that disclosure of redacted information in the Carter Page FISA documents could reasonably be expected to interfere with the pending investigation into Russian election interference.”\nThat assertion could only have been made at the behest of Special Counsel Robert Mueller and his team.\nA year ago, it would not have been unusual for the Department of Justice to make such an assertion in behalf of Mueller’s ongoing investigation into supposed Russian interference in the 2016 election.\nBut it’s 2018, not 2017. The Mueller investigation has been going on since May 2017. After a year and a half, it evidently hasn’t come up with any conduct on the basis of which it could get a grand jury to indict anyone for conspiracy with any Russian entity — far less the Russian government — to interfere in the election.\nWhat the DoJ’s position in the James Madison Project case means is that Rod Rosenstein told the president that if he stood by his order to declassify the Carter Page and other FISA documents, he would be obstructing justice. And that caused the president to withdraw his order. (Real Clear Investigations has the story.)\nNow, you can quibble. If you look at the laws describing obstruction of justice — and there are nearly two dozen — you can say that a president declassifying papers relevant to a criminal investigation (if they even are) doesn’t fit neatly into those statutes’ definitions of the crime.\nBut remember, as my pal Andy McCarthy often reminds us, the “high crimes and misdemeanors” that the Constitution provides are grounds of impeachment needn’t be criminal offenses. They are, instead, political offenses. You needn’t break the law in order to be impeached under the Constitution.\nIt is essential that the documents covered by the president’s declassification order be revealed to congressional investigators and the public.\nIt is only from those documents — and the yet-unobtained or still-concealed congressional testimony of people such as Andrew McCabe, Bruce Ohr, Nellie Ohr, Glenn Simpson, and a host of others — that we can learn the truth about the very apparent abuses of power by the FBI and the Justice Department during the 2016 election.\nIf the FBI and DoJ have their way, the truth will never come out.\nRosenstein’s position — really Mueller’s position — has effectively blocked the president’s declassification order. So what’s left?\nThe DoJ and the FBI won’t budge, at least with their current leaders in place. They are betting — as are most of the pollsters and pundits — that the Dems will take control of the House as a result of next week’s election. If the Democrats do take control of the House, Devin Nunes won’t be HPSCI chairman after the Dems take over in January and the possibility of enforcing the HPSCI’s subpoenas for the documents that the FBI and DoJ have refused to produce will evaporate.\nThe coverup will have succeeded. And the Democrats will begin the process of impeaching Trump.\nMake no mistake: if the Dems win the House they will believe they have a mandate to impeach the president.\nThere’s a chance, however slim, that the Republicans will hold the House. If they do, and Nunes remains HPSCI chairman, the 2017 subpoenas can be re-issued. Contempt proceedings against DoJ and FBI leaders can be pursued when (not if) the new subpoenas are again ignored. In an ultimate confrontation with Congress, those leaders could be impeached.\nWill all of that happen? Probably not. If it doesn’t, America’s worst ever political coverup will have succeeded. And the stench of political corruption will still linger over the Justice Department and FBI.","url":"https://spectator.org/the-stench-still-lingers/"}
