{"authors":["Caitlin O'Toole For Dailymail.Com"],"date_download":"2018-10-22 22:08:02","date_modify":"2018-10-22 22:08:02","date_publish":"2016-01-11 02:22:10","description":"The Creed star brought his wife Jennifer Flavin and their three gorgeous daughters Sistene, Sophia and Scarlet with him to the Golden Globes in Los Angeles on Sunday.","filename":"data/vaneerConsumption/TheStallonefanclubSylvesterisjoinedbyJenniferFlavinandtheirthreedaughtersashewinstheGlobeforBestSupportingActor.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/02/3002215E00000578-0-image-a-57_1452478272756.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393249_The-Stallone-fan-club-Sylvester-joined-Jennifer-Flavin-three-daughters-wins-Globe-Best-Supporting-Actor_1540246082.html","title":"The Stallone fan club! Sylvester is joined by Jennifer Flavin and their three daughters as he wins the Globe for Best Supporting Actor","title_page":"The Stallone fan club! Sylvester is joined by Jennifer Flavin and their three daughters as he wins the Globe for Best Supporting Actor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sylvester Stallone had his family by his side as he arrived at the Golden Globes.\nThe Creed actor was joined by his biggest fans, wife Jennifer Flavin, 47, and daughters Sophia, 19, Sistine, 17, and 13-year-old Scarlet as he arrived at the Beverly Hilton Hotel in Los Angeles on Sunday evening.\nThe 69-year-old, who was named Best Supporting Actor in a Motion Picture, looked sharp in a blue tuxedo.\nScroll down for video\nProud family: Sylvester Stallone with wife Jennifer Flavin and their daughters, from left, Sistine, Sophia and Scarlet at the Beverly Hilton in Los Angeles on Sunday\nThe actor has won rave reviews after reprising his role as boxer Rocky Balboa in spin-off Creed.\nOn Sunday, Sly looked proud and relaxed as he walked the red carpet with his wife and daughters.\nJennifer, 47, wore a strapless grey gown with sheer, flowing skirt and train.\nFamily affair: The actor won Best Supporting Actor in a Motion Picture for his role in Creed\nThe dress featured dark metallic detailing on the waist, and she added a dark clutch.\nThe couple's daughters also looked pretty as they posed on the red carpet.\nSophia, 19, wore a long black gown with plunging neckline and cinched in her waist with a black and gold metallic belt.\nComeback: The star was greeted by a standing ovation as he took the stage\nAction star: Stallone joked that he wanted to thank Rocky Balboa, calling his legendary character 'the best friend I ever had'\nCelebrating: Stallone beamed as he posed with his proud wife and daughters after his big win\nBig win: The actor showed off his Best Supporting Actor award backstage\nSistine, 17, matched her famous father with a dark navy material, wearing a strapless gown and holding a dark blue clutch.\nAnd 13-year-old Scarlet wore a white outfit featuring a see-through, strapless bodice, side cut outs and floor-length skirt.\nThe 69-year-old received a standing ovation as he won for Creed, almost 40 years after winning a Golden Globe for Best Screenplay for Rocky.\nStill got it: The Rocky star won over a new generation of fans with his role in Creed\nFan club: Sly showed off his big win with his pretty daughters by his side\nSupportive: The Creed star thanked his wife and daughters, calling their love 'the greatest award there is'\n'Thank you!' Sly said on stage. 'I am gonna try not to get emotional because I am the sum total of every person I ever met. Last time I was here was 1977.'\nAnd he thanked his wife and daughters for their love and support.\n'I want to thank my wife and children. Actually having your love is the greatest award there is.'\nAnd he joked: 'I want to thank my imaginary friend Rocky Balboa for being the best friend I ever had.'\nThe champ: The actor first won a Golden Globe for the original Rocky back in 1977\nPretty: Jennifer looked gorgeous in a strapless gown with sheer skirt and flowing train\nBack in the gym: The actor played legendary character Rocky Balboa in Creed, which also starred Michael B Jordan\n2016 GOLDEN GLOBE AWARDS WINNERS - FILM Best Performance by an Actress in a Motion Picture Drama Cate Blanchett, Carol Brie Larson, Room Rooney Mara, Carol Saoirse Ronan, Brooklyn Alicia Vikander, The Danish Girl Best Performance by an Actor in a Motion Picture Drama Bryan Cranston, Trumbo Leonardo DiCaprio, The Revenant Michael Fassbender, Steve Jobs Eddie Redmayne, The Danish Girl Will Smith, Concussion Best Performance by an Actor in a Motion Picture Musical or Comedy Christian Bale, The Big Short Steve Carell, The Big Short Matt Damon, The Martian Al Pacino, Danny Collins Mark Ruffalo - Infinitely Polar Bear\nBest Performance by an Actress in a Motion Picture Musical or Comedy Jennifer Lawrence, Joy Melissa McCarthy, Spy Amy Schumer, Trainwreck Maggie Smith, The Lady in the Van Lily Tomlin, Grandma Best Screenplay Motion Picture Josh Singer Charles Randolf The Big Short Steve Jobs Quentin Tarantino, The Hateful Eight Best Original Song Motion Picture Love Me Like You Do, Fifty Shades Of Grey One Kind Of Love, Love and Mercy See You Again, Furious 7 Simple Song #3, Youth Writing's On The Wall, Spectre\nBest Motion Picture - Drama Carol Mad Max: Fury Road The Revenant Room Spotlight Best Motion Picture - Musical or Comedy The Big Short Joy The Martian Spy Trainwreck\nBest Motion Picture - Animated Anomalisa The Good Dinosaur Inside Out The Peanuts Movie Shawn The Sheep Movie\nBest Motion Picture - Foreign Language The Brand New Testament, Belgium The Club, Chile The Fencer, Finland/Germany/ Estonia Mustang, France Son of Saul, Hungary Best Performance by an Actress in a Supporting Role in any Motion Picture Jane Fonda, Youth Jennifer Jason Leigh, The Hateful Eight Helen Mirren, Trumbo Kate Winslet, Steve Jobs Alicia Vinkander, Ex-Machina\nBest Performance by an Actor in a Supporting Role in any Motion Picture Paul Dano, Love & Mercy Idris Elba, Beasts of No Nation Mark Rylance, Bridge of Spies Michael Shannon, 99 Homes Sylvester Stallone, Creed Best Director Motion Picture Todd Haynes, Carol Alejandro G Inarritu, The Revenant Tom McCarthy, Spotlight Ridley Scott, The Martian George Miller, Mad Max:Fury Road\nBest Original Score Motion Picture Carol The Danish Girl The Hateful Eight Steve Jobs The Revenant","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393249/The-Stallone-fan-club-Sylvester-joined-Jennifer-Flavin-three-daughters-wins-Globe-Best-Supporting-Actor.html"}
