{"authors":["Ayoub Aouad"],"date_download":"2018-10-30 20:45:42","date_modify":"2018-10-30 20:45:42","date_publish":"2016-12-28 00:00:00","description":null,"filename":"data/vaneerConsumption/TheStateBankofIndiablocksPaytm.json","image_url":"https://amp.businessinsider.com/images/5863d45cee14b61b008b5785-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-state-bank-of-india-blocks-paytm-2016-12_1540932342.html","title":"The State Bank of India blocks Paytm","title_page":"    The State Bank of India blocks Paytm - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nOne of India's biggest banks, the State Bank of India (SBI), has blocked its customers from transferring money to their Paytm wallets, rather recommending they use the banks own wallet, the State Bank Buddy, according to Mashable.\nThis is likely a move to capitalize on changing digital payment habits in the country — digital payments have grown by over 400% since demonetization — which is a result of the country removing 500- and 1,000-rupee banknotes from circulation in early November.\nThe bank has a major user acquisition channel that could boost its mobile wallet in post-demonetization India.\nThe bank can use its massive network in India to attract users to its mobile wallet. Currently SBI's mobile wallets has 5 million downloads on the Google Play Store, according to Mashable. However, this could significantly grow if the bank doesn't allow its customers to use alternative wallets and leverages its massive network. The bank has over 20,000 branches in India, more than 54,000 ATMs, and it holds a 22% share of the domestic Indian banking market.\nIf it is able to leverage its network, it could capture some of Paytm's growing market share, as a result of demonetization. Paytm has gained over 20 million new users since demonetization was announced in early November. The mobile wallet saw almost immediate results, reporting a 1,000% growth in money added to the mobile wallet, a 300% rise in app downloads, and an increase from three transactions per user per week to 18 over a three-weeks period.","url":"https://www.businessinsider.com/the-state-bank-of-india-blocks-paytm-2016-12"}
