{"authors":["Nick Fagge In Molndal","Gothenburg","Sweden","For Mailonline"],"date_download":"2018-10-23 00:26:50","date_modify":"2018-10-23 00:26:50","date_publish":"2016-01-29 13:30:17","description":"Mölndal, in Gothenburg where asylum worker Alexandra Mezher was murdered, has taken in more child migrants than any other city in Sweden and gets £22.6million funding to house them.","filename":"data/vaneerConsumption/TheSwedishtownofMolnalwhichwasdestroyedbymigration.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B2A35E00000578-0-image-a-28_1454074051801.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422605_The-town-destroyed-migration-week-murder-beautiful-young-social-worker-sent-shockwaves-Europe-MailOnline-shines-spotlight-Molndal_1540254410.html","title":"The Swedish town of Molnal which was destroyed by migration","title_page":"The Swedish town of Molnal which was destroyed by migration | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MailOnline went inside lawless town where eyes of Europe have been watching since the senseless stabbing\nStanding on a street corner in the pitch black night, a youth brandishes a broken walking stick like a weapon.\nWrapped up warm in a thick parka coat Mohammed jokes with his friends as passers-by watch the gang of unruly youths hanging around one of the few shops still open with suspicion.\nAs I approach, the 16-year-old drops the baton, his friend kicks it away, trying to hide it.\nRuined: The Gothenburg suburb of Mölndal is in the spotlight this week after the young, beautiful social worker Alexandra Mezher, 22, was stabbed to death in a frenzied attack at the child migrant centre where she worked\nMenacing: Miss Mezher's killing is the latest in a long line of migrant related crime in the town which took 4,000 unaccompanied child refugees last year - more than any other town or city in Sweden\nTrouble: Those living in the town say its landscape has been changed by the sudden influx of 8,000 migrants last year. Police say they are so over-stretched and have to let some offences go – particularly drug crime\n‘Mölndal is the best place in the world,’ Mohammed claims. ‘I have lived here my whole life. I wouldn’t want to live anywhere else.’\nHis family arrived in Sweden as refugees in the 1980s. Iraqi Kurds they were forced to flee Saddam Hussein merciless vendetta against this persecuted people.\nHis father stayed on to fight the regime – a volunteer to the fearless Peshmerga fighters, Mohammed announces proudly.\n‘Sweden is very good for people who want to live a peaceful life,’ the youngster explains in flawless English.\n‘Everyone is treated with respect. And Swedish people are kind.’\nMohammed’s friends have similar stories. Many were born in Sweden, others arrived as children – all of their families are from other countries – the Middle East, Africa or Eastern Europe.\n‘At my school there are people from 25 different countries,’ he tells me.\n‘And there are lots of new kids at school who have just arrived as refugees.’\nMigrants: The town received £22.6million from the government last year to house young migrants, which is more per capita than any other town in Sweden. Mohamed, 16, an Iraqi Kurd, told MailOnline: ‘Mölndal is the best place in the world. I wouldn’t want to live anywhere else'\nLandscape: But others in the town disagree and blame Sweden's politicians for Sweden's open door policy. ‘Our f***ing politicians should be shot,’ one outspoken Swede told MailOnline. ‘What the f*** were they thinking opening our doors to everyone?’\nFear: Some say with migration has brought fear. At night on the streets, one woman told our reporter: 'The refugee children gather on the bridge at night. There are lights and it is warm do it us somewhere to go for them. But people become worried when they see gangs of youths hanging around at night'\nDeserted: The town's main shopping centre is a no go zone for most people at night because they fear the armed gangs roaming the streets at night looking for trouble\nA 20-minute tram ride from the glittering water-fronted centre of Sweden’s second city, Gothenburg, Mölndal is already one of the country’s most diverse communities. And when Europe’s migration crisis erupted last year city leaders stepped forward with open arms to help.\nThe Gothenburg suburb accepted more unaccompanied refugee children than anywhere else in the country – 4,041 added to a population of 63,000. In the autumn 400 refugee kids were taken in every week.\nIn 2014, Mölndal received £22.6million to provide housing for unaccompanied minors – the most state funding per capita than any town or city in Sweden.\nMölndal is home to the huge Sagasen refugee centre that houses up to 1,000 new arrivals.\nLast year, Sweden, with a population of 9.8 million, took in more than 160,000 asylum seekers. Just over three out of every 2,000 citizens are now refugees.\n‘Most of the new kids have special lessons at the moment,’ Mohammed explains. ‘They need to learn Swedish before they can join us in class.’\nExploiting the warmth and lighting of Mölndal’s bus station to chat and play on their smart phones are two such recent arrivals. Abdasis and his friend left Somalia just over a year ago.\nThe pair have only praise for Sweden – despite the long, cold dark nights of winter – because it has offered them sanctuary.\n‘Sweden is good place,’ Abdasis, 16, said in broken English. ‘Somalia is war, always war, no peace. Sweden is peace, happiness, life.’\nNot everyone in Mölndal or Gothenburg agrees.\nNew arrivals: Abdasis and his friend left Somalia just over a year ago. The pair have only praise for Sweden – despite the long, cold dark nights of winter – because it has offered them sanctuary. ‘Sweden is good place,’ Abdasis, 16, said in broken English. ‘Somalia is war, always war, no peace. Sweden is peace, happiness, life’\nCrime: The Gothenburg suburb accepted more unaccompanied refugee children than anywhere else in the country – 4,041 added to a population of 63,000. In the autumn 400 refugee kids were taken in every week\nWeapons: As our reporter approached Mohamed the 16-year-old dropped his wooden baton and one of his gang kicked it away\n‘Our f***ing politician should be shot,’ one out-spoken Swede told MailOnline this week.\n‘What the f*** were they thinking opening our doors to everyone?’\nThe pedestrian bridge over the main road through Mölndal has become a meeting place for young refugees, residents claim.\nOne said: 'The refugee children gather on the bridge at night. There are lights and it is warm do it us somewhere to go for them.\n'But people become worried when they see gangs of youths hanging around at night.'\nOthers gather outside the cut-price supermarket Netto in s housing estate a short walk from the station.\nTribute: Miss Mezher's mother described her as a 'angel' - and blamed Sweden's politicians for the country's migrant crisis\nA playground and a basketball court are also popular meeting points.\nAnother resident said: 'this used to be a good area. Now look at it.'\nThe murder of social worker Alexandra Mezher at a home for unaccompanied refugees this week has shone the spotlight on the country’s controversial open-door immigration policy.\nThe 22-year-old’s mother Chimene, who arrived in Sweden as a refugee, claims the country is no longer safe.\nHeartbroken Mrs Mezher said: ‘We left Lebanon to escape the civil war, the violence and the danger. We came to Sweden where it was safe, to start a family. But it is not safe anymore.’\nHer husband Bourous, 45, moved to Sweden from Beirut in 1989 and built up a pizza business. Mrs Mezher, who has three sons, said: 'She was not just my daughter, she was my angel. She was a just and fair human being. There were so many who loved her. She was my daughter, my friend.'\nShe blamed Swedish politicians for a dramatic rise in immigration in Molndal – particularly of unaccompanied children.\nOfficers in Mölndal say they have had to ignore lesser offences such as drug-dealing because they are so overrun by migrant crime, with gang fights and violent assaults.\nAnd in capital Stockholm police this week warned that the capital's main train station was 'overrun' by gangs of Moroccan street children 'stealing and groping girls'.\nSwedish police revealed they have sent plain-clothes officers to monitor swimming baths in Stockholm after increased reports of sexual harassment of girls and women.\nIt was also claimed this week police had been forced to flee after being attacked by a mob of asylum seekers as they tried to relocate a ten-year-old boy amid allegations he had been 'raped repeatedly' at a refugee centre.\nAnd staff at a migrant centre in Sweden had to flee where 19 asylum seekers ran riot with weapons.\nCrime statistics in Mölndal also contradict Abdasis’s assessment of ‘peace, happiness, life’ in the town.\nPolice say they have responded to four or five emergency calls from refugee centres in the Gothenburg area – which includes Mölndal – every day since late October.\nThe city’s most up-to-date crime figures reveal there were 372 incidents reported which led to 222 criminal complaints linked to migrant centres – between 20 October 2015 and 8 January this year.\nMölndal’s politicians have refused to explain their open-door immigration policy.\nMarie Östh Karlsson, leader of Mölndal district council, thanked MailOnline for a request to discuss immigration, Sweden’s most pressing issue.\nBut she added: ‘At the moment I choose not to give any interview on this topic [immigration].’\nPolice complain they are stretched to breaking point in having to deal with the rising migrant crime wave.\nBeauty: The murder of social worker Alexandra Mezher (pictured) at a home for unaccompanied refugees this week has shone the spotlight on the country’s controversial open-door immigration policy\nMurder scene: The 22-year-old social worker was stabbed at this shelter for child migrants at 8am on Monday. She had worked alone on an overnight shift at the centre for refugees aged 14-17\nCharged: Somali-born Youssaf Khaliif Nuur is accused of murdering Alexandra Mezher. He appeared in court yesterday and was remanded in custody until February 11. He is being held in a psychiatric hospital\n‘We have become completely overwhelmed,’ one policeman with over 30-years-service with Gothenburg Police told MailOnline.\n‘We have given up with narcotic crime. We just don’t have the resources.’\nInstead officers are trying to fight back the explosion of violent street crime that has erupted in recent months.\nThere are 20 robberies in Gothenburg every day – usually with violence. This week an 83-year-old lady had a gun put in her face when she was mugged on her way to play bingo. They got away with just 50 Kroner [about £4]. Gothenburg police source\n‘I have worked in Gothenburg for over 30 years and I have never known anything like it,’ the officer told MailOnline.\n‘I will not let my children go into the city after 2pm and especially not at night.\n‘There are violent gangs roaming around the streets and the use of knives and other weapons have become normal, rather than a rarity as it used to be,’\n‘There are 20 robberies in Gothenburg every day – usually with violence or the threat of violence.\n‘This week an 83-year-old lady had a gun put in her face when she was mugged on her way to play bingo. They got away with just 50 Kroner [about £4].\n‘In the summer there were mass shootings with lots of people killed, including a little girl.’\nHe added the city streets were now at the mercy of gangs of young men mainly from North Africa.\nThe police source revealed: ‘In the past couple of months we have noticed a dramatic increase in street robbery. This is a new phenomenon.\nMenacing: One officer told MailOnline that there were 'violent gangs roaming around the streets and the use of knives and other weapons have become normal'\nPolice: A source in Gothenburg's police department told MailOnline: ‘They will do anything to get money – steal a person’s wallet, iPhone, jewellery. And then they will attack their victim and kick them half to death'\nDark: The Gothenburg suburb accepted more unaccompanied refugee children than anywhere else in the country – 4,041 added to a population of 63,000\n‘They will do anything to get money – steal a person’s wallet, iPhone, jewellery. And then they will attack their victim and kick them half to death.\n‘Drug crime has gone through the roof. Every drug is available on the street nowadays, even in broad daylight.","url":"https://www.dailymail.co.uk/news/article-3422605/The-town-destroyed-migration-week-murder-beautiful-young-social-worker-sent-shockwaves-Europe-MailOnline-shines-spotlight-Molndal.html"}
