{"authors":[],"date_download":"2018-10-30 01:09:55","date_modify":"2018-10-30 01:09:55","date_publish":"2015-04-05 00:00:00","description":null,"filename":"data/vaneerConsumption/TheSeasonofHopeandCourage.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_04_the_season_of_hope_and_courage_comments_1540861795.html","title":"The Season of Hope and Courage","title_page":"Blog: The Season of Hope and Courage","title_rss":"NULL","source_domain":"americanthinker.com","text":"With religious freedom in America under attack, as evidenced by the hysterical media and corporate reaction to Indiana’s enactment of a common-sense religious freedom law, it’s more important than ever to reflect at Easter on our God-given liberty to acknowledge – or not -- the greatest gift ever given, salvation through the risen Jesus Christ. We often forget how blessed we are to have had founders who placed religious freedom at the top of their list of unalienable rights, especially when new “rights” are being invented almost daily to supersede religious liberty. Nations that have fallen under anti-religious oppression provide cautionary tales. Brennan Manning, the gifted Christian writer who died in 2013, paraphrased in his book Reflections for Ragamuffins an uplifting story of hope and courage in the face of oppression from Nikolai Arseniew’s book Mysticism in the East: “Comrade Lunachatsky was lecturing in Moscow’s... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/04/the_season_of_hope_and_courage_comments.html"}
People.’ All the Christian mysteries are but myths, he said, supplanted by the light of science. Marxist science is the light that more than substitutes for the legends of Christianity. Lunachatsky spoke at great length. “When he finished, he was so pleased with himself that he asked if anyone in the audience of some 7,000 had anything to add. A 26-year-old Russian Orthodox priest, just ordained, stepped forward. ... The commissar looked at him scornfully: ‘I’ll give you two minutes, no more.’ “‘I won’t take long,’ the priest assured him. He mounted the platform, turned to the audience and in a loud voice declared, ‘Christ is risen!’ As one man, that vast audience roared in response, ‘He is truly risen!’” May we take heart during this Holy Week that eternal truth is infinitely more powerful than man’s temporal conceits, and that in America we can freely worship the Source of that power during this blessed season, and all the year round. Robert Knight is a Senior Fellow for the American Civil Rights Union.","url":"https://www.americanthinker.com/blog/2015/04/the_season_of_hope_and_courage.html"}
