{"authors":["Andrew Meola"],"date_download":"2018-10-30 21:34:51","date_modify":"2018-10-30 21:34:51","date_publish":"2016-12-19 00:00:00","description":"Not sure which credit card processing company to use? We've compiled a list of the industry's leading providers to help you decide.","filename":"data/vaneerConsumption/Thesearetheleadingcreditcardprocessingcompanies.json","image_url":"https://amp.businessinsider.com/images/580528808d83b4a6018b4de3-640-320.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_list-credit-card-processing-companies-2016-11_1540935291.html","title":"These are the leading credit card processing companies","title_page":"    List of Credit Card Processing Companies (Key Industry Players) - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Credit card processors are mostly responsible for data transmission and security when you use your card at a store or online to make a purchase.\nBusiness Insider Intelligence\nThere are two types of processors in the payment-card system. Front-end processors route transactions from merchants to the cardholder's bank to gain authorization; that is, they make sure a customer has enough available credit or funds to make a purchase. Back-end processors are responsible for a fund's settlement, which ends with the merchant receiving a deposit for transactions.\nBelow, we've outlined the major players in credit card processing and described their major strengths.\nBank of America Merchant Services: Bank of America Merchant Services has the advantage of functioning within the second-largest bank in the U.S. The service promises acceptance of all kinds of payments (credit cards, debit cards, electronic checks, and gift cards), access to funds on the next business day, and mobile support.\nBank of America Merchant Services has the advantage of functioning within the second-largest bank in the U.S. The service promises acceptance of all kinds of payments (credit cards, debit cards, electronic checks, and gift cards), access to funds on the next business day, and mobile support. Citibank: The consumer division of Citigroup processes transactions in more than 100 currencies. It offers end-to-end processing services, from pricing to transactions, reporting, customer service, and billing.\nThe consumer division of Citigroup processes transactions in more than 100 currencies. It offers end-to-end processing services, from pricing to transactions, reporting, customer service, and billing. Wells Fargo: One of the \"Big Four\" U.S. banks, Wells Fargo offers next-business day funding, encryption and tokenization technology, and support for both PIN and signature transactions.\nOne of the \"Big Four\" U.S. banks, Wells Fargo offers next-business day funding, encryption and tokenization technology, and support for both PIN and signature transactions. Chase Paymentech: The payment processing arm of JPMorgan Chase, the largest bank in the U.S., authorizes and processes payments in more than 130 currencies. And like its peers, it offers analytics, fraud detection, and security solutions.\nThe payment processing arm of JPMorgan Chase, the largest bank in the U.S., authorizes and processes payments in more than 130 currencies. And like its peers, it offers analytics, fraud detection, and security solutions. Barclays: Barclaycard payment solutions facilitates in-person, phone, web, and even mail order payments through desktop and portable card machines.\nBarclaycard payment solutions facilitates in-person, phone, web, and even mail order payments through desktop and portable card machines. Vantiv: Vantiv has been successful thanks to its nearly error-free purchases, authorizations, and captures. In May 2015, it successfully completed 95% of these transactions, ahead of competitors such as Worldpay, PayPal, and Braintree. The company also has a significant speed advantage, as it often processes payments data in less than a second.\nVantiv has been successful thanks to its nearly error-free purchases, authorizations, and captures. In May 2015, it successfully completed 95% of these transactions, ahead of competitors such as Worldpay, PayPal, and Braintree. The company also has a significant speed advantage, as it often processes payments data in less than a second. First Data: First Data facilitates small business payments with its Clover suite of products, including a mini reader that works without Wi-Fi and a mobile reader that attaches to other devices in order to process payments on the go.\nFirst Data facilitates small business payments with its Clover suite of products, including a mini reader that works without Wi-Fi and a mobile reader that attaches to other devices in order to process payments on the go. Cielo: Cielo is the largest Brazilian credit and debit card operator and the largest payment systems company in Latin America. The company debuted on the Sao Paulo Stock Exchange in 2010.\nCielo is the largest Brazilian credit and debit card operator and the largest payment systems company in Latin America. The company debuted on the Sao Paulo Stock Exchange in 2010. TSYS: Short for Total System Services, TSYS supports millions of buyers and sellers around the world through four major branches: issuing services, acquiring services, prepaid solutions, and merchant solutions.\nShort for Total System Services, TSYS supports millions of buyers and sellers around the world through four major branches: issuing services, acquiring services, prepaid solutions, and merchant solutions. Global Payments: Global Payments focuses on ensuring businesses accept all major forms of payments. To that end, its services include credit/debit/purchasing cards, electronic check conversion, money transfer, verification and recovery services, gift/loyalty cards, check guarantee, ACH checks, financial EDI services, and point-of-sale equipment.\nGlobal Payments focuses on ensuring businesses accept all major forms of payments. To that end, its services include credit/debit/purchasing cards, electronic check conversion, money transfer, verification and recovery services, gift/loyalty cards, check guarantee, ACH checks, financial EDI services, and point-of-sale equipment. Worldpay: The UK-based company is one of the longest-tenured online payment platforms. The company provides several payment services for both online and in-store channels. As of August 2016, the company had 400,000 merchant clients. In 2015, it processed 13 billion transactions valued at more than $526 billion. Worldpay has grown its volume primarily because of early-mover advantages that have allowed it to build scale. It also provides many different services across channels, which diversifies its revenue streams.\nThe UK-based company is one of the longest-tenured online payment platforms. The company provides several payment services for both online and in-store channels. As of August 2016, the company had 400,000 merchant clients. In 2015, it processed 13 billion transactions valued at more than $526 billion. Worldpay has grown its volume primarily because of early-mover advantages that have allowed it to build scale. It also provides many different services across channels, which diversifies its revenue streams. Moneris: Moneris is the largest credit and debit card processor and acquirer in Canada. It processes more than three billion transactions each year for more than 350,000 merchants, and the company employs more than 1,900 people in North America.\nMoneris is the largest credit and debit card processor and acquirer in Canada. It processes more than three billion transactions each year for more than 350,000 merchants, and the company employs more than 1,900 people in North America. Fiserv: American Banker and BAI ranked Fiserv third by revenue among technology providers to U.S. banks in October 2015. Fiserv provides services in account processing, electronic payments processing, check processing, web and mobile banking, and more.\nAmerican Banker and BAI ranked Fiserv third by revenue among technology providers to U.S. banks in October 2015. Fiserv provides services in account processing, electronic payments processing, check processing, web and mobile banking, and more. Adyen: Adyen provides e-commerce companies with a payment platform that includes gateway, risk management, and front-end processing services. Adyen is a full-stack gateway and has famous merchants like Facebook and Spotify as clients. The company has brought in merchants thanks to its single platform that can support payments in any channel across 100 different payment methods and 200 countries. The firm processed $50 billion in 2015, up 100% from $25 billion in 2014. It earned $350 million in revenue in 2015, and expects to break $500 million in 2016.\nAdyen provides e-commerce companies with a payment platform that includes gateway, risk management, and front-end processing services. Adyen is a full-stack gateway and has famous merchants like Facebook and Spotify as clients. The company has brought in merchants thanks to its single platform that can support payments in any channel across 100 different payment methods and 200 countries. The firm processed $50 billion in 2015, up 100% from $25 billion in 2014. It earned $350 million in revenue in 2015, and expects to break $500 million in 2016. Heartland Payment Systems: Heartland helps businesses move beyond accept ng major credit cards. The company facilitates payment processing in-store, online, and offsite through multiple methods, such as EMV, Apple Pay, Samsung Pay, Android Pay, and gift cards. It also offers next-day funding, real-time reporting, and 24/7 customer service in the U.S.\nHeartland helps businesses move beyond accept ng major credit cards. The company facilitates payment processing in-store, online, and offsite through multiple methods, such as EMV, Apple Pay, Samsung Pay, Android Pay, and gift cards. It also offers next-day funding, real-time reporting, and 24/7 customer service in the U.S. Elavon: Formerly known as NOVA, this company is a subsidiary of U.S. Bancorp. Elavon processes payments in more than 30 countries for more than one million merchants.","url":"https://www.businessinsider.com/list-credit-card-processing-companies-2016-11"}
