{"authors":[],"date_download":"2018-10-30 00:50:48","date_modify":"2018-10-30 00:50:48","date_publish":"2018-07-01 00:05:40","description":null,"filename":"data/vaneerConsumption/TheTrulyCatholicVisionofJustImmigration.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/IllegalProtest.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860648.html","title":"The Truly Catholic Vision of Just Immigration","title_page":"The Truly Catholic Vision of Just ImmigrationThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"On June 18, James Daniel “JD” Flynn, the editor of Catholic News Agency, which is part of the largest religious media network in the world, EWTN, published a tremendously popular article called “The Catholic Vision of Just Immigration Reform”. In his piece, Flynn argues that President Trump’s “child separation policy” (which is merely a part of the American legal process that is applicable to all criminals) needs to be “stopped,” and “…Catholics need to lead efforts to develop comprehensive immigration reform.”\nIn case you were wondering, dear reader, “comprehensive immigration reform” is simply a code for allowing more immigrants into our country legally and legalizing the illegals who have come here packaged in a lot of overtures to respecting the rule of law in America.\nFor Catholics and those within the orbit of Catholic political discourse, Flynn’s argument should sound annoyingly familiar, for this argument, in fact, has been the modus operandi of the largely left-wing American Catholic Bishops since the Reagan Era.\nWith respect to JD Flynn and the good bishops, this policy has led to what cannot only be described as a disastrous situation in which millions of Latin Americans have poured into the U.S. illegally, risking their lives and the lives of their family members because they knew that powerful lobbying groups (especially liberal Catholic ones) would put the needs of illegals above the common good of American Citizens.\nSecondly and more importantly, JD Flynn’s argument that the requirement to allow tens of millions of people from foreign countries into the United States is part of a “Catholic vision” is completely erroneous.\nThe first layer of Flynn’s error in “The Catholic Vision of Just Immigration” is his presentation of the various causes célèbres regarding Trump’s “child separation policy,” which is loaded with fake news, Mickey Mouse stories. Flynn’s tale of the Honduran woman who had her breast-feeding daughter taken away from her only has the word of a left-wing illegal immigrant “rights” lawyer and has been denied by the Department of Homeland Security. The story of the breast feeding girl is just one of many false reports from the border that have been used to attack the Trump administration and ultimately attack the sovereignty of the United States of America. Even the famous image of the young girl crying below a towering Donald Trump on the cover of Time is also fake — as fake news central, the Washington Post, admits.\nFlynn further errs in his analysis of the current state of America. Flynn argues that America is “facing a labor shortage” and “importing labor expands our tax base and our domestic consumer base,” two benefits, according to Flynn, which “outweigh the costs” of illegal immigration.\nReally?\nLet’s take a look and see if any of that is true. First of all, the notion that there is either a blue or white collar labor shortage is completely false. It is simply cooked up by both blue and white collar employers who want to hire workers for cheaper fair. Even the liberal Boston Globe admits this.\nSecondly, the cost of illegal immigrants far outweighs the contribution in tax dollars. Illegal immigrants contribute approximately $19 billion in taxes per year, but cost the taxpayer $116 billion in benefits.\nEven when immigrants come from developing countries legally or are legalized, the amount of money they drain from the country dwarfs their economic impact.\nHowever, Flynn’s (who is, one might add, a canon lawyer) most crucial error is in his interpretation of Pope Pius XII’s 1948 Apostolic Letter to American Archbishop John T. McNicholas, which later served as an inspiration for Pius’s 1952 encyclical on immigration, Exsul Familia Nazarenthana, itself a favorite (albeit misread) piece for the pro-illegal immigrant crowd at the United States Conference of Catholic Bishops and at “conservative” media outlets like Catholic News Agency.\nPius XII’s 1948 letter was written to support the efforts of the National Catholic Welfare Conference who were settling Europeans unsettled by World War II and the descent of the Iron Curtain on Central and Eastern Europe. These refugees, who, for the most part, shared the same ethnic and cultural backgrounds as the majority U.S. population, came fleeing starvation, genocide, and horrific acts of sexual violence that followed the allied bombing of Europe and the march of the Red Army to “liberate” Germany and Eastern Europe.\nMoreover, in the Apostolic Letter, Pius clearly states that the migrants coming to the U.S. were “needy but worthy” (note the “but”) that is, genuinely deserving of refugees who would provide a benefit to the common good of America. The Holy Father further clarifies that the arrival of these (real) refugees would “not be detrimental to the public welfare when properly considered.”\nThis is a key passage that should prompt some careful reflection and is really the heart of the matter. Americans — whether Catholic or otherwise — must think first and foremost of the common good of their nation before letting in large numbers of immigrants who threaten the social integrity of the country.\nLet’s further ask ourselves if illegal immigration has been beneficial to the common good of America.\nDo areas with high illegal immigrant populations in the U.S. have higher or lower crime rates than areas in which native born Americans live?\nAre schools with high illegal immigrant populations higher or lower performing (not to mention safer) than schools with primarily native born citizens?\nDo Americans feel more trusting and safer with illegal immigrant populations in the communities?\nThe answer to the questions is embarrassingly obvious and clear — even left-wing Harvard sociologist Robert Putnam admitted as much in his 2006 white paper “E Pluribus Unum: Diversity and Community in the 21st Century.”\nLarge scale immigration has been one of the most corrosive in American community life and has largely eroded the cohesion of our country.\nAs a final note, the image of the confident, determined, and clearly America-loving Latina holding the American flag in the picture appended to JD Flynn’s article has a very interesting history.\nInitially, during the large scale marches in American cities that flared under the Bush and Obama administrations, illegals marched with their own countries’ flag, ironically demanding American citizenship (although they clearly did not think of themselves as Americans) and, of course, American jobs and benefits.However, the organizers of these rallies realized that illegal immigrants showing that their primary loyalty was to their native country, not to a country to which they moved to cash in on higher wages and benefits, would backfire, and the mysterious organizers of these rallies thus started handing out the Stars and Stripes to protesters.\nInterestingly (and unsurprisingly), driven by anger and a “nothing to lose” mentality during the Trump presidential campaign and now presidency, these same protesters recently have tossed aside Old Glory and hoisted the Mexican flags back up.\nIn the end, JD Flynn’s position on illegal immigration, which is representative of virtually every single American bishop — whether liberal or conservative, will ultimately backfire, for it has become increasingly apparent to many Catholics and friends of Catholics that the pro-illegal immigrant position — however smothered it is under the language of “laws” and “border security” — is not only a catalyst for further demographic suicide for America and the West, it is not the authentic teaching of the Catholic Church.\nThe heads of American Catholic media must recognize that the pro-illegal position, like the cover ups of sexual abuse, the destruction of the Church’s traditional liturgy, and the tremendous financial scandals, has made the average American Catholic very, very upset at the leadership of the Church in America. We don’t like being lied to. We don’t want someone to tell us that something is “Catholic teaching” when it is simply cherry picking from traditional Catholic teaching to fit a liberal political agenda.\nWe want the truth of the faith, whole and inviolate, and we want American Catholic leaders — whether clerical or lay — who are on the side of Americans.","url":"https://spectator.org/the-truly-catholic-vision-of-just-immigration-a-response-to-jd-flynn/"}
