{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor"],"date_download":"2018-10-23 01:58:22","date_modify":"2018-10-23 01:58:22","date_publish":"2016-01-28 16:38:03","description":"The new poll on which party has the best team of leaders to solve the country's problems put the Tories on 43 per cent compared to just 16 per cent for Labour.","filename":"data/vaneerConsumption/TheTorieshavetheirbiggestEVERpollleadoverLabour.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AB6B5B00000578-0-image-a-50_1453998949657.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421275_The-Tories-biggest-poll-lead-Labour-Jeremy-Corbyn-leads-party-27-point-deficit_1540259902.html","title":"The Tories have their biggest EVER poll lead over Labour","title_page":"The Tories have their biggest EVER poll lead over Labour | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jeremy Corbyn has left Labour an extraordinary 27 per cent behind when voters are asked who has the best team to solve the country's problems - the biggest gap ever.\nPollster Ipsos Mori said it had been asking the same question since 1989 and never found such a large gap.\nThe new poll put the Tories on 43 per cent compared to just 16 per cent for Labour. Since the firm last asked the question in June 2014, the Tories have gained nine points and Labour have lost seven.\nAsked which party had the best team of leaders to solve the country's problems, an Ipsos Mori panel handed David Cameron's Conservatives a 27 per cent lead - the biggest ever\nThe Conservatives held a much smaller lead when the voters were asked who would be better at looking after people like them - winning 33 per cent to 29 per cent.\nLabour were 10 per cent behind when voters were asked who had the best policies for the country - at 35 per cent to 25 per cent - and a massive 20 per cent down when the panel was asked which party was most 'clear and united' on its policies, which the Tories led 33 per cent to 13 per cent.\nAsked about whether Britain should renew the Trident nuclear deterrent - an issue which is causing deep splits within Labour 52 per cent of people backed buying new submarines.\nSome 28 per cent backed Mr Corbyn's suggestion of buying new subs and sending them to sea unarmed as a job protection policy, while 16 per cent supported abandoning the deterrent altogether.\nAsked who they would back if the election was held tomorrow, Ipsos Mori found the Conservatives held a nine point lead at 40 per cent to 31 per cent.\nMr Corbyn is backed in the poll by 66 per cent to 17 per cent for a policy proposal to block dividends for companies which do not pay the living wage.\nOnce the panel was told the policy was Mr Corbyn's idea support fell to 60 per cent - suggesting Mr Corbyn is a drag on even his popular ideas.\nLabour MP John Woodcock, a leading opponent of Mr Corbyn among Labour MPs, told theEvening Standard: 'This poll shows why Jeremy's determination to prioritise a fight over Trident policy is a double win for the Tories.\n'Trying to take us back to the days of unilateralism reopens divisions and makes us seem toxic on an issue that will soon be past the point of no return in the Commons anyway.'\nGideon Skinner, of Ipsos MORI, said: 'Labour starts 2016 with big challenges, being the furthest behind the Conservatives on perceptions of unity and leadership team since we started asking the question.'\nAsked which party was most 'clear and united' on its policy platform, the panel handed another massive lead to the Tories of 20 per cent\nEarlier this month, a separate poll found Mr Corbyn has made no progress with the wider public since his landslide victory in the race to be Labour leader.\nThe numbers are so bad for the Labour leader it proved impossible to identify a worse performing opposition figurehead for the party in the history of routine polling - which began in the late 1940s - this far from the last general election.\nEight months into the first majority Tory government since 1996, an average of polls suggests Labour is eight points behind David Cameron's Conservatives.\nPollsters have suggested even this rating could be optimistic given the huge errors made in surveys ahead of the general election.\nSome corrections to opinion poll methods have been made since every firm failed to spot the eventual Tory majority but there are fears polls still overstate Labour support.\nAccording to research published today, at this stage in the last parliament, Labour was ahead of the Tories by an average of five points.\nMr Cameron, pictured today in the Lake District, holds a big lead over Mr Corbyn, pictured on a visit in the north east of England today, in a series of polling questions\nAnd eight months after losing the 1992 election, Labour had opened up a lead of 10 points.\nThe last time the party was still polling behind the Conservatives this long after an election defeat was in 1988, when it trailed by five points.\nBut it is impossible to find any record since the Second World War of a gap bigger than eight points at this stage in any electoral cycle.\nTo add to Labour's woes, the party has failed to come first in any opinion poll published since the Tories won the general election in May 2015.","url":"https://www.dailymail.co.uk/news/article-3421275/The-Tories-biggest-poll-lead-Labour-Jeremy-Corbyn-leads-party-27-point-deficit.html"}
