{"authors":["Myra Butterworth For Mailonline"],"date_download":"2018-10-22 21:32:07","date_modify":"2018-10-22 21:32:07","date_publish":"2016-01-29 07:01:21","description":"More than half of buyers buy a property because they fall in love with it and the top three reasons for this are location, price and the garden, according to new research.","filename":"data/vaneerConsumption/Thethreerealreasonsbehindwhypeoplebuyaproperty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/20D84DD700000578-0-image-a-4_1453975729586.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/property_article-3420607_The-three-real-reasons-people-buy-property_1540243927.html","title":"The three real reasons behind why people buy a property","title_page":"The three real reasons behind why people buy a property | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The appearance of a property was one of the main reasons buyers were put of a property\nBuyers are told it's all about 'location, location, location' when it comes to making a decision about which property to buy.\nBut new research suggests the reasons why people actually choose a home is a little more diverse.\nMore than half of buyers buy a property because they fall in love with it and the top three reasons for this are location, price and the garden.\nKirstie Allsopp suggests it could be about even more. She told MailOnline: 'It is a given that it is about location. Location is everything. But once you have got the location, what often makes people choose one property other another is perhaps something people don't even acknowledge themselves - and that's aspiration.'\nShe explained: 'Potential buyers look around a house and it could be a holiday picture or a book, something they want to do or be, and that often seals the deal - especially when choosing between two houses.'\nIt's all about 'Location, location, location', according to TV's Kirstie Allsopp and Phil Spencer - but latest research suggests the reasons why people buy a property may be a little more diverse\nDID YOU MAKE AN OFFER ON YOUR HOME OR A PREVIOUS PROPERTY SIMPLY BECAUSE YOU FELL IN LOVE WITH IT? Yes 56% No 44%\nWHAT MADE YOU FALL IN LOVE WITH YOUR CURRENT PROPERTY? (CHOOSING UP TO THREE REASONS) Location 58% Price 37% Garden 29% Interior 15% Living area 13% Kitchen 8% Master bedroom 7% Exterior 7% Natural light 7% Architecturally interesting 5% Beautifully decorated 3% Fireplace 2% Flooring 1% Walls 1% Street name 1%\nThe research by conveyancer My Home Move found that 56 per cent of buyers make their final decision based on whether they have fallen in love with the property.\nRespondents were asked to select up to three reasons why they choose a property. Fifty-eight per cent fell in love with their home due to its location, followed by 37 per cent due to its price. This was followed by those who chose their property due to its garden.\nWhat often makes people choose one property other another is perhaps something people don't even acknowledge themselves - and that's aspiration\nDoug Crawford, chief executive of My Home Move, said: 'Britain's love affair with property is built on location. For most people, location is the secret ingredient that makes them fall in or out of love with their home. Brits also love a bargain, which explains why cost was the second most important factor in making someone fall in love with their home. As house prices continue to climb and many first-time buyers struggle to take their first step onto the property ladder, younger buyers are more willing to scout out up-and-coming areas to try and find a bargain to fall in love with.\n'Unfortunately, not all of those buying a home have the flexibility to pick and choose their ideal location or perfect interiors, especially as demand continues to outstrip supply. Compromise may have to become the buzz word of 2016, as there is little to suggest the situation is likely to ease any time soon as more and more homeowners chase after one property.'\nLocation was also the reason behind people not choosing a property, along with its appearance inside and outside.\nAndrew Montlake of mortgage brokers Coreco, said: 'The vast majority of our clients are fixated on having a home in their perfect location, whether this be for transport links, schools or even a romantic notion about the area itself and are willing to compromise on other aspects, often paying a bit more, to get it.\n'However, an increasing number are now more constrained by price and have shown more willing to investigate other areas, where the features of the property itself become more important once more. While different buyers all have very different opinions on what will make their perfect home, the phrase I hear more often than not is 'I have found a property I have fallen in love with'.\n'Once buyers picture themselves in an area and a particular property where they can build a home, 'love' does the rest.'\nWHEN CHOOSING A LOCATION, WHAT WAS THE MOST IMPORTANT TO YOU? (CHOOSE UP TO THREE) Good transport links 40% Nearby green area (eg. Park, fields, forest) 35% Close to amenities like shops, cafes, restaurants 32% Nearby school 29% Close to family 29% Close to work 23% Up and coming area 16% Close to friends 9%","url":"https://www.dailymail.co.uk/property/article-3420607/The-three-real-reasons-people-buy-property.html"}
