{"authors":[],"date_download":"2018-10-30 22:27:33","date_modify":"2018-10-30 22:27:33","date_publish":"2018-09-05 14:30:14","description":"Would God really tell an ordinary firefighter his plan for America's future? Well that's just what happened 7 years ago, and piece by piece, it's all been coming true. Now this remarkable story has been turned into a movie called \"The Trump Prophecy.\"","filename":"data/vaneerConsumption/TheTrumpProphecyHittingTheatersHowGodToldThisFirefighterHisPlanforAmerica.json","image_url":"http://www1.cbn.com/sites/default/files/styles/original/public/media/standard/images/trumpprophecy.png?itok=qsz3KO_d","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/.cbn.com/cbnnews_entertainment_2018_september_the-trump-prophecy-hitting-theaters-how-god-told-this-firefighter-his-plan-for-america_1540938453.html","title":"'The Trump Prophecy' Hitting Theaters: How God Told This Firefighter His Plan for America","title_page":"'The Trump Prophecy' Hitting Theaters: How God Told This Firefighter His Plan for America | CBN News","title_rss":"NULL","source_domain":"cbn.com","text":"It was a popular book and now it's going to the big screen. \"The Trump Prophecy\" – the story of a firefighter who says God told him Donald Trump would become president years before he even announced he would run – is now a movie, but it hasn't come without controversy.\nThe movie is the story of former Florida firefighter Mark Taylor, co-author of The Trump Prophecies, who says he received a special message from God in 2011 that businessman Donald Trump was headed for the White House.\nProducer Rick Eldridge of Reelworks Studios based in Charlotte, NC says he wasn't sure he wanted to do this film.\n\"I knew it was going to be controversial, I knew it was not going to be an easy movie to make; I knew that people would respond like they responded, but I also knew that we had a nation that really needed to hear some messages of God's intervention in our country,\" Eldridge said.\nThe movie relives the night Mark Taylor received what he calls \"The Commander in Chief Prophecy.\" (full text below)\nMORE: 'He's Not Going Anywhere!' Why 'Fireman Prophet' Calls Trump Impeachment Attempts 'Futile'\n\"I didn't know a lot about Donald Trump, I just knew that he was a very powerful businessman, built this empire, and he was toying with the idea of running for president at the time; most people thought it was a joke so I'm listening to him on an interview and all of the sudden I hear the voice of the Lord say, 'You're hearing the voice of a president,'\" Taylor recalled.\nTaylor says he went into his office, got out a pen and paper, and started to write what he says the Holy Spirit told him.\n\"He was saying basically that America was going to prosper like never before; Israel and America, the ties between the two countries would be stronger than ever before; the dollar would be the strongest it's ever been; it was very detailed as far as what God was showing me,\" Taylor said.\nChris Nelson, an actor and film professor at Liberty University, plays the part of Taylor in the movie.\n\"People hear the title and they think it's all about Trump; it's really about a common man hearing from the Lord and being given wisdom and advice from fellow believers to pray about that,\" Nelson said.\nOne of those believers was Mary Colbert, co-author of The Trump Prophecies and wife of Dr. Don Colbert, who was treating Mark for an illness. After hearing Mark's prophecy, she started a nationwide prayer movement for the presidential election – a movement that became a key part of the movie.\n\"There's a mandate for us as believers to pray for those in authority over us, so that's a deeper message that we really emphasize in the movie,\" said Eldridge.\nThe film was made with the help of Liberty University film students despite the fact that thousands of students signed a petition saying they didn't want the movie made because it could tarnish the film school's reputation.\nFacebook also was not a fan of the film and temporarily blocked all promotional ads, claiming the movie was too political – but Nelson says most people were just reacting to the \"T\" word.\n\"They get squirmy when they hear the words Trump and God together because they think somehow it's lessening who God is by even mentioning his name with Trump, and I think goodness, aren't we all glad that's not how we feel about ourselves,\" Nelson said.\nDespite the controversy, Eldridge believes this movie needed to be made.\n\"We have such a divided nation right now, so I hope this film can in some way be maybe a point toward healing,\" he said.\n\"The Trump Prophecy\" movie is in theaters for two nights only – October 2nd and 4th. Tickets are on sale now here.\nFULL TEXT of Mark Taylor's April 28, 2011 Commander in Chief Prophecy:\n\"The Spirit of God says I've chosen this man Donald Trump for such a time as this. For as Benjamin Netanyahu is to Israel, so shall this man be to the United States of America, for I will use this man to bring honor, respect and restoration to America. America will be respected once again as the most powerful, prosperous nation on Earth other than Israel. The dollar will be the strongest it has ever been in the history of the United States and will once again be the currency by which all others are judged. The Spirit of God says the enemy will quake and shake and fear this man I have anointed. They will even quake and shake when he announces he is running for President. It will be like the shot heard across the world. Then you will say what shall we do now? This man knows all our tricks and schemes. We've been robbing America for decades. What should we do to stop this? The Spirit says, ha, no one shall stop this that I have started, for the enemy has stolen from America for decades and it stops now. For I will use this man to reap the harvest that the United States has sown for and plunder from the enemy what he has stolen and return it back seven-fold to the United States. The enemy will say, 'Israel, Israel, what about Israel?' Israel will be protected by America once again. The Spirit says yes, America will once again stand hand in hand with Israel and the two shall be as one, for the ties between Israel and America will be stronger than ever and Israel will flourish like never before. The Spirit of God says I will protect America and Israel, for this next President will be a man of his word. When he speaks the world will listen and know that there is something greater in him than all the others before him. This man's word is his bond and the world and America will know this, and the enemy will fear this, for this man will be fearless. The Spirit says when the financial harvest begins so shall the parallel in the spiritual for America. The Spirit of God says in this next election they will spend billions to keep this president out. It will be like money down the toilet. Let them waste their money, for where it comes from is being used by evil forces at work, but they will not succeed. This next election will be a clean sweep for the man that I have chosen. They will say things about this man, the enemy, but it will not affect him and they will say it rolls off of him like a duck. For even as the feathers of a duck protect it, so shall my feathers protect this next president. Even mainstream news media will be captivated by this man and the abilities that I gift to him and they will even begin to agree with him, says the Spirit.\" – Mark Taylor","url":"http://www1.cbn.com/cbnnews/entertainment/2018/september/the-trump-prophecy-hitting-theaters-how-god-told-this-firefighter-his-plan-for-america"}
