{"authors":[],"date_download":"2018-10-30 14:17:08","date_modify":"2018-10-30 14:17:08","date_publish":"2017-01-29 00:00:00","description":null,"filename":"data/vaneerConsumption/ThetruthofthefilmPatriotsDay.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_01_the_truth_in_the_film_patriots_day_1540909028.html","title":"The truth of the film 'Patriot's Day'","title_page":"The truth of the film 'Patriot's Day'","title_rss":"NULL","source_domain":"americanthinker.com","text":"The truth of the film 'Patriot's Day'\nEd Lasky's column of yesterday was exactly right; the film Patriots' Day about the Boston marathon bombing of 2103 is a virtual pro-Trump endorsement. While the film does not beat the Obama-is-responsible drum, any reasonably informed person will conclude that the fact that these \"refugees\" were in the US, in Boston, free to be radicalized in mosques that Obama mandated no longer be surveilled, and that the terrorists built those bombs, is because of the Obama administration's extremely lax attitude toward the thousands of people he willingly imported over his eight years as President. It is indeed his responsibility.\nThere can be no question about Obama's indifference to, or his affinity for Muslim immigrants. He has allowed hundreds of thousands of Muslims from middle eastern nations to come here to stay. They have not been seriously vetted. So many have been admitted that the basic rules for investigating their past or present associations were bypassed. DHS. We know that early in his tenure Obama directed the DHS to \"scrub\" the records of Muslim immigrants with terrorist ties. We know that in the weeks leading up to the end of his term, he deleted the registry of Muslim men who have immigrated since 9/11/01. In short, over the eight years of his presidency, Obama enabled the near-mass immigration of unvetted Muslim men while he denied the immigration of the Christians targeted for genocide by ISIS. He set out to and succeeded in importing many, many people who may yet bring death and destruction to more American cities. And he denies that terrorist attacks have taken place on his watch! Like most Democratic politicians, Obama has assumed most of us are uninformed and are incapable of connecting the dots. Aside from the horrific bombing in Boston, there was the slaughter by a Muslim man at Fort Hood, by a Muslim couple in San Bernardino, a Muslim man in Orlando, etc. etc. It is a long list. We are under attack. The glorious aspect of the film is the dedication of the first responders - the police, firemen, medics, doctors, nurses, all those people whose lives are dedicated to saving lives and the heroic nature of the survivors. Two-hundred and sixty-seven people were injured. Sixteen of them lost limbs. Three people were killed, one of them an eight-year old boy. The carnage was perpetrated by two Chechen brothers with homemade bombs they learned to make online. The older brother was on a watch list that was ignored. The Russians had warned DHS about him. Warning ignored. The Obama administration policy mandated that these obviously suspicious people be allowed to operate unmolested. Then these monsters set off their two bombs at the finish line of the Boston Marathon on Patriots' Day, the oldest marathon in US history (since 1897) that commemorates the battles of Lexington and Concord. That the older brother was killed was justice delivered. The younger terrorist was captured and found guilty but is of course appealing his death sentence. He is dead already. He was dead before he committed this terrible crime. He and his brother, like all terrorists - ISIS, Al Qaeda, Al Nusra, Boko Haram, etc. - are cruel, dead souls perpetrating terror across the globe for mindless reasons. No one in the Obama administration ever admitted to the danger posed by these people. Obama himself waffled, excused, would never utter the phrase \"radical Islamic terrorism.\" This is why Trump won.","url":"https://www.americanthinker.com/blog/2017/01/the_truth_in_the_film_patriots_day.html"}
