{"authors":[],"date_download":"2018-10-22 21:21:36","date_modify":"2018-10-22 21:21:36","date_publish":"2017-01-05 00:00:00","description":"Apple says it has \"been informed\" that the app violated local regulations. It's the latest in a long history of media restrictions in China, but also of tech companies getting involved in the efforts.","filename":"data/vaneerConsumption/TheTwoWayNPR.json","image_url":"https://media.npr.org/assets/img/2017/01/05/gettyimages-631008404_wide-37eda66c1679a2c47946511ed3b6333443340326.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=508352372_1540243296.html","title":"The Two-Way : NPR","title_page":"Apple Pulls 'The New York Times' From Its App Store In China : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"AUDIE CORNISH, HOST:\nIf you're trying to download The New York Times on your iPhone in China, there is no longer an app for that. Apple has removed the news app for The New York Times from its mobile store in the country. It's the latest in a long history of tech companies ceding to Chinese restrictions on Western media. NPR's tech blogger Alina Selyukh is here to tell us more. Welcome to the studio.\nALINA SELYUKH, BYLINE: Hi.\nCORNISH: What does Apple say happened?\nSELYUKH: Apple says it is complying with a request from Chinese authorities to remove both the Chinese language and English language news apps by The New York Times from its app store in the country. And The Times reports, actually, this decision happened about two weeks ago. And meanwhile, other big Western news apps are still available to download, like The Wall Street Journal. And even some of the other Times apps are still up, like the crossword puzzle - just not the news app.\nCORNISH: And Apple has been getting some criticism for this move, right? I mean, how do they justify it?\nSELYUKH: The company points out that The New York Times app has long not been permitted to actually display any content to most users and says that it's been informed that the app violates local regulations. Now, Apple isn't specifying what regulations these were exactly, but The Times suggests that it might be the new rules for mobile apps that were issued last year. And they prohibit activities that, for example, might endanger national security or disrupt social order, among other things.\nCORNISH: So how significant is this? I mean, is this the first time Apple has, like, removed a news app just because Chinese authorities asked them to?\nSELYUKH: This is not the first time Apple has removed an app. They've done that with other apps and specifically media apps in the past, but none of them have been as prominent as The New York Times. And it's important to point out that The Times as a website has long faced crackdowns in China, going back to 2012, when they did a series of stories on the wealth of the prime minister's family. And many other Western news outlets have faced similar retaliatory blackouts - for instance, Bloomberg, Time magazine, The Economist. And users in China have sort of adapted to this. They often use software to circumvent the so-called Great Chinese Firewall to surf the web and access some of these websites.\nCORNISH: And I can't imagine it's just news organizations. We know that tech companies have also faced restrictions.\nSELYUKH: Certainly. Twitter, Facebook, Google - they've all faced blackouts. Apple's own books and movie services were shut down very soon after first launching. For tech companies, it's been a very delicate market. It's very large. It's very lucrative. For companies like Apple that make actual things, it's a huge manufacturing hub. Apple specifically has had its iPhone sales slump in recent years in China. But then last year, they did this pretty uncharacteristic investment, putting a billion dollars into basically a Chinese version of Uber, a ride-hailing app, Didi. So a lot of these tech companies are walking a very delicate line, trying to stay within the boundaries of local regulations, but also trying to grow their market share there.\nCORNISH: That's NPR's tech blogger, Alina Selyukh. Thanks so much.\nSELYUKH: Thank you.\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=508352372"}
e world knows that these police are not here to protect and serve us,\" she said. \"They are here to assassinate us. They are here to kill us because we are black.\"\n\"Stay with me,\" Reynolds says at the start of the video, as her boyfriend clutches his side.\n\"We got pulled over for a busted taillight in the back,\" Reynolds says, beginning to tell her story in a video that lasts for nearly 10 minutes. \"The police just ... he's covered.\"\n\"They killed my boyfriend,\" she says as Castile sits in the car, occasionally crying out. \"He's licensed to carry. He was trying to get out his ID and his wallet out his pocket. And he let the officer know that he was — he had a firearm, and he was reaching for his wallet. And the officer just shot him in his arm.\"\nReynolds is then interrupted by the shouts of a police officer who tells her to keep her hands where he can see them. As he speaks, he's pointing the gun inside the car.\n\"I told him not to reach for it!\" the officer yells, as he seems to take deep breaths. \"I told him to get his hands up.\"\n\"You told him to get his ID, sir — his driver's license,\" a remarkably composed Reynolds answers.\nShe then looks at her boyfriend and says, \"Oh, my God, please don't tell me he's dead. Please don't tell me my boyfriend just went like that.\"\nThe officer then tells her to keep her hands where he can see them.\n\"Please don't tell me this, Lord, please, Jesus, don't tell me that he's gone,\" Reynolds says. She later adds, \"Please, Officer, don't tell me that you just did this to him. You shot four bullets into him, sir.\"\nFrom MPR Minnesota Public Radio has this profile of victim Philando Castile: Colleagues, Family Call Philando Castile Good-Hearted, Hard Worker\nMore than a minute into the video, other police officers order Reynolds out of the car. She complies — asking about her daughter as she does so (the video shows that the girl is being held in the arms of an officer).\nA police officer then orders Reynolds to get on her knees, where we hear the sound of handcuffs being placed on her. Her phone is tossed onto the ground, but continues to record. The recording then captures the sound of an officer — seemingly the one who shot Castile — periodically yelling an obscenity.\nReynolds' phone is then returned to her as she sits in the back seat of the police car with her daughter. Toward the end of the video, Reynolds becomes more emotional, screaming, \"I can't believe they did this.\"\nAs Reynolds cries, her daughter tells her, \"It's OK, Mommy. It's OK, I'm right here with you.\"\nCastile was later pronounced dead at a local hospital, family members tell the Minneapolis Star Tribune.\nPastor Danny Givens, who says he was \"like a relative\" to Castile, spoke to NPR's Ari Shapiro on Thursday about his friend.\n\"There were so many amazing qualities and facets about this young man that it's hard to believe this happened,\" Givens said. \"I mean, he was just the kind of man — he had eyes that just spoke life to you. You know, when he saw you, he saw you. And you felt seen by him.\"\nMinnesota Public Radio has more details on the traffic stop and subsequent protests:\n\"The traffic stop came at about 9 p.m. in the area of Larpenteur Avenue and Fry Street in Falcon Heights, near the Minnesota State Fair grounds. \"As news of the shooting spread, some 200 protesters gathered at one point near the site while authorities pursued the investigation, searching for evidence in and around the car.\"\nBy 2 a.m., MPR reports, police had removed the car from the scene.\nEnlarge this image toggle caption Stephen Maturen/Getty Images Stephen Maturen/Getty Images\nPolice issued a brief statement last night, with St. Anthony Sgt. Jon Mangseth, who's the interim chief, saying Reynolds and her daughter were not injured, and that they had been \"transported to another police department agency.\"\nHe added, \"There is no other threat to the public at this time.\"\nMangseth provided few details about the stop, other than to say that the primary officer who pulled the car over and a backup officer were both from St. Anthony.\nHe added that Minnesota's BCA — the Bureau of Criminal Apprehension — had been called in to investigate \"so we can learn what happened.\"\nMangseth also said, \"It's not something that occurs in this area often.\"\nAs MPR reports, \"The Falcon Heights shooting comes just weeks after federal authorities declined to pursue charges against two Minneapolis officers in the Nov. 15 police shooting death of Jamar Clark. Hennepin County prosecutors also declined to press criminal charges against those officers.\"\nThe fatal police encounter in Minnesota also comes close on the heels of a police shooting in Baton Rouge, La., earlier this week. In that incident, bystanders recorded video as Alton Sterling, 37, was pinned to the ground by two officers before being shot to death.","url":"https://www.npr.org/sections/thetwo-way/2016/07/07/485066807/police-stop-ends-in-black-mans-death-aftermath-is-livestreamed-online-video"}
