{"authors":[],"date_download":"2018-10-22 20:37:50","date_modify":"2018-10-22 20:37:50","date_publish":"2015-04-02 00:00:00","description":"In 1960s London, Kit Lambert and Chris Stamp approached a young band to be the subjects of their first film. As a new documentary explains, they ended up managing rock royalty.","filename":"data/vaneerConsumption/TheTwoFilmmakersBehindTheWhoNPR.json","image_url":"https://media.npr.org/assets/img/2015/04/01/11_wide-02e9dd269b25667b48d027d62f28828287fa7cdb.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=396859581_1540240670.html","title":"The Two Filmmakers Behind The Who : NPR","title_page":"'Lambert & Stamp': The Two Filmmakers Behind The Who : NPR","title_rss":"NULL","source_domain":"npr.org","text":"RENEE MONTAGNE, HOST:\nIn rock 'n' roll history, The Who - well, legendary.\n(SOUNDBITE OF SONG, \"MY GENERATION\")\nTHE WHO: (Singing) Talkin' 'bout my generation. The things they do, the...\nMONTAGNE: Loud and unruly, the band filled arenas and sold over 100 million albums. A new documentary out tomorrow called \"Lambert & Stamp\" is about the untold story of two men who discovered and managed The Who. NPR's Elizabeth Blair reports.\nELIZABETH BLAIR, BYLINE: Were it not for Kit Lambert and Chris Stamp, we might never have heard this.\n(SOUNDBITE OF SONG, \"THE KIDS ARE ALRIGHT\")\nTHE WHO: (Singing) I don't mind other guys dancing with my girl.\nBLAIR: Or this...\n(SOUNDBITE OF SONG, \"BEHIND BLUE EYES\")\nTHE WHO: (Singing) When my fist clenches, crack it open before I use it and lose...\nBLAIR: Or this...\n(SOUNDBITE OF SONG, \"PICTURES OF LILY\")\nTHE WHO: (Singing) Pictures of Lily...\nBLAIR: It all started in London in the 1960s. Before they were The Who, they were a scrappy band called The High Numbers, playing for young mods in dark, sweaty pubs.\n(SOUNDBITE OF DOCUMENTARY, \"LAMBERT & STAMP\")\nPETE TOWNSHEND: We wouldn't have been particularly impressive.\nBLAIR: That's The Who's Pete Townshend in the new documentary. The High Numbers were not that impressive, but that didn't matter to Kit Lambert and Chris Stamp because they weren't looking to break into the music business. They were aspiring filmmakers. They approached The High Numbers to see if the musicians would be the subjects of their first film, says Chris Stamp.\nCHRIS STAMP: We didn't come to the group as, like, professional managers. We came with these ideas, and we're filmmakers who wanted to manage. We never said we knew how to do it.\nJAMES COOPER: The story of Kit Lambert and Chris Stamp is probably the greatest untold story in rock.\nBLAIR: That's James Cooper. He directed the documentary \"Lambert & Stamp.\" His fascination was not with The Who, but with these two men, who came from completely different backgrounds. Kit Lambert was an upper-class, suit-and-tie-wearing son of a respected classical conductor. He knew a lot about music.\n(SOUNDBITE OF DOCUMENTARY, \"LAMBERT & STAMP\")\nKIT LAMBERT: I don't see any good classical composers emerging at the moment.\nBLAIR: And he was multilingual.\n(SOUNDBITE OF DOCUMENTARY, \"LAMBERT & STAMP\")\nLAMBERT: (Speaking French).\nBLAIR: Chris Stamp was a working-class street hustler whose father worked on a tugboat. But Stamp was also intellectually curious. When he and Kit Lambert met on a film crew, they hit it off immediately.\nSTAMP: And we discovered that we had exactly the same - I had the same as him - in terms of French cinema, you know, certain types of film that we liked.\nBLAIR: As Lambert and Stamp filmed this rock band, their creative ambitions grew. Working with the band, now called The Who, gave Lambert a chance to use his music background. He encouraged Pete Townshend to write songs and helped Roger Daltrey be more adventurous on stage. Chris Stamp took film production jobs to help pay the musicians a salary. James Cooper.\nCOOPER: It was just a - sort of like a collision of opposites that became, in a weird way, an unstoppable creative force.\n(SOUNDBITE OF THE WHO SONG, \"OVERTURE\")\nBLAIR: In the documentary, Pete Townshend says Kit Lambert had an enormous influence on his music.\n(SOUNDBITE OF DOCUMENTARY, \"LAMBERT & STAMP\")\nTOWNSHEND: Kit had nurtured me as a composer - I don't mean a songwriter. I mean a composer.\nBLAIR: Without Kit Lambert, that rock opera \"Tommy\" might never have happened.\n(SOUNDBITE OF SONG, \"SEE ME, FEEL ME\")\nTHE WHO: (Singing) Listening to you, I get the music. Gazing at you...\nBLAIR: You can tell that Pete Townshend and Roger Daltrey were eager to talk to James Cooper for his documentary about Lambert and Stamp to give them their due. As Cooper puts it, they know that The Who is a mad extension of their daring managers. Elizabeth Blair, NPR News.\n(SOUNDBITE OF SONG, \"SEE ME, FEEL ME\")\nTHE WHO: (Singing) Right behind you, I see the millions. On you, see the glory. From you, I get...\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=396859581"}
