{"authors":["Bradley R. Gitz"],"date_download":"2018-10-30 18:11:03","date_modify":"2018-10-30 18:11:03","date_publish":"2015-04-20 02:44:00","description":"The speed with which America has shifted on the issue of gay rights is historically unprecedented. But many of us who wrote columns a decade or so ago on behalf of same-sex marriage likely never anticipated what is happening now, with bakers and florists being forced by the state under threat of criminal penalty and against their religious convictions to cater same-sex weddings.","filename":"data/vaneerConsumption/Thetangledweb.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_apr_20__1540923063.html","title":"The tangled web","title_page":"The tangled web","title_rss":"NULL","source_domain":"arkansasonline.com","text":"The speed with which America has shifted on the issue of gay rights is historically unprecedented. But many of us who wrote columns a decade or so ago on behalf of same-sex marriage likely never anticipated what is happening now, with bakers and florists being forced by the state under threat of criminal penalty and against their religious convictions to cater same-sex weddings.\nAs Princeton University's Robert George puts it, \"We have seen how swiftly the demands have moved from tolerance to compulsory approbation ... and now it is not only approbation that is demanded, but active participation.\"\nHeather has Two Mommies was once scandalous; it will soon be required.\nYes, we've come a long way, but perhaps too far if you tote up the broader ledger in terms of won and lost freedom. After all, a proper understanding of freedom always places the greatest value upon freedom of association, without which civil society becomes meaningless and the totalitarian alternative wins out.\nThe incredible speed with which we have moved such a vast distance also leaves certain troublesome questions unanswered.\nWhat, for instance, and exactly, is a \"public accommodation?\" Put differently, are photographers and caterers being asked to serve wedding ceremonies the same as Wal-Mart and Red Lobster? If we accept the principle that anyone offering goods or services for a fee must serve everyone in indiscriminate fashion lest penalties be imposed for discrimination, under what circumstances, and for what reasons, can service be refused? And does the right of refusal even exist any longer?\nDoes a black artist have to accept a portrait commission from a KKK member? And, turning things around, would a gay baker be required to bake an anti-gay cake? Based on the shaky logic behind some of the criticisms of the religious freedom proposals of Indiana and Arkansas, the answer can only be \"yes.\"\nGoing further, what does the term \"gay\" even mean, in a civil rights and legal sense?\nMore precisely, and how, precisely, do we know if someone is gay and therefore entitled to receive the legal protections against discrimination that now go with such a classification?\nUnless we resort to offensive stereotypes of overly effeminate men and mannish women, why would anyone suspect (or care) if someone buying that set of flood lights at Home Depot or ordering the all-you-can-eat salad and breadsticks at Olive Garden is gay? This isn't, obviously, the same as black/white or men/women (and even racial and gender distinctions might not be what they used to be, with the spread of interracial marriage and the emergence of the transgender-rights movement, respectively).\nHomosexuality may or may not be an intrinsic condition, but it manifests itself only in behavior and depends for identification purely on claims to that effect. Am I gay if I suddenly say I am? And how can anyone disprove such claims?\nAnd what if it is possible, as appears to be the case, to be gay for a while and then change one's mind and go back to being straight? You frequently hear the terms \"lesbian until graduation\" (LUG) and \"gay until graduation\" (GUG) on college campuses in reference to young women engaging in various forms of sexual \"experimentation.\" So where does that all fit into our burgeoning anti-discrimination framework?\nOne begins to get a sense of how tricky it can become when we seek to apply the civil-rights template used to dismantle Jim Crow in unthinking fashion to something as inherently ambiguous as sexual preference. Only an imbecile incapable of logical reasoning would equate Selma, Ala., with Memories Pizza in Walkerton, Ind.\nThe \"B\" in the now ubiquitous \"LGBT\" also raises questions as to where bisexuals stand in this grievance-mongering and rights-demanding sweepstakes.\nWhat, for that matter, does bisexuality even mean? A precisely equal sexual preference for men and women? Maybe two-thirds one way, one-third the other? Perhaps an on-again/off-again switch that depends on the circumstances and prospective sexual partner?\nGoing further, what if sexual preference more broadly considered isn't binary at all but best expressed along a continuum? What if everyone is at least to some extent bisexual, in the sense of falling somewhere between unequivocally straight at one end and exclusively gay for life on the other? And does anyone who has ever had a same-sex sexual encounter qualify as gay? If not, why not?\nDogs or cats? Chocolate or vanilla? What if mostly one, but sometimes also the other?\nIn short, preference of any kind, especially sexual, is an absurd basis for identity and legal status; more so if you wish to classify it as a \"civil right\" and thereby bring the authority of the state down on behalf of some and against others.\nSo let us, by all means, and in good libertarian fashion, do all we can to discourage bigotry against gays.\nBut let us also recognize in generous spirit that our zeal for equality should never lead us to lose perspective and the capacity for making logical distinctions.\nIt is, after all, a lot easier for a gay couple to find another baker to bake that wedding cake than it is for the baker who declined to find another religion.\n------------v------------\nFreelance columnist Bradley R. Gitz, who lives and teaches in Batesville, received his Ph.D. in political science from the University of Illinois.\nEditorial on 04/20/2015","url":"https://www.arkansasonline.com/news/2015/apr/20/the-tangled-web-20150420/"}
