{"authors":["Stephen Matthews For Mailonline"],"date_download":"2018-10-23 00:59:11","date_modify":"2018-10-23 00:59:11","date_publish":"2017-03-16 10:41:31","description":"After analysing 3,550 blood samples, the Chinese scientists found it deciphered results in just two steps - taking less than 30 seconds.","filename":"data/vaneerConsumption/Thetestthatcantellyouyourbloodtypein30seconds.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E537A9900000578-0-image-a-18_1489660821945.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4319650_The-test-tell-blood-type-30-seconds_1540256351.html","title":"The test that can tell you your blood type in 30 seconds","title_page":"The test that can tell you your blood type in 30 seconds | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A new test can identify a patient's blood type in just a few seconds with 99.9 per cent accuracy, a study shows.\nCurrent methods to determine whether someone in a life-threatening situation is an A, B, AB or O are slow and technically demanding.\nBut the new paper-based test can be performed without the need for specialist equipment, Chinese researchers claim.\nAfter analysing 3,550 blood samples, the scientists found it deciphered results in just two steps - taking less than 30 seconds.\nA new test can identify a patient's blood type in just a few seconds with 99.9 per cent accuracy\nIn life or death situations, medics are often forced to give patients supplies of O blood while they wait for results.\nMismatched blood can lead to death, but this particular type lacks antigens that can trigger immune reactions.\nEach blood type contains its own antigens, and if it detects foreign chemicals it can trigger a body-wide response.\nHowever, because O can safely be given to anyone, this can lead to huge pressure on supplies of the specific blood type, New Scientist reports.\nDr Hong Zhang, of Third Military Medical University, said: 'The rapid turnaround time of the test could be ideal for resource-limited situations, such as war zones, remote areas, and during emergencies.'\nTo create the test, the scientists used chemical reactions between blood serum proteins and a common dye.\nIn life or death situations, medics are often forced to give patients supplies of O blood while they wait for results\nBLOOD TYPE LINKED TO IMPOTENCE Millions of men suffer problems in the bedroom due to ageing, obesity and illnesses like diabetes. But last week scientists discovered there could be another surprising reason why so many struggle to perform – their blood type. A study showed men with blood types A, B or AB are up to four times more likely to suffer impotence – than men who have blood type O. The Turkish findings are potentially significant as it’s estimated more than half of all men carry A, B or AB blood.\nThey applied a small sample onto a test-strip containing antibodies that were built to recognise different blood types.\nThe results appeared as visual colour changes - teal if a blood group antigen was present in a sample, brown if not.\nWith slightly more time - but still in less than two minutes - the test was able to identify multiple rare blood types.\nThe only inconsistencies occurred in trials with highly uncommon blood types, according to the study published in the journal Science Translational Medicine.\nThis comes after researchers claimed earlier this month that a blood test for cancer can show where in the body a tumour is growing.\nUS scientists said it would prevent the need of having a painful biopsy, revolutionising cancer treatment.\nThat is because the normal cells killed off by cancer also release DNA into the bloodstream, which has its own unique signature.","url":"https://www.dailymail.co.uk/health/article-4319650/The-test-tell-blood-type-30-seconds.html"}
