{"authors":["Wolf Richter","Wolf Street"],"date_download":"2018-10-30 23:11:36","date_modify":"2018-10-30 23:11:36","date_publish":"2018-07-22 00:00:00","description":"Demand in the US has been very strong for all modes of transportation, but freight shipment volumes appear to be slowing down from May peaks. Transportation is an infamously cyclical industry.","filename":"data/vaneerConsumption/Thetruckingandrailindustrymayhavereacheditspeakthisyear.json","image_url":"https://amp.businessinsider.com/images/5b0584e01ae6621b008b4579-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-trucking-and-rail-industry-may-have-reached-its-peak-this-year-2018-7_1540941096.html","title":"The trucking and rail industry may have reached its peak this year","title_page":"    The trucking and rail industry may have reached its peak this year - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Everyone in the industry is loving it.\n\"The environment for us right now compared to where we were at the end of last year is dramatically different,\" CSX CEO Jim Foote said Tuesday evening, when the railroad reported that earnings had jumped 72% from a year ago on a 6% revenue increase. \"In terms of the pricing environment and the capacity environment, it's a good time to be in the railroad business,\" he said.\nThe day before, trucking company J.B. Hunt reported that revenues rose 24% year-over-year and net income 7%. It attributed the surge in revenues to higher shipping volumes, the prices it has been jacking up in response to the demand, and an improved freight mix.\nContainer imports at the ports of Los Angeles and Long Beach, the largest ports in the US, rose 8.4% year-over-year in June. Typically, about 70% of their container imports are from China. Container imports at the Port of Oakland, which also gets a large portion of its imports from China, jumped 8.7% in June.\nIn the US, demand has been very strong across all modes of transportation. Freight shipment volume (not pricing) by truck, rail, air, and barge, according to the Cass Freight Index, jumped 7.2% in June compared to a year ago. This pushed the index, which is not seasonally adjusted, to its highest level for June since 2007. The index does not include shipments of bulk commodities. Note the strong seasonality in the chart below with volume in June typically declining from May:\nWolf Street\nBut the year-over-year increase in June of 7.2% pales against the 11.9% year-over-year increase in May. While still hot, June was the first single-digit increase this year, with the prior five months popping at year-over-year growth rates between 10.2% to 12.5%:\nWolf Street\nThe Cass report points out that \"demand is exceeding capacity in most modes of transportation by a significant margin\" and that \"pricing power has erupted in those modes.\"\nThere are now \"signs that the transportation infrastructure has reached its limit, at least in the short-term, to accommodate higher rates of volume growth.\" And \"many modes are reporting limited amounts of capacity or even no capacity at any price shippers are willing to pay.\"\nSome of the capacity squeeze, especially among small truckers, earlier this year was blamed on the newly required Electronic Logging Devices (ELDs) that record actual drive times by truckers and thus help enforce the legal hourly limits truckers can drive. While this hurt capacity and utilization of truckers early on, Cass points out that truckers largely resolved these issues and that equipment utilization has since been increasing - but not in all segments:\nThis is especially true in the Dry Van and Reefer (refrigerated) marketplaces of trucking, while the Flatbed segment of trucking is continuing to struggle with productivity since the adoption of ELDs.\nIndustrial demand on transportation is strong as well - the revived oil-and-gas drilling boom, construction, manufacturing, etc. Much of this heavy equipment is hauled on flatbed trailers. And demand suddenly spiked this year, according to the weekly DAT Flatbed Barometer, cited by Cass. But there is no infinite spike or endless exponential increase (values above 50 indicate demand exceeds capacity; click to enlarge):\nWolf Street\nFlatbed spot prices, excluding fuel surcharges, jumped 26.7% year-over-year in June, and contract prices rose 10.5%, according to DAT. On top of this, fuel surcharge soared 60% year-over-year.\nThe total amount that shippers spent on freight by all modes of transportation - by truck, rail, barge, and air - given soaring prices and shipping volume, jumped 15.9% in June from a year ago, according to the Cass Freight Expenditure Index. It was the 9th double-digit year-over-year increase in a row:\nWolf Street\nThis increase in the index \"clearly signals that capacity is tight, demand is strong, and shippers are willing to pay up for services to get goods picked up and delivered in all modes throughout the transportation industry,\" Cass said.\nThe rising price of fuel and the related fuel surcharges added to the amounts spent: the US average retail price of diesel was up 30% at the end of June ($3.22) from a year ago, according to EIA data. However, it remains substantially below the range of the years before the Oil Bust:\nWolf Street\nBut the Cass Truckload Linehaul Index, which tracks per-mile full-truckload pricing but does not include fuel or fuel surcharges, jumped 9.5% in June, the largest year-over-year increase in the data going back to 2005:\nWolf Street\nPrices for \"intermodal\" freight have spiked. Intermodal involves a combination of several modes of transportation: in the continental US, mostly truck and rail, such as a container hauled by truck to an intermodal facility, loaded on a train, and at the destination transferred to a truck for final delivery; or a trailer piggybacking for part of the trip on special rail cars.\nThe Cass Intermodal Price Index, which includes fuel prices, jumped 10.9% in June compared to a year ago, the 21st month in a row of year-over-year increases, and the sharpest year-over-year increase since August 2011. Wolf Street\nTransportation - trucking in particular, but also railroads - is an infamously cyclical industry that suffered through the \"transportation recession\" from 2015 through much of 2016, when the goods-based sector in the US slowed down, inventories were high, and demand from shippers fell sharply. With impeccable timing, it came just after the industry had invested in capacity additions. Excess capacity reigned, and prices fell.\nNow, once again, euphoric trucking companies are building capacity to meet demand. This has led to record orders for new Class 8 trucks that exceed the capacity of truck manufacturers that two years ago were laying off workers. And so the cyclicality of the business continues.","url":"https://www.businessinsider.com/the-trucking-and-rail-industry-may-have-reached-its-peak-this-year-2018-7"}
