{"authors":[],"date_download":"2018-10-30 01:07:53","date_modify":"2018-10-30 01:07:53","date_publish":"2016-02-19 00:00:00","description":null,"filename":"data/vaneerConsumption/TheTrumppopedustup.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_02_the_trumppope_dustup_1540861673.html","title":"The Trump/pope dustup","title_page":"The Trump/pope dustup","title_rss":"NULL","source_domain":"americanthinker.com","text":"But they have waited in vain for months, as Trump as thrown out insult after insult without any seeming consequences to his favorability in the polls.\nHowever, Donald may just have thrown out one insult too many. In a campaign full of firsts, Trump has been the first candidate for the presidency to get into verbal fisticuffs with the head of the Roman Catholic Church. The dustup with the pope just might prove to be the last straw for The Donald, especially where American Catholics are concerned.\nThe Associated Press reports that Pope Francis said Donald Trump is \"not Christian\" if he wants to build a wall along the U.S.-Mexican border. Francis said: \"A person who thinks only about building walls, wherever they may be, and not building bridges, is not Christian. This is not in the gospel. ... I say only that this man is not Christian if he has said things like that.\"\nThe pope concluded his comments by saying, “We must see if he said things in that way, and in this I give the benefit of the doubt.”\nTrump’s usual time period for deep contemplation is measured in seconds, and his inclination to give the pope’s comments the benefit of the doubt was nonexistent. His immediate “back at you” response to the pope revealed once again his inability to take time out to collect his thoughts in order to give a considered response. Almost instantly, he called the pope “disgraceful” for questioning a person’s faith. Fox News reported that Trump actually called the Holy Father “pathetic.”\nWhile it is true that Pope Francis’s comments may have been off the cuff and a bit indiscreet, it’s well to let the portent of Trump’s insults to papa Francis sink in a bit. The exchange between the two is not the same as candidates trading barbs at the Republican debates.\nThe Donald probably doesn’t understand that insulting the pope is not the same as being viciously offensive to Ted Cruz, Jeb Bush, Marco Rubio, or any other political figure. It’s not even the same as insulting a head of state or a national figurehead like Queen Elizabeth II.\nIt far, far worse – at least in the minds of millions of America’s Roman Catholics.\nRemember the euphoric crowds who greeted the pope when he came to Philadelphia? The entire city shut down as millions of Catholics from all over America and even beyond celebrated the arrival of Pope Francis, bishop of Rome and sovereign of Vatican City. The pope was afforded special reverence and pomp because of his special status as head of the Roman Catholic Church, a small matter that apparently escapes Trump.\nThe fact is that Catholics hold the pope in special reverence as the vicar of Christ. He is to be venerated.\nWhat does the title “Vicar of Christ” entail?\nThe title implies the pope has matchless, unrivaled and universal primacy, both in honor and jurisdiction, over the entire Church of Christ. For Catholics, the pope stands in direct line of succession to the apostle Peter, who was told by Christ to “feed my lambs ... feed my sheep.” The pope is considered the “Prince of the Apostles” and supreme guardian of the Church. He is believed to stand in the place of Christ as the leader of the Roman Catholic Church and is considered to utter the infallible word of God when he speaks ex cathedra. There is a reason, then, the pope is often called His Holiness. The very weight of divinity is considered to sit on the shoulders of Pope Francis, even though he himself is regarded by the Church as a fallible man under everyday circumstances.\nTherefore, to insult the pope by calling him “disgraceful” or “pathetic” is in some respects to also insult the magisterium of the Church, which authority is considered invested uniquely in the pope and bishops, all of whom are considered in communion with the correct and true teachings of the Catholic faith. In other words, to insult the pope is to insult the entire Catholic Church – every bishop, every priest, every nun, and every communicant.\nProtestants reject the Catholic view of the papacy – that is why they are called Protestants – but obviously, the spiritual significance of the pope is overwhelmingly a primary doctrine for Catholics. Even those Catholics who may reject some of the doctrines and tenets of the faith such as the highly unpopular (and widely ignored) prohibition against birth control generally refrain from savaging the pope. Most, as was evidenced by the huge crowds in Philadelphia, hold the pope in reverence and with great affection, regarding him as their spiritual father.\nPerhaps most pertinent to Donald Trump and his campaign: Catholics don’t take insults to the Holy Father lightly. Also pertinent to The Donald’s candidacy: Catholics vote.\nPerhaps during the remaining primaries, Donald Trump will see some damaging effects kick in because of his careless and egregious insults to the head of the Roman Catholic Church.\nOne can hope.\nFay Voshell may be reached at fvoshell@yahoo.com","url":"https://www.americanthinker.com/blog/2016/02/the_trumppope_dustup.html"}
