{"authors":["Karen Freifeld"],"date_download":"2018-10-30 20:55:44","date_modify":"2018-10-30 20:55:44","date_publish":"2016-12-23 00:00:00","description":"Barclays said the claims are 'disconnected from the facts' and that it has an obligation to defend against 'unreasonable allegations and demands.'","filename":"data/vaneerConsumption/TheUSissuingBarclaysovermortgagebackedsecurities.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_us-department-of-justice-sues-barclays-over-mortgage-backed-securities-sales-2016-12_1540932944.html","title":"The US is suing Barclays over mortgage backed securities","title_page":"    US Department of Justice sues Barclays over mortgage backed securities sales - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"James 'Jes' Staley, CEO of Barclays. Getty NEW YORK (Reuters) - The US Department of Justice on Thursday sued Barclays and two former executives on civil charges of fraud in the sale of mortgage-backed securities during the run-up to the 2008-09 financial crisis.\nThe lawsuit was filed after Barclays resisted a penalty the US government had sought in settlement negotiations, a person familiar with the matter said. The person would not disclose the government's demand.\nMajor US banks, including JPMorgan Chase & Co and Bank of America Corp, have paid tens of millions of dollars to settle similar claims over misconduct in the sale and pooling of mortgage securities, which helped to cause the financial crisis.\nBarclays was among a handful of European banks still under investigation by the Justice Department, according to company disclosures. Deutsche Bank and Credit Suisse also agreed to settle on Friday.\nBarclays is accused of deceiving investors about the quality of loans underlying tens of billions of dollars of mortgage-backed securities between 2005 and 2007, according to the lawsuit filed in US District Court in Brooklyn. Loans had been made to borrowers with no ability to repay and were based on inflated home appraisals, the complaint said.\nAccording to the lawsuit, more than half the underlying loans in $31 billion worth of mortgage loans pooled into 36 deals defaulted.\n\"With this filing, we are sending a clear message that the Department of Justice will not tolerate the defrauding of investors and the American people,\" US Attorney General Loretta Lynch said in a statement.\nIn a separate statement, Barclays said the claims in the lawsuit are \"disconnected from the facts\" and that it has an obligation to defend against \"unreasonable allegations and demands.\"\nA Justice Department spokesman would not comment on negotiations or the penalty sought during talks. The lawsuit does not include a penalty amount.\nA Barclays spokesman would not comment on negotiations beyond the statement. Barclays said in a statement on Friday in London:\n\"Barclays rejects the claims made in the Complaint. Barclays considers that the claims made in the Complaint are disconnected from the facts. Barclays will vigorously defend the Complaint and intends to seek its dismissal at the earliest opportunity.\"\nThe London-based bank's US-traded shares ended down 1.8% at $11.07 in regular trading on Thursday.\nBarclays has set aside $3.1 billion to generally cover litigation and penalties, but has not made a specific provision for the mortgage probe. A settlement in excess of $1.5 billion would lead to increased provisions and could impact the bank's core capital ratio, JPMorgan analysts have said.\nIn addition to Barclays and its affiliated companies, the complaint targets two former executives: John T. Carroll and Paul Menefee, both former managing directors at Barclays Capital units.\nCarroll, Barclays' head subprime trader in the run-up to the housing crisis, and Menefee, the banker in charge of due diligence on the subprime deals, were central to the alleged scheme, the complaint said, and stand accused of intentionally making false representations.\nWhen asked about 40 loans already delinquent before a deal closed, for instance, Carroll told Menefee to \"just leave them in,\" according to the lawsuit, and Menefee did.\nMenefee, who blamed the delinquent loans on fraud, then falsely represented to investors and credit ratings agencies that the deal did not contain such delinquent loans, the complaint said.\nBarry Berke, a lawyer for Menefee, 47, of Austin, Texas, called the complaint a \"misguided attempt\" to blame his client and others for losses that resulted from the collapse of the US housing market.\nA lawyer for Carroll, 49, of Port Washington, New York, did not return a call for comment.\nThe complaint alleges violations of the Financial Institutions Reform, Recovery, and Enforcement Act of 1989 (FIRREA), based on mail fraud, wire fraud, bank fraud as well as other misconduct.\nThe statute allows for civil penalties up to the amount of Barclays' gain, or the amount of losses suffered by others.\nThe actions against the banks over mortgage securities stem from a 2012 initiative by US President Barack Obama to pursue the misconduct that helped lead to the financial crisis. The Trump administration, which takes over on January 20, will oversee any ongoing matters.\n(Reporting by Karen Freifeld, additional reporting by Rodrigo Campos in New York and Lawrence White in London; editing by Cynthia Osterman and G Crosse)","url":"https://www.businessinsider.com/us-department-of-justice-sues-barclays-over-mortgage-backed-securities-sales-2016-12"}
