{"authors":[],"date_download":"2018-10-30 00:57:05","date_modify":"2018-10-30 00:57:05","date_publish":"2018-06-18 15:15:56","description":null,"filename":"data/vaneerConsumption/TheUnitedNationsFlawedCondemnationofIsrael.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/themes/amspec-v1/_img/favicon.ico?v=2","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861025.html","title":"The United Nations' Flawed Condemnation of Israel","title_page":"The United Nations' Flawed Condemnation of IsraelThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"On Wednesday, June 13th, The United Nations overwhelmingly condemned Israel for “excessive use of force” against innocent civilians in border protests that started in late March in the days leading up to the United States moving its embassy to Jerusalem. Since the start of the protests, 120 Palestinians have been killed by the Israeli Defense Force at the border.\nViolence and fatalities, especially of the innocent, ought to be avoided if possible. If the story was “IDF headhunts Palestinian civilians,” then these actions by the UN would be warranted–but such was not the case. Not only did the UN fail to accurately depict the situation, but it actively sought to suppress information that changed the narrative of the protests over the past two months.\nIt is important to ask first, “Why did these protests occur?” Initially peaceful, Palestinians began to gather at the Gaza-Israeli border in March to protest the U.S. Embassy move from Tel-Aviv to Jerusalem. To many in the Arab community, this swap was problematic because of their refusal to recognize Jerusalem as Israeli land. Israel secured Jerusalem in the 6-Day War in 1967 when Jordan began an offensive against them. Israel countered the Jordanians and drove them back out of what was then East and West Jerusalem.\nEnter Hamas. Hamas is Palestine’s leading political party and a globally recognized terrorist organization. It is also backed financially and militarily by Iran, a country that has pledged the destruction of the Jewish state. The militant extremist branches of Hamas incited violence in these protests that was not seen before their involvement.\nIt is worth mentioning that the extremist sects of Hamas are notorious for using Palestinian women and children as human shields and hiding weapons caches in schools and hospitals for the sake of forcing the Isreali’s hands in contributing to civilian casualties. The United Nations has released annual reports in years past confirming these actions. They are also the same leading political party that financially compensates the families of those that have committed acts of terror against Israel.\nHamas’ paramilitary involvement in these protests created a far more dangerous situation for the peaceful protesters and the IDF. In escalating violence, members of the protest commenced the use of Molotov cocktails and petrol bombs flown over the border with kites (one of which prominently displayed a swastika). Contributor to the American Spectator, John C. Wohlsetter, provides further insights into the protestors’ aggressions. Beyond this, protesters have, in several instances, attempted to rush and cross the border fence. Yet, the UN resolution condemning Israel for its “excessive use of force” did not once mention any of this.\nAs a thought experiment, one may consider, “What was Israel to do?” It is a shame that there were innocent civilian casualties and injuries — Palestinians that did not take part in the violence were harmed. It is important, however, to make a clear distinction that Israel did not see these protests as an opportunity to kill as many Palestinians as possible. These protests, especially when they turned violent, thrust Israel into a position to defend its border. Of course, Israel and Palestine have differing stories on the militant status of the protestors killed.\nDuring the protests, the IDF has been running a live twitter feed of their defensive actions with video recordings for reference. In addition to this, the IDF have on several occasions dropped leaflets from aircraft warning protestors not to approach the border fence.\nIn response to the Israeli defense, Hamas fired approximately 100 rockets toward heavily populated Israeli towns and cities. The Iron Dome Missile defense system was able to prevent the projectiles from causing any civilian casualties. Again, the UN failed to make any mention of this in their latest condemnation towards Israel, even after the United States proposed an amendment enumerating such.\nIn the UN general assembly chamber, Turkey, Algeria, and Palestine, some of Israel’s most outspoken critics, proposed a resolution condemning Israel for “excessive use of force.” The Palestinians also formally requested heavier security apparatus to defend themselves against the Israelis. A majority of countries also chose to neglect the defensive position Israel maintained or any mention of Hamas’ involvement. The only nations that voted against this measure were Australia, the Marshall Islands, Micronesia, Nauru, Solomon Islands, Togo, the United States, and Israel.\nThe greater community of the United Nations chose to forgo objectivity, and opt for a one-sided narrative.","url":"https://spectator.org/the-united-nations-flawed-condemnation-of-israel/"}
