{"authors":["Naomi Greenaway For Mailonline"],"date_download":"2018-10-22 23:57:12","date_modify":"2018-10-22 23:57:12","date_publish":"2016-01-28 13:15:03","description":"Micha, 27, and Phillip Trim, 36, from Romford, Essex married in Carnglaze Caverns in the Loveny Valley, Cornwall, but the couple and their guests had to wear hard hats with their outfits.","filename":"data/vaneerConsumption/TheUKsmostuniqueweddingvenueCouplemarryinapicturesquecave.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9B1D000000578-0-image-a-12_1453981250101.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420722_The-UK-s-unique-wedding-venue-Couple-marry-picturesque-cave_1540252632.html","title":"The UK's most unique wedding venue? Couple marry in a picturesque cave","title_page":"The UK's most unique wedding venue? Couple marry in a picturesque cave | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A couple transformed a dark cave in Cornwall into a beautiful alternative wedding venue with more than 500 twinkling candles.\nBride and groom Micha, 27, and Phillip Trim, 36, from Romford, Essex, had to accessorise with hard hats and put up with lots of uninvited guests - in the form of a large population of bats.\nHowever they were determined to tie the knot in the picturesque Carnglaze Caverns, in the Loveny Valley, near the village of St Neot.\nMicha and Phillip Trim, from Romford, Essex, on their wedding day inside the picturesque Carnglaze Caverns, in the Loveny Valley, near the village of St Neot\nThe bride and groom, Micha and Phillip, with their 40 guests - who all had to wear hard hats for the big day as the unique venue is located beneath a slate quarry\nThe couple invited 40 guests to the underground ceremony, all of whom had to wear hard hats to accompany their elegant outfits.\nThe magical venue is underneath a slate quarry and boasts a crystal clear lake, along with its unique wildlife.\nThe bride wore her veil over a hard hat as she walked down 60 slate steps to reach the ceremony 200ft underground.\nTo capture their special day, Micha and Phillip enlisted the help of photographer Colin Paul, who had to rise to the challenge of shooting without using a flash, so as not to disturb the sleeping bats.\nColin, 55, from Redruth, Cornwall, said: 'When I was first asked to photograph a wedding in the caverns, I knew it would be challenging, but I didn't realise just how hard it would be.'\nIlluminated with 500 candles, the cave in Cornwall was transformed into a unique underground wedding venue\nMicha wearing her veil over a hard hat, makes her way down 60 slate steps to the picturesque cave\n'I visited the cave before the wedding and casually mentioned to the owner that a flash would help to lighten things up a little bit,' the photographer explains.\n'It was then that they dropped the bombshell that I couldn't use a flash because camera and phone flashes can disturb the sleeping bats.\n'After investing in some extra lighting, I was able to take some photographs by the underground lake that look like they were taken in a studio.\n'Luckily the bats aren't disturbed by constant, gentle lighting.'\nThe cavern can hold up to 40 people, including the bride, groom, photographer and members of Carnglaze Cavern staff.\nThe bride poses beside the lake. The cavern ceilings are lower in this part of the cave so hard hats can be taken off\nInside the magical venue, which is underneath a slate quarry in the Loveny Valley, is a crystal clear lake\nColin said: 'Hard hats need to be worn by all the guests, the registrars and the photographers when entering and leaving the caverns.\n'But beside the lake, the cavern ceilings are lower so hard hats can be taken off during the ceremony.\n'I advise to tell guests about this restriction beforehand - there's not much point in spending a fortune on a special hairstyle only to stick a hard hat on it when you arrive.'\nThe caves are a constant ten degrees Celsius all year round and feel cool in the summer and warmer in the winter.\nColin explained: 'Depending on the time of year, the roof can sometimes drip with water. But I still really enjoyed taking photographs at this venue.\n'I already have more bookings lined up for cavern weddings this year.'\nPhotographers are not allowed to use a flash so as not to disturb the large population of bats in the cave. Colin Paul from Cornwall was given the challenge of capturing the ceremony on camera\nInside the stunning candle-lit cave where the ceremony took place. The venue fits a maximum of 40 guests\nThe hard hats worn inside the Cornish cavern are not the best accessory and guests are warned ahead of the ceremony so they do not waste time on an elaborate hairdo","url":"https://www.dailymail.co.uk/femail/article-3420722/The-UK-s-unique-wedding-venue-Couple-marry-picturesque-cave.html"}
