{"authors":[],"date_download":"2018-10-30 00:50:28","date_modify":"2018-10-30 00:50:28","date_publish":"2018-09-13 00:05:36","description":"Commenting on our U.S. Open coverage, a reader observes that a penalty is not the same as a warning during match play and we spun the beginning of the drama in the women’s final, when the queen of Queens — six-time winner Serena Williams — scolded umpire Carlos Ramos for enforcing the rules and turned the show into a nightmare, notably for the young challenger, Naomi Osaka, with the support of most the gallery (24,000 strong) and the tennis establishment led by USTA president Katrina Adams.","filename":"data/vaneerConsumption/TheUSOpenTeaches.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/BrokenRacket.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860628.html","title":"The U.S. Open Teaches","title_page":"The U.S. Open TeachesThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Commenting on our U.S. Open coverage, a reader observes that a penalty is not the same as a warning during match play and we spun the beginning of the drama in the women’s final, when the queen of Queens — six-time winner Serena Williams — scolded umpire Carlos Ramos for enforcing the rules and turned the show into a nightmare, notably for the young challenger, Naomi Osaka, with the support of most the gallery (24,000 strong) and the tennis establishment led by USTA president Katrina Adams.\nTAS stands corrected and appreciates alert reader May Fairfly’s precision. However, we must plead flawed reporting, not spin. Serena Williams received a warning, not a penalty, for coaching, and an automatic point penalty a little later for racquet abuse. These are not the same (though they are related to the degree warnings unheeded lead to penalties). The mis-statement resembles an error more than a spin.\nMiss Williams broke Miss Osaka’s service early in the second set. She was then broken back (contributing with two doubles). In the next game, starting with a free point, Miss Osaka held serve to make it 3-3. The free point was due to an automatic point penalty for equipment abuse when Miss Williams smashed her racquet on the floor.\nThe reason she got a free point was that Miss Williams had smashed her racket on the floor after Miss Osaka’s break-back; by the rules, such demonstrations of passions earn a point penalty automatically.\nMiss Williams was next broken again, making it 3-4. By then she seems to have got it in her head the original warning, issued by chair umpire Carlos Ramos to her coach Patrick Mouratoglou, was the cause of her falling behind. She viewed it as unfair, sexist, insulting, and more. It perturbed her to the extent of causing her to lose the 3-1 lead. This is, psychologically, not unreasonable, and was the basis for further claims that the ump was not neutral. She argued, or rather denounced, Carlos Ramos during the changeover at 4-3 (Osaka to serve), and she was not ladylike in the way she spoke to him. The tirade, called umpire abuse, led Mr. Ramos to issue a game penalty, 5-3 (Williams to serve). At the final of a Grand Slam, with a player down a set, this is indeed strict. Umpire-abuse rules allow for leniency.\nMr. Mouratoglou after the match said he coached her and some observers thought he made this remarkable statement to take the fall and also to blame the system (“we all do it 100 percent of the time,” he said, which of course implies Miss Williams was being singled out, as she claimed, as well as that the sport is rife with rule-breaking).\nLost in the heat was the possibility that the coach’s purpose was to deflect from the racket abuse penalty. While it helped Miss Osaka hold serve at 2-3, it was clear by then that she had the momentum and his player was losing the match fair and square.\nThe unseemly argument that followed might have intimidated a less steel-nerved player than Miss Osaka, caused her to feel guilty, lose her concentration. Failing that, it denigrated her superior play since the whole issue then became whether it was a fair match. The insensitivity — not to say cruelty — to a very young and very good player is painful: especially as Mouratoglou was speaking after the match was over.\nThis extreme gamesmanship may explain Mouratoglou’s statement. Playing every card in the victimhood catalog all the way through the trophy ceremony and the official presser, condescending to the deserving new champion, leaves open the unhappy notion that the Williams camp was putting forth the spin (the word is apt here) that she did not lose, she was robbed.\nThat is a very strong term and unfair to the umpire. Shockingly, the USTA bigs made statements that implied they believed this. Whether or not they did, indeed whether or not it was so, the trophy ceremony was scarcely the place to say so. And the uncomfortable consequence was that afterwards, it was apparent that if anyone was robbed it was Miss Osaka.\nShaken and in tears as the crowd booed her, she had the courage to tell top executives and 24,000 hysterical fans to their faces that she knew it was not what they wanted. Yet she had said earlier that on the court, she sees only another player, not an idol. The USTA bigs, alas, were behaving like craven idol-worshippers.\nInstead of pointing to Miss Osaka’s fortitude and respect, Miss Williams at the podium nodded coldly when Naomi Osaka made gracious remarks in her direction, rather diminishing her appeal to the crowd to stop booing after letting them do so. You might almost say the spin never ended.\nA day or two later, the International Tennis Federation expressed its support for Mr. Ramos. The U.S. Open fined Miss Williams for three code violations (coaching, racquet-smashing, ump-abusing); such fines are not uncommon and several others were assessed during this tournament. The WTA insists that the rules are not applied equally as between women and men and must be revised. Players vary in their view of what this might mean in a culture already thoroughly confused about gender and much else.\nSo the women’s final at the 50th U.S Open will be a topic for a while in our national “conversation,” to use the fashionable term. It is only sport, but it is an index of who we are as a society, what we think and want.Meanwhile, the affair still rages through the tennis press, likely will until the Davis Cup semifinal ties between France and Spain and the U.S. and Croatia in a few days create an opening for other news.It may be a good sign that much if not all of the serious reporting has told it, as used to be said of political news, the way it happened. For this, surely, we can be grateful.","url":"https://spectator.org/the-u-s-open-teaches/"}
