{"authors":["Lani Seelinger"],"date_download":"2018-10-31 01:40:53","date_modify":"2018-10-31 01:40:53","date_publish":"2018-08-28 14:21:01","description":"In most cases, you'd think it would be flattering to get recognition for your company's influence on a global scale. Sometimes, though, that influence isn't exactly considered a good thing. In one powerful example, the UN criticized Facebook for its…","filename":"data/vaneerConsumption/TheUNCriticizedFacebookForItsRoleInTheMyanmarRohingyaGenocide.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/3fb39489-5f94-4eb7-a8d8-06e98311006a-getty-1024498436.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-un-criticized-facebook-for-its-role-in-the-myanmar-rohingya-genocide-10348052_1540950053.html","title":"The UN Criticized Facebook For Its Role In The Myanmar Rohingya Genocide","title_page":"The UN Criticized Facebook For Its Role In The Myanmar Rohingya Genocide","title_rss":"NULL","source_domain":"bustle.com","text":"In most cases, you'd think it would be flattering to get recognition for your company's influence on a global scale. Sometimes, though, that influence isn't exactly considered a good thing. In one powerful example, the UN criticized Facebook for its role in genocide in Myanmar — and it's all based on how people used Facebook to spread false information about the Rohingya minority in that Southeast Asian country.\nUnited Nations (UN) investigators have just released a report recommending that multiple top officials from Myanmar's army be prosecuted in international criminal court for their alleged systematic killing and gang rapes of members of the Muslim Rohingya people native to Myanmar's Rahine state, according to Reuters. Facebook, the report said, was negligent in allowing hate speech to be propagated on its platform and was \"too slow\" to respond to it.\nFacebook responded to the report with bans of numerous organizations and people involved, including top government and military officials, according to CNN.\n\"We want to prevent them from using our service to further inflame ethnic and religious tensions. The ethnic violence in Myanmar has been truly horrific,\" Facebook said in a statement, according to CNN. \"While we were too slow to act, we're now making progress — with better technology to identify hate speech, improved reporting tools, and more people to review content.\"\nIn mid-August, Reuters released a report chronicling Facebook's failure to monitor and reduce hate speech in Myanmar directed at the Rohingya. The problem, according to the report, began at least five years ago and has continued even after Facebook CEO Mark Zuckerberg claimed that his company was hiring more people to review posts in Burmese, the majority language in Myanmar. In April, Zuckerberg pledged to fix the problem and hired at least 60 more Burmese speakers; before that, Facebook only had two employees who spoke Burmese, whom it hired in 2015.\nAccording to a report from BuzzFeed News, Facebook certainly didn't have so few Burmese speakers because those employees didn't have any work to do. Their analysis found that of the majority party in the Rakhine state's posts on Facebook, at least one in ten contained hate speech towards the Rohingya.\nEven now, according to the Reuters report, Facebook employs only 63 Burmese speakers to monitor the posts coming from the 18 million active Facebook users in Myanmar — and Burmese, because of its alphabet, isn't a language that responds well to translating algorithms.\nFacebook, according to BuzzFeed, has now responded to the UN's report by taking unprecedented steps. They banned Myanmar's army chief from using the platform, the first time that any country's military leader has ever been banned. In total, the ban extends to 18 accounts, many belonging to high ranking officials, plus one Instagram account and 52 Facebook pages, according to Facebook's announcement of the bans.\nAccording to their announcement, they're also in the process of carrying out their own human rights impact assessment of the situation, and they'll continue working to prevent this sort of misuse in the future.\n\"This is a huge responsibility given so many people there rely on Facebook for information,\" the announcement said. \"More so than in almost any other country given the nascent state of the news media and the recent rapid adoption of mobile phones. It’s why we’re so determined to do better in the future.\"","url":"https://www.bustle.com/p/the-un-criticized-facebook-for-its-role-in-the-myanmar-rohingya-genocide-10348052"}
