{"authors":["Andrew Court For Daily Mail Australia"],"date_download":"2018-10-23 02:27:47","date_modify":"2018-10-23 02:27:47","date_publish":"2017-04-26 13:34:42","description":"Boy George snapped at Seal on Wednesday night's episode of The Voice, as the two fought over a contestant to join their respective teams.","filename":"data/vaneerConsumption/TheVoiceAustralia2017BoyGeorgeSNAPSatSeal.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F816F00000578-0-image-a-37_1493209278520.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447610_Feisty-Boy-George-SNAPS-Seal-Voice_1540261667.html","title":"The Voice Australia 2017: Boy George SNAPS at Seal","title_page":"The Voice Australia 2017: Boy George SNAPS at Seal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The sixth season of The Voice is in full swing, and tensions are growing between the superstar coaches.\nOn Wednesday night's episode of the reality show, all four of the singing stars turned their chairs for contestant Annalisse, leading to a spectacular showdown.\nAs Boy George made his pitch for the 30-year-old singer, he was cut off by Seal, leading him to snap, 'I wasn't finished, babe!'\nShowdown! Boy George snapped at Seal on Wednesday night's episode of The Voice, as the two fought over a contestant to join their respective teams\nBattle of the Brits! Tensions were running high between British coaches Seal and Boy George\nAnnalisse performed a rousing rendition of Bonnie Raitt's 'I Can't Make You Love Me', flying home to Australia just to audition.\nAfter her performance moved all four coaches, Annalisse revealed that she had relocated with her scientist husband to Germany, because he secured his 'dream job'.\n'It's now time for you to get your dream,' the impressed coaching panel remarked.\nChasing her dream: Annalisse wowed all four judges who proceeded to fight over her\n'I know my stuff': Kelly made her case\nSeal was the first to plead his case as to why Annalisse should join his team, complimenting the crooning contestant.\n'There's nothing that's moved me, so far, to the level that you just moved me,' the 'Kiss From A Rose' singer stated.\nDelta also made her case, claiming she was a 'great mentor', before Boy George gushed over Annalisse's performance.\nSeal-ed the deal! The 'Kiss From A Rose' crooner won over Annalisse, who joined his team\nAll the commotion caused new coach Kelly Rowland to remark, 'Now that they've poured all the sauces on all the burgers... Like, oh, my God!'\nThe former Destiny's Child band member then had a subtle dig at both Seal and Delta, stating, 'I'm not suave like Seal, and floating across the stage with this beautiful hair and these golden, lovely eyes, like Delta. But I know my stuff.'\nFollowing the four-way face-off, Seal secured Annalisse for his team, setting up further tension between the coaches for the continuing Blind Auditions.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447610/Feisty-Boy-George-SNAPS-Seal-Voice.html"}
