{"authors":["Pam Key"],"date_download":"2018-10-30 21:49:07","date_modify":"2018-10-30 21:49:07","date_publish":"2015-12-08 19:36:49","description":"'The View' on Trump's Muslim Ban: 'Sad' 'Unconstitutional' Trump Has a ‘Severe Narcissistic Disorder’","filename":"data/vaneerConsumption/TheViewonTrumpProposedMuslimBanSadUnconstitutionalTrumpHasaSevereNarcissisticDisorder.json","image_url":"https://media.breitbart.com/media/2015/12/theview.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_08__1540936147.html","title":"'The View' on Trump Proposed Muslim Ban: 'Sad,' 'Unconstitutional'; Trump Has a ‘Severe Narcissistic Disorder’","title_page":"'The View' on Trump Proposed Muslim Ban: 'Sad,' 'Unconstitutional'; Trump Has a ‘Severe Narcissistic Disorder’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tuesday on ABC’s “The View,” the co-hosts all disagreed with Republican presidential candidate Donald Trump’s call to ban Muslims form entering the United States.\nPanelist Joy Behar said, “The GOP is turning on him. One of the reasons I think is because if he wins, they lose. They lose the house, the senate and the presidency. They’re worried.”\nPanelist Paula Faris said, “You talk about the GOP and the Speaker of the House, Paul Ryan, just spoke within the hour. This is something that he rarely does. He rarely comments on the political race, the presidential race. This is so egregious, this is his quote, he said ‘This is not what this party stands for. It is not what this country stands for, as well.’ But the danger in this, this is exactly what ISIS wants because it alienates the Muslim community and it could drive them to seek refuge with ISIS. This plays right into their hands.”\nPanelist Candace Cameron Bure said, “As a Christian I will always fight for religious freedoms, but as a Christian, we have to fight for all religious freedoms because, listen, if the government can shut down one group, they can shut down all the groups. So, if you shut down a mosque, you can just as easily shut down a church, a synagogue, anyplace, so think about it.”\nPanelist Whoopi Goldberg said, “Do you remember this poem, when they came for the Catholics I did nothing. When they came for the Muslims I did nothing. It’s a much longer poem then I’m making it, and when they came for me, there was no one to speak up for me. I mean, listen, this is still America. You know, I know that y’all were applauding him, you love him out there, wherever he was talking, but this is still America and you’re not going to win this…you’re not going to win this. It’s against the law. I wish someone would do their homework or maybe do a little history check.”\nFaris added, “It’s unconstitutional.”\nBehar said, “The question has come up, what is he getting at? Does he really want to be president? when I saw him at the Adele concert, I said, do you really want to do this, Donald? I asked him that question, and he said, can you believe the polls? He’s fascinated by the fact that people are in love with him. He talks about the thousands who came to see him. It’s a narcissistic disorder. I wonder if they’re going to find that in the medical records when he has to release them.”\nCollins said, “I had a friend who worked on “Celebrity Apprentice” and he was one of the people in the editing room, and he said he would watch Trump for hours just basically repeating what other people were saying. He never had an original thought. He was only repeating what others were saying. The one thing he did do when he saw something wasn’t working, he did move on. Like he did have that gene or whatever…he just wants to win that Iowa poll and it’s an evangelical state.”\nFollow Pam Key on Twitter @pamkeyNEN","url":"https://www.breitbart.com/politics/2015/12/08/the-view-on-trump-proposed-muslim-ban-sad-unconstitutional-trump-has-a-severe-narcissistic-disorder/"}
