{"authors":["Lily Waddell For Mailonline"],"date_download":"2018-10-23 02:53:20","date_modify":"2018-10-23 02:53:20","date_publish":"2017-03-16 13:31:01","description":"She rocketed to fame on The Voice last year when the musician made cut for the final three last year. But Lydia Lucy sent temperatures rising when she went for a ru on Chalkwell Beach in Essex.","filename":"data/vaneerConsumption/TheVoicesLydiaLucyspillsoutoftoponEssexbeach.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E53F07D00000578-0-image-a-105_1489665970229.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319906_The-Voice-star-Lydia-Lucy-spills-beach_1540263200.html","title":"The Voice's Lydia Lucy spills out of top on Essex beach","title_page":"The Voice's Lydia Lucy spills out of top on Essex beach | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She rocketed to fame on The Voice last year when she made the final three last year.\nAnd Lydia Lucy sent temperatures rising when she went for a run making the most of the spring sunshine on Chalkwell Beach in Essex on Thursday.\nThe 23-year-old put her generous cleavage on display, almost spilling out of her hot pink sports bra and tiny vest top.\nScroll down for video\nBuxom: Busty Lydia Lucy almost spilled out of her tight black vest top when she went for a run in the sunshine on Chalkwell Beach in Essex on Thursday\nUnder the spotlight: The 23-year-old broke into a sweat as she sprinted across the rugged pebble beach in comfy black trainers\nBut that didn't phase the Essex beauty as she jogged along the picturesque British coastline.\nBreaking into a sweat as she worked out, Lydia was forced to take off her thick black hoodie revealing her busty appearance.\nAlthough the talented musician wore a black vest top over her bright pink sports bra, her generous curves couldn't be contained.\nTeamed with daring shorts, the voice finalist caught the sunshine on her legs as her tiny attire showed off the best of her slender limbs.\nShe's got style: The talented musician wore a black vest top over her bright pink sports bra\nSpotted: She sent temperatures soaring as she went for a run in the baking temperatures\nAnd the curvy star was prepared to bask in the baking heat as she styled chic reflective sunglasses.\nShe pulled her trademark fiery red locks into a high ponytail to keep her tresses out of the way.\nHer coral curls couldn't be tamed as they cascaded freely over her shoulders to her tiny waistline.\nSquat: She pulled her trademark fiery red locks into a high ponytail as she worked out\nDressed for comfort, the TV personality sported black Nike trainers with hot pink ticks bringing out the vibrant colour of her sports bra.\nBut she still looked glam as the fitness fan kept her manicured lilac painted nails in perfect condition.\nFollowing her success on The Voice, she was dubbed the 'new Fergie' when she performed alongside her mentor will.i.am at the Capital's Summertime Ball last year.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319906/The-Voice-star-Lydia-Lucy-spills-beach.html"}
