{"authors":["Npr Staff"],"date_download":"2018-10-23 00:47:07","date_modify":"2018-10-23 00:47:07","date_publish":"2016-04-15 00:00:00","description":"Across the state, some argued to blow up the system, while others cautioned against a wholesale political revolution. But voters in both parties agreed: Government in its current form is not working.","filename":"data/vaneerConsumption/TheViewFromIllinoisVotersFrustratedThatGovernmentIsBroken.json","image_url":"https://media.npr.org/assets/img/2016/04/14/illinois-view-img_0848_wide-4ee7b1ec68d37d82631fa1d494ef0de3848f0902.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_04_15_474250134_the-view-from-illinois-voters-frustrated-that-government-is-broken_1540255627.html","title":"The View From Illinois: Voters Frustrated That Government Is Broken","title_page":"The View From Illinois: Voters Frustrated That Government Is Broken : NPR","title_rss":"NULL","source_domain":"npr.org","text":"The View From Illinois: Voters Frustrated That Government Is Broken\nEnlarge this image toggle caption David McGuffin/NPR David McGuffin/NPR\nThis story is part of an election-year project focused on how voters' needs of government are shaped by where they live. NPR will explore parts of the country not on the primary calendar and not crowded with journalists following each twist of campaign season. First up: Illinois, the state that most broadly represents America in terms of race, income, age, religion and education.\nThe people of Thomson, Ill., are not happy with the government. Fifteen years ago, the state of Illinois built a 1,600-cell maximum-security prison in this village of 600 people along the Mississippi River. That prison has barely been used since it opened in 2001, and that's a big financial problem for this little town.\n\"We kind of feel like the dog that keeps getting kicked, and yet we keep wagging our tail hoping someone will adopt us and love us,\" says Vicky Trager, village president.\nIllinois spent $170 million to build the prison, but in a budget-cutting move, it didn't fund it to actually operate in its first year. That budget-saving measure then continued right through the decade. The prison remained empty. The federal government took it over in 2012, but congressional interference — over fears that it may be used to house Guantanamo inmates — has kept it mostly empty still.\nThomson sold $4 million in bonds to boost its water and sewage capacity to facilitate the vacant prison. It is now on the verge of bankruptcy. State assistance it has relied on to service the debt hasn't arrived this year. Political gridlock in the state capital means Illinois is now into its second year without a budget, and the tiny village of Thomson is about to go bankrupt.\n\"The state of Illinois government's dysfunctional. The federal government's dysfunctional,\" Trager says.\nThe View From Thomson, Ill. Listen · 7:13 7:13\nTrager voted for John Kasich in the Illinois primary, but others, like Thomson residents Lisa and Matt Karl, look at the waste the prison represents and have decided to vote for Bernie Sanders.\n\"The revolution is happening,\" says Matt, a bike shop owner, \"and it's not going to be stopped.\"\nThese sentiments — that the system is not working — echoed what Morning Edition heard across Illinois as our reporting team talked to voters over a weeklong journey that went from Chicago to Thomson to the industrial heartland of Peoria and its bedroom community of Washington.\nBitter In Washington\nIn Washington, a wealthy suburb in central Illinois, anger with government is fueled by tragedy. The city was devastated by a tornado in late 2013. Hundreds of homes were destroyed, three people were killed, dozens more injured.\nEnlarge this image toggle caption David McGuffin/NPR David McGuffin/NPR\nAnd yet, despite direct promises of assistance from President Obama on down, the Federal Emergency Management Agency did not provide the city with funds it needed for the massive cleanup effort. Arcane bureaucratic rules, including the relative proximity of a big city like Chicago, prevented help being granted. Like Thomson, Washington flirted with bankruptcy. The experience left Mayor Gary Manier, who spent months negotiating for help from the federal government, feeling bitter.\n\"People say to me, 'Hey, are you going to run for senator or state rep?' After what I went through, I wouldn't want any part of Springfield or D.C.,\" Manier says. It's shaped his vote this election year. A Republican who has supported Democrats in the past, Manier is now backing Donald Trump. He believes Trump would take a look at what happened in Washington, Ill., and act simply because it's the right thing to do. He'd cut through all the bureaucracy.\nThe View From Washington, Ill. Listen · 6:31 6:31\n\"I think he's an independent thinker from that standpoint,\" Manier says.\nFrustrated In Englewood\nIn Englewood, the neighborhood in Chicago with the worst murder rate in a city with a massive violent crime problem, residents are frustrated.\nEnlarge this image toggle caption David McGuffin/NPR David McGuffin/NPR\nYears of promises by state and federal politicians to transform Englewood have done little to stem high unemployment rates, urban decay and violence. Street after street is lined with condemned and boarded-up brick homes. And there are loud complaints here about the police. This neighborhood is just a few miles from the spot where 17-year-old African-American Laquan McDonald was killed by police, shot 16 times as he walked away from the officer.\nBut for veteran police officer Angela Wormley in the 7th District police station in the heart of Englewood, simply blaming the police is wrong.\n\"There's a lot that goes into the dynamics of what's going on in the city of Chicago, and it's not about bad policing. It's about getting some standards, some ethics, and some morals, getting some order among the people, getting some respect among themselves, so they don't think it's OK to go get a gun and shoot each other, and so they don't think that that's the first option that they have,\" she says.\nEnlarge this image toggle caption David McGuffin/NPR David McGuffin/NPR\nNot far away, in the Dream Cafe, Jermont Montgomery, 39, meets with the local activist organization R.A.G.E, the Residents Association of Greater Englewood. Now trying to be part of the solution, he was once part of the problem. Arrested for dealing drugs as an 18-year-old, he spent a year in a maximum-security prison, the result of the tough new crime legislation brought in during the 1990s. That has shaped his view of establishment politicians, including one in particular.\n\"I personally will not vote for Hillary Clinton, period,\" he says. \"The prison industrial complex boom occurred under her husband's leadership. She was a major proponent of it. Incarcerating many African-Americans under the three strike laws, the drug laws.\"\nThe View From Englewood Listen · 7:16 7:16\nMontgomery is backing Sanders in this election. And while all of Chicago's majority African-American wards went for Clinton in the primary, there was a sense of resignation among those we spoke to in Englewood that the political system, in its current form, can't help fix the many problems in their community.\nBut back in Thomson, despite facing the looming threat of going bankrupt, Trager, the village president, warns against a wholesale political revolution.\n\"Just because the system is dysfunctional doesn't mean that you punish everyone by putting someone in there that's gonna blow it up,\" she says. \"Isn't that what the Bolsheviks tried to do in Russia? I mean, look what happened. Why is blowing up an existing system better than working together to try to fix it? I don't get that.\"","url":"https://www.npr.org/2016/04/15/474250134/the-view-from-illinois-voters-frustrated-that-government-is-broken"}
