{"authors":[],"date_download":"2018-10-30 01:10:19","date_modify":"2018-10-30 01:10:19","date_publish":"2015-03-11 00:00:00","description":null,"filename":"data/vaneerConsumption/Thevoicefromtheriver.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_the_voice_from_the_river_1540861819.html","title":"The voice from the river","title_page":"The voice from the river","title_rss":"NULL","source_domain":"americanthinker.com","text":"The voice from the river\nFrom their testimony, four people heard a voice asking for help that compelled them to search an overturned, half-submerged vehicle in search of the source of that voice, and when they searched the vehicle, they found the voiceless, dead body of a young woman and a voiceless, live baby that was nearly dead. Saul of Tarsus heard such a voice from the void (and saw something), and, from that, he gave us the roots of most Christian theology.\nThe Church of Our Fathers understands both voices, but I don’t think that the Church of today understands, either. I recently wrote about Faith and the Church of today. That piece received, for me, an unprecedented level of comments and e-mails for which I am quite grateful and informed. To those who wrote, I can say that the reason I can neither confess the Faith of my youth nor avow atheism or agnosticism is that I see more questions than answers in the universe as I can see it and as others describe it. And yet, I see answers, albeit inexplicable ones. I first quit accepting the invitation to Communion because I could no longer acknowledge that the “resurrection of the body” was something that was explicable to me and that the Navy chaplains with whom I worked, golfed, and conversed had a difficult time trying to explain to me. Interminable other questions are either inexplicable or fully explicable within the context of Judeo-Christian teachings (such as the Singularity). And then, once in a while, something, that Voice from the River, comes along that is both inexplicable in the universe as I and most people can see it and that is fully explicable within the context of Judeo-Christian teachings. What do you think of the Voice from the River? The author is retired, his profile may be found on LinkedIn, and comments may be addressed at bilschan@hotmail.com.","url":"https://www.americanthinker.com/blog/2015/03/the_voice_from_the_river.html"}
