{"authors":["Christine Distasio"],"date_download":"2018-10-30 22:24:37","date_modify":"2018-10-30 22:24:37","date_publish":"2014-08-15 18:39:57","description":"Well, this is the last thing CW fans want to hear while we're still mourning the death of Damon Salvatore. The Vampire Diaries Season 6 won't premiere for another few months, but apparently, Julie Plec and The CW are already planning for Season 7…","filename":"data/vaneerConsumption/TheVampireDiariesCantGoOnWithoutElenaDamonStefan.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/60c25102-71db-453e-85aa-b7a21e2b1c60.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35941-the-vampire-diaries-cant-go-on-without-elena-damon-stefan_1540938277.html","title":"'The Vampire Diaries' Can't Go On Without Elena, Damon, & Stefan","title_page":"'The Vampire Diaries' Can't Go On Without Elena, Damon, & Stefan","title_rss":"NULL","source_domain":"bustle.com","text":"Well, this is the last thing CW fans want to hear while we're still mourning the death of Damon Salvatore. The Vampire Diaries Season 6 won't premiere for another few months, but apparently, Julie Plec and The CW are already planning for Season 7 and beyond — with or without the series' three big stars. E! News reported on Friday that The Vampire Diaries Season 7 could go on without Nina Dobrev, Ian Somerhalder, or Paul Wesley. Which poses one huge question: Can TVD go on without them? Answer: Absolutely not.\nAccording to \"multiple inside sources,\" Dobrev, Somerhalder, and Wesley have been in talks with the studio to sign on for a seventh season of The CW's popular vampire drama. And only two of the aforementioned three major cast members have agreed to return. The sources revealed to E! News that the remaining member of the trio is \"unsure whether he or she wants to continue.\" What the heck is up with that?\nEver since Damon, Stefan, and Elena all bit the dust at some point in Season 5, fans were left wondering whether or not they'd return in Season 6 — especially Damon. But, thankfully, it was confirmed that all three actors had signed a six-season contract when they agreed to join TVD. Now, however, it's a different ballgame. Allegedly, The CW could consider renewing the show for a seventh season with or without the brothers Salvatore and perpetually crying Elena Gilbert and instead, shift focus to the series' other characters. Of course, there's a better chance for TVD to get picked up for a seventh season if Somerhalder, Dobrev, and Wesley all agree to return — but what if they didn't and we continued to get more TVD anyway?\nAs far as I'm concerned, The Vampire Diaries can't go on without its core. That would just be ridiculous. As much as I love Caroline and the rest of the Mystic Falls crew, I can't see them carrying a series — even if the network went with a huge plot-twist and made Matt Donovan the new star (lol). I also can't see the series carrying on after there's finally, concrete resolution to the Damon-Elena-Stefan love triangle. (I mean, they are planning on resolving that situation before one or all of those characters get written off the show. Right?) It just wouldn't work — that love triangle is the entire basis of TVD from Season 1's pilot and when it finally ends, the series should end with it.\nShowrunner Julie Plec, however, has no intentions of laying TVD to rest anytime soon well unless it starts \"sucking.\" During her Comic-Con interview with E!, she told Kristin Dos Santos, \"I know that we've got plans for season six, we've got plans for season seven. I know that our bosses have plans for seasons eight, nine, and 10.\" If The CW is planning that far ahead, this series absolutely could go on without Somerhalder, Dobrev, and Wesley or whichever one is still \"unsure.\" Plec thinks the series could and should go on \"as long as the actors want the show to go,\" which is a great notion save for the fact that it might not entirely be their choice if the network is involved.\nShould TVD go on? It's one of The CW's most popular series and it consistently brings in great ratings which, on the business side, means it should run as long as possible. But as a Day 1-fan who'd be sad to see it go off the air (even if it's so frustrating at times), I say absolutely not. If they killed TVD and did another spin-off series maybe that would work, but none of the ensemble cast members could step into Damon, Elena, or Stefan's shoes and carry TVD the way they have.\nSo sign the damn contracts already, you three.\nImages: The CW, VampireDiaries/Wikia, Giphy","url":"https://www.bustle.com/articles/35941-the-vampire-diaries-cant-go-on-without-elena-damon-stefan"}
