{"authors":[],"date_download":"2018-10-30 18:03:33","date_modify":"2018-10-30 18:03:33","date_publish":"2018-08-06 19:00:00","description":"As the Varsity marks 90th birthday, it will celebrate with party on Aug. 18","filename":"data/vaneerConsumption/TheVarsityturns90.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/06/Images/newsEngin.22310430_081218-sla-varsity-HS04.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_dining_the-varsity-turns__1540922613.html","title":"The Varsity turns 90","title_page":"At 90, the Varsity is still going strong","title_rss":"NULL","source_domain":"ajc.com","text":"Gordon Muir, president of the Varsity, is a walking advertisement for the health benefits of chili dogs, onion rings and fried pies.\nThe 53-year-old fast-food magnate steps out of a door labeled “Janitor” and strolls through his acre-sized palace of pig-out, looking more like a gymnast than a fan of the deep fryer.\nCustomers belly up to the 150-foot counter four deep, while cashiers holler “What’ll ya have?” and Muir executes a quick deep knee-bend to retrieve a stray napkin from the floor, straightening up effortlessly.\n“Yesterday I had two chili steaks, and I felt it, right before CrossFit,” said Muir. “I didn’t plan to have two, but the first one disappeared so fast.”\nSo it’s either the chili steaks, or the CrossFit. One of these things is keeping Muir young.\nHis grandfather would say it’s the chili steaks.\nAn Atlanta institution is about to celebrate 90 years. When the Varsity asks \"What'll ya have?,\" here are some ways to say it. What we have here is a double chili steak with cheese, strings and a P.C. (that's with ice). Don't want ice? That's N.I.P.C. This box of deliciousness contains strings, rings, a naked dog, a slaw dog and a chili steak. That sunny, slushy cup on the right? That's an F.O. (or Frosted Orange). Those onions on the side? That's sideways. Want extra chili on that dog? That's a heavyweig\nFrank Gordy opened the Varsity in 1928, when North Avenue was a cobblestone street and Cobb County was covered in cotton farms. Gordy always said the fountain of youth was somewhere near his Frosted Orange machine, and it’s true that the Varsity seems caught in some sort of time warp.\nThe jaunty paper hats on the patrons, the chrome trim and art deco curves in the architecture, the archaic tradition of the carhop and — mostly — that Archie and Jughead devotion to high-calorie happiness, all speak of a different time.\nCarhop Louis Frank Jones, 87, said the food is just as good as it was when he started, 70 years ago. (Back then, you didn’t need a Social Security number, he says, pausing as he totes a box of onion rings and dogs to a drive-in customer. “You just worked.”) Has anything changed? “Nothing but the price.”\nWendell Brock reports on the Varsity and its history of food and scene in Atlanta on Tuesday October 13, 2015. Carhop Frank Jones, the longest employed carhop at the Varsity, hands a customer paper plates and napkins before hanging the food tray on his car window. Mr. Jones is 84 years old and has worked there on and off since 1949 and steady since December 1955. ((Becky Stein) Photography) (Becky Stein)\nInventing fast food\nThe Varsity celebrates its 90th birthday this year. In Atlanta, a town with the permanence of an Etch-a-Sketch drawing, such durability is remarkable. The largest drive-in restaurant in the country, and perhaps the world, the Midtown Varsity, at North Avenue and Spring Street, encloses almost an acre under one roof, and can serve 30,000 people on a truly busy football Saturday.\nThere are also four other Varsities now, in Gwinnett (near Norcross), Kennesaw, Dawsonville and Athens, and two kiosks at Atlanta’s Hartsfield-Jackson International Airport.\nGordy, who died in 1983, would say his success was due to good food at a good price, and the effort to make every single customer happy. Muir embraces that philosophy, but there is something extra about his reverence for the place.\nDriving from his home in Roswell each morning, Muir will sometimes wait for the light on the North Avenue off-ramp and look at that soaring 45-foot chrome and red “V” sign, looming over the Downtown Connector, and marvel at his grandfather’s creation.\n»RELATED: Photos of the Varsity through the years\n“The third generation: That’s the generation that usually ruins things,” he said, contemplating his own place in the world. “We don’t want to do that.”\nMuir’s colleague, Terry Brookshire, a former jet engine mechanic with the Air National Guard and now a general manager at the Varsity, said the thing that holds the business together is heart.\n“We love these employees,” said the crew-cut Brookshire, a 20-year Varsity veteran, who reflexively picks up trash as he talks, a trademark among managers here. “A lot of people have been here as long as I have. If you really care about them, then things go smoothly, it keeps the Varsity shiny and bright, it makes the family proud, and makes customers proud.”\nBut maybe, for the customers, it’s the chili.\nChili dogs sit ready to be served at The Varsity in downtown Atlanta, Thursday, Feb. 4, 2016. The Alpharetta location of The Varsity closed its doors for good this past Monday. BRANDEN CAMP/SPECIAL (Branden Camp)\nWhat becomes a legend most\nThe late Atlanta Constitution columnist Lewis Grizzard claimed that during his three-year “exile” in Chicago, he talked an Atlanta girlfriend into bringing a basket of chili dogs whenever she came to visit.\nRoy Blount Jr., a former Decaturite who lives and writes in New York City and appears on the NPR game show “Wait Wait … Don’t Tell Me!,” has eaten all over the world and authored several books about food, including the latest, “Save Room for Pie: Food Songs and Chewy Ruminations.”\nBlount says he visits the Varsity every time he’s in Atlanta. “Varsity chili is unlike any other, unparalleled,” he writes in an email. “I can’t imagine how it could be improved, or why anyone would want to change it in any way.”\nHe continues, “I ate a chili dog once while doing ‘Wait Wait … Don’t Tell Me!’ at the Fox. The head of the CDC was the special guest on the show. I tossed him my peach pie. He walked off without it, as if it had cooties, which was okay by me as I really wanted to eat it myself —- but then he came back and got it, as one would.”\nWhat'll ya have? Originally named \"The Yellow Jacket,\" The Varsity was founded by Georgia Tech alumnus Frank Gordy in 1928. Gordy attended Georgia Tech briefly before dropping out in 1925. Pictured here is his wife, Evelyn Gordy-Rankin.\nBeginnings\nFrank Gordy attended Reinhardt College (where he met his future wife, Evelyn Jackson) and followed that with a year at Georgia Tech, but decided Georgia Tech was not for him.\nAfter a visit to Florida, where he studied the takeout hamburger and hot dog joints with interest, he came back to Atlanta and bought a small snack shop right outside the Tech campus called the Yellow Jacket. In 1928, he moved a few blocks down North Avenue and opened the Varsity, with the idea of opening one in all major college towns. (He certainly couldn’t open an Athens drive-in called “the Yellow Jacket.”)\nHe served 300 people on the first day. By the end of the 1930s, during the bleakest economy in U.S. history, Gordy had already made his first million dollars. More Varsities followed, first one in Athens, then, in 1965, the Varsity Jr. on Lindbergh, opened by Gordy’s son Frank Jr.\n»RELATED: Growing up in Athens, the Varsity’s other hometown\nThe 1980s brought tragedy to the Gordy family. Frank Jr. was shot and killed in 1980 during a confrontation with police. Frank Gordy Sr. died of emphysema in 1983. In both cases, the Gordy women stepped in.\nNancy Simms jumped into management at the Varsity after her father, founder Frank Gordy, died in 1983. CONTRIBUTED BY THE VARSITY (The Atlanta Journal-Constitution)\nFrank Jr.’s widow, Susan Gordy, took over the Varsity Jr., kept it humming and expanded its catering side business to a significant portion of revenue. And Gordy’s daughter, Nancy Simms, with three children (including Gordon Muir) and one stepchild at home, arrived at the North Avenue Varsity, ready to learn, from the onions on up.\n“Mr. Minix (general manager E.D. “Ed” Minix) handed her a hairnet and an apron, and put her in the kitchen,” said Muir. “Somebody asked him: ‘Who’s that blonde lady back there?’ Minix said: ‘Oh, that’s Frank’s daughter. She won’t last a week.’”\nThe odds were against her. “My father never suggested I be a part of the Varsity,” said Simms, speaking from the family’s vacation home on Sea Island. “I had no training. I’d never worked a day with my dad. I would go there for lunch, I’d go with a date, but I probably knew less about the Varsity than anybody.”\nSuddenly she felt responsible for 200 employees. She began working 16-hour days, cleaning tables, slicing potatoes and devoting herself to the restaurant six days a week. “She turned into my grandfather. She’d go to work in the daytime, come home and make us supper, then go back downtown at night,” said Muir.\nAll along, the employees were showing her how to run the business. Said Simms, “This is the situation: Here comes somebody they’ve never seen and never worked with, and they’re looking at me wondering, ‘Who the heck is she?’ I had to get in there and work with them and do the same things they did, have them teach me, show them I could work as hard as they did to earn their respect.” The recipes — the famous chili, for example — were written down, but she had to learn how to make them.\nThe Varsity is still in the blood of founder Frank Gordy’s family. Grandson Gordon Muir is president of the Varsity, and Muir’s daughter Ashley Weiser is head of marketing. They’re shown at the Varsity in Midtown Atlanta. The Varsity is turning 90, and as part of the anniversary, they’re raising $90,000 to support a program at the Shepherd Center to help brain-injured veterans. HYOSUB SHIN / HSHIN@AJC.COM (The Atlanta Journal-Constitution)\n“We were too young to step in,” said Muir. “Her brother had passed away. If she hadn’t done it, there’d probably be no Varsity here. There’d probably be a skyscraper here or something.”\nOne more tragedy followed. In 1990, Gordon Muir’s brother Michael was in a devastating car accident. He was flown to a Pittsburgh hospital for care, and underwent several organ transplants, surviving for a while, but declining after his organs began to fail. After three years, he died. Nancy Simms was by his side.\nIn her absence, Gordon Muir rose to the occasion. He’d already had training at the Varsity Jr. as a teenager. After college (at Reinhardt), he returned to the North Avenue Varsity as an hourly employee.\nThe Varsity has continued to expand, with a few hiccups. The Varsity Jr. closed in 2010 after zoning disputes with the city. A Varsity in Alpharetta lasted for 12 years, before closing in 2016. (“We were on the wrong side of the highway.”) But the company’s Dawsonville store is going great guns, said Muir, and they’re eyeing new stores on property in Winder and in Auburn, Ala.\n151013-ATLANTA-GA- Wendell Brock reports on the Varsity and its history of food and scene in Atlanta on Tuesday October 13, 2015. FOOD: Double chili cheese burger, fries and a Varsity PC (chocolate milk)((Becky Stein) Photography) (Becky Stein)\nThe Midtown store is located on 5 acres of land in a neighborhood of skyscrapers. “I’m sure there’s a higher purpose for those 5 acres in Atlanta than a drive-thru restaurant,” said CEO Simms, “but I’m sentimental.”\nSimms said she and 18 other family members are meeting for the second time with a family business counselor to discuss the future of the Varsity.\n“I’ve backed away a lot to let the guys handle it,” she said, mentioning her son Gordon, her son-in-law John Browne and her stepson Steve Simms, all involved in management. “They don’t want their mother looking over their shoulder.”\nAnd family may well be the key. During a recent lunchtime rush, a tanned visitor from Naples, Fla., brought his wife and children to taste the storied chili dogs. “I’ve never seen anything like it,” he said, gazing at the photos of presidents who have dined there, from the Bushes, father and son, to Barack Obama.\n“It’s a goldmine,” he added, “as long as it stays in the family.”\nEVENT PREVIEW\nThe Varsity is honoring its 90th birthday with a party. From 10:30 a.m.-3 p.m. Aug. 18, the Varsity will offer 90-cent prices on all menu items, door prizes, music and special guests. The specials are available at all locations except the airport kiosks. thevarsity.com.\nThe Varsity is also highlighting the occasion by raising $90,000 to support a program at the Shepherd Center to help brain-injured veterans. It’s about halfway to the goal.\nVARSITY LINGO\nAll the way: With chopped onions; can be a hot dog, chili dog or hamburger\nBag of rags: Potato chips\nChili steak: Hamburger with chili\n060818 - ATLANTA, GA -- A chili dog with french fries, a frosted orange drink and an apple pie at the Varsity in Atlanta, Ga Friday, August 18, 2006. (ELISSA EUBANKS/AJC staff) Would you wager a Varsity chili dog? (Alexa Lampasona/Atlanta Restaurant Scene)\nF.O.: Frosted Orange\nGlorified steak: Hamburger with mayonnaise, lettuce and tomato\nHeavyweight: Hot dog with extra chili\nJoe-ree: Coffee with cream\nMary Brown steak: Naked steak with no bun\nNaked dog: Plain hot dog in a bun\nNaked dog a’ walkin’: Naked dog to go\nN.I. Orange: Varsity Orange with no ice\nN.I.P.C.: Chocolate milk with no ice\nP.C.: Chocolate milk (usually served with ice)\nRed dog: Naked dog with ketchup\nSally Rand: Naked steak\nSally Rand through the garden: Naked steak with lettuce, tomato and mayonnaise\nStrings: French fries\nWalk a dog: Hot dog to go\nYellow dog: Naked dog with mustard\n»THE ACCESSATLANTA PODCAST GOES TO THE VARSITY\nCheck back on Thursday, Aug. 16, at ajc.com/podcasts as our weekly accessAtlanta podcast visits the Varsity in advance of the 90th anniversary celebration. Hear interviews with staff and customers and get the story of the beloved fast-food spot’s past, present and future from president Gordon Muir.","url":"https://www.ajc.com/entertainment/dining/the-varsity-turns/jr5gVAXtsUIIBQCJyu49wI/"}
