{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor"],"date_download":"2018-10-23 00:25:47","date_modify":"2018-10-23 00:25:47","date_publish":"2016-01-28 14:21:25","description":"The Organisation for Economic Co-operation and Development (OECD) said a three year undergraduate was too expensive and unsuitable for people with poor literacy and numeracy.","filename":"data/vaneerConsumption/Thevalueofauniversitydegreeisbeingundermined.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/1A15870100000578-0-image-a-17_1453990835185.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421045_The-value-English-degree-undermined-students-t-read-count-properly-damning-international-report-declares_1540254347.html","title":"The value of a university degree is being undermined","title_page":"The value of a university degree is being undermined | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Revealed: The OECD has said too many people are going to university with poor literacy and numeracy skills\nToo many students who cannot read and count properly are going to university which is undermining the 'currency' of a degree, a major international report said today.\nThe Organisation for Economic Co-operation and Development (OECD) said a three year undergraduate was too expensive and unsuitable for people with poor literacy and numeracy.\nAnd it warned the removal of a cap on student numbers could make the problem worse.\nSome 7 per cent of 20 to 34 year old graduates in England have numeracy skills below 'level two' - considered to be enough to properly read a car's fuel gauge.\nThe report found some 3.4 per cent of graduates are below this level for literacy, defined as being able to understand the label on a bottle of aspirin.\nFor numeracy, this is worse than in other nations - including Australia, Ireland, Poland, Italy and Spain, the report shows.\nAround one in five young university graduates can manage basic tasks, but struggle with more complex problems, it adds.\n'Those with low basic skills should not normally enter three-year undergraduate programmes, which are both costly and unsuited to the educational needs of those involved, while graduates with poor basic skills undermine the currency of an English university degree.'\nThese would-be students should be encouraged to take alternative, professional courses that will help to boost their levels of literacy and numeracy, while more needs to be done in universities to help students with intermediate levels in the basics to develop their skills.\nIt also suggests that preventing universities from graduating students that have low basic skills could help to raise achievement.\nOutcomes: New figures show how England is the worst or second worst in terms of literacy and numeracy compared to other nations\nResults: Today's bombshell report shows how the country has more young people not in work or education than the majority of other nations\nThe report, based on an international survey conducted in 2012, goes on to warn that while England has more young people graduating from university than many other countries, many young people are not well-prepared for degree study as the basic skills of those teenagers who may go into higher education is much weaker than elsewhere.\nOverall, a third of 16 to 19-year-olds are struggling with the basics - three times as many as in countries such as Finland, Japan, Korea and the Netherlands.\nIn 2012, in England, 70 per cent of youngsters in this age group were in education or training that would lead to a formal qualification, compared to almost all young people in many other nations, the survey says.\nThe OECD warns: 'In England, the weak basic skills of young adults compared with other countries can be traced back to a lower standard of performance at the end of initial education.'\n'The priority of priorities is to improve the standard of basic schooling in England,' it adds.\nComparison: The OECD report said lifting a cap on student numbers, whether it be at Oxford University, left or Glasgow Caledonian University, right, could make the problem worse\nThe report notes that a raft of reforms have been introduced, including an overhaul of qualifications, raising the age that youngsters must stay in education or training to 18 and a decision that any teenager who does not gain at least a C at GCSE in English or maths must continue with the subject.\nIt is too early to assess the impact of these reforms, the OECD says, but adds that 'their objectives are clearly the right ones'.\nThe organisation does note that the move to lift the cap on university numbers could worsen the problem of students with low basic skills.\nOverall, there are an estimated nine million working-age adults in England with literacy or numeracy skills, or both, the report says.\nA Government spokeswoman said: 'Good English and maths skills are essential to success in later life, and thanks to our reforms thousands more students are leaving education with these vital skills.","url":"https://www.dailymail.co.uk/news/article-3421045/The-value-English-degree-undermined-students-t-read-count-properly-damning-international-report-declares.html"}
