{"authors":["Stephen Bisset For Daily Mail Australia"],"date_download":"2018-10-23 01:21:03","date_modify":"2018-10-23 01:21:03","date_publish":"2017-04-26 11:43:06","description":"With The Voice slaying My Kitchen Rules in the ratings on its Monday season six premiere, does it have the juice to produce chart toppers?","filename":"data/vaneerConsumption/TheVoiceslaysratingsbutdoesithavejuicetoproduce.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9F14D600000578-0-image-a-24_1493203364214.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446876_The-Voice-slays-ratings-does-juice-produce_1540257663.html","title":"The Voice slays ratings but does it have juice to produce","title_page":"The Voice slays ratings but does it have juice to produce | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It is the reality singing juggernaut that topped the ratings on its Monday season six premiere,\nBut, does the Voice have the juice to produce Australia's next crop of singing sensations?\nSeason five winner Alfie Arcuri was seen at the star-studded Logie awards on Sunday, posting a photo to Instagram showing Alfie sitting in a coaches chair with his mentor Delta Goodrem perched on his lap in a racy burnt orange gown.\nSeason five Voice winner Alfie Arcuri was seen at the Logies on Sunday, sitting in a coaches chair with his mentor Delta Goodrem perched on his lap in a racy burnt orange gown.\nHowever, since taking out the 2016 iteration of the competition, Alfie has struggled to remain in the spotlight, with his debut, post-Voice single Cruel only managed a peak of 89 on the ARIA music charts, with the subsequent album Zenith also failing to make a dent.\nWhile chart success has eluded Alfie, he isn't giving up on his dreams of musical stardom with The Daily Telegraph reporting in February that he was gearing up to release a new album, which he described as a 'mix of ballads and pop songs,' some time this year.\nSeason four winner Ellie Drennan has fared a little better since leaving the reality show, with her debut album Close Your Eyes, peaking at number 14 on the ARIA charts and her singles Ghost and Hard Love hitting number 25 and 41 respectively.\nSeason four winner Ellie Drennan has fared a little better since leaving the reality show, with her debut album Close Your Eyes, peaking at number 14\nDanish-bred songstress Anja Nissen, who won season three, saw her debut, self-titled album hit number 14 on the Australian charts, with all of her singles failing to crack the top 50.\nAnja however has managed to find considerable fame in her native Denmark, with the blonde chanteuse representing her country at the Eurovision Song Contest in May.\nSeason one and two winners Karise Eden and Harrison Craig buck the trend with both artists' debut albums hitting number one on the Australian Charts. Harrison's More Than A Dream debut was certified platinum, while Karise's My Journey hit double platinum.\nInternational: Danish-bred songstress Anja Nissen is set to represent Denmark at the Eurovision song contest in May\nHarrison's subsequent L.O.V.E managed a top ten spot, however his 2016 effort Kings of Vegas only managed a number 36 position for the star.\nKarise meanwhile saw her follow-up Things I've Done reach a formidable number five while two of her singles You Won't Let me and Threads of Silence attained a gold certification.\nRegardless of chart success, it seems Australia is still in love with the Voice with the show's season six premiere giving My Kitchen Rules a walloping in the ratings with 1.18 million viewers tuning in on Monday, compared to MKRs 1.02 million.\nSeason one and two winners Karise Eden and Harrison Craig buck the trend with both artists' debut albums hitting number one on the Australian charts. Harrison's mentor Seal pictured left\nHigh notes: Karise saw her follow-up Things I've Done reach a formidable number five while two of her singles You Won't Let me and Threads of Silence attained a gold certification","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446876/The-Voice-slays-ratings-does-juice-produce.html"}
