{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:49:19","date_modify":"2018-10-30 21:49:19","date_publish":"2015-11-19 22:06:40","description":"The hosts of ABC's \"The View\" issued an on-air apology minutes after opening Thursday's episode by mocking eating disorders.","filename":"data/vaneerConsumption/TheViewHostsMockEatingDisordersApologizeMinutesLater.json","image_url":"https://media.breitbart.com/media/2015/11/Behar-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_11_19__1540936159.html","title":"'The View' Hosts Mock Eating Disorders, Apologize Minutes Later","title_page":"WATCH: 'The View' Hosts Mock Eating Disorders, Apologize Minutes Later","title_rss":"NULL","source_domain":"breitbart.com","text":"The hosts of ABC’s The View issued an on-air apology just minutes after opening Thursday’s episode by mocking eating disorders like anorexia and bulimia.\nPlease enable Javascript to watch this video\n“We were just discussing whether it’s better to be or anorexic backstage,” co-host Joy Behar opened up the proceedings. “What do you girls think?”\n“Oh, definitely bulimic,” Michelle Collins replied. “Yeah, you get to enjoy the meal… We have two bulimics here, they agree.”\nCandace Cameron Bure seemingly anticipated the backlash before it came: “Please note, this is in jest — as someone who has dealt with an eating disorder, I don’t want to make light of anyone that has it. But we were talking about it. I think I can joke about it because I’ve been there.”\nThe backlash on social media came swiftly and mercilessly:\nGrossed out with #TheView joking about eating disorders. \"Which is better, bulimia or anorexia?\" *cue laughter* — Jason Roach (@JasonRoach77) November 19, 2015\nWhat the HELL is wrong with the women on #TheView talking about bulimia is \"better\" than anorexia?! Not even 3 min in and this lunacy. WTF. — UrsulaArtPop (@BettyAnnBishop) November 19, 2015\n@TheView Anorexia ruled me and nearly killed me. Try to avoid please! — Debi Russell (@Debourke) November 19, 2015\nThe View hosts must have seen the negative reaction pouring in because they issued an apology just minutes later.\nPlease enable Javascript to watch this video\n“You know, we always offend somebody on this show,” Joy Behar said. “We’re always in trouble, the comedians in particular. We keep getting into trouble on this show. We upset some people. We understand that bulimia is a serious illness. We’re just trying to have some fun over here.”\n“As Candace pointed out, she knows what this is like, so we know, we understand, we never want to offend anybody, we’re just having good conversations, and sometimes we go there because we’re comics,” added Whoopi Goldberg.\nThe View has been no stranger to controversy; just this week, in a debate about whether the United States should accept Syrian immigrants only if they are Christian, Goldberg said that there “have been a lot of monster Christians. Hitler was a Christian.”\nIn September, the long-running talk show lost a handful of major advertisers after co-hosts Behar and Collins mocked the nursing profession. Behar later apologized on-air for not knowing “what the hell” she was talking about.","url":"https://www.breitbart.com/entertainment/2015/11/19/watch-view-hosts-mock-eating-disorders-apologize-minutes-later/"}
