{"authors":[],"date_download":"2018-10-21 02:52:28","date_modify":"2018-10-21 02:52:28","date_publish":"2018-09-10 16:04:06","description":"Traditional journalism is transformed into song, poetry, theater, a board game and more.","filename":"data/vaneerConsumption/TheWashingtonPostMagazinepublishesanalternativestorytellingissue.json","image_url":"https://www.washingtonpost.com/resizer/OB_yfWDyFqva7krBsXEkkDIexig=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6LUEMHSX4Q4VREJSVKNJDAZKLA.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_09_10__1540090348.html","title":"The Washington Post Magazine publishes an alternative storytelling issue","title_page":"The Washington Post Magazine publishes an alternative storytelling issue - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"The Washington Post Magazine today released an alternative storytelling issue — presenting readers with journalistic stories written in various formats including song, poetry, a board game, a three-act play, a graphic-novel approach and more. At the center of the issue is a song created for the magazine by singer-songwriter Ben Folds. Titled “Mister Peepers,” it describes the predicaments Rod Rosenstein has faced as deputy attorney general. Along with the rest of the issue, the song will be available on The Post’s website starting Sept. 10, 2018\n“This issue of The Washington Post Magazine is an experiment in telling journalistic stories through very unusual mediums,” said Richard Just, editor of The Washington Post Magazine. “At a time when the sheer number of stories that readers consume every day can feel overwhelming, we hope that presenting stories in unconventional forms will create a sense of surprise for readers. You might have read dozens of stories about Rod Rosenstein, but maybe hearing a song about him helps you access a different aspect of his narrative.”\nIn addition to Ben Folds’s “Mister Peepers,” readers will find:\nA poem by journalist Eliza Griswold exploring the effects of fracking on a rural area of Pennsylvania.\nA poem by former U.S. Poet Laureate Robert Pinsky on James Comey’s book tour.\nA board game in which readers can play as Betsy DeVos and attempt to survive her first 19 months in Washington.\nA three-act play based on an evening spent with prom chaperones at T.C. Williams High School.\nA graphic novel treatment of Date Lab.\nFood Critic Tom Sietsema’s restaurant review as an annotated menu.\nA poem by Gene Weingarten on the National Duckpin Bowling Congress Tournament held earlier this year in Virginia.\nA create-your-own-speech version of a recent address by President Trump.\nReaders can view the full issue here.","url":"https://www.washingtonpost.com/pr/wp/2018/09/10/the-washington-post-magazine-publishes-an-alternative-storytelling-issue/"}
