{"authors":[],"date_download":"2018-10-30 21:23:07","date_modify":"2018-10-30 21:23:07","date_publish":"2017-04-12 00:00:00","description":"1 PRAISE","filename":"data/vaneerConsumption/THEWEEKENDTEN.json","image_url":"https://media.arkansasonline.com/img/photos/2017/04/12/0413_easter_lily_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_apr_13__1540934587.html","title":"THE WEEKEND TEN","title_page":"THE WEEKEND TEN","title_rss":"NULL","source_domain":"arkansasonline.com","text":"1 PRAISE\nNaomi Gower (left) and Samantha Pearce in UA-Pulaski Tech's Arsenic and Old Lace\nPhoto by Cary Jenkins\nDefending Diamond Chef champion Donnie Ferneau Jr. will be at the University of Arkansas-Pulaski Technical College’s “Decade of Diamond Chef” competition\n16th Annual Ozark Foothills FilmFest, April 14-15 and 21-22: Composer Justin Sherburn conducts members of the Montopolis Chamber Ensemble, live, to accompany a screening of Yakona, 8 p.m. April 15\nThousands are expected to attend the 29th annual ecumenical Community Easter Sunrise Service, 7 a.m. Sunday at First Security Amphitheater in Riverfront Park, behind the River Market's Ottenheimer Market Hall, 400 President Clinton Ave., Little Rock. Organizer Pulaski Heights United Methodist Church offers music by the combined choirs of the church, Philander Smith College, Arkansas Youth Chorale and Parkview Arts and Science Magnet High School, plus performances by New Creation Dance and Ozark Point Brass. Admission is free; offerings support El Zocalo Immigrant Resource Center. Dress casually and take your own lawn chairs and blankets. Pets: welcome with a leash. Call (501) 664-3600 or (501) 590-7657 or visit CommunitySunriseService.com.\n2 PILSNER The Arthritis Foundation offers up tasty treats at the 20th annual Food & Foam Fest, 6-9 p.m. Friday at Dickey-Stephens Park in North Little Rock. Visitors can sip samples of beer, cider and wine from around the world while nibbling food samples from area restaurants. Tickets are $20-$65. Call (501) 664-4591 or visit arthritis.org/arkansas. See story on Page 4E.\n3 PRANCE Riverdance is back and will stop over at Little Rock's Robinson Center Performance Hall. Performances of the high-energy 20th-anniversary touring production are 7:30 p.m. Friday-Saturday, 2 p.m. Saturday-Sunday and 7 p.m. Sunday. Tickets are $23-$72. Call (501) 244-8800 or visit ticketmaster.com.\n4 PARTAKE Food from different countries, focusing on cuisines from around the Mediterranean, is at the center of the second annual Little Rock International Food Festival, 11 a.m.-5 p.m. Saturday, 3224 Anna St., Little Rock, near the University of Arkansas at Little Rock. The event will also feature henna- and face-painting and children's activities (including games, a climbing wall, clowns, magicians and rides) and plenty of international music and culture. Admission is free. Call (501) 565-3555 or visit facebook.com/events/1472955386057011 or facebook.com/LRinternationalfoodfest.\n5 POISON A baker's dozen UA-Pulaski Tech students (and one faculty member) bring the eccentric and charmingly homicidal Brewster family to the stage in Arsenic and Old Lace by Joseph Kesselring, 2 and 7 p.m. Thursday-Friday and 7 p.m. Saturday in the Center for Humanities and Arts on the college's main campus, 3000 W. Scenic Drive, North Little Rock. Tickets are $7, $5 for students. Call (501) 812-2324 or visit pulaskitech.edu/CHARTS.\n6 POACH Six area chefs will battle it out for the right to take on defending Diamond Chef champion Donnie Ferneau Jr. at the University of Arkansas-Pulaski Technical College's \"Decade of Diamond Chef\" competition, 6-9 p.m. today at the college's Culinary Arts and Hospitality Management Institute, 13000 Interstate 30, Little Rock. The event will also feature silent and live auctions and a new \"Diamond Chef in the Rough\" cupcake-decorating competition for young chefs, plus hors d'oeuvres stations set up by culinary school students. Tickets are $150. Call (501) 812-2771 or visit pulaskitech.edu/diamondchef.\n7 PLUCK Pickers, cloggers and fiddlers turn downtown Mountain View into a music-lover's haven at the Arkansas Folk Festival, Friday-Saturday. The festival includes children's activities, planned and impromptu performances, the Artisans Market on the Square and a parade. In honor of the festival, Ozark Folk Center State Park's Craft Village has an open house with free admission Friday-Saturday. General admission is free. Call (870)269-8068 or visit yourplaceinthemountains.com.\n8 PETIT JEAN Petit Jean State Park near Morrilton celebrates spring with its Great Escape Weekend and Easter Egg Hunt, Friday-Sunday. A series of hikes, tours and programs all lead up to the big Easter Egg Scramble for children from preschool to sixth grade, 2-2:30 p.m. Sunday. Participation is free. Call (501) 727-5441 or visit petitjeanstatepark.com.\n9 PICTURES It's the opening weekend of the Ozark Foothills FilmFest, Friday-Saturday (and also April 21-22), with screenings of 34 films, from shorts to full-length features, at Independence Hall, University of Arkansas Community College at Batesville, 2005 White Drive, Batesville. Filmmakers will attend and conduct post-screening question-and-answer sessions. Tickets: $5, $4 students and senior citizens per screening for most films or film clusters; \"Red Eye\" All-Movie Pass, $30, $25 students and senior citizens. Call (870) 251-1189 or visit ozarkfoothillsfilmfest.org.\n10 POW! The cannons will roar again as Arkansas Post National Memorial in Gillett commemorates the 234th anniversary of Colbert's Raid, 10 a.m.-2 p.m. Saturday. The raid, the only Revolutionary War battle fought in Arkansas, will be remembered with cannon firings, living history programs and colonial-era encampments and demonstrations. Admission is free. Call (870) 548-2207.\nWeekend on 04/13/2017","url":"https://www.arkansasonline.com/news/2017/apr/13/the-weekend-ten-20170413/"}
