{"authors":[],"date_download":"2018-10-21 02:52:27","date_modify":"2018-10-21 02:52:27","date_publish":"2018-09-05 23:43:19","description":"David Weigel will anchor the newsletter launching this month","filename":"data/vaneerConsumption/TheWashingtonPosttolaunchTheTraileranewcampaignnewsletter.json","image_url":"https://www.washingtonpost.com/resizer/MP2tojq8zLm4BLet8L-m59eGKI0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/P3QES2TO3UYXFKR6S2G7O2UI7I.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_09_05__1540090347.html","title":"The Washington Post to launch ‘The Trailer’, a new campaign newsletter","title_page":"The Washington Post to launch ‘The Trailer’, a new campaign newsletter - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"The Washington Post today introduced The Trailer, a campaign newsletter anchored by The Post’s national political reporter David Weigel. The Trailer will be based on Weigel’s on-the-ground reporting, interviews with candidates and other key players, and his sharp analysis of the country’s fast-changing political landscape. The newsletter will be delivered to inboxes each Sunday, Tuesday and Thursday evening beginning later this month.\n“David brings a deep understanding of the forces driving politics today at every level and across the ideological spectrum,” said Peter Wallsten, senior politics editor at The Post. “The Trailer will be an indispensable guide for readers who want to stay up to speed on the latest campaign news in the lead-up to the midterm elections and through the 2020 elections.”\nThe Trailer will be a source for news on who’s running, what their ads say, who’s backing them and how much they’re raising, as well as the tweets, videos and speeches that tell us what the candidates are offering—and what the voters want.\nReaders will be encouraged to participate by submitting questions for Weigel to answer each week. To sign up for the newsletter, visit here.","url":"https://www.washingtonpost.com/pr/wp/2018/09/05/the-washington-post-to-launch-the-trailer-a-new-campaign-newsletter/"}
