{"authors":[],"date_download":"2018-10-21 02:52:33","date_modify":"2018-10-21 02:52:33","date_publish":"2018-09-13 16:51:29","description":"Sens. Ed Markey and Jerry Moran and aviation experts will explore the effects of rising fuel costs and energy policy, and innovations in the aviation industry","filename":"data/vaneerConsumption/TheWashingtonPostexplorestheeconomicsoftheaviationindustry927.json","image_url":"https://www.washingtonpost.com/resizer/Wa4MKF2E1uvdfG6sQJA58QtZjhA=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LKNAVFV3BAZHXNTKQ7DRUTCQAU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_09_13__1540090353.html","title":"The Washington Post explores the economics of the aviation industry 9/27","title_page":"The Washington Post explores the economics of the aviation industry 9/27 - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"On Thursday, September 27, The Washington Post will host “Taking Flight: The Economics of the Aviation Industry,” the second event in a three-part series which is examining all aspects of the aviation industry.\nThe Federal Aviation Administration’s Bailey Edwards, Sen. Edward J. Markey (D-Mass.) member of the U.S. Senate Subcommittee on Aviation Operations, Safety, and Security, and Rep. Scott Perry (R-Pa.), member of the U.S. House of Representatives Subcommittee on Aviation, will discuss energy policy and the short- and long-term impacts of rising fuel prices on the commercial aviation industry and consumers. Industry leaders will address innovations in aircrafts, airports, alternative fuels, and other cost-saving technologies.\nSpeakers include:\nBailey Edwards , Assistant Administrator for Policy, International Affairs and Environment, Federal Aviation Administration\n, Assistant Administrator for Policy, International Affairs and Environment, Federal Aviation Administration Sen. Edward J. Markey (D-Mass.) Member, U.S. Senate Subcommittee on Aviation Operations, Safety, and Security\nMember, U.S. Senate Subcommittee on Aviation Operations, Safety, and Security Rep. Scott Perry (R-Pa.) , Member, U.S. House of Representatives Subcommittee on Aviation\n, Member, U.S. House of Representatives Subcommittee on Aviation Laurent Rouaud, Chief Marketing Officer, GE Aviation\nChief Marketing Officer, GE Aviation Kristin Slyker, Vice President, Connected Aircraft, Honeywell Aerospace\nVice President, Connected Aircraft, Honeywell Aerospace Michael McAdams, President, Advanced Biofuels Association\nPresident, Advanced Biofuels Association David Silver, President, Civil Aviation Aerospace Industries Association\nThis event will be streamed live on The Post’s site at wapo.st/takingflight and is open to press. All media who wish to attend must RSVP.\nEvent Details\nThursday, September 27, 2018\n9:00 AM – 10:30 AM (Doors open at 8:30 AM)\nThe Washington Post Live Center\n1301 K Street NW, Washington DC 20071\nThis event is sponsored by Delta Air Lines.\n“Taking Flight: The Economics of the Aviation Industry” is the second event in a three-part series sponsored by Delta Air Lines that will explore the future of modern air travel and key issues including regulation, security, and economics.","url":"https://www.washingtonpost.com/pr/wp/2018/09/13/the-washington-post-explores-the-economics-of-the-aviation-industry-9-27/"}
