{"authors":[],"date_download":"2018-10-22 21:10:41","date_modify":"2018-10-22 21:10:41","date_publish":"2016-08-31 00:00:00","description":"Who are the people who write the words and shape the sound you hear each weekend morning? Read about them.","filename":"data/vaneerConsumption/TheWeekendEditionStaff.json","image_url":"https://media.npr.org/assets/img/2016/11/23/weekend-edition-staff_wide-1ccda3563e7bc21d663d353fcdffc8b9e5169f83.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_08_31_492124288_the-weekend-edition-staff_1540242641.html","title":"The 'Weekend Edition' Staff","title_page":"The 'Weekend Edition' Staff : NPR","title_rss":"NULL","source_domain":"npr.org","text":"The 'Weekend Edition' Staff\nEnlarge this image NPR NPR\nYou've met the hosts of Weekend Edition — Scott Simon and (starting in 2017) Lulu Garcia-Navarro. Who else works on the show? Here are some brief bios:\nChris Benderev is an associate producer. He helped create the \"For The Record\" segment for Weekend Edition Sunday and the biweekly sports segment with Mike Pesca. He occasionally directs the program. Chris has done work in NPR's Programming Department as the producer for the pilot season of podcast Embedded with Kelly McEvers, including co-reporting a documentary-style piece about a closing public high school outside Pittsburgh. Chris has also worked as a producer on the social science podcast Hidden Brain. He tweets @cbndrv.\nPeter Breslow is a senior producer for NPR. He has reported and produced from around the country and the world — from Mount Everest to the South Pole. During his career he has covered conflicts in nearly a dozen countries, had his microphone splattered with rattlesnake venom and played hockey underwater. For six years he was the supervising senior producer of Weekend Edition Saturday, managing that program's news coverage. Over the years, Peter has been honored with numerous awards including Overseas Press Club, DuPont-Columbia and two Peabody awards. A native of River Edge, N.J., Peter worships Muddy Waters, is a graduate of the University of Massachusetts and is an Eagle Scout.\nOlly Dearden is a producer. He began his career scraping a living together as a freelancer before landing a job at the BBC. From working in local newsrooms he moved on to become a network news producer in London. After nearly 10 years with the BBC — and one night shift too many — he left to join NPR as a producer. Following a stint at Morning Edition he found his home at Weekend Edition. And, he is happy to say, he is no longer scraping a living together.\nSarah Handel joined Weekend Edition as a producer in 2013, after nearly 10 years spent directing, producing and editing Talk of the Nation. She got her start in radio at WUOG, the student-run radio station at the University of Georgia, then moved to Washington, D.C., to attend Georgetown University and intern at NPR. Some of her favorite interviews to produce are with musicians, such as Xenia Rubinos, Myrkur and Mr. Lif. It's no wonder, really — yes, she is related to that other Handel. She tweets @sarahhandel.\nBarrie Hardymon began her career studying viola at Juilliard. She has since worked as a cocktail waitress, a shopgirl in a string of high-end lingerie boutiques and a cashier at New York's Strand bookstore. At the Strand, she distinguished herself by hollering \"Next!\" at a decibel level completely out of proportion to her size and by recommending John Fowles' The French Lieutenant's Woman — a novel that changed her life — to patrons wandering the Self-Help section. Barrie worked as a producer at NPR's member station in Baltimore, WYPR, where she developed a love of live radio and a hatred for screening calls. At NPR she has worked as an editor (and call screener!) on Talk of the Nation and Morning Edition and now edits a variety of topics on Weekend Edition, with a focus on books. (She'll never get tired of hearing Scott Simon call her \"our literary editor.\") She's a reviewer for NPR Books and a frequent panelist on NPR's Pop Culture Happy Hour podcast. Barrie still thinks you should read The French Lieutenant's Woman.\nJordana Hochman is the show's senior editor. She has developed news features on the struggles of addiction, crises of religious faith and issues of adoption and identity, among others. Jordana has brought Weekend Edition listeners interviews that range from highbrow to pop culture — from former Supreme Court Justice John Paul Stevens to the Backstreet Boys. She was an editor at Morning Edition for a decade and began her career in 2003 at NPR as an intern on the Washington Desk. Originally from Detroit, Jordana received her B.A. in women's studies from Vassar College. She completed an M.S. in psychoanalytic theory from University College London. At home, she's a MacGyver with a CSA box.\nRavenna Koenig is a producer and director. Before joining the show she interned at WNYC's On The Media and Benjamen Walker's Theory of Everything podcast. Since joining Weekend Edition in 2014, she has produced interviews with a diverse range of guests including Charli XCX, Mark Morris, Brie Larson, Ibeyi and Sandra Cisneros. Her reported work has also been featured on NPR, with a focus on arts and culture. During the 2016 presidential cycle, Ravenna has field-produced stories on the election and was part of a team that produced Morning Edition's documentary special about how Americans see President Obama's time in office. Her hometown is an island near Seattle, and while she doesn't miss the rain, she does miss the feeling of wonder after 30 straight days of it. She tweets @vennkoenig.\nSarah Lucy Oliver is the executive producer. Each week she is responsible for sorting through producer, editor and desk pitches and making sure there's some joy in every show. Sarah joined Weekend Edition as an intern in 1989 and came back to be veteran journalist Daniel Schorr's assistant. She has been with Weekend Edition ever since. In her two decades at the show, Sarah has held a variety of roles and produced a broad range of stories, her personal favorites being pieces on the Sept. 11 attacks, Major League Baseball's Grapefruit League in Florida, the gravesite of Stonewall Jackson's arm, and interviews with all sorts of luminaries including President Carter, Patti Smith and Mr. Rogers.\nStacey Samuel is the supervising editor. She came to NPR from the world of television, most recently CBS News and CNN before that — where she was a part of the Emmy-award winning team for 2012 election coverage. In a previous incarnation in New York City (her hometown) Stacey worked on documentaries at HBO and for some familiar cable channels, including the History Channel. She has been in front of the camera as an award-winning education reporter in Florida and spent some time in online journalism at the Daily Beast. Stacey is based in Washington, D.C., and tweets @staceyssamuel.\nIan Stewart is a production assistant. Since he joined in early 2016, he has followed presidential candidates around Iowa and New Hampshire, tracked down \"Chewbacca Mom\" and worked on the series \"How Did We Get Here?\" He got here after interning at All Things Considered, studying architecture and politics at Middlebury College and growing up in Iowa City. He really likes yardwork, graphic design and waffle fries.\nNed Wharton is a senior producer and has been with Weekend Edition since 1989. Ned produces many of the artist features heard on the program, including signature conversations with Baltimore Symphony Music Director Marin Alsop. He has produced news features from the field, including a trip to Egypt for a series on climate change, reports from Louisiana after Hurricane Katrina and reports on the economy and culture of Michigan's Upper Peninsula. Before NPR, Ned worked as a classical announcer at WNYC in New York, where he created and hosted the music show Mixdown. Beyond radio, Ned has worked as a record producer. His credits include the New York band Songs from a Random House and Singers, Songs & Sessions, a collection of live performances recorded in NPR's Performance Studio. He tweets @NPRNedWharton.\nNatalie Winston is an editor. She got her start at NPR on the Washington Desk as an intern during the 2008 election. That experience hooked her on politics and radio. She was the booker for NPR's 2012 election coverage, booking interviews with newsmakers and campaign surrogates for all live election specials. She is now an editor at Weekend Edition, where she gets to focus on politics and much, much more. Natalie has worked on interviews with accomplished authors, up-and-coming musicians, Michelin-star chefs, four-star generals and world leaders. Throughout the 2016 presidential campaign season she has helped produce NPR's live primary coverage and nightly specials from the Republican and Democratic conventions.","url":"https://www.npr.org/2016/08/31/492124288/the-weekend-edition-staff"}
