{"authors":[],"date_download":"2018-10-30 14:27:30","date_modify":"2018-10-30 14:27:30","date_publish":"2014-09-21 00:00:00","description":null,"filename":"data/vaneerConsumption/TheWhiteHouseDeportsTwoBorderCrashers.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_09_the_white_house_deports_two_border_crashers_1540909650.html","title":"The White House Deports Two Border Crashers","title_page":"The White House Deports Two Border Crashers","title_rss":"NULL","source_domain":"americanthinker.com","text":"What the president seems to have forgotten to tell those he’s waving in by the millions is that the border he’s relaxed everywhere else in America remains inflexible when it comes to the periphery of the Presidential Palace.\nIt’s President Obama who urges illegal invaders from all over the world to jump the fence on the border, infiltrate the jobs and neighborhoods of regular folk, and proceed to leech off the American taxpayer.\nIn other words, people can jump fences as long as the fence isn’t surrounding the president’s house.\nThat’s the kind of mixed message that apparently confused some poor schlub who must have figured that what’s good for the citizens of Texas, Arizona, and California must certainly be good for the guy who’s telling people who sneak across the border that he, above everyone else, desires to receive them with open arms.\nBut as we should all know by now, what the president says isn’t exactly what he means, especially when it comes to his safety and the safety of his family.\nThat’s why the intruder who recently jumped the fence at the White House and made it all the way across the North Lawn, through the North Portico, and into the executive mansion was promptly tackled and removed from the premises.\nMuch to the surprise of 42-year-old Omar Gonzalez of Copperas Cove, Texas, rather than running into the arms of the guy promising amnesty to anyone who successfully busts through the southern border, he was apprehended by a Secret Service detail.\nThat means that unlike Border Agents who, instead of doing their jobs, are baking birthday cakes for “unaccompanied minors” and changing diapers -- and in the process have contracted bacterial pneumonia, the White House border agents at least try to protect the perimeter of the house where Barack Obama parks his bedroom slippers.\nBehaving like an illegal immigrant determined to make his way to the safety of a sanctuary city, the White House border crasher must have taken his cue from the millions of illegals who successfully run, swim, or motor their way into America’s heartland, because Gonzalez “ignored officers' calls for him to stop and ran towards the White House.”\nRegrettably for Omar, it turns out that after he scaled the fence and officially arrived at 1600 Pennsylvania Avenue, the president, Sasha, and Malia had just lifted off via helicopter from the South Lawn, headed to Camp David for the weekend.\nUndoubtedly, had the first family been home the Secret Service would have been told to stand down and Gonzalez, a man with a dream, would have been invited inside by an understanding amnesty advocate and offered a hot meal, a warm shower, a free education, Obamacare, an Obama phone, and a job.\nSimilar to an illegal alien who, despite being deported, remains on the radar, Gonzalez, purportedly an American citizen, was on the Secret Service’s radar. Yet somehow the Iraqi war veteran still made it across the White House border. Thankfully, Gonzalez was armed only with a knife with a three-inch blade and a serrated edge and did not have a “Fast and Furious” gun.\nIt's unclear how Mr. Gonzalez initially made his way onto the grounds. It could have been human smugglers who drove him north, or maybe he walked thousands of miles in the hot sun to reach the North Lawn of opportunity, or perhaps Omar hitched a ride from Texas to DC on a crowded, foreign-germ and rare virus-riddled Death Train.\nEither way, after being apprehended Omar was taken by ambulance to George Washington Medical Center for a medical evaluation, compliments of the American taxpayer.\nWith the White House already evacuated, an hour later Secret Service agents and sniffing dogs were still investigating the scene of the North Lawn intrusion.\nAnd there’s more. Secret Service spokesman Ed Donovan said that the very next day a second man looking for a better life was arrested for encroaching on White House grounds. That man initially made the long trek to the gates of Obama’s house on foot, was turned away, and then returned a second time in a vehicle. After refusing to leave, he was arrested for trespassing.\nWhat all this means is that, although busting through the border around the United States is no longer considered a crime, busting through the border around the president’s house is considered a serious offence that thus far has not been defended with cries for amnesty.\nHow can this be fair? Aren’t people who invade places they have no business being currently the poster children for presidential pardon?\nThat’s why it must be very confusing for both of these men, because every chance he gets Barack Obama publicly demonizes anyone who criticizes his refusal to extradite those who jump fences a little further to the south.\nAfter all, these two White House visitors were really no different from the illegal trespassers who have been given a great big border-crashing pass from none other than Barack Obama.\nThat’s why if President Obama were truly fair, after making it all the way into the executive mansion, Omar Gonzalez and the guy in the vehicle who violated the White House perimeter would have been given amnesty and allowed to stay.\nJeannie hosts a blog at www.jeannie-ology.com","url":"https://www.americanthinker.com/blog/2014/09/the_white_house_deports_two_border_crashers.html"}
