{"authors":[],"date_download":"2018-10-30 14:16:35","date_modify":"2018-10-30 14:16:35","date_publish":"2018-06-20 00:00:00","description":null,"filename":"data/vaneerConsumption/Theworstwaytodieistoknowthedayofyourdeath.json","image_url":"https://www.americanthinker.com/images/bucket/2018-06/206790.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2018_06_the_worst_way_to_die_is_to_know_the_day_of_your_death_1540908995.html","title":"The worst way to die is to know the day of your death","title_page":"The worst way to die is to know the day of your death","title_rss":"NULL","source_domain":"americanthinker.com","text":"This is the saddest way to die, to essentially know the day of your death. People in this position naturally tend to be obsessed with their upcoming deaths. It's a lousy way to live life. Krauthammer must wake up every morning knowing he is one day closer to his death.\nCharles Krauthammer, the sometimes conservative commentator on Fox, has publicly announced that he is dying and has only a few weeks to live.\nNow look at President Trump. He's 71 years of age. Men die in their 70s all the time. But President Trump surely isn't obsessed with his death. That's because he has no idea when it will come. He could die tomorrow, next week, or next month, or he could live until he's 80, or 90, or longer. When people don't know the date of their death, they can live happier lives. Since they don't know when they will die, they don't think about it, or if they do, they often think death will occur later than it actually will.\nThat's why some 80-year-olds aren't obsessed with death. They could die tomorrow, or live until they are 85 or longer. Even 90-year-olds don't know when they are going to die. Some people think animals have it the best. While animals have fears of being harmed, animals have no concept of death or nonexistence. Never has an animal walked the planet who feared dying, because animals have no concept of dying.\nWould it be better if people were like that? What if people had no concept of death? Would they lead happier lives? Many people fear death and think about death even if the date of death is not set. That obsession with death could be magically lifted away, and people could have much happier lives if they didn't have an understanding of death.\nOn the other hand, some people say death gives meaning to life. If life is unlimited, or perceived to be unlimited, people don't value it. I personally believe that the reason many people are happier as they get older is that they know that their years remaining are limited and so appreciate life more. A 70-year-old can appreciate an ice cream cone or a walk in a park in a way that a 7-year-old would be almost completely oblivious to. That's because the 70-year-old realizes that life is limited, and he wants to get the most from it.\nWhat do you think? Would people be better off if they had no concept of death? Or are we better off than animals with the knowledge we have?\nThomas Lifson adds:\nI am not sure that Ed is correct that knowing the exact date of death is worst. I think about how Japan handles the death penalty (an aside: the next time someone tells you the entire \"civilized world\" rejects the death penalty, remind that person that Japan hangs people for capital crimes).\nIn Japan, a prisoner facing the death penalty is not told when the hanging will take place. All he knows is that at some point, usually in the middle of the night, the cell door will open, and the gallows will be his next stop.\nIt seems to me that this is designed to inflict maximum anxiety.\nMonica Showalter adds:\nWhile I respect Ed Straker's views, I am going to dissent here, too.\nCharles Krauthammer emphasized that he was satisfied with having done what he wanted in life and was clear in stating that he was facing the inevitable just as he had faced his hard life. His own statements are those of a true Stoic in the classical sense, all the more remarkable given that he has said in the past that he is not a believer, and thus is staring at death without the comforts of faith. All we can see in this is his courage and a recognition of the meaning in his suffering. There is something deep happening here that few of us can understand. But we can take him at his word that his life of fortitude and talent has left him at peace, even as it has enriched us all and will extend the memory of his bravely lived life well after his death.\nEd Straker is the senior writer at Newsmachete.com.","url":"https://www.americanthinker.com/blog/2018/06/the_worst_way_to_die_is_to_know_the_day_of_your_death.html"}
