{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-23 00:53:57","date_modify":"2018-10-23 00:53:57","date_publish":"2017-03-10 08:15:01","description":"The music video begins with The Weeknd, 27, whose real name is Abel Makkonen Tesfaye, standing alone in a rocky patch before a beautiful woman descends from the stars to join him.","filename":"data/vaneerConsumption/TheWeeknddanceswithwomaninIFeelItComingvideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E219A0100000578-0-image-a-43_1489133203133.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300232_The-Weeknd-dances-woman-Feel-Coming-video_1540256037.html","title":"The Weeknd dances with woman in I Feel It Coming video","title_page":"The Weeknd dances with woman in I Feel It Coming video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The stars have aligned for The Weeknd in his latest music video, I Feel It Coming.\nThe dreamy video was unveiled on Thursday, and sees the hit-maker slow dance with a mysterious woman beneath the moonlight before his collaborators, Daft Punk, make a rare joint appearance at the end of the video.\nThe video begins with The Weeknd, 27, whose real name is Abel Makkonen Tesfaye, standing alone in a rocky patch before a woman descends from the stars to join him.\nSCROLL DOWN FOR VIDEO\nMagical moment: The stars have aligned for The Weeknd and a mystery woman sent from space in his latest music video, I Feel It Coming\nThe Weeknd could hardly take his eyes and hands off the beauty as they slow danced beneath the stars.\nTaking her hand, the singer grooved with the model as she wore a beige crop top, and sparkling choker necklace.\nTheir romantic moment comes to an end with a bolt of lightning.\nA storm comes through, and Abel's friend turns into stone before crumbling right before his eyes.\nEyes only for her: The Weeknd could hardly take his eyes and hands off the beauty as they slow danced beneath the stars\nTender moment: Taking her hand, the singer grooved with the model as she wore a beige crop top, and sparkling choker necklace\nEye to eye: The pair gazed at each other as they shared a moment\nOut of this world: The beauty spellbound as she gazed at Abel\nSpotlight: The Weeknd danced with his leading lady\nThe Weeknd is not immune to the forces of nature as he turns into stone as well, bent over on the ground with his hand outstretched.\nThe end of the music video sees Daft Punk walking through the snow and coming across a glowing patch of violet light beneath the frost.\nThe pair gaze ominously at each other after wiping the frost clean to further inspect the unusual light.\nSo close: The pair cuddled close as they shared in a slow dance\nDestined for stardom: The pair enjoyed alone time beneath the gorgeous night sky\nHello sunshine! Abel smiled as the mysterious woman materialized in front of his eyes\nTrouble in paradise: A storm comes through, and Abel's friend turns into stone before crumbling onto the floor\nSet in stone: The mystery woman transformed before his eyes\nAbel teased the release of his new music video on Twitter on Thursday.\n'I feel it coming tomorrow,' he tweeted.\nThe video was released ahead of his suggested premiere date however, and amassed hundreds of thousands of views on the day of it's release.\nForces of nature: The Weeknd was not immune from turning into stone as well\nAlone time: The video begins with The Weeknd, 27, whose real name is Abel Makkonen Tesfaye, standing alone in a rocky patch\nIt's a hit: I Feel It Coming is The Weeknd's second collaboration with Daft Punk and is from his latest album, Starboy\nChart-topper: The song is currently ranked number eleven on Billboard's Hot 100\nPeople have identified the model in the music video as Kiko Mizuhara.\nI Feel It Coming is The Weeknd's second collaboration with Daft Punk and is from his latest album, Starboy.\nThe song is currently ranked number eleven on Billboard's Hot 100.\nThere they are! The end of the music video sees Daft Punk walking through the snow and coming across a glowing patch of violet light beneath the frost\nGetting a look: The pair gaze ominously at each other after wiping the frost clean to further inspect the unusual light","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300232/The-Weeknd-dances-woman-Feel-Coming-video.html"}
