{"authors":["Will Martin"],"date_download":"2018-10-30 21:54:44","date_modify":"2018-10-30 21:54:44","date_publish":"2016-12-16 00:00:00","description":"SolAbility's Global Sustainable Competiveness Ranking 2016 is topped by Sweden, followed by the other 4 Scandinavian nations.","filename":"data/vaneerConsumption/Theworlds23mostcompetitivecountries.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-most-competitive-countries-in-the-world-2016-12_1540936484.html","title":"The world's 23 most competitive countries","title_page":"    SolAbility Global Sustainable Competitiveness Index: 23 most competitive nations - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Iceland is the world's fifth most competitive country, according to SolAbility Bhushan Raj Timla/Shuttershock SolAbility, a sustainability think-tank based in Switzerland and South Korea, just released its annual Global Sustainable Competitiveness Index, a major ranking designed to find the countries around the world that have the best tools to sustain wealth creation and growth in the future.\nThe ranking is similar in nature to the World Economic Forum's annual Global Competitiveness Report, but SolAbility uses a different set of criteria to the WEF. This includes placing less emphasis on the international credit rating held by nations.\nIn the words of SolAbility, the ranking is \"based on a competitiveness model that incorporates all pillars of sustained growth and wealth creation: natural capital availability; national governance (the framework in which all players operation - the outcomes of policy directions and investments, e.g. the availability of infrastructure); intellectual capital (innovation and business capabilities); resource efficiency, and social cohesion.\"\nEach nation then receives a score out of 100. We picked the 23 nations with scores over 50.\nDeveloped, Western nations are generally close to the top of the list, while those countries still in the development phase are lower down. Scandinavian and northern European countries do particularly well.\nCheck it out below:","url":"https://www.businessinsider.com/the-most-competitive-countries-in-the-world-2016-12"}
