{"authors":["Molly Longman"],"date_download":"2018-10-31 01:44:21","date_modify":"2018-10-31 01:44:21","date_publish":"2018-09-06 18:13:49","description":"The World Surf League (WSL) made waves Wednesday with a big announcement. They became the first and only American-based global sports league to award equal prize money to male and female athletes, which many hailed as a positive changing of the…","filename":"data/vaneerConsumption/TheWorldSurfLeagueWillPayEqualPrizeMoneyToMaleFemaleChampions.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/96471500-f606-4246-a9eb-a0fb10185ae8-getty-1025115722.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-world-surf-league-will-pay-equal-prize-money-to-male-female-champions-11777888_1540950261.html","title":"The World Surf League Will Pay Equal Prize Money To Male & Female Champions","title_page":"The World Surf League Will Pay Equal Prize Money To Male & Female Champions","title_rss":"NULL","source_domain":"bustle.com","text":"The World Surf League (WSL) made waves Wednesday with a big announcement. They became the first and only American-based global sports league to award equal prize money to male and female athletes, which many hailed as a positive changing of the tides toward gender equality.\nThe decision about pay parity will go into effect in 2019. In a press release, the WSL said it was “proud of its commitment to gender equality, and proud to join other organizations beyond the world of sport reaching this important milestone.”\nThree-time world surfing champion Carissa Moore told CNN the move was \"huge for the sport of surfing and women in general.\" She said the WSL had done a lot for women, particularly in the last few years. In a video released by the WSL, Moore noted that the move was a positive nod to future generations. “It’s not only wonderful for us right now as professional surfers, but it says a lot to the next generation,” she says in the WSL video. \"That there is a future to the sport and there is something to look forward to and to work towards.”\nCelebrities such as Charlize Theron, Reese Witherspoon, and Chelsea Handler praised the WSL for “having their priorities straight and implementing parity,” as Handler put it. Theron noted that this is just the first of many U.S.-based global sports organizations to make the move toward pay equality. But progress is progress. “There's still a lot of work to do, but kudos to the WSL for getting us one step closer!” Theron wrote.\nKelly Slater — a surfer guru who holds 11 World Championships and 55 Championship tour event victories in the world of surfing — also praised the WSL for their move towards gender parity. \"The women on the tour deserve this change,” Slater said in a press release. “I'm so proud that surfing is choosing to lead sports in equality and fairness. The female WSL athletes are equally committed to their craft as the male athletes and should be paid the same. Surfing has always been a pioneering sport, and this serves as an example of that.\"\nIt’s important to note the change didn’t come out of nowhere. The world of surfing faced harsh criticism earlier in the year after a woman who won a female junior surfing event — the 2018 Billabong Junior Series Pallito Pro — received only half the amount of prize money as the winner of the men’s event, as the BBC reported.\nWSL’s CEO Sophie Goldschmidt said in the press release:\nThis is a huge step forward in our long-planned strategy to elevate women's surfing and we are thrilled to make this commitment as we reveal our new 2019 schedule. This is the latest in a series of actions the League has undertaken to showcase our female athletes, from competing on the same quality waves as the men, to better locations, and increased investment and support.\nThe world seems to be amped for this change, and now it's up to other sports leagues to decide if they'll ride this equality wave as well.","url":"https://www.bustle.com/p/the-world-surf-league-will-pay-equal-prize-money-to-male-female-champions-11777888"}
