{"authors":[],"date_download":"2018-10-21 02:50:34","date_modify":"2018-10-21 02:50:34","date_publish":"2018-09-05 10:11:04","description":"The forthcoming early-morning newsletter that will feature news critical to the nation’s many power centers, including the White House, Capitol Hill, government agencies, the Pentagon and more.","filename":"data/vaneerConsumption/TheWashingtonPosthiresWhiteHousereporterJacquelineAlemanytoanchornewearlymorningnewsletterPowerUp.json","image_url":"https://www.washingtonpost.com/resizer/s0_WlD1WKgMUPkT-z8hZWpFCyx0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HUIHS3QK3E2NDEYVXAMF7UGD6Q.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_09_05__1540090234.html","title":"The Washington Post hires White House reporter Jacqueline Alemany to anchor new early-morning newsletter “Power Up”","title_page":"The Washington Post hires White House reporter Jacqueline Alemany to anchor new early-morning newsletter “Power Up” - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"The Washington Post has hired White House reporter Jacqueline Alemany to anchor “Power Up,” a forthcoming early-morning newsletter that will feature news critical to the nation’s many power centers, including the White House, Capitol Hill, government agencies, the Pentagon and more.\n“Power Up will give Washington officials a quick download of the most relevant news as soon as they wake up in the morning, spotlighting the biggest of-the-moment stories as well as previewing what’s to come that day,” said Rachel Van Dongen, PowerPost editor at The Washington Post. “Jackie brings incredible energy and expertise to this role, ensuring the newsletter will quickly become a primary source for readers each morning.”\nWith Alemany at the helm, Power Up will draw on the depth and expertise of The Post’s more than 800-person newsroom to cover stories that are essential reading for the leaders, decision-makers and influencers working in the nation’s capital. The newsletter will provide a concise roundup that includes original reporting and a curated selection of stories from The Post and around the web, in addition to highlighting noteworthy conversations on social.\n“As journalists, we are always trying to stay ahead of the story. That thinking will infuse Power Up, reflecting the scrappy hustle that comes with early-morning reporting and chasing where a story might go,” said Alemany. “Readers can expect a well-curated digest, compiled and reported in near real-time, that drives the conversation throughout the day.”\nAlemany has covered the White House for CBS News since President Trump’s inauguration. In that role, she broke numerous stories about the Trump administration, including scoops about Scott Pruitt’s excessive spending, proposed cuts to the White House drug czar’s office and the lack of staffers in the Office of Science and Technology Policy. Prior to that, Alemany was a digital journalist on the presidential campaign trail, covering the New Hampshire primary and the campaigns of Jeb Bush, John Kasich and Donald Trump in addition to reporting from the state of Ohio during the general election. She also has worked as a digital producer for “60 Minutes” and a broadcast associate for the CBS Sunday show, “Face the Nation.” Before joining CBS in 2012, Alemany studied government at Harvard University, where she was captain of the women’s basketball team. Alemany is a 2017 African Great Lakes fellow at The International Women’s Media Foundation and serves on the leadership council of PeacePlayers International, a non-profit that uses basketball to unite and educate children around the world.\nThe Power Up newsletter is slated to launch this fall. Sign up to receive it here.","url":"https://www.washingtonpost.com/pr/wp/2018/09/05/the-washington-post-hires-white-house-correspondent-jacqueline-alemany-to-anchor-new-early-morning-newsletter-power-up/"}
