{"authors":[],"date_download":"2018-10-21 02:47:12","date_modify":"2018-10-21 02:47:12","date_publish":"2018-07-16 10:44:50","description":"Libby Casey to host live July 16; Special streams to include “Playing Games with Politicians”","filename":"data/vaneerConsumption/TheWashingtonPostlaunchesonTwitch.json","image_url":"https://www.washingtonpost.com/resizer/ZmOzG_GESiFtsYE2w07vr2wBxeI=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RAY3ZNKKYIZ4RIGZVWOEZJF5PY.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_07_16__1540090032.html","title":"The Washington Post launches on Twitch","title_page":"The Washington Post launches on Twitch - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Libby Casey to host live July 16; Special streams to include “Playing Games with Politicians”\nThe Washington Post today announced it has launched a channel on Twitch, the live streaming service for gamers and their many interests, creating a space for civil discourse on issues of the day and a fun entry into news. The Post’s planned programming will include live event coverage hosted by The Post’s Libby Casey and a series hosted by Post Political Reporter Dave Weigel called “Playing Games with Politicians.” Followers can subscribe to the new channel by visiting https://www.twitch.tv/washingtonpost.\n“Our first streaming experiment on Twitch was for Mark Zuckerberg’s testimony on Capitol Hill, and the real-time conversations and engagement showed us there was interest in news and analysis on the service,” said Phoebe Connelly, deputy director of video at The Washington Post. “We are excited to explore other video storytelling opportunities and share our political expertise with this vibrant community.”\nThe Post will regularly stream live coverage of must-watch news and political events. On July 16 at 10am, Casey will host the first live stream when President Donald Trump and Russian President Vladimir Putin meet for their first bilateral summit. White House Reporter David Nakamura and Audience Editor Gene Park will join Casey as they help readers understand the context and significance of the day’s news.\nIn “Playing Games with Politicians,” Weigel will interview prominent politicians while they play a video game. Over the course of a 30-60 minute live stream, users can follow along as the two discuss what’s happening on Capitol Hill and in the headlines and take questions while engaging in a game. The first season will feature Sen. Cory Booker (D-N.J.), Rep. Suzan DelBene (D-Wash.) and Rep. Matt Gaetz (R-Fla.).\nThe Post first debuted on Twitch in April with more than ten hours of programming that featured live streams of the Zuckerberg hearings and pre- and post-show analysis each day by Post reporters covering technology and Congress.","url":"https://www.washingtonpost.com/pr/wp/2018/07/16/the-washington-post-launches-on-twitch/"}
