{"authors":["Melissa Ragsdale"],"date_download":"2018-10-31 01:38:30","date_modify":"2018-10-31 01:38:30","date_publish":"2018-08-28 17:00:52","description":"You probably plan to spend Labor Day relaxing by the pool, going to a barbecue, or relishing the final beach days of summer. But the holiday is actually much more than an excuse to lay out in the sun. The history of Labor Day is rooted in the hard…","filename":"data/vaneerConsumption/TheWomenOfTheLaborMovementDontGetEnoughCreditButThese7BiographiesBringTheirContributionsToLight.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/f64e30aa-c1ab-4f35-8aa9-112c29d19e0f-biographies2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_the-women-of-the-labor-movement-dont-get-enough-credit-but-these-7-biographies-bring-their-contributions-to-light-10222176_1540949910.html","title":"The Women Of The Labor Movement Don't Get Enough Credit - But These 7 Biographies Bring Their Contributions To Light","title_page":"The Women Of The Labor Movement Don't Get Enough Credit — But These 7 Biographies Bring Their Contributions To Light","title_rss":"NULL","source_domain":"bustle.com","text":"You probably plan to spend Labor Day relaxing by the pool, going to a barbecue, or relishing the final beach days of summer. But the holiday is actually much more than an excuse to lay out in the sun. The history of Labor Day is rooted in the hard work of the Labor Movement, which in many ways, was (and continues to be) spearheaded by fierce women who raised their voices against classism, sexism, and racism to push for the rights that workers enjoy today.\nYou can thank the Labor Movement for many of the things modern workers take for granted, like the eight-hour workday, safe working conditions, and minimum wage. Many of the women who fought for these tenets of modern working life did so in the face of society's expectations of them. They refused to be silenced.\nSo, before you head out for your three-day weekend, take a moment to honor the fearless women who have spoken up for the rights of workers over the decades. You may not have heard of many of these women before, but you definitely need to know their names. These seven biographies will give you a fascinating glimpse into their lives, and hopefully inspire you to raise your own voice:\n'Goddess of Anarchy: The Life and Times of Lucy Parsons, American Radical' by Jacqueline Jones Lucy Parsons was one of the most famous leaders of the Labor Movement, and her life story is absolutely astounding. Parsons was born to an enslaved woman in Virginia in 1851 and raised in Texas. She became a defender of the First Amendment and a champion of the working classes. But her life was also filled with contradictions that Jacqueline Jones thoughtfully explores in this full-bodied biography. Click here to buy.\n'Jane Addams: Spirit in Action' by Louise W. Knight Jane Addams was a powerhouse grassroots activist and the founder of Chicago's famous Hull House, a community center where people of all classes and ethnicities could gather. She was an advocate for women's suffrage and the labor unions, a co-founder of the NAACP and other civil rights organizations, and even an adviser to presidents, eventually winning the Nobel Peace Prize. This masterfully-written biography will have you glued to its pages. Click here to buy.\n'Autobiography of Mother Jones' by Mary Harris Jones Mary Harris \"Mother\" Jones, an Irish-American schoolteacher and dressmaker, led some of the most major strikes of her era (including the famous Haymarket demonstration) and co-founded the Industrial Workers of the World organization. Of course, who better to tell her story than Jones herself? Click here to buy.\n'Dolores Huerta Stands Strong: The Woman Who Demanded Justice' by Marlene Targ Brill Presidential Medal of Freedom honoree Dolores Huerta co-founded, along with Cesar Chavez, the National Farmworkers Association, and has spent her life advocating for the rights of farmworkers, Mexican American immigrants, women, and LGBTQ populations. In this biography, Marlene Targ Brill tracks Huerta's years teaching, organizing, and pushing for change. Click here to buy.\n'An Autobiography' by Angela Y. Davis Angela Y. Davis is perhaps one of today's most outspoken activists and advocates for workers' rights. In this autobiography, written in 1972, Davis reflects on her early life and how she came to find political activism, from becoming a member of the Communist Party to her involvement with the Black Panthers. Click here to buy.\n'Child of the Sit-Downs: The Revolutionary Life of Genora Dollinger' by Carlton Jackson The 1937 sit-down strike at the General Motors plant in Flint, Michigan is one of the most legendary strikes in the history of the Labor Movement, and it was organized by this woman: Genora Dollinger. A co-founder of the Women's Emergency Brigade, Dollinger stood up to the Flint police and GM-sympathizers, helping to generate the first contract ever signed between GM and the UAW. She went on to become a key member of the NAACP, the ACLU, and many other organizations that would later connect the labor movement to modern feminism. Click here to buy.","url":"https://www.bustle.com/p/the-women-of-the-labor-movement-dont-get-enough-credit-but-these-7-biographies-bring-their-contributions-to-light-10222176"}
