{"authors":[],"date_download":"2018-10-30 01:19:35","date_modify":"2018-10-30 01:19:35","date_publish":"2017-02-07 16:30:49","description":null,"filename":"data/vaneerConsumption/TheWorldHealthOrganizationIsAMessWillTrumpFixIt.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/02/3239017492_0188dcfac8_b.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862375.html","title":"The World Health Organization Is A Mess: Will Trump Fix It?","title_page":"The World Health Organization Is A Mess: Will Trump Fix It?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"World leaders are putting the World Health Organization on notice if they don’t shape up. President Trump is threatening to cut 40 percent of U.S. funding from international organizations, while the United Kingdom released a report this week in which they say WHO must reform quickly or it “will result in decreased U.K. funding.”\nEven with public health focus on threats such as the Zika and Ebola viruses, vaccines, and mental health, critics have accused the WHO of mission creep, putting resources into too many issues and not focusing enough on the important ones.\nThe journal Nature even took the unprecedented step of issuing an editorial demanding reform at the WHO, which they see as too bloated to tackle essential global health issues.\n“Making matters worse, the agency is lumbered with a cumbersome and expensive organizational structure comprising a headquarters in Geneva, Switzerland, and six semi-autonomous regional offices,” they wrote this week. “This has resulted in a complex, bureaucratic and ineffective management structure. It is a body that is ripe for root-and-branch reform.”\nFears that nations will cut funding has already affected the race for the next director-general of the World Health Organization, now narrowed down to just three candidates from the U.K., Ethiopia and Pakistan.\n“I don’t think that if we (make reforms) we will necessarily be cut off from money,” said David Nabarro, a special advisor to the UN and the British candidate to head the WHO, to Agence France-Presse. He was appointed as special envoy to address the spread of cholera in Haiti by UN peacekeepers back in 2010, which led to the country’s largest epidemic.\nThe WHO director-general candidate from Ethiopia said they’ll find their money elsewhere.\n“When you put all your eggs in one basket … that’s when the problem happens,” said former Ethiopian health and foreign minister Tedros Adhanom, vowing to “expand the donor base” to avoid such problems in the future.\nThe candidates, along with former Pakistani health minister Sania Nishtar, want to boost the WHO’s presence and impact across the world. All three have typical health bureaucratic backgrounds, and don’t seem to bring any particular dominating vision to the public health arm of the United Nations with an annual budget of more than $4.3 billion.\nLast year, the United States was the single largest state contributor at more than $300 million. The next closest funder is the United Kingdom, at $195 million.\nThe biggest non-state actor contributing to the WHO is the Bill and Melinda Gates Foundation, at nearly $185 million. Their mission is “support of national efforts to reduce tobacco use and improve global nutrition,” according to the WHO’s latest budget.\nSuch a single large contribution from a nongovernmental organization may reveal why the issue of regulating tobacco has received such disproportionate focus at WHO. Thus far in 2017, for example, the organization has only released one official press release, highlighting a study on the impact of tobacco use on healthcare expenditures.\nIn the most recent budget, over $340 million goes to noncommunicable disease awareness and prevention, which includes tobacco. At least $18.7 million of that goes directly to the Framework Convention on Tobacco Control, the treaty that provides the blanket legislation for global tobacco rules.\nThe recent FCTC meeting in New Delhi in November, 2016 – from which, extraordinarily, the press was banned – aimed to push a worldwide ban on e-cigarettes, despite them being 95 percent less harmful than tobacco, according to Public Health England. The treaty also seeks to further strengthen laws on smoking and the international influence of the tobacco industry.\nThough the U.S. is not a party to the treaty, its large support of the United Nations and World Health Organization essentially subsidizes the work of the global healthy lobby.\nThat could change once the Trump administration sets its teeth into the international bodies.\nJust hours after being sworn in as the U.S. Ambassador to the United Nations, former South Carolina Gov. Nikki Haley sounded a warning at nations who cross the United States.\n“Our goal with the administration is to show value at the UN, and the way we’ll show value is to show our strength, show our voice, have the backs of our allies and make sure our allies have our back as well,” she said to a crowd of reporters at the UN headquarters in New York. “For those who don’t have our back, we’re taking names; we will make points to respond to that accordingly.”\nHaley’s fierce words were enough to send jitters though the UN, especially considering the U.S. contributes over $610 million to the world body, close to 22 percent of its total budget.\nAt last week’s confirmation hearing, questions as to the efficiency of the United Nations were very clear in Haley’s testimony.\n“Any honest assessment also finds an institution that is often at odds with the American national interest and American taxpayers,” she proclaimed in her opening statement.\n“We are a generous nation. But we must ask ourselves what good is being accomplished by this disproportionate contribution. Are we getting what we pay for?” asked former Gov. Haley.\nYaël Ossowski is a Young Voices advocate and senior development officer at Students For Liberty.","url":"https://spectator.org/the-world-health-organization-is-a-mess-will-trump-fix-it/"}
