{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 00:29:18","date_modify":"2018-10-23 00:29:18","date_publish":"2017-03-10 07:04:39","description":"It appears the Weeknd''s ex, Bella Hadid, has made a bit of a comeback on the new artwork for his hit song I Feel It Coming.","filename":"data/vaneerConsumption/TheWeekndposterfeatureswomanresemblingBellaHadid.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/06/3E206BAB00000578-0-image-a-37_1489127462167.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300126_The-Weeknd-poster-woman-resembling-Bella-Hadid_1540254558.html","title":"The Weeknd poster features woman resembling Bella Hadid","title_page":"The Weeknd poster features woman resembling Bella Hadid | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They split up months ago.\nAnd The Weeknd has been linked to Selena Gomez for months since breaking up with Bella Hadid in November 2016.\nBut it appears the ex has made a bit of a comeback on the new artwork for The Weeknd's hit song I Feel It Coming.\nIs that Bella? It appears the Weeknd's ex has made a bit of a comeback on the new artwork for his hit song I Feel It Coming\nThe Canadian singer posted a teaser to his Instagram page on Thursday.\nIt looks like he could be gearing up to release a music video for the hit song featuring Daft Punk.\nThe poster features The Weeknd, whose legal name is Abel Tesfaye, in a silhouette looking out into the distance.\nAlso in the background are the boys from Daft Punk, in their standard futuristic helmets that conceal their identity.\nWho's that girl? Right behind the The Weeknd, there is a silhouette of a woman that bares a striking resemblance to his ex-girlfriend Bella Hadid\nRight behind the The Weeknd, there is a silhouette of a woman that bares a striking resemblance to his ex-girlfriend Bella Hadid.\nThe high cheekbones and pouty lips look eerily similar, along with the shape of the nose and forehead.\nThe Victoria's Secret Angel and the 26-year-old performer, whose legal name is Abel Tesfaye, split for the last time in November 2016.\nThey had been dating for almost two years before the split.\nNot long after their breakup, the two had to share the runway at the Victoria's Secret Fashion Show as The Weeknd performed while Hadid was strutting down the catwalk in her first appearance for the brand.\nSince then, The Weeknd has been linked to Selena Gomez, 24, and the two haven't exactly been shy about their romance.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300126/The-Weeknd-poster-woman-resembling-Bella-Hadid.html"}
