{"authors":[],"date_download":"2018-10-21 02:50:31","date_modify":"2018-10-21 02:50:31","date_publish":"2018-09-04 10:17:50","description":"On Sept. 10, Sikka will join The Post to oversee the creation of a new flagship podcast.","filename":"data/vaneerConsumption/TheWashingtonPostnamesMadhulikaSikkaExecutiveProducerofnewflagshippodcast.json","image_url":"https://www.washingtonpost.com/resizer/NWWpxA7YJGM8ecnKcisndqP5QLs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DDZ6XA44Y45QHHHSPK2NCM27YQ.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_09_04__1540090231.html","title":"The Washington Post names Madhulika Sikka Executive Producer of new flagship podcast","title_page":"The Washington Post names Madhulika Sikka Executive Producer of new flagship podcast - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Credit: Kainaz Amaria\nThe Washington Post has hired award-winning journalist and veteran audio storyteller Madhulika Sikka as an executive producer on The Post’s audio team. Sikka will hire a team and oversee the creation of a new flagship podcast set to launch later this year.\n“The Post is making a major investment in audio following the tremendous success of podcasts like “Can He Do That?” and “Presidential,” said Emilio Garcia-Ruiz, managing editor at The Washington Post. “Madhulika brings to this role incredible news judgment and deep knowledge about the medium, positioning her to develop a show that aligns with The Post’s commitment to high-quality journalism and innovation.”\nSikka joins The Post from PBS where she served as Public Editor. Previously, Sikka was Executive Editor at NPR News where she worked for nine years and also served as the executive producer of “Morning Edition,” the most listened-to radio news broadcast in the country. Prior to that she was a television producer at ABC News for 13 years including senior producer at Nightline with Ted Koppel.\nShe is a recipient of multiple awards for her journalism including Emmys, duPonts, Peabodys, as well as from NABJ, SAJA, the RTNDA and the RTCA. She is also a writer and author of the book A Breast Cancer Alphabet. Sikka holds an undergraduate degree from the University of London and a master’s of philosophy in Economics and Politics of Development from Cambridge University (U.K.).","url":"https://www.washingtonpost.com/pr/wp/2018/09/04/the-washington-post-names-madhulika-sikka-executive-producer-of-new-flagship-podcast/"}
