{"authors":["Matt Levin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:55:15","date_modify":"2018-10-30 23:55:15","date_publish":"2017-02-15 08:00:04","description":"The California dream isn’t dead. It just upped and moved to South Dakota. Less than half of people born in California in 1980 are making more money than","filename":"data/vaneerConsumption/ThewitheringCaliforniaDreambythenumbers.json","image_url":"https://calmatters.org/wp-content/uploads/WitheringDream.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540943715.html","title":"The withering California Dream-by the numbers","title_page":"The withering California Dream—by the numbers | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The California dream isn’t dead. It just upped and moved to South Dakota.\nLess than half of people born in California in 1980 are making more money than their parents did as young adults. That’s the lowest percentage of children out-earning their parents that California has seen since at least 1940.\nBy contrast, 62 percent of people born in South Dakota in 1980 out-earn their parents. That’s the highest percentage for any state in the country.\nThose figures come from a recent study by Stanford economist Raj Chetty and several prominent co-authors, whose widely publicized work on intergenerational income mobility—the likelihood children will fare better financially than their parents—has transformed what we know about the data behind the American dream.\nChetty’s research has profound implications for California, a state whose unique mythology of boundless opportunity and instant riches has attracted generations of migrants to settle here in pursuit of a better life for their children. There’s a reason you’ve heard of “the California dream,” while the phrase “Vermont dream” doesn’t really evoke much beyond a good name for a Ben and Jerry’s flavor.\nWith the president declaring the American Dream dead and at least one leading candidate for governor staking claim to “the California dream” as a major campaign theme, let’s play Freud for a moment and analyze why decades ago young Californians dreamt of picket fences and swimming pools, while many of today’s young Californians can dream only that their parents will subsidize their cell phone bill well into their forties.\nTo the charts and graphs!\nSince 1940, the proportion of Californians out-earning their parents has dropped by nearly half\nAccording to Chetty’s research—which is revolutionary primarily because of access to a longitudinal database of Americans’ tax records—children born in 1940 in California had a roughly 90 percent chance of making more money than their parents did around the age of 30. Fast-forward 40 years, and Californians born in 1980 stand less than a 50 percent chance of making more than their parents.\nYour odds of out-earning your parents in California No Description\nIt’s important to think through how the comparison between children and parents is actually being measured here. For California babies born in 1980, researchers are using the total income they’re receiving as young adults in 2010, regardless of whether they stay in the state or move elsewhere.\nThey are then comparing that income to what their parents made at around the same age, regardless of their age when they became parents, or where those parents were born. So we’re not just comparing one generation of native Californians to another.\nObviously, part of that drop over that 50-year-period can be attributed simply to how poor everyone was back in 1940, when the United States had yet to fully escape the depths of the Great Depression. In 2014 dollars, the national median income of parents for children born in 1940 was around $18,000.\nFalling income mobility in California closely tracks what’s happening nationwide\nYounger Californians shouldn’t feel uniquely sheepish about making less than their parents. California mirrors the national pattern in income mobility very closely.\nNationwide, only 50 percent of Americans born in 1980 were out-earning their parents at the age of 30. That percentage has ticked up a bit in subsequent years, but not by much.\nCA vs Ohio No Description\nThere’s not a lot of variation between states in levels of income mobility, or in changes in mobility over time. There are some exceptions to this—states like South Dakota, Montana, and Arkansas all appear to have above-average mobility rates for younger natives.\nBut interestingly, California does not fare much better than many states in the Midwest, where the narrative of a dying American dream played heavily in the 2016 presidential campaign. Ohio and California have very similar mobility rates.\nHow can we possibly be similar to Ohio? We have Silicon Valley and the 6th largest economy in the world! Ohio has…LeBron?\nTo be fair to Chetty and his co-authors, their research is less focused on state-by-state differences than the broader national picture of declining mobility. But one of the study’s conclusions about why the American dream is fading could help explain what’s happening at the state level.\nThere are two primary determinants of mobility: economic growth and inequality.\nTo use the overwrought “pie metaphor,” it’s inherently good for income mobility when the economic pie grows over time. But when a smaller share of the population receives a larger chunk of that pie, the odds that the average child will out-earn his or her parents shrinks.\n“What we’re seeing on the national level is that most of the decline (in mobility) is not due to overall economic growth,” says Robert Fluegge, a Stanford researcher who contributed to the study. “What counts more is the change in the distribution for income growth.”\nTo test how much rising inequality determined mobility rates, Chetty’s team simulated what would have happened if the United States kept its very equal income distribution from 1940 through 2010. Under that scenario, 80 percent of children born in 1980 made more than their parents.\nThat would help explain why despite its remarkable economic growth over the past half century, California’s mobility rate is not that much different than states like Ohio or Indiana.\n“Even if you’re in California, you’re getting a concentration of income growth among high skilled labor that are able to use technology,” says Fluegge. “And those type of jobs are likely grabbing a lot of that income growth.”\nFluegge cautions that although inequality is likely part of the explanation for California, researchers have yet to drill down on the state specifically.\nInterestingly, plotting the level of inequality in a state to its level of mobility doesn’t reveal much of a relationship. Nor does plotting changes in the level of inequality over the past decade, which arguably would affect young wage-earners more. Researchers will have more work to do disentangling the relationship between inequality, growth and mobility at the state level.\nCan’t you tell me some good news about living in this state?\nWhile the fact that only 49 percent of younger Californians are making more than their parents may seem concerning, there are reasons to think that number may be overstating things a little.\nThat figure is at the household level, and does not adjust for household size. So a single 30-year-old born in 1980 may be compared to the dual incomes of their married parents at the same age.\nWhen adjusting for family size, the share of young adults out-earning their parents nationally improves from 50 percent to 60 percent (unfortunately those figures aren’t calculated at the state level). The sharp downward trend from 1940 persists, but the picture is somewhat rosier.\nPerhaps more significant for California, the 49 percent figure does not include immigrant children.\nThat shortcoming could be of enormous consequence to the Golden State, which has the highest percentage of foreign-born residents of any state in the country (27 percent).\nAlso, 2010 was also a particularly bad year for California incomes. In the depths of the Great Recession, median California household income dipped to a five-year low. The result could be that measuring the income of a 30-year old born in 1980 is artificially depressed in California, relative to both previous generations and other states where the recession took less of a toll.\nWhat about cost of living?\nSo that’s the glass half full version of income mobility in California.\nThe glass half empty version? Nothing in Chetty’s study accounts for this chart:\nOver the past forty years, the cost of housing has exploded in California relative to the rest of the United States. While the chart above only refers to median housing prices, there’s nothing much better about California’s rental market.\nThat means that those 49 percent of Californians making more than their parents are likely seeing their paycheck stretched much thinner by steeper mortgages and rents.\nHere again, Californians might look at South Dakota with envy. Before adjusting for cost of living, younger Californians could defend the state’s lackluster mobility numbers by saying, “well, sure South Dakotans may be making more than their parents. But that doesn’t mean Californians aren’t making more than South Dakotans overall.”\nIndeed, the median household income for 25 to 44 year-olds in California is about $8,000 more than their equivalents in South Dakota.\nBut after adjusting for California’s high cost of living, South Dakotans appear much better off.","url":"https://calmatters.org/articles/the-withering-california-dreamby-the-numbers/"}
