{"authors":["Matt Turner"],"date_download":"2018-10-30 21:04:35","date_modify":"2018-10-30 21:04:35","date_publish":"2016-12-22 00:00:00","description":null,"filename":"data/vaneerConsumption/ThewarbetweenWallStreettradersjuststeppedupanotch.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-war-between-wall-street-traders-just-stepped-up-a-notch-2016-12_1540933475.html","title":"The war between Wall Street traders just stepped up a notch","title_page":"    The war between Wall Street traders just stepped up a notch - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Trader Kevin Lodewick works on the floor of the New York Stock Exchange, which has been decorated with Christmas lights, in New York December 22, 2014. Carlo Allegri/Reuters A war of words between Wall Street traders just stepped up a notch.\nIt's a battle that has been playing out for some time, typically between market participants behind closed doors.\nStock exchanges — in particular the New York Stock Exchange and Nasdaq — both publicly traded and for-profit, stand accused by rivals and some users of unfairly increasing the price of market data, connectivity, and colocation.\nThe exchanges, in contrast, argue that these feeds are optional, that there is competition, and that trading firms can terminate feeds or colocation arrangements if they get too pricey.\nLast month, the Securities and Exchange Commission said it was seeking additional comment on a request from the New York Stock Exchange to change the fees its charges for certain connectivity services. Upstart trading venues and high-speed trading firms hoped that it had broader significance, and could be a hint that there is change on the way.\nThe SEC invited interested parties to submit data, views and arguments. Those who believe market data, connectivity and colocation has gotten too expensive have jumped at the chance.\nIn a letter made public on the Securities and Exchange Commission website Thursday, December 22, IEX, America's newest exchange, said it believes that NYSE knows it can charge a premium for speed, and that the most active traders will be forced to pay up.\nIt said:\n\"We think that NYSE understands that it can charge a continued premium for the \"fastest\" speed, as controlled by NYSE, and that members accounting for a majority of their trading volume will be forced to pay for it.\"\nThis strikes at the heart of this long-running battle. The debate centers on whether these services are essential — some customers and rivals say they are, the exchanges say otherwise —and whether there is any competition in the market for that data.\nIEX said in its letter that, while alternative providers do exist, proprietary trading firms, electronic market makers and agency brokers can't compete without using NYSE's products. IEX\nIEX also argues that broker-dealers have no choice but to route orders to NYSE, and takes aim at rebates that NYSE pays to its members to post liquidity.\nIEX\nThat IEX is expressing its views on this topic shouldn't come as a surprise. It was the only firm to file a comment letter in response to NYSE's initial application, and it pushed for the SEC to ask for more information on the fees the exchange group was proposing.\nHowever, following the SEC's request for additional comment, others have stepped forward too. The Securities Industry and Financial Markets Association, an industry trade body, said in a December 12 letter that \"the Exchanges have failed to demonstrate that these new connectivity fees are subject to any competitive forces.\"\nKatsuyama, chief executive of IEX Group, walks in the lobby of 4 World Trade Center in New York Thomson Reuters \"These fees are yet another example of the Exchanges so-called 'naked,' unjustified fee increases imposed by these conflicted for-profit self-regulatory organizations,\" the trade body added.\nCitadel, a high-speed trading firm, weighed in too, saying \"the proposed fees are emblematic of a persistent and destructive trend of exchanges significantly increasing connectivity, market data, and other fees with little justification or benefit.\" It also argued that these fees aren't voluntary, and there is no competition.\nIt said:\n\"While exchanges may argue that subscribing to premium services or data products is \"voluntary\" and point to alternative means of access through a third-party or suggest that firms not pursue the benefits of utilizing co-location, in reality, market participants do not have effective alternatives to paying exchange fees for access to such services and products.\"\n(As an aside, Citadel lobbied hard against IEX's exchange approval, so it is interesting to see them on the same side of this debate.)\nClearpool, an independent agency broker, echoed this sentiment, saying there is no \"viable alternatives to paying the exchanges' market data fees.\" It said:\n\"The current structure for the availability and accessibility of market data also does not provide viable alternatives for users, particularly as it relates to the choice of obtaining market data information via the Securities Information Processor (\"SIP\") or exchanges' proprietary data feeds.\"\nIt's important to note that earlier this year, a chief administrative law judge at the Securities and Exchange Commission (SEC) sided with the exchanges in a long-running legal case focused on the issue.\n\"The SEC judge ruled based on an extensive evidentiary record that the cost of market data is subject to competitive forces,\" Jeff Kimsey, head of global data products in global information services at Nasdaq, told Business Insider in November. \"Her ruling confirms that competition is real and increases transparency and facilitates access to the best prices.\"\nAnd Jeff Sprecher, chairman and CEO of Intercontinental Exchange, the group that owns the New York Stock Exchange, has dismissed the issue.\n\"It's always interesting to us that a lot of the people that try to benefit from fragmentation of markets then complain about the fact that it costs them more to do business in that fragmentation that they helped create,\" Sprecher said in an October earnings call.\nStill, it seems there is a growing chorus pushing for the SEC to intervene. This will be a topic to watch in 2017.","url":"https://www.businessinsider.com/the-war-between-wall-street-traders-just-stepped-up-a-notch-2016-12"}
