{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 19:59:34","date_modify":"2018-10-30 19:59:34","date_publish":"2016-07-28 16:00:03","description":"Tales of the Cocktail, aka the world’s largest cocktail party, is a whirlwind of booze and blu...","filename":"data/vaneerConsumption/Theworldslargestcocktailpartyjustendedhereswhatyoumissed.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/07/27/Images/WPIMAGE_cmgajcfoodandmore_9786.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_th_d20b77e6eecde564ad924784e6a63ee3__1540929574.html","title":"The world's largest cocktail party just ended; here's what you missed","title_page":"The world's largest cocktail party just ended; here's what you missed","title_rss":"NULL","source_domain":"ajc.com","text":"Tales of the Cocktail, aka the world’s largest cocktail party, is a whirlwind of booze and blurred lines. This seven-day, choose-your-own cocktail adventure held each July in New Orleans is geared toward bar industry professionals and drinks enthusiasts and can range from learning sessions on the subtle nuances of vermouth to pool parties on the many rooftops of the hotels scattered around the city. It all culminates on Saturday evening with the annual Spirited Awards where the best in the business are honored.\nNew Orleans is still recovering from the devastation of Hurricane Katrina in 2005. Tales founder, Ann Tuennerman, who started the festival as a cocktail tour in 2003, aimed to breathe life back into the ailing city by holding the convention during New Orleans’ lowest season for tourism. Add 20,000 bar professionals from around the world in the sweltering New Orleans’ heat, thousands of gallons of booze, seven days of parties, intensive learning sessions, tastings, dinners and bar crawls, and Tales causes quite a stir.\nAtlanta represents\nAtlanta was well-represented this year with bartenders such as Kellie Thorn from Empire State South, Trip Sandifer from The Painted Pin, Julian Goglia from The Pinewood and The Mercury, Kristin and Missy Koefod from 18.21 Bitters and Krista Slater of H. Harper Station all participating in product launches and parties throughout the week. For\nNate Shuman of Proof and Provision competing in the Four Roses Bourbon competition at Tales of the Cocktail.\nMadison Burch of Grain and Tavernpointe, it was another year as a CAP (cocktail apprentice) where she earned the coveted black coat and a lead role in training a new crop of red-coated CAPs participating in the program for the first time. There was no shortage of cocktail slinging competitions and a few of us lucky Atlantan’s watched as Proof and Provision's Nate Shuman threw it down at the Four Roses tournament with his play on the Old-Fashioned--firing up the butane torch for the finishing touch, a rosewood-smoked cherry.\nTastings and parties\nPurchasing a conference wristband and learning sessions are givens for bartenders, but for those simply seeking to sip and party their way through the week, purchasing a general admission wristband means you have an all-access pass to tasting rooms and parties around the French Quarter. While this writer advises purchasing at least three sessions to get your spirits education on, the wristband affords you access to events like the Rutte Distillery house party to sip gin and tonics and dance to old-school hip hop by Cam’ron, drinking down a few bourbons to Houndmouth at the Bulleit tasting, jamming to Gary Clark Jr. at the Jameson soiree or witnessing the glory that is the Wu-Tang Clan bringing down the house at 86 Co.’s after-hours party. Then there are special tasting rooms like Rutte Distillery opening a 70-year old genever (Dutch gin,) sipping Pierre Ferrand rare cognacs or sucking down tiki drinks made with Plantation Rum’s new overproof, old fashioned traditional dark (OFTD) BEFORE it hits shelves in September.\nPublic events\nFor 'free' cocktail entertainment (sans wristband,) Tales offers the public access to authors’ book signings, the conference bookstore and its marketplace where both artists and spirits makers are on hand to demonstrate and sell you\nToast to Tales is free to the public and officially opens the conference. It quickly turns into a street party hosted by brands like Bulldog Gin. Photo credit: Jennifer Mitchell\ntheir imbibe-inspired wares. But, we suggest heading to one of the daily Dynamic Duos around town where a host bar pits the home team against the visiting team with matchups like Chris Hannah of Arnaud’s French 75 versus New York cocktail maven Franky Marshall or the battle of the bearded elder barmen at Broussard’s with cocktail historian David Wondrich and bar legend Paul Gustings. You buy the drinks, they provide the entertainment.\nTales is what you make of it\nTales and its overwhelming schedule of over 200 events can be daunting for those who lack solid decision-making skills. It’s not uncommon to see people walking around quadruple fisting tasting cups of rum, vodka, tequila and gin, ladies in 1940s pin-up garb handing out drinks tickets or invites to parties, pop-up tattoo parlours, three classes you want to attend (at the same time) and a bicycle with a built-in blender for making frozen daiquiris while you burn off the booze.\nOn a personal note, my highlights included a five-hour gin history class and chilling with my new-found friends of the Mother’s Ruin Reform Society, members-only cocktail clubs with David Wondrich and the storied history of the many writers (and their cocktails) like Hemingway, Capote and Eudora Welty who have stayed at the Hotel Monteleone (while we sipped on sazeracs and Vieux Carres at 10 a.m.) All this plus a few brand-sponsored parties and Dynamic Duo happy hours made for a darn good Tales.\nYour next visit\nNew Orleans has a lot to offer its visitors beyond Bourbon and Magazine Streets and Jackson Square. The French Quarter alone is full of hidden alleyways, shops,\nThe Old Pharmacy Museum on Chartres St. is a must-visit historic site for Tales of the Cocktail attendees and where many of the city's first tipples were concocted.\nhistoric homes, charming architecture and beautiful gardens. Grab a to-go cup (with the city’s official cocktail the sazerac) and explore while you sip.\nVenture outside the Quarter by riding the Saint Charles streetcar into the Garden District or the Canal streetcar into Mid-City. Take an Uber into the Bywater. Walk along the paths of the grand Victorian City Park near Lake Pontchartrain. New Orleans is much more than booze and debauchery. It’s a city full of wonderful people, rich history and diversity which are what make its culinary and cocktail scenes equally rich and diverse and Tales of the Cocktail a must-attend event for thrill-seeking imbibers.\nNew Orleans cocktailian musts\nGo here to read more of our coverage of the Atlanta bar scene\n5 presidential drinks to sip in Atlanta during the conventions\nYour handy guide to shooting the ‘hooch\nAria’s revamped cocktail program\nBar hop along the Beltline\nClick here to read the AJC’s Ultimate Guide to Brunch in Atlanta\nClick here to read about dining in Atlanta around the clock\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook , following @ATLDiningNews on Twitter.","url":"https://www.ajc.com/blog/atlanta-restaurants/the-world-largest-cocktail-party-just-ended-here-what-you-missed/gk5VEAnMcZ4Ehh8viXt3pO/"}
