{"authors":[],"date_download":"2018-10-21 02:48:43","date_modify":"2018-10-21 02:48:43","date_publish":"2018-08-22 14:31:40","description":"Gen. David Petraeus, Michèle Flournoy and more will discuss emerging threats in election security and the country’s cyber infrastructure","filename":"data/vaneerConsumption/TheWashingtonPosthostsannualcybersecuritysummit.json","image_url":"https://www.washingtonpost.com/resizer/8VRxU9leRCF7W-EPg0ck_T94YIs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XLHL5MQ3VAYTTMH7OTM7CQEADY.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_08_22__1540090123.html","title":"The Washington Post hosts annual cybersecurity summit","title_page":"The Washington Post hosts annual cybersecurity summit - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"On Tuesday, October 2, The Washington Post will host its annual cybersecurity summit featuring government leaders, security experts, and technology industry executives to discuss urgent domestic and global cyber threats facing government, businesses, and individuals.\nGen. David Petraeus, former CIA Director; Michèle Flournoy, Co-Founder and Managing Partner of WestExec Advisors; and other leading voices will assess how government and the private sector are shoring up their defenses against the next wave of cyberattacks and what consumers can do to protect themselves.\nThe program will also feature conversations about the application of AI and deep learning technology in the cyber arena as well as a look at the most pressing threats including, foreign interference in American elections, critical infrastructure vulnerability, bot armies and misinformation campaigns.\nSpeakers include:\nMichèle Flournoy , Co-Founder & Managing Partner, WestExec Advisors\n, Co-Founder & Managing Partner, WestExec Advisors Stephen Gillett , CEO and Co-Founder, Chronicle\n, CEO and Co-Founder, Chronicle Ann Johnson , Corporate Vice President, Cybersecurity Solutions Group, Microsoft\n, Corporate Vice President, Cybersecurity Solutions Group, Microsoft Graham Brookie , Director and Managing Editor, Digital Forensic Research Lab, Atlantic Council\n, Director and Managing Editor, Digital Forensic Research Lab, Atlantic Council Lisa Monaco , Former Homeland Security Advisor to President Obama\n, Former Homeland Security Advisor to President Obama Karim Sadjadpour , Senior Fellow, Middle East Program, Carnegie Endowment for International Peace\n, Senior Fellow, Middle East Program, Carnegie Endowment for International Peace James Mulvenon , Vice President, Intelligence Division, Defense Group Inc.\n, Vice President, Intelligence Division, Defense Group Inc. Gen. David Petraeus (Ret.), Former CIA Director, Chairman, KKR Global Institute\nMore speakers to be announced.\nThis event is open to press and will be streamed on The Post’s site at wapo.st/cybersecuritylive Media who wish to cover must RSVP.\nEVENT DETAILS\nTuesday, October 2, 2018\n9:00 AM – 11:30 AM (Doors open at 8:30 AM)\nThe Washington Post Live Center\n1301 K Street NW Washington, DC, 20071\nThis event is presented by Accenture and Samsung Electronics America with support from Northrop Grumman Corporation and The University of Virginia.","url":"https://www.washingtonpost.com/pr/wp/2018/08/22/the-washington-post-hosts-annual-cybersecurity-summit-2/"}
