{"authors":[],"date_download":"2018-10-30 19:47:11","date_modify":"2018-10-30 19:47:11","date_publish":"2018-08-09 23:48:00","description":"Remains found in the New Mexico desert have not yet been officially identified but a missing boy's mother believes they are her son, Abdul-Ghani Wahhaj from Georgia.","filename":"data/vaneerConsumption/TheytookmylifeClaytonmomthinkssondiedatdesertcompound.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/08/09/Videos/4457905.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_they-took-l_a51a14316203471e5e52f79800e34236__1540928831.html","title":"‘They took my life’: Clayton mom thinks son died at desert compound","title_page":"Atlanta dad arrested at New Mexico compound had two wives, lawyer says","title_rss":"NULL","source_domain":"ajc.com","text":"Hakima Ramzi believed her husband back in late November when he said he was taking their 3-year-old son to a Clayton County park. But hours passed. Then days. Then months. Then one little lifetime.\nThough authorities haven’t yet confirmed it, the Jonesboro mother believes her son is the young boy whose body was found Monday on a makeshift desert compound in northern New Mexico. She believes it was Abdul-Ghani Wahhaj, who should’ve turned 4 on Monday, because he was the only child unaccounted for Friday when authorities raided the compound, which her husband and other relatives had secretly constructed in rural Taos County.\n“I wasn’t able to save my son, to save his life,” Ramzi said in a tearful interview Thursday with Channel 2 Action News. “They took my life. They took my life.”\nHer 39-year-old husband, Siraj Ibn Wahhaj, faces 11 counts of child cruelty and is accused in court filings of teaching the children on the compound to become school shooters, though further details haven’t emerged. Prosecutors made the same allegations against the other adults found arrested there — Wahhaj’s brother-in-law Lucas Allen Morton, sisters Hujrah Wahhaj and Subhannah Wahhaj and Jany Leveille.\nSiraj Wahhaj’s father said his son was also married to Leveille. Ramzi’s lawyer told The Atlanta Journal-Constitution he believed Siraj Wahhaj practiced polygamy.\nSiraj Wahhaj and Leveille declined to enter pleas at an arraignment hearing Wednesday, but the other suspects pleaded not guilty.\nAsked about the charges, Ramzi said none of it seemed like her husband. But she said nothing has seemed normal in the man since shortly before he left for the park after speaking about performing a healing ritual on Abdul-Ghani, who had multiple health issues, including brain damage from birth and seizures.\n“He acted different,” she said, unsure of what caused the change in her husband. “In 15 years, I never (had) any problem with him (until then).”\nShe said they were having no issues in their marriage.\nSiraj Wahhaj’s father, a well-known New York City imam also named Siraj Wahhaj, said he too is trying to understand what authorities say about his son staying at the compound for months with no electricity, no plumbing and hardly any food for the kids, who wore dirty rags. Taos County officials said the group appeared to be Muslim extremists.\n“What does that mean?” the elder Wahhaj told reporters in New York on Thursday, where he speaks at the Masjid at-Taqwa mosque. “I need to know the facts. Wherever they lead, we accept it.”\nREAD: Relief after DeKalb dad gets maximum time for drowning autistic son\nREAD: Was it fear — or recklessness — that took down Jason Spencer?\nREAD: Good things coming for notorious, crime-infested DeKalb complex?\nThe imam recalled times when he himself had been accused of being radicalized. Much of the scrutiny he’s faced came because he served as a character witness for the convicted mastermind of the 1993 World Trade Center bombing, Omar Abdel-Rahman. In 1993, the imam told The New York Times that, though some of the suspects had attended his Brooklyn mosque, its mission was peace.\nImam Siraj Wahhaj said he’s been in contact with police since the group disappeared and can’t get over how his relatives could thoroughly disconnect from the rest of the family.\n“This is surprising, especially in the Muslim faith, because family ties are very important,” he said. “They have cut ties not only with me, but with their brothers and sisters and mothers, the whole community.”\nThe imam also believes the remains belong to Abdul-Ghani. He said one of his other grandkids has spoken about the boy being buried on the land.\nA positive identification could take weeks, Kurt Nolte, New Mexico’s chief medical investigator, said Thursday, because of the advanced state of decomposition.\nOnce the identification happens, Ramzi can bring her boy home, though it won’t be how she intended.","url":"https://www.ajc.com/news/crime--law/they-took-life-clayton-mom-thinks-son-died-desert-compound/EMQ8ApkUUdAyGgoMRJyPnK/"}
