{"authors":[],"date_download":"2018-10-30 00:50:47","date_modify":"2018-10-30 00:50:47","date_publish":"2018-08-31 00:05:08","description":"\"The Pope has a bigger agenda,” said Cardinal Blase Cupich, the Archbishop of Chicago, in an interview about bombshell allegations about sexual abuse by Catholic clergy. “He’s got to get on with other things of talking about the environment and protecting migrants and carrying on the work of the church. We’re not going to go down a rabbit hole on this.”","filename":"data/vaneerConsumption/TheyDestroyEverythingTheyTouch.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Cupich3.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860647.html","title":"They Destroy Everything They Touch","title_page":"They Destroy Everything They TouchThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"“The Pope has a bigger agenda,” said Cardinal Blase Cupich, the Archbishop of Chicago, in an interview about bombshell allegations about sexual abuse by Catholic clergy. “He’s got to get on with other things of talking about the environment and protecting migrants and carrying on the work of the church. We’re not going to go down a rabbit hole on this.”\nAnd in that quote, which Cupich has protested was taken out of context (it wasn’t), Cupich showed a sad reality, which is that the Catholic Church is the latest in a long line of exceptional institutions of Western civilization brought into deep decline by the infiltration of the cultural Marxist/postmodern Left.\nThe “rabbit hole” Cupich refers to is a testimony released Saturday by Archbishop Carlo Viganò, a distinguished Vatican veteran who had served as the papal nuncio, or ambassador, to the United States, which included a scathing critique of Pope Francis. The most high-profile item in the 11-page Viganò letter was his story about Archbishop Theodore McCarrick, who had been the head of the Catholic archdiocese in Washington, D.C. McCarrick, it’s alleged, engaged in the sexual harassment and abuse of seminary students and also minors in his charge — and when Francis’s predecessor Pope Benedict, whose record in putting a stop to clerical abuse in the Church was sadly not the best, found out about McCarrick’s behavior he ordered McCarrick out of the seminary where he was living, restricted him to private prayer and penance, and demanded McCarrick avoid public life in the church. That was sometime around 2010.\nBut when Francis succeeded Benedict, he set McCarrick free from those sanctions and allowed him to resume a place of prominence in the Church. This while McCarrick was continuing a pattern of activity which can charitably be described as “worldly.” And nothing was done until June of this year, when McCarrick’s past behavior, which is apparently quite well documented within the Church, started to become public. That’s when a parade of higher-ups in the Church began issuing denials they knew anything about his sexual exploits, including Cardinal Donald Wuerl, his replacement in the DC archdiocese. The Viganò letter was particularly dismissive of Wuerl’s denials; Viganò says Wuerl “lies shamelessly” in those denials. And what’s more, Viganò says Francis knew perfectly well what he was bringing back into the active life of the Church.\nThe Viganò letter has had a decent bit of independent corroboration by other higher-ups in the Church, and what’s beginning to seem quite clear is there is something of a partisan, or ideological, divide within the clergy. Viganò, like Benedict, represents the conservative old guard; while Francis, Cupich and, apparently, McCarrick, appear to be more “progressive.”\nThis schism isn’t between the abusers and the anti-abusers, though. It’s not that simple. Benedict didn’t purge the Church of pederast priests as he so badly needed to do. But Francis appears a lot more willing to look the other way with respect to known abusive behavior than those predecessors (there is, after all, the case of Bishop Juan Carlos Maccarone, whom Francis protected from consequences of a scandalous homosexual affair back in Argentina) — and Cupich’s statement is instructive as to why.\nNot to mention that Cupich accused Francis’s detractors of racism against Hispanics — an assertion which is patently inane given that the Pope’s ethnicity is 100 percent Italian; both his parents were immigrants to Argentina.\nBecause it’s a pattern we see over and over again with “progressives” given power in institutions, be they cultural, business, religious, or otherwise. Time and again, what takes precedence over doing the job at hand is left-wing politics.\nThat Cupich would think to prioritize climate change over the protection of young men in the Church’s care from predatory monsters in the clergy is not an accident. He’s taking cues from the Pope, who has made climate change, immigration, and other topics having nothing to do with spirituality or religion a staple of his public comments.\nThe Pope has nothing of value to say on climate change. This is obvious to everyone who isn’t a leftist. And yet just days before Cupich delivered his gaffe in that NBC interview in Chicago the satirical site Babylon Bee had predicted the very comments he would make prioritizing climate change over the burgeoning sexual abuse crisis.\nBecause we see this all the time. We’ve seen it in the NFL, where the league’s insipid commissioner Roger Goodell has refused to do the obvious thing in responding to kneeling millionaires chasing fans away — namely, to bring the players onto the field after the national anthem is played and thus deny the opportunity to spoil the league’s product. Goodell has also sanctioned the league producing a series of PSA’s to appear during broadcasts of NFL games admonishing viewers against domestic violence, an insult to the fans who note NFL players seem to have a bigger problem with beating up their significant others than do the viewers.\nWe see it with respect to the Wall Street banks Citigroup and Bank of America, who embarked on post-Parkland virtue-signaling campaigns — instituting such policies as discriminating against sellers and manufacturers of “military-style” firearms, like the AR-15 platform which is used by virtually everyone BUT any of the world’s militaries, or gun buyers under 21. That progressive activism disguised as a business maneuver got those two banks disqualified from some $600 million in potential business financing bonds for the state of Louisiana, as the state’s Bond Commission voted to reward their disparagement of the Second Amendment by refusing to do business with them (hopefully that’s a move other red states will repeat).\nWe also saw it with Harvey Weinstein. What was Weinstein’s response when his serial abuse of actresses and other women pursuing employment in Hollywood started becoming publicly known? Here was his statement, in part:\nI am going to need a place to channel that anger so I’ve decided that I’m going to give the NRA my full attention. I hope Wayne LaPierre will enjoy his retirement party. I’m going to do it at the same place I had my Bar Mitzvah. I’m making a movie about our President, perhaps we can make it a joint retirement party. One year ago, I began organizing a $5 million foundation to give scholarships to women directors at USC. While this might seem coincidental, it has been in the works for a year. It will be named after my mom and I won’t disappoint her.\nGot that? He’s accused of playing Caligula atop his film company, and when outed as an abuser his response is to trash the NRA.\nWeinstein is scum, and he’s certainly leftist scum, but he’s not a complete moron. Weinstein believes, because in the culture he comes from it’s true, that leftist virtue-signaling works as an excuse for incompetence or malfeasance. It worked for Bill Clinton and Ted Kennedy, after all.\nThat the same thing can be said of Harvey Weinstein and the Pope is not a salutary situation. But it’s a reflection of how progressive leftism can corrupt institutions and people within them.\nIt’s why your author continuously remarks that the Left is a political movement by and for people incapable of doing a proper job.\nFeel free to prove me wrong. Good luck.","url":"https://spectator.org/they-destroy-everything-they-touch/"}
