{"authors":[],"date_download":"2018-10-30 00:50:51","date_modify":"2018-10-30 00:50:51","date_publish":"2018-09-05 00:05:48","description":null,"filename":"data/vaneerConsumption/TheyDestroyEverythingTheyTouchVolume2.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/NikeKaepernick.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860651.html","title":"They Destroy Everything They Touch, Volume 2","title_page":"They Destroy Everything They Touch, Volume 2The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"“Believe in something. Even if it means sacrificing everything.” That’s the caption attached to a gritty, black and white picture of Colin Kaepernick in the publicity marquee of Nike’s new marketing campaign announced Friday, a corporate branding decision which will be studied in business schools for decades along with New Coke and the Edsel as What Not To Do.\nNike’s decision to turn Kaepernick, the National Anthem-defiling, skills-atrophying, cellar-dwelling Social Justice Warrior ex-quarterback who last played NFL football with the then 2-14 San Francisco 49ers in 2016, into its latest corporate product pitch man was announced over the Labor Day weekend, and on Tuesday when the New York Stock Exchange got its first opportunity to weigh in on it the results weren’t good. Nike’s stock closed Tuesday at $79.60, though it did rise a bit in after-hours trading. That was a pretty serious bath from the $82.20 at which the stock closed on Friday before word leaked of Kaepernick’s contract — a loss of 3.16 percent of its value, or more than $3.5 BILLION in market capitalization.\nThere’s a great, though underrated, Cameron Crowe movie from 2005 named Elizabethtown, starring Orlando Bloom as a Portland athletic shoe designer whose big idea results in a marketing disaster which nearly wipes out the multinational company he works for. Bloom’s character is not-unsurprisingly fired at the beginning of the movie, and what follows is his soulful journey back from the personal brink. The guess here is Elizabethtown is likely going to be a hot rental in Portland over the coming weeks as many of the marketing geniuses responsible for flying Kaepernick’s stupid social justice warrior standard atop Nike’s flagpole get a similar treatment to Bloom’s Drew Baylor in the movie.\nHow can it be otherwise? Kaepernick has already laid waste to one American corporate giant’s market share, almost single-handedly tubing the NFL’s TV ratings by double-digits through his idiotic kneeling histrionics during the national anthem, and though he’s been out of the league for more than a year now many of those fans are not rushing back. It could well be that Kaepernick has done significant permanent damage to a brand many thought indestructible before he came along.\nAnd Nike has now embraced that contagion. And why? After all, Nike’s brand was made through affiliation with the best of the world’s athletes — Michael Jordan, Serena Williams, Tiger Woods, and many more at the top of their games. Now? Nike’s brand will be Shoes For Losers.\nAfter all, Kaepernick’s fall from status as one of the NFL’s top young quarterbacks to that of whiny political poseur incapable of winning football games and losing focus on his craft has made him toxic to NFL owners, who can’t justify the distraction he presents against the upside that he might offer as a backup quarterback — and because of that he’ll not likely play in the league again. But let’s not consider him any sort of martyr, because he most certainly isn’t. It should be remembered that Kaepernick wasn’t blackballed by the NFL, as he’s alleging in his new lawsuit against the league. Both San Francisco and the Denver Broncos offered him contracts as a backup quarterback last year and he turned them down. That isn’t sacrifice; it’s arrogance. He made himself toxic as the face of a franchise, and he furthermore didn’t pursue the opportunity to play in the Canadian Football League, where he could have reclaimed his promise as a top-level quarterback (particularly given the style of play north of the border).\nIn other words, Kaepernick is a loser as a pro athlete — because he lacks the focus of the other greats on whose success the Nike brand is built. As Jordan famously said when asked about his apolitical stance as an athlete and product pitchman, “Republicans buy basketball shoes, too.” Williams, Woods, and so many others built their personal athletic brands on being soft-spoken on matters political, which is one reason Nike grew to such immense popularity and market share. That’s all gone with this decision.\nIt’s the kind of action no good businessperson would ever take. But it most certainly is the kind of thing the social justice warrior crowd who increasingly populate the decision-making positions in corporate America can be expected to do.\nAgain, why? The answer is something we said in our last entry in this space: because the Left is a political movement made up by and for people incapable of doing a good job at honest work.\nAnd because of that, when you allow the social justice crowd a foot in the door they will soon destroy the entire institution. If they can take down the Catholic Church, after all, how hard is it for them to wipe out Nike?\n…\nWhile Nike’s stock was tanking on Tuesday, so was any semblance of decorum in the Senate, as the Democrats on the Judiciary Committee — including the potential 2020 presidential nominee Kamala Harris, who apparently achieved her position largely on the strength of her reputed former status as Willie Brown’s “side piece” — followed through on a planned attempt to disrupt Brett Kavanaugh’s confirmation hearings. And the Democrats’ foot soldiers in the audience proceeded to show their collective derrières with a cacophony of heckling, sign-holding, and farcical costume displays.\nExactly how this is supposed to affect Kavanaugh’s confirmation beyond making the Republican majority more resolute in passing his nomination to the Senate floor is a mystery. One has the strong feeling all political activism in America now, and particularly on the Democrat side, can be reduced to the simple acting-out of children.\nBut when children act out, typically they are punished. We’ll see if the voters are turned off enough by the anti-Kavanaugh idiocy Tuesday to deliver approbation on Election Day in November.\n…\nThe less said about John McCain’s funeral, the better. I’ll let my colleague Mike Bayham from The Hayride speak for me on that topic.\n…\nSo Rahm Emanuel isn’t going to run for re-election next year? Quel dommage! Say it ain’t so, Rahm. After all, you were doing so well!","url":"https://spectator.org/they-destroy-everything-they-touch-volume-2/"}
