{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-23 04:00:14","date_modify":"2018-10-23 04:00:14","date_publish":"2016-01-11 16:59:18","description":"The man denied snatching the chain from a woman in the street in Mumbai, India, and gulped it down as he was fleeing officers in a desperate attempt to conceal his crime.","filename":"data/vaneerConsumption/Thiefisforcefed40bananastoretrievegoldnecklaceheswallowedinMumbai.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/1436A316000005DC-0-image-a-5_1452531399330.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394181_Thief-force-fed-40-bananas-retrieve-gold-necklace-swallowed-fleeing-police-Mumbai_1540267214.html","title":"Thief is force-fed 40 bananas to retrieve gold necklace he swallowed in Mumbai","title_page":"Thief is force-fed 40 bananas to retrieve gold necklace he swallowed in Mumbai | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A thief was force-fed 40 bananas as part of moves to retrieve a gold necklace he swallowed while fleeing from police.\nThe man denied snatching the chain from a woman in the street in Mumbai and gulped it down as he was fleeing officers in a desperate attempt to conceal his crime.\nBut X-rays showed what he had done and police in the western Indian city administered an enema which failed to yield the desired result.\nA thief was force-fed 40 bananas as part of moves to retrieve a gold necklace he swallowed while fleeing from police in Mumbai\nDoctors suggested an operation would be the best way forward, but police officers decided it would be too expensive and opted instead for the bananas.\n'He was fed more than 40 bananas throughout the day,' Mumbai police Senior Inspector Shankar Dhanavade told AFP.\n'Eventually the chain was found. We made him wash and disinfect it,' the policeman added.\nThe 25-year-old man appeared in court on Friday and is in police custody, said Dhanavade.\nThe man denied snatching the chain from a woman in the street in Mumbai (file picture) and gulped it down as he was fleeing officers in a desperate attempt to conceal his crime\nAccording to reports, it was not the first time Mumbai police had turned to the fruit in order to recover a stolen item.\nIn July last year a chain was retrieved after a thief was made to eat two dozen bananas and drink several litres of milk laced with laxatives, the Hindustan Times reported.\nMonths earlier in April, a thief was fed five dozen bananas after swallowing a gold chain with a large pendant.","url":"https://www.dailymail.co.uk/news/article-3394181/Thief-force-fed-40-bananas-retrieve-gold-necklace-swallowed-fleeing-police-Mumbai.html"}
