{"authors":["Tanya Li For Daily Mail Australia"],"date_download":"2018-10-22 21:00:13","date_modify":"2018-10-22 21:00:13","date_publish":"2016-01-28 05:59:08","description":"Northern Territory Police are investigating how three patched motorcycle vests worth $15,000 were stolen from Rebels Outlaw Motorcycle Gang in a rural suburb of Darwin.","filename":"data/vaneerConsumption/ThievesstealofficialRebelsOutlawBikiejacketsworth15keach.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/04/30A6896B00000578-0-image-a-44_1453953827239.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420315_Foolhardy-thieves-break-private-residence-Virginia-Northern-Territory-steal-official-Rebel-jackets-worth-15-000-EACH_1540242013.html","title":"Thieves steal official Rebels Outlaw Bikie jackets worth $15k each","title_page":"Thieves steal official Rebels Outlaw Bikie jackets worth $15k each | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Northern Territory Police are investigating how three patched motorcycle vests worth $15,000 were stolen from a private residence in the Darwin rural suburb of Virginia.\nSuperintendent Clint Sims from the Drug and Organised Crime Squad said three patched Rebels Outlaw Motor Cycle Gang (OMCG) vests were stolen some time between 4.30pm and 8.50pm last Friday.\n“It’s believed the vests have a value of up to $15,000 each,” he said.\nOne of the stolen Rebels Outlaw Motorcycle Gang vests, reportedly worth up to $15,000 each\nA Rebels member commented on the NT police's Facebook post claiming that they had 'retrieved' the stolen 'colours' and that police involved themselves without them requiring assistance.\nHowever, the Rebels member, who prefers to not be named, told Daily Mail Australia that the vests do not have any monetary value - rather the $15,000 is indicative of personal worth as opposed to market value - and that is the amount they will earn for handing a rival club's colours to their president.\nHe said that the valued patch colours are 'earned, not bought.'\nAccording to a police spokesperson, each patch is paid for by the member which cost a few thousand dollars each.\nThe Rebels are classified as an outlaw motorcycle gang in the Northern Territory with approximately 70 chapters and more than 2,000 members.\nAccording to ABC News Police Commissioner Reece Kershaw has told them they are not welcome in the Top End after an incident that happened last year between the OMCG and their rival club, the Comancheros.\nThe vests were allegedly stolen some time between 4.30pm and 8.50pm on Friday night in Virginia, NT\nPolice Commissioner Reece Kershaw has told the Rebels they are not welcome in the Top End\nThe Rebels are classified as an outlaw motorcycle gang in the NT with about 70 chapters and more than 2,000 members","url":"https://www.dailymail.co.uk/news/article-3420315/Foolhardy-thieves-break-private-residence-Virginia-Northern-Territory-steal-official-Rebel-jackets-worth-15-000-EACH.html"}
