{"authors":[],"date_download":"2018-10-30 20:18:44","date_modify":"2018-10-30 20:18:44","date_publish":"2015-12-18 11:35:34","description":"The recent rash of smash-and-grab burglaries targeting metro Atlanta clothing stores has prompted Micheal Morrison to spend many of his off hours at his Atelier Shops store on Piedmont Road in Buckhead to ward off thieves.","filename":"data/vaneerConsumption/ThievessmashintostoresinBuckheadandWestEnd.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/18/Images/photos.medleyphoto.8504846.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_thieves-sma_0275a6a2f1052f7faeba3fbbcb97e19a__1540930724.html","title":"Thieves smash into stores in Buckhead and West End","title_page":"Thieves smash into stores in Buckhead and West End","title_rss":"NULL","source_domain":"ajc.com","text":"The recent rash of smash-and-grab burglaries targeting metro Atlanta clothing stores has prompted Micheal Morrison to spend many of his off hours at his Atelier Shops store on Piedmont Road in Buckhead to ward off thieves.\nHe was there again early Friday, but when he left for about 20 minutes to grab some late dinner, he returned around 3:30 a.m. to find his glass front door shattered and about $30,000 in merchandise missing.\n“They left some things, but they took quite a bit,” Morrison told The Atlanta Journal-Constitution. “They went after anything with logos – basically jeans, and anything that is leather, which has good street value.”\nMorrison said he already had tallied $30,000 in losses, “and I’m still counting.”\nHe called the smash-and-grab burglary, one of two such incidents in Atlanta early Friday, disappointing.\n“This is our livelihood,” said Morrison, who opened his store just north of Lindbergh Drive about a year ago.\n“It’s not fun to have people randomly decide to just take what doesn’t belong to them. It hurts,” he said. “The only way I can think of moving forward is just to stay strong and continue to take extra precautions.”\nAbout an hour after Morrison’s burglary, smash-and-grab thieves hit a West End clothing store for the second time in less than three months.\nThe thieves broke into The Mall West End on Ralph D. Abernathy Boulevard just before 4:30 a.m., then smashed through the glass front windows of the Jimmy Jazz store just inside the mall.\nAtlanta police have not said what was taken in the burglary.\nThe break-in was a near carbon-copy of a Sept. 21 burglary at the same store.\nEarly Thursday, another store, the A Ma Maniere menswear store in the 900 block of Marietta Street in northwest Atlanta, was targeted by smash-and-grab burglars for the second time since September.\nStaff photographer John Spink contributed to this article.","url":"https://www.ajc.com/news/crime--law/thieves-smash-into-stores-buckhead-and-west-end/YOfw4KgsWqYKCAU5QG37gL/"}
