{"authors":[],"date_download":"2018-10-30 20:19:57","date_modify":"2018-10-30 20:19:57","date_publish":"2015-09-16 10:08:55","description":"A smash and grab burglary in northwest Atlanta left the front of an upscale menswear store in shambles, the doors hanging from their frames, a metal security screen askew and mannequins toppled onto the floor.","filename":"data/vaneerConsumption/ThieveshitNWAtlantastorecarsathotelnearTurnerField.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/09/16/Images/photos.medleyphoto.8159389.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_thieves-hit_fbac1eec79abdc1b1b44686f8930a3d8__1540930797.html","title":"Thieves hit NW Atlanta store, cars at hotel near Turner Field","title_page":"Thieves hit NW Atlanta store, cars at hotel near Turner Field","title_rss":"NULL","source_domain":"ajc.com","text":"A smash and grab burglary in northwest Atlanta left the front of an upscale menswear store in shambles, the doors hanging from their frames, a metal security screen askew and mannequins toppled onto the floor.\nSurveillance video showed the thieves backing a white Ford Taurus through the front doors of A Ma Maniere in the 900 block of Marietta Street near 8th Street just before 2:30 a.m. Wednesday, Atlanta police spokeswoman Kim Jones said.\nA witness who was working security nearby told investigators that he noticed several males from two vehicles, the Taurus and a silver Infiniti SUV, standing next to the shattered windows. The security guard “said that he tried to block the vehicles in, but was unsuccessful,” Jones said.\nThe surveillance video also showed seven males entering the store with their faces covered and taking clothing and hand bags.\nThe store’s owner estimated that the thieves took $15,000 in merchandise.\nAlso overnight, armed thieves broke into several cars at a hotel near Turner Field for the second time in recent weeks.\nChannel 2 Action News reported the thieves, teenagers with their faces covered with bandannas, pointed a gun at a security guard who confronted them in the parking lot of the Grant Park Hotel on Pollard Boulevard.\nTwenty vehicles were broken into at the hotel on July 21, Atlanta police said.\nIn DeKalb County, several cars were broken into overnight at the Sam’s Club on Clairmont Road, according to Channel 2.","url":"https://www.ajc.com/news/crime--law/thieves-hit-atlanta-store-cars-hotel-near-turner-field/Rx3kdm26Csw1WTs6AbKa1L/"}
