{"authors":[],"date_download":"2018-10-30 21:03:44","date_modify":"2018-10-30 21:03:44","date_publish":"2016-12-29 11:00:00","description":"What are you doing New Year's Eve? Here are five can’t-miss events for procrastinators who are still trying to make plans","filename":"data/vaneerConsumption/ThingstodoonNewYearsEveinAtlanta2016.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/12/22/Images/newsEngin.17054701_tumblr_mymkh9LN361rlny4zo1_1280.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_celebrate-new_f8e21afe959b3c5d032d5c03171008b2__1540933424.html","title":"Things to do on New Year's Eve in Atlanta 2016","title_page":"Things to do on New Year's Eve in Atlanta 2016","title_rss":"NULL","source_domain":"ajc.com","text":"Say goodbye to 2016 and hello to a new year!\nThere are plenty of things to do in metro Atlanta to celebrate the upcoming year, including events that are budget-friendly.\nRELATED: Things to do New Year’s DAY in Atlanta\nHere are five can’t-miss events for procrastinators who are still trying to make plans:\nChick-fil-A Peach Bowl Parade\nTickets to the Chick-fil-A Peach Bowl have long been sold-out, but the parade before the big game is a great way to celebrate New Year’s Eve as a family. The festivities will kick off at Peachtree Street and feature mascots, marching bands, cheerleaders, floats, classic cars and more. The free parade is an Atlanta tradition and a fun way to celebrate the end of 2016 with loved ones who won’t be awake at midnight.\n9 a.m. Dec. 31. Free Baker Street and Peachtree Street. Chick-fil-apeachbowl.com.\nKids’ Early New Year’s Eve Celebration\nHead to Stone Mountain Park for another family-friendly celebration on New Year’s Eve. The park will hold its Stone Mountain Christmas activities as usual at 2 p.m, culminating with the Snow Angel Fireworks and a Snowfall Finale at 8:30 p.m. Following costumed characters, music and more, get in place at 8:59 p.m. for an early New Year’s countdown. The countdown will be punctuated with snowfall instead of a traditional “drop” at 9 p.m.\n2-9 p.m. Dec. 31. $25.95 child (ages 3-11), $31.95 adult, $5 (advance discount). Crossroads at Stone Mountain Park, 1000 Robert E. Lee Blvd., Stone Mountain. stonemountainpark.com.\nLadybird\nLooking to celebrate New Year’s Eve without all the fuss? Ladybird Grove and Mess Hall is hosting a New Year’s Eve Do Nuthin’ event. Dress as casually as you want, dine on a special late-night menu and enjoy a free “champagne of beers” toast at midnight.\nUntil 2:30 a.m. Dec. 31. No cover. Ladybird Grove and Mess Hall, 684 John Wesley Dobbs Ave., Atlanta. Ladybirdatlanta.com.\nPeach Drop\nJoin family, friends and thousands of metro Atlanta residents and visitors to watch as an 800-pound peach is dropped in downtown Atlanta.\nA pending sale of Underground Atlanta may take place early in the new year, but it won’t affect the New Year’s Eve celebration, which is held annually at the development.\nAJC’s Melissa Ruggieri reports that Ne-Yo and Collective Soul will perform before the giant peach is dropped at midnight. Entrances to the stage area will be off of Peachtree Street, Marietta Street and Martin Luther King Jr. Drive.\nUnderground Atlanta will open at 5 p.m.\n7 p.m.. Dec. 31. Free. Underground Atlanta, 50 Upper Alabama St., Atlanta.\nDancing with the Stars: Live\nOlympic gold medalist and Dancing with the Stars winner Laurie Hernandez, along with season 23 pro finalists will visit Atlanta on New Year’s Eve as a part of the Dancing with the Stars: Live! – We Came To Dance national tour.\n7 p.m. Dec. 31. $56-$121.50. Fox Theatre, 660 Peachtree St., Atlanta. Foxtheatre.org.\nMore things to do New Year’s Eve in Atlanta\nTelevision: New Year's Eve Specials\nAtlanta Peach Drop\nNew Year's Eve Concerts\nMarietta Square New Year's Eve\nNew Year's Eve Atlanta Neighborhood Events\nIce Skating outdoors in Atlanta\niFly Indoor Skydiving Atlanta\nChick-fil-a Atlanta Peach Bowl at the Georgia Dome\nCollege Football Bowl Schedule\nAtlanta Church Events: Watch Night and other New Year’s Eve Services\nNew Year's Eve 2017 Atlanta","url":"https://www.ajc.com/entertainment/celebrate-new-year-eve-things-this-weekend-atlanta/FCdDZEfAissko47Ld43v0J/"}
