{"authors":[],"date_download":"2018-10-30 18:02:50","date_modify":"2018-10-30 18:02:50","date_publish":"2018-09-06 00:00:00","description":"An outdoor concert, a craft and design show, some blues, are all good ways to spend a Thursday in Atlanta.","filename":"data/vaneerConsumption/ThingstodoinandaroundAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/06/Images/newsEngin.22853751_GettyImages-911527938--1-.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_things-and-around-atlanta-today__1540922570.html","title":"Things to do in and around Atlanta","title_page":"Things to do in and around Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"It’s a good Thursday for outdoor (and indoor) music and activist crafts.\nSlightly cooler temperatures and lower humidity welcome us to September. Though it’s too hot to feel like autumn, here are a few ideas for fall activities.\nCHILDISH GAMBINO AT THE INFINITE ENERGY CENTER\nChildish Gambino is the hip-hop alter ego of American entertainer Donald Glover, creator and star of the television series “Atlanta.” As Childish Gambino, Glover is a Grammy-winning musician. 7:30 p.m. $79.50-$129.50. Infinite Energy Center, 6400 Sugarloaf Parkway, Duluth, 770-626-2464. www.infiniteenergycenter.com.\n‘THE ART AND THE CRAFT OF ACTIVISM’ AT MODA\nThis is the last four days of the “craftivism” exhibit at the Museum of Art and Design in Midtown. Among the articles on display are “Welcome Blankets” created by Los Angeles-based designer and artist Jayna Zweiman as a commentary on the current immigration debate. Zweiman, who hopes to accumulate enough blankets to span the same distance as the proposed 2,000-mile border wall between the U.S. and Mexico (creating “2,000 Miles of Warm Welcome”), has also invited others to fashion their own 40-inch-by-40-inch blankets, offering templates and directions. Free-$10. 1315 Peachtree St. NE, Atlanta, 404-979-6455. www.museumofdesign.org.\nCODY MATLOCK AT DARWIN’S\nAt just 22, Cody Matlock has been playing guitar for 10 years. He’s a regular at the Sandy Springs juke joint called Darwin’s Burgers & Blues. No cover charge. 8:30 p.m.; 234 Hilderbrand Drive, Sandy Springs, 470-399-5060. darwinsburgers.com.\nCheck the weather before you head out; sudden showers are possible.\nLooking for more ideas? Listen to the accessAtlanta podcast at accessAtlanta.com.","url":"https://www.ajc.com/entertainment/things-and-around-atlanta-today/ORa9lmFxQeRXAXkMUqA4PN/"}
