{"authors":[],"date_download":"2018-10-30 17:50:18","date_modify":"2018-10-30 17:50:18","date_publish":"2018-10-30 15:51:58","description":"Three things to do in Atlanta on Halloween","filename":"data/vaneerConsumption/ThingtodoinandaroundAtlantaonWednesdayOct31.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/newsEngin.23253997_TD-Halloween-5-edited.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_thing-and-around-atlanta-wednesday-oct__1540921818.html","title":"Thing to do in and around Atlanta on Wednesday, Oct. 31","title_page":"Things to do in and around Atlanta on Wednesday, Oct. 31","title_rss":"NULL","source_domain":"ajc.com","text":"Wednesday is Halloween! Here are some events to help you celebrate.\nHalloween w/ Elton Dan & The Rocket Band & Gypsies, Doves, and Dreams\nJoin the fun at City Winery with a performance by tribute bands Gypsies, Doves and Dreams (Fleetwood Mac) followed by Elton Dan (Elton John). There will be an Elton John Costume Contest before the performances begin. The winner will receive a free pair of tickets and dinner for two (up to $100) to a future City Winery show. Everyone who dresses up like the Rocket Man will earn a free dessert. 8p.m. Oct. 31. $20 - $28. City Winery. 650 North Ave. NE. #201, Atlanta. 404-946-3791. www.citywinery.com.\nGeorgia A-Scary-Um\nSpend Halloween hanging with beluga whales at this annual Georgia Aquarium event. Children and adults will enjoy trick-or-treating in a family friendly, safe environment while taking part in Halloween-themed crafts. There are trick-or-treating stations in each gallery and a photo station. Kids under the age of 12 who arrive in costume will receive free general admission with each full price paid adult or Annual Membership holder (up to 2 free children per full-priced adult). The offer cannot be combined with any other discount, combo or special offer including Early Bird or Imagination Nights.​Children must be in costume to redeem the offer but adults can dress up as well. No face-covering masks. 4 - 8 p.m. Oct. 31. $31.95. Georgia Aquarium, 225 Baker St. NW, Atlanta. 404-581-4000, georgiaaquarium.org.\nHaunted Pink Trap House at 13 Stories\nTrap lovers will enjoy this collaboration between rapper 2 Chainz and 13 Stories Haunted House. The hip hop themed haunted attraction features scenes inspired by iconic movies like Boyz in the Hood, Juice, Tales from the Hood, Set it Off and more. 7-11 p.m. Sundays-Thursdays; 7-11:59 p.m. Fridays-Saturdays. Through Nov. 11. $22-$78. 13 Stories Haunted House, 329 Temple Ave., Newnan. 770-251-9911, 13storieshauntedhouse.com.","url":"https://www.ajc.com/lifestyles/thing-and-around-atlanta-wednesday-oct/yCoMZLlCMZE9FTP2G9rUZK/"}
