{"authors":[],"date_download":"2018-10-30 17:55:17","date_modify":"2018-10-30 17:55:17","date_publish":"2018-10-30 17:16:00","description":"Here's a list of cool things to do in metro Atlanta after the sun goes down.","filename":"data/vaneerConsumption/ThingstodoinandaroundAtlantaafterdark.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/newsEngin.22885348_Battle-and-Brew-UDB43IVBO5N-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_things-and-around-atlanta-after-dark__1540922117.html","title":"Things to do in (and around) Atlanta after dark","title_page":"Things to do in (and around) Atlanta after dark","title_rss":"NULL","source_domain":"ajc.com","text":"It’s fall, so daylight is getting shorter while nighttime is lasting incrementally longer. But don’t worry. The real fun starts after dark. With so much growth and culture in Atlanta, the city offers a burgeoning nightlife scene. Whether you’re looking for music, theatre, or to play games, Atlanta has enough options to keep your social calendar full. To help you know where to go after dark, The Atlanta Journal-Constitution compiled a list of cool things to do after the sun goes down.\nIan Schumacher’s Acoustic Showdown\nNow in its 23rd series, Ian Schumacher’s Acoustic Showdown is an Atlanta institution for upcoming singer-songwriters to share their talents and further their careers. If you are looking for an evening of stellar music, exciting industry networking and great vibes, Monday nights at Tin Roof Cantina are a great choice. The Showdown features 14 acoustic artists who perform three original songs in hopes to advance to the finale on Dec. 7. Previous winners include the Sweet Tea Trio, Puddles Pity Party, Alex Guthrie, Aimme and Chasing Lovely. Artists can sign up to compete at bit.ly/tinroof, and more information can be found at facebook.com/acousticshowdown.\nTin Roof Cantina, 2591 Briarcliff Road NE, Atlanta. 404-329-4700, tinroofcantina.com.\n7 Stages Theatre\nIt’s one of Atlanta’s oldest performing arts venues. During the past 40 years, 7 Stages Theatre has cultivated a sense of family within both Atlanta’s theatre and Little 5 Points communities, and many of its playwrights and artists have started and molded their careers at 7 Stages, going on to become notable actors, writers, producers, and directors.\n1105 Euclid Ave. NE, Atlanta. 404-523-7647, 7stages.org.\nDuring the past 40 years, 7 Stages Theatre has cultivated a sense of family within both Atlanta’s theatre and Little 5 Points communities. CONTRIBUTED BY: 7 Stages Theatre (For the AJC)\nHotel Clermont\nMarking the revitalization of a legendary southern landmark, Hotel Clermont reopened in June as a 94-room boutique hotel with a playful rooftop space that features a hodgepodge of activities. While there’s occasionally a waiting list to head upstairs at peak times, guests can always visit the hotel’s lobby bar or enjoy dinner at the French-American brasserie Tiny Lou’s to pass the time.\nRooftop hours: 4 p.m.-midnight Sunday-Thursday; 4 p.m.-1 a.m. Friday-Saturday. 789 Ponce De Leon Ave. NE, Atlanta. 470-485-0485, hotelclermont.com/food-spirits.\nMonday Night at the Garage\nThe Garage is the home for Monday Night Brewing, barrel aging and sour beers. The brewery in southwest Atlanta has become a go-to spot for hanging out with friends over a pint (or more) of craft beer with its 20 taps since it opened in September 2017. Its expansive patio provides plenty of outdoor seating overlooking the Beltline, and there are individual tables and fire pits. Inside, you’ll find a spacious seating area with a projection screen. Various food vendors (including Betty’s Waffle Emporium) serve up meals that pair nicely with craft beer.\n4-9 p.m. Monday-Thursday, 12-10 p.m. Friday-Saturday, 1-6 p.m. Sunday. 933 Lee St. SW, Atlanta. 404-352-7703, mondaynightbrewing.com.\nBattle and Brew\nThis establishment describes itself as “Atlanta’s first and oldest geek-centric restaurant and pub.” Battle and Brew offers top-of-the-line computer, console and board gaming opportunities, including a virtual reality (VR) rig and a racing simulator. If you prefer something more private, there is a separate lounge that can be rented by the hour and features every modern gaming system as well as the VR setup and cozy couches. As a pioneer of Geek Trivia in Atlanta, Battle and Brew averages 25 teams every Wednesday. It also offers monthly Super Smash Bros. tournaments, weekly Magic: The Gathering drafts, and themed cosplay contests.\n5920 Roswell Road, Suite A-120, Sandy Springs. 678-798-8190, battleandbrew.com.\nThe Garage is Monday Night Brewing’s home for barrel aging and sour beers. CONTRIBUTED BY: Monday Night Brewing (For the AJC)\nHip-Hop Trivia ATL\nStarted in May 2016, Hip-Hop Trivia ATL brought a fresh alternative to Atlanta’s nightlife scene. Hosted by Branden Peters and Maurice Garland (who also host Atlanta-based music podcast Day 1 Radio) and resident marketing strategist Crystal Thomas, Hip-Hop Trivia ATL has become known in Atlanta by merging party culture, karaoke and bar trivia. The weekly event provides a diverse crowd with five rounds of trivia questions based on different pop culture and current topic-driven themes. Past themes have included 2Pac, Hip-Hop Soul, Trap Music and 30 Under 30. The non-pretentious vibe of the event rejects guest lists in favor of bottle service or couch standing. Yet, it has attracted several notable guests including Andre 3000, Atlanta Hawks head coach Lloyd Pierce, rapper-activist Killer Mike, record executive Kawan “KP” Prather, radio-TV personality Minya “Miss Info” Oh, rap artist Pastor Troy and NBA broadcaster Rosalyn Gold-Onwude. Hip-Hop Trivia ATL runs for approximately three hours and includes music breaks courtesy of DJ and radio personality Dusei Da Great, who sets the tone for the evening.\nJack’s Pizza & Wings, 646 Highland Ave., Atlanta. 404-525-4444, thehiphoptrivia.com.\nBonfire ATL\nBonfire ATL is described as “church on Sunday for those who don’t go to church.” The weekly event that includes Atlanta’s creatives and influencers, and it changes venues every week after curators scout for outside industrial spaces to fill with a stage, a silent disco (where people come to dance and listen to music DJs play on wireless headphones), a projector screen for movies, a photo booth and lights. If you’re looking for something to do on Sundays, Bonfire ATL is worth considering.\nCheck instagram.com/bonfireatl for each week’s location. bonfireatl.com\naccessAtlanta: Listen to the AJC’s things-to-do podcast","url":"https://www.ajc.com/lifestyles/things-and-around-atlanta-after-dark/L8pOHvP4lQjwReGgL0IUpL/"}
