{"authors":[],"date_download":"2018-10-30 18:03:37","date_modify":"2018-10-30 18:03:37","date_publish":"2018-08-23 00:00:00","description":"Learn about the Bronzelens Film Festival, Atlanta’s pre-eminent festival devoted to films by people of color, at the Atlanta Marriott Marquis and more things to do today in Atlanta.","filename":"data/vaneerConsumption/ThingstodoinandaroundAtlantaforThursdayAug23.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/23/Images/newsEngin.22738984_united-skates-tribeca.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_things-and-around-atlanta-for-thursday-aug__1540922617.html","title":"Things to do in and around Atlanta for Thursday, Aug. 23","title_page":"Things to do in and around Atlanta for Thursday, Aug. 23","title_rss":"NULL","source_domain":"ajc.com","text":"Cooler temperatures and only a slight chance of rain will make for a pleasant Thursday.\nTo celebrate the day, check out high school kids playing the blues, a film festival from artists of color and the permanent collection at a north Atlanta art museum.\nLIVE MUSIC: SUNSET SIPS AT THE CHATTAHOOCHEE NATURE CENTER\nAs part of their Sunset Sips series the Chattahoochee Nature Center hosts No Solution, a band of high school kids playing rock and blues. There will be a cash bar, and patrons can bring a picnic dinner if they like. Sunset Sips occurs at the nature center the second and fourth Thursday nights through September. 6:30-9:30 p.m.; $10; 9135 Willeo Rd, Roswell, Ga.; 770-992-2055; www.chattnaturecenter.org/\nLECTURE AT OGLETHORPE UNIVERSITY’S MUSEUM OF ART\nHear a lecture by John Daniel Tilford, curator of collections at Oglethorpe University Museum of Art. The museum celebrates its 25th anniversary this summerby exhibiting more than 100 works from its permanent collection; 6:30 p.m.; reception, 7:15 p.m.; $5 adults, free for members, children under 12, and students. 4484 Peachtree Rd. NE; 404-364-8555; oglethorpe.edu/\nBRONZELENS FILM FESTIVAL AT THE ATLANTA MARRIOTT MARQUIS\nMore than 80 films will be screened from filmmakers representing 23 countries at the BronzeLens Film Festival, Atlanta’s pre-eminent festival devoted to films by people of color. The movies include narrative fiction, documentary, music video and short film screenings. The festival, which continues through Aug. 26, is headquarterd at the Atlanta Marriott Marquis, but will also show films at SCADShow, Georgia Pacific Center Auditorium, Auburn Avenue Research Library, and Landmark Midtown Art Cinema. Five day pass: $75 and up; students: $25 and up. Atlanta Marriott Marquis, 265 Peachtree Center Avenue, Atlanta, Ga.; 404-521-0000; bronzelens.com/\nRELATED: What to expect at the Bronzelens Film Festival in Atlanta\nMore things to do: People watch at Dragon Con\nEvents: Ideas for this weekend in Atlanta\nLook Ahead: Best events for Labor Day Weekend in Atlanta\nCheck the weather before you leave home.\nLooking for more ideas? Cue up the accessAtlanta.com podcast.","url":"https://www.ajc.com/entertainment/things-and-around-atlanta-for-thursday-aug/6AQnMAk9jZYvKj1Ep3MVuJ/"}
