{"authors":[],"date_download":"2018-10-30 18:02:39","date_modify":"2018-10-30 18:02:39","date_publish":"2018-08-02 04:01:00","description":"Things to do in and around Atlanta on Aug. 2, 2018. Editor's picks include Kesha and Macklemore at Cellairis Amphitheatre at Lakewood, ‘Hairspray’ at the Legacy Theatre in Tyrone, exhibit to see at at Hodgepodge Coffeehouse in East Atlanta.","filename":"data/vaneerConsumption/ThingstodoinAtlantaThursdayAug22018.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/02/Images/newsEngin.22569664_Kesha.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_things-and-around-atlanta-thursday-aug__1540922559.html","title":"Things to do in Atlanta Thursday, Aug. 2, 2018","title_page":"Things to do in Atlanta Thursday, Aug. 2, 2018","title_rss":"NULL","source_domain":"ajc.com","text":"Cooler temperatures (and the likelihood of rain) shouldn’t curtail a good time Thursday.\nLet us recommend some musical theater, an art show and why not risk an outdoor concert?\nMacklemore returns to the metro area and teams up with Kesha for a concert today at Cellairis Amphitheatre at Lakewood. DAVID BARNES / DAVID.BARNES@AJC.COM (The Atlanta Journal-Constitution)\nKesha and Macklemore at Cellairis Amphitheatre at Lakewood\nThe show goes on at Cellairis Amphitheatre at Lakewood, rain or shine, so jump in, for the love of Kesha and Macklemore. According to AJC pop music writer Melissa Ruggieri, “The duo, who perform on the song ‘Good Old Days’ on Macklemore’s latest album,” are in the midst of a nine-week, 30-market tour together.\n$30-$231; 2002 Lakewood Way, Atlanta; 404-443-5090; thelakewoodamphitheater.com/\nUPCOMING CONCERTS: Tickets on sale for Atlanta concerts\n‘Hairspray’ at the Legacy Theatre in Tyrone\nThe big-hair musical based on the John Waters movie will be presented through the weekend at the Legacy Theatre in Tyrone, Ga., in the south metro area. $25-$40; 12 and under: $15; 1175 Senoia Road, Suite C; Tyrone; 404-895-1473; www.thelegacytheatre.org/\nJennifer Farnsworth paintings at Hodgepodge Coffeehouse\nA new exhibit at an East Atlanta coffee shop is called Jazz Series in Black & White. On display are the acrylic-on-canvas works of New York artist (and Atlanta native) Jennifer Farnsworth, who paints such musicians as Louis Armstrong, Miles Davis, Ella Fitzgerald, Billie Holiday, McCoy Tyner, Sammy Davis Jr, Betty Carter and Wynton Marsalis.\nThe free show by Farnsworth, who is also a vocalist, opens Thursday and runs through the month of August at the Hodgepodge Coffeehouse; Monday-Saturday, 7 a.m.-7 p.m.; Hodgepodge Coffeehouse, 720 Moreland Ave.; 404- 622-8525; hodgepodgecoffee.com/\nCheck the weather before heading out the door.\nAJC Calendar: More things to do today and this weekend in Atlanta\nStill looking for ideas? Listen to our accessAtlanta podcast at www.accessatlanta.com/\nwhat's missing, i think is just the \" what's missing, i think is just the \"\nThings to do","url":"https://www.ajc.com/entertainment/things-and-around-atlanta-thursday-aug/jK24qhuBmgpGxCR6legH9M/"}
