{"authors":[],"date_download":"2018-10-30 20:55:46","date_modify":"2018-10-30 20:55:46","date_publish":"2017-01-13 20:17:10","description":"Enjoy the MLK Day programs, catch a Sesame Street show and more this weekend in metro Atlanta.","filename":"data/vaneerConsumption/ThingstodothisweekendinAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/PalmBeachPost/Blog/Quick_Pulse/2017/01/13/Images/photos.medleyphoto.12844884.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/events_kids--family_celebra_324337044546f5bab9c4190f87bff5f7__1540932946.html","title":"Things to do this weekend in Atlanta","title_page":"Things to do this weekend in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"Now that the icy chill from last weekend has subsided, capitalize on this unusually warm January weekend and take in some sun in every part of metro Atlanta it will shine.\nHere’s a handy county-by-county guide on how to maximize your weekend:\nCobb\nTree Planting at Marietta City Cemetery. 8:30 a.m. to 11 a.m. Saturday, Jan. 14. Free. Marietta City Cemetery. 358 West Atlanta St. SE, Marietta. 770-424-4664. www.mariettacalendar.com.\nJoin the Marietta Tree Keepers to help beautify the Marietta City Cemetery this Saturday for a special tree planting. After signing in, enjoy free donuts, coffee and hot chocolate before getting started. Make sure to wear clothes that can get dirty.\nHand pies made and sold in the metro area come in a variety of shapes and fillings. One of the sellers worth a look is the Australian Bakery Cafe on the Marietta Square. CONTRIBUTED BY BECKY STEIN (Becky Stein)\nMarietta Square Food Tour. 11 a.m. to 2 p.m. Saturday, Jan. 14. $45 per person. The Historic Marietta Square. Park Square, Marietta. 866-736-6343. www.mariettacalendar.com.\nEnjoy sampling some of the delicious flavors around the Historic Marietta Square this Saturday on the Marietta Square Food Tour. This 3 hour tour will have you sampling savory dishes from over 10 local restaurants on the square.\nRELATED: How a guy from New Jersey became the pot pie man of Marietta\nGreater Atlanta Coin Show. 9 a.m. to 5 p.m. Sunday, Jan. 15. Free. Hilton Atlanta/Marietta Hotel and Conference Center. 500 Powder Springs St., Marietta. 770-772-4359. www.mariettacalendar.com.\nIf you love coins, add a few special treasures to your collections by visiting the Greater Atlanta Coin Show this Sunday. You can have your own coins appraised, browse an amazing array of bullion, rare coins, collectibles and gemstones and ask questions from the experts.\nMLK Program. 5 p.m. to 7 p.m. Sunday, Jan. 15. Free. Ben Robertson Community Center. 2753 Watts Drive, Kennesaw. 770-422-9714. www.kennesaw-ga.gov.\nDesigned to encourage and inspire the youth, you'll hear meaningful essays and see live performances that include singing and interpretive dance.\nDeKalb\nAdults-Only Late Skate. 11 p.m. to 3 a.m. Friday, Jan. 13. $8 admission, $3 skate rental. Golden Glide Roller Skating Rink. 2750 Wesley Chapel Road, Decatur. 404-288-7773. www.atlantafamilyfuncenters.com.\nRoller skating isn't just for kids, and nobody knows this better than the Golden Glide Roller Skating Rink. They've created an adults-only skating night that will have you rolling with fun while listening to 80's music this Friday.\nSesame Street: K is for Kindness. 11 a.m. to 4 p.m. Saturday, Jan. 14. Free. Perimeter Mall. 4400 Ashford Dunwoody Road, Dunwoody. 770-394-4270. www.perimetermall.com.\nIf your little ones love Sesame Street, don't miss the \"Sesame Street: K is for Kindness\" event taking place at Perimeter Mall this Saturday. This free event will feature favorite characters like Elmo and Abby, and teaches children how to act with kindness in their everyday lives.\nWinter Hike and \"Bowl Burning.\" 1 p.m. to 2 p.m.. Saturday, Jan. 14. Free. Dunwoody Nature Center. 5343 Roberts Drive, Dunwoody. 770-394-3322. www.cvbdunwoody.com.\nDue to last weekend's winter weather, this event was rescheduled to this Saturday, January 14. As part of a new \"First Saturday\" program taking place at the Dunwoody Nature Center, this Winter Hike and \"Bowl Burning\" event makes the perfect outing to ring in the new year. It all starts with a hike throughout the ground of the nature center, followed by a gathering around a campfire where you can toss in written-down burdens and troubles.\nCaffeine and Octane Car Show. 8 a.m. to 11 a.m. Sunday, Jan. 15. Free. Perimeter Mall. 4400 Ashford Dunwoody Road, Dunwoody. Contact. www.cvbdunwoody.com.\nDue to last weekend's winter weather, this event was rescheduled to this Sunday, January 15. If you love cars, you won't want to miss the Caffeine and Octane Car Show taking place in Dunwoody this Sunday. This free event has a little something for everyone, and hosts hundreds of vehicles from classic to exotic.\nGwinnett\nLast weekend may have ended on a cold, icy note, but you can make up for lost time by enjoying these events happening around Gwinnett County. Check these out:\n1st Saturday Aviation Program and Pancake Breakfast. 8 a.m. to 11 a.m. Saturday, Jan. 14. $6 for adults, $3 for children ages 10 and under. EAA 690 Hangar, Sports Aviation Complex, Briscoe Field. 690 Airport Road, Lawrenceville.\nwww.events.exploregwinnett.org.\nDue to last weekend's winter weather, this event was rescheduled to this Saturday, January 14. Spend the morning at Briscoe Field eating a tasty breakfast while learning all about aviation at the 1st Saturday Aviation Program and Pancake Breakfast. The price includes an all-you-can-eat hot breakfast with pancakes, eggs, sausage, biscuits, coffee, juice and milk, as well as an aviation program while you eat.\nZumba Party at the Park. 2 p.m. Saturday, Jan. 14. $11 per person. Bogan Park and Aquatic Center. 2723 North Bogan Road, Buford. 678-277-0850. www.events.exploregwinnett.org.\nGet fit and have a blast this Saturday at the Zumba Party in the Park event taking place in Buford. Burn some calories and learn all about this exciting and fun fitness movement from educated Zumba instructors.\nGreat Bowls of Fire Chili Cook-Off. 11 a.m. to 3 p.m. Sunday, Jan. 15. Free, tasting tickets $1 each. Arena Tavern. 2000 Satellite Blvd., Duluth. 770-623-4585. www.events.exploregwinnett.org.\nGet your taste buds fired up at the Great Bowls of Fire Chili Cook-Off event happening at Arena Tavern this Sunday. Not only can you sample some of the best chili in the South, but you'll also enjoy watching your favorite game on 75 flat screen televisions while enjoying beverages from 20 local breweries. Proceeds benefit Connections Homes.\nAn Engaging Affair Bridal Show. 1 p.m. Sunday, Jan. 15. $7 per bride, free for grooms. Gwinnett Historic Courthouse. 185 Crogan St., Lawrenceville. 770-822-5450. www.events.exploregwinnett.org.\nIf you're planning your wedding, or just dreaming of the future, don't miss one of the best bridal shows in the state. At An Engaging Affair Bridal Show, you and your bridal party can enjoy a bridal fashion show, help from professionals, door prizes, live entertainment and more.\nNorth Fulton\nAutrey Mill Nature Preserve Feeding Friday. 4:30 p.m. Jan. 13. Free for members, $2 suggested donation for non-members. Autrey Mill Nature Preserve and Heritage Center. 9770 Autrey Mill Road, Johns Creek. 678-366-3511. www.autreymill.org.\nDue to last weekend's winter weather, this event was rescheduled to this Friday, January 13. If you have children who love animals, make sure to stop by the Autrey Mill Nature Preserve Feeding Friday. At this family-friendly event, kids (and parents) will get a chance to feed rabbits, frogs, ducks, chickens, turtles and snakes.\nPublic Performance by Theatre for Young Audiences. 11 a.m. to 3 p.m. Saturday, Jan. 14. $10 per person. Roswell Cultural Arts Center. 950 Forrest St., Roswell. 770-641-1260. www.get.org.\nJoin the S.T.E.A.M. Team from the Theatre for Young Audiences to help solve science-based problems during a special public performance this Saturday. Follow Misha, Taylor, Aubrey, Elliot and Scout as they figure out backyard mysteries.\nRoswell Wedding Showcase. 2 p.m. to 4:30 p.m. Sunday, Jan. 15. Free. DoubleTree. 1075 Holcomb Bridge Road, Roswell. 770-640-3253. www.visitroswellga.com.\nIf you need a little help planning your dream wedding, get help from the top wedding experts at the Roswell Wedding Showcase this Sunday. You'll get a chance to browse flowers, gowns, music, cakes, decor and more as well as learning about honeymoon options and retreats.\nFlying into the Future. Noon to 4 p.m. Sunday, Jan. 15. Free with general admission or membership. Chattahoochee Nature Center. 9135 Willeo Road, Roswell. 770-992-2055. www.chattnaturecenter.org.\nJoin the naturalists at the Chattahoochee Nature Center for Flying into the Future, a special Family Fun event happening this Sunday. You'll see a live Birds of Prey show, learn about biomimicry from Georgia Tech educators, see ECO TINKER exhibits and browse STEM booths.\nRECOMMENDED VIDEO: Jimmy Fallon, Sesame Street & The Roots Sing Sesame Street Theme","url":"https://www.ajc.com/events/kids--family/celebrate-mlk-things-this-weekend-metro-atlanta/yrQ8Xht0PH2BBS3Qnq8WqI/"}
