{"authors":[],"date_download":"2018-10-30 20:18:30","date_modify":"2018-10-30 20:18:30","date_publish":"2015-12-17 13:23:22","description":"A third person has been arrested in connection with the September death of a woman shot in the face while driving near Turner Field.","filename":"data/vaneerConsumption/ThirdpersonarrestedinslayingofwomannearTurnerField.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/17/Images/photos.medleyphoto.8501039.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_third-perso_97f1056fe52952fb46866470482c9871__1540930710.html","title":"Third person arrested in slaying of woman near Turner Field","title_page":"Third person arrested in slaying of woman near Turner Field","title_rss":"NULL","source_domain":"ajc.com","text":"A third person has been arrested in connection with the September death of a woman shot in the face while driving near Turner Field.\nJamal Ward, 20, was arrested early Thursday at the Blue Ivory Lounge on Whitehall Street, Atlanta police spokesman Warren Pickard told The Atlanta Journal-Constitution.\nTiara Bogan, 25, was shot and killed shortly before 1 a.m. Sept. 26 near the intersection of Milton Avenue and Hank Aaron Drive in southeast Atlanta.\nOfficers found her overturned SUV in the roadway and multiple shell casings in the area. Police said the fatal shots were fired from a second vehicle.\nOn Nov. 6, the Atlanta police Fugitive Unit arrested Kelvin Watts, 26, and Bobby Hardy, 21, and charged them with murder, aggravated assault and aggravated battery.\nPickard said early Thursday, the Fugitive Unit got a tip that Ward was at the Blue Ivory, and contacted an investigator who was at the time working an extra job at the lounge.\nWard was taken into custody without incident and booked into the Fulton County Jail, charged with murder and aggravated assault with intent to murder.\nAccording to jail records, Ward was arrested in February on charges of aggravated assault with intent to rape, aggravated sodomy, aggravated child molestation, false imprisonment, possession of a firearm during the commission of a felony and statutory rape. He was released from jail in mid-August.","url":"https://www.ajc.com/news/crime--law/third-person-arrested-slaying-woman-near-turner-field/vqtoKVWJNbNT4S5IJyGkBJ/"}
