{"authors":[],"date_download":"2018-10-22 22:34:47","date_modify":"2018-10-22 22:34:47","date_publish":"2014-05-11 18:57:41","description":"The balloon crashed after an explosion Friday night.","filename":"data/vaneerConsumption/ThirdBodyFoundAfterHotAirBalloonAccident.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/434021/140510-balloon-recovery-mn-1210_5195779b83481b83951532853e911877.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_hot-air-balloon-accident_third-body-found-after-hot-air-balloon-accident-n102576_1540247687.html","title":"Third Body Found After Hot Air Balloon Accident","title_page":"Third Body Found After Hot Air Balloon Accident","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCrews searching for three victims of a hot air balloon explosion in Virginia found the last body Sunday morning, officials said.\nTwo victims' bodies were found in a heavily wooded area of Caroline County on Saturday. Recovery teams fanned out again at 6 a.m. Sunday to search for the last person missing.\nThe balloon hit a utility line and caught fire during a festival Friday night.\nOn Sunday, more than 100 personnel from multiple agencies scoured an area 3 miles long and a quarter-mile wide and discovered the third body at 11 a.m., said state police spokeswoman Corinne Geller.\nThe body was about 100 yards from where the second body was discovered Saturday afternoon, the statement said. The first and second bodies were about 1,500 yards apart, Geller said during a news conference on Saturday.\n\"Now that the male pilot and two female passengers have all been located, this concludes the large-scale search efforts of the operation,\" Sunday's statement said.\nThe state police and National Transportation Safety Board continued to search for the wreckage of the balloon and basket for investigative purposes, Geller said.\nThe University of Richmond confirmed Saturday that two \"beloved\" women's basketball team staffers, Ginny Doyle and Natalie Lewis were on the doomed balloon. The pilot, Daniel T. Kirk, was an experienced balloon operator with more than two decades of experience, his father told NBC News.\n— Elisha Fieldstadt","url":"https://www.nbcnews.com/storyline/hot-air-balloon-accident/third-body-found-after-hot-air-balloon-accident-n102576"}
