{"authors":["Virginia Hale"],"date_download":"2018-10-30 22:05:05","date_modify":"2018-10-30 22:05:05","date_publish":"2018-07-12 07:16:52","description":"Despite more deaths than births taking place in Europe last year, the continent’s population swelled by more than a million in 2017 thanks to immigration.","filename":"data/vaneerConsumption/ThirdWorldMigrationDrivesEUPopulationRiseto513Million.json","image_url":"https://media.breitbart.com/media/2016/09/GettyImages-605950484.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_12__1540937105.html","title":"Third World Migration Drives EU Population Rise to 513 Million","title_page":"Third World Migration Drives EU Population Rise to 513 Million | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Despite more deaths than births taking place in Europe last year, the continent’s population swelled by more than a million in 2017 thanks to immigration.\nEuropean Union (EU) figures estimated the number of people living within the bloc’s 28 member states rose from 511.5 million at the beginning of last year to 512.6 million as of January 1 2018, according to Eurostat.\n“During the year 2017, more deaths than births were recorded in the EU (5.3 million deaths and 5.1 million births), meaning that the natural change of the EU population was negative. The population change (positive, with 1.1 million more inhabitants) was therefore due to net migration,” the official statistics body said in a statement.\nWith a natural change in its population of +6.6 percent, Ireland “remained the Member State where births most outnumbered deaths”, Eurostat said.\nIrish Govt ‘Paid Press’ to Promote Plan to Grow Population by One Million With Mass Migration https://t.co/yKf7eUZIz1 — Breitbart London (@BreitbartLondon) February 24, 2018\nThe Celtic nation, which was congratulated by politicians including UK Prime Minister Theresa May earlier this year for voting to overturn pro-life laws earlier this year, saw a higher crude birth rate than any other EU nation in 2017, at 12.9 per 1,000 residents.\nSweden recorded the second highest rate (11.5), followed by Britain and France (both 11.4), while the lowest birth rates were registered in Italy (7.6), Greece (8.2), and Portugal and Spain (both 8.4).\nMalta experienced the biggest population increase relative to its size last year, according to the data, which recorded a 3.4 percent rise in the number of residents on the small island bringing the figure to 475,000 at the start of this year.\nBritain saw a population increase of 0.5 percent, where the number of residents surged by 378,000 as a result of migration, placing the nation sixth amongst the 19 EU nations which saw resident numbers rise.\nGermany: Nearly 40 Per Cent of Under Fives Now 'Migrant Background' https://t.co/uJ3dLvz9ao pic.twitter.com/oEfMyJVcMg — Breitbart London (@BreitbartLondon) September 21, 2016\nGreece, Croatia, Lithuania, Latvia, Italy, Hungary, Portugal, Romania, and Bulgaria all registered population declines according to the data, which was issued on Tuesday.\nA study published ahead of Wednesday’s World Population Day revealed that the majority of British voters believe the country is becoming too full, too fast, with three quarters of people surveyed believing the government should take action against the growth in numbers.\nCarried out by Population Matters, a charity advocating for a more environmentally sustainable population size, the research found that much of the public’s concern around the projected rate of UK growth related to its effect on public services such as healthcare.","url":"https://www.breitbart.com/europe/2018/07/12/migration-eu-population-rise-million/"}
