{"authors":[],"date_download":"2018-10-30 20:13:10","date_modify":"2018-10-30 20:13:10","date_publish":"2016-02-01 10:36:31","description":"A 6-year-old girl wasn’t initially reported as a victim in a fatal Sunday morning police chase and crash because she was completely ejected from the vehicle, authorities said.","filename":"data/vaneerConsumption/Thirdvictimfoundnearly12hoursafterdeadlypolicechase.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/02/01/Images/photos.medleyphoto.8640412.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_third-victi_4dccbf18253cbbc160671cda04768c6c__1540930390.html","title":"Third victim found nearly 12 hours after deadly police chase...","title_page":"Third victim found nearly 12 hours after deadly police chase...","title_rss":"NULL","source_domain":"ajc.com","text":"A 6-year-old girl wasn’t initially reported as a victim in a fatal Sunday morning police chase and crash because she was completely ejected from the vehicle, authorities said.\nAuthorities originally said only two people were killed in the crash, but the Georgia State Patrol confirmed Monday that Layla Partridge also died. She was found heavily covered with shrubbery near the crash allegedly triggered by a man fleeing College Park police.\nAn investigating trooper found out there was a third person in the vehicle after notifying the family about the deaths of Dorothy Smith Wright and Cameron Costner.\n“[Layla’s mother] asked about her daughter,” Lataucha Harris, a relative of the family, told Channel 2 Action News. “Originally, they didn’t know there was three people in the car. So they had to go back and look for her.”\nRelatives told Channel 2 Action News that police found Layla — nearly 12 hours after the deadly police chase and crash.\nWright, 75, and her two grandchildren, Layla and 12-year-old Cameron, were heading to First Peter AME Church at about 9:15 a.m. Sunday when they were blindsided by a man suspected of stealing a 2015 Chevrolet Suburban from the Westin hotel in College Park.\nPolice chased him from College Park to southwest Atlanta, The Atlanta Journal-Constitution previously reported. The high-speed chase ended on South Gordon Street and Rogers Avenue, when the 1995 Buick LeSabre that Wright was driving flipped over on impact.\nCollege Park police, who were pursuing the stolen vehicle before the chase, said they lost sight of the Suburban right before they came up on the crash.\nThe suspect, who ran away, may have sustained injuries, police said. He has not been detained.\nCollege Park police Chief Keith Meadows asked the Fulton District Attorney’s office to look into whether police followed the department’s chase policy.\nThis was the second time in four days innocent metro Atlantans were killed in a crash following a police chase.\nA Norcross couple was killed Thursday after their vehicle was hit by a suspect being pursued by Johns Creek police into Gwinnett County on Peachtree Parkway.\nKrzysztof Krawczynski, 77, and Elzbieta Gurtler-Krawczynska, 78, were returning home from a dinner celebrating Gurtler-Krawczynska’s 78th birthday when they were hit.\nA preliminary hearing for the father and son who are accused of hitting and killing the couple as they fled from police is scheduled for Thursday. Larry Thomas, a 47-year-old Tennessee resident, was charged with two counts of vehicular homicide, DUI and other driving and drug-related charges. His son, 18-year-old Jesse Thomas, faces several drug charges.\n—Staff writers Tyler Estep, Arielle Kass and Matt Kempner contributed to this article.","url":"https://www.ajc.com/news/crime--law/third-victim-found-nearly-hours-after-deadly-police-chase-and-crash/8liuw85355M3KOKYQyAoMI/"}
