{"authors":["Ali Waked"],"date_download":"2018-10-30 21:16:53","date_modify":"2018-10-30 21:16:53","date_publish":"2015-12-03 08:27:53","description":"Hamas is diverting t 30 percent of the electricity flowing into the Gaza Strip to power the Islamist group’s newly constructed terror tunnels","filename":"data/vaneerConsumption/ThirtyPercentofGazasElectricityDivertedToHamasTerrorTunnelsSource.json","image_url":"https://media.breitbart.com/media/2015/08/Gaza-Tunnel-Jack-Guez-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2015_12_03__1540934213.html","title":"Thirty Percent of Gaza's Electricity Diverted To Hamas Terror Tunnels: Source","title_page":"Thirty Percent of Gaza's Electricity Diverted To Hamas Terror Tunnels: Source","title_rss":"NULL","source_domain":"breitbart.com","text":"JAFFA, Israel – Hamas is diverting approximately 30 percent of the electricity flowing into the Gaza Strip in order to power the Islamist group’s newly constructed terror tunnels, a source in Gaza’s energy authority told Breitbart Jerusalem.\nHamas is siphoning electricity from the Israeli power lines that provide Gaza with about 60 percent of its electricity, as well as lines entering from Egypt and Gaza’s only power station, the source said.\nAccording to the source, Gaza’s electricity distribution company recently discovered that power was being diverted. An internal investigation revealed Hamas was using the electricity to power their tunnels.\nThe source believes the tunnels probably do not suffer from the power outages that Gaza residents experience on a regular basis, especially since 2006, when Israel destroyed a significant portion of the Strip’s local power plant.\nAsked to comment on the report, Ahmad Abu Eloumrarin, director of media relations for Gaza’s Energy and Electricity Authority, denied electricity was being diverted and told Breitbart Jerusalem that the report was not worthy of a response.\nIf the source’s claims are accurate, the amount of energy being diverted would suggest that an extensive tunnel infrastructure exists beneath the Gaza Strip.\nLast week, Breitbart Jerusalem reported Hamas is in the process of building a sophisticated network of tunnels beneath​ the Gaza Strip, according to multiple sources with knowledge of the ​issue.\nThe tunnel infrastructure mirrors ​the network built by Hezbollah in Lebanon. The Iran-sponsored militia is known to have ​dug a vast underground tunnel ​complex replete with war rooms, internal communication lines, ventilation systems, and even missile silos.\nIsrael ​destroyed​ a significant portion of Hamas’ previous tunnel system during Operation Protective Edge in the summer of 2014.\nOne source, a member of Hamas’ ​”​military wing,” ​​told Breitbart Jerusalem that following the operation, Hamas enlisted hundreds of ​terrorists ​in order to construct an even larger tunnel network.\nThe Hamas source claimed ​that the terrorist group has succeeded in restoring much of its former tunnel system.\nHe said the next stage involves linking tunnels in north Gaza with those under Gaza City and the south. The source conceded ​that this​ requires at least two more years of work.\nWhile Hamas’ ​claims ​could not be immediately corroborated, Jordanian and Israeli security sources said there is​evidence that Hamas is working tirelessly to build a new networks of tunnels.\nAsked for comment, a spokesperson for the Israel Defense Forces told Breitbart Jerusalem:\n“The IDF is aware of the fact that Hamas has been working to rebuild its sophisticated tunnel network within the Gaza Strip.\n“The IDF remains prepared and ready to defend Israel’s borders and its civilians, especially those living in close proximity to the Gaza Strip​,​ from any potential threat should it arise.”\nAbu Khaled, a spokesperson for Hamas’ so-called military wing, had no comment on the Breitbart Jerusalem report.\nTwo weeks ago, ​the former​ head of ​IDF Southern Command Maj. Gen. Sami Turgeman told a panel at Sapir College in Sderot -​ located less than a mile from the Gaza border -​ that Hamas is working hard to rebuild its tunnel system.\n“The IDF recognizes the threats and is preparing for many different scenarios. Hamas invested a lot of time and effort into building the tunnels, but the blow it sustained was immense, because we have created deterrence.”\n​​In July, IDF Col. Nochi Mandel, the deputy commander of the Gaza Division, told Israel Radio that Hamas was hard at work rehabilitating its military infrastructure. Mandel said:\n“According to what we know, Hamas is building its forces up again. It is training its forces and boosting the number of mortars that it manufactures. It continues to bolster its arsenal and dig more tunnels.”\n​ ​“We need to look at things realistically. Hamas is doing what it can to improve its readiness in case of renewed hostilities.”","url":"https://www.breitbart.com/middle-east/2015/12/03/source-thirty-percent-of-gazas-electricity-diverted-to-hamas-terror-tunnels/"}
