{"authors":["Merrit Kennedy"],"date_download":"2018-10-22 21:18:44","date_modify":"2018-10-22 21:18:44","date_publish":"2016-07-09 00:00:00","description":"Obama argues that America is \"not as divided as some have suggested,\" saying people of all backgrounds are outraged by attacks on police and about the deaths of Alton Sterling and Philando Castile.","filename":"data/vaneerConsumption/ThisIsNotHowWeWantOurCommunitiesToOperateObamaSaysAfterDeadlyWeek.json","image_url":"https://media.npr.org/assets/img/2016/07/09/gettyimages-545693510_wide-2b3d2c388039ce6c0c85c5e501a8718df4152698.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_07_09_485375390_this-is-not-how-we-want-our-communities-to-operate-obama-says-after-deadly-week_1540243124.html","title":"'This Is Not How We Want Our Communities To Operate,' Obama Says After Deadly Week","title_page":"'This Is Not How We Want Our Communities To Operate,' Obama Says After Deadly Week : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"'This Is Not How We Want Our Communities To Operate,' Obama Says After Deadly Week\nEnlarge this image toggle caption Mandel Ngan/AFP/Getty Images Mandel Ngan/AFP/Getty Images\nAfter a deadly week in the U.S., President Obama told reporters that \"that there's unity in recognizing this is not how we want our communities to operate.\" Two deadly police shooting of black men captured headlines, followed by an attack at a protest in Dallas that killed five policemen.\n\"This is not who we want to be as Americans,\" he said. And that recognition, Obama added, \"serves as the basis for us being able to move forward in a constructive and positive way.\" He argued that the U.S. is, in reality, \"not as divided as some have suggested,\" saying people of all races and backgrounds are outraged by attacks on police and about the deaths of Alton Sterling and Philando Castile.\nDescribing Dallas shooting suspect Micah Xavier Johnson as a \"demented individual,\" Obama said he \"is no more representative of African Americans than the shooter in Charleston was representative of white Americans, or the shooter in Orlando or San Bernardino were representative of Muslim Americans. They don't speak for us.\"\nHe wouldn't speculate on the motives of the shooter, but said: \"I think the danger ... is that we somehow suggest that an act of a troubled individual speaks to some larger political statement across the country. It doesn't.\"\nObama said the number of guns on the street is making the job of police officers more difficult and dangerous. \"Part of what's creating tensions between communities and police is that police have a really difficult time in communities where they know guns are everywhere,\" he said. \"If you care the safety of our police officers, then you can't set aside gun issue and pretend that that's irrelevant.\"\nAs we reported, the girlfriend of police shooting victim Philando Castile said he had a licensed firearm in the vehicle when police pulled them over for a broken taillight. She said the officer shot Castile in the arm multiple times when he reached to get his driver's license and registration.\nIn his comments to reporters, Obama indicated that he thought Castile's gun contributed to that shooting: \"In Minneapolis, we don't know yet what happened but we do know there was a gun in the car that apparently was licensed. But it caused, in some fashion, those tragic events.\"\nObama is in Poland to participate in a NATO summit, his last before the end of his presidential term. He is set to travel to Dallas later in the week.","url":"https://www.npr.org/sections/thetwo-way/2016/07/09/485375390/this-is-not-how-we-want-our-communities-to-operate-obama-says-after-deadly-week"}
