{"authors":["Jeanne Abrams","Jeanne Abrams Is A Professor At The University Libraries","Center For Judaic Studies At The University Of Denver","Author Of"],"date_download":"2018-10-21 03:29:37","date_modify":"2018-10-21 03:29:37","date_publish":"2018-07-03 10:01:01","description":"Women were the midwives of the Revolution.","filename":"data/vaneerConsumption/ThisFourthofJulyremembertheladies.json","image_url":"https://www.washingtonpost.com/resizer/CjSoGhv0psJUkyTyGOe92Wjr0Z4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/B5KN4QDBIYYZTNMYSB5GYUD6DY.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_made-by-history_wp_2018_07_03__1540092577.html","title":"This Fourth of July, remember the ladies","title_page":"This Fourth of July, remember the ladies - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Thirteen outwardly-oriented five-pointed stars arranged in a circle make up the so-called Betsy Ross flag, placed near the St. James United Church of Christ in Lovettsville, Va. (Astrid Riecken for The Washington Post)\nLooking back a quarter-century after the war had ended, in 1807, revolutionary leader and former U.S. president John Adams aptly observed, “Was not every Fireside, indeed a Theater of Politics?” He recognized what popular memory does not: Women were essential players in the American Revolution.\nBoth men and women had been equally incensed with what they perceived as England’s encroachment on liberty in the colonies and increasingly felt separation from the mother country was both desirable and inevitable. Figures like Adams’s wife, Abigail, became fervent “daughters of liberty,” making strong political statements by boycotting contested tea, protesting publicly, wearing homespun instead of buying British clothes, and supporting their husbands, sons and brothers as they marched off to war. These activities helped develop widespread public support for the cause and pave the way for independence. In the process, they made the home a powerful military asset.\nFrom the beginning, women were central to cultivating the fervor for independence. Many urged their male relatives to take direct action against Great Britain, including overt political resistance and even outright war.\nAbigail Adams feared the thought of violence. Faced with the prospect of increased restrictions on American liberties, she contended that Americans needed to remain firm in their resolution. “Altho the mind is shocked at the Thought of shedding Humane Blood, more Especially the Blood of our Countrymen, and a civil War is of all Wars, the most dreadfull,” she declared. “Such is the present Spirit that prevails, that if once they are made desperate Many, very Many of our Heroes will spend their lives in the cause, With the Speach of Cato in their Mouths, ‘What a pitty it is, that we can dye but once to save our Country.’”\nAmerican women were on the front lines of the boycotts before the battle actually began. Just weeks before the fateful 1773 Boston Tea Party, Abigail Adams had proclaimed, “The Tea that bainfull weed is arrived. Great and I hope Effectual opposition has been made to the landing of it.” She soon banned tea from the family table in solidarity with her fellow patriots, and through her letters, encouraged others to do the same. She wrote to fellow patriot Mercy Otis Warren that “the flame [of rebellion] is kindled and like Lightning it catches from Soul to Soul.”\nDuring the war, women became central to raising money for American soldiers. In Philadelphia, a group of women, including Benjamin Franklin’s daughter Sarah Franklin Bache, mounted a successful fundraising campaign on behalf of the Continental Army troops. Their efforts inspired other women in New Jersey, Maryland and Virginia to move into the public arena and turn their civic sentiment into tangible action. Indeed, Martha Washington, who was by then highly visible as the wife of General Washington, donated significant personal funds. She was designated to receive the financial collections and to help direct the money to address the material needs of soldiers.\nCrucially, women also took over the family affairs, so men could focus on the fraught political situation.\nWith John Adams in Philadelphia serving long, demanding stints as a pivotal member of the Continental Congress, Abigail remained alone in Massachusetts for as long as six months at a time. She ran the household in his absence, overseeing the family farm and their personal affairs. She conducted a small but thriving business of French imports that helped stabilize the family finances and supervised the education of the couple’s four young children. It was her work that allowed John to dedicate his attention to political issues full time, without prospects of a regular income.\nMore than that, she also served as John’s most trusted confidante and adviser, and he regularly shared his thoughts and concerns with her via the mail. Once the war ignited, Abigail often faced the challenges of financial and health hardships, including a serious dysentery epidemic that devastated her neighborhood and spread through Abigail’s own household and resulted in the loss of her beloved mother and a female servant. She also endured the heartbreak of giving birth to a stillborn baby girl without John by her side.\nShe did all of this while also being on the front lines of battle itself. Abigail and her eldest son, future president John Quincy Adams, watched the memorable and terrifying Battle of Bunker Hill from a position near their home. In July 1776, it was Abigail, not John, who witnessed a momentous public reading of the Declaration of Independence at the Massachusetts State House in Boston. Two years later, she played an active political role when the Massachusetts Colony General Court in Cambridge appointed her to a committee to question local women who were alleged Loyalists to gauge their ideological leanings. That Abigail was named to the committee reflected her growing prominence and the respect she was accorded for her unwavering revolutionary commitment.\nAs the war raged on, so too did the sacrifices of many American women. When John Adams was dispatched across the Atlantic Ocean as a U.S. emissary to help develop French support, Abigail once again resumed her role as head of the family as she faced a multiyear separation from her husband. Despite her unhappiness and anxiety, she told John, “though I have been called to sacrifice to my country, I can glory in my sacrifice and derive pleasure from my intimate connexion with one [John], who is esteemed worthy of the important trust devolved on him.”\nDespite the circumscribed roles for women at the time, the upheavals of their day made women as well as men avid followers of political events, and they too believed they had a significant stake in the future of their country. And their contemporaries recognized their importance. In a letter to the Boston patriot James Warren, John Adams wrote, “I have ever ascribed to those Ladies, a Share and no small one neither, in the Conduct of our American Affairs.”\nAbigail used her wartime contributions to push John and his fellow politicians in the Continental Congress to “remember the ladies” when they composed a new “Code of Laws.” John deflected Abigail’s request with only a humorous response, but the role women played in the Revolution nonetheless opened the door for consideration of the subject, albeit still far in the future.\nAs we mark the signing of the Declaration of Independence this July 4, Abigail Adams’s felicitous choice of words should also inspire us today to appreciate the diverse ways in which American women contributed to the founding and development of our nation.","url":"https://www.washingtonpost.com/news/made-by-history/wp/2018/07/03/this-july-4th-remember-the-ladies/"}
