{"authors":["Lisa Newlin"],"date_download":"2018-10-30 23:00:30","date_modify":"2018-10-30 23:00:30","date_publish":"2014-08-14 14:32:12","description":"The '90s were great for so many reasons. You could go anywhere covered in flannel and be perfectly fashionable. Doc Martens were incredibly comfortable as long as you had the time to tie all of those laces. You always had a way to pull your hair…","filename":"data/vaneerConsumption/ThisIsYourBrainonDrugsThe11Funniest90sPSAsYouShouldJustSayYesToReliving.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/6/5/5121df32-4d00-4dab-9a1b-74f8dac147e8-getty-103646931.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34274-this-is-your-brain-on-drugs-the-11-funniest-90s-psas-you-should-just-say-yes_1540940430.html","title":"This Is Your Brain on Drugs: The 11 Funniest '90s PSAs You Should Just Say Yes To Reliving","title_page":"This Is Your Brain on Drugs: The 11 Funniest '90s PSAs You Should Just Say Yes To Reliving","title_rss":"NULL","source_domain":"bustle.com","text":"The '90s were great for so many reasons. You could go anywhere covered in flannel and be perfectly fashionable. Doc Martens were incredibly comfortable as long as you had the time to tie all of those laces. You always had a way to pull your hair back because your wrist always had at least one scunchie around it. It was the era of grunge music on the radio, light-up sneakers . . . and public service announcements on TV.\nYet another great reason to love the '90s, these amazing PSAs were on during almost every television break. It was before the era of DVR, so you had no choice but to actually suffer through them. Were they over-dramatic? Yes. Borderline ridiculous? Of course. Poorly scripted? Obviously.\nYet when you think about television in the '90s, you can’t help but remember these cautionary commercials telling us to say no to drugs, forest fires, and bullies. I’m not sure if any of these PSAs were successful at anything other than giving us something to mock while we waited for Alf to come back from commercial break, but they certainly do deserve to be remembered. Mostly so we can laugh at them all over again.\nHere are the 11 funniest PSAs from the '90s. Just say yes.\nStraight Up\nj peoplemover on YouTube\nThis delightful rap looks like it came from the '80s, not the '90s. Guys in stone-washed denim and shiny red jackets rapped about how you could spot anyone involved with drugs because they were drenched in gold. They also taught us the important lesson that every drug deal will end in arrest. The point of this PSA is clear: If you ever touch drugs, you will go to prison.\nMcGruff The Crime Dog\nwtcvidman on YouTube\nEveryone loved this cuddly dog in a trench coat. At first glance, he looks more like he would be the spokesperson for anti-flashing, but instead, McGruff tells us to take a bite out of crime. I hope it tastes like chicken.\nThe Girl Who Melts Into The Couch\nYouTube\nThis one was just horrifying. According to this commercial, smoking pot will render you unable to speak and literally deflated on the couch.\nThe Crash Test Dummies\nYouTube\nNo, not the band. These guys are involved in a different accident each commercial in order to remind us to buckle up. Miraculously, they always recovered by the next commercial, which kind of sent a mixed message.\nThis Is Your Brain On Drugs\npushthefire on YouTube\nIt's not so much someone's brain on drugs as it is the beginning of an omelet. This infamous commercial is supposed to remind us that we should stay away from drugs, and that breakfast is delicious.\nSmokey Bear\nSmokey Bear on YouTube\nHe's been telling us for years that only we can prevent forest fires, but it's hard to take advice from a bear who wears jeans . . . but no shirt. Smokey may be smoking something of his own if he can't remember to get dressed before shooting a commercial. Maybe that's why he's so paranoid about forest fires.\nPee-Wee Herman: The Thrill Can Kill\nTheMegaDudethatsawes on YouTube\nPee-Wee tries to tell us that crack can kill, but it's hard to take serious advice from a man who lives in a playhouse.\nThe More You Know\nK4Kimber on YouTube\nWe all remember these commercials because so many celebrities did them, but also because that star and rainbow at the end was really cool.\nCartoon All-Stars To The Rescue\nYouTube\nEveryone loved this PSA because it had so many of our favorite characters. From Bugs Bunny to the Teenage Mutant Ninja Turtles, the message about staying away from drugs was clear. What was less than clear was if the cartoonists were under the influence of drugs when they animated that cloud of smoke.\nTeenage Mutant Ninja Turtles: I'm not chicken. You're a turkey.\nCoolOldVideos on YouTube\nOnce again, our reptilian turtle friends came to us with another life lesson about just saying no. I suppose they're qualified to talk about chemical substances considering that's what made them who they are.\n'Saved By The Bell': Would I use dope? Nope.\nYouTube\nSaved By The Bell was clearly one of the best shows of the '90s. Many people won't admit it, but those people are liars. This show was gold, as is this PSA.\nImages: YouTube(11)","url":"https://www.bustle.com/articles/34274-this-is-your-brain-on-drugs-the-11-funniest-90s-psas-you-should-just-say-yes"}
