{"authors":["Caitlin Cruz"],"date_download":"2018-10-31 01:46:07","date_modify":"2018-10-31 01:46:07","date_publish":"2018-08-27 19:27:46","description":"Don't forget to grab your tissues. There's a new Serena Williams ad from Nike for the U.S. Open, and it will bring you to tears and also remind you why she's the GOAT.\nWilliams first match is Monday evening at Arthur Ashe Stadium, and the…","filename":"data/vaneerConsumption/ThisSerenaWilliamsNikeAdWillMakeYouEmotionalForHerUSOpenReturn.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/7c9c5108-8116-432b-9854-3190a4f9e42c-getty-1024056558.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_this-serena-williams-nike-ad-will-make-you-emotional-for-her-us-open-return-10252576_1540950367.html","title":"This Serena Williams Nike Ad Will Make You Emotional For Her US Open Return","title_page":"This Serena Williams Nike Ad Will Make You Emotional For Her US Open Return","title_rss":"NULL","source_domain":"bustle.com","text":"Don't forget to grab your tissues. There's a new Serena Williams ad from Nike for the U.S. Open, and it will bring you to tears and also remind you why she's the GOAT.\nWilliams first match is Monday evening at Arthur Ashe Stadium, and the minute-long ad welcomes her back to the open. The ad uses footage of Williams training as a child alongside her many appearances at the U.S. Open throughout her career. Her father and coach Richard Williams makes a brief appearance on camera, and then narrates the video throughout, according to Sports Illustrated. (The ad's other sounds are Serena grunting and shouting while making incredible backhands and serves.)\n\"This is you at the U.S. Open. This is you,\" Richard Williams says as the ad begins, showing footage of Williams as a young girl. \"Good serve motion,\" he says.\nThen the ad cuts to modern-day footage of Williams at the U.S. Open — likely the 2008 final against Jelena Jankovic. The victory was Williams's third U.S. Open title, according to The New York Times.\n\"Keep that perfect serve motion you have,\" her father's voice continues. \"Right there, good.\"\nAs he encourages young Williams, the ad shows footage from the 2008 U.S. Open final, the 1999 U.S. Open final, the 2012 U.S. Open final, and the 2011 U.S. Open final. In a clip from the 2011 final, Williams returns the ball to Samantha Stosur, and then stops herself by sliding into the splits.\nNike on YouTube\n\"Good follow through,\" her father says as footage from nearly a dozen U.S. Opens flash across the screen. \"Make sure you’re controlling that back on every shot.\"\nThe ad ends on a black screen with the words: \"It’s only crazy until you do it. Just do it.\"\nIt is a Nike ad, after all.\nThis will be Williams's first U.S. Open since giving birth to her daughter, Alexis Olympia Ohanian Jr., in 2017. Her appearance has been highly anticipated. In an ad for Chase, Williams borrows lines from LL Cool J's hit song \"Mama Said Knock You Out\" to show she's stronger than ever in just 60 seconds.\n\"Don't call it a comeback, I've been here for years, Rocking my peers, Puttin' suckers in fear,\" Williams says in the ad as she puts her daughter to sleep and makes her way to the tennis court on an eery Florida day.\n\"Makin' the tears rain down like a monsoon. Explosions, overpowerin', over the competition, I'm towerin', Listen to the bass go boom,\" Serena recites as she walks through the halls of the house.\nBy the time Williams get to the court, and yellow tennis balls are sent her way, her voiceover gives you chills. \"Don't ever compare me to the rest. That'll all get sliced and diced. I'm gonna knock you out,\" she says.\nThen she looks straight into the camera: \"Mama said knock you out.\"\nThe ad was shared with the hashtag #ThisMama, and Williams asked mothers to share their stories of motherhood struggle with her.\nWilliams's first match of the tournament is Monday night. Let's see what this bonafide tennis star and new mama can do.","url":"https://www.bustle.com/p/this-serena-williams-nike-ad-will-make-you-emotional-for-her-us-open-return-10252576"}
