{"authors":["Mia Mercado"],"date_download":"2018-10-31 01:50:26","date_modify":"2018-10-31 01:50:26","date_publish":"2018-09-06 13:22:27","description":"Is it dramatic to say that cold brew is the sole lifeblood which keeps us all moving in these hot, hot summer months? Perhaps, but dramatic doesn’t necessarily mean “wrong,” so let’s continue. Because we live in a timeline that is sometimes good and…","filename":"data/vaneerConsumption/ThisColdBrewSubscriptionServiceWantsToSendPersonalizedPackagesToYourDoor.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/5/3876f3ca-5800-4172-957c-0cc3e09c1dd2-cans_coffee_beans_r1_v2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_this-cold-brew-subscription-service-wants-to-send-personalized-packages-to-your-door-11766530_1540950626.html","title":"This Cold Brew Subscription Service Wants To Send Personalized Packages To Your Door","title_page":"This Cold Brew Subscription Service Wants To Send Personalized Packages To Your Door","title_rss":"NULL","source_domain":"bustle.com","text":"Is it dramatic to say that cold brew is the sole lifeblood which keeps us all moving in these hot, hot summer months? Perhaps, but dramatic doesn’t necessarily mean “wrong,” so let’s continue. Because we live in a timeline that is sometimes good and nice, there is a Kickstarter for a new cold brew subscription company that wants to deliver everyone’s favorite coffee beverage right to your doorstep. Yes, a cold brew delivery service could be in your future should you choose to back its Kickstarter page. Are you going to support it or are you going to disappoint your future self?\nLaunching Thursday, September 6, the Canary Cold Brew Kickstarter is the self-described “Warby Parker of Cold Brew.” Essentially, Canary Cold Brew wants to make sure no one goes under-caffeinated by providing services like personalized cold brew subscription packages which will be delivered directly to consumers’ homes. Truly a dream come true for anyone who has ever tasted cold brew.\nCanary Cold Brew’s initial financial goal is currently set at $10,000. With that money, the company hopes to launch an online delivery service in which coffee drinkers can have fresh, affordable, and high-quality cold brew brought directly to their doorstep. Why a cold brew delivery service you ask? Well, why not? “We can buy a mattress online,” the campaign's Kickstarter page states. “Why are we still drinking cold brew the old way?”\nOne of the most excited components of the company is its personalized subscription services. In an email to Bustle, Canary Cold Brew explained a few of the potential perks of the services. For example, customers would be able to mix and match cold brew blends in their boxes. (“You’ve got your go-to for mornings, but you’d like to try a new release, too - no problem!”). You could also pause your subscription services or decide to subscribe during certain seasons (“Maybe you’re a “summer-only” cold brew drinker”). That way, you don’t have bunches of untouched cold brew piling up on your doorstep or in your fridge.\nThey’re also hoping to offer customers the ability to alter the quantity and timing of their shipment, “if you’ve drunk more or less than you thought.” That’s extra good news for anyone who can’t help but sip on coffee if it’s within their reach.\nCanary Cold Brew is also discussing incorporating “warm weather alerts” for customers. “Imagine getting an email alert the week before the first 70 degree day in your city or town so your fridge is ready for cold brew season,” their email states. Sorry, other alerts, but warm weather/coffee alert has just asserted itself as the number one best kind of alert.\n“For the launch and beyond, we’ll be producing our coffee in small batches so that we can constantly tailor our product to our customers’ needs,” Canary Cold Brew writes in their email. Quality, convenience, and affordability are all high priority for the brand. As their Kickstarter page states, they’ll be sourcing organic, fair trade coffee beans, roasting them “to perfection,” and selling them to you for way less than the average $4-a-cup cold brew you’re used to.\nBasically, if you’re a regular cold brew drinker who’s looking to save some money and time, Canary Cold Brew is for you. Some recent surveys show the average woman spends over $2,300 a year on coffee. While they’ve yet to list any price points for subscription services, Canary Cold Brew says they’re hoping to bring that number down to a more manageable number.\nIn true Kickstarter fashion, if you back the campaign, each dollar donation level comes with plenty of perks, which are mostly a bunch of complimentary cans of cold brew coffee. You can also enter to win three months of free cold brew by signing up with your email address on Canary Cold Brew’s website. We can all raise an overly-caffeinated glass to that.","url":"https://www.bustle.com/p/this-cold-brew-subscription-service-wants-to-send-personalized-packages-to-your-door-11766530"}
