{"authors":["Sara Altschule"],"date_download":"2018-10-31 01:51:49","date_modify":"2018-10-31 01:51:49","date_publish":"2018-09-11 13:00:52","description":"In Bustle's Braving BRCA column, writer Sara Altschule shares how her life has changed after her BRCA positive diagnosis as she prepares for a prophylactic double mastectomy.\nGetting back to \"everyday\" life after finding out I’m living with a high…","filename":"data/vaneerConsumption/ThisIsHowMyEverydayLifeHasChangedSinceMyBRCADiagnosis.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/21/07929e2d-60fd-4cfe-80fb-cfd20758506b-img_2040.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_this-is-how-my-everyday-life-has-changed-since-my-brca-diagnosis-10164175_1540950709.html","title":"This Is How My Everyday Life Has Changed Since My BRCA Diagnosis","title_page":"This Is How My Everyday Life Has Changed Since My BRCA Diagnosis","title_rss":"NULL","source_domain":"bustle.com","text":"In Bustle's Braving BRCA column, writer Sara Altschule shares how her life has changed after her BRCA positive diagnosis as she prepares for a prophylactic double mastectomy.\nGetting back to \"everyday\" life after finding out I’m living with a high risk of developing breast cancer has had its ups and downs. It's still \"normal\" in some sense — I go to work every day, I still online shop like it's nobody's business, and I have all of my regular bills to pay. But knowing that I’ll be undergoing a prophylactic double mastectomy in a few short weeks adds enormously to my anxiety levels. Being able to balance my actual life and my BRCA life has been tricky to manage, but I've tried to make some changes to get myself mentally and physically prepared for my upcoming surgery.\nOnce the dust settled after I received my BRCA positive diagnosis five months ago, I found my surgical team and picked a date for the surgery. Honestly, I thought at 31 years old, I’d be picking a wedding date instead of a double mastectomy date, but I guess you just have to roll with what life hands you. After making my decision and having a plan, a lot of my anxiety subsided. I could finally see a light at the end of the tunnel, when this gene will no longer be hanging over my head (or my boobs).\nAt the same time, though, my life right now feels like I’m stuck between a rock and a hard place. I want the surgery to be over and done with so I can stop obsessively thinking about it, but I’m also not mentally ready for it to come yet. I don’t even know how “mentally ready” a person can actually be before a surgery like this, but I sure want to try everything I can. I wish I could say that I’m Positive Polly all of the time, but it takes work to get to that place. I have to allow myself to feel the uncomfortable feelings to get to the happier thoughts. I’ve cried, vented, and let out my frustrations and fears with the help of my support system, my amazing therapist, and a lot of exercise.\nCourtesy of Sara Altschule\nUp until two months ago, I felt more or less OK, but when I started having a hard time falling asleep and I kept waking up with a huge pit in my stomach, I knew it was time to make some changes. I deemed this my \"getting ready for surgery\" time: I want to feel strong going into surgery so I can kick my recovery’s butt.\nMy therapist suggested I get a journal and write down three things I'm grateful for every day to stay focused. I made a checklist of things I wanted to accomplish every day — drinking more water, taking my multivitamins, doing exercises to make my core stronger, and getting enough sleep. I make sure to work out and run about five times a week. I’ve heard building up your core and legs is important, as I’ll be relying on them while my upper body recovers from surgery. I try to eat clean, and I focus on upping my protein, which is helpful to aid in recovery. In my not-so-normal situation, these little things give me a sense of normalcy and also allow me to have some control back in my life.\nCourtesy of Sara Altschule\nOne thing I can’t fix is what I like to call BRCA brain — aka, my brain is stressed out and I can't remember anything even when I try. It’s like I’m living in a fog and everything seems jumbled in my head. But on the upside, if I forget to do something, I can just blame my BRCA brain and people understand. Now, the only thing I need to figure out is how to get enough sleep with all of my nervous thoughts. But one step at a time.\nDespite the balance I try to achieve with my physical health, I can't help but obsess over everything leading up to surgery. I’m an over-obsess-about-everything type of gal, so true to fashion, I am having a hard time not thinking about my upcoming surgery. I Google everything that can possibly go wrong, and search for stories where everything went right. And I want to see every breast reconstruction photo out there — I want to know that at the end of this I’ll still feel good about myself and my body.\nIn order to give myself a mental vacation from having to think about surgery, I try to distract myself with fun things to look forward to. Having something exciting on the calendar has been a huge help in passing the time. I make plans with my girlfriends, I’ve gone on some weekend trips, and I try to stay present when I am out and about. And of course, I couldn't do it without my friends. Good and true friends show up — not just for the fun parts, but also for the real hard life moments.\nTo be very honest, some days are hard, and some days are easy. Sometimes I go for a run with my \"Braving BRCA\" playlist and I think I’m a strong woman and I can overcome this. And some days, I just want to crawl into bed and hide from the world. I’ve found if I’m honest with myself and say, “I’m agitated today” or, “I’m scared,” then I find myself on the other side of it eventually. I need to work through my bad days to get to the good ones.\nCourtesy of Sara Altschule\nGoing through this experience has been completely and utterly life changing. I’m not at the finish line yet, but I’ve already learned so many life lessons. And I know it’s cheesy, but I do believe with all of my heart that what challenges us, makes us stronger. And I can’t wait to be one strong woman after all of this is done.\nRead more from Bustle's 'Braving BRCA' series:\nI Did A Random DNA Test To Learn About My Ancestry. Then I Found Out I Was BRCA Positive\nI Found Out I Was BRCA Positive. Then, Naturally, I Googled It\nThis Is How I Told People About My BRCA Diagnosis — And How They Responded","url":"https://www.bustle.com/p/this-is-how-my-everyday-life-has-changed-since-my-brca-diagnosis-10164175"}
