{"authors":["Will Martin"],"date_download":"2018-10-30 23:52:26","date_modify":"2018-10-30 23:52:26","date_publish":"2016-12-05 00:00:00","description":"2016 has been a year of immense upheaval and change in Western politics.","filename":"data/vaneerConsumption/Thispicturesumsupthepoliticalchaosof2016perfectly.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_cameron-obama-merkel-hollande-renzi-picture-politics-2016-12_1540943546.html","title":"This picture sums up the political chaos of 2016 perfectly","title_page":"    Cameron, Obama, Merkel, Hollande, Renzi picture: Politics in 2016 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"White House/Public Domain\n2016 has been a crazy year.\nNowhere is this more true than in the massive political upheaval we have seen in countries around the world but particularly here in the West.\nThe picture above was taken by Pete Souza, the official White House photographer, during a trip to Hanover, Germany, on April 25, seven months and one week ago. It pretty much sums up how mad 2016 has been for politics.\nIt depicts David Cameron, Barack Obama, Angela Merkel, Francois Hollande, and Matteo Renzi — the leaders of the UK, the US, Germany, France, and Italy.\nOnly one politician is still standing, just over half a year after this picture was taken:\nDavid Cameron— Prime Minister Cameron resigned after a humiliating defeat in Britain's Brexit referendum. He staked his career on the vote, and when Brits voted 51.8% to 48.2% to leave the European Union, he was forced to stand down. He has since been replaced by Theresa May, the former home secretary.\nBarack Obama— Obama is about to the reach the end of his second term as president. He will leave the White House after eight years as commander in chief, replaced by Republican Donald Trump, whose rise from upstart protest candidate to president-elect is one of the biggest political shocks in modern history.\nAngela Merkel— Germany's chancellor, and the de facto leader of the eurozone, is still standing. She has been Germany's top politician for more than 11 years, and she does not plan on going anywhere, announcing in November that she intended to stand for a fourth term as chancellor in next year's election.\nFrancois Hollande— Hollande is still the French president, but he won't be for long. With approval ratings from the French people of less than 10%, Hollande announced at the end of November that he would not seek another term. Next year's presidential race looks as if it will pit Republican candidate Francois Fillon against the populist, far-right candidate Marine le Pen of the National Front.\nMatteo Renzi— The latest casualty, Renzi resigned Sunday after a crushing defeat in the constitutional referendum on which he staked his political career. Renzi was Italy's prime minister for more than 2 1/2 years (a long time in Italian politics), and his exit could spark a fresh crisis in the country, where the populist Five Star Movement is on the charge.","url":"https://www.businessinsider.com/cameron-obama-merkel-hollande-renzi-picture-politics-2016-12"}
