{"authors":["Sebastian Shakespeare For The Daily Mail"],"date_download":"2018-10-22 20:35:12","date_modify":"2018-10-22 20:35:12","date_publish":"2016-01-28 01:57:59","description":"The Former Top Gear is used to life in the fast lane, so no wonder he seems so at home in a Mayfair club surrounded by an adoring harem of posh admirers, writes SEBASTIAN SHAKESPEARE.","filename":"data/vaneerConsumption/ThiscrowdstooracyevenforJeremyClarksonwritesSEBASTIANSHAKESPEARE.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30A119B300000578-0-image-a-11_1453946233640.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420280_SEBASTIAN-SHAKESPEARE-crowd-s-racy-Clarkson_1540240512.html","title":"This crowd's too racy even for Jeremy Clarkson, writes SEBASTIAN SHAKESPEARE","title_page":"This crowd's too racy even for Jeremy Clarkson, writes SEBASTIAN SHAKESPEARE | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former Top Gear host Jeremy Clarkson is used to life in the fast lane, so no wonder he seems so at home in a louche Mayfair basement club surrounded by an adoring harem of posh admirers.\nThe 55-year-old was spotted on Tuesday night getting cosy with socialite Emma Pilkington, reality TV star Sophie Stanbury, ex-model Gabriela Peacock, stylist Juliet Angus and underwear entrepreneur Lily Fortescue.\nFortescue, 26, who is just six years older than the ex-BBC presenter’s daughter Emily, published the image online with the caption: ‘How many is too many, Jeremy Clarkson?’ Maybe she’d be better off asking his estranged wife Frances, who is understood to be divorcing the alcohol-loving rotter.\nScroll down for video\nJeremy Clarkson was pictured in Mayfair with (left to right) getting cosy with socialite Emma Pilkington, reality TV star Sophie Stanbury, ex-model Gabriela Peacock, stylist Juliet Angus and entrepreneur Lily Fortescue\nPick of the parties\nOCCASION: Costa Book Of The Year Award at Quaglino’s in St James’s, London.\nGUESTS: TV presenter Penny Smith (host), author Joanna Trollope, singer Tony Hadley and actress Rebecca Front and Anneka RIce.\nMOST EAGER: Actress Maureen Lipman informed me she was one of the first through the door. ‘I’m here because I write a bit, but also for the free drink.’\nUNEXPECTED STAGEFRIGHT: Despite performing for a living, Call The Midwife star Jenny Agutter felt out of her depth amid the well-read crowd. ‘There are so many wonderful literary people here, it makes me nervous.’\nBEHIND THE TIMES: Actress Natascha McElhone revealed she’s a very slow reader. ‘I’m still on H Is For Hawk, from last year’s list — it’s pitiful!’\nTHE OUTSIDER: A Village Affair author Joanna Trollope stayed true to her craft by observing from the sidelines. Hovering on the mezzanine, she confessed: ‘It looks far too hot down there, and I hate being too hot.’\nChatting at the Costa Book awards, hosted by TV presenter Penny Smith, right, actress Natascha McElhone (left) revealed she’s a very slow reader and is still on last year's winner\nActress Maureen Lipman, pictured with Anneka Rice, informed me she was one of the first through the door\nAMONG the ranks of the Dad’s Army cast at its London premiere on Tuesday, one member was conspicuous by her absence.\nJulia Foster, 72-year-old mother of TV adventurer Ben Fogle, has a role as a ‘mad spinster’ in the film, making her showbusiness comeback.\nSadly former Doctor In The House star Julia was taken ill and had to be admitted to hospital.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420280/SEBASTIAN-SHAKESPEARE-crowd-s-racy-Clarkson.html"}
