{"authors":[],"date_download":"2018-10-30 14:30:30","date_modify":"2018-10-30 14:30:30","date_publish":"2017-03-03 21:56:00","description":"Nearly every state in America has a specialty dish, so what is it for Georgia? Drumroll, please!","filename":"data/vaneerConsumption/ThisisthemostpopularfoodinGeorgia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/26/Images/newsEngin.17725455_31217-Go-Georgia-Dining_Editorial-food-jazzd-A-1-RZE4WKmIVaG1nCJRmI5V52O-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_food--cooking_this-the-most-popular-food-georgia__1540909830.html","title":"This is the most popular food in Georgia","title_page":"This is the most popular food in Georgia","title_rss":"NULL","source_domain":"ajc.com","text":"Nearly every state in America has a specialty dish, so what is it for Georgia? Drumroll, please! It’s chicken wings, according to Pinterest data.\n»RELATED: 6 spots to get your wing fix in Atlanta\nThe site collected data from its millions of users to dig for the top searched foods in every state. With its findings, it created “The Foodnited States” index, which lists dozens of recipes for treats including cake pops, empanadas and sloppy joes.\nApparently, Georgians can’t get enough of wings, because it’s the most popular cuisine for the state.\nOthers had some really interesting selections. For example, Florida’s top pick was cake toppers and Wisconsin’s was puppy chow.\nA few places had more traditional eats like Tennessee, which listed corn bread for its No. 1 choice, and Delaware, which listed crab cakes for its first place winner.\nThen there were some states that completed ditched food altogether for a nice drink. New Jerseyans love sangria, while folks from New Hampshire enjoy martinis.\nCurious about the other states? Check out the map below.\n»RELATED: These are some of the most pinned salad recipes on Pinterest","url":"https://www.ajc.com/lifestyles/food--cooking/this-the-most-popular-food-georgia/c6qWBssckho4htUEmSR5zJ/"}
