{"authors":["Lucy Waterlow For Mailonline"],"date_download":"2018-10-23 00:02:37","date_modify":"2018-10-23 00:02:37","date_publish":"2016-01-29 12:41:22","description":"Clive Symonds, 27, from Kent, Jack Davis, 26 from Hereford and Ant Smith, 49 from East London admitted they have grown up feeling inadequate over their 'micropenises'.","filename":"data/vaneerConsumption/ThisMorningfindoutwhatlifeisreallylikewithamicropenis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B247F800000578-0-image-a-21_1454071210968.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422590_Three-brave-men-tell-Morning-life-really-like-micropenis-Eamonn-looks-worried-Ruth-gets-tape-measure_1540252957.html","title":"This Morning find out what life is really like with a micropenis","title_page":"This Morning find out what life is really like with a micropenis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's a taboo subject and not one usually discussed on daytime telly, but today three men appeared on This Morning to talk about their insecurities over their penis size.\nThe three volunteers - Clive Symonds, 27, from Kent, Jack Davis, 26 from Hereford and Ant Smith, 49, from East London - admitted they have grown up feeling inadequate over their 'micropenises'.\nThe term is used to describe a manhood that is two inches when erect and well below the national average of 5.2 inches.\nScroll down for video\nFrom left, Jack Davis, 26 from Hereford, Clive Symonds, 27, from Kent, and Ant Smith, 49 from East London, appeared on today's This Morning to discuss their penis size\nRuth Langsford used a tape measure to the bemusement of her husband Eamonn Holmes to illustrate the penis size when erect of the three guests\nWith the help of a tape measure, presenter Ruth Langsford - who was fronting the show with husband Eamonn Holmes - revealed the men are all in fact over the 'micro' mark with Ant's measuring nearly four inches and Clive and Jack's three inches.\nBut the three men confessed being on the smaller end of the scale made them feel inferior and the butt of friends' jokes when they were teenagers.\nSingle Jack, who works as a granite technician, said he realised he was smaller than other men when he was 18 and used communal changing rooms after playing sport.\nHe said: 'In the changing rooms at football all the lads started laughing and taking the mic, nothing too horrible but banter between lads. I started thinking \"am I smaller than everyone else?\"'\nThe three men were able to laugh about the sensitive subject after revealing being smaller than average has never been a problem for them in the bedroom\nRuth used a tape measure to show how the three men compare to the national average\nHe said the new research revealing the average size confirms his fears but he doesn't have an issue with it.\nHe said: 'I have never had a problem and no girls have said anything. I never had complaints in the bedroom. I am used to it now and get on with it.'\nLabourer Clive agreed that his smaller than average size has never hindered him.\nHe said: 'I don't see it as a handicap, it works perfectly fine for me.'\nLike Jack, he said he was mocked for his size at school but he never let it get to him and he is now in a happy relationship with girlfriend, Georgia, 24.\nHe said: 'At school I didn't get bullied as such but there was banter and you have to deal with it.\n'I let it go over my head, I am quite a bubbly person so had a laugh and tried not to let it get me down.'\nRuth shows the three inch size of Jack and Clive, left, compared to the 5.2 inch average, right\nHe advised other men concerned about their size to 'ignore what people say and don't let it get you down'. He said they should also realise that 'a lot of men lie' about their vital statistics.\nThis is something Ant said he has come to accept after decades of feeling inadequate.\nHe said he was heartened by the research revealing the average size is 5.2 inches as he always believed the majority of men were six inches and over.\n'If I had a more accurate vision of how men stack up I would have saved myself years of shame,' he said. 'By talking about it I want to validate it as things you see on the internet are fantasy.'\nAnt said he first felt insecure about his size as a teenager when he was already struggling to be adept in the bedroom.\n'When I was 18, I didn't know what I was doing it was and one more worry to make life impossible,' he admitted.\nClive said he was teased a little at school but said he has never seen his penis size 'as a handicap'\nAnt admitted his size bothered him for decades but now he realises he shouldn't compare himself to images on the internet which are 'fantasy'\nJack said he first realised he was smaller than average when he used to change after football and his teammates would laugh at him\nLike the other two men, he said he had been teased at school and his body image issues contributed to him remaining a virgin until he was 21.\nEven after he married his wife Christine, 46, he said he continued to worry about his size, even though she never mentioned it.\nHe said it was only recently after 16 years of marriage that he opened up to her about his fears.\nHe said: 'She was surprised I was concerned, she never thought there was a problem and it has never been a problem for her. It made me think maybe there isn't a problem.'\nIt is for this reason that he decided to talk about his experience on national television, so other men who may be worrying like he used to feel less alone.\nHe said men should be proud whatever their size.\nThe three men were praised on Twitter for being brave enough to discuss the matter on TV\nChloe was one of the This Morning viewers amused by the segment asking does size matter?\nMiss.understood tweeted to say she was entertained by how Eamonn Holmes coped presenting\nNijoco tweeted to say she was 'proud' of the three 'lovely men' for opening up about the subject\nVicki tweeted to say 'what brave men!' after watching the discussion\nJo agreed that the three men were brave to discuss the issue adding 'hats off to them'\n'There are eight billion of us on the planet and if we were all the same it would be boring, love your individuality,' he advised.\nThe segment certainly got viewers talking with many taking to social media to comment on the discussion, query why #doessizematter? was trending, and to offer their support to the three men.\nChloe Newlove Tweeted '@itvthismorning just casually measuring penis size when erect... got to love morning TV #doessizematter'.\nMeanwhile @miss.understood was amused by how presenter Eamonn Holmes coped as his wife Ruth whipped out a tape measure to demonstrate the size of the three guests.\n'@itvthismorning eamons face while ruths git that tape measure lmao' (sic), she tweeted.\nOthers praised the three men for being brave enough to speak about the issue on TV with Nijoco tweeting: 'I think you're all lovely men and very proud of you', and Becky Metcalfe saying: 'Great to discuss what's 'normal' and really important in an era when teenagers get their sexual education from internet porn.'","url":"https://www.dailymail.co.uk/femail/article-3422590/Three-brave-men-tell-Morning-life-really-like-micropenis-Eamonn-looks-worried-Ruth-gets-tape-measure.html"}
