{"authors":[],"date_download":"2018-10-22 23:24:43","date_modify":"2018-10-22 23:24:43","date_publish":"2014-09-20 00:00:00","description":"Laurie Garrett covered the Ebola outbreak in Zaire in 1995. She talks with NPR's Scott Simon about the U.S. mission to send military and monetary aid to Africa to help control Ebola in the region.","filename":"data/vaneerConsumption/ThisEbolaOutbreakHasBrokenAllTheRules.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=350083174_1540250683.html","title":"This Ebola Outbreak 'Has Broken All The Rules'","title_page":"This Ebola Outbreak 'Has Broken All The Rules' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"SCOTT SIMON, HOST:\nWe're joined now by Laurie Garrett who's a senior fellow for global health at the Council on Foreign Relations. Of course, she won a Pulitzer for her coverage of the Ebola outbreak in Zaire in 1995. Laurie, thanks so much for being with us.\nLAURIE GARRETT: Thank you.\nSIMON: President Obama's committed $750 million, 3,000 U.S. military personnel to try and help control the spread of Ebola in Africa. What will they do?\nGARRETT: Well, first of all, those numbers, they're not firm. It could end up being a great deal more money and either more or less military personnel. They haven't yet done their on-the-ground needs surveillance. The key elements and the role the military will play goes to field logistics, mass mobilization of supplies and goods, expanding and improving on a rapid pace, airport runway and delivery systems, elements of hospital construction and general needs assessment.\nSIMON: You've seen Ebola directly in the face, if you please, beginning with the outbreak in 1995. But you've written that the scale of this outbreak has surprised even you.\nGARRETT: I would never have imagined an Ebola epidemic going at this pace because all the prior epidemics - some 20 outbreaks since 1976 - have occurred in isolated, rural areas and been primarily a handful of family members co-infected coming into a medical facility, and then the medical facility itself became the amplifier of the infection.\nBut this one has broken all the rules. So for the first time, we really see classic, urban, person-to-person spread in Monrovia, in Freetown and in Conakry. It has also crossed borders. So we have three countries with three different sets of policies and skills levels. And it also hit countries that had been through two of the most brutal civil wars in modern history, civil wars that pitted clan against clan, village against the village so that as this began to unfold, it unfolded in an atmosphere of deeply embedded distrust to give us the worst Ebola epidemic in history.\nSIMON: Laurie, what about those people that think that this might be tragic, but it's on the other side of the world, got nothing to do with us?\nGARRETT: I don't think there's many serious voices saying that sort of thing anymore. This week, when the Security Council convened and voted on a resolution related to the Ebola epidemic, it was cosigned by 130 other nations making it the most strongly-supported resolution in the history of the United Nations. One key element of that resolution is declaring that Ebola now represents a national security threat for every nation on Earth.\nSIMON: Help us begin to grasp the consequences of what happens if it can't be contained.\nGARRETT: Well, this, Scott, is my biggest concern - that we're coming very late to the game. Even the U.S. military, which is the fastest mobilizing operation I know of, tells me directly in my meeting with the Joint Chiefs of Staff that it's going to take 50 to 100 days to mobilize the different elements that they've promised to commit. We're so far behind the virus that I'm quite fearful that we won't catch up. And what are the consequences of that? So if we conservatively - and this is considered a conservative guesstimate - say these three countries have a cumulative 15,000 cases, and you say, as it was announced, it's doubling every 15 to 21 days - so that means by the end of September, it will be 30,000, by the end of October, 120,000. And by the time we all gather around our Christmas trees, it'll be over 400,000.\nSIMON: Laurie Garrett is a senior fellow for global health at the Council on Foreign Relations. Laurie, thank you so much.\nGARRETT: Thanks, Scott.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=350083174"}
ot be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2014/09/20/350083174/this-ebola-outbreak-has-broken-all-the-rules"}
