{"authors":["Amy Sciarretto"],"date_download":"2018-10-31 01:45:28","date_modify":"2018-10-31 01:45:28","date_publish":"2018-09-14 13:07:14","description":"Nail Sunny, whose Instagram bio proclaims it's the #1 nail art chain in Russia, creates beautiful and intricate nail art. A cursory look at its feeds reveals some serious designs, making it a heavily followed Insta fave. Well, the nail salon has…","filename":"data/vaneerConsumption/ThisStarbucksCoffeeCupManicureThatYouCanActuallyDrinkOutOfIsExtraAF.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/7d122a53-bbe1-453b-a31d-b562e85cf988-screen-shot-2018-09-13-at-115703-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_this-starbucks-coffee-cup-manicure-that-you-can-actually-drink-out-of-is-extra-af-11916503_1540950328.html","title":"This Starbucks Coffee Cup Manicure That You Can Actually Drink Out Of Is Extra AF","title_page":"This Starbucks Coffee Cup Manicure That You Can Actually Drink Out Of Is Extra AF","title_rss":"NULL","source_domain":"bustle.com","text":"Nail Sunny, whose Instagram bio proclaims it's the #1 nail art chain in Russia, creates beautiful and intricate nail art. A cursory look at its feeds reveals some serious designs, making it a heavily followed Insta fave. Well, the nail salon has crossed over into functional territory with its Starbucks coffee cup nail art manicure. The actual teeny tiny cup can be filled with iced coffee or whatever beverage your prefer and sipped through the attached straw.\nThe cup is affixed to a single nail and it's probably the most extra thing you will see on the internet today.\nThis mani might not sound or even be sanitary but it's certainly a conversation starter that also serves up your morning cup.\nIn the Insta video, which is sped up to show the detail and dexterity that went into the construction of this manicure, you see the nail technician carefully creating the cup and securing it to the nail.\nThe straw is added and the tiny cup is filled with some java. It is then sipped by the wearer because why waste it? One would think that the wearer of such art would quickly wash or anti bac their hands after enjoying a sip and a smell of the actual coffee.\nThe micro Starbucks cup nail art is incredibly artistic but it's also hardly practical.\nThe dexterous Nail Sunny tech constructs the cup.\nThe internal hole is an important part of the cup's architecture and infrastructure.\nThe familiar white, black, and green 'Bucks logo slowly, surely, and steadily takes shape and comes into focus.\nThe detail is astounding.\nAre you totally blown away by how life-like this nail art is?\nThere's the finished product, complete with a clear —as opposed to the brand's signature green — straw. The cup really stands out against the stark white nails with which its paired.\nWhy do Starbucks nail design and leave the cup empty? Why stop there? This manicure goes the distance and finishes the job by filling the cup with some of the beloved bevvie.\nIt's cute, fully functional, and a micro shot of caffeine.\nTa da! It's not like having coffee at your fingertips. It is having coffee at your fingertips. It's not exactly wise to keep the cup filled with hot liquid that swishes around every time you move. Think of the spills on your clothes, your iPhone, and on your keyboard that are inevitable when using this manicure for a shot of coffee.\nThat said, the Starbucks coffee cup nail art is still super fun to look at. It would seem best to swallow the contents of the cup immediately, rinse it out thoroughly, and allow it to be the topic of conversation.\nSpeaking of conversations, there were plenty of those taking place in the comments field of the Insta post. It is indeed a single serve sip, but that's all it needs to be.\nSome users were criticizing the manicure due to hygiene reasons but this user said it best. It's a nail design and it's fun.\nThrow Nail Sunny an Insta follow because even their more standard manis are straight up stunners.","url":"https://www.bustle.com/p/this-starbucks-coffee-cup-manicure-that-you-can-actually-drink-out-of-is-extra-af-11916503"}
