{"authors":["Linette Lopez"],"date_download":"2018-10-30 22:00:47","date_modify":"2018-10-30 22:00:47","date_publish":"2016-12-15 00:00:00","description":"A digital army.","filename":"data/vaneerConsumption/ThisishowRussiathinksaboutfakenewsandmediamanipulation.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_this-is-how-russia-thinks-about-fake-news-and-media-manipulation-2016-12_1540936847.html","title":"This is how Russia thinks about fake news and media manipulation","title_page":"    This is how Russia thinks about fake news and media manipulation - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Russian President Vladimir Putin attends the Business Russia Congress in Moscow Thomson Reuters One of the biggest stories of the 2016 presidential campaign was the hacking and release of internal emails from the Democratic National Committee and Clinton campaign chairman John Podesta.\nAnd now, the highest echelons of the US security apparatus have a suspect for who was behind the email hacks: Russia.\nThe CIA and FBI have both discovered that, by releasing damaging information about the Democrats, the Russian government sought to undermine the US elections to some end.\nThe CIA says it was in an effort to elect Donald Trump, while the FBI has been more cautious.\nRegardless of the country's intention, these accusations are real, and if true, they are a threat to the integrity of our media and our democracy. However, to anyone paying attention to how aggressively the Russian government has tried to shape media around the world for the last decade, they are not surprising.\nIn fact, the Kremlin has built an ideological foundation and media infrastructure around what it has come to consider a global media war.\nSpreading Russian influence\nIn 2005 the Russian government launched TV network RT, or Russia Today. The Kremlin-backed news channel is now available all around the world in English, Spanish, Arabic, and German. It exists to advance the agenda of the Russian government and expand its influence across the globe.\nPart of that agenda is discrediting the US system in order to show people that it's no better than Russia's, an idea that's filtered down to the alt-right — who call Russia a \"model civilization\"— and seems apparent in the world views of Breitbart's Steve Bannon and conspiracy theory jockeys like Alex Jones.\nRussia isn't shy about countering US (or global) media. In interviews with RT reporters and editors, I've been told that in 2008 — after President George W. Bush voiced his concern over Russia's incursion into Georgia — the channel's mandate changed from inviting people to enjoy Russian culture, to showing the world that the United States is not a shining city on a hill, as President Reagan described it in the 1980s.\nThe Kremlin believes it's justified in spreading misinformation all over the world — especially in the US — because it's actually a tit-for-tat.\nThe country considers RT a counter to media outlets the US set up all over the world during the Cold War, like Radio Free Europe and Radio Free Liberty. The Russians blamed those outlets for inspiring dissidents in Eastern Europe to rise up against late-Cold War Soviet-backed governments.\nThe US outlets are run by a federal agency called the Broadcasting Board of Governors, but have been left largely ignored since the end of the Cold War. Their work was put on a political back burner, so to speak.\nBut Russia did not forget, especially not a Russia helmed by former KGB agent Vladimir Putin.\nA producer of Ukraine Today accused the Russian government and media of lying about Russia's incursion into the country. It was news, to say the least. YouTube/RT\nA conspiracy to spread conspiracies\nFor years I've spent time in and out of Columbia University's School of Journalism as a student and as an adjunct professor investigating and/or teaching about Russia Today and outlets like it, including Sputnik. Ultimately I've come to understand that the Kremlin thinks that spreading its messaging is morally equivalent to the US exporting the value of a free press.\nRussia's aim is to spread chaos to appear strong in contrast to its geopolitical foes. It does this through a mix of pointing out legitimate issues with the American government and the country's society, by printing outright lies and promoting conspiracy theories, and by spreading a million half-truths about what's going on — so many half-truths, that people lose faith in who and what to believe.\nYou may recognize some of these tactics in our current media landscape.\nThe Kremlin has been using the same strategy to confuse its own people, according to Peter Pomerantsev, a former Russian television producer who testified before the Senate Foreign Relations Committee last year.\n\"In order to woo viewers the Kremlin has utterly blurred the lines between fact and fiction. Kremlin 'current affairs' programs are filled with spectacular scare-stories about Russian children crucified by Ukrainian militias or US conspiracies to ethnically cleanse East Ukraine. In a context where no one 'believes' any media, all that matters is that the 'news' is sensationalist and cinematic,\" Pomerantsev told the Senate Foreign Affairs Committee in November 2015.\nThis is why fake news is such an important piece, and distinctly Russian feature, of this game. Crazy conspiracy theories like pizza-gate, the story that Democratic leaders run a child sex ring out of a DC Pizza shop, are just the thing to stir passions and create distrust among the credulous. They're meant to weaken trust in institutions and generate a sense of enmity between parties and people, all while sowing doubt about the boundary between real and fake news.\nDonald Trump and his associates only advance the Kremlin's cause when they spread these stories, or even just when they describe the US system as being \"rigged.\"\nThe Troll War\nThis media war also involves using social media to counter US influence all over the world. For years analysts have tried to track the activity of pro-Russian internet trolls, and not just in the US. Last August, pro-Russia trolls started spreading false news stories all over Sweden, while that country was considering signing a deal with NATO, Russia's greatest foe.\nOfficials told the New York Times that Swedish people all over the country \"got scared\" because they were not used to seeing such blatant untruth all over social media. European and American intelligence experts traced the vitriol back to Russia, and the aggression only pushed Sweden closer to NATO.\nRT, which is constantly beating a drum against NATO, called Sweden's reaction \"anti-Russia hysteria.\"\nThis summer the New York Times Magazine found that many Russian trolls, headquartered in St. Petersburg, were posing as Donald Trump supporters on the internet, creating fake conservative accounts.\nThere are obvious reasons why Russia would prefer Trump to Clinton, especially when it comes to this battle over media consumption. The former Secretary of State spoke out against Russia's aggression in this space as early as 2010, saying the US was losing the \"information war\" around the world.\nRussia, you see, had created a media army and it has never been afraid to use it.","url":"https://www.businessinsider.com/this-is-how-russia-thinks-about-fake-news-and-media-manipulation-2016-12"}
