{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-23 00:55:25","date_modify":"2018-10-23 00:55:25","date_publish":"2016-01-28 15:01:21","description":"Selfless Amy Barbour, 13, from Saltcoats, Scotland, who helps care for her mum Susan, 40, as well as her 17-year-old brother and two-year-old sister left Holly and Phillip Schofiled visibly moved.","filename":"data/vaneerConsumption/ThisMorningsHollyWilloughbyreducedtotearsbygirlwhoisacarerforherfamily.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD369D00000578-0-image-a-2_1454012541602.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420783_13-year-old-girl-cares-seriously-ill-mother-bipolar-brother-autistic-sister_1540256125.html","title":"This Morning's Holly Willoughby reduced to tears by girl who is a carer for her family","title_page":"This Morning's Holly Willoughby reduced to tears by girl who is a carer for her family | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The mother of a 13-year-old girl who acts as a carer for her mum and two siblings has told how, despite running the household, she 'never complains'.\nSusan Barbour, 40, has two brain aneurysms as well as a serious neurological condition, while her eldest child has bipolar disorder and her youngest may have autism.\nAmy, who looks after her mum when she's ill and helps maintain the running of the household, got a heartwarming surprise on This Morning today when she received a phone call out of the blue from hosts Holly Willoughby and Phillip Schofield as part of a special item to mark Young Carers Awareness Day.\nScroll down for video\nPhilip Schofield and Holly Willoughby were visibly moved by Amy's selfless care for her family\nHolly wiped her eyes as Amy told their reporter that their gift of books and a tablet was too generous after they surprised her at school during a segment on young carers on today's This Morning\nAmy, second right, with her mother Susan, left, sister Neveah, two, and Aiden\nPhillip said, 'Amy has sacrificed so much, that we thought she deserved something of a treat herself so we are phoning her head teacher right now.'\nAmy Barbour, who was at school at the time, was stunned as Holly told her: 'We think you're amazing,' before the youngster was presented with a tablet and books by reporter Michael Underwood.\nAmy said: 'I’m definitely missing out, but it’s a part of my life, and that’s the way it is… I love my family more than I can say. I don’t know what I’d do without them.'\nWhen she insisted that her gifts were 'too much', Michael told her: 'Honestly Amy, you don't understand how amazing you are. All the work you put in to look after three members of your family, it's totally selfless. It's just incredible, you deserve this.'\nHolly and Phil, watching from the ITV studio in London, were reduced to tears.\nAmy from Saltcoats in Scotland, dedicates all her free time to helping look after her family.\nThe youngster helps care for her mum Susan, 40, who has two brain aneurysms, as well as her 17-year-old brother and two-year-old sister.\nSpeaking about her daughter, Susan said: 'Amy is extremely mature and responsible. She never complains'\nMum Susan also suffers from idiopathic intracranial hypertension - an excess of cerebral spinal fluid exerting pressure on the brain, which leaves her with severe debilitating pain - while her brother Aiden has type 2 diabetes and bipolar disorder.\nMeanwhile, two-year-old Neveah is also awaiting a diagnosis that they believe will show she has autism.\nAmy, who spends all her spare time caring for her family, is one of more than 700,000 young carers in the UK.\nWhen she's not at school, Amy is constantly looking after the rest of her family and helping her mum to run the home – including budgeting, health care and many domestic chores.\nAmy is a young carer for several hours every day. This means she cannot take part in after school activities and has to rush home every night to look after her family, as well as trying to squeeze in her homework.\nShe has been caring for her older brother since she was three years old because of his physical health, then as he grew older, his mental health issues surfaced.\nHolly and Phil, left, were reduced to tears as they watched Amy, right, get a surprise at school in Scotland\nAmy was identified as a young carer by her brother’s social worker when she was just 10. She was referred to a local young carer support group in Ayrshire, Scotland.\nAmy said: 'There are lots of opportunities to do things after school, but I can’t.\n'If I don’t get home straight away, I won’t have time to help mum make tea for everyone, tidy up and help with jobs – then do my homework. I miss out on lots of things but don’t mind spending time with my family.\n'I’m doing something every minute at home to help. When I’m not at home I’m worrying about my family. Since nine years old I’ve been helping plan the family budget with my mum and now I still continue to help organise my family.'\nShe explained: 'Since my little sister was one, I’ve had to take care of her – changing her nappies, feeding her, getting her washed and dressed - every day. I’m like a little mother because my mother is too ill a lot of the time.”\nReporter Michael Underwood, right, told Amy: 'All the work you put in to look after three members of your family, it's totally selfless. It's just incredible, you deserve this'\nAmy received the surprise visit as a reward for all her hard work looking after her mum and two siblings\n'My mum is turning 40 this year. I was worried she wasn’t going to make it. She has had three big operations and is in lots of pain because of her condition. Sometimes she has migraines so bad that she loses her vision.'\nAmy's mum Susan added: 'Amy also assists with ordering prescriptions from the pharmacy and medical supplies from Medtronic as my son is on an insulin pump.\n'He has a cannula attached to his stomach which needs to be changed every two-to-three days and Amy often assists with this.\n'My son has been on 750mg of Quetiapine/day, an antipsychotic drug which makes him extremely lethargic. Amy actively participates in motivating him every day and trying to keep his mood levels up.\nAmy is one of more than 700,000 young carers across the UK who sacrifice their free time to look after family\n'He relies on Amy heavily for social cues, particularly when out and about and she often has to curb and explain away any unwanted behaviour.\n'Last year I underwent operations to treat a cerebral aneurysm at risk of rupture. During this time, Amy stayed with my mother and still undertook her caring duties as my other children must keep a rigid routine.\n'When I came out of hospital, I struggled to walk for two weeks and Amy took care of the entire household, whilst still attending school every day.\n'Amy is an absolute rock to me. She has sacrificed much of her childhood as she always has to put others before herself. Amy is always the one who has to put what she wants to do to one side and compromise for the benefit of her siblings.\n'Consequently, Amy is extremely mature and responsible. She never complains.'\nAppearing on This Morning, a spokesperson for the Young Carers' Trust warned that some youngsters were 'missing out on their childhood' and that most young carers missed out on 48 days of school a year.\nPeople watching on this morning were full of praise for Amy. Sabrina Crowther wrote: 'I am in tears watching this morning today! How amazing for that young little star! Awareness.'\nGaynor Rees wrote: 'Lovely to see Amy being rewarded with so many gifts for all her hard work looking after her family.;","url":"https://www.dailymail.co.uk/femail/article-3420783/13-year-old-girl-cares-seriously-ill-mother-bipolar-brother-autistic-sister.html"}
