{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:29:57","date_modify":"2018-10-30 21:29:57","date_publish":"2016-07-20 14:51:57","description":"There's typically only one way okra is consumed in the South, and it involves oil and a deep fryer.","filename":"data/vaneerConsumption/ThisBufordHighwayokradishmightmakeyouditchthefriedokra.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/07/20/Images/WPIMAGE_cmgajcfoodandmore_9657.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_th_e091377310e9eb449ac371b4f18ecd0d__1540934997.html","title":"This Buford Highway okra dish might make you ditch the fried okra","title_page":"This Buford Highway okra dish might make you ditch the fried okra","title_rss":"NULL","source_domain":"ajc.com","text":"There's typically only one way okra is consumed in the South, and it involves oil and a deep fryer.\nI've got nothing against fried food -- can you legally live in this region if you do? -- but sometimes it's nice to have something a slightly healthier alternative when it comes to my vegetables (my chicken, however, is an entirely different story).\nEnter the Sambal Okra from Mamak on Buford Highway, a Malaysian cafe tucked into a shopping complex shared with dessert spot Sweet Hut, an Asian grocery store and several wholesale stores).\nOn paper, the dish doesn't initially command as much attention as some of the more exotic-sounding menu items (salt and pepper squid, anchovies and onions in tamarind chili sauce), but the first bite will make you a believer. The okra, sauteed to a soft crisp, is tossed, along with slivers of red onion and red pepper, in a sauce of Malaysian shrimp paste, oil and chili paste. It's just spicy enough, though if your tastes run to the mild, you can cool things off with the side of white rice that accompanies the meal.\nIt might go against all you believe in to have a vegetable dish serve as your dinner entree, but the sambal okra more than holds its own, and you might even have enough left over for lunch the next day.\nIt'll all make you forget about the fried okra you normally order at your local meat-and-three. For a little while, at least.\nRead about some of our other favorite dishes from Atlanta restaurants\nClick here to read the AJC’s Ultimate Guide to Brunch in Atlanta\nClick here to read about dining in Atlanta around the clock\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter. Find us on Instagram @AJCdining.","url":"https://www.ajc.com/blog/atlanta-restaurants/this-buford-highway-okra-dish-might-make-you-ditch-the-fried-okra/CnKhcoNBqFF9CHnFZDsbYO/"}
