{"authors":["Abc News"],"date_download":"2018-10-30 00:51:37","date_modify":"2018-10-30 00:51:37","date_publish":"2018-10-28 06:59:16","description":"This is a rush transcript for \"This Week\" on Oct. 28, 2018.","filename":"data/vaneerConsumption/ThisWeekTranscript102118.json","image_url":"https://abcnews.go.com/Politics/week-transcript-10-21-18/story?id=58803070","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Politics_week-transcript-10-21-18_story_id=58803070_1540860697.html","title":"'This Week' Transcript 10-21-18","title_page":"'This Week' Transcript 10-21-18 - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"A rush transcript of “This Week with George Stephanopoulos” airing on Sunday, Oct. 28, 2018 on ABC News is below. This copy may not be in its final form and may be updated. For previous show transcripts, visit the “This Week” transcript archive.\nANNOUNCER: This Week with George Stephanopoulos starts right now.\nGEORGE STEPHANOPOULOS, ABC NEWS CHIEF ANCHOR: Massacre in Pittsburgh, at least 11 dead, many more injured after a gunman opens fire in a synagogue.\nUNIDENTIFIED MALE: It's a very horrific crime scene. It's one of the worst that I've seen.\nSTEPHANOPOULOS: The worst attack on American jews in the history of our country. The third mass shooting in a house of worship in the last three years. Our Martha Raddatz is live on the scene.\nMARTHA RADDATZ, THIS WEEK CO-ANCHOR: This is a community in mourning after that horrific attack at the synagogue just behind me.\nSTEPHANOPOULOS: The shooting comes just one day after this man arrested for targeting President Trump's critics with potentially deadly explosives. Almost a dozen prominent Democrats, including Barack Obama and Hillary Clinton, in the cross hairs.\nAre hate-filled politics now fueling political violence? Does President Trump share responsibility? Can we stop the killing from spiraling out of control?\nAnd with just nine days to the midterms...\nDONALD TRUMP, PRESIDENT OF THE UNITED STATES: We are going to win, win, win. And we are going to keep on winning.\nBARACK OBAMA, 44TH PRESIDENT OF THE UNITED STATES: What is at stake is a politics that is decent and honest and lawful.\nSTEPHANOPOULOS: How will this week's violence weigh on voters? Insight and analysis from our Powerhouse Roundtable.\nWe'll break down the politics, smoke out the spin, the facts that matter This Week.\nANNOUNCER: From ABC News, it's This Week. Here now Chief Anchor George Stephanopoulos.\nSTEPHANOPOULOS: Good morning.\nBefore every big election, we expect an October surprise. This year, it has come as an explosion of violence and rage, a spate of domestic terror.\nOn Monday, the first potential letter bomb was found at the home of George Soros, the billionaire activist who has been a frequent target of President Trump. By week's end, more than a dozen more intercepted, apparently constructed in this van, plastered with partisan stickers, by this man, a long-time criminal and staunch supporter of President Trump.\nOn Wednesday, an armed man tried to enter the predominantly black First Baptist Church in Jeffersontown, Kentucky. Unable to break in, he walked to a Kroger's down the street and shot two black victims to death, passing right by a white man in the parking lot saying whites don't kill whites.\nThen came Saturday, the sabbath worship at the Tree of Life synagogue in Pittsburgh shattered by semi-automatic gunfire and the chilling scream \"all Jews must die.\"\nThis morning, our hearts ache for the victims as we absorb the shock. But how surprised should we be? This is at least the fourth mass killing in America using an AR-15 since the Las Vegas massacre just over a year ago, the third mass shooting in a House of worship in the last three years.\nAcross social media, hate speech and anti-Semitism are rampant and on the rise, all against the backdrop of the ugliest political climate in modern times, at the center an unapologetically incendiary president, untrammeled by traditional norms of civility.\nWe will do our best to make sense of it all this morning. And we begin in Pittsburgh, now the site of the single worst attack against jews in American history.\nMy This Week co-anchor Martha Raddatz is there. Good morning, Martha.\nRADDATZ: Good morning, George. This was truly a horrific scene. You see the synagogue behind me. And we're standing in front of a home where snipers positioned themselves on the second floor to do what they could to stop the gunman.\n(BEGIN VIDEOTAPE)\nRADDATZ: Overnight the Squirrel Hill community coming together in mourning.\nUNIDENTIFIED FEMALE: You can't even put it into words. It's just terrible.\nRADDATZ: An outpouring of grief and shock.\nUNIDENTIFIED FEMALE: You hear about anti-semitism with something that happened in history, that happened in other places, but this is Squirrel Hill, so I didn't really think of it as something that was affecting me.\nRADDATZ: Close knit Squirrel Hill, the real-life Mr. Roger's Neighborhood, home to several synagogues and an active Jewish community now shaken to its core.\nThe horrific scene unfolded on a quiet Saturday morning at the Tree of Life synagogue as congregants observed the Jewish sabbath, it began.\nUNIDENTIFIED MALE: Several calls of persons sheltering in place within the structure. It sounded like from the calls that I was killing that as soon as he came into the lobby he opened fire.\nUNIDENTIFIED MALE: The scene is very bad inside. There are multiple fatalities.\nRADDATZ: 11 people killed, many more wounded, including police officers injured at the scene. SWAT operators, engaging in a gun battle with the shooter, nearby residents warned not to leave their homes.\nKim Hardin’s home is just across the street from the synagogue.\nKIM HARDIN: -- and by the time I rallied my kids and got them down to get them into the basement, the police were already starting to arrive. There were four, five, six police cars, they were jumping out of their cars with their weapons drawn and so I knew something was really wrong. Probably five minutes after that we had the SWAT banging on our backdoor to get in to use our second floor for the snipers.\nRADDATZ: Zachary Weiss’s father was among those in the temple in that morning.\nZACHARY WEISS: My dad went up the steps and he was in this angle where about five feet away from him he could see casing moving, which meant that more shots were being fired. And --\nRADDATZ: He could see casings coming --\nWEISS: Coming towards his proximity, yes. About five feet was what he told me. And he did not see the shooter. So he was far away enough that the shooter did not recognize him, but he was close enough that he could see the bullets.\nRADDATZ: 46 year old gunman Robert Bowers has a history of making anti-Semitic statements, reportedly posting on social media just before the shooting, \"I can’t sit by and watch my people get slaughtered. Screw your optics, I’m going in.\" And while in custody he told officers he wanted all Jews to die. Bowers is now facing federal and state charges, including hate crimes.\nWhat do you say to comfort people in a time like this, as a rabbi?\nRABBI CHUCK DIAMOND: Well, I think it’s challenging. Unfortunately I’ve had a lot of experience with death and dealing with death and different kinds of things. Nothing quite like this. A hug goes a long way. Just a shoulder to cry on and just to -- to empathize with -- with the people.\nRADDATZ: But Rabbi Chuck Diamond, who grew up in this community, says that may not be enough.\nDIAMOND: We got to do something. And so you got to take action. And as a rabbi it’s interesting to say prayers aren’t enough.\nRADDATZ: The residents of Squirrel Hill still reeling from tragedy.\nHARDIN: We are an accepting, diverse population in Squirrel Hill and we support each other. And we are going to be stronger for this. We are going to support our -- our Jewish friends and we’ll get through this and we’ll teach our kids to -- to move away from hate.\nRADDATZ: It is a community trying to come together, so let’s bring in two members of the Pittsburgh city council who represent this neighborhood, Corey O’Connor and Erika Strassburger. Thank you for coming by this morning. We all feel so horrible about this and our prayers are with you. You had to know a lot of people in this neighborhood who were likely in that synagogue yesterday.\nRADDATZ: It is a community trying to come together, so let’s bring in two members of the Pittsburgh city council who represent this neighborhood, Corey O’Connor and Erika Strassburger. Thank you for coming by this morning. We all feel so horrible about this and our prayers are with you. You had to know a lot of people in this neighborhood who were likely in that synagogue yesterday.\nCOREY O’CONNOR, CITY COUNCILMAN, PITTSBURGH, PENNSYLVANIA: Yeah. It’s scary. When you look at these horrifying crimes that happen across the country, and then when it hits home and it hits people that you know, people that you grew up with, you know, going into that synagogue a couple months ago for an award ceremony, being there for a number of services, for friends throughout the years, it’s really scary.\nRADDATZ: And -- and when you first heard about it, your -- your heart had to be beating and wondering who was inside.\nERIKA STRASSBURGER, CITY COUNCILWOMAN, PITTSBURGH, PENNSYLVANIA: I was two blocks away. I was with members of the community at a different event. The -- the sadness and the fear that it was immediately apparent with the people I was with -- was heartbreaking. And I got on the scene as soon as I could just to find out more. The hardest part is waiting to find out more.\nRADDATZ: So how does this community move forward?\nO’CONNOR: We’ve had events over the last couple days. You know, mourning with each other, vigils to support families as well as, you know, to honor the ones that we’ve lost. But we are a very strong community. We’re a close-knit community, we’re very diverse. We’re not going to be afraid of this. We were out and about in the thousands last night. We’re going to be out, about today. You know, Squirrel Hill is some -- some communities that band together.\nAnd not only Squirrel Hill but the city of Pittsburgh. And there’s going to be an outpouring of love and support for these residents over the next couple weeks and definitely couple months.\nRADDATZ: And there are about 50,000 Jewish residents of Pittsburgh and about -- even more than half of them live in this community. How do you think you go forward in this community, with the Jewish community in particular and the pain they’re feeling now?\nSTRASSBURGER: Well, one really incredible thing was even on -- on scene yesterday we had outpouring of support, not just from the Jewish community but from the Muslim community, the Islamic Center of Pittsburgh, the Hispanic and Latino community. I think that as Councilman O’Connor said, our strength comes from our diversity.\nAnd we’re going to have to continue that, not just in the days to come, not just in the weeks to come, but in the months to come and to demonstrate that anti-Semitism has no place in today’s world and certainly not in Squirrel Hill, certainly not in Pittsburgh. We’re better than that.\nRADDATZ: And just this summer, Rabbi Jeffrey Myers, who’s the rabbi at Tree of Life, wrote a blog post about school shootings. And he was bemoaning elected officials waiting out the news cycle warning, \"I fear that the status quo will remain unchanged.\" So do you feel a responsibility to change that status quo now?\nO’CONNOR: Yes. I mean, we had the responsibility to change it 15, 10 years ago. And now that it hit us home in Pittsburgh, in this neighborhood, the city of Pittsburgh will stand up to this. Not only will we, we need partners in other major U.S. cities to stand up as well and say we’re not going to take it. We can’t get the help and support from our state and federal levels, cities are going to have to take this on-- head-on and we’re not afraid to do that.\nRADDATZ: But -- but what exactly do you want to do? Tragically, we hear these shootings so often, what can be different?\nSTRASSBURGER: Something has to be different. That’s all I can say. Something has to be different. We should have taken action years ago when it comes to, you know, sensible gun control. And although we’re limited in the city of Pittsburgh, we’re going to do our best to make something happen and to work with our partners at the state level, and those who we can at the federal level.\nRADDATZ: President Trump in his first public remarks, I’m sure you heard yesterday after the shooting at Joint Base Andrews suggested an option that might help, having armed guards in places of worship. Let’s listen.\n(BEGIN VIDEO CLIP)\nDONALD TRUMP, PRESIDENT OF THE UNITED STATES: This is a case where if they had an armed guard inside, they might have been able to stop him immediately. So this would be a case for, if there was an armed guard inside the temple they, would have been able to stop him. Maybe there would have been nobody killed except for him.\n(END VIDEO CLIP)\nRADDATZ: Would that have helped?\nO’CONNOR: So if that’s what the president wants to see, that’s not my neighborhood. That’s not Squirrel Hill. I live -- I grew up 15 blocks from here. My mom leaves her door open at all times. That’s not the community we want. We don’t want people having armed guards at every door you walk into. It’s not that type of neighborhood. The main business district’s a block away. That’s not what we’re looking to do in this city. And you know, unfortunately events like this happen and we’re lucky that our law enforcement officers were here to save even more lives, but that’s not the type of community that we want to live in.\nRADDATZ: Do you think it might have saved lives, an armed guard?\nSTRASSBURGER: It could have saved lives. But if you think about it, today it was at -- yesterday it was at a synagogue, it might be at a school, but the next time it could be at a grocery store or at a public market. What -- what -- where do we stop with, arming our entire society and feeling as if we can’t be safe anywhere? I -- I just don’t see that as the answer.\nAnd certainly, you know, the Jewish community throughout Pittsburgh will have to make their -- and the synagogues thought Pittsburgh will have to make their own decisions as to what they need to do to feel safe. But it flies in the face of the open doors, open arms mentality of the synagogue, in particular, and all of them across Pittsburgh.\nRADDATZ: OK. I thank you both for coming out with us this morning and, again, our prayers are with you.\nO’CONNOR: Thank you.\nRADDATZ: thank you.\nSTRASSBURGER: Thank you.\nRADDATZ: And for more on extremism in America, let’s turn to former Homeland Security Jeh Johnson and Anti-Defamation League CEO Jonathan Greenblatt. Let me start with you, Mr. Greenblatt. You said this is likely the deadliest attack on a Jewish community in American history. And yet, anti-Semitic rhetoric and attacks have been on the rise. So -- so give us a sense of that, put that in context and -- and how shocked were you by this?\nJONATHAN GREENBLATT, CEO, ANTI-DEFAMATION LEAGUE: Well, I think I was horrified. And -- in my organization, the country was horrified by what happened yesterday. But unfortunately, in some ways, we weren’t necessarily surprised.\nAt the ADL, we’ve been on the frontlines of fighting hate for over 100 years and tracking anti-Semitic incidents for four decades. And what I can tell you is in 2016 we saw a 34 percent increase in acts of harassment, vandalism and violence against the Jewish community. But last year, a 57 percent increase, the single largest surge that we’ve ever seen in anti-Semitic acts in the United States.\nAnd so this event that happened yesterday, this terrible tragedy -- and our hearts break, they break for the families and the victims in the community. But let me tell you, we should not look away when anti-Semitism is on the rise. We need to act.\nRADDATZ: And Secretary Johnson, I know the ADL also this week showed a marked increase in online attacks the Jewish community as we get closer to Election Day. When you look at those statistics, when you hear what Mr. Greenblatt just said, what is your sense of what’s happening in the country?\nJEH JOHNSON, FORMER SECRETARY OF HOMELAND SECRETARY: Well, first, Martha, all Americans this morning should mourn with the families of the 11 killed who were members of the Tree of Life Synagogue and with the Jewish community generally.\nMartin Luther King used to say that injustice anywhere is a threat to justice everywhere, an attack against one is against us all. As I think Jonathan alluded to, we live now in a very, very toxic environment that includes an instability in our political discourse among our leaders.\nThe attack yesterday and the attempted pipe bombings over the course of last week should be a wake up call to all Americans to demand change, and change has to start at the top.\nWe’re in an environment now where deranged individuals feel that it’s their place to bring about change in our society with an AR-15 or a series of pipe bombs. And Americans really do listen to their leaders, including our president.\nOur president has the largest microphone, he has the largest bullhorn. This particular president has a particularly large voice and a large microphone, and Americans should demand that their leaders insist on change, a more civil discourse, and a more civil environment generally.\nRADDATZ: And Mr. Greenblatt, I want to ask the same question of you. Were you comforted by the president’s remarks yesterday and his repeated condemnation of anti-Semitism?\nGREENBLATT: Well it is important that our leaders lead, as Secretary Johnson said. And I was encouraged that the president said something yesterday, the country needed to hear that.\nBut it isn’t what you say after the tragedy that only matters. It’s the environment that you create with your rhetoric. And at the ADL, we have spoken out when candidate Trump or President Trump has invoked anti-Semitic memes and used the kind of rhetoric favored by white supremacists.\nBut I think we also need to keep in mind, and we’ll keep doing that, we’ll keep speaking truth to power, but it’s more than what one man does. Whether you’re an elected official meeting with Nazi sympathizers or bringing Holocaust deniers to the House of Representatives, or if you’re an elect – or a candidate for office invoking wild anti-Semitic conspiracy theories about Jewish financers like George Soros manipulating world events, or if you’re a religious leader referring to Jews as termites.\nAll of this is absolutely unacceptable, and we cannot create a situation or allow ourselves to normalize anti-Semitism and think this is somehow just an average daily course of business.\nIt’s abnormal and it needs to be interrupted and stopped.\nRADDATZ: Jeh Johnson, I want to go back to the – the suspect, the accused shooter. He was prolific on social media, especially an online community called Gab, which allegedly has attracted a number of far right users.\nHe reportedly wrote ‘I can’t sit by and watch my people get slaughtered. Screw your optics, I’m going in.’ Who monitors sites like these? Is there enough oversight? Where is the line drawn there?\nJOHNSON: That’s a good question. I think first and foremost social media providers, internet service providers have to monitor the content on their platforms for threats of violence, for this type of hate.\nI don’t believe that the government, particularly the security agencies of our government, should be in the business of limiting or editing speech or political debate or political content, but there is a line that is crossed from debate, robust debate to hate, inciting violence and threatening acts of violence.\nAnd so I know that internet service providers, social media providers have made great strides to take down truly hateful speech, but they’ve got to keep at this, they’ve got to keep on it.\nThis cuts across religion, race, demographic, nationality and it’s no coincidence, frankly, that the individual who used to work for me at DHS responsible for countering violent extremism now works for Jonathan at ADL.\nAnd so I think it’s incumbent upon all of us to be vigilant when it comes to this kind of thing, be more scrutinizing and to demand change among our leaders and the discourse that they foster and bring about in the run-up to this midterm.\nGREENBLATT: You know, at the ADL we monitor this kind of online hate and harassment. We opened a center for technology and society in the heart of Silicon Valley last year and we’re working directly with Google and Twitter and Facebook and Microsoft, but the companies need to do more.\nAnd as an advocate -- a fierce advocate for the first amendment we need to recognize and acknowledge that freedom of speech is not the freedom to slander.\nAnd the freedom of assembly isn’t the freedom to insight violence. So whether it’s Gab or any of these other platforms, those who peddle hate, those who seek to spread harm, we need to take steps to shut that down.\nRADDATZ: OK. Thanks to both of you for all your comments this morning.\nJOHNSON: Thank you.\nGREENBLATT: Thank you.\nRADDATZ: And joining me now is former FBI agent and ABC News contributor Brad Garrett here in Pittsburgh. Brad, we’ve got a crime scene behind us. They’re still investigating this. You took a look at the affidavit and with the details of what went on inside of there with that shooter.\nBRAD GARRETT, FORMER FBI AGENT: So -- so keep in mind since Columbine, police changed their tactics of-- instead of waiting to go right to the shooter. Because let’s face it, these shootings take less than five minutes, typically. So that’s exactly what the Pittsburgh police did. They engaged the shooter that then went up to the third floor of the building. He now gets in a gunfight with the police, several officers get shot, he gets shot, but they stop him.\nAnd the key is because they went in when they did, it saved lives.\nRADDATZ: And -- and of course we had snipers right in this house where we’re set up in the front yard, upstairs in case they couldn’t get him --\nGARRETT: Right.\nRADDATZ: -- inside. What -- what do we know about this suspect? Is there anything -- you’ve seen these kinds of things so many times. Is there anything atypical about it?\nGARRETT: No, from the standpoint that they’re obviously full of anger and rage, but the important thing is that people like this gentleman are looking for an excuse to act. Now, did he use the serial bomber that we just went through as a motivator? I don’t know. But their anger and rage builds up. And it’s all about power, Martha. They feel powerless. They feel like people are overtaking their lives and it becomes anger. And they vent it in a very hateful way and so that’s why he did this. It’s a power thing.\nRADDATZ: And -- and you saw the -- the online posting, supposedly by him. Is he more radicalized online? Is it the atmosphere in the country right now? Is -- what do you see there?\nGARRETT: OK. So it is a combination of-- we’re angry, we’re intolerant, and that’s getting promoted in certain venues around this country. And the problem is that people like this, they’ll hook onto it. They’re looking for something to justify their behavior. And if they can take on a situation like this location and start to kill people, it’s like they’ve released -- I’m taking charge, I’m getting rid of people who shouldn’t be here. It’s all about dehumanizing individuals.\nRADDATZ: Should he have been on the law enforcement radar, could he have been? Would they have known?\nGARRETT: The problem with that is that versions of him are in the hundreds of thousands across this country. And until you have information about somebody actually launching or building an attack online or talking to somebody or through an informant, what can you really do? What he’s saying online a lot of people say online. The first amendment’s going to protect them. So it’s a real tough call for law enforcement.\nRADDATZ: And with the mail bomber as well, right? I mean there were threats of some sort. He was driving around with a van with targets on people’s faces.\nGARRETT: Of course.\nRADDATZ: Nothing you can do about that?\nGARRETT: And -- and been convicted in the past --\nRADDATZ: Yes.\nGARRETT: -- of threatening people. So you know, you could see his progression. I guarantee you this gentleman, you’re going to see his progression that led him to this building.\nRADDATZ: OK. Thanks very much for joining us this morning, Brad. Let’s go back to George in the studio.\nSTEPHANOPOULOS: Thank you, Martha. We’ll be back with you later in the program. Up next the roundtable. How much of this violence is being sparked by our political climate and what will it mean for the midterms? We’ll be right back.\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nTRUMP: And it's a terrible, terrible thing what's going on with hate in our country, frankly, and all over the world. Something has to be done.\nThis is a dispute that will always exist, I suspect, but if they had some kind of protection inside the temple, maybe it could have been a very much different situation.\nThe world is a violent world. And you think when you're over it, it just sort of goes away, but then it comes back in the form of a madman, a whacko. And I think they should stiffen up laws and I think they should very much bring the death penalty into vote. They should pay the ultimate price.\n(END VIDEO CLIP)\nSTEPHANOPOULOS: President Trump's first reaction to the shooting at the Tree of Life synagogue in Pittsburgh on his way to a campaign rally in Illinois yesterday.\nWe're going to talk about this all in our roundtable now, joined by our chief political analyst Matthew Dowd, national correspondent for The Washington Post Mary Jordan, Reihan Salam, executive editor of The National Review and author of \"Melting Pot or Civil War? A Son of Immigrants Makes the Case Against Open Borders,\" former Trump Homeland Security Advisor Tom Bossert, and Democratic Strategist, former DNC Chair Donna Brazile.\nMatt, I said at the top of this show, we shouldn't be surprised by this, all the events of this week. Were they inevitable?\nMATTHEW DOWD, ABC NEWS CHIEF POLITICAL ANALYST: I think we should be surprised that something like this takes place in America in the course of the last week, but I think much of it’s been predictable in this, and the times that we’re in and where we are today.\nI’ll quote the philosopher Yoda, which says the path to the dark side is fear, fear leads to anger, anger leads to hate, and hate leads to suffering. And I think we’re at a moment in time where we have to speak compassionately, clearly and calmly in the times we’re in.\nAnd I think our leaders, and I would put specific responsibility on the president, that he has an obligation to try to rid us of much of this tribalism. I think what he’s done over the course of the last few years is help foment this.\nI’m not saying he’s responsible for what happened in Pittsburgh, he’s not responsible for what happened with the bombs that were sent. He’s not responsible for what happened at the supermarket.\nBut all of those have a commonality, a white national supremacist shot two blacks at a supermarket, a white national supremacist sent 17 IEDs across the country to Democratic leaders, a white nationalist supremacist just killed 11 Jewish people in a synagogue in Pittsburgh.\nAnd in the course of that, I think the president has not actually allocated resources to deal with it in the right way and he also has not spoken in the right way in the course of this that has diminished the hate.\nSTEPHANOPOULOS: Tom, you had to work on domestic terror when you worked for President Trump as homeland security advisor. How do you respond?\nBOSSERT: Yes, well I’m sad to hear it all to be honest. Even this morning, a lead into this was a focus on the president’s comments as he walked out to the helicopter, instead of the focus on the quote I was hoping to see in which he condemns anti-Semitism and violence in this country.\nAnd so it’s a hard time to claim he’s got a big megaphone.\nSTEPHANOPOULOS: But wait a second – wait a second (inaudible) that was his first response, that was instinctive response to what happened. What he then said in the speech – what was scripted for him.\nBOSSERT: I don’t believe that’s accurate. First off, he has control over what’s scripted in those speeches –\nSTEPHANOPOULOS: You’re saying that wasn’t accurate, that was his first response?\nBOSSERT: No because it wasn’t his first response, it was on his way out, a response to a question thrown at him about gun control. So the question was already political and reporters in the gaggle were saying what are your thoughts on gun control in response to this issue.\nHis actual response to the American people was that we have no tolerance for violence in this country or anti-Semitism. To be honest, whether you play it or not or agree with me or not, that’s what I want to promote today.\nBRAZILE: But Tom, when a child has an absent parent, the other parent steps up or the sibling steps up. But when the country is going through a lot of pain and strife, you look for the president to be that parental figure.\nAnd yesterday I think at that moment, he was not the parent we needed, he was not the person that could heal us, that could talk about the pain. He runs away from his responsibility as a leader.\nWe’re all leaders, we all have voices, and his voice is the loudest voice at a moment like this. A moment, George, when our leaders, our former presidents, regardless of their party, they were elected by the entire American people.\nThey – their lives were at stake, the lives of our attorney general, the lives of members of Congress, the lives of people who are just regular people and people in the media.\nBOSSERT: People at this table.\nJORDAN: But when you’re out talking to voters, because we’re days away from a very important election, what they say is the country is in need of repair. And what they want is a repair man or a repair woman to fix this.\nAnd I think the 2020 election is going to end up actually being on this point.\nSTEPHANOPOULOS: People do say that, but do they vote with – to back up what they say is one of my questions?\nJORDAN: Well it depends on who we’re giving them, and I think this is one of the key questions for 2020 is who – who are the Democrats going to give? Because right now, we’re still in our two camps, and right now it’s about getting the vote our for this side or this side.\nAnd it’s either you’re with this whole election in days to come is about Trump, are you with him or are you against him? And we’ll see about how the turnout (inaudible).\nSALAM: One thing I feel compelled to say is that you had brave women and men, police officers who intervened in Squirrel Hill, you had folks who stopped that shooter in Louisville, Kentucky.\nYou had these people putting themselves in grave danger. These are women and men who have different political beliefs, some of them are Republican, some of them are Democrats, some of them support the president, others absolutely do not.\nYet they were able to come together to work effectively, and I think that one dynamic you see happen is that we tend to invest a lot in our politicians, we identify with them. And so the problem is that you have these distinctions getting blurred.\nYou have people who exploit a certain climate, people who are hateful, dangerous people. This gentleman who sent bombs threatened Florida Power and Light in 2002 with an attack.\nYou have these people who well have a preexisting narrative, they will cook up this hatred, they will connect it to various other things. But then there are other Americans who support this or that political cause, who then feel as though wait a second, are you trying to silence me when I have a legitimate concern about this or that issue?\nThat further deepens the political divide. That further pits us against -- one against another. And I think it’s really important to remember, again, these public servants, these ordinary, decent people, they come in many different, shapes, sizes and colors and political convictions, so let’s keep that in mind.\nSTEPHANOPOULOS: That’s something we learn again and again and again but then that gets back to the question what responsibility to political leaders have to encourage that and not it’s opposite.\nDOWD: This is not a both sides moment. And I think anybody that -- that actually acts like this is a both sides moment (ph) -- the president has a special responsibility at times like this. I think the country out there as a whole is not as tribalized as what Washington is, doesn’t view politics the same as the president does, doesn’t access those levels of hate and -- and discourse that he does. But the president has a special responsibility.\nI’m not Michelangelo but I can paint by number. And when you put -- string together the president’s actions and you string together the president’s words and you string together all those things he’s done -- let’s not forget that what happened in Pittsburgh was because -- was -- this man was radicalized because of the language of the Hebrew Immigrant Aid Society. He was mad that refugees and immigrants were given -- were giving (ph) whatever he considered special privilege in the course of this. And let’s (ph) --\nSTEPHANOPOULOS: He referenced the caravan.\nDOWD: And let’s -- let’s also not forget that within this week the president proudly claimed himself a nationalist and proudly castigates that immigrants, the struggling families, the refugees that are walking miles and miles -- and as he does that -- not all Americans, most Americans are good people and all that -- the president -- in my view, the president has to come to terms with this and come to terms with his own responsibility in where we are as a country today.\nSALAM: Just briefly, just -- Matt, there is so much to agree with in what you’ve said but we should not lose sight of the fact that this awful villain is someone who accused the president of being part of a Jewish conspiracy. He is someone who sees the president as a globalist who is seeking to destroy the country. This is someone who is a noxious, poisonous person who believed ideas that unfortunately did not begin with one president or another. Anti-Semitism is a pervasive, dangerous threat in nations around the world.\n(CROSSTALK)\nSALAM: Let’s not lost sight of --\n(CROSSTALK)\nDOWD: Why has it -- why has it risen dramatically in the last two years? And the -- and the reason why he castigated the president, this man, was because he didn’t the president hated enough. He didn’t the president was anti-immigrant enough. That’s why he was mad at the president. He thought the president wasn’t bashing immigrants more than he -- more than he wanted.\nSALAM: Absolutely. And the fact that you have Jewish members of his administration who are absolutely central to his larger political project. He was deeply suspicious and I don’t think you can really attribute this man’s hatefulness solely to one political party or another.\nBRAZILE: We should never -- we should never do that. I mean, in 1958 a Jewish synagogue --\n(CROSSTALK)\nBRAZILE: No, no. A Jewish synagogue was --\n(CROSSTALK)\nBOSSERT: -- part of the problem.\nBRAZILE: I agree.\nBOSSERT: Pretty close (ph).\nBRAZILE: I believe the leadership is lacking. But in -- I’m a daughter of the south. This -- this -- this is a moment for us. I mean, my parents and grandparents had to come home and comfort us knowing that we were in danger just because of what we look like. A Jewish synagogue was bombed in Atlanta in 1958. Four little black girls were murdered four years ago. When is this hate going to stop? There’s been a rise in anti-Semitism, a rise in racist, violent rhetoric in our country. I don’t blame the president alone, I blame all of us.\nWe have to tone this down, take responsibility for each other, come together because our children -- what are we going to tell our children?\nJORDAN: I couldn’t agree with you more because I think one of the most dangerous things that I’m hearing when I’m out there in different states is people are saying, you know, I’m more disillusioned and upset not because of Trump. He can lie, you know, you he can spin conspiracy theories, he’s one guy who’s always done that. I’m more disillusioned because so many people are listening to him. He’s going to leave office and these people that had Trump signs in their yard are going to stay.\nThe divide is dangerously wide and when I look at my neighbors that I used to go to the store with (ph) or sit at baseball games with, now I think, you know, they’re anti-me because they’re listening to him. And this is why I think it’s so deep and dangerous --\nSTEPHANOPOULOS: And -- and -- and the attacks on the media have worked. So -- so -- but he -- the president still does have more than two years left in office at least. So Tom --\nBOSSERT: Yes.\nSTEPHANOPOULOS: -- the question to you is then what does it -- what does he do now? What does he do in this moment?\nBOSSERT: Look, you know, one of the things that troubles me about this is it just kind of furthers what everybody already thought of him. If you already thought kindly of him or gave him an open mind, you bring that to this table and if you didn’t, you don’t. Fairness to both of you. I agree, though, that there’s some commonality at this table. This shocks all of us. This shocks the president. I know him. You don’t watch this and -- and you’re not moved, right? He’s moved by the humanity of this.\nI went to the University of Pittsburgh, I know Squirrel Hill really well. These are good people.\nI’ll tell you what I think. I think it’s a really simplistic response to say complex problems of the first amendment that you heard Jeh Johnson talk about, problems of the Second Amendment that are enshrined in our constitution, that are hard to untangle in this world, against, well, let's just blame Trump.\nThe problem here is that Donna is right, this has been going for a very long time. And to have a holistic conversation about stopping hate and empowering our law enforcement with tools other than guns, which by the way they used really admirably. I'm with you on that. I'm kind of proud -- I hate to say it -- of the tactical emergency response that we saw and the casualty care that we saw, it's the reality of our world. As a homeland security advisor, we're going to have to see more of that.\nBut I don't think the president is going to be able to sustain this level of rhetoric for a very long time. He's going to go out and make his case on the border. There's going to be a vote. And the people are going to come back and decide either...\nSTEPHANOPOULOS: Well, for example he spoke last night in Illinois about you're going to be happy because he's going to announce these new emergency actions on Tuesday to close down the border. Should the president keep the focus on the caravan in the wake of what we saw yesterday?\nBOSSERT: Look, I don't tink you can stop pointing out the facts that there's an increased problem on the border. At this point facts, right, just like Mr. Greenblatt espoused earlier today. It's not him trying to incite anything, he's just pointing out that there's a 57 percent increased.\nSTEPHANOPOULOS: He called it a national emergency.\nBOSSERT: Mr. Greenblatt?\nSTEPHANOPOULOS: No, the president.\nBOSSERT: The president. At this point...\nJORDAN: He's also made people think tat they're right on the Texas border. They're 1,000 miles away.\nBRAZILE: And it's ISIS and it's fear mongering.\nBOSSERT: Look, if you don't allow for politicians in this country to go out and try to frame the issue to move policy makers to make a change, I mean that's what we do...\nJORDAN: No, it's all politics, Tom, it's all about...\nDOWD: You know the facts -- Tom, you know the facts as well as anybody about this.\nBOSSERT: Yeah.\nDOWD: And the facts are there's more of a danger in this country today from violence committed by white supremacists than radical Islam. In this country today, the facts show that. There's more of a danger of violence and crime being committed by white supremacists than by people sitting in a caravan struggling to come up here.\nBut what does the president do? We're not allocating resources to deal with all these white supremacist groups...\nBOSSERT: Matt, forgive me, just again...\nDOWD: We're sending 800 soldiers to...\nSALAM: If you look at 2015, if you look at the European migrant crisis, it was a crisis in which initially you had desperate people fleeing Syria and Iraq, but then had folks coming from Morocco, from Pakistan, from various other points, because when you have subtle shifts in enforcement policy, you can get a big cascade, you can get a very big reaction.\nThis is a serious issue. We need to talk about it calmly, dissipationately, carefully, but there is no question that the migrant caravan is a real legitimate issue. And when you have a migrant cascade...\nSTEPHANOPOULOS: Is it a national emergency?\nSALAM: Look, when you have a migrant cascade of this kind, you can actually get a political backlash, that's what we've seen in Europe since 2015, that can be a rolling emergency, George. And that's what we need to prevent.\nWe need to remember that all of us have an interest in border security, it's not about pitting one group against another. And it's true that President Trump hasn't always been as careful as he ought to be in talking about it, but there's no question that this is a real issue. And 10 years ago, you have had bipartisan agreement on this. And it troubles me that now you can't talk about this in a measured, sensible way.\nSTEPHANOPOULOS: Have Democrats figured out...\nBRAZILE: You know what troubles me? The president goes out and say Democrats are doing it, that George Soros. I mean, putting a target on Mr. Soros, a philanthropist. He cares about our country.\nHere's a man who had to flee anti-Semitism as well, his family. Let's George, let's go back to what happened in Pittsburgh. There's been a surge in violence in the Jewish community, vandalism. There's been a surge in bomb threats. There's been a surge in cemetery -- I mean, it's happening. We need to focus on it.\nSALAM: It is terrifying. It is absolutely terrifying and wrong. It is the case that there are many Americans, many prominent American whose engage in our politics. And they become targets. This, however, is not unique to George Soros, I'm sorry to say.\nJORDAN: But it is unique to have a president that is so combative and his style is attack. e boasts about, you know, I'm going to hit them, punch them 10 times harder at a time like this when we want to tamper things down.\nLook, Democrats want safe borders. Why does it have to be always the attack, the combative Trump style?\nBOSSERT: The mistrust at this point has grown to a point where I'm afraid there's not going to be any necessary reform. It as reached an emergency level. Let's not use rhetoric that justifies violence, but it's reached a level in which thousands of children are now sitting in DHS custody and HHS custody without their parents. They've been abandoned. We're sitting in places where we've got an increase of 75 percent, I think, of family units crossing the border, that's creating a problem where the laws passed in 2000 and 1965 don't match up wit the realities of Central as opposed to Mexican -- Central American as opposed to a Mexican immigrants.\nWe need a change. The president is calling for it. People distrust the president. We're not going to get change. That's where we are. That doesn't mean we can hang a mass murderer around his neck.\nSo, I want the rhetoric to be calm, but I don't think that the American viewers are looking at President Trump as a murderer.\nSTEPHANOPOULOS?: Wait (ph) …\nJORDAN: Well, we all agree …\nSTEPHANOPOULOS?: … nobody -- nobody -- no one at this table said that…\nJORDAN: … we all agree.\nSTEPHANOPOULOS?: … not a (ph) one person.\nDOWD: No, but what he is responsible for -- he is responsible for his own …\nBOSSERT: He’s responsible for the rhetoric that led to the murder.\nDOWD: No, here’s what I said, Tom …\nBRAZILE?: Answer stands apparent (ph).\nBOSSERT: Good, you’ve got to be careful (ph).\nDOWD: … and I’ll repeat it again, he is responsible for fomenting a -- and using rhetoric that causes people to feel like that is normalized. And I’m not saying he’s at all responsible for any of the incidents that happened this week, at -- at -- at all in this. But let me go back to this, yes, we need border security …\nJORDAN?: Absolutely.\nDOWD: …Yes, we need solutions to the problems. Yes, we should be welcoming to be immigrants in this country. Yes, we should be a country that deals compassionately with the refugees in this. But we as a country are not allocating resources in this country today to the problems in a -- in a priority order.\nThe biggest problem of violence in this country today is from white supremacists and we are allocating basically no money to deal with that problem, but we’re sending 800 solders to the border to deal with a problem that’s not only 1,000 miles away, but there’s been zero evidence that says these people are criminals.\nSALAM: I think you’re doing a disservice to the intelligence agencies, to those working in Homeland Security who are profoundly concerned about this. I think this is absolutely the case that you have a domestic terror threat, but here’s what I worry about that (ph) …\nDOWD: Does the president ever talk about white supremacy?\nSALAM: One thing I -- one thing I’m worried about is that in the early 1970s you had 2,500 bombings in this country. Imagine if that happened today with social media, with virality, with the tendency to match one party’s rhetoric with another party’s rhetoric. We’re constantly egging one another on rather than looking to those first responders and how they work together across that divide …\nJORDAN: Can I just say, in talking to real people and voters, you know, in Georgia, they just miss the America that they love. They’re like, who -- we are not these people. They just want someone to put to words, you know, an aspirational place to talk about things like the melting pot as opposed to kind of the -- the very combative style. I think people miss the America they know.\nSTEPHANOPOULOS: Well, we have about a week -- we have about a week to go before the election, we’ll see if we hear it over the next week. Thank you all very much.\nFBI just giving more details on the synagogue massacre, we’ll get the latest from Martha Raddatz in Pittsburgh next.\n(COMMERCIAL BREAK)\nSTEPHANOPOULOS: The FBI has just briefed in Pittsburgh with the latest on the victims. The names and ages have been released.\nI want to go back to Martha Raddatz in Pittsburgh.\nRADDATZ: And thanks George. They did release those names of those 11 killed, three women, eight men. The age range from 54 to 97 years old. The rabbi had told me earlier this morning that older people generally go to the morning services.\nThe FBI, of course, also briefed about the weapons used, Brad, a semi-automatic rifle.\nGARRETT: Right. So, the classic AR-15 apparently also had some handguns.\nAnd the problem is that when you go into a location with overwhelming firepower, even if the people inside are armed, it's such a disadvantage, because the person inside if they're armed, they are not combat trained. They're going to end up shooting themselves or somebody else and the gunman will go directly to them with an AR-15.\nSo, emotionally it's kind of -- it sounds like the right thing to do. In reality, it's not.\nRADDATZ: And – and we’ve seen attacks in churches and at the Synagogue, other places of worship, it seems like a target that these attackers are after because it’s a soft target.\nGARRETT: It’s a soft target and they also represent something to the shooter. Clearly that’s why the shooter came to this location. And it’s the same – it’s the same way – it’s true with schools, it’s – it’s true with churches, but it’s all an excuse to go harm people.\nThey just use that as a lever to go to this particular location. So, the real issue Martha is how do you ever stop these people? It’s all driven by intelligence. Maybe never would have been able to stop this guy, but he probably started to escalate in the days before this, if the police knew about it that, maybe could do something.\nRADDATZ: OK thanks so much for joining us up here in Pittsburgh, Brad. We’re going to send it back to George.\n(END VIDEO CLIP)\nSTEPHANOPOULOS: Thanks to Martha and Brad. We’ll be right back.\n(COMMERCIAL BREAK)\nThat is all for us today, thanks for sharing part of your Sunday with us. Check out WORLD NEWS TONIGHT with David Muir in Pittsburgh and I’ll see you tomorrow on GMA.","url":"https://abcnews.go.com/Politics/week-transcript-10-21-18/story?id=58803070"}
