{"authors":[],"date_download":"2018-10-30 01:18:22","date_modify":"2018-10-30 01:18:22","date_publish":"2018-07-19 00:05:59","description":null,"filename":"data/vaneerConsumption/ThisOpinionJustIn.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/Inauguration_Kettled_at_12th_and_L_NW-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862302.html","title":"This Opinion Just In…","title_page":"This Opinion Just In…The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"New York\nAs American civil discourse devolves into mob rule, the received wisdom is that Democrats and Republicans are equally to blame for verbally abusive political rhetoric, in-your-face tactics, and genuine violence. “Both sides do it,” the argument goes.\nRubbish.\nThis is like comparing a communion-wine-sipping parishioner with a street-corner drunk and saying: “See! They’re both alcoholics!” OK. Neither is a teetotaler, but only one’s actions endanger himself and others. The Right must take responsibility for its rare instances of deplorable conduct. But the Left is light years more culpable for today’s political mayhem.\nLiberals properly denounced Rep. Joe Wilson (R-SC) for shouting, “You lie!” during Obama’s September 2009 address to Congress. Some conservatives believed that Obama was a closet Kenyan. A Trump supporter at one event wore a T-shirt that read: “Tree. Rope. Journalist. Some assembly required.”\n“If you see somebody getting ready to throw a tomato, knock the crap out of them, would you?” candidate Donald J. Trump told Iowans at a February 2016 rally. “I will pay for the legal fees, I promise.”\nA handful of early Trump rallies witnessed fisticuffs between pro- and anti-Trump participants. Some Trump supporters swung first, although Project Veritas caught Democratic strategist Scott Foval of Americans United for Change saying,“We have mentally ill people that we pay to do s–t.” This included attending Trump’s events and “starting confrontations” to taunt Trumpians into violence. Foval explained: “You can message to draw them out, and draw them to punch you.”\nIn response to these failings on the Right, the Left loves to quote Michelle Obama: “When they go low, we go high.” If only. Rather: “A few of them went low, so we went highly bonkers and stayed that way.”\nJohn Nolte of Breitbart.com recently documented 352 acts of Leftist harassment and violence against Trump supporters, since September 1, 2015. His frequently updated list of news accounts, in reverse-chronological order, is chilling enough. I taxonomized his findings into five categories, each graver than the last. Beyond Nolte’s thumbnail descriptions, I also added details about these atrocities. This research confirms the revolting behavior of Leftists who hypocritically complain that President Trump and the Right are “bullies” and “fascists”:\n• At least 24 times, Trump haters have embraced violence rhetorically, including the National Catholic Reporter’s Michael Sean Winters fantasizing about Trump fans being guillotined. Former Obama State Department adviser Rosa Brooks (writing in Foreign Policy magazine) and comedienne Sarah Silverman separately urged an anti-Trump military coup.\n• Nolte records 48 instances of verbal harassment and intimidation. These include a woman on Martha’s Vineyard who announced her desire to stab liberal legal scholar Alan Dershowitz “through the heart.” Commissioner Tommy Calvert (D–Bexar County, TX) spoke of infecting Republicans’ food, to give them “Montezuma’s revenge a la Norte.” Menacing letters, mailed with a mysterious white powder, shut down the community of Rep. Karen Handel (R-GA). “Your neighbor Karen Handel is a dirty fascist c–t but I’m sure you already knew that,” the communiqué read. “Take a whiff of the powder and join her in the hospital you Bourgeoisie motherf–kers.”\n• Nolte cites 54 examples of assassination chic: expressed desires for and artistic depictions of the cold-blooded murders of President Trump, his family, staffers, and other Republicans. Actress Lea Delaria stated her wish to “pick up a baseball bat and take out every f–king republican and independent I see.” On CNN, Harvard Law professor Laurence Tribe said about Trump’s possible impeachment: “If you’re going to shoot him, you have to shoot to kill.” Perhaps most notoriously, comedian Kathy Griffin posed for photos with a bloody mock-up of Trump’s severed head — one of at least five such symbolic presidential decapitations.\nI never once saw anyone on the Right portray or advocate Obama’s beheading. As much as we condemned Obamacare and all else, assassination chic was not a thing among conservatives. Likewise, College Republicans do not silence Leftist guest speakers. Libertarians do not hound liberals out of restaurants or movie theaters.\nNebraska GOP headquarters after it was vandalized on July 3. Photo: Mackenzie Huck – Twitter.\n• Vandalism, property destruction, and arson appear 43 times in Nolte’s compendium. The GOP office in Hillsborough, North Carolina was firebombed. Republican campaign facilities in Florida, Kentucky, Nebraska, and New Hampshire suffered deliberate damage. Seventeen cars were harmed at a Maine Trump rally. A bumper sticker led a Trump follower’s truck to be set ablaze. A DHS official last month discovered a burned, decapitated animal carcass on his porch.\n• Nolte’s rap sheet contains 101 violent incidents against human beings. Pro-Trump women, kids, and seniors in California were pepper sprayed. A Trump-hater set a Trump lover’s hair on fire. Protesters knocked Rep. Dana Rohrbacher’s (R-CA) district director unconscious. Wendi Wright allegedly tried to run Rep. David Justoff (R-TN) off the road with her car for voting to repeal Obamacare. A pack of Chicago thugs kidnapped, beat, and partially scalped an 18-year-old schizophrenic while yelling, “F–k Trump!” James Hodgkinson, a Bernie Sanders campaign volunteer, gunned down a Republican congressional baseball practice in a Virginia park, nearly killing Louisiana Representative Steve Scalise.\nThe solution to this carnage is inescapable: Democrats and the Left must be crushed — metaphorically — in the mid-term elections. Hopped up on their Russian-collusion narcotic, liberals still refuse to accept that Donald J. Trump won in 2016, fair and square. The White House was Hillary Clinton’s to lose, and she lost it. Zero evidence has surfaced to prove that the Kremlin handed Trump the presidency or that Putin and Trump conspired to secure that victory. And yet Leftists let this chimera propel their deepening, darkening outrage.\nAn undisputed trouncing on November 6, with the GOP keeping Congress, and possibly gaining seats in both houses, would accomplish two vital objectives:\nFirst, after an unambiguous shellacking, Democrats at last might see that America rejects their unhinged, demented, increasingly socialist worldview. Once they finally heel, Democrats might rise from the rubble and construct a credible, positive agenda beyond “RESIST!”\nSecond, until this happens, an unmistakable pounding will keep power out of the hands of Democrats and their Leftist comrades who are turning blood-soaked political violence into America’s new normal.\nDeroy Murdock is a Manhattan-based Fox News Contributor and an emeritus media fellow with the Hoover Institution on War, Revolution and Peace at Stanford University.","url":"https://spectator.org/this-opinion-just-in/"}
