{"authors":["Wolf Richter","Wolf Street"],"date_download":"2018-10-30 23:39:53","date_modify":"2018-10-30 23:39:53","date_publish":"2018-07-17 00:00:00","description":"Trade wars are not new or uncommon for the US and trade partners — some are drawing comparisons to past US trade fights with Japan over autos. But the current trade war is different than others, especially for automakers.","filename":"data/vaneerConsumption/Thistradewarisacompletelydifferentballgamethanothers.json","image_url":"https://amp.businessinsider.com/images/5b4e37c77dd02418008b4568-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_this-trade-war-is-a-completely-different-ballgame-than-others-2018-7_1540942793.html","title":"This trade war is a completely different ballgame than others","title_page":"    This trade war is a completely different ballgame than others - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"How the US Trade War with China over autos stacks up against the Trade War the US Lost against Japan.\nSo-called \"trade wars\" are neither new nor uncommon for the US and its trade \"partners.\" The US automotive industry has seen its share, all of which the US has lost so far, though it won some skirmishes. The results are seen in this chart, which shows net imports of new passenger-vehicles into the US in dollars. This is the annual total of imports minus exports of new passenger vehicles (data via the US Trade Administration's Office of Transportation and Machinery).\nWolf Street\nOne of the big \"trade wars\" that US fought over new vehicle imports was, repeatedly, with Japan. US exports to Japan remain near zero, but as a concession to various administrations clamoring for a level playing field, or whatever, the Japanese brands have increased production in the US. Honda has done so in an exemplary manner. So that was a skirmishe the US won in the \"trade war\" with Japan's auto industry, that it lost.\nAre there parallels between the trade wars the US fought with Japan and the trade war the Trump administration is now trying to fight with China?\nAutomotive News Asia editor, Hans Greimel, in Tokyo, takes a good crack at this question in an editorial published today in Automotive New China. This \"trade war is a different ballgame,\" he says.\nAn ascendant Asian nation with a powerful domestic auto industry that brims with international ambition. A ballooning trade surplus with the U.S. And a populist American president threatening punishing tariffs in a desperate attempt to level the field. The scenario seems ripped from the pages of today's headlines. But the country in question is Japan, not China. And the president is Bill Clinton, not Donald Trump.\nClintons efforts took place in the 1990s. Japan was the second largest auto market in the world. Japanese automakers seemed \"invincible\": they were already active in the US, \"turning what was then the world's biggest auto market into their cash cow.\"\n\"Superficial similarities abound with the latest campaign launched by Trump against China. But striking differences suggest Trump's gambit might have some better leverage,\" Greimel writes.\nOne of the differences between Japan and China is that US automakers had essentially no presence, no connections, and no distribution network in Japan at the time. And lacking realistic possibilities, US automakers failed to produce vehicles for the Japanese market.\nClinton's trade war was an extension of largely failed attempts by administrations before him. He stepped it up a notch by making the unprecedented threat to levy a 100 percent tariff against 13 imported Japanese luxury car models.\n\"The ultimatum worked. To a limited degree,\" Greimel writes. After a few efforts, US automakers still failed to breach the hurdles in Japan.\nThe Japanese kept a low profile, acquiescing to US pressure when necessary — and quietly boosted exports every year. When exports became politically problematic, they simply began building cars stateside. By then, at any rate, they already had a loyal and growing following.\nChina has become the largest auto market in the world, with 24.7 million new passenger-vehicle deliveries in 2017, compared to 17.2 million deliveries in the US.\nBut \"today's brawl with Beijing is set against a different background,\" Greimel writes: \"Not a single homegrown Chinese auto brand has yet to land stateside.\"\nOne takeaway from Japan is that America's 2.5 percent tariff on passenger cars wasn't high enough. Japan exported its way to success despite the barrier. Boosting the duty to double digits, however, might just forestall a wave of Chinese imports before it begins.\nChina, which already had 15% tariffs on US vehicle imports, reacted to Trump's threatened tariffs, by jacking up its tariffs to 40%.\nYet US automakers are in some ways more insulated from such blowback than they were during the Japan trade wars. For starters, GM and Ford combined already sell millions of vehicles a year in China, as opposed to thousands in Japan. Most of those vehicles are built in China, ducking the duties. Detroit brands have sophisticated and well-entrenched retail networks in China. And they have massive R&D centers in the country to ensure that their products meet local needs. The quality and engineering of the American-branded products are arguably its best ever. Chinese customers aren't turning up their noses, as the Japanese did and still do. In Japan, they were always struggling to break their way in. In China, American brands are already on the inside and thriving.\n\"Now the US has the chance to keep Chinese hopefuls at bay,\" Greimel writes. \"That could be a key leverage point.\"\nBeijing hasn't been shy in voicing its overseas ambitions. Chinese President Xi Jinping's Made in China 2025 campaign prioritizes global domination in several key next-generation automotive fields. And a slew of Chinese automakers, from upstart electric vehicle makers to established state-owned players, are brandishing plans to crack the US market as early as next year. GAC Motor, angling to become the first Chinese automaker to export to the US, has already said it may have to ice those plans after Trump's threat to slam imports with tariffs. A big risk is how China could hit back beyond cars and tariffs. Indeed, China's countermeasures — affecting $34 billion in American goods — target everything from auto parts to soybeans. Beijing might also hold businesses hostage through regulatory shenanigans. And China has some non-tariff tricks that could directly hammer American carmakers. Ticked-off mandarins could marshal the state-controlled media to whip up an anti-American backlash inside China against Buick, Cadillac, Ford and Jeep.\nWhich China has done with great success against Japanese automakers in 2012 and with the Korean automakers in 2016, to accomplish some political purposes, not trade purposes.\nBut as \"Washington locks horns with a new automotive heavyweight,\" Greimel writes, \"important dynamics are also dramatically different.\"","url":"https://www.businessinsider.com/this-trade-war-is-a-completely-different-ballgame-than-others-2018-7"}
