{"authors":["Allison Berry"],"date_download":"2018-10-31 01:45:01","date_modify":"2018-10-31 01:45:01","date_publish":"2018-09-14 15:13:21","description":"After two and a half years of dating, my partner and I took the leap and officially moved in together at the beginning of this year. Even though he had been ready to do so for a while, the decision wasn't as simple for me. In my mind, I had to make…","filename":"data/vaneerConsumption/ThisNewStudyProvesWomenAndMenThinkAboutMoneyDifferentlyHeresWhyThatsImportant.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/12/5a6a67e0-ec47-4cc3-8b45-e8c4e364b80d-fotolia_207451177_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_this-new-study-proves-women-men-think-about-money-differently-heres-why-thats-important-9858166_1540950301.html","title":"This New Study Proves Women And Men Think About Money Differently, & Here's Why That's Important","title_page":"This New Study Proves Women And Men Think About Money Differently, & Here's Why That's Important","title_rss":"NULL","source_domain":"bustle.com","text":"After two and a half years of dating, my partner and I took the leap and officially moved in together at the beginning of this year. Even though he had been ready to do so for a while, the decision wasn't as simple for me. In my mind, I had to make sure I was both emotionally and mentally prepared for a step as big as moving in with my significant other — a fact I spent no less than a year discussing with my girlfriends.\nThroughout these conversations, my confidence grew as my friends applauded the fact that I was looking after my own well-being before making such a big decision. But now, six months into living with my boyfriend, I regret that none of those dozens of conversations brought up the issue of being financially prepared to move in together. My partner and I are arguing more than ever about how to split grocery bills, when to take cabs, and even when to run the air conditioner during balmy summer days — all topics that would have been smart to bring up prior to merging our lives.\nThis isn't to say that I blame my friends, my boyfriend, or myself for not bringing any of this up; studies prove that millennial women's reluctance to discuss finances is extremely common. A recent Lieberman Research Worldwide national survey commissioned by Visa found that millennial women are around two times more likely to talk to our friends about relationships, work, and kids than money-related topics. That research (see a summary here) also uncovered some encouraging insights about how millennial women's attitudes about money are evolving, plus a few telling learnings that prove we've got a long way to go.\nTo highlight just a few of the ways that women are taking charge in 2018, Bustle partnered with Visa to help launch the \"Money Is Changing\" initiative, which is all about encouraging an honest, judgment-free conversation surrounding millennial women and money. Read on to learn the amazing ways we're reshaping the conversation compared to the generations before us, and the surprising ways we're still holding onto traditional gender roles.\nMillennial Women Are Changing Rules Around Paying For Dates\nMary Rabun/Bustle\nIt's no secret that dating norms are gendered. Case in point: Even after three years together, my boyfriend still insists on picking up the check during our nights out despite our comparable salaries, and the Visa commissioned study found that my dynamic with my partner may someday be in the minority. A key insight from their research found that millennials are two times more likely than Generation X to split the bill on the first date, and only 43 percent of millennial women expect men to pay on the first date while 60 percent of millennial men do.\nAnd They're Reshaping Household Finances\nMary Rabun/Bustle\nI was surprised to read that the research commissioned by Visa found when it comes to marriage and family, gender roles are continuing to hold strong with millennial women taking on a majority of household responsibilities. However, there are quite a few findings that signal a major shift. First, millennial women are less willing to share bank accounts with their partners, and we're also becoming less likely to sacrifice our lifestyle for having kids. They may sound like two small victories, but they each point to a future where women are comfortable looking out for their own needs, no matter their relationship status.\nNot To Mention, Millennial Women Are More Driven And Career-Focused Than Ever\nMary Rabun/Bustle\nFor years, business news has been dominated by headlines about the lack of female CEOs, but our generation seems determined to change this. Visa's commissioned research found that an impressive 61 percent of millennial women are focused on reaching the top, and not only that: Almost half of millennial women say making money is their priority. This signals a much-needed shift away from the days of being paid less while being asked for more, and toward equal pay and representation within the workforce.\nThey're Also More Likely To Ask For A Raise — And Doing More Research\nMary Rabun/Bustle\nAccording to the research commissioned by Visa, only 34 percent of millennial women have negotiated for a raise — but we're actually more likely to ask for and receive a raise or promotion than women in the generation before us. Plus, when millennial women do ask, they're more likely than men to come into the meeting prepared with research and advice from peers — suggesting yet another way in which women are redefining money for our generation.\nAnd They're Demanding More Salary Transparency\nMary Rabun/Bustle\nIf you still think talking money is taboo, you're not going to like this one: A key insight from Visa's commissioned study found that 36 percent of millennial women believe salary should be completely transparent, with a separate 48 percent admitting to wanting to know what their coworkers make. My hunch? We're not asking because we're gossiping or nosy; we're asking because we're demanding to know our worth, and be compensated for it.\nThe big takeaway? Personally, I feel so proud to read about millennial women pushing the financial boundaries. We're making major strides, and clearly having judgment-free, honest conversations about money with one another is starting to pay off in a big way. If we keep being open about our finances and eliminate the judgement that surrounds talking about money, the payoff will be even more impressive.\nThis post is sponsored by Visa.","url":"https://www.bustle.com/p/this-new-study-proves-women-men-think-about-money-differently-heres-why-thats-important-9858166"}
