{"authors":["Lucy Crossley For Mailonline"],"date_download":"2018-10-22 23:24:25","date_modify":"2018-10-22 23:24:25","date_publish":"2016-01-29 11:09:31","description":"Thomas Ormsby, 18, from Scunthorpe, Lincolnshire, was sentenced to four months behind bars after posting the clip online so that his former partner would suffer 'as much pain as possible'.","filename":"data/vaneerConsumption/ThomasOrmsbyjailedforpostingrevengepornvideoonFacebook.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B17D1200000578-0-image-a-2_1454065133108.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422518_Teenage-wannabe-rapper-jailed-posting-revenge-porn-video-Facebook-having-sex-ex-girlfriend-distressed-suffered-problems-pregnancy_1540250665.html","title":"Thomas Ormsby jailed for posting revenge porn video on Facebook","title_page":"Thomas Ormsby jailed for posting revenge porn video on Facebook | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An aspiring rapper who posted a video to Facebook of him having sex with his ex-girlfriend and left her so distressed that she suffered problems with her pregnancy has been jailed.\nThomas Ormsby, 18, from Scunthorpe, Lincolnshire, was sentenced to four months behind bars after posting the clip online so that his former partner would suffer 'as much pain as possible'.\nHull Magistrates' Court was told that by the time the video was posted, the woman was carrying Ormsby's child, and the stress caused her to experience complications with the pregnancy, as well as having suicidal thoughts.\nWannabe rapper Thomas Ormsby, (pictured) who posted a video to Facebook of him having sex with his ex-girlfriend and left her so distressed that she suffered problems with her pregancy, has been jailed\nAs well as his jail sentence, Ormsby was banned from contacting the victim in any way and made to pay an £80 victim surcharge after he admitted disclosing private sexual photographs and films with intent to cause distress.\n'This was a nasty offence,' John Owston, prosecuting, told the court.\n'The young lady in her victim statement draws attention to the fact that, at the time, she wasn't confident of her body and that exacerbated the shame she felt, especially as it was shown for all to see.\n'Because of the video, she suffered with her health and at some stage felt suicidal thoughts.\nOrmsby was banned from contacting the victim in any way and made to pay an £80 victim surcharge\n'The victim also became pregnant to the defendant and because of the stress caused, there were problems with the pregnancy.\n'She is adamant a restraining order is put in place.'\nThe college student's reason for posting the video was not given in court.\nAndrew Robinson, mitigating, said although the offence was 'very serious', Ormsby had shown remorse for his actions.\n'He has also made full admissions when interviewed by the police,' Mr Robinson said.\n'He is a young man who has never committed this type of offence before.'\nSentencing Ormsby, District Judge Frederick Rutherford said his actions had been vile and disgusting.\n'This matter before the court is an extremely serious one,' he said.\n'When you did what you did, and until Facebook decided to take the video down, you had no feelings whatsoever as regards to the effects it would have.\n'You would have intended to cause as much pain as possible, without any care in the world for that young lady.\n'I've heard all about your problems, but it's the effect it would have had on her because of your vile act we need to think about.'\nOrmsby was also ordered to pay an £80 victim surcharge.\nThe new law to protect victims of 'revenge porn' was introduced in April of last year under the Criminal Justice and Courts Act.\nIt is aimed at tackling the growing issue of partners or former partners posting explicit images of their victim on social media.\nThe law defines revenge porn as 'photographs or films which show people engaged in sexual activity or depicted in a sexual way or with their genitals exposed, where what is shown would not usually be seen in public' and which are distributed without the person's permission and with intent to cause harm or distress.\nCampaigners who fought for the law called it a huge step forward for victims who suffered at the hands of vengeful ex-partners.","url":"https://www.dailymail.co.uk/news/article-3422518/Teenage-wannabe-rapper-jailed-posting-revenge-porn-video-Facebook-having-sex-ex-girlfriend-distressed-suffered-problems-pregnancy.html"}
