{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:48:39","date_modify":"2018-10-30 21:48:39","date_publish":"2014-12-23 18:54:54","description":"In his column on Tuesday, author Thomas Sowell highlighted the political union of New York City Mayor Bill de Blasio and community agitator Al Sharpton in |","filename":"data/vaneerConsumption/ThomasSowellAlSharptonsTrailofSlime.json","image_url":"https://media.breitbart.com/media/2014/12/Screen-Shot-2014-12-23-at-12.53.24-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_12_23__1540936119.html","title":"Thomas Sowell: Al Sharpton’s ‘Trail of Slime’","title_page":"Thomas Sowell: Al Sharpton’s ‘Trail of Slime’","title_rss":"NULL","source_domain":"breitbart.com","text":"In his column on Tuesday, author Thomas Sowell highlighted the political union of New York City Mayor Bill de Blasio and community agitator Al Sharpton in the wake of the murder of two city police officers while they sat in their car.\n“Mayor de Blasio has made anti-police comments with Al Sharpton seated at his side,” Sowell commented.\n“This is the same Al Sharpton with a trail of slime going back more than a quarter of a century,” he continued, “during which he has whipped up mobs and fomented race hatred from the days of the Tawana Brawley ‘rape’ hoax of 1987 to the Duke University ‘rape’ hoax of 2006 and the Ferguson riots of 2014.”\nSowell recommended that de Blasio show some “residual decency,” by not “defiling” the funerals of the officers killed in cold blood.\n“No politician in the country has done more to play the race card against the police and spread the notion that cops are the big problem in minority communities,” than de Blasio, wrote Sowell, who also observed the fact that the two slain officers were members of minority groups themselves has hardly been mentioned in the mainstream media.\nSowell also placed President Barack Obama and Attorney General Eric Holder in the category of the “gullible” who fall to the media’s portrait of the “romantic tale” of poor blacks vs. white police officers. Obama and Holder, he said, are among “blacks who don’t know what they are talking about…because they never grew up in a ghetto.”\nSlamming those who have whipped up the notion that “ghetto social problems,” or “social degeneracy,” has arisen from “a legacy of slavery,” Sowell wrote this politically driven link “is an excuse for the ideology of the intelligentsia behind the social policies that promoted this degeneracy.”\nPlaying the race card is a dangerous game, states Sowell.\n“It can ruin us all,” he adds.","url":"https://www.breitbart.com/border/2014/12/23/thomas-sowell-al-sharptons-trail-of-slime/"}
