{"authors":[],"date_download":"2018-10-22 20:35:07","date_modify":"2018-10-22 20:35:07","date_publish":"2014-06-02 14:11:28","description":"Author of \"Capital in the Twenty-First Century,\" says the gap between \"the haves and have-nots\" is going to back to levels not seen in 100 years.","filename":"data/vaneerConsumption/ThomasPikettyFedInducedGrowthHasHarmedthe99.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/481306/140602-piketty_1009_7a8e54a714ebb9efb5f765689d9860aa.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_economy_thomas-piketty-fed-induced-growth-has-harmed-99-n120231_1540240507.html","title":"Thomas Piketty: Fed-Induced Growth Has Harmed the 99%","title_page":"Thomas Piketty: Fed-Induced Growth Has Harmed the 99%","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nJump-starting economic growth has relied too much on the Federal Reserve and not enough on fiscal policy, said French economist Thomas Piketty, author of the book on wealth inequality \"Capital in the Twenty-First Century.\"\n\"Those who are gaining from all this printing of money are not the people that you'd like to gain,\" Piketty said Monday on CNBC. \"You certainly need to ask more of these top income groups who got between two-thirds and three-quarters of aggregate income growth over the past 30 years in this country.\"\nIn the interview on CNBC's \"Squawk Box,\" he did acknowledge the important role the Fed, and central banks around the world, played in preventing a complete collapse of the financial system following the 2008 crisis. \"[But] we've been asking too much of creative monetary policy.\"\n\"If you have a progressive tax on income and wealth, you have a better sense of who's paying,\" Piketty continued. \"And you have a better sense of where the money is going, and whether you have an equitable distribution of the burden.\"\n\"If the growth performance of the U.S. economy had been exceptional, you know, 4 percent growth rate, 5 percent growth rate, then it would be OK. Everybody would get something,\" he said.\n\"But if you have relatively mediocre growth performance … and three-quarters of [the wealth] gets to the top, it's not a good deal for the middle class and the rest of the population.\"\nPiketty said his research shows that the gap between \"the haves and have-nots\" is going to back to levels not seen in 100 years. In the book, he also propose a host of policy changes to combat the problem, including an international wealth tax.\nWhile highly acclaimed, \"Capital in the Twenty-First Century,\" has also been a lightning-rod for critics. The Financial Times said it conducted an investigation into Piketty's data and found problems, including unexplained entries in the author's spreadsheets, cherry-picking of sources, and transcription errors.\nPiketty has defended his work since the FT report surfaced last week.","url":"https://www.nbcnews.com/business/economy/thomas-piketty-fed-induced-growth-has-harmed-99-n120231"}
