{"authors":["Pamela Barbaglia","Guy Faulconbridge"],"date_download":"2018-10-30 20:34:42","date_modify":"2018-10-30 20:34:42","date_publish":"2016-12-30 00:00:00","description":"The biggest deal was Softbank's $30.7 billion move for ARM Holdings, which came shortly after the Brexit vote.","filename":"data/vaneerConsumption/ThomsonReutersdatashowsBritishMAheldsteadyin2016postBrexit.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_thomson-reuters-data-british-m-and-a-merger-acquisition-steady-2016-post-brexit-2016-12_1540931682.html","title":"Thomson Reuters data shows British M&A held steady in 2016 post-Brexit","title_page":"    Thomson Reuters data shows British M&A held steady in 2016 post-Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"SoftBank Chairman and CEO Masayoshi Son made a swoop for Britain's ARM Holdings shortly after the Brexit vote. REUTERS/Kim Kyung-Hoon LONDON (Reuters) - Britain avoided a collapse in mergers and acquisitions activity after the shock Brexit vote as foreign companies used sterling's spectacular devaluation against the US dollar to snap up British companies, Thomson Reuters data shows.\nBritish M&A totalled $177.5 billion (£144.5 billion) in 2016, down sharply from the record $394.8 billion (£321.5 billion) reached in 2015 - a year when the UK data was skewed by two of the three biggest global deals - but was in line with the longer 5-year trend.\nTotal annual mergers and acquisitions values averaged $139.3 billion (£113.4 billion) for the five years to the start of 2015. Britain also retained its place as the third-largest M&A market after the United States and China.\nBehind the headline numbers, there was another clear trend: foreign buyers - such as Rupert Murdoch's Twenty-First Century Fox - shopping with dollars for bargains while domestic UK-to-UK dealmaking fell off sharply.\n\"Brexit should never have been talked up as an Armageddon moment for UK M&A, especially with such a sharp devaluation in the currency which has clearly been a stimulus for overseas buyers,\" Tim Gee, London-based M&A partner at law firm Baker & McKenzie, told Reuters.\nOn the day of the vote, sterling traded above $1.50 but is now trading below $1.23 and fell below $1.15 at one point in October.\n\"Much of the activity in 2016 was skewed toward foreign buyers with less UK-to-UK activity,\" Gee said. \"Total activity levels were not really knocked that much by Brexit but who was doing the buying did shift - deal values in 2016 are very similar to the historical trend.\"\nThe worst predictions surrounding Brexit and its potential impact on our economy have so far failed to materialize - Derek Shakespeare, co-head of UK M&A at Barclays\nInbound M&A was $143.7 billion (£117 billion), again down from 2015 but way above the $85.9 billion (£69.9 billion) annual average for the 5 years to 2015, while domestic M&A was $33.7 billion (£27.4 billion), down from an average of $53.4 billion (£43.5 billion) over the same period.\nThere were just 1,355 domestic deals - the lowest figure in nearly two decades of Thomson Reuters data.\n2015 was a record year for dealmaking involving UK-listed companies thanks to a series of jumbo deals including Anheuser-Busch Inbev's $110.3 billion (£89.8 billion) acquisition of SABMiller and Shell's $53 billion (£43.1 billion) merger with BG Group.\nWhile opponents of leaving the EU had warned that the United Kingdom's economy would stall and investment stop if voters opted to exit, the data since the Brexit vote has shown the economy was resilient.\nJust a week after Theresa May entered Downing Street to replace David Cameron as British prime minister, Softbank founder Masayoshi Son made a $30.7 billion (£25 billion) move for UK-based chip designer ARM Holdings.\n\"I am one of the first people to bet with a big size on the UK after Brexit,\" Son, who is ranked by Forbes as Japan's second-richest man with a $14.9 billion (£12.1 billion) fortune, told reporters in London at the time. \"Talking is easy. I am proving it . . . This is my big bet.\"\nThe second biggest deal of the year was struck by Murdoch: a $14.6 billion (£11.8 billion) deal to buy European pay-TV firm Sky. People familiar with the matter told Reuters the American media corporation pounced after the Brexit vote sent the pound down against the US dollar and Sky's share price tumbling.\n\"The worst predictions surrounding Brexit and its potential impact on our economy have so far failed to materialize,\" Derek Shakespeare, co-head of UK M&A at Barclays, told Reuters. \"With the weaker pound UK businesses have become 10 to 20 percent cheaper.\"\nRupert Murdoch, Executive Chairman News Corp and Chairman and CEO 21st Century Fox. REUTERS/Lucy Nicholson \"But the devil is in the detail: we have several years ahead of us to understand what the trading relationship with the EU will look like. So there's a degree of caution when looking at transactions in Britain,\" he said.\nGoldman Sachs, the world's top dealmaker, was top again in Britain's league tables, followed by JPMorgan, and Lazard, which rose to third place in Britain above Deutsche Bank, UBS, Centerview Partners LLC and Morgan Stanley, Thomson Reuters data showed.\n\"Geopolitical events such as Brexit have impacted CEO confidence for deal-making over the first part of the year and through the summer,\" said Gilberto Pozzi, co-head of global M&A at Goldman Sachs.\n\"We are now seeing a rebound in M&A activity although boards remain quite cautious in reviewing the opportunities and the pros and cons of M&A transactions,\" Pozzi said.\nSo what will happen in 2017? Baker & McKenzie's Gee said he expected low levels of activity among financial institutions and basic materials, resources and commodities while M&A hot spots would include technology, innovation and healthcare.\n\"It will be a mildly better performance next year than this years with overall uptick in deal value,\" Gee said. \"There is a limit to how long you can sit on your hands.\"\n\"Investment coming into the UK is down amid uncertainty around Brexit and that uncertainty will linger into next year,\" said Dwayne Lysaght, head of UK M&A at JP Morgan. \"That said, I think uncertainty is becoming the new norm, and the fundamentals for dealmaking remain intact.\"","url":"https://www.businessinsider.com/thomson-reuters-data-british-m-and-a-merger-acquisition-steady-2016-post-brexit-2016-12"}
