{"authors":[],"date_download":"2018-10-22 21:23:07","date_modify":"2018-10-22 21:23:07","date_publish":"2014-05-07 01:35:15","description":"Thom Tillis captured the NC nomination to oppose imperiled Democratic Sen. Kay Hagan Tuesday night, overcoming anti-establishment rivals.","filename":"data/vaneerConsumption/ThomTillisWinsNorthCarolinaGOPSenateNomination.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/425191/140506-thom-tillis-jms-2304_f1a3456a1c68c6401be453936f2abbab.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_thom-tillis-wins-north-carolina-gop-senate-nomination-n98836_1540243387.html","title":"Thom Tillis Wins North Carolina GOP Senate Nomination","title_page":"Thom Tillis Wins North Carolina GOP Senate Nomination","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNorth Carolina House Speaker Thom Tillis captured the nomination to oppose imperiled Democratic Sen. Kay Hagan Tuesday night, overcoming anti-establishment rivals by a comfortable margin in the first of a springtime spate of primaries testing the strength of a tea party movement that first rocked the Republican party four years ago.\nTuesday marked the beginning of the political primary season in earnest, and over the next several months Republicans will hold numerous contests featuring incumbents or other establishment figures against tea party challengers. Some of the races are in states where the identity of the party's candidate might mean the difference between victory and defeat this fall, such as Alaska, Georgia, Iowa and Kentucky. In other areas, it will matter less, including Kansas, Mississippi, Nebraska, Oklahoma and South Carolina.\nIn the marquee race of the night, Tillis and a pair of political novices, newcomers, obstetrician Greg Brannon and Mark Harris, a Baptist pastor, led a field of eight candidates vying for the right to take on Hagan, a top target for Republicans angling for control of the Senate in the fall.\nTillis ran as a conservative with the support of the U.S. Chamber of Commerce, the National Right to Life Committee and former presidential candidate Mitt Romney, while Brannon had the backing of Sen Rand Paul of Kentucky, a tea party favorite. Harris countered with former Arkansas Gov. Mike Huckabee, whose popularity with evangelical voters briefly made him a force in the race for the 2008 presidential nomination.\nIf Republican Party leaders preferred Tillis, Democrats seemed to want anyone but him, or at a minimum, a runoff that would require Republicans to battle one another into midsummer.","url":"https://www.nbcnews.com/politics/congress/thom-tillis-wins-north-carolina-gop-senate-nomination-n98836"}
