{"authors":[],"date_download":"2018-10-22 21:09:21","date_modify":"2018-10-22 21:09:21","date_publish":"2014-11-23 00:00:00","description":"Folk heroes Richard and Linda Thompson split up, creatively and romantically, in the early 1980s. Now their son Teddy has brought them together — along with other family members — for a new album.","filename":"data/vaneerConsumption/ThompsonFamilysMusicalSweaterSmellsFunnyLotOfPersonality.json","image_url":"https://media.npr.org/assets/img/2014/11/21/thompson-family_photo-credit-linda-thompson_general-3_wide-0eb05958d42d0126b6e3f18eba75d42b4541557e.jpeg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2014_11_23_365763525_thompson-familys-musical-sweater-smells-funny-lot-of-personality_1540242561.html","title":"Thompson Family's Musical Sweater: 'Smells Funny, Lot Of Personality'","title_page":"Thompson Family's Musical Sweater: 'Smells Funny, Lot Of Personality' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Thompson Family's Musical Sweater: 'Smells Funny, Lot Of Personality'\nEnlarge this image toggle caption Linda Thompson/Courtesy of the artist Linda Thompson/Courtesy of the artist\nIn 1982, the beloved British folk duo Richard and Linda Thompson split up — both creatively and romantically.\nEver since, fans have longed for their reunion, including one fan in particular: their son, Teddy.\nTeddy was just a boy back then. Now he's 38, with a recording career of his own, and he's brought together about a dozen musical members of the extended Thompson clan — including Richard and Linda, though they rarely appear in the same song — for a new album called \"Family.\"\nTeddy Thompson and his father, Richard Thompson, told guest host Tess Vigeland that the project turned out to be slightly more complex than anyone in the family had expected.\nClick the audio link to hear their full conversation, which touches on why technology enabled this project, how Teddy's therapist reacted and whether plumbers date other plumbers — and, of course, includes samples of songs from the the new album.\nInterview Highlights:\nOn how the album resembles a sweater, metaphorically\nRichard: It's like an enormous cardigan with eight holes for heads [that] you knit everyone into.\nTeddy: Yes, a musical family heirloom sweater. It smells funny but it's got a lot of personality. That's how we'd like you to think of the album.\nOn what it was like for Teddy Thompson to have control over the music of his parents\nTeddy: There's nothing so satisfying as erasing your parents. How's that for an Oedipal moment? ... When I was a kid, you feel sort of out-of-control ... when your parents split up. So there was something about being in control of this which was enormously satisfying.\nRichard: But Teddy, it's over now. The record's finished. ... We're going back to normal now.\nOn not wanting this album to appear like a musical reunion between Richard and Linda Thompson\nRichard: It wasn't a conscious decision. People sometimes have that expectation, and I don't think that's something we want to do. We don't want to perform again together. Linda has a lot of problems with her voice anyway, and that really nips it in the bud. So people should not have that expectation.\nOn Linda Thompson's ongoing struggle with spasmodic dysphonia, which mostly robs her of her singing voice\nTeddy: She's fine. It's just something she's living with. It's getting a little bit worse with age, but it's not terrible for her everyday life. It's just frustrating because she can't sing. She's sort of resigned to not singing live anymore. But she can still sing in the studio. It takes a bit more time and it's a bit more hit-and-miss, so I think that's some modicum of satisfaction.","url":"https://www.npr.org/2014/11/23/365763525/thompson-familys-musical-sweater-smells-funny-lot-of-personality"}
