{"authors":["Sam Tonkin For Mailonline"],"date_download":"2018-10-23 01:00:23","date_modify":"2018-10-23 01:00:23","date_publish":"2016-01-11 11:16:43","description":"Anthony and Angela McIntyre had spent £8,400 on having the 20 panels installed on their roof three years before their home in Thornbury, Gloucestershire, was destroyed by a huge fire.","filename":"data/vaneerConsumption/Thornburyhomeisguttedbyfiretriggeredbyfaultysolarpanelsontheroof.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/300A14B000000578-0-image-a-2_1452514610788.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393676_Family-s-four-bedroom-400-000-home-gutted-fire-triggered-faulty-solar-panels-roof_1540256423.html","title":"Thornbury home is gutted by fire triggered by faulty solar panels on the roof","title_page":"Thornbury home is gutted by fire triggered by faulty solar panels on the roof  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fire tore through a family's £400,000 home and gutted most of the four-bedroom property following a blaze triggered by faulty solar panels, an investigation has revealed.\nAnthony and Angela McIntyre had spent £8,400 on having the 20 panels installed on their roof three years ago but their home was destroyed when a fireball ripped through it.\nThe blaze started as the couple's youngest daughter Chloe, 15, was lying in bed asleep - with Mr McIntyre having to dash inside the house to wake her and get her out.\nWrecked: An investigation has revealed that faulty solar panels were to blame for a fire which tore through the £400,000 home of Anthony and Angela McIntyre (pictured). The couple spent £8,400 having the panels installed\nGutted: Mr and Mrs McIntyre had installed the panels on their roof three years before fire destroyed their home\nThe family then watched from their garden as the flames took hold and left the house in Thornbury, Gloucestershire, a smouldering wreck.\nThe couple and daughters Chloe and Sophie, 19, are still in rented accommodation following the fire in August while their home is being rebuilt at a cost of up to £200,000.\nThe cost is being met by insurers but the family are frustrated at the time it is taking.\nMr McIntyre, 51, a production technician at Oldbury nuclear power station, said: 'My wife was around and our youngest daughter was still in bed.\n'Angela said she was going to put some washing out and she came downstairs and said someone was having a bonfire in the back garden.\n'I thought \"no way\" and looked out the window and saw smoke. It was then I realised it was coming from our house.\nRuined: The blaze started as the couple's youngest daughter Chloe, 15, was lying in bed asleep - with Mr McIntyre having to dash inside the house to wake her and get her out. This image shows the fire's aftermath\nBefore the fire: The panels (pictured) were installed by Cardiff-based PV Solar, which went bust months later\nThe insurance company later identified the cause of the blaze to be a faulty inverter in the loft. It was not clear whether it was a faulty unit or faulty connection. This picture shows the damage done to the family's bathroom\n'I couldn't believe how much smoke was coming out of the roof - it was well on fire.\n'I had no idea what it could have been at the time - I was only interested in getting my daughter.'\nThe insurance company later identified the cause of the blaze to be a faulty inverter in the loft. It followed an inspection by the criminal investigation unit.\nIt was not clear whether it was a faulty unit or faulty connection.\nAn inverter switches electrical current from AC to DC so it can be used in a stand-alone power system. The panels were installed by Cardiff-based PV Solar which went bust months later.\nThe family spent six weeks living in a hotel before moving into rented accommodation while their house underwent repairs.\nDestroyed: The family spent six weeks living in a hotel before moving into their rented accommodation while their house underwent repairs. The blaze broke out in the loft due to a fault with the inverter\nAvon and Fire Rescue Service said fires involving solar panels are rare but that people should make sure qualified installers are hired. This picture shows the aftermath of the fire that tore through the McIntyres' home\nThis is how the roof of the family's home looked after the fire. But Mr McIntyre still wants to re-fit solar panels\nMICROWAVE FIRE: MOTHER WARNS NOT TO LEAVE APPLIANCES PLUGGED IN A mother and her four children have been left homeless after a microwave fire ravaged their end-terrace council property and destroyed all their possessions. Kat Bailey from Leeds, West Yorkshire, had used the microwave at 4am on Monday to warm some milk for her son. But hours later, despite it not being in use, the appliance caught fire while no one was at home. The 31-year-old received a phone call from a neighbour at midday and got home to find all of the windows shattered and firemen fumigating the property, having put out the fire. Kat Bailey and her four children have been left homeless after a microwave fire ravaged their house The entire kitchen had been engulfed in flames and the rest of the property suffered severe smoke damage, destroying furniture, toys and clothing and leaving the family homeless. Ms Bailey has now shared devastating pictures of the damage as a warning to others of what leaving electrical plugged in can do. The full-time mother, who had lived in the house for seven years, said: 'I am still in shock at what’s happened but it’s just a relief that we weren’t at home at the time. If it had happened a few hours earlier, we might have been sleeping in bed. 'We’d gone out for the morning and the fire service said it was probably 15 minutes after we left the house that the fire started. Aftermath: The entire kitchen (pictured) had been engulfed in flames and the rest of the property suffered severe smoke damage, destroying furniture, toys and clothing and leaving the family homeless. Ms Bailey shared pictures of the damage as a warning to others of what leaving electrical plugged in can do She said firefighters had told her 'it’s actually quite common for microwaves and TVs to go up in flames'. The outside of the property is pictured. The family will have to wait six weeks before moving into another home 'The damage has been devastating and almost everything we own is ruined, so we’ve been having bonfires in the garden to get rid of old curtains and fabric sofas. 'It’s so hard to believe this was caused just by leaving the microwave plugged in - I hope other people will learn from this and leave theirs unplugged. 'It’s turned our lives upside down but we have to be grateful no-one was hurt.' She said firefighters had told her 'it’s actually quite common for microwaves and TVs to go up in flames'. The family will now have to wait around six weeks before moving into another home A spokesman for West Yorkshire Fire Service said: 'The most likely cause of the fire is recorded as an electrical fault in the microwave.'\nDespite the fire, Mr McIntyre said he was still planning to re-fit solar panels at his home.\nHe added: 'I'm having them put back on.\n'All the electrical work will be in the garage and it will have heat detectors and smoke detectors.\n'It's made the wife and children a bit worried about having them back but they are coming round to the idea.'\nMr McIntyre is paid around £2,200 a year by npower to have the solar panels on his roof and saves another £300 on his electricity bill.\nAvon and Fire Rescue Service said fires involving solar panels are rare but that people should make sure qualified installers are hired.\nAccording to the latest figures from the Office of National Statistics, there were 8,531 accidental fires caused by faulty electrical equipment in 2011/12.","url":"https://www.dailymail.co.uk/news/article-3393676/Family-s-four-bedroom-400-000-home-gutted-fire-triggered-faulty-solar-panels-roof.html"}
