{"authors":[],"date_download":"2018-10-30 01:12:42","date_modify":"2018-10-30 01:12:42","date_publish":"2016-04-13 00:00:00","description":null,"filename":"data/vaneerConsumption/ThoseNewYorkstateofmindvalues.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_04_those_new_york_state_of_mind_values_1540861962.html","title":"Those New York 'state of mind values'","title_page":"Those New York 'state of mind values'","title_rss":"NULL","source_domain":"americanthinker.com","text":"Well, okay, that makes sense, as Cruz is a conservative Republican and New York City and State are quite Democratic. The Cruz critics' condemnations thus seem more of a reflection of their thinking rather than what Cruz actually said or thought, as the following examples of public New York values seem to demonstrate.\nSo Donald Trump , Geraldo Rivera , and others are criticizing Republican presidential contender Ted Cruz for commenting on New York values. Replying, Cruz contends he meant “that the term refers to the state’s socially and politically liberal leanings ” and its “socially liberal, pro-gay marriage, pro-abortion, focused on money and the media.”\nLiberal New Yorkers, especially those in government, apparently think it is perfectly fine to mock minorities in all good fun as long as they proclaim their belief in diversity.\nDuring Inner Circle's annual event in New York City that includes musical and comedy performances by local politicians and reporters, Clinton made a surprise cameo during a scripted scene with de Blasio and Leslie Odom Jr., who plays Aaron Burr in the Broadway show “Hamilton.” Clinton joked with de Blasio about how long it took him to endorse her for president, to which the New York City mayor (and Clinton's former Senate campaign manager) quipped back, “Sorry, Hillary. I was running on CP time.\" The remark is an apparent reference to colored people time -- a phrase sometimes used as a stereotypical reference to black people supposedly being late to everything. [Bold added.] In a video of the skit, released by the mayor's office on Sunday night, the audience appears to laugh awkwardly at the remark. One man in the crowd can be heard shouting, “No!\" \"That’s not -- I don’t, I don’t like jokes like that, Bill,” Odom, who is African-American, said. Clinton then interjected. “Cautious politician time,\" she explained. “I’ve been there.” De Blasio, whose wife is black, explained the joke during an interview on CNN on Monday night. \"It was clearly a staged show. It was a scripted show. The whole idea was to do the counter-intuitive by saying cautious politician time. Every actor thought it was a joke on a different convention. That was the whole idea,\" he said. \"I think people are missing the point here.\"\nOf course, de Blasio, a liberal white New Yorker, can't be prejudiced, because some of his best wives are black, and he is against police brutality against black criminals, and he's a liberal in New York, and...\nCan you imagine the uproar if a Republican had jokingly referred to \"colored peoples time\"?\nMeanwhile, the investigation into New York City's alleged police corruption and alleged corrupt de Blasio political fundraising continues.\nWell, okay, police corruption and political fundraising corruption aren't confined to any one party or any one city or state, but Democrats, including the New York brand, seem to enjoy portraying the wealthy Republican Koch brothers as evil because they legally donate to causes liberals, including New Yorkers, do not like while remaining silent about political donations by wealthy New Yorkers.\nBut even private enterprise in New York can also be shady; why, you can't even buy a ticket to a concert, including a Bruce Springsteen concert, without a corruption problem.\nThree Year Investigation Reveals the Corruption of New York City’s Ticketing Industry After a three year investigation, New York attorney general Eric Schneiderman has exposed the corruption of New York City's event ticketing industry. In a report titled \"Why Can't New Yorkers Get Tickets,\" Schneiderman addresses numerous abuses to consumers by both ticketing corporations and scalpers. As reported by The New York Times, the report discusses how specialized computer programs enable a single buyer to instantaneously purchase large amounts of tickets. Shows at Madison Square Garden, which previously hosted Jack Ü's 2015 New Year's Eve celebration and a sold-out show of Armin Van Buuren's \"A State of Trance\" are often targeted. Most notably, one of U2's shows there sold 1,000 tickets in less than a minute.\nWhile gender-segregated bathrooms seem to bother Bruce Springsteen to the point where he won’t perform in a state that legislates such practices, ticket scalping and other ticketing abuses apparently are fine with him, as he continues to perform in New York.\nBut who better than the son of a New York governor and now the governor of New York, Andrew Cuomo (D), son of former New York governor Mario Cuomo himself, to define and describe New York values? Cruz merely repeated them, but Cruz is criticized, not Cuomo. If Cuomo, the son, had his way, those who disagree with him politically would not be allowed to live in New York or breathe New York's liberal air. Really. Two years ago, New York State governor Cuomo (D) expressed his views about valid political beliefs for New Yorkers.\nYou’re seeing that play out in New York. … The Republican Party candidates are running against the SAFE Act — it was voted for by moderate Republicans who run the Senate! Their problem is not me and the Democrats; their problem is themselves. Who are they? Are they these extreme conservatives who are right-to-life, pro-assault-weapon, anti-gay? Is that who they are? Because if that’s who they are and they’re the extreme conservatives, they have no place in the state of New York, because that’s not who New Yorkers are. [Bold added.] If they’re moderate Republicans like in the Senate right now, who control the Senate — moderate Republicans have a place in their state. (bold added) George Pataki was governor of this state as a moderate Republican; but not what you’re hearing from them on the far right.” The governor’s suggestion that, for example, those who hold anti-abortion views have no place in the state prompted Dennis Poust, spokesman for the state Catholic Conference, to observe on Twitter, “My governor thinks there’s no place in NY for people like me. Can I get a state grant to relocate?” (And where to — New Hampshire, maybe?) (snip) Cuomo said his ultimate test was whether or not he could sleep well at night. “I believe in my heart and I believe the people of this state believe that — forget the money and the campaign contributions and what people give — I’m going to do what I believe is right for them, I’m going to make the decision that I’m proud of,” he said.\nI don't know whether Cuomo is sleeping well these days – and nights – though, because, as Politico recently summed up last year:\nCongratulations, New York, You're #1 in corruption Other states have plenty of corruption, but it’s hard to beat New York when it comes to sheer volume. The criminal complaint Monday against Dean Skelos, the state Senate majority leader, and his son Adam came just three months after charges were brought against Sheldon Silver, then the Assembly Speaker. Having the top leaders in both chambers face criminal charges in the same session is an unparalleled achievement, but Skelos is now the fifth straight Senate majority leader in Albany to face them.\nNew York doesn’t so much have a culture of corruption as an entire festival.\nIllinois, New Jersey, and Louisiana (Democrat-dominated states although New Jersey and Illinois have Republican governors) might perversely and jealously claim the corruption title, but New York is making a valiantly twisted effort to enter these sweepstakes.\nValues, New Yorkers, values.","url":"https://www.americanthinker.com/blog/2016/04/those_new_york_state_of_mind_values.html"}
