{"authors":["Kenneth Dickerman","Photo Editor"],"date_download":"2018-10-21 03:00:48","date_modify":"2018-10-21 03:00:48","date_publish":"2018-07-18 13:31:06","description":"A look at the winners of the 2018 iPhone Photography Awards","filename":"data/vaneerConsumption/ThousandsenteredtheiPhonePhotographyAwardscontestThesearethewinners.json","image_url":"https://www.washingtonpost.com/resizer/qrGRK0FNhfax4sr6SURQVxnURVg=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SXT7F4T5NA3CDGFY5LFZ32DFVA.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_07_18__1540090848.html","title":"Thousands entered the iPhone Photography Awards contest. These are the winners.","title_page":"Thousands entered the iPhone Photography Awards contest. These are the winners. - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Photo Editor\nPhotographer of the year, grand prize: Rohingya children watching an awareness film about health and sanitation near the Tangkhali refugee camp in Ukhia, Bangladesh. Shot with an iPhone 7. (Jashim Salam/IPPA)\nPhotographer of the year, first place: The woman wearing the traditional clothes of a “baiana” takes a work break in Salvador de Bahia, Brazil. Shot with an iPhone 6S. (Alexandre Weber/IPPA)\nThe iPhone Photography Awards were created 11 years ago when the popularity of taking photos with an iPhone started to increase. Every year, the competition receives thousands of submissions. Photographers can enter images in 20 categories, including news and events, landscape, still life and travel. In addition to the winners chosen from those categories, the judges also award two “photographer of the year” prizes: grand prize and first place. The competition is the first and longest-running competition for people taking photos with their iPhones (or iPads).\nKenan Aktulun, the founder of the awards, told In Sight why he created the event:\n“I started the awards as a hobby when I got my first iPhone. I’ve been doing photography and working in the user experience design field for long time. I was fascinated by changing user behavior with the introduction of the iPhone. Almost every iPhone user I observed was using the camera for capturing moments. They were not necessarily thinking about photography but taking snapshots of the moments that meant something to them. My idea was to create a platform to celebrate the creativity of the iPhone users.”\nThis year’s grand prize for photographer of the year was awarded to Jashim Salam, and first place went to Alexandre Weber.\nA documentary photographer based in Bangladesh, Salam is a graduate of Pathshala, the South Asian Media Institute. He holds a postgraduate diploma in visual journalism and was a beneficiary of the World Press Photo at the Konrad Adenauer Asian Center for Journalism at Ateneo de Manila University in the Philippines.\nWeber is a 47-year-old anthropologist who studies the history of art. He is an avid traveler who uses his iPhone to take pictures as he visits places. You can see more of Salam’s work here and here, and more of Weber’s work here.\nYou can find out more about the competition on its website. Here are the rest of the first-place winners in the other categories.\nFirst place, abstract: Cardboard scraps in black and white at an industrial space in Brisbane, Australia. Shot with an iPhone X. (Glenn Homann/IPPA)\nFirst place, animals: Django is a Shaolin temple terrier, born and raised in a Buddhist monastery in China’s Hunan province. Shot in Carlsbad, Calif., on an iPhone 7 Plus. (Robin Roberts/IPPA)\nFirst place, architecture: A stair ramp in Rome. Shot with an iPhone 7 Plus. (Massimo Graziani/IPPA)\nFirst place, children: Shot in Toronto with an iPhone 5S. (Melisa Barrilli/IPPA)\nFirst place, floral. Shot in Santa Barbara, Calif., with an iPhone 7. (Alison Helena/IPPA)\nFirst place, landscape: Shot with an iPhone 8 Plus from an airplane window on a flight from Las Vegas. (Charles Thomas/IPPA)\nFirst place, lifestyle: A mother of three shows her style in Madrid. Shot with an iPhone 7. (Natalia Garces/IPPA)\nFirst place, nature: Morning fog in Toulouse, France. Shot with an iPhone 6S. (Sukru Mehmet Omur/IPPA)\nFirst place, news and events: During a lull in the bombings, Syrians gather among the ruins of Douma for a public iftar, the evening meal at the end of the daily Ramadan fast. Shot with an iPhone 7. (Mohammed Badra /European Pressphoto Agency/IPPA)\nFirst place, other: Shot with an iPhone SE at the 39th annual Wright Kite Festival in Kill Devil Hills, N.C. (Amy Nelson/IPPA)\nFirst place, panorama: The Vatnajokull glacier meets the Atlantic Ocean in Iceland. Shot with an iPhone 6 Plus. (Mateusz Piesiak/IPPA)\nFirst place, people: Tourists in front of a small Catholic chapel at Carneiros Beach in Brazil. Shot with an iPhone 7 Plus. (Jonas Wyssen/IPPA)\nFirst place, portrait: Moken village elder Salamah wears his hand-carved wooden dive goggles on the beach at Au Bon Yai, a tiny island community off the coast of Thailand. (Scott Woodward/IPPA)\nFirst place, series: This photo is part of a series shot in San Francisco and Paris with an iPhone X. (Coco Liu/IPPA)\nFirst place, still life: A London diner, shot with an iPhone 7. (Fiona Bailey/IPPA)\nFirst place, sunset: Shot in Jyvaskyla, Finland, with an iPhone 5S. (Sara Ronkainen/IPPA)\nFirst place, travel: Taken en route to the Gobi Desert on the Silk Road in Mongolia. Shot with an iPhone 6S. (Anna Aiko/IPPA)\nFirst place, trees: Shot in Val d’Orcia in Italy’s Tuscany region. Shot with an iPhone 7 Plus. (Lidia Muntean/IPPA)\n*Editor’s note. This post has been updated to include comments by the founder of the iPhone Photography Awards.\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nHaunting images of life on the St. Lawrence River in Canada\n‘I photograph life, not death, because death cannot be seen’\nInside the U.S.’s ‘National Radio Quiet Zone’ where there’s no WiFi or cellphone service","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/07/18/thousands-entered-but-only-these-photographers-won-the-iphone-photography-awards/"}
