{"authors":[],"date_download":"2018-10-30 14:38:02","date_modify":"2018-10-30 14:38:02","date_publish":"2018-06-30 20:28:00","description":"Families Belong Together events held across nation","filename":"data/vaneerConsumption/ThousandsrallyinAtlantaagainstimmigrationpolicy.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/30/Videos/4428273.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_thousands-rally-atlanta-protect-immigration-policy__1540910282.html","title":"Thousands rally in Atlanta against immigration policy","title_page":"Thousands rally in Atlanta against immigration policy","title_rss":"NULL","source_domain":"ajc.com","text":"Thousands of people marched peacefully in downtown Atlanta on Saturday as part of a nationwide protest against the U.S. immigration policy that has separated children from their parents.\nA crowd estimated by police at 4,000 braved the heat to walk roughly a half-mile mainly along Peachtree Street from the Atlanta City Detention Center to the Richard B. Russell Federal Building, where they heard U.S. Rep. John Lewis and others denounce the Trump administration for separating more than 2,000 children from their parents as part of a “zero-tolerance” crackdown on illegal immigration at the Mexican border.\n“We must teach people in power that we will not be satisfied with the order of things,” Lewis said, evoking his own experience in the civil rights movement during his brief remarks to the Families Belong Together gathering.\nU.S. Rep. John Lewis speaks to the thousands gathered in Atlanta for the Families Belong Together march and rally on Saturday, June 30, 2018. (Photo: Danny Robbins/drobbins@ajc.com)\nThe Atlanta march was one of the more than 700 planned to take place across the country as progressive organizations asked people to take to the streets to express their concern with the family-separation policy. Although President Donald Trump has signed an executive order ending the policy, children remain in detention centers and apart from their families.\nU.S. Immigration and Customs Enforcement faced criticism as the federal agency responsible for enforcing such policies, but earlier in the day Trump tweeted: “The Democrats are making a strong push to abolish ICE, one of the smartest, toughest and most spirited law enforcement groups of men and women that I have ever seen. I have watched ICE liberate towns from the grasp of MS-13 & clean out the toughest of situations. They are great!”\nAs was the case in other cities, the Atlanta march featured signs and T-shirts with pointed messages for Trump, U.S. Attorney General Jeff Sessions and others in the administration.\n“Hey Trump and Sessions!” read one. “You are descendants of immigrants.”\n“My God breaks down walls faster than we can build them,” read another.\nAn estimated crowd of several thousand people marched peacefully Saturday morning, June 30, 2018, in Atlanta's Families Belong Together rally as part of a national effort to spotlight U.S. immigration policies that are separating children from their parents. (Photo: Danny Robbins/drobbins@ajc.com)\nJerrica Romero of Marietta said she walked because her husband emigrated legally from Mexico and she understands what life can be like in that country.\n“I’ve been to Mexico and seen the conditions,” she said. “It’s heartbreaking. I understand what (people coming across the border) are running from.”\nRick Page, a retired nurse practitioner from Atlanta who served as an army medic in Operation Desert Storm, said Saturday’s event, while not the biggest protest he has been part of, should have impact.\n“It’s going to make people hear our voice,” he said. “That’s the most important thing.”\nSeveral organizations used the occasion to register people to vote. One, the Georgia Association of Latino Elected Officials, also provided a lifeline by handing out bottles of water on the summer day. A few participants were treated for heat-related issues during the event, which lasted more than two hours.\nOutside the detention center, U.S. Rep. Hank Johnson began the march with a talk in which he proclaimed that black and brown immigrants had been treated like “animals.” He then cited the Statue of Liberty and its famous inscription seeking “huddled masses yearning to breathe free.”\n“Rather than welcoming immigrants with that spirit, rather than a light at the door, Trump says these people are criminals,” Johnson said. “He sends the parents to jail and the children to detention facilities hundreds of miles from their parents.”\nSally Page and her husband, Rick, carry signs during the Families Belong Together rally in Atlanta on Saturday, June 30, 2018. is Sally Page, also of Atlanta. The local event and similar rallies around the nation on Saturday were to protest U.S. immigration policies that separate children from their parents. (Photo: Danny Robbins/drobbins@ajc.com)\nAfter the march wound it way to the Russell federal building, the crowd cheered as Lewis, who hadn’t been previously listed as a speaker, took his turn.\n“You are sending a message,” the congressman said, addressing the crowd from the steps of the Martin Luther King Jr. Federal Building across the street. “We are getting sick and tired of little children taken from their mothers. It’s not right. It’s not fair. And history will not be kind to us.”","url":"https://www.ajc.com/news/thousands-rally-atlanta-protect-immigration-policy/Fz0D5fzurl08fwwpFrJdDK/"}
