{"authors":["Chloe Lyme For Mailonline"],"date_download":"2018-10-23 02:25:58","date_modify":"2018-10-23 02:25:58","date_publish":"2016-01-28 17:14:26","description":"A temple in Tokyo has now become a home to more than one thousand beckoning Maneki-Neko cat statues, in a bid to bring good luck to its grounds and surroundings.","filename":"data/vaneerConsumption/ThousandsofManekiNekocatsareplacedatJapanesetempleforgoodluck.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/309C019700000578-0-image-a-13_1454003168354.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3421232_A-purr-fect-place-pray-Thousands-fortune-cats-placed-Japanese-temple-good-luck-prosperity_1540261558.html","title":"Thousands of Maneki-Neko cats are placed at Japanese temple for good luck","title_page":"Thousands of Maneki-Neko cats are placed at Japanese temple for good luck | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A temple in Tokyo has now become a home to more than one thousand beckoning cat statues, in a bid to bring good luck to its grounds and surroundings.\nThese red and white figurines go by the name Maneki-Neko, which literally means 'beckoning cat' in Japanese. They were put on display at the Goutoku Temple in the country’s capital on January 26, reports the People’s Daily Online.\nThese lucky charms are usually displayed at the entrance of shops and restaurants across south-east Asia welcoming good fortune, happiness, purity and positive things to come.\nLucky charm: Thousands of these lucky cats were put on display at the Goutoku Temple on January 26 in Japan's capital city Tokyo\nBeckoning cats: A visitor looks at the Maneki-Neko figurines on display at the famous Japanese Temple were thousands are on display\nProsperity: They are often displayed at the entrance to shops and restaurants but Goutoku Temple goes one step further with this display\nThe unique Goutoku Temple is well known for its large collection of beckoning cats residing inside it, as well as its stunning architecture and history.\nManeki-Neko’s are adorable sculptures usually made out of ceramic. They are popular fortune cats that sit on their back legs with one arm raised as if they are waving at people. Some of them have arms that do physically wave up and down, they are believed to bring happiness and prosperity to those who display them.\nAccording to catster.com, these lucky cats first appeared during the Edo period (1603-1868) in Japan. There are a number of popular legends about the origins of the feline statue.\nHeavenly: Unique Goutoku Temple is well known for its large collection of cats residing inside it, as well as its stunning architecture\nHappiness: Beckoning cats are usually white and red but sometimes gold, they are impeccably dressed, with a bell attached to their collars\nLegend: Maneki-Neko's first appeared during the Edo period (1603-1868) in Japan, along with a number of legends about their origin\nThe legend behind the Maneki-Neko at the Goutoku Temple is about a wealthy lord who was taking shelter under a tree from the rain.\nHe saw the temple priest’s cat beckoning to him to follow, so he did. As soon as he left the tree it was struck by lightning, saving the lord’s life.\nThe wealthy lord became friends with the priest at the temple, and when the cat died the first Maneki-Neko was made in his honour to keep the temple prosperous and lucky.\nThey are usually impeccably dressed, with a bell attached to their collars in white and red, but sometimes they are gold to bring in wealth to their owner.\nStunning: Thousands of Maneki Neko's, which in Japanese means 'beckoning cat.' Their paws are raised as if it’s waving in good fortune","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3421232/A-purr-fect-place-pray-Thousands-fortune-cats-placed-Japanese-temple-good-luck-prosperity.html"}
