{"authors":["David Wagner","David Gorn","Dan Morain","Amita Sharma"],"date_download":"2018-10-30 22:42:46","date_modify":"2018-10-30 22:42:46","date_publish":"2018-09-01 01:22:03","description":"California doesn't define homelessness as a protected class in the workplace.","filename":"data/vaneerConsumption/ThousandsofCaliforniansareworkingwhilehomelessandmanydontwanttheirbossestoknow.json","image_url":"https://calmatters.org/wp-content/uploads/213917-full.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939366.html","title":"Thousands of Californians are working while homeless, and many don't want their bosses to know","title_page":"Thousands of Californians are working while homeless, and many don't want their bosses to know | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Often one of the first steps to helping people out of homelessness is getting them a steady job.\nBut what about the thousands of homeless Californians who are already working?\nPinning down exactly how many Californians are working while homeless is not easy. Many try to hide it. And it’s certainly true that most people without a place to live are out of work.\nBut recent estimates suggest that it’s not uncommon for homeless Californians to hold down jobs.\nA 2017 survey of the homeless population in San Francisco found 13 percent of respondents reporting part or full-time employment. That’s in a city with an estimated 7,499 people experiencing homelessness.\nThis year, an estimated 10 percent of the 4,990 people living unsheltered in San Diego said they were currently working.\nLos Angeles County has more than 50,000 residents who are homeless. Eight percent of adults surveyed in 2017 said they were working to some degree, mostly in part-time, seasonal or temporary work. Among homeless adults with children, 27 percent said they were working either part or full time.\n‘You don’t have a place to go’\nThat includes parents like Nereida, a single mother of two young daughters who works full time at a Los Angeles optometrist’s office.\n“I do pre-testing,” said Nereida, who asked that her last name not be used in this story. “I take measurements of [patients’] eyes. After that, the doctor sees them.”\nSix days a week, she finishes her shift with a few appointment reminder calls. Then she turns off the display lights in the eyeglass cases. She sets the alarm, locks the doors and walks out to her car.\nSome weeks, she hasn’t had a place to go home to.\n“There’s been several times where I just slept in my car,” she said. “I parked close to the gym, because that’s where I get ready in the mornings.”\nNereida moved to the Los Angeles area almost a year ago. She’s been able to rent rooms for a few months here and there. Lately, she’s been staying with a friend. Someone has always been willing to let her kids spend the night. But she never thought finding a place of her own would be this hard.\nShe admits her credit score is bad. And between car payments, gas and childcare costs, Nereida hasn’t been able to save for a deposit plus first and last month’s rent.\nAt $17 an hour, she earns more than minimum wage. But even if she did manage to find an apartment, the city’s median rent for a two-bedroom — estimated at $1,752 by listings website Apartment List — would claim more than half of her income.\n“You have to really focus on work when you’re at work, and try to put on a face that everything’s OK,” Nereida said. “Once you’re done, you break down. Because you don’t have a place to go.”\nHomeless employees lack legal protections at work\nNereida hasn’t told her boss that she doesn’t have a stable place to live. She said she would be embarrassed. And she wonders if she would be treated differently.\n“I don’t want him to have a different view of me, and to think that [it] is going to affect my work life,” she said.\nWorkers have protections on the job when it comes to factors like race and gender. But Jessica Bartholow, a policy advocate with the Western Center on Law and Poverty, said, “There are no laws in California that protect you from being discriminated against based on your housing status.”\nBartholow was one of the advocates pushing for a 2012 California bill that would have banned discrimination against homeless employees. Had it passed, California would have joined Rhode Island in defining homelessness as a protected class in the workplace.\nThe bill faced opposition from groups like the California Chamber of Commerce; it died in committee. Bartholow looks at California’s housing crisis today and wonders why legislators haven’t reconsidered it.\n“If we know that income is one of the best ways out of poverty, why wouldn’t it be a best policy practice to make sure that people who are homeless and working are not at risk of losing their jobs or having reduced hours?” she asked.\nHow employers can help\nSome employers have succeeded at helping their workers pull themselves out of homelessness.\nKim Wyard works in her office at a Northeast Valley Health Corporation office in San Fernando, California, Aug. 17, 2018. David Wagner/KPCC\n“We don’t have the solution of being able to solve everything with money,” said Kim Wyard, CEO of the Northeast Valley Health Corporation.\n“We’re not a food bank. And we’re not a housing organization. But we can certainly help make those connections,” she said.\nWyard’s organization provides health services to people who are low-income or homeless. It already has strong connections with the Los Angeles homeless support system.\nIn the rare cases when one of its employees has fallen into homelessness, Wyard said those connections were a huge help. Calls to the housing provider LA Family Housing recently helped one employee and her family get back on their feet.\nWyard’s advice to other employers worried about homelessness in their workforce is to know who to call for help.\n“I think that it may take a little bit of digging to put a homeless resource list together for your staff,” she said. “But those resources are there.”\nOf course, for that approach to work, employees would need to feel comfortable telling their bosses about their situation.\nNereida, the optometrist’s assistant, said her employer treats her well and pays her fairly.\nShe said when she looks for housing assistance, she feels people’s image of homelessness works against her. She describes herself as a soccer mom, and she looks the part.\n“I’ve gotten comments like, ‘Sorry, but if I looked at you, I wouldn’t assume that you’re homeless,’” Nereida said. “Do I have to have ripped clothes? Dirty clothes? I have a job. So I can’t come to work unpresentable or unprofessional.”\nNereida is not sure how long her current housing situation at a friend’s place will last. Her biggest fear is that she’ll end up back in her car. But this time, with her kids in the back seat.","url":"https://calmatters.org/articles/thousands-of-californians-are-working-while-homeless-and-many-dont-want-their-boss-to-know/"}
