{"authors":[],"date_download":"2018-10-30 18:28:24","date_modify":"2018-10-30 18:28:24","date_publish":"2016-04-16 21:12:56","description":"Barney Simms was laid to rest Saturday in the Westview Cemetery. His burial followed a nearly three-hour celebration of life at Antioch Baptist Church North, where the beloved community activist had been a member since 1969.","filename":"data/vaneerConsumption/ThousandspayrespectstoslaincommunityactivistBarneySimms.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/04/16/Images/photos.medleyphoto.9418467.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_thousands-pay-re_e8606afec123588fadc80893570c4f0b__1540924104.html","title":"Thousands pay respects to slain community activist Barney Simms","title_page":"Thousands pay respects to slain community activist Barney Simms","title_rss":"NULL","source_domain":"ajc.com","text":"Barney Simms was laid to rest Saturday in the Westview Cemetery.\nHis burial followed a nearly three-hour celebration of life at Antioch Baptist Church North, where the beloved community activist had been a member since 1969. The church, which holds about 2,500, was filled to capacity.\nSimms, 70, was gunned down in his front yard a week ago, stunning many in the community and prompting action against the gun violence plaguing the African-American community.\nRELATED: Fulton County Commission pays tribute to Barney Simms\nOn Thursday, 17-year-old Eric Banks was arrested in connection with the shooting. A preliminary hearing has been set for April 29.\nThe teen was arrested just two miles from Simms’ residence in southwest Atlanta.\nEven as U.S. Rep. John Lewis called for an end to the violence, there was no mention of Banks or how Simms died during the service.\nLewis said Simms was not only a great friend, he was a good, courageous and compassionate man “who never had a mean word to say about anybody.”\n“There are too many guns,” Lewis said, drawing applause from the crowd. “We need to dedicate ourselves to doing our part. Enough is enough.”\nStill the shock that someone who had given much of life to helping others, who indeed was taken in such a senseless manner, could still be felt among those who had come to remember and celebrate Simms’ life.\n“My heart is broken,” his adopted son Justin Simms told those who crammed into the sanctuary.\nAlthough that sentiment was repeated often, laughter punctuated the service, too, as friends, family and former colleagues shared stories of Simms and remembered the impact he’d had in and on their lives.\nIn addition to being active member of Antioch, Simms was a widely respected community leader who sat on several boards and commissions for a wide variety of causes, from family and children services to liquor license review.\nBut he wasn’t just about business. Friends said he was an avid reader and gardener, a loyal friend and confident.\nHe loved music and was partial to Diana Ross and Barbara J. Alexander, Pastor Cameron Alexander’s wife.\n“He’d love the songs and spirit expressed today,” former Atlanta Mayor Shirley Franklin said during a tribute. “He’d want us to hug and love each other and put our differences aside.”\nFranklin and Lewis were among more than a dozen city, state and county officials there to share in the service.\nThe Reverend Cameron Alexander said that it took him and his wife a while to come to terms with Simms’ death.\n“I realized I didn’t believe it either,” he said. “As a Christian, I can’t because the Barney Simms of this world never die.\n“Some people come into a room and you forget they were ever there. Other people come into a room and they never leave,” he said. “Barney never left.”\nAlexander said that Simms was busy and his tentacles stretched all over the city of Atlanta.\n“I don’t think he ever realized how significant he had become,” he said. “He wasn’t an elected official so he didn’t try to become important. He just became that because he cared about people.”\nHence, the large gathering to celebrate his legacy and to remember him.\nIt wasn’t because of the way he dressed or the eloquence with which he spoke or his swagger, though he did all those things well, Alexander said.\n“We’re here today because that boy grew up in Friendship Baptist Church,” where Simms learned to be kind, hospitable and respectful of his elders.\nThen as he has done on many a Sunday morning, Alexander said that he worked for GOD network and that he had breaking news.\n“Barney is still around,” he said.\nThen after reminding those gathered of the conversation between Jesus and the thief on the cross, he said that on last Thursday, Barney’s time ran out — that the service was simply a commercial break, when you hear from the sponsor.\nReferring to John 11:25, Alexander said that Jesus declared himself the resurrection and the life, saying, “He that believeth in me, though he were dead, yet shall live.”","url":"https://www.ajc.com/news/local/thousands-pay-respects-slain-community-activist-barney-simms/ZBdMjsLWeCw1TE1zCQYVuJ/"}
