{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:14:14","date_modify":"2018-10-30 20:14:14","date_publish":"2015-07-28 20:25:51","description":"Participants are urging their state and federal lawmakers to investigate, prosecute, and defund Planned Parenthood.","filename":"data/vaneerConsumption/ThousandsRallyAcrossNationUrgingDefundingPlannedParenthoodWomenBetrayed.json","image_url":"https://media.breitbart.com/media/2015/07/Planned-Parenthood-protest-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_28__1540930454.html","title":"Thousands Rally Across Nation Urging Defunding Planned Parenthood: #WomenBetrayed","title_page":"Thousands Rally Across Nation Urging Defunding Planned Parenthood: #WomenBetrayed | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Thousands of Americans rallied Tuesday in some 65 cities across the nation to urge state and federal lawmakers to investigate and defund Planned Parenthood – the country’s largest abortion provider.\nThe rallies, titled #WomenBetrayed, were launched by national pro-life group Students for Life of America (SFLA) and its partner organization Pro-Life Future in response to the gruesome undercover investigative videos released by the Center for Medical Progress over the past several weeks. Participants are urging their state and federal lawmakers to investigate, prosecute, and defund Planned Parenthood.\n“Women across the nation rose up today to say that they deserve better than Planned Parenthood and abortion,” said SFLA president Kristan Hawkins in a statement to Breitbart News. “In Washington, D.C. alone, over 500 people – including Sen. Ted Cruz, Sen. Rand Paul, and Dr. Ben Carson – showed up in the blazing heat at the #WomenBetrayed rally to demand Planned Parenthood be defunded immediately and investigated for possible criminal actions.”\nHawkins said SFLA is receiving photos and videos of all the rallies held across the country.\n“The response from the grassroots to defund Planned Parenthood has been truly astounding,” she continued. “But this is only the beginning. SFLA will be building upon these rallies next month, asking participants to visit their congressional representatives and demand they defund the abortion giant immediately.”\nChristine Murphy and Jennifer Mitchell are co-chairs of the Stamford, Connecticut #WomenBetrayed Rally and both are active members of the Respect Life community. In a statement sent to Breitbart News, Murphy and Mitchell said they agreed to co-chair their local rally because they “believe Planned Parenthood is not making women’s health care their top priority but rather focusing on profits through abortion and body part sales.”\n“Planned Parenthood has made this clear through the recently released videos, lack of adoption referrals (one referral for every 149 abortions) and the fact that 94% of their business is abortions,” the statement said. “In other words, only 6% of Planned Parenthood’s focus is dedicated to true women’s healthcare… We believe that not one more penny of our taxpayer dollars should go to such an immoral and unethical business that betrays women.”\n“The truth about the immoral and illegal practices at Planned Parenthood has been shown in video after video–not just by the Center for Medical Progress, but by Lila Rose and her Live Action crew as well,” Murphy continued. “We are calling on our elected officials to defund Planned Parenthood immediately, so that tax payer dollars are not being spent on this travesty. All lives do matter.”\nSimilarly, Mitchell added, “There is more than enough evidence in the existing videos to warrant an official investigation into Planned Parenthood. We are asking our local government to listen to the people here today and crack open the doors of Planned Parenthood and expose their illegal and immoral practices.”\n“Science is clear that a human life begins at conception and those who terminate a life at any stage, will be held accountable for those lives, in this life and the next,” she said.\nJessi Bridges, director of Nevadans for Life, the southern affiliate of Nevada Right to Life, organized the rally in Las Vegas, and tells Breitbart News she was expecting between 100-150 people in attendance.\n“I think it’s important for Gov. [Brian] Sandoval (R) to initiate an investigation into Planned Parenthood,” Bridges said. “Based on all that has been coming out and some of the things we already know to be true, lots of people in the city of Las Vegas and the state of Nevada are seeing the potential wrongdoing of Planned Parenthood.”\n“We think it’s time the organization is investigated here in the state of Nevada and obviously we’re calling upon our federal officials to do that as well,” She continued. “We want them defunded. We know there are funds at the federal and state level that are being given to Planned Parenthood – this is our taxes and we don’t want our money given to an organization whose practices we don’t agree with.”\nBridges said state Assemblyman Erv Nelson (R) was speaking at the Las Vegas #WomenBetrayed rally.\nSt. Louis, Missouri rally captain Reagan Nielsen tells Breitbart News over 300 people attended her city’s #WomenBetrayed rally. Republican Missouri state Sens. Bob Onder, Eric Schmitt, and Kurt Schaefer – all members of the state investigative committee into Planned Parenthood in Missouri -addressed participants.\n“It was incredible – and very hot! – but the crowd was amazing,” Nielsen said. “Some pro-Planned Parenthood demonstrators were there, but they didn’t say anything – they just stood on their side behind the fence, but they didn’t say a word.”\n“I’m just energized! I felt everybody in the crowd was just as outraged about these videos as I am,” she continued. “They’re ready to take action and do something. I don’t feel this is something that’s going to end with the rally…people are going to continue with the momentum into action – into their communities, their churches, their schools and workplace, spreading the truth about what’s happening.”","url":"https://www.breitbart.com/politics/2015/07/28/thousands-rally-across-nation-urging-defunding-planned-parenthood-womenbetrayed/"}
