{"authors":[],"date_download":"2018-10-30 14:31:09","date_modify":"2018-10-30 14:31:09","date_publish":"2018-07-05 17:56:00","description":"Hosea Helps will host its 13th annual Back-To-School Jamboree, an event designed to provide low income families with necessary items. The nonprofit will give backpacks filled with school supplies to more than 3,000 children.","filename":"data/vaneerConsumption/ThousandsofsuppliestobegivenawayatAtlantabacktoschoolevent.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgSharedContent/2017/06/15/Videos/4082817.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_thousands-suppli_ff81653d43ada1887e3ee1d3aced09a7__1540909869.html","title":"Thousands of supplies to be given away at Atlanta back-to-school event","title_page":"Thousands of supplies to be given away at Atlanta back-to-school event","title_rss":"NULL","source_domain":"ajc.com","text":"A local organization is once again working to ensure students have the supplies they need as the first day of school looms near.\nHosea Helps will host its 13th annual Back-To-School Jamboree, an event designed to provide low income families with necessary items, this month. The nonprofit plans to give backpacks filled with school supplies to more than 3,000 children.\nChildren can also receive health screenings, clothes, fresh produce, tennis shoes and electric toothbrushes, a press release said. The free event is open to all families.\nParents must bring identification for each child, and children must be present to receive supplies. The event will take place at Georgia International Convention Center, 2000 Convention Center Concourse, on July 28 from noon to 6 p.m.\nHosea Helps President and CEO Elisabeth Williams-Omilami, who is also the daughter of the civil rights icon Hosea Williams, said the group is “committed to ensuring students do not feel ashamed or embarrassed ... because they do not have a new backpack with a pencil or everyday paper.”\nThe group, formerly called Hosea Feed the Hungry and Homeless, also hopes to alleviate the burden of teachers buying their own classroom supplies.\n“Children that are hungry and without school supplies cannot learn,” Williams-Omilami said in a statement. “If Hosea Helps can support the children by helping them feel a sense of confident self-esteem, they will be more eager to learn.”\nThe first day of school for APS students is Wednesday, Aug. 1.\nREAD | Georgia Tech’s innovative new arts season has holograms, 3D juggler\nREAD | Atlanta lemonade stand raises $13K for separated immigrant families\nREAD | Here’s when seven Fulton County libraries will close for renovations\nHosea Helps seeks donations of schools supplies, such as:\nbook bags\nglue sticks\nrulers\ncalculators\nscissors\nnotebook paper\npackages of graph paper\nspiral notebooks\ntwo-ringed binders and folders\npocket folders\npencils\nink pens\nnotebooks\nhighlighters\nconstructions paper\ncolored pencils\ndictionaries\npencil boxes\ncrayons\nerasers\nscientific calculators\nDonations can be delivered to 4215 Wendall Drive.\nThose who wish to contribute money can click here or contact Miriam Ledesma at 770-900-1052 or at Mledesma@hoseafeedthehungry.com. For more details or to get involved, call Hosea Helps at 404-755-3353.\nCorporate Sponsors for the event include Well Care Health Systems, Luther and Susie Harrison Foundation, Georgia Power Foundation, Walmart, Wayfield Foods, Metro PCS, IKEA and Delta Air Lines.\nLike Intown Atlanta News Now on Facebook | Follow us on Twitter","url":"https://www.ajc.com/news/local/thousands-supplies-given-away-atlanta-back-school-event/39EuE2Oz59NvI0RSB4ZJQI/"}
