{"authors":["Shivali Best For Mailonline"],"date_download":"2018-10-23 01:32:42","date_modify":"2018-10-23 01:32:42","date_publish":"2017-03-16 11:39:17","description":"The Human Fertilisation and Embryology Authority has given Newcastle University the go-ahead to offer mitochondrial donation to patients, in the so-called 'three-parent baby' treatment.","filename":"data/vaneerConsumption/ThreeparentbabiescouldbeborninBritainTHISYEAR.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E541C9600000578-0-image-a-3_1489667534330.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4319784_Three-parent-babies-born-Britain-YEAR_1540258362.html","title":"Three-parent babies could be born in Britain THIS YEAR","title_page":"Three-parent babies could be born in Britain THIS YEAR | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"this year as part of an £8 million clinical trial\ntreatment could be offered by the\nBritain's fertility regulator has granted doctors the first UK licence to create babies using a three-parent IVF technique designed to prevent inherited genetic diseases.\nThe licence, granted to a team of doctors in Newcastle University, means the first child created in Britain using the the technique could be born this year.\nCritics of the treatment say it is a dangerous step that will lead to the creation of genetically modified \"designer babies\".\nBut the medical team in Newcastle said they were delighted with the decision \"to help families affected by these devastating diseases\".\nScroll down for video\nA controversial fertility technique to help couples with genetic diseases conceive healthy children has been given the green light by the HFEA today (stock image)\nTHREE-PARENT BABY TECHNIQUE The first child to be conceived using the controversial technique was a boy born to Jordanian parents earlier this year. The procedure was carried out at a clinic in Mexico. By incorporating a small amount of donor DNA into his cells, the parents have avoided passing on a debilitating genetic condition to their son. The genetic defect is carried in the energy-producing units inside cells, called mitochondria. Unpublished test results of the boy, who is now eight months old, indicate he is healthy and has no sign of the genetic disease carried by his parents. The levels of mutant mitochondria are low, around 3 or 4 per cent, with experts claiming the defective mitochondria will remain at acceptable levels. The clinic where the boy was conceived is working with more couples hoping to avoid similar conditions. Last year, reports suggest this 'three-parent' approach may have already been used by researchers in China, with a child born using the technique.\nWith the technique now approved, the first mitochondrial replacement therapy (MRT) patients could be treated this year, said the Human Fertilisation and Embryology Authority (HFEA).\nOnce the second part of the process has been signed off, researchers at Newcastle University will be able to perform the technique on patients.\nScientists at the University of Newcastle, which has pioneered the treatments, say they already have women lined up for the therapy.\nThe team hopes to treat up to 25 women a year with NHS funding.\nSpeaking about the new licence, Professor Mary Herbert from Newcastle Fertility Centre and Newcastle University, said: 'The team here at Newcastle Fertility Centre is delighted with the decision to grant our clinic a licence to offer treatments to prevent transmission of mitochondrial DNA disease.\n'Many years of research have led to the development of pronuclear transfer as a treatment to reduce the risk of mothers transmitting disease to their children.\n'It's a great testament to the regulatory system here in the UK that research innovation can be applied in treatment to help families affected by these devastating diseases.'\nIVF babies born after MRT would receive a tiny amount of DNA from a third person besides their mother and father - an egg donor.\nFertility doctors carrying out the treatment will aim to replace abnormal genes in the mitochondria, rod-like power plants in cells that generate energy.\nHFEA Chair, Sally Cheshire said: 'I can confirm today that the HFEA has approved the first application by Newcastle Fertility at Life for the use of mitochondrial donation to treat patients.\n'This significant decision represents the culmination of many years hard work by researchers, clinical experts, and regulators, who collectively paved the way for Parliament to change the law in 2015 to permit the use of such techniques.\n'Patients will now be able to apply individually to the HFEA to undergo mitochondrial donation treatment at Newcastle, which will be life-changing for them, as they seek to avoid passing on serious genetic diseases to future generations.'\nThe approval of the licence has been welcomed by members of the British science community.\nCommenting on the announcement, Professor Simon Fishel, Managing Director of CARE Fertility, said: 'This is excellent news, especially for those patients in the UK who have been waiting for this opportunity.\nIVF babies born after MRT would receive a tiny amount of DNA from a third person besides their mother and father - an egg donor\n'We know it won't be easy for all concerned as the technology is not straight forward and success will depend upon many factors.\n'But it is indeed a step in the right direction following in-depth debate and consideration of all issues from the medical science to the ethics.\n'Regulating this technology via the HFEA and providing the opportunity for couples to deliver children free of this devastating disease here in the UK is a milestone that all who care about medical health will welcome, and we wish the Newcastle team and their patients a very successful programme.'\nProfessor Allan Pacey, a fertility expert at the University of Sheffield, added: 'This is very good news and a great day for science.\n'I'd like to congratulate the team in Newcastle for their hard work in getting to this stage and I wish them every success in applying this technology to the first UK patients.\nA fertility clinic in Mexico which helped a couple to conceive the world's first 'three-parent baby' says it plans to conceive a further 20 babies using the technique in the first half of 2017 (stock image)\n'This is a tremendous example of what can happen if scientists, clinicians, parliamentarians, regulators and patient support groups all work together for a common aim.'\nFollowing the approval, the NHS in England will now make £8 million in funding available over five years for a clinical trial of mitochondrial donation.\nNHS England's clinical director of specialised services, James Palmer, said: 'Mitochondrial diseases can be devastating and life limiting as well as hugely costly to the NHS to treat.\n'This trial will, for the first time, give women living with mitochondrial disease the option of having a baby without passing on their condition and is a shining example of how the NHS is leading the world in developing cutting-edge innovative new medical interventions.'\nBut 'pro-life' campaigners have expressed their concerns about the technique's approval.\nBioethicist Dr Anthony McCarthy, from The Society for the Protection of Unborn Children, said: 'It comes as little surprise that the HFEA has approved the creation of 'three-parent' embryos given their track record of undermining respect for the human embryo and the integrity of human reproduction.\nWHY IS THE METHOD CONTROVERSIAL? The therapy targets faulty mitochondria – the energy producing units found in cells and passed on by the mother – by replacing them with those of a healthy female donor. Concerns have been raised about the technique as mitochondria contain a small amount of DNA, meaning the child inherits DNA from the mother, father and the donor. It remains unclear if the procedure is safe and effective in the long term, or if children born using mitochondrial transfer will remain disease free as they mature. Some trials have shown that faulty mitochondria persist, even after the procedure. The UK's fertility regulatory body has now approved the approach for use in the UK.\n'The two techniques which the HFEA has decided to permit are not curative of mitochondrial diseases and in no way help those who already have them.'\nMitochondria only hold around 0.1 per cent of a person's DNA, which is always inherited from the mother and has no influence over individual characteristics such as appearance and personality.\nIt is quite separate from the DNA in the cell nucleus which houses the vast majority of an individual's genes.\nBut faulty mitochondrial DNA (mtDNA) can lead to a wide range of potentially fatal conditions affecting vital organs, muscles, vision, growth and mental ability.\nThe treatment is carried out by transferring the genetic material that effectively encodes a baby's identity to a donor egg whose own nuclear DNA has been removed.\nTwo different techniques may be employed, either before or after fertilisation.\nThe end result is the same - an embryo containing healthy mitochondria from the donor and nuclear DNA from the baby's mother and father.\nIn theory, mitochondrial replacement can not only prevent a child developing inherited diseases, but also protect future generations.\nLast year, the UK became the first country in the world to legalise mitochondrial replacement after MPs and peers voted in favour of allowing it.\nThe technique could be used to help couples conceive as early as next year, as scientists at the University of Newcastle, which has pioneered the treatments, say they already have women lined up for the therapy\nCritics say the technique is not fool-proof and small numbers of faulty mitochondria may still be 'carried over' into the child, and even replicate in the developing embryo.\nThey also argue that unforeseen problems might occur once the procedure is used to create human babies.\nFor instance, replacing mtDNA might have more of an impact on personal traits than has been envisaged.\nUnknown epigenetic effects - environmental influences that alter the way genes work - may also have serious consequences for the health of babies, it is claimed.\nDr John Zhang, head of the New York City embryonic team, holds the world's first 'three-person' baby after the boy was born in Mexico in April. Dr Zhang carried out the procedure at the Mexican clinic\nLast year, a healthy boy was born in Mexico after being conceived using a form of mitochondrial transfer in an effort to avoid a debilitating genetic disease.\nAnd the fertility clinic in Mexico that carried out the procedure says it plans to conceive a further 20 babies using the technique in the first half of 2017.\nThe first child is now a healthy one-year-old, with no sign of the inherited disease carried by his parents.\nAnalysis of the boy's tissues reveals that 'most' of his mitochondria have been inherited from the donor.","url":"https://www.dailymail.co.uk/sciencetech/article-4319784/Three-parent-babies-born-Britain-YEAR.html"}
