{"authors":["Jennifer Newton For Mailonline"],"date_download":"2018-10-22 23:24:05","date_modify":"2018-10-22 23:24:05","date_publish":"2016-01-29 11:09:21","description":"Pitbull Levi scared off an armed intruder that broke into the home of his owners Darcy Cherry and Bob Stenzel in Janesville, Wisconsin, by barking and growling so much it forced the robber to retreat.","filename":"data/vaneerConsumption/Threeleggedpitbullisshotintheheadbyarmedintruder.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B185DD00000578-0-image-a-12_1454065019986.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422521_Three-legged-pit-bull-shot-head-armed-intruder-manages-save-owners-growling-robber-scaring-off_1540250645.html","title":"Three-legged pit bull is shot in the head by armed intruder","title_page":"Three-legged pit bull is shot in the head by armed intruder | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A family dog with only three legs is being hailed a hero after he saved his owners from an armed intruder even though he had been shot in the head.\nPit bull Levi, who is 15, scared off the robber, who was carrying a gun, by growling and barking at him, forcing him to retreat.\nThe armed man had broken into Darcy Cherry and her boyfriend Bob Stenzel's home in Janesville, Wisconsin demanding he be taken to their safe so he could steal their cash.\nThree-legged pit bull Levi, who scared off an intruder who broke into his owners' home despite being shot in the head\nThe armed man had broken into Darcy Cherry and her boyfriend Bob Stenzel's home in Janesville, Wisconsin demanding he be taken to their safe so he could steal their cash\nBut the robber was so spooked by Levi's bark, he shot him in the head before running off empty handed.\nThe family's ordeal began after the couple forgot to lock their door one evening last week, and a masked man, dressed in black and holding a gun entered their house.\nHe pointed his weapon at the pair demanding money from their safe, even though they didn't have any.\nAt this point, Levi began furiously barking to scare the robber who even fired a shot at the pet's head, which struck his shoulder.\nBut his growling and snarling became too much for the man, who decided to flee empty handed and now the dog's owners are hailing him a hero.\nMr Stenzel told WISC: 'It's a feeling you can't really express in words. I mean, thank God he was here and he protected us.'\nLevi is aged 15 and only has three legs but his growling and snarling became too much for the armed man, who decided to flee empty handed\nWhile Ms Cherry added: 'This dog is just meant to be with us. He is not meant to go anywhere, it's just crazy.'\nBut its not the first time that Levi has lept into action to protect his owners, as in 2013 he fell off the edge of a trail protecting Ms Cherry's son, which saw his leg shatter, requiring an amputation.\nHe also survived being dognapped in broad day light in 2014.\nMs Cherry added: 'He is amazing. He bounces back so fast. I wish I could have his strength and his mobility to just come back and be so loving-natured.'","url":"https://www.dailymail.co.uk/news/article-3422521/Three-legged-pit-bull-shot-head-armed-intruder-manages-save-owners-growling-robber-scaring-off.html"}
