{"authors":[],"date_download":"2018-10-22 21:42:18","date_modify":"2018-10-22 21:42:18","date_publish":"2014-06-05 02:23:16","description":"The RCMP was hunting a heavily armed man who opened fire Wednesday in Canada’s eastern New Brunswick province.","filename":"data/vaneerConsumption/ThreeCanadianOfficersKilledinSprayofGunfire.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/490736/140605-canada-shooting-jms-1554_c2580e1d7388e8a572be8a94d3157d62.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_three-canadian-officers-killed-spray-gunfire-n123136_1540244538.html","title":"Three Canadian Officers Killed in Spray of Gunfire","title_page":"Three Canadian Officers Killed in Spray of Gunfire ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA camouflaged gunman described as armed and dangerous continued to elude the Royal Canadian Mounted Police on Thursday after he fatally shot three officers and forced a neighborhood lock down.\nThe Mounties identified the man as Justin Bourque, 24, of the city of Moncton in the province of New Brunswick.\nPolice said possible sightings of the suspect on Thursday morning turned out to be unfounded, but they They warned people around the city to stay inside, away from windows and to lock their doors.\n“We need [residents] to stay inside for their own safety,” Constable Damien Theriault told CBC News early Thursday.\nThe three deaths were the first Mounties killed by gunfire since November 2007. Two officers were injured, and one of them is still in the hospital\nA Facebook page that appears to belong to Bourque contains numerous postings from gun-rights groups, anti-police sentiment and song lyrics.\n\"Ask yourself, would you fight for the future of your children or grandchildren, or your family and friends sons and daughters? The answer is: no you're too stupid to know what to fight for, cause we're already losing the silent war you don't wanna believe is happening,\" an April 7 posting reads.\nThe last update to the page was made hours before the shooting and quoted a Megadeth song. Below it, after the bloodshed, a friend posted a message: \"You knew this wasn't the answer.\"\nSeveral friends on Facebook of Bourque did not reply to requests for comment.\nThe suspect is believed to be heavily armed.\nAn image from the Times and Transcript newspaper showed a man in camouflage with a bandanna around his forehead carrying an assault-style rifle, with another slung over his shoulder. He also appeared to be carrying a backpack.\nThe suspect appears to have a tactical shotgun on his back with a collapsible stock and shotgun shells strapped to his bottom, said NBC law enforcement analyst Jim Cavanaugh. He also appears to be carrying a sniper rifle, similar to a .308 caliber, and a detachable magazine, he added.\nThe officers were killed about 7:30 p.m. local time (6:30 p.m. ET) Wednesday. Paul Greene, a spokesman for the Mounties, said in an email to NBC News that the officers, all from the Codiac Regional RCMP, were shot after responding to a call about a man with a gun.\nA separate shooting took place near the city of Dieppe, just east of Moncton. Moncton is a city of about 70,000 people three hours up the coast from the border between Canada and Maine.\nHeidi James of Moncton told CTV News that she was home with her family when gunfire erupted outside. She said her husband looked out a window and saw a body and a shot-out vehicle.\nNew Brunswick Premier David Alward said in a statement that he was “shocked and saddened” by the shooting and asked residents to heed police warnings.\nThe last Mountie to die by gunfire, according to an honor roll on the RCMP website, was Constable Douglas Allen Scott, who was shot while responding to a call for assistance involving an impaired driver on Nov. 5, 2007, in Kimmirut, Nunavut.\nTwo years earlier, four constables were shot to death by a deranged suspect near Mayerthorpe, Alberta, the honor roll says.","url":"https://www.nbcnews.com/news/world/three-canadian-officers-killed-spray-gunfire-n123136"}
