{"authors":[],"date_download":"2018-10-22 21:10:52","date_modify":"2018-10-22 21:10:52","date_publish":"2014-05-06 13:12:53","description":"North Carolina's contests include a challenge to the establishment, a challenge to an anti-war incumbent and a singer trying to make it big - again.","filename":"data/vaneerConsumption/ThreeStorylinestoWatchonPrimaryDay.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/422851/senate_north_carolina-jpeg-0f5da_f4b64bf256d512457c71846613964233.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_three-storylines-watch-primary-day-n98051_1540242652.html","title":"Three Storylines to Watch on Primary Day","title_page":"Three Storylines to Watch on Primary Day ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThree storylines to watch on this Primary Day\nThree states are holding their primaries today (Indiana, North Carolina, and Ohio), but there is really only one state to watch (North Carolina). And we’ll be paying attention to three storylines in particular in the Tar Heel State tonight. The first is whether Republican front-runner Thom Tillis, the speaker of the state House, will surpass the 40% threshold needed to avoid a runoff in North Carolina’s GOP Senate primary. Why it's important: The runoff takes place July 15, which means that the primary season will be extended almost another two and a half months if no one cracks 40%. Such an outcome would potentially benefit vulnerable incumbent Sen. Kay Hagan (D-NC) and give Tillis' conservative competition more time to try to topple him (in a lower turnout mid-summer affair). As we mentioned yesterday, the primary has become a 2016 proxy fight of sorts, with Jeb Bush (and also now Mitt Romney) backing Tillis, with Rand Paul supporting physician Greg Brannon, and with Mike Huckabee endorsing minister Mark Harris. And the presidential endorsements help give you a handy guide to exactly which part of the party these candidates are most comfortable associating with. An establishment figure (Tillis), a Tea Partier (Brannon) and an evangelical (Harris)…\nWill Tillis break 40%?\nWill an incumbent congressman go down? And will Clay Aiken win? The second storyline is the competitive House GOP primary between incumbent Rep. Walter Jones (R-NC) and Republican challenger Taylor Griffin, who worked in the Bush administration. This, however, isn’t your typical establishment-vs.-Tea Party primary -- Jones is anti-war, and Griffin has questioned his GOP credentials. And the third storyline in North Carolina is former “American Idol” star Clay Aiken’s (D) congressional bid for the seat held by Rep. Renee Ellmers (R-NC). But as Roll Call wrote last week (with the clever headline “Clay Aiken Could Be Runner-Up in House Primary”), the singer is hardly a slam dunk to win the Democratic primary. “Aiken reported disappointing fundraising. Privately, North Carolina Democrats said his campaign spent too much money on initial start-up costs and consulting fees — and not enough on direct voter communication.” Of course, Aiken isn’t the first celebrity to run for Congress, the Senate, governor, or even the White House. Look at all of these singers and actors who actually won: Fred Gandy (who played Gopher on “Love Boat”), Ben Jones (who played Cooter on “Dukes of Hazzard”), Sonny Bono, Al Franken, Jesse Ventura, Arnold Schwarzenegger, and Ronald Reagan. Polls close in North Carolina and Ohio at 7:30 pm ET, and all polling places in Indiana will be closed by 7:00 pm ET.\nDemocrats have meddled in the GOP’s NC SEN primary\nOne more story to watch in North Carolina is something we noted a couple a weeks ago: Democrats have tried to influence the Senate GOP race by portraying Tillis as a squish on the health-care law. Here’s the Washington Post: “The fliers landed in the mailboxes of Republican voters here last week with a warning likely to unnerve many conservatives. Thom Tillis, the Republican front-runner for a U.S. Senate seat, once called President Obama’s health-care law ‘a great idea,’ the mailer said. The assertion echoed recent radio ads that also seem to question Tillis’s adherence to the orthodoxy of a party that has made its opposition to the Affordable Care Act a centerpiece of its midterm-election strategy.” But as the Post writes, these didn’t come from Tillis’ GOP adversaries -- rather, they came from Sen. Kay Hagan’s (D-NC) campaign. But unlike Claire McCaskill in Missouri in 2012 with Todd Aiken, Hagan has not spent nearly the same amount of money trying to topple Tillis; it’s been more of a dabble of sorts. Then again, if Tillis is forced into a runoff, don’t be surprised if Hagan’s dabble becomes more aggressive.\nSix months out, Kasich looks stronger than expected\nWhile Ohio doesn’t have any attention-grabbing primaries tonight, the Buckeye State will feature one marquee contest we’ll be watching in November (or at least we thought it would be marquee) -- the gubernatorial race, especially given Ohio’s importance in presidential elections. But one of the more interesting stories of 2014 is how Gov. John Kasich (R) is in better shape than anyone would have predicted two years ago after he got bogged down in an unsuccessful fight to change collective bargaining in the state. According to a Quinnipiac poll in February, Kasich’s approval rating was at 51%, though he was leading likely Democratic challenger Ed Fitzgerald by just a handful of points, 43%-38%. Make no mistake: Given that this is Ohio, the race will likely be close. But Kasich -- at least right now -- looks stronger than the early conventional wisdom heading into 2014. And there are a number of reasons, 1) the economic outlook in the state is MUCH better today than it was in 2012, 2) Kasich seemed to learn from the shellacking he took on his fight with the unions, and 3) Democrats struggled to find what they thought would be an “A” list challenger. Not saying Fitzgerald can’t win, but he was definitely farther down the list of potential recruits the party was looking at.\nClimate Change Day at the White House\nOutside of today’s primaries, the other political story we’re watching today involves climate change at the White House. This afternoon, President Obama will conduct a round of interviews with national and local meteorologists as part of a “Weather from the White House” event to emphasize climate change. Today’s event is White House counselor John Podesta’s personal baby, and Team Obama sees combating climate change -- despite no legislative achievement on this front -- as a legacy issue. As others have written, the eventual Keystone XL decision is mostly a sideshow. The real climate-change action will take place when the Obama administration announces its rules on regulating greenhouse gases from existing power plants. But for now, it seems the White House has decided the best legacy it can leave on the climate issue is to use the bully pulpit to make the case for action. And then there’s this report coming out the White House: “A new White House report says that the hard realities of a changing climate are beginning to directly affect Americans as the issue ‘has moved firmly into the present.’ The third National Climate Assessment, the result of four years of research by scientists and experts, was released on Tuesday. A 1,300-page draft version of the National Climate Assessment was issued last year.”\nReunited, and it feels so good…\nPolitico’s Maggie Haberman wrote that Hillary Clinton will attend a fundraiser on May 15 for her daughter’s mother-in-law Marjorie Margolies -- representing Hillary’s first campaign activity of the year. And guess who’s hosting the fundraiser? None other than Lynn Forester de Rothschild. If you’ll recall, Lynn Forester de Rothschild was so disappointed by Obama’s primary victory over Hillary, she campaigned for McCain-Palin in 2008 and backed John Huntsman in 2012. Also, as Slate’s Dave Weigel reminds us, she said that Obama “being half black” doesn’t make him qualified to be president.\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/three-storylines-watch-primary-day-n98051"}
