{"authors":[],"date_download":"2018-10-22 21:42:26","date_modify":"2018-10-22 21:42:26","date_publish":"2014-06-06 05:38:12","description":"Two 10-year-olds and a 13-year-old have been arrested in connection with a recent string of school bomb threats in Bristol, Connecticut.","filename":"data/vaneerConsumption/ThreeYoungStudentsArrestedinSchoolBombThreats.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_three-young-students-arrested-school-bomb-threats-n124221_1540244546.html","title":"Three Young Students Arrested in School Bomb Threats","title_page":"Three Young Students Arrested in School Bomb Threats","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBy NBC CONNECTICUT\nTwo 10-year-olds and a 13-year-old have been arrested in connection with a recent string of school bomb threats in Bristol, Connecticut, according to Mayor Ken Cockayne. All three are students in the school system.\nThe students will be expelled for at least a year.\nAccording to police, the 10-year-olds are female students at the Edgewood and Stafford schools and allegedly made threats at the schools they attend. Police said they both confessed and have been charged with falsely reporting an incident, first-degree threatening, second-degree reckless endangerment and second-degree breach of peace.\nEight bomb scares have been reported in the school system over the course of nine days.\nThe latest threat occurred at the Greene-Hill School for students in kindergarten through eighth grade. Police arrived on scene around 3 p.m. Thursday and said the bomb threat was found in a girls' bathroom.\nNo arrests have been made in connection with that threat, but police said they're following leads.\n\"Those individuals are going to be charged with four different charges,\" said Bristol police Chief Thomas Grimaldi, at a public forum Thursday night. \"Two of the charges will be felony charges, two will be misdemeanors.\"\nAuthorities say the school bomb threats are taxing emergency resources.\n\"This is costing us a minimum of $40,000 per call, between fire, police ambulance,\" Cockayne said. \"It's taking away from other emergencies. We have a fire truck sitting here that could be responding to another call somewhere.\"\nAt the forum Thursday night, Grimaldi said the town is stepping up security measures.\n\"All of our schools have additional security implemented... including additional surveillance by police and by video camera, and other individuals in the school,\" Grimaldi explained.\nThe first suspect to be arrested, a 13-year-old, was charged in connection with a Wednesday evening bomb threat at Stafford Elementary School, where the teen is a student.\nStudents were sent home early during the initial six incidents, but on Thursday, the policy changed.\nAs police checked the Edgewood School on Thursday, students waited out in the rain at the nearby Giamatti Little League Complex before being allowed back in.\n\"It just started off as a normal day,\" said second-grader Dontay Arnold.\nWhen asked if he felt any differently about it after he found out it was a bomb threat, Arnold said, \"My stomach hurt. That's all I can say.\"\nThe threats started on May 27 at Bristol Central High School. According to the principal, a student found a message on a desk that said a bomb would go off that morning.\nTwo days later, Bristol Eastern High School received a bomb threat. A female student received a text from a number she did not recognize and reported it, according to police.\nOn Tuesday of this week, police responded to Northeast Middle School after a student found a note that said a bomb would go off.\nAuthorities responded to three more bomb threats Wednesday, sending officers to Chippens Hill Middle School, St. Paul Catholic High School and Stafford Elementary School.\nDuring a news conference Wednesday evening, police said they are looking to file charges that involve terrorism.\n\"This is just copycat kids, that’s all it is,\" Cockayne said. \"They’re seeing that they get a day off from school by putting something out there.\"\nThe first student to be arrested was a 13-year-old suspected in the Chippens Hill Middle School threat. That student has been charged with first-degree false reporting and first-degree threatening, both felonies, as well as second-degree breach of peach and second-degree reckless endangerment.\nThe city of Bristol is offering a reward of $1,000 per arrest and conviction of any individual involved in the sequence of bomb threats at city schools.\n\"From my mayor's office, I am saying prosecute fully,\" Cockayne said. \"We will also seek restitution.\"","url":"https://www.nbcnews.com/news/us-news/three-young-students-arrested-school-bomb-threats-n124221"}
