{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 18:39:38","date_modify":"2018-10-30 18:39:38","date_publish":"2016-12-21 22:36:49","description":"Another anti-Muslim hate crime has been debunked. A Muslim student's claim that she was threatened for wearing her headscarf was discovered to be a hoax.","filename":"data/vaneerConsumption/ThreattoBurnMuslimUniversityofMichiganStudentDebunked.json","image_url":"https://media.breitbart.com/media/2016/11/rsz_gettyimages-96205490-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_12_21__1540924778.html","title":"Threat to 'Burn' Muslim University of Michigan Student Debunked","title_page":"Another Fake Anti-Muslim Hate Crime: Threat to 'Burn' Muslim University of Michigan Student Debunked","title_rss":"NULL","source_domain":"breitbart.com","text":"Another anti-Muslim hate crime has been debunked, this one in Ann Arbor, Michigan, after a Muslim student’s claim that she was threatened for wearing her Muslim headscarf was discovered to be a hoax.\nPolice now say a false report was filed by a Muslim University of Michigan student, who told police several weeks ago that a man threatened to light her on fire if she did not remove her hijab as she walked down the street in Ann Arbor. The unidentified student claimed her assailant was a white man, whom she insisted sounded like he was drunk, Fox 2 reported.\nSchool officials issued a “safety alert” to students, and police immediately launched an investigation into her hate crime report.\nHowever, a review of surveillance video from businesses along William and State Streets, the area the woman said the assault took place, provided no evidence of a man matching the description she provided. Even more damning, no evidence was found that even she had been there that day.\nThis week, Ann Arbor Police Lt. Matthew Lige said there was not enough evidence to substantiate the woman’s claim, and the incident is now being deemed a hoax.\nOfficials are weighing whether the woman will be charged with filing a false police report. She may also be hit with a felony charge because her report of “ethnic intimidation” is itself a felony.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2016/12/21/another-fake-anti-muslim-hate-crime-threat-burn-muslim-um-student-debunked/"}
