{"authors":["Daniel Martin Chief Political Correspondent For The Daily Mail"],"date_download":"2018-10-22 20:23:12","date_modify":"2018-10-22 20:23:12","date_publish":"2016-01-29 01:20:38","description":"Elderly people are still suffering the indignity of care visits lasting only 15 minutes. A survey reveals 74 per cent of councils are commissioning the rushed sessions by home helps.","filename":"data/vaneerConsumption/Threeinfourcouncilsstillsendcarerson15minutesvisitstoOAPs.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/24BA93FA00000578-0-image-a-55_1454030433086.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422035_Three-four-councils-send-carers-15-minutes-visits-OAPs-Elderly-suffering-indignity-rushed-sessions-despite-high-profile-crackdown_1540239792.html","title":"Three in four councils still send carers on 15 minutes visits to OAPs","title_page":"Three in four councils still send carers on 15 minutes visits to OAPs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Elderly people are still suffering the indignity of care visits lasting only 15 minutes despite a high-profile crackdown.\nA survey reveals 74 per cent of councils are commissioning the rushed sessions by home helps – exactly the same proportion as a year ago.\nAccording to official guidance, the visits should not be shorter than 30 minutes.\nA survey reveals 74 per cent of councils are commissioning the rushed sessions by home helps\nBut last night home helps told heart-rending tales of how they have no time to help vulnerable pensioners with all their needs.\nThe survey found a vast majority – 85 per cent – can only have a brief chat on some calls while a quarter said they had no time to even take them to the toilet.\n‘It’s disrespectful,’ said one. ‘It feels like you’re abusing them.’\nThe continuing scandal is detailed in a report by the union Unison, many of whose members are care workers.\nGuidance from the National Institute for Health and Care Excellence issued last September advised against visits shorter than half-an-hour.\nIt said home visits should be long enough for staff to complete their tasks without compromising the quality of their work or the dignity of the person. But the survey suggests that councils are ignoring this.\nFreedom of Information requests to all 152 social care councils in England this month reveal that 74 per cent are limiting homecare visits for the elderly, ill and disabled to just 15 minutes.\nThis proportion is unchanged on a year ago – suggesting a Government crackdown has made no difference. The report entitled Suffering Alone at Home also takes in an online survey of 1,100 care staff.\nOf those who responded, 74 per cent felt they did not have enough time to provide dignified care for the elderly and disabled they visited.\nOne, who cared for a woman aged 103, said: ‘I was given 15 minutes at night to change her into nightwear and make a drink. She was so alert and friendly and always offered me a drink but I never had time. I hated it.’\nAnother carer added she had just 20 minutes for a client of 102 to help her shower and dress, make food, tidy her kitchen, give her medication and put her bins out.\nUnison said it was particularly worrying that 61 per cent of carers said short visits meant they often had to rush the care of those aged over 90.\nMore than half the home helps (57 per cent) have been asked to provide personal care in 15 minutes or less for an elderly person they have never met before.\nA third said they have no time to help with personal hygiene needs, such as washing. Just under half said 15 minutes was not long enough to prepare a nutritional meal or assess any change in the person’s health.\nWorkers added many clients had few visitors, making it important to spend time with them.\nDave Prentis, Unison general secretary, described the system as broken and blamed ‘eye-watering cuts’ by ministers.","url":"https://www.dailymail.co.uk/news/article-3422035/Three-four-councils-send-carers-15-minutes-visits-OAPs-Elderly-suffering-indignity-rushed-sessions-despite-high-profile-crackdown.html"}
