{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:56:25","date_modify":"2018-10-22 23:56:25","date_publish":"2016-01-11 07:49:27","description":"Police officials say the threat-scoring software like Beware, which is being used in Fresno, California, provides critical information that can aid in situations like uncovering terrorists.","filename":"data/vaneerConsumption/Threatscoringsoftwarecalculateshowdangeroussuspectscouldbe.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/22/300A9C1D00000578-0-image-a-7_1452552794494.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393463_Threat-scoring-software-calculates-billions-data-points-determine-dangerous-suspects-be_1540252585.html","title":"Threat-scoring software calculates how dangerous suspects could be","title_page":"Threat-scoring software calculates how dangerous suspects could be | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Police are now surveilling people with software that calculates billions of data points to determine how dangerous suspects could be as they respond to 911 calls.\nPolice officials say software like Beware, which is being used in Fresno, California, provides critical information that can aid in situations like uncovering terrorists, thwarting mass shootings and for ensuring the safety of the public and officers, according toThe Washingon Post.\nHowever, activists and civil libertarians say the systems represent an intrusion on privacy and have been implemented with little public oversight.\nThe Fresno Police Department (pictured) is one of the first in the country to test the threat-scoring software program, Beware, which calculates billions of data points to determine how dangerous suspects could be\nOfficers with the Fresno Police Department respond to a domestic disturbance call. Police officials say the threat-scoring software provides critical information that can aid in situations like uncovering terrorists, thwarting mass shootings\nThe Post reported that during protests in Baltimore and Ferguson, planes with cameras filmed the unrest and authorities in Oregon are facing a federal investigation after using software to monitor Black Lives Matter hashtags.\n'This is something that's been building since September 11,' Jennifer Lynch, a senior staff attorney at the Electronic Frontier Foundation, told The Post.\n'First funding went to the military to develop this technology, and now it has come back to domestic law enforcement.\n'It's the perfect storm of cheaper and easier-to-use technologies and money from state and federal governments to purchase it.'\nThe Fresno Police Department is one of the first in the country to test the threat-scoring software, Beware, according to The Post.\nThe software works by automatically running the addresses and providing officers with residents' names before scanning them against a host of publicly-available data as officers respond to calls.\nLieutenant Dave Ramos of the Fresno Police Department checks his computer after responding to a disturbance call that came in through the Real Time Crime Center\nFresno Police Chief Jerry Dyer said the software and its Real Time Crime Center (pictured) gives them a better sense of what they are dealing with, as officers usually are operating on little or inaccurate information\nIt operates similar to how a bank would run a credit check, scouring billions of data points such as property records, arrest records, commercial databases and social media postings.\nIt then generates a color-coded threat level for each person or address in green, yellow or the highest being red, according to The Post.\nHowever, the way in which the software calculates the threat scores is only known by its maker, Intrado.\nAccording to the maker's promotional materials, the threat-scoring software could reveal to the user that a resident of a particular address is for example, a war veteran who suffers from post-traumatic stress disorder or who posted some concerning messages on social media about his war experiences.\nFresno Police Chief Jerry Dyer said the software and its Real Time Crime Center gives them a better sense of what they are dealing with, as officers usually are operating on little or inaccurate information.\n'Our officers are expected to know the unknown and see the unseen,' Dyer told The Post.\nFresno's Real Time Crime Center, which runs 24 hours, has monitors that pan about 200 police cameras across the city\n'They are making split-second decisions based on limited facts. The more you can provide in terms of intelligence and video, the more safely you can respond to calls.'\nFresno police offered a glimpse inside their Real Time Crime Center - a cutting edge, $600,000 control room and has reportedly become the model for high-tech policing across the country.\nIn the last 10 years, similar centers have been opened in cities including Houston, New York and Seattle, according to The Post.\nFresno's crime center, which runs 24 hours, has monitors that pan about 200 police cameras across the city; officers are able to scour a private database with more than 2 billion recorded scans of car license plates across the country; and they also have access to a system called ShotSpotter that can triangulate the location from which a gunshot was fired using microphones hung around the city.\nThere is also a software program called Media Sonar that scans social media in search of illicit activity, according to The Post.\nPolice said access to the all the information is crucial to solving crimes and noted that the license plate database was key in aiding them solve a murder case in September.\nHowever, some find the surveillance in the Real Time Crime Center troubling.\nA Fresno civil rights lawyer, Rob Nabarro, told The Post that outsourcing a threat posed by an individual to software is likely problematic and that it is concerning that only Intrado knows how the threat scores are tallied.\n'It's a very unrefined, gross technique,' Nabarro said of the way the scores are tallied.\nPeople are reportedly unaware of police surveilling them for example planes with cameras reportedly filmed protests in Baltimore and Ferguson\n'A police call is something that can be very dangerous for a citizen.'\nAn Intrado representative told The Post in a statement that the software program 'works to quickly provide [officers] with commercially available, public information that may be relevant to the situation and may give them a greater level of awareness.'\nDyer said that the scores do not generate a particular response from police and that they are used as guides by operators to look more closely into a person's background for information that could be useful to an officer on scene, according to the newspaper.\nHe also noted that officers on scene do not see the scores.\nIn November, the city council called a hearing on Beware after residents voiced their concerns.\nFollowing the hearing, Dyer said he wants to make changes, such as turning off Beware's color-coded rating system and the social media monitoring, to address residents' concerns.\nMatt Cagle, attorney for the he American Civil Liberties Union of Northern California, said public discussions of surveillance technologies should be happening before the technologies are in use.","url":"https://www.dailymail.co.uk/news/article-3393463/Threat-scoring-software-calculates-billions-data-points-determine-dangerous-suspects-be.html"}
