{"authors":["Breitbart Tv"],"date_download":"2018-10-30 20:48:37","date_modify":"2018-10-30 20:48:37","date_publish":"2016-03-29 20:58:33","description":"Columbia, SC police have three women in custody for ganging up on a 20-year-old woman two weeks ago alongside a local river, according to a report by |","filename":"data/vaneerConsumption/ThreeChargedforBrutalBikiniBeatdownCaughtonCamera.json","image_url":"https://media.breitbart.com/media/2016/03/bikini-brawl.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_03_29__1540932517.html","title":"Three Charged for Brutal Bikini Beatdown Caught on Camera","title_page":"Three Charged for Brutal Bikini Beatdown Caught on Camera | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Columbia, SC police have three women in custody for ganging up on a 20-year-old woman two weeks ago alongside a local river, according to a report by WLOX.\nArlinda Craft, 18, Anns Leigh Hill, 19, and Megan Williams, 20, are all charged with Second Degree Assault and Battery by a Mob after police say they attacked another woman.\nAccording to the police report, the victim was sitting by the river with a co-worker when a group of girls attacked her. The report states one of the attackers pulled the victim by her hair before throwing her to the rocky ground. It also says members of the mob slapped her, pinned her down and repeatedly beat her, while unknown men recorded the beatdown on camera.\nThe victim was treated for serious injuries, including a concussion and lacerations.\n“One’s kicking her, and she’s completely helpless. It’s just really hard to watch,” friend of the victim Ramy Williams said. “The other one was just wailing on her face, wailing on her head, you know, on the back of her head. It definitely could have killed her.”\nThe victim is reportedly doing better physically, but not emotionally.\nShe said the attack on her was unprovoked, but she knows who the suspects are. The report says they have had problems in the past.","url":"https://www.breitbart.com/video/2016/03/29/three-charged-for-brutal-bikini-beatdown-caught-on-camera/"}
