{"authors":["Lauren Libbert For The Daily Mail"],"date_download":"2018-10-22 20:57:29","date_modify":"2018-10-22 20:57:29","date_publish":"2017-03-16 00:15:21","description":"Louise Rose, (pictured) from Maidstone, Kent, says sniffing oxygen three times a day clears her mind and increases her efficiency. Debbie Reddin, (inset) of Stoke-on-Trent, also swears by it.","filename":"data/vaneerConsumption/ThreewomenwhoclaimBoostOxygenhasimprovedtheirlife.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E50358000000578-0-image-a-35_1489628527068.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4317516_Would-pay-25-fresh-air_1540241849.html","title":"Three women who claim Boost Oxygen has improved their life","title_page":"Three women who claim Boost Oxygen has improved their life | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Until recently, Sue Clifford was constantly tired, yet found herself lying awake late into the night. Meanwhile, her once-trim figure had greatly altered.\n‘I had to come off HRT two years ago due to the cancer risk, and the effect of stopping was awful,’ recalls Sue, 58, an accounts administrator.\n‘I couldn’t sleep, was tired all the time, gained weight and had bags under my eyes.’\nSue Clifford was constantly tired, but would lie awake late into the night. She claims she has been cured of these symptoms by inhaling oxygen\nBy chance she came across an unlikely treatment she swears cured her of these symptoms almost instantly — without drugs or lifestyle changes.\nSue is one of a growing number of women who say they get a mental and physical boost from inhaling oxygen.\nIt was once a fad followed mainly by celebrities — Simon Cowell reportedly raved about its anti-ageing properties. Now ordinary women are catching on, and seeing benefits ranging from increased energy to better skin, and fewer headaches.\nSue, of Orpington, Kent, explains: ‘I first heard about inhaling oxygen at a department store’s beauty showcase, and thought I’d give it a try.’\nShe bought a 22oz can of 98 per cent pure oxygen and started inhaling it for up to four minutes in the morning, before and after work and before bed.\n‘I bought one flavoured with frankincense and grapefruit. As soon as I breathed it in, I felt uplifted and energised,’ says Sue, who now buys two to four cans a month at £24.99 each.\n‘I started to sleep better, had more energy and the eye bags disappeared. My partner says I am calmer and less grumpy too.’\nBar O2, which has sold oxygen cans in the UK since 2001, says sales are more than doubling annually. Another firm, Boost Oxygen UK, last May started selling canned scented pure oxygen. It says business is booming as Brits try to combat the effects of increasing pollution levels.\nAir contains about 21 per cent oxygen — nitrogen, carbon dioxide, argon and other gases make up the rest — but in congested areas oxygen levels can fall to as low as 14 per cent. ‘Car fumes increase carbon monoxide and sulphur dioxide levels,’ says Dr Mark Moss, head of psychology at Northumbria University, who has studied oxygen inhalation.\n‘When we breathe air, the oxygen in it bonds with haemoglobin in red blood cells and is carried to the rest of the body in the bloodstream. But if the air we breathe also contains carbon monoxide, it sticks to red blood cells instead, and stops them bonding with the oxygen — and blood oxygen decreases.\n‘This can affect our physical and mental performance because we use oxygen to produce energy.’\nBut can simply sniffing oxygen daily really improve your energy levels, health and looks? Dr Moss thinks it can.\nSue is one of a growing number of women who say they get a mental and physical boost from inhaling oxygen\nHe says: ‘Breathing in pure oxygen for a few minutes increases the blood’s oxygen saturation from about 98-99 per cent (in normal air) to 100 per cent, allowing us to make energy more efficiently, and perform some tasks better.’\nNot all experts are convinced, however. Dr Rupert Critchley, GP and founder of Viva Skin Clinics, says: ‘Humans have evolved to live in an atmosphere of 21 per cent oxygen.\n‘Upping the blood’s oxygen saturation from 99 to 100 per cent will barely make any difference as there’s no room for red blood cells to absorb any more.’ But certain studies do suggest short-term changes in ability after inhaling oxygen.\nColleagues of Dr Moss, at the University of Northumbria Human Cognitive Neuroscience Unit, found students given a one-minute blast of oxygen could remember two or three more words from a list of 15 than those who had not breathed it.\nHeaven Skincare founder, Deborah Mitchell, believes better oxygenation of our blood has an effect on our looks, too.\n‘As oxygen moves through our bloodstream it imparts nutrients that make our skin more youthful looking,’ she says.\nBut Chris Cooper, professor of biochemistry at the University of Essex, says devotees may be wasting their money.\n‘The amount of oxygen you get from a can is trivial compared to what you breathe in normal air. This is almost certainly all placebo effect,’ he says.\nLouise Rose, 41, a personal trainer from Maidstone, Kent, insists sniffing oxygen three times a day clears her mind and increases her efficiency at work. She buys one £17 can a month\nLouise Rose, 41, a personal trainer from Maidstone, Kent, insists sniffing oxygen three times a day clears her mind and increases her efficiency at work. She buys one £17 can a month.\n‘I lead a very busy life and sometimes I’d wake in the mornings, look at my packed diary, and feel overwhelmed. But now when I feel that way I take a few puffs of oxygen and it makes me feel I can cope better,’ she says.\n‘I used to get bad headaches too, but now get hardly any.’\nIndeed, the NHS uses oxygen to alleviate vicious cluster headaches. Hyperbaric oxygen therapy involves breathing 100 per cent oxygen for 10-20 minutes.\nPersonal assistant Debbie Reddin, 36, from Stoke-on-Trent, uses her can of oxygen after drinking a few too many\nPersonal assistant Debbie Reddin, 36, from Stoke-on-Trent, uses her can of oxygen after drinking a few too many.\n‘I started using it because a friend said it would be good for hangovers. I tried it after a big night and it was a great — much better than paracetamol.’\nDebbie buys two £12 cans a week. She also lets her daughter Chelsea, 17, have a few puffs to help with her exam revision.\nBut even Dr Moss, who believes inhaling oxygen improves health, warns it is possible to go too far.\n‘If you breathe pure oxygen for hours there is a danger you will increase oxygen-free radicals in the blood, which may be linked to cancer long term,’ he says.\nFor the recommended more limited use, though, Debbie, Louise and Sue, are convinced of its health benefits.\n‘I do feel it’s totally safe,’ says Debbie. ‘What can be wrong with breathing something that is more pure than the air that you’re breathing now?’","url":"https://www.dailymail.co.uk/femail/article-4317516/Would-pay-25-fresh-air.html"}
