{"authors":["Emma Glanfield For Mailonline"],"date_download":"2018-10-22 23:39:52","date_modify":"2018-10-22 23:39:52","date_publish":"2016-01-28 12:48:08","description":"Two women in their 30s and a woman in her 40s were arrested on suspicion of affray following an altercation outside Perry Wood Primary and Nursery school in Worcester.","filename":"data/vaneerConsumption/ThreeWorcestermothersarearrestedonsuspicionofaffrayafterschoolbrawl.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30AA45A000000578-0-image-a-3_1453984563145.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420865_Three-mothers-arrested-suspicion-affray-punch-parking-outside-primary-school_1540251592.html","title":"Three Worcester mothers are arrested on suspicion of affray after school brawl","title_page":"Three Worcester mothers are arrested on suspicion of affray after school brawl | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Three mothers have been arrested on suspicion of affray after an alleged punch-up over parking outside a primary school.\nThe 'brawl' occurred when one mother pulled her car onto a kerb outside Perry Wood Primary and Nursery school in Worcester yesterday morning.\nEyewitnesses said another parent knocked on the window of the vehicle to warn her children were crossing nearby, and the driver pulled over to another road 'in panic'.\nTwo women in their 30s and a woman in her 40s were arrested on suspicion of affray following an altercation over parking outside Perry Wood Primary and Nursery school in Worcester (pictured) yesterday morning\nIt is at this point the two women are said to have confronted each other and started hurling insults.\nAn eyewitness said another woman then joined in the argument and the three women squared up to each other before a punch was thrown.\nPolice were called to the scene at about 9am and two women in their 30s, and a woman in her 40s, were arrested on suspicion of affray.\nAn eyewitness, who asked not to be named, said: 'A car was parked on the kerb and people were going past.\n'I think when she put the car onto the kerb she didn't see there was anyone on the pavement.\n'The lady banged the car to say there were children going past.\n'I think the driver got a bit panicky and tried to move and there were some other people crossing with their kids.\n'They started swearing and then one of the other ladies came towards her and one punched another one.\n'School staff came out and the police came in a van and a car.\n'They took a lady down into the van and another couple off.'\nEyewitnesses said the three woman hurled insults and squared up to each other before a punch was thrown during the row about parking outside Perry Wood Primary and Nursery School in Worcester (pictured above)\nThe witness added that the altercation occurred during the rush of dropping children off at school.\n'It's that five minute rush but they are all parents, they should know about the safety of others and themselves,' she said.\nResidents in the cul-de-sac said parents regularly park on both sides of the road, across drives and on double yellow lines around 9am and 3pm.\nOne said there had been previous disputes in the area at drop-off and pick-up time.\nShe said: 'The council and the police have been notified.\n'The school have notified the parents before and asked them to be courteous but they don't take much notice.'\nOne neighbour, who has lived in the road for 28 years, said: 'We know if we have to go to a doctor's appointment we don't make it when the school run is on.\n'They park on the pavement. You can't push a pushchair through so they go into the road.\nResidents in the cul-de-sac said parents dropping their children off at the school regularly park on both sides of the road, across drives and on double yellow lines around 9am and 3pm, with previous incidents reported\n'It's not right but if we say anything to them they say you shouldn't live where there's a school.\n'They can be quite foul mouthed and nasty about it so you just bite your tongue and you learn to live with it.'\nWest Mercia Police confirmed officers had been called to the scene of an altercation in Peterborough Close at about 9am yesterday.\nA spokesman added: 'Two women in their 30s and another in their 40s all from Worcester were arrested on suspicion of affray.'\nThe force added that all three had later been released with no further action.","url":"https://www.dailymail.co.uk/news/article-3420865/Three-mothers-arrested-suspicion-affray-punch-parking-outside-primary-school.html"}
