{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 03:41:15","date_modify":"2018-10-23 03:41:15","date_publish":"2016-01-29 18:56:53","description":"Muhyadeen Osman, Bilal Ahmed and Mowled Yussuf, all 20, were found guilty at Manchester Crown Court of raping a 16-year-old girl at a hotel while they were celebrating Eid.","filename":"data/vaneerConsumption/ThreeSomalimenwhogangrapedwhite16yearoldgirlarejailedfor30years.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/30/08/30B6F64B00000578-0-image-a-12_1454140998967.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423246_Three-Somali-men-gang-raped-white-16-year-old-girl-bathroom-hotel-stayed-celebrate-Eid-jailed-30-years_1540266075.html","title":"Three Somali men who gang-raped white 16-year-old girl are jailed for 30 years","title_page":"Three Somali men who gang-raped white 16-year-old girl are jailed for 30 years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"All three were jailed for a combined 30 years at Manchester Crown Court\nThe trio also robbed the victim at the hotel, where they celebrated Eid\nThree Somali men who gang-raped a white 16-year-old girl in the bathroom of a hotel where they went to celebrate Eid have been jailed for 30 years.\nMuhyadeen Osman, Bilal Ahmed and Mowled Yussuf, all now 20, were just teenagers when they attacked the girl at the Victoria Park Hotel in Manchester, regarding her as 'easy prey', the court heard.\nThe group, then all aged 17, had spent the previous night in the hotel with a number of other men as part of Eid celebrations when one of their friends, who had met the girl on BlackBerry Messenger, brought her round saying she should 'meet his boys.'\nMowled Yussuf, left, and Muhyadeen Osman, all 20, have been jailed after raping a 16-year-old girl\nIn the run up to the assault the group moved from room to room looking for unlocked doors to hide from a porter.\nThey eventually got into a bedroom where Yussuf was first to force the girl to perform a sex act on him in the bathroom.\nDespite her repeatedly telling the group that she didn't want to have intercourse, she was forced to perform a sex act on Ahmed before he raped her.\nOsman then joined in after he had been 'hanging around' outside the door. He then moved her to the bed and raped her himself.\nTheir victim, now a university student, was left alone as the gang dispersed - only to realise that her mobile phone and cash had been taken from her handbag.\nShe initially only reported the theft but the day after the attack in 2013 she revealed the extent of her ordeal.\nDNA matching the offenders was recovered from the scene and she later picked the men out in identity parades.\nIn a victim impact statement read to the court, the teenager said she no longer felt confident to go out of the house and her education had suffered.\nAt Manchester Crown Court Yussuf was convicted of rape, oral rape and assault by penetration following a trial was jailed for ten years.\nThe rape took place at the Victoria Park Hotel in Manchester, pictured, during Eid celebrations\nAhmed, who was convicted of oral rape, was locked up for nine years whilst Osman got 12 years after being convicted of an unrelated robbery in which he mugged an innocent man on the street for his rings and mobile phone was also taken into account.\nIn dramatic scenes outside the courtroom around 60 members of Manchester's Somalian community protested against the verdicts suggesting the three men were being 'victimised' because of their race, while the victim was a white Brit.\nThey managed to pile into the public gallery and gasped as the sentences were handed down - while Yussuf flicked a middle finger at the mother of their victim, who was present.\nThe court heard the girl was on her summer holidays between school and beginning her A-levels when she began talking to a friend of the gang Ibrahim Jama on BlackBerry Messenger.\nThey exchanged messages and agreed to meet - but as Jama met her at a bus stop shortly before 11am, he soon convinced her to perform a sex act on him in an alleyway.\nProsecuting, Henry Blackshaw said: 'He then made reference to 'his boys' that were at the Victoria Park hotel, so she accompanied him.\n'Once in the hotel she was then involved in what was talked about as a game of going to hotel rooms with the group and hiding away from the porter.'\nCCTV then captured the group and the girl disappearing into one hotel room for around 30 minutes while the attacks took place.\nThe trio were found guilty after a trial at Manchester Crown Court, pictured, and jailed for 30 years\nThe court heard that all three men continue to protest their innocence and other men who had a sexual encounter with the victim on the same day have not been arrested.\nOn behalf of Osman, Michael Goldwater said: 'What these defendants did wrong is allowing themselves to believe this young lady was willing to perform virtually any sex act on all of them, and failing to make an enquiry about her willingness or indeed to care very much one way or the other.\n'These were young, immature men who got carried away.'\nBut jailing the men, Judge David Hernandez said: 'This was a large group of young men in a hotel and the inference is you all saw her as easy prey.\n'She didn't really understand what was on your mind and that is probably because she was a naïve and sexually inexperienced and vulnerable young girl.\n'When you were running around that hotel she probably saw this as innocent, childish fun, but it all turned sinister when you got her into the bathroom. She found herself in a situation she was totally unable to control.\n'She found herself confronted with demands for sexual activity she did not wish to engage in and did not willingly consent. She had no choice and no opportunity to refuse.'\nJama was cleared of conspiracy to commit rape during the trial.","url":"https://www.dailymail.co.uk/news/article-3423246/Three-Somali-men-gang-raped-white-16-year-old-girl-bathroom-hotel-stayed-celebrate-Eid-jailed-30-years.html"}
