{"authors":[],"date_download":"2018-10-30 01:12:44","date_modify":"2018-10-30 01:12:44","date_publish":"2016-11-15 00:00:00","description":null,"filename":"data/vaneerConsumption/Threateningtoassassinatethepresidenthasconsequences.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_11_threatening_to_assassinate_the_president_has_consequences_1540861964.html","title":"Threatening to assassinate the president has consequences","title_page":"Threatening to assassinate the president has consequences","title_rss":"NULL","source_domain":"americanthinker.com","text":"Remember, this isn't the alt liberal-left – the fringe. These are the feelings, the attitudes, and the beliefs of a substantial proportion of liberals. After all, President Barack Hussein Obama (D) and other elected Democrats haven't condemned these violent snowflakes. Dominating the culture for so long, these lefties thought they could do anything and get away with it. But they can't.\nThe ugliness, the hate, the narrow-mindedness, the violence, the authoritarianism of the liberal left unleashed by the election of Donald J. Trump (R), despised by the self-proclaimed dealers of peace, tolerance, love, and open-mindedness, as documented here by Carol Brown and other right-thinking media (and minimized by the so-called mainstream media), is revealing.\nFor instance, Matt Harrigan, CEO of cyber-security firm PacketSled, is, like most of the Silicon Valley executives, bright but arrogant and condescending to those who disagree with him. Despite Harrigan's wishes, Trump was elected. And so Harrigan publicly announced he would assassinate Trump. Although most of the original statements and tweets have since been deleted, Jim Hoft of Gateway Pundit captured the ugliness in a series of screen shots.\nNot surprisingly many of the liberal left, in all its non-peace-loving, narrow-minded glory, approved.\nBut others didn't, so Harrigan offered a weak apology, blaming those offended for being offended at his mighty, superior self.\nMy recent facebook comment was intended to be a joke, in the context of a larger conversation, and only privately shared as such. Anyone who knows me, knows that I do not engage in this form of rhetoric with any level of seriousness and the comment most certainly does not represent my real personal views in any regard. I apologize if anything that I said was either taken seriously, was offensive, or caused any legitimate concern. Best Regards, Matt Harrigan\nThreatening to kill anyone, especially a public figure such as a president, is not funny. Other PacketSled executives were not amused, immediately notifying the Secret Service of Harrigan's statements – just as he wished – and placing him on \"administrative leave.\"\nPacketSled takes recent comments made by our CEO, seriously. Once we were made aware of these comments, we immediately reported this information to the secret service and will cooperate fully with any inquiries. These comments do not reflect the views or opinions of PacketSled, its employees, investors or partners. Our CEO has been placed on administrative leave.\nHe should be fired for damaging the reputation and potential worth of the company. With no apologies.\nUpdate, from packetsled.com:\nThe PacketSled Board of Directors accepted the resignation of President and CEO Matthew Harrigan, effective immediately. Fred Wilmot, the company’s Chief Technology Officer, will serve as interim CEO while the Board of Directors conducts a search for a permanent replacement. We want to be very clear, PacketSled does not condone the comments made by Mr. Harrigan, which do not reflect the views or opinions of the company, its employees, investors or partners.\nThomas Lifson adds: This will encourage other liberals to behave themselves, as Voltaire wrote in Candide:","url":"https://www.americanthinker.com/blog/2016/11/threatening_to_assassinate_the_president_has_consequences.html"}
