{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-22 22:18:38","date_modify":"2018-10-22 22:18:38","date_publish":"2016-01-29 09:11:05","description":"Daniil Slisarenko, Alexander Sanko and Danill Vinnik were all killed after falling down the hole in the grounds of their school in Petropavlovsk-Kamchatsky in the extreme east of Russia.","filename":"data/vaneerConsumption/ThreeRussianschoolboysagedeightboiledaliveinheatedsewer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/09/30B0CB9000000578-0-image-a-17_1454058659938.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422385_Three-eight-year-old-schoolboys-boiled-alive-80C-water-one-slips-heated-sewer-used-supply-heating-Russian-town-friends-fall-trying-save-him_1540246718.html","title":"Three Russian schoolboys aged eight boiled alive in 'heated sewer'","title_page":"Three Russian schoolboys aged eight boiled alive in 'heated sewer' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Three eight-year-old schoolboys were boiled alive in 80C water after one slipped into a 'heated sewer' in a Russian city and the other two fell in trying to save him.\nDaniil Slisarenko, Alexander Sanko and Danill Vinnik were all killed after falling down the hole in the grounds of their school in the city of Petropavlovsk-Kamchatsky in the extreme east of Russia.\nA criminal probe has been launched into suspected negligence into a failure to respond to warnings from locals that the sewer was not safe.\nDaniil Slisarenko, Alexander Sanko and Danill Vinnik were all killed after falling down the hole in the grounds of their school in the city of Petropavlovsk-Kamchatsky in the extreme east of Russia\nThe schoolboys were boiled alive in 80C water after one slipped into a 'heated sewer' in a Russian city and the other two fell in trying to save him\n'A wooden decking covering the hot sewer evidently broke or collapsed leaving a two and a half metre hole,' reported The Siberian Times.\n'Some reports were that it was covered in cardboard.\n'Locals had reported a problem at the site, but it had not been repaired. The hot water in the sewer was used for the city heating supply.'\nCity newspaper publisher Yevgeny Sivayev, said: 'It is no exaggeration to say that the city is crying. Such grief we have not had before.\nThe city of Petropavlovsk-Kamchatsky has been left in shock following the tragedy which unfolded on Thursday\nA criminal probe has been launched into suspected negligence into a failure to respond to warnings from locals that the sewer was not safe\n'It is impossible to look at children - their bodies are packed in bags.'\nPictures showed their remains in black bags in the snow at the site of the horror.\nHe added: 'Judging by the fact that straps of the first boy's backpack were torn off, his friends wanted to help him as he fell and pulled him up.\n'It did not work. So they fell in there trying to save him. The rescuers first found them, and could not reach the first boy for a long time. The temperature there is over 80C, very high.'\nIt is unclear why the boys were at school on January 29 because all educational institutions were supposed to be closed. The tragedy happened in the city of Petropavlovsk-Kamchatsky (shown on the map)\nCity mayor Dmitry Zaitsev is to pay for the funerals of Daniil Slisarenko, Alexander Sanko and Danill Vinnik\nIt is unclear why the boys were at school on January 29 because all educational institutions were supposed to be closed.\n'Why they were there at all is not clear. After all, January 28 was declared quarantine for influenza, and all schools were closed.'\nA police source said: 'The three boys disappeared on Thursday afternoon. They had left the school but had not come home.\n'Police, volunteers and Emergencies Ministry employees had started searching for them. The boys' bodies were found in the open hatch of a hot sewer located near the school building.'","url":"https://www.dailymail.co.uk/news/article-3422385/Three-eight-year-old-schoolboys-boiled-alive-80C-water-one-slips-heated-sewer-used-supply-heating-Russian-town-friends-fall-trying-save-him.html"}
