{"authors":[],"date_download":"2018-10-30 20:35:46","date_modify":"2018-10-30 20:35:46","date_publish":"2015-10-07 21:43:33","description":"Three people, including a juvenile, have now been charged in an armed robbery and shooting in Riverdale that police say may have been drug related.","filename":"data/vaneerConsumption/ThreechargedinRiverdalerobberyshooting.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_three-charged-riverdale-robbery-shooting__1540931746.html","title":"Three charged in Riverdale robbery, shooting","title_page":"Three charged in Riverdale robbery, shooting","title_rss":"NULL","source_domain":"ajc.com","text":"Three people, including a juvenile, have now been charged in an armed robbery and shooting in Riverdale that police say may have been drug related.\nThe victim, who was not identified, was shot in the back of the head and lost an eye in the Sept. 1 incident at the Brooks Crossing apartments.\nBrandon Miguel Tillery was arrested at his home Tuesday. Members of the Clayton County Sheriff’s Office SWAT team, the Riverdale police and the Clayton County Fugitives Task Force were involved.\nTillery allegedly “shot the victim in the back of the head with a .380 caliber handgun,” according to an announcement by Clayton County Sheriff Victor Hill.\nThe names of the two other people charged in the case had not been made public as of Wednesday afternoon, said Riverdale assistant police chief Michael Reynolds, who said the case is still open and under investigation.\nReynolds said the shooting may be “possibly drug related.”\nTwo of the suspects, including the juvenile, are charged with aggravated assault and armed robbery, Reynolds said. The third is charged with aggravated assault, armed robbery and aggravated battery.","url":"https://www.ajc.com/news/crime--law/three-charged-riverdale-robbery-shooting/nBTmeNhxInDwyDqHRuc7GJ/"}
