{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-22 22:26:53","date_modify":"2018-10-22 22:26:53","date_publish":"2016-01-29 09:29:15","description":"The network has sent letters to UK customers affected informing them of the automatic changes. In response, users vented their fury by hijacking and ridiculing the firm's #makeitright slogan.","filename":"data/vaneerConsumption/Threedoublesthecostofbillsforhundredsofthousandsoftheircustomers.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/09/046259BE00000514-0-image-a-16_1454058617732.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422375_Mobile-phone-users-fury-Three-doubles-cost-bills-hundreds-thousands-longest-serving-customers-15-30-month_1540247213.html","title":"Three doubles the cost of bills for hundreds of thousands of their customers","title_page":"Three doubles the cost of bills for hundreds of thousands of their customers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Company said it was phasing 'legacy' plans out, against wishes of users\nCustomers have 30 days to either choose another plan or leave Three\nThree has sent a letter to those affected by the change advising them that the switch will take place automatically, giving them 30 days to either choose another deal or cancel the contract\nMobile phone users have vented their frustrations at coverage giant Three after it sent letters round to loyal customers informing them it was doubling their phone bills.\nMany customers on the network's 'legacy' tariffs, including the All You Can Eat plan priced at £15, are being automatically moved to the closest existing plan of £30.\nThe price hike will affect customers whose contracts had finished with the firm and were afterwards moved to a rolling one-month agreement.\nThree has sent a letter to those affected by the change advising them that the switch will take place automatically, giving them 30 days to either choose another deal or cancel the contract.\nThe letter read: 'We're always working to make sure we offer some of the best plans on the market, with great value minutes and data that helps our customers get the most out of their phones.\n'But to do this, we have to changes our plans every so often.\n'As your minimum term has ended and the plan you are currently on is being phased out, you will need to change to one of our new plans.\n'But there's no need to worry, we've got a great range of new plans to suit your needs.\n'We're writing to let you know that we plan to transfer you onto one of our new plans which most closely aligns with your current plan allowances.'\nUsers affected by the change took to social media to criticise the firm, hijacking its new marketing slogan #makeitright.\nAmong those to comment online was Jonathan Morris, whose tariff could go up from £15 to £30\nAmong those to receive a letter this week was Jonathan Morris, who has been with the company on and off since it began in 2003.\n'They scrapped the £15 plan i'm on with a bunch of others in 2014 so people have sort of seen this coming I suppose,' he said. 'They obviously want a big clear out of the legacy plans.\n'It is just ridiculous to put me on a new tariff that doesn't match my old one yet is twice the price. They are haggling with a few people but it seems they only bother to do that if they consider you to be a valuable customer, namely that you have a really expensive contract already.\n'It's all incredibly ironic given the #makeitright campaign they launched last year. They used to be the only network which didn't increase bills mid-contract to account for inflation, but they do now, so how are they making things right?\n'I get that they are a business and need to make money and be competitive, but don't start this campaign about making it all better and fighting against things that \"suck\", to use their word.'\nColin Durrans wrote: 'I can't believe the @ThreeUK up-selling. They planed to double my costs despite the lower priced packages that meet my usage!'\nTwitter user @idspip said: '@ThreeUK you are bumping up my contract from £17 to £30!?!? For a one-month sim only rolling contract?? #MakeItRight #GotItWrong'\nMeanwhile, Nick Robinson tweeted: 'Ever since Three introduced #makeitright they've got everything wrong!'\nOfcom told MailOnline that it had received several complaints from customers in relation to the price hike.\nA Ofcom spokeswoman said: 'We are aware that some consumers are unhappy following Three's decision to phase out some of its legacy plans.\n'We have contacted Three for further information on its decision to ensure that customers are being treated fairly.'\nA Three spokesman said: 'In March 2014, we introduced new price plans giving customers more options in the size of their data and voice bundles, as well as limits and alerts to prevent bill shock.","url":"https://www.dailymail.co.uk/news/article-3422375/Mobile-phone-users-fury-Three-doubles-cost-bills-hundreds-thousands-longest-serving-customers-15-30-month.html"}
