{"authors":["Deni Kirkova For Mailonline"],"date_download":"2018-10-22 23:46:34","date_modify":"2018-10-22 23:46:34","date_publish":"2016-01-29 12:17:40","description":"Lisa McPartland, 37, from Liverpool, posts pictures of her three dogs Elsa, Anna and Olaf wearing fancy dress and posing in comical scenarios. She now has 27,000 followers on Instagram.","filename":"data/vaneerConsumption/ThreechihuahuashavebecomeInstagramstarswithdecadentphotos.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1B0E900000578-0-image-a-9_1454065818335.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422579_Three-chihuahuas-Instagram-stars-decadent-photos-quaffing-champagne-having-makeovers-bodybuilding_1540251994.html","title":"Three chihuahuas have become Instagram stars with decadent photos","title_page":"Three chihuahuas have become Instagram stars with decadent photos | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Three photogenic chihuahuas have become Instagram stars thanks to a variety of imaginative poses and cute costumes.\nLisa McPartland, from Liverpool, has amassed more than 27,000 followers in a year after posting comical pictures of her three dogs Elsa, Anna and Olaf.\nThe 37-year-old set up the page when one of her pooches, Elsa, developed a heart murmur and she was told she might not survive.\nScroll down for video\nLisa McPartland, from Liverpool, named her three dogs after characters from the film Frozen because her daughter loves it. Here one of the decadent pooch's is pictured in a dressing gown and spectacles enjoying a glass of champagne\nLisa decided to dress Elsa up and post pictures online as she wanted to create more memories. Here a cosmetic-loving pooch - with trendy HD brows - is pictured having a makeover\nIn a bid to snap some memories with her chihuahua, Lisa decided to dress her up and post pictures online, but was shocked by how quickly it went viral.\nLisa said: 'I just started taking normal pictures of the dogs but then one day I saw Elsa put her paw on something and she really looked like she was posing.\n'The costumes then just sort of spiralled out of control, I don't even know where it came from - they all just sit there and pose perfectly though so it's fun for all of us.\n'The Instagram account is amazing because I always get messages from people saying they look forward to seeing the pictures I post.\n'We named them all after the film Frozen because my youngest daughter loves it - now we watch it with the dogs and I think they enjoy it, it's an on-going joke in our family.'\nA gangster pooch poses with a cap, a bandana, a bottle of Jack Daniels and some serious bling in the shape of a dollar sign. Lisa said that her chihuahuas Elsa, Anna and Olaf love to pose for the camera\nA spectacle-wearing pooch enjoys a copy of FHM and a cup of coffee. She says the costumes got out of control and she was shocked by how quickly the account went viral\nOne of the dog's licks its lips at the sight of a fake hot dog and a bottle of tomato ketchup. The stay-at-home mother-of-two set up the account just over a year ago\nLisa posts pictures of her pooches almost every day and says she would like them to try dog modelling in future.\nThe stay-at-home mother-of-two set up the account just over a year ago and is gobsmacked at how quickly it's taken off.\nHer other dog, a four-year-old Staffie called Sampson, has also featured and whilst Lisa claims he's not as into having his picture taken as the others, he still likes to get involved in the fun.\nSome of the ingenious images include one of the pup's posing with a bottle of champagne in a pair of glasses and a dressing gown and a cosmetic-loving pooch - with trendy HD brows - having a makeover.\nAnother shows one of the dog's licking their lips at the sight of a fake hot dog and a bottle of tomato ketchup. Meanwhile a gangster pooch poses with a cap, a bandana, a bottle of Jack Daniels and some serious bling in the shape of a dollar sign.\nAnother pooch - presumably Elsa - goes back to her Frozen roots donning the heroine's blonde plait and turquoise outfit.\nThis pup is pictured in full fishing gear inlcuding doggy waders. Lisa posts pictures of her pooches, who are all around a year old, almost every day\nLisa, pictured with her chihuahua Elsa, says she would like them to try out dog modelling in the future\nOne of the pup's poses with a dumbbell and protein powder with a mini towel slung over its shoulders'I always get messages from people saying they look forward to seeing the pictures I post'\nThis pooch - presumably Elsa - goes back to her Frozen roots donning the heroine's blonde plait and turquoise outfit. Lisa said: 'We get sent presents all the time from fans who love our work, they send dog treats'\nAlcohol is a common theme with Elsa, Anna and Olaf posing with a variety of beverages. Another more wholesome snap features one of the pup's with a dumbbell and a tub of protein powder, a mini towel slung over its shoulders.\nAnother inspired scenario sees a reggae pooch take inspiration from Bob Marley to pose in a Rasta hat and dreads.\nUnfortunately Lisa is currently locked out of the account - lisamcpartland7 - which she thinks has been hacked.\nLisa said: 'The support's been great, I've had messages from people all over the world telling me how great the pictures are.\n'We get sent presents all the time from fans who love our work, they send dog treats and food and other things, it's so lovely.\n'These dogs helped me out of a dark time in my life and I just love them to pieces - there are times when you can tell they're not in the mood for pictures though, and I'd never force them to do anything they didn't want to.\n'I just hope that I'll be able to get back into my account though because there's a lot of hard work that's gone into it and I'm scared I won't be able to retrieve all of my pictures and videos.'\nHer other dog, a four-year-old Staffie called Sampson, has also featured on the account - but isn't as camera ready as the chihuahuas. Here he poses in glasses and a suit after what appears to have been a boozy binge\nAlcohol is a common theme with all of the pets posing with various beverages - here a bottle of Jack Daniels and Smirnoff vodka\nThis discerning wine enjoys and full-bodied and fruity red. Lisa has ammassed 27,000 Instagram followers and has received messages from fans all over the world\nAnother inspired scenario sees a reggae pooch take inspiration from Bob Marley to pose in a Rasta hat and dreads. Lisa says creating the funny photos helped her out of a 'dark place' in her life","url":"https://www.dailymail.co.uk/femail/article-3422579/Three-chihuahuas-Instagram-stars-decadent-photos-quaffing-champagne-having-makeovers-bodybuilding.html"}
