{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-23 00:11:05","date_modify":"2018-10-23 00:11:05","date_publish":"2017-03-16 09:12:58","description":"Mother-of-two Kayleigh Hughes, 29, from Grantham, saves thousands of pounds each year by scouring her local charity shops for designer clothes, homeware and kids' toys and books.","filename":"data/vaneerConsumption/Thriftymumsavesthousandsbyscouringcharityshops.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/16/3E4E062E00000578-0-image-a-3_1489595498640.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4316450_Thrifty-mum-saves-thousands-scouring-charity-shops_1540253465.html","title":"Thrifty mum saves thousands by scouring charity shops","title_page":"Thrifty mum saves thousands by scouring charity shops | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A thrifty mother-of-two has revealed how she saves thousands of pounds every year by only buying clothes in charity shops - and having a keen eye for a bargain.\nKayleigh Hughes, 29, from Grantham in Lincolnshire, has snapped up bargains from brands like Calvin Klein, UGG and Monsoon for a fraction of the original price - and recently set herself a strict budget of just £3 per item.\nThe penny-pinching shopper, who is currently pregnant with her third child, loves trawling her local charity shops to pick up the best bargains.\nKayleigh, a money-saving blogger at PromotionalCodes.org.uk, has a keen eye for a good deal and says she's able to clothe her family for pennies rather than splashing out on new items.\nScroll down for video\nThrifty mother-of-two Kayleigh Hughes, 29, from Grantham, has learned a raft of tips and tricks over the years to save money on everything from family meals to designer clothes\nHer best finds include a pair of Uggs for just £20 instead of £150, a £250 pair of leather boots for just £6, and brand new bedding for £4 instead of £36.\nHowever Kayleigh, who says the trick to charity shopping is being patient, says it's vital to not be sucked into buying cheap clothes that you could afford to buy full price.\nShe avoids buying second hand clothes and shoes originally from supermarkets and value clothing retailers, and instead keeps her eye out for designer buys and quality high street finds.\nIn recent months, Kayleigh has got to know when her local charity shops rotate stock - and is even on first name terms with the staff.\nShe says little bits of 'insider information', such as when new items are due, can help to keep her ahead of the game and first in line for a bargain.\nKayleigh's bargain-bagging tips • Get to know when your local charity shop rotates stock and become friendly with the staff • Set yourself a £3 limit per item when you hit charity shops Kayleigh Hughes has learned a string of top tips for shopping in charity shops • Don't get carried away when you're searching • Check everything really closely for stains, snags or holes • Don't buy bedding unless it's in the original packaging and hasn't been used • For crockery, always examine closely for chips or scratches • Look for items with the tags on, as this will usually mean they are brand new and never been worn • Keep your eye out for designer buys and quality high-street finds • Avoid second hand clothes and shoes from supermarkets or value clothing retailers, as there won't be much cost difference • Don't be afraid to ask if they have any extra stock in the back; it's a good way to haggle on the price if it hasn't yet been labelled • Explore charity shops that are located in affluent areas. This is a great way to potentially bag designer gems for practically pennies\nKayleigh said: 'Over the last 12 months I've really got to grips with my local charity shops and they're an absolute treasure trove.\n'I buy no end of clothes for me, my husband and the two boys and rarely come out without a good bargain.\n'Shoes have been great lately. I got a pair of £150 Uggs for £20, which have hardly been worn. I've also picked up a pair of Ted and Muffy boots. These retail full price at £250 and I paid just £6.99 for them. They have to be my best bargain to date.\n'I also snapped up a pair of silver glitter boots which were retailing at £29.99. I paid just £5 – they're perfect for going out.\nKalyeigh, who is expecting her third child, paid just £7 for this Gap maternity jumper (originally costing around £40, left) and 99p for this printed t-shirt (right, originally around £5)\nOne of Kayleigh's recent finds, a pink tasselled top from Danni Minogue's clothing line for Target. The penny-pinching shopper has also snapped up items from Topshop and M&S\nKayleigh's biggest charity shop bargains Item Full price (approx) Kayleigh paid Ted & Muffy Leather boots £250 £6 UGG boots £250 £20 New Look silver glitter boots £29.99 £5 M&S King size bedding £36 £4 New Look dress (brand new) £19.99 99p Full Circle t-shirt £12.99 £2 Topshop silver bomber jacket £60 £2.99 Monsoon boy's shirt £16 £2.49 Next kid's joggers £10 99p GAP white linen shirt (women's) £40 99p Per Una white jeans £35 99p Kaliko silk skirt £70 99p Monsoon Fusion dress £70 £3.99 Calvin Klein cold shoulder t-shirt £45 £2.99\n'Clothes are great at my local charity shop. They often sell kids' items at three for 99p – I've picked up designer items and regular high street buys from places like Next, Mothercare, Monsoon and Gap for next to nothing.'\nKayleigh added: 'Women's clothes are good too but you need to be prepared to have a proper look through. I found a Calvin Klein cold shoulder top for just £2.99, a Monsoon Fusion dress for £3.99, a Top Shop silver bomber jacket for £2.99 and dresses for as little as 99p.\n'It is too easy to get carried away in a charity shop because everything is so cheap. I always make sure I check everything really closely.\nKayleigh paid just 49p for this Star Wars shirt for her son, originally around £7. She has managed to pick up second-hand bargains from Mothercare, Monsoon and Gap\nThe thrifty mum bagged these £250 UGG boots for £20, left, as well as these heeled leather boots, right, for a fraction of their original price - but has since limited herself to £3 per item\nThe mother-of-two, expecting a third, says: '[Charity shops] often sell kids' items for three for 99p – I've picked up designer items and regular high street buys from places like Next'\n'If it's discoloured, stained or shows any sign of snags or holes, then it's a definite no, regardless of how little it costs.\n'I always take a look at the items with the tags still on – you'd be amazed at how many of them you find in charity shops.\n'The boys always check out the toys and books. I can normally get three books for 99p – you can't buy one brand new book for that. When the boys outgrow them and providing they're still in good condition, we always donate them back to the charity shop.\n'I do that with everything. If the shop can sell them twice over then it's more cash for the charity and someone else can benefit from picking up a bargain.'","url":"https://www.dailymail.co.uk/femail/article-4316450/Thrifty-mum-saves-thousands-scouring-charity-shops.html"}
