{"authors":["John Binder"],"date_download":"2018-10-30 19:11:55","date_modify":"2018-10-30 19:11:55","date_publish":"2017-04-26 18:11:55","description":"An MS-13 member living in the U.S. was deported a third time to El Salvador by federal immigration officials, now to face murder charges.","filename":"data/vaneerConsumption/ThriceDeportedMS13MemberSentHomeforMurderCharges.json","image_url":"https://media.breitbart.com/media/2014/12/ms-13-arms-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2017_04_26__1540926715.html","title":"Thrice-Deported MS-13 Member Sent Home for Murder Charges","title_page":"Thrice-Deported MS-13 Member Sent Home for Murder Charges","title_rss":"NULL","source_domain":"breitbart.com","text":"An MS-13 gang member living in the U.S. was deported a third time to El Salvador by federal immigration officials, now to face murder charges.\nSantiago Humberto Rodriguez-Aparicio, a 41-year-old illegal immigrant, was flown to his native country and handed over to El Salvadorian authorities, where he will face murder charges for three homicides and illegally discharging a firearm, according to an Immigration and Customs Enforcement (ICE) news release.\nAccording to El Salvadorian authorities, in April 2015, Rodriguez-Aparicio was involved in an MS-13 gang-related shooting that ended with the death of three individuals.\n“ICE has a long history of working cooperatively with international law enforcement agencies to effect removals and ensure that fugitive aliens are returned to face justice,” ICE’s San Antonio director for removals Daniel Bible said in a statement. “ICE combines our unique immigration enforcement authorities and our international partnerships to help protect our communities from criminal aliens who pose a public safety threat.”\nThis was the third time Rodriguez-Aparicio was deported from the U.S.\nIn February 2007, Rodriguez-Aparicio arrested and ordered for deportation to El Salvador by an immigration judge. The next month, Rodriguez-Aparicio was deported.\nIn January 2009, Rodriguez-Aparicio illegally re-entered the U.S. and was arrested in Las Vegas, Nevada where he was later convicted for re-entry and for owning a gun illegally. Rodriguez-Aparicio was sentenced to 41 months in federal prison and was later deported again to El Salvador in 2012.\nIn March 2015, Rodriguez-Aparicio once again entered the U.S. illegally and was immediately arrested and detained by U.S. Border Patrol agents near Hidalgo, Texas. Rodriguez-Aparicio was convicted in a Texas court to 27 months in federal prison for re-entering the U.S.\nThe MS-13 gang has flourished with the rise of illegal immigration across the U.S. As Breitbart Texas reported, there are more than 200 MS-13 gang members in Long Island, New York alone, with more along the Atlantic seaboard in states like Virginia and North Carolina.","url":"https://www.breitbart.com/border/2017/04/26/thrice-deported-ms-13-member-sent-home-murder-charges/"}
