{"authors":["Allan Hall In Berlin","Julian Robinson For Mailonline"],"date_download":"2018-10-23 00:35:47","date_modify":"2018-10-23 00:35:47","date_publish":"2017-03-10 07:24:32","description":"Marcel Hesse was arrested last night for luring a young neighbour called Jaden into a cellar in Herne, Germany on Monday and stabbing him 56 times.","filename":"data/vaneerConsumption/Thrillkillerposedwithknifeinhomeofsecondvictim.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E23C20800000578-0-image-a-41_1489161567774.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300230_Child-killer-held-Germany-two-bodies-found_1540254947.html","title":"'Thrill killer' posed with knife in home of second victim","title_page":"'Thrill killer' posed with knife in home of second victim | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A German 'thrill killer' posed for a picture with a bloodied knife inside the flat of a second victim he stabbed 68 times, it has emerged.\nMarcel Hesse was arrested last night for luring a young neighbour called Jaden into a cellar in Herne, Germany on Monday and stabbing him 56 times.\nThe 19-year-old, who had been on the run for four days, then alerted police to a burning flat nearby where they found a second body of a man identified only as 22-year-old Christopher W.\nIt has since emerged that Hesse, who was rejected by the German army for being unstable, had sent an image to a friend showing him holding up a blade in the same apartment.\nPolice today described him as a 'brutal killer' and said he had admitted both crimes.\nThe teenager is believed to have taken shocking video and photos of Jaden's murder before posting it on the 'dark web' of the Internet and going on the run sparking a massive police manhunt.\nScroll down for video\nMarcel Hesse posed for a picture (above) with a bloodied knife inside the flat of a second victim he stabbed 68 times, it has emerged\nMarcel Hesse, 19, who is suspected of video taping the gruesome murder of a boy in Germany, was arrested last night (pictured)\nPolice say Hesse (pictured left), a martial arts fanatic, lured Jaden (right) into the house and then into the cellar where he recorded his brutal murder\nAfter killing Jaden and then hiding in a wood, Hesse went to the home (pictured today) of Christopher W, police say\nHe also shared messages and photos on WhatsApp and in online chat rooms and some of that material was later posted back on to the dark web.\nIn one message on an internet chat room, he wrote: 'I have cut myself in the hand as I fought the 120kg beast'.\nPictures show him washing a knife and posing for a selfie with blood on his hands while in another message he boasted: 'I know that people die slowly when you slaughter them.'\nAnother chilling note believed to have been posted by Hesse was translated as saying: 'I just killed the neighbour's child, doesn't feel bad tbh, my hand bleeds lil' which is the only thing annoying me.\n'I actually wanted to get a girl in here so I can rape her.'\nLast night he wandered into a fast-food outlet in his home town before telling staff: ' I am the man they are looking for.' Police say he then informed them about the burning building.\nAfter killing Jaden and then hiding in a wood, Hesse went to the home of Christopher W, police say. They ate together, then played computer games and Hesse turned in at 2am.\nHesse shared a series of pictures with a friend via WhatsApp which showed him washing a knife under water\nAnother picture showed a folded up knife along with the message 'think that's enough equipment'\nThe body of the boy was discovered by police in the cellar of a house by his stepfather. Police and forensics are pictured taking the body away on Tuesday\nHe murdered the friend he met at a technical college the next day and did not leave the apartment again until Thursday night when he turned himself in, police say.\nUnlike in many other criminal cases in the country, the suspect was fully named in German media as a police hunt got underway.\nSuspects in Germany are identified only by their first name and the first letter of their surname because of the country's strict privacy laws.\nHesse went into the Thessaloniki Grill in Herne at 9.07pm to ask the owners to call police.\nThe owner Cheitidis said: 'He came in here at 8.10pm in black clothes with an umbrella and carrying a sack of onions in one hand.\nHesse is said to have written in an Internet chat room in the hours following the brutal murder of Jaden: 'I have cut myself in the hand as I fought the 120kg beast'. He is pictured in one of his posts\nHesse is believed to have taken video and photos of the murder before posting it on the 'Darkweb' of the Internet. A heavily blurred screenshot from the film is shown above\nHesse is understood to have written these translated messages to a friend before Jaden's death on Monday\nIn one exchange believed to involve Hesse, someone asks him: 'So, before you die... why?' to which he respondes: 'Cuz I don't want to go to work'\nAnother chilling message believed to have been posted by Hesse was translated as saying: 'I just killed the neighbour's child, doesn't feel bad tbh, my hand bleeds lil' which is the only thing annoying me'\n'He said in a soft voice he was Marcel. \"Which Marcel is that then\", I asked.\n\"'Look on your tablet,\" he said. \"You will see a picture of me there.\"'\nHe then asked him to call the police, which he did, and they turned up ten minutes later in force to arrest him.\nJust 150 meters away a flat was burning where a body was discovered inside.\nPolice said in a tweet: 'The arrested man gave us information about the burning flat.'\nA neighbour of the burning apartment said a young man lived there alone, visited from time to time by his mother.\nThis morning, Reinhard Peters, lawyer for the family of Jaden, said: 'The family is relieved that he has been captured alive to await the full punishment of the law for his crime.'\nJaden was found in a huge pool of blood by his stepfather.\nMarcel Hesse, 19, walked into a fast-food outlet (pictured) in the town of Herne where he lived and said: 'Please call the police - they are looking for me'\nForensics were seen working in the street last night after an apartment fire was extinguished in Herne, Germany. Officers made the grim discovery of another body inside last night\n'The picture of my stepson lying there dead....I will never forget this,' said Pascal R., 34, who found the boy dead from numerous stab wounds on Monday evening. 'I found him lying in a giant lake of his own blood.'\nPolice say Hesse, a martial arts fanatic, lured Jaden into the house and then into the cellar where he recorded his brutal murder. It is unclear whether there was a sexual motive.\nDetectives on a specially formed murder squad believed he may have killed another person. At the time they said he appeared on an Internet chat room in the hours following the killing to say he had attacked a woman, adding: 'She offered more resistance than the child.'\nHesse, who was this afternoon revealed to have been rejected by the German Bundeswehr army for service because he was too unstable, mentioned 'torture' to get the woman's bank details and pin card number.\nHesse had lived in the house where he killed Jaden for many years with his parents, but he was home alone since the beginning of the year with his sister Sandra after his mother and father moved.\nInvestigation: Forensics descended on a flat in Herne, Germany today after police discovered a body inside\nPolice rushed to the apartment last night after seeing that it was on fire - only to find a body inside\nThe corpse of a man was found inside a burning building last night. Emergency crews are pictured at the scene overnight\nJeanette F., 41, mother of Jaden, told the Bild newspaper in Germany; 'Sandy told us once that her brother was an absolute psycho.'\nPascal R. went on to tell the paper; 'We had been shopping, my wife and I. Maurice and Steven, his stepbrothers, and Jaden stayed at home.'\nHe said at 6pm on Monday evening the doorbell to his home rang. Hesse was there and he asked Jaden if he could come to his home to help him set up a pair of ladders.\nHe went with him. The parents returned home two hours later and Jaden had not returned home. 'I went over and banged and yelled but no-one answered,' said the stepfather.\n'Something bad has happened,' Jeanette remembered saying to her husband. It had; Jaden was murdered with more than 40 stab wounds.\nInterpol helped in the search for Marcel Hesse, 19, a bespectacled martial arts enthusiast, who allegedly carried out the murder at his home in the town of Herne. Police are pictured on Tuesday as they examined the murder scene\nPolice stand guard outside the house in the town of Herne on Tuesday where a nine-year-old boy was brutally murdered the day before\nA huge manhunt was launched underway but the search came to an end with an arrest last night. Forensics are pictured at the scene on Tuesday after the discovery of Jaden's body\nPascal and his stepsons clambered over a balcony wall to enter the cellar area of the house where Jaden lay. 'I wanted to give him a massage on his heart but blood was streaming from his wounds,' he added.\nPolice later said as the boy was stabbed multiple times Hesse filmed his demise and posted video and stills on the so-called 'Darknet' - the lurid, unpatrolled side of cyberspace specialising in pornography, paedophilia, drugs and 'snuff' movies.\nIt was a Darknet user - who claimed to know the killer - who was upset by the images of the little boy who contacted police to tell them; 'I have just seen a boy murdered on the Internet.'\nThe alleged killer also entered a chatroom after the murder and held his bloodstained hands up to the camera.","url":"https://www.dailymail.co.uk/news/article-4300230/Child-killer-held-Germany-two-bodies-found.html"}
