{"authors":[],"date_download":"2018-10-30 14:19:57","date_modify":"2018-10-30 14:19:57","date_publish":"2016-01-25 00:00:00","description":null,"filename":"data/vaneerConsumption/Throughthelookingglassdarkly.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_01_through_the_looking_glass_darkly_comments_1540909197.html","title":"Through the looking glass darkly","title_page":"Blog: Through the looking glass darkly","title_rss":"NULL","source_domain":"americanthinker.com","text":"Hillary Clinton is every bit the congenital liar William Safire said she was in January 1996. She lies easily, without compunction, as though it is her moral right to lie in service of her own power. She lied consistently throughout her husband's presidency, about all things, large and small. The list of scandal \"gates\" of which she was an integral part would be too long to cite, but all of the items are easily searchable. Suffice it to say that, like the current occupant of the White House, her behavior over all these years indicates a narcissistic personality disorder. There are many traits that signify personality disorder. Hillary Clinton exhibits at the very least four of them: Narcissism – A set of behaviors characterized by a pattern of grandiosity, self-centered focus, need for admiration, self-serving attitude and a lack of empathy or consideration for others \"Not My Fault\"... (Read Full Post)","url":"https://www.americanthinker.com/blog/2016/01/through_the_looking_glass_darkly_comments.html"}
ogical Lying – Persistent deception by an individual to serve their own interests and needs with little or no regard to the needs and concerns of others. A pathological liar is a person who habitually lies to serve their own needs\nSense of Entitlement – An unrealistic, unmerited or inappropriate expectation of favorable living conditions and favorable treatment at the hands of others. These four traits are essential Hillary. That she aspires to be our president is as frightening as Donald Trump's goal of winning the White House. He exhibits many, if not more, of the same qualities that Clinton does. Trump's personality traits include Bullying – Any systematic action of hurting a person from a position of relative physical, social, economic, or emotional strength\nFalse Accusations – Patterns of unwarranted or exaggerated criticism directed towards someone else\nFrivolous Litigation – The use of unmerited legal proceedings to hurt, harass, or gain an economic advantage over an individual or organization\nImpulsiveness – The tendency to act or speak based on current feelings rather than logical reasoning\nSelf-Aggrandizement – A pattern of pompous behavior, boasting, narcissism, or competitiveness designed to create an appearance of superiority\nTargeted Humor, Mocking and Sarcasm – Any sustained pattern of joking, sarcasm or mockery which is designed to reduce another individual’s reputation in their own eyes or in the eyes of others\nBelittling, Condescending, and Patronizing – This kind of speech is a passive-aggressive approach to giving someone a verbal putdown while maintaining a facade of reasonableness or friendliness. Classic Trump, all of them. Both Clinton and Trump display Situational Ethics – a philosophy that promotes the idea that, when dealing with a crisis, the end justifies the means, and a rigid interpretation of rules and laws can be set aside if a greater good or lesser evil is served by doing so. For a nation that can count as its own intellectual giants like George Washington, Madison, Jefferson, Lincoln, Reagan, and so many others in between, how does one explain our arrival at the present moment? For seven years a classic narcissist has been president. He has done incalculable damage to the country, much of it purposeful, much of it due to incompetence. He will leave office proud of his dubious \"accomplishments\": a doubling of the national debt, the reordering and near destruction of our health care, a no-growth economy, exacerbation of racial hostility, a submissive deal with Iran, the release of hundreds of terrorists from Guantanamo, the release of thousands of criminal illegal aliens from prisons onto our streets, a Middle East in barbaric chaos, the flooding of the country with tens of thousands of immigrants who will never be assimilated, etc. The American people are understandably angry. But Clinton? Trump? Something is very, very wrong with our national judgment. People like this are not qualified leaders; they are dangerous in leadership positions. The quality of education of our young has been declining for at least two generations thanks to the dictates of multiculturalism and the anti-Americanism of the tenured radicals who took over university faculties in the 1970s. University graduates know far less today than high school students did through the 1950s. Today's students are saturated with critical race and gender theories but know little about American history beyond the sin of slavery. It appears that our ability to properly judge moral character and intelligence has been declining along with our educational standards. Neither Clinton nor Trump should ever get close to the White House as commander-in-chief of the United States. This should be obvious to every voting citizen. See more at http://outofthefog.website/personality-disorders-1/2015/12/6/narcissistic-personality-disorder-npd.","url":"https://www.americanthinker.com/blog/2016/01/through_the_looking_glass_darkly.html"}
