{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 01:14:16","date_modify":"2018-10-30 01:14:16","date_publish":"2018-10-29 12:10:37","description":"A favorite breakfast spot in Decatur closed over the weekend after a decade in business.","filename":"data/vaneerConsumption/ThumbsUpDinerclosesinDecatur.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/29/Images/AAdine8.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_th_6bfc064be28dfc44305131975fd8b71d__1540862056.html","title":"Thumbs Up Diner closes in Decatur","title_page":"Thumbs Up Diner closes in Decatur","title_rss":"NULL","source_domain":"ajc.com","text":"A favorite breakfast spot in Decatur closed over the weekend after a decade in business.\nThumbs Up Diner closed at 174 West Ponce de Leon Ave. on Sunday. The restaurant addressed the closure on its Facebook page:\nA sign posted on the restaurant’s door goes into further detail, Decaturish reports.\n“I would like to take the opportunity to thank all of you for the last 10 years. I know I speak for the rest of the staff when I say we feel very lucky to have been able to get to know all of you and making memories that we will cherish for a lifetime.\nWe urge everyone to use their voices to protest the rising rents in this area. Unfortunately, it’s too late for us but you may be able to save other local businesses.”\nThe letter is signed, “Wesley, Lisa, Mark, Richard, Craig and the rest of the Thumbs Up staff.”\nThere are remaining Thumb Up locations in Old Fourth Ward, East Point, Douglasville, West Midtown and Roswell.\nLongtime Decatur residents will likely be familiar with the Decatur Thumbs Up location’s history. In 1984, Thumbs Up founder Lou Locricchio opened the first Thumbs Up Diner on West Ponce de Leon Avenue. In 1995, he sold the concept to Rob Atherholt, who changed the name to Crescent Moon and moved it a block up the street, where it remained for more than a decade. In October 2007, Atherholt sold Crescent Moon to Global Restaurant Group LLC and the restaurant closed in 2007. Thumbs Up reopened in Decatur in 2008.\nRELATED:\nMore DeKalb County dining news\nMore metro Atlanta restaurant closures\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/thumbs-diner-closes-decatur-after-years/1hMgEqPayQmv5unGSOS3mM/"}
