{"authors":[],"date_download":"2018-10-22 21:08:08","date_modify":"2018-10-22 21:08:08","date_publish":"2014-06-04 13:17:13","description":"The message from Hong Kong is that while the Chinese government may want to tease from history the events June 4, 1989, this outpost of China is determined to keep the memory alive.","filename":"data/vaneerConsumption/TiananmenAnniversaryCommemoratedinHongKong.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/486456/140604-tiananmen-square-908_2f82065b94c99c42aca181c67c811f64.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_tiananmen-anniversary-commemorated-hong-kong-n122226_1540242488.html","title":"Tiananmen Anniversary Commemorated in Hong Kong","title_page":"Tiananmen Anniversary Commemorated in Hong Kong","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"Democracy! justice!\" said another, though he was a veteran of these annual vigils.\nBy eight o'clock local time, the park was packed and people overflowed into the streets nearby, fanning themselves against the intense humidity.\nBanners lined the park, speeches relayed on screens for those in the distant corners.\nModels of the Goddess of Democracy, based on the Statue of Liberty and which became a symbol of the democracy movement, were spotlit along a central path.\nShortly after eight o'clock the lights went out and thousands of candles were held aloft. There was a moment of silence, then solemn music interspersed with images and clips of speeches from student leaders in 1989.\nIt was a powerful moment.\nThen they stood, and a voice recited the names of those known to have died.\nA heavy drumbeat followed, growing in intensity.\nIn the crowd, nobody stirred. Candles flickered as far as the eye could see.\nNobody knows the exact number who died, since there has been no real accounting. It could be hundreds, possibly thousands.\nAnd the message from Hong Kong tonight is that while the Chinese government may want to tease from history the events June 4, 1989, this outpost of China, which still enjoys some autonomy, is determined to keep the memory alive.","url":"https://www.nbcnews.com/news/world/tiananmen-anniversary-commemorated-hong-kong-n122226"}
