{"authors":[],"date_download":"2018-10-22 21:14:43","date_modify":"2018-10-22 21:14:43","date_publish":"2014-06-04 09:41:56","description":"Inside and immediately outside Tiananmen, security forces formed an imposing cordon that was quietly supplemented by heavy anti-riot equipment staged on the side streets.","filename":"data/vaneerConsumption/TiananmenAnniversaryBringsTightSecurityTonsofTourists.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/486026/140604-tiananmen-security-main-6a_cf28f23d887a388231b9cfca90d207fb.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_tiananmen-anniversary-brings-tight-security-tons-tourists-n122066_1540242883.html","title":"Tiananmen Anniversary Brings Tight Security, Tons of Tourists","title_page":"Tiananmen Anniversary Brings Tight Security, Tons of Tourists","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBEIJING – A heavy security presence and the memory of a bloody military crackdown 25 years ago today did little to halt the thousands of tourists who rushed into Tiananmen Square in China’s capital on Wednesday.\nAll this week, police-manned checkpoints and armed paramilitary patrols on foot and in open jeeps have canvassed a 3 mile radius around Tiananmen Square. Inside and immediately outside Tiananmen, plain-clothed police and other security forces formed an imposing cordon that was quietly supplemented by heavy anti-riot equipment staged on the side streets off the square.\nOn the street where the Supreme Court and the Beijing Police Museum are located, armored vehicles installed with plows, water cannons and firing slots were lined up in case of emergency.\nHowever, on Tiananmen square itself, it was business as usual as thousands of tourists flocked to see one of China’s most iconic sites. Long lines awaited them though. At one entrance to the square, there was a 45 minute wait just to get to the security check, where some disappointed tourists soon found out that for today at least, a valid national ID or passport was required to enter.\nWhen asked by those agitated local tourists why today of all days they needed identification to enter, police only shrugged and asked them to please not hold up the lines by arguing.","url":"https://www.nbcnews.com/news/world/tiananmen-anniversary-brings-tight-security-tons-tourists-n122066"}
