{"authors":["Brad Witter"],"date_download":"2018-10-31 01:40:02","date_modify":"2018-10-31 01:40:02","date_publish":"2018-09-01 21:43:55","description":"Not everyone has the most rosy outlook on ABC's rumored next Bachelor. Tia Booth's reaction to Colton Underwood potentially becoming the Bachelor, while speaking to Entertainment Tonight at the Aug. 28 taping of Bachelor in Paradise's Season 5…","filename":"data/vaneerConsumption/TiasReactionToColtonPotentiallyBecomingTheBachelorHintsAtTheirCurrentRelationshipStatus.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/1/e8429997-16d8-4e5b-806e-b7366a84b43d-149576_8546-2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_tias-reaction-to-colton-potentially-becoming-the-bachelor-hints-at-their-current-relationship-status-11478612_1540950002.html","title":"Tia's Reaction To Colton Potentially Becoming The Bachelor Hints At Their Current Relationship Status","title_page":"Tia's Reaction To Colton Potentially Becoming The Bachelor Hints At Their Current Relationship Status","title_rss":"NULL","source_domain":"bustle.com","text":"Not everyone has the most rosy outlook on ABC's rumored next Bachelor. Tia Booth's reaction to Colton Underwood potentially becoming the Bachelor, while speaking to Entertainment Tonight at the Aug. 28 taping of Bachelor in Paradise's Season 5 finale, showed fans she has some serious doubts. The reason? \"I don't know that he's ready, I don't,\" she told ET.\nOf course her comments, which followed an online report that Colton will be the next Bachelor, squashed fans' hopes that she and the former NFL player — who are currently in a relationship on BiP — would go the distance. Their dating status shouldn't be a total shock, however, as the preview for the the Sept. 3 episode shows the pair in tears, while the description teases \"a seemingly stable couple splits.\" ABC declined to comment to Bustle on The Bachelor casting. Bustle reached out to Warner Bros. regarding the reports and rumors that Colton will be the Bachelor, but has not yet received a response.\n\"I mean, it was just about two months ago that I was telling him that he really needs to figure himself out before he can fully be with someone else,\" she added to ET, admitting that Jason Tartick from Becca's season is her pick. \"If there's a chance that Colton is the Bachelor, I would hope that he is fully ready for that experience knowing that he wants to be engaged at the end of it.\"\nAfter Colton and Tia had a hotdog date on the beach in the most recent episode, the latter posted on Instagram Aug. 29: \"Chicks are actually pretty simple. If they can’t shut up about craving hotdogs on the beach, you set up hotdogs on the beach.\"\nIt seems not everything is quite so simple though. Tia's close friend and BiP alum Raven Gates expressed her doubts about her fellow Arkansas native's relationship in a recent episode as well.\n\"I do not want to see you in heartbreak,\" a tearful Raven said during the episode. \"You have to really see the real person that Colton is. Is this a facade? Is he doing what everybody else wants him to do? Is he really into you?\"\nUnlike Tia, however, host Chris Harrison is on board with Colton as the new Bachelor. \"If he’s single, Colton would be a very interesting Bachelor,\" Harrison also told ET on Aug. 29, adding:\n\"We look at a lot of things when picking the Bachelor, and good TV and good story is a lot of it. Colton has all that in spades. There’s the, \"Is he ready for this?\" angle with Tia, and is that still hanging over him? Obviously, we’ll see how that plays out in Paradise. Then there’s the virgin angle. We have this guy who was brought to tears during \"Men Tell All\" about dealing with this. If he’s willing to put that on display as the Bachelor, I would find that fascinating in this day and age. … The women having to deal with that — I think it would be a fascinating story. And that’s a lot of what makes a good Bachelor. It’s a compelling argument if he’s single and willing to do it.\"\nFans will have to wait until the official announcement on Tuesday, Sept. 4 to see who ABC has selected, of course. Whether it's Colton or not, hopefully the new suitor will be in it for the right reasons when The Bachelor's new season premieres in January.","url":"https://www.bustle.com/p/tias-reaction-to-colton-potentially-becoming-the-bachelor-hints-at-their-current-relationship-status-11478612"}
