{"authors":[],"date_download":"2018-10-30 14:36:08","date_modify":"2018-10-30 14:36:08","date_publish":"2018-08-16 20:18:00","description":"If you're a college football fan, the College Football Hall of Fame in Atlanta just might be the next best thing to your team winning. In 2014, the College Football Hall of Fame moved from South Bend to Atlanta, offering a fun, highly interactive experience for college football fans.","filename":"data/vaneerConsumption/Ticketsparkingandattractions.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/12/07/Videos/4245090.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/events_sports_score-your-gu_ee361c332cdf48bb320484f816aa0d74__1540910168.html","title":"Tickets, parking and attractions","title_page":" College Football Hall of Fame 2018: Tickets, parking and attractions","title_rss":"NULL","source_domain":"ajc.com","text":"If you're a college football fan, the College Football Hall of Fame in Atlanta just might be the next best thing to your team winning the national championship.\nA hall of fame might conjure up visions of old photos and statues in a fairly staid atmosphere, but the CFHF is anything but.\nThe College Football Hall of Fame was founded in 1951 and was originally housed in Kings Mill, Ohio, before it moved to South Bend, Indiana. In 2014, the CFHF opened in Atlanta, bringing a fun, highly interactive experience for die-hard and quasi-fans alike.\nIf you're planning a trip to the CFHF, here's what you need to know:\nIn this 2014 file photo, attendees look at exhibits at the College Football Hall of Fame. KENT D. JOHNSON / KDJOHNSON@AJC.COM (Kent Johnson/The Atlanta Journal-Constitution)\nPersonalize your experience.\nWhen you enter the CFHF, make sure to use the machine where you can scan your pass and enter your favorite team. Throughout your visit, you'll be able to scan it at various exhibits and experiences to get extra information tailored to your favorite team. So if you're looking at the Heisman Trophy, you'll get information about your school's Heisman winners.\nYou'll probably get more customized data if your team is one that has a long, storied history, but every team is included. And when you get home, you'll be able to enter your email address and a code online to get access to some of your experiences from the day.\nA three-story-high wall of helmets displays the headgear of the 768 teams that play college football at several different levels. (David Goldman photo/For the AJC)\nHelmet Wall\nAfter you start your museum visit, you'll see a three-story wall with over 760 football helmets – one for each Division I, II, III and NAIA program. And if you scanned your pass to select your favorite team, your team's helmet will light up and stay lit while you're there. (\"Hey, there's another Bowling Green fan here!\")\nEach time you go up a floor in the building, you'll get another view of the wall, which is low tech but amazing.\nCoca-Cola Fans' Game Day\nThis interactive area lets you show your fandom by playing a trivia game about schools' traditions, having your face digitally painted, singing karaoke fight songs or designing your own marching band routine.\nYou can even sit on a mock ESPN College GameDay set and make your pick to win as if you were Lee Corso, complete with a digital mascot's head covering your face.\nRELATED: 11 best places to watch college football in Atlanta\nIndoor Playing Field\nTry your football skills on a 45-yard field as you work your way through an obstacle course, try to kick a field goal or see how accurately you can pass. This activity is a hit not only with kids but with adults as well.\nAs you're on the field, you can see a huge video screen overhead that shows live games and football highlights.\nAT&T Game Time Gallery\nBecome a broadcaster – well, at least for a few minutes – and call an iconic play like the one from the infamous game where the Stanford band ran out on the field during the final play. You'll also be able to get on a virtual field with a 360-degree virtual-reality view of a traditional stadium. Other parts of the gallery let you hear and see from quarterbacks and coaches about what happens before a play starts.\nHours\nThe Hall of Fame is open from 10 a.m. to 5 p.m. Sunday through Friday from and 9 a.m. to 6 p.m. Saturdays. It's closed on Christmas Day.\nTickets\nTickets are $21.99 for adults, $17.99 for kids age 3 to 12 and free for kids under 3, and you can buy them online or at the door. Discounted tickets are available for seniors 65 and older ($18.99), students with valid ID ($18.99) and active and retired military with valid ID (free). Tickets for seniors, students and members of the military are only available at the door.\nIf you'd like to see other Atlanta attractions in addition to the Hall of Fame, you may want to buy a CityPASS, which discounts the price of each admission. The pass includes tickets to the Georgia Aquarium, World of Coca-Cola, Inside CNN Studio Tour, Zoo Atlanta or Center for Civil and Human Rights and College Football Hall of Fame or Fernbank Museum of Natural History.\nYou can buy a CityPASS online or at the CFHF entrance, and when you redeem your first ticket, you'll have nine days to visit the other attractions.\nIn addition, you can occasionally find discounted tickets on Groupon.\nSeason pass packages are also available, and each offers admission for one year plus additional benefits, including invitations to the ESPN College Football Awards Red Carpet Show (subject to availability).\nAt the Team/Family Level, which costs $150, you'll get free admission for one year for two named adult members and up to three kids under 18 per visit, two VIP All-Access Passes, an invitation to special season pass holder events and an invitation for up to four people to the ESPN event.\nDirections\nThe CFHF is located on 250 Marietta St. NW in Atlanta, near the Georgia World Congress Center and Centennial Olympic Park. It's accessible southbound and northbound via I-75/I-85, via I-20 and from MARTA.\nParking\nPark in the Green Deck at the corner of Baker and Marietta streets. You can park for up to 20 minutes for free, up to three hours for $15, and each additional hour is a dollar more.\nSpecial events can change parking, so keep an eye on the CFHF's schedule of upcoming events for anything that could affect parking.\nOverflow parking is available in the Georgia World Congress Center's Red Deck.\nRELATED\nThings to do today and this weekend in Atlanta\nAJC guide to visiting Downtown Atlanta\nAJC events calendar: Downtown Atlanta events","url":"https://www.ajc.com/events/sports/score-your-guide-the-college-football-hall-fame/pxnjpXiLjDZfWHtUoYc27I/"}
