{"authors":[],"date_download":"2018-10-30 17:51:18","date_modify":"2018-10-30 17:51:18","date_publish":"2018-07-07 14:05:00","description":"Tiffany Haddish got an impressive gift from her boss Tyler Perry after working on his new movie...","filename":"data/vaneerConsumption/TiffanyHaddishrevealsTylerPerryboughtheraTesla.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/03/27/Videos/4355283.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_celebrity-new_179abd2ab22ceac39510be381dd479d6__1540921878.html","title":"Tiffany Haddish reveals Tyler Perry bought her a Tesla","title_page":"Tiffany Haddish reveals Tyler Perry bought her a Tesla","title_rss":"NULL","source_domain":"ajc.com","text":"Tiffany Haddish got an impressive gift from her boss Tyler Perry after working on his new movie, “Nobody’s Fool.”\nEbony reported that the comedian posted on Instagram that she was gifted a Tesla in June.\n“So I got this message from my friend and Big Brother @tylerperry a week ago,” Haddish captioned the post. “When I tell you I cried so hard.”\nThe post included photos of the blue Tesla, which appears to be a Model X, and the video message Perry sent to Haddish.\n>> Read more trending news\n“Your career is taking off. You gon’ be around a real long time,” Perry said after discussing saving money and being hesitant to spend it at the start of your career.\n“I wanted to give this to you and say you deserve it and I’m excited for you and all that’s going on,” Perry said, raising two pairs of keys and walking out the door of his home to show Haddish the new car. “Love you, Tiffany. Proud of you girl. Call me. It’s all yours, here in L.A. waiting for you.”\nPeople reported that Haddish said earlier in the year that the Tesla is her dream car. The actress expressed gratitude to Perry in her Instagram post.\n“First off, a man has never bought me a car out right. I have always had to make payments,” she wrote. “This was just out the kindness of his heart And probably tired of me talking about it all the time and I didn’t have to do anything for it but a Great job in our New Movie Nobody’s Fool. Thank God for kind people that want to spread happiness. I am now on my way to see if this is (real)! Cause I am still waiting on the one @theellenshow said they would let me use for a week.”\n“Nobody’s Fool,” directed, written and produced by Perry and starring Haddish, Tika Sumpter, Whoopi Goldberg and Amber Riley, will be in theaters Nov. 8.","url":"https://www.ajc.com/entertainment/celebrity-news/tiffany-haddish-reveals-tyler-perry-bought-her-tesla/XdmxBNsZK2cyuQp9XJXhHJ/"}
