{"authors":["Associated Press"],"date_download":"2018-10-22 22:43:57","date_modify":"2018-10-22 22:43:57","date_publish":"2017-04-26 05:40:39","description":"DETROIT (AP) - James McCann homered in the second inning, then Justin Upton and Alex Avila followed suit in the fourth.The Detroit Tigers were just getting...","filename":"data/vaneerConsumption/Tigersscore9in5throutMariners199.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/05/wire-463347-1493181928-477_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446316_Tigers-score-9-5th-rout-Mariners-19-9_1540248237.html","title":"Tigers score 9 in 5th, rout Mariners 19-9","title_page":"Tigers score 9 in 5th, rout Mariners 19-9 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"DETROIT (AP) - James McCann homered in the second inning, then Justin Upton and Alex Avila followed suit in the fourth.\nThe Detroit Tigers were just getting started.\nDetroit added nine more runs in a fifth-inning onslaught, and despite the usual shakiness from the bullpen, the Tigers went on to rout the Seattle Mariners 19-9 on Tuesday night.\nDetroit Tigers' Ian Kinsler watches his two-run single to center during the fifth inning of a baseball game against the Seattle Mariners, Tuesday, April 25, 2017, in Detroit. (AP Photo/Carlos Osorio)\nFelix Hernandez was bothered by a stiff shoulder and allowed four runs in two innings. The next two Seattle pitchers didn't fare any better.\nThe teams combined for 40 hits and 14 walks.\nDetroit's record for runs in a game is 21, last achieved on July 1, 1936.\nThe 40 combined hits broke the Comerica Park record of 38 set by the Tigers and Chicago White Sox on April 13, 2006.\n\"Don't know if I've ever been a part of a game like that before,\" McCann said.\nIt was the shortest outing for Hernandez (2-2) since 2015. Detroit finished with 24 hits, 19 of which came in the first five innings. That was despite injuries that kept Miguel Cabrera, J.D. Martinez and Jose Iglesias out of the lineup.\nJordan Zimmermann (2-1) allowed five runs in six innings. Jean Segura, Danny Valencia and Nelson Cruz hit solo homers for Seattle, but that wasn't nearly enough to keep up with Detroit.\nMikie Mahtook added another home run for the Tigers in the eighth. Ian Kinsler had four hits and four runs before being lifted for a pinch hitter in the seventh.\nHernandez squandered an early 2-0 lead, allowing a run in the first and three in the second. McCann's two-run homer put Detroit ahead 3-2.\nIt was the shortest outing for Hernandez since he lasted only a third of an inning at Houston on June 12, 2015.\nReliever Chris Heston allowed a two-run homer by Upton in the fourth, then Avila followed with a solo shot to make it 7-2. Segura and Valencia hit consecutive homers for Seattle in the fifth, but the Tigers broke the game open when they sent 13 hitters to the plate in the bottom of the inning.\nAndrew Romine, Kinsler and Tyler Collins had two hits apiece that inning. It was the most runs for Detroit in an inning since a nine-run fifth at Texas on Sept. 17, 2008.\n\"It's definitely better to be on that side of it than the other side of it,\" McCann said. \"It's always fun to see your teammates get hits.\"\nSegura returned from the disabled list for Seattle and made an immediate contribution, but Hernandez was gone after two innings, and Mariners outfielder Mitch Haniger left in the third with a strained oblique.\n\"That's a tough game,\" second baseman Robinson Cano said. \"First we lose Mitch, who has been our best hitter all season, and then we lose Felix, who is our number one pitcher. Those are the two guys we really don't want to lose.\"\nHernandez and Haniger were set to return to Seattle to be checked by doctors.\nAfter Hernandez left the game, Heston allowed five runs in two innings, and Evan Marshall allowed seven runs in two innings.\n___\nMore AP baseball: https://apnews.com/tag/MLBbaseball\n___\nFollow Noah Trister at www.Twitter.com/noahtrister\nDetroit Tigers' James McCann safely beats the tag of Seattle Mariners catcher Mike Zunino during the fifth inning of a baseball game, Tuesday, April 25,2017, in Detroit. (AP Photo/Carlos Osorio)\nSeattle Mariners relief pitcher Evan Marshall stands on the mound after giving up a bases loaded walk during the fifth inning of a baseball game, Tuesday, April 25, 2017, in Detroit. In the background is Detroit Tigers' Victor Martinez walking to third base. (AP Photo/Carlos Osorio)\nDetroit Tigers' Justin Upton, center, is congratulated by Tyler Collins after they scored on Upton's two-run home run during the fourth inning of a baseball game against the Seattle Mariners, Tuesday, April 25, 2017, in Detroit. (AP Photo/Carlos Osorio)","url":"https://www.dailymail.co.uk/wires/ap/article-4446316/Tigers-score-9-5th-rout-Mariners-19-9.html"}
