{"authors":[],"date_download":"2018-10-30 19:40:15","date_modify":"2018-10-30 19:40:15","date_publish":"2018-08-12 23:17:00","description":"Brooks Koepka is impossible to overlook now, winning the PGA Championship on Sunday with machine-lik...","filename":"data/vaneerConsumption/TigerWoodsfinishessecondasBrooksKoepkawinsPGAChampionship.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/12/Images/1015796282-U24847104612SAF-680x383.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_tiger-woods-finishes_7ac3b66408a78b200a63b6287512b1d2__1540928415.html","title":"Tiger Woods finishes second as Brooks Koepka wins PGA Championship","title_page":"Tiger Woods finishes second as Brooks Koepka wins PGA Championship","title_rss":"NULL","source_domain":"ajc.com","text":"Brooks Koepka is impossible to overlook now, winning the PGA Championship on Sunday with machine-like precision to go with his back-to-back U.S. Open titles.\nAnd it still felt — and sounded — like he was playing second billing to Tiger Woods.\nWith roars for Woods unheard anywhere this side of Augusta National, Koepka kept his cool and ran off two birdies on the back nine at Bellerive with Adam Scott tied for the lead and Woods one shot behind.\nKoepka closed with a 4-under 66 for a two-shot victory, making him only the fifth player to win the U.S. Open and PGA Championship in the same year.\n\"The crowds here, they let you know what's going on,\" Koepka said with a big grin. \"The beginning of the back nine, I could hear all the roars. When Tiger started making his little run, and Scotty made his run, it got loud.\"\nEven with two bogeys, Woods shot 64 for his lowest final round in a major.\n\"I played hard,\" Woods said. \"I made a bit of a run. It looks like I'm going to come up a little short.\"\nKoepka was responsible for that.\nAfter wasting one chance to put it away, Koepka ran kept attacking flags and ran in birdie putts of 10 feet on No. 15 and 7 feet on No. 16 to end the drama. He tapped in for par on the final hole to set the PGA Championship scoring record at 264.\nIt also tied the major championship record that Henrik Stenson set at Royal Troon two years ago in the British Open.\nKoepka has won three of the last six majors he played, and two of three this year alone. He joined Woods, Jack Nicklaus, Ben Hogan and Gene Sarazen as the only players to win the two U.S. majors that rotate to different courses in the same year.\nThe 28-year-old Floridian also joined Jordan Spieth, Woods, Nicklaus and Tom Watson as the only players with three majors before turning 30 since World War II.\nScott hung around by making big putts, just like he hoped, and was tied for the lead until Koepka's birdies. Scott missed a 6-foot birdie putt on the par-5 17th that would have pulled him to within one shot — right after Koepka missed from the same range — and then made bogey on the 18th for a 67 to finish alone in third.\nThe St. Louis fans waited 17 years to see Woods — he last was at Bellerive when the Sept. 11 terrorist attacks canceled a World Golf Championship — and he delivered a performance that took golf back in time.\nThomas Bjorn might have seen it coming. Earlier in the week, as he was cleaning out his locker after withdrawing with an injury, he thought back to Woods getting into contention at Carnoustie last month at the British Open. \"He recognized who that guy was that day,\" Bjorn said.\nWoods was relentless, pumping fists, raising the putter in his left hand, making birdies and charging toward a finish that caused pure pandemonium among one of the largest and noisiest crowds at a major.\nWithout hitting a fairway on the front nine, Woods cut the four-shot deficit to two.\nDialed in on the back nine, he dropped an approach into 4 feet on No. 12, got within one shot with a 10-foot birdie on the par-3 13th and, after a bad drive led to bogey, he answered with another approach that hit a foot from the hole.\nThat was as good as it got.\nFacing the most important drive of the day on the par-5 17th, Woods sent it sailing to the right and it embedded in a hazard along the banks of a creek. He did well to advance it, but had to save par from a bunker. Behind him, Koepka holed his two birdie putts.\nWoods and Koepka played nine holes of a practice round on Wednesday, and the 14-time major champion knew what he was up against.\n\"It's tough to beat when the guy hits it 340 down the middle,\" Woods said. \"What he did at Shinnecock, just bombing it, and then he's doing the same thing here. ... And when a guy's doing that and hitting it straight, and as good a putter as he is, it's tough to beat.\"\nKoepka never imagined a year like this. He missed four months at the start of the year when a partially torn tendon in his left wrist, causing him to sit out the Masters. He outlasted good friend Dustin Johnson at Shinnecock Hills to become the first back-to-back U.S. Open champion in 29 years.\nAnd now this.\nKoepka joked about working out in a public gym this week with Dustin Johnson and not being recognized. He has been motivated by more serious moments, from being left off the \"notable scores\" section of TV coverage at tournaments and even last week, when he was not summoned for a TV interview to preview the PGA Championship.\nHe now is No. 2 in the world, with a shot at overtaking Johnson in two weeks when the FedEx Cup playoffs start.\nJustin Thomas also had a chance to join Woods as the only back-to-back PGA champions in stroke play, and he was tied for the lead briefly on the front nine when Koepka missed fairways and made two straight bogeys. Thomas turned birdie into bogey at the turn with a three-putt from 5 feet, and he missed a short par putt on the 14th to fall back. He shot 68 and tied for sixth.\nEven with 17 players separated by three shots at one point on the front nine, everyone had to catch Koepka, Woods included.","url":"https://www.ajc.com/sports/tiger-woods-finishes-shots-behind-brooks-koepka-pga-championship/vR3nt1tIRq907ihAGMjpiK/"}
