{"authors":["Philip Quinn For The Irish Daily Mail"],"date_download":"2018-10-22 20:43:33","date_modify":"2018-10-22 20:43:33","date_publish":"2016-01-29 03:01:55","description":"Tiger Woods has been invited to compete in the Dubai Duty Free Irish Open at the K Club on May 19-22. The 14-time major winner could tee up alongside Rory McIlroy at the Palmer Course.","filename":"data/vaneerConsumption/TigerWoodsmayjoinRoryMcIlroyattheIrishOpenasEuropeanTourmarks10yearRyderCupanniversaryattheKClub.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/03/277F212900000578-0-image-a-127_1454036425255.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_golf_article-3422111_Tiger-Woods-join-Rory-McIlroy-Irish-Open-European-Tour-marks-10-year-Ryder-Cup-anniversary-K-Club_1540241013.html","title":"Tiger Woods may join Rory McIlroy at the Irish Open as European Tour marks 10-year Ryder Cup anniversary at the K Club","title_page":"Tiger Woods may join Rory McIlroy at the Irish Open as European Tour marks 10-year Ryder Cup anniversary at the K Club | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tiger Woods has been invited to compete in the Dubai Duty Free Irish Open at the K Club on May 19-22.\nIf fit, the 14-time major winner could tee up alongside Rory McIlroy at the Palmer Course in leafy north Co Kildare.\nTo mark the 10th anniversary of the Ryder Cup at the venue, the European Tour have extended an invitation to the 2006 European and United States teams, plus their captains Ian Woosnam and Tom Lehman.\nTiger Woods has been invited to compete in the Dubai Duty Free Irish Open at the K Club on May 19-22\nRory McIlroy (left) hosts the tournament as his presence could entice Woods to compete if he is fit enough\nWoods played at the K Club during the 2006 Ryder Cup and the European Tour have invited that entire US side\nEurope's 2006 win was unforgettable, particularly for Darren Clarke (left), whose wife had recently died\nIt remains to be seen what the response is, but the presence of McIlroy as Irish Open host could act as a magnet.\nIt may help that the May date falls between The Players Championship and Memorial Tournament on the US PGA Tour.\nWoods is no stranger to Ireland, or the K Club, where he played many practice rounds with his close friend Mark O’Meara. He’s also a former winner of the WGC Amex Championship at Mount Juliet in 2002.\nThe former No 1 is working on his fitness rehab after back surgery and is targeting a return at the Masters in April — his last event was in August.\nWhile no high-profile entries were revealed at The K Club, Antonia Beggs, the European Tour’s promoter for the Irish Open, insisted ‘the question will definitely be asked’ of Woods to play.\nOther members of that US Ryder Cup team included Phil Mickelson, Jim Furyk and Zach Johnson, while former Irish Open winners Colin Montgomerie, Jose Maria Olazabal and Paul Casey figured on Europe’s winning team.\nTo give the Irish Open an Olympic flavour, Beggs may consider putting Rio-bound players out together for the first two rounds, even though the qualification process finishes the week of the Open at Troon in mid-July.\nBeggs stressed the Irish Open was ‘a strategic element’ of the Tour, due to its crowd-pulling strengths, quality fields and tradition. ‘It is growing and growing,’ she said.\nTo facilitate that growth, a new mid-summer slot may help the event’s profile and there is talk of a three-week links swing involving the Irish Open, Scottish Open, and Open Championship.\n‘Everyone has justification for a date but with the prize fund going up to €4m, it’s something that’s being looked at,’ said Beggs.\nMore immediately, there is speculation that Lough Erne may be usurped by Portstewart as the 2017 Irish Open venue. Intriguingly, Beggs was unable to confirm the Fermanagh resort as host.\n‘There are a lot of decisions going on behind the scenes,’ she said.\nThe choice of venue for the 2018 and 2019 Irish Open is also unresolved, but The K Club is available — and willing. If this year’s edition goes well, especially in terms of public appeal, its claims will be strong. Four years ago, the Irish Open was the first sell-out event on the European Tour when 120,000 fans braved wind and rain at Portush.\nWoods, pictured at the Masters in 2015, is targeting a return at the 2016 event after undergoing back surgery\nThe 14-time major winner struggled with injuries and form last year, and his last event was in August\nMcIlroy's event may have a new mid-summer slot to form a three-week links swing on the European Tour\nSince then, there have been 84,000 spectators at Carton House (2013), 97,000 at Fota Island (2014) and 100,000 at Royal Co Down last year, where numbers were restricted.\n‘We have no limit on the gate unlike last year and I’d love to break 100,000. That doesn’t happen much on the Tour but I think we can go more,’ said Beggs.","url":"https://www.dailymail.co.uk/sport/golf/article-3422111/Tiger-Woods-join-Rory-McIlroy-Irish-Open-European-Tour-marks-10-year-Ryder-Cup-anniversary-K-Club.html"}
