{"authors":[],"date_download":"2018-10-30 19:38:20","date_modify":"2018-10-30 19:38:20","date_publish":"2018-08-13 19:23:00","description":"There is an increasing chance that Tiger Woods could make his long-awaited return to Atlanta and the...","filename":"data/vaneerConsumption/TigerWoodsinpositionforlongawaitedreturntoAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/13/Images/GettyImages-1018047782.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_golf_tiger-woods-pos_330c4e669bc81bc6ee7fb9402a875866__1540928300.html","title":"Tiger Woods in position for long-awaited return to Atlanta","title_page":"Tiger Woods in position for long-awaited return to Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"There is an increasing chance that Tiger Woods could make his long-awaited return to Atlanta and the Tour Championship.\nAfter his second-place finish at the PGA Championship Sunday, Woods made another big jump up the FedEx Cup points standings. He moved from 49th to 20th place with his best finish in years – his last tournament win came five years ago and his last major win came 10 years ago. Woods moved up to 43rd in the FedEx Cup standings after finished tied for sixth at the British Open in July.\n- Tiger Woods finishes second in PGA Championship\nThe top 30 golfers in the standings after three playoff events advance to Atlanta’s East Lake Golf Club for the season-ending Tour Championship and its $1 million prize. The Tour Championship will be played Sept. 19-23. It moves to earlier in the year next season as part of the PGA Tour’s new schedule.\nThis week’s Wyndham Championship marks the final chance for players to secure a spot in the playoffs by being inside the top 125.\nWoods, who has 1,162 FedEx Cup points, has not played at the Tour Championship since 2013. The two-time Tour Championship and FedEx Cup winner last won the event in 2007. Woods tied for 22nd in his last Tour Championship and as he has battled injury and several surgeries the past several years, including spinal fusion surgery in 2017.\nDustin Johnson is the FedEx Cup leader with 2,717 points.\nHere is the current list of the top 30 in the points standings:","url":"https://www.ajc.com/sports/golf/tiger-woods-position-for-long-awaited-return-atlanta/vVJFY99Mir1wzafttiAQ7I/"}
