{"authors":["Associated Press"],"date_download":"2018-10-23 02:14:04","date_modify":"2018-10-23 02:14:04","date_publish":"2016-01-11 14:04:39","description":"ATHENS, Greece (AP) — Dreams rarely come true, at least not for long. For a few incredible months, the prospect of a better life in Europe seemed within gras...","filename":"data/vaneerConsumption/TighterborderchecksleavemigrantstrappedinGreece.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:8dc00e03d5c54665a3d7c670da49e9a0-48qEJGFphM8d437f0aaf925b700a-459_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393958_Tighter-border-checks-leave-migrants-trapped-Greece_1540260844.html","title":"Tighter border checks leave migrants trapped in Greece","title_page":"Tighter border checks leave migrants trapped in Greece | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tighter border checks leave migrants trapped in Greece\nATHENS, Greece (AP) — Dreams rarely come true, at least not for long.\nFor a few incredible months, the prospect of a better life in Europe seemed within grasp, attracting a wave of more than 1 million migrants from the war-torn, poverty-stricken Middle East and Africa. To get there, they risked their lives at sea and parted with fortunes.\nBut a tightening of border controls closer to the promised lands of Germany and Sweden has left thousands trapped and destitute in the last place most want to be — financially wrecked Greece.\nIn this photo taken on Saturday, Jan. 9, 2016, Pakistani people use their cell phones as they spend their time at the Eleonas refugee camp in Athens. A tightening of border controls closer to the promised lands of Germany and Sweden has left thousands trapped and destitute in the last place most want to be _ financially-wrecked Greece, which is Europe¿s main immigration gateway. (AP Photo/Thanassis Stavrakis)\nAyman Daher, 29, from Lebanon, paid smugglers $1,500 to squeeze onto a rubber boat with 80 people for the short and often deadly crossing from Turkey to the Greek island of Chios. His destination was Germany, where his father and three brothers live.\n\"Life is good and safe there,\" Daher said. \"In my country it is not.\"\nTo reach Germany, he would have to traverse the western Balkans, starting with Macedonia on Greece's northern border — as hundreds of thousands did with relative ease for about five months last year.\nThat happened because Balkan countries opened their borders in June to all transient asylum-seekers, in one of several policy lurches as a fragmented Europe vacillated between pity for refugees and concern over security and integrating huge numbers of immigrants.\nBut in late November the Balkan gateways started to close, and Greek officials fear they could be completely shut in coming months. Now, only Syrians, Afghans and Iraqis are deemed refugees and let through, with all others — about 12,000 of the 103,000 who entered Greece in December — rejected as economic migrants.\nThis seems absurd to Saleh Al Riyashy, 45, a former policeman from Yemen — whose civil war has been compounded by 10 months of airstrikes by a Saudi-led coalition.\n\"Why does Macedonia only allow people from three countries through?\" he said. \"Other countries are at war too. My home was badly damaged in the fighting.\"\nAl Riyashy and his family have spent the past week at Athens' Elaionas migrant camp, where about 560 people from 14 countries live in prefabricated homes. He wants to reach Sweden.\nAs twilight falls outside the Hellenikon shelter — a former Olympic field hockey venue currently housing about 280 people — Iranian men play volleyball, a red line on the ground serving as a notional net. Inside, migrants are coming to terms with their bleak future.\n\"I can't go back to Somalia,\" said English teacher Ali Heydar Aki, who hoped to settle in Europe and then bring his family. \"I have sold half my house\" to fund the trip.\nWhile it's unclear exactly how many are stuck in Greece, a comparison of arrivals there and in Macedonia since late November leaves about 38,000 people unaccounted for.\nGreek immigration minister Ioannis Mouzalas' best guess is \"a few thousand.\"\n\"But (that's) a calculation based on experience, not something else,\" he said.\nSyed Mohammad Jamil, head of the Pakistani-Hellenic Cultural Society, says about 4,000 Pakistanis could be stuck in Greece, mostly still on the islands, and about as many Bangladeshis.\n\"Every day we get ... phone calls from people in tears asking for help,\" he said. \"We can't help — send them where? Germany, Spain, Italy, England? We can't.\"\nAll now face two legal options: To seek asylum in Greece — which has 25 percent unemployment and a crumbling welfare system — or volunteer for repatriation. Greek authorities have recorded an increase in both since Macedonia tightened controls.\nKarim Benazza, a Moroccan hotel worker in his 20s, has signed up to go home on Jan. 18.\n\"This is all I do now, smoke and smoke, but no money, no food,\" he said, lighting a cigarette outside the International Organization for Migration building. \"There is nothing for us in Greece, and the Macedonian border is closed.\"\nDaniel Esdras, IOM office head in Greece, sees a steep increase in voluntary repatriations, which the IOM organizes. About 800 people registered in December and 260 have been sent home.\n\"It's one thing to return in handcuffs ... and quite another to go as a normal passenger with some money in your pocket, because we give them each 400 euros ($435),\" Esdras said.\nAlthough able to continue north, Afghan Masoud Aziz, 23, will seek asylum in Greece.\n\"I do not want to go to another country because it is difficult now, too (many) refugees go there,\" he said.\nDeportation awaits those who don't qualify for asylum and reject repatriation — with several hundred currently interned in Greece. About 20,000 were repatriated or deported last year. But most were Albanians, and only one in 10 from the Middle East and Africa.\nGreek officials say that is largely because some countries resist deportations.\n\"We have big difficulties with the returns to Pakistan,\" Mouzalas, the migration minister, said. \"If 3,000 people come (from Turkey) every day and (Turkey) accepts 150 returns every 20 days, you understand the problem cannot be solved.\"\nTrapped migrants face a third, illegal choice — paying to be smuggled into Macedonia. That is what happened before late June and Macedonian police say it is on the rise again since late November, while almost 10 percent of migrants trying to enter legally daily use fake Syrian documents.\nSmugglers ask for 1,500-3,000 euros ($1,630-3,260) to take someone into Macedonia,\" said Daher, the Lebanese migrant in Elaionas. \"I don't have that money. I don't know what we will do now.\"\nAt Hellenikon, Pakistani sociology graduate Zahid Waqas says he paid smugglers 4,000 euros ($4,350) — borrowed from friends — to reach Greece. He had hoped to get to France, but barring a miraculous opening of the Macedonian border, now sees voluntary repatriation as his best choice.\n\"In Greece, I can't earn money because there is no work,\" Waqas said. \"Pakistan is better. I have my family who love me. Here I have nobody who understands me, who loves me.\"\n___\nRaphael Kominis and Elena Becatoros in Athens, and Konstantin Testorides in Macedonia, contributed to this report.\nIn this photo taken on Sunday, Jan. 10, 2016 people from Somalia rest at the Hellenikon shelter, a former Olympic field hockey venue, in southern Athens. A tightening of border controls closer to the promised lands of Germany and Sweden has left thousands trapped and destitute in the last place most want to be _ financially-wrecked Greece, which is Europe¿s main immigration gateway. (AP Photo/Thanassis Stavrakis)\nIn this photo taken on Saturday, Jan. 9, 2016 a woman holds her daughter's hand as they walk through the Eleonas refugee camp in Athens. A tightening of border controls closer to the promised lands of Germany and Sweden has left thousands trapped and destitute in the last place most want to be _ financially-wrecked Greece, which is Europe¿s main immigration gateway. (AP Photo/Thanassis Stavrakis)\nIn this photo taken on Saturday, Jan. 9, 2016 a Palestinian cuts the hair of a compatriot at the Eleonas refugee camp in Athens. A tightening of border controls closer to the promised lands of Germany and Sweden has left thousands trapped and destitute in the last place most want to be _ financially-wrecked Greece, which is Europe¿s main immigration gateway. (AP Photo/Thanassis Stavrakis)\nIn this photo taken on Sunday, Jan. 10, 2016 a man from Libya hangs his wet shoe laces on a fence at the Hellenikon shelter, a former Olympic field hockey venue, in southern Athens. A tightening of border controls closer to the promised lands of Germany and Sweden has left thousands trapped and destitute in the last place most want to be _ financially-wrecked Greece, which is Europe¿s main immigration gateway. (AP Photo/Thanassis Stavrakis)\nIn this photo taken on Saturday, Jan. 9, 2016 a Pakistani man plays cricket as a boy covers his face at the Eleonas refugee camp in Athens. A tightening of border controls closer to the promised lands of Germany and Sweden has left thousands trapped and destitute in the last place most want to be _ financially-wrecked Greece, which is Europe¿s main immigration gateway. (AP Photo/Thanassis Stavrakis)\nIn this photo taken on Saturday, Jan. 9, 2016 migrants play basketball and cricket at the Eleonas refugee camp in Athens. A tightening of border controls closer to the promised lands of Germany and Sweden has left thousands trapped and destitute in the last place most want to be _ financially-wrecked Greece, which is Europe¿s main immigration gateway. (AP Photo/Thanassis Stavrakis)\nIn this photo taken on Sunday, Jan. 10, 2016 a family arrives at the Hellenikon shelter, a former Olympic field hockey venue, in southern Athens. A tightening of border controls closer to the promised lands of Germany and Sweden has left thousands trapped and destitute in the last place most want to be _ financially-wrecked Greece, which is Europe¿s main immigration gateway. (AP Photo/Thanassis Stavrakis)\nIn this photo taken on Sunday, Jan. 10, 2016 Iranians play volleyball at the Hellenikon shelter, a former Olympic field hockey venue, in southern Athens. A tightening of border controls closer to the promised lands of Germany and Sweden has left thousands trapped and destitute in the last place most want to be _ financially-wrecked Greece, which is Europe¿s main immigration gateway. (AP Photo/Thanassis Stavrakis)\nIn this photo taken on Sunday, Jan. 10, 2016 migrants rest at the Hellenikon shelter, a former Olympic field hockey venue, in southern Athens. A tightening of border controls closer to the promised lands of Germany and Sweden has left thousands trapped and destitute in the last place most want to be _ financially-wrecked Greece, which is Europe¿s main immigration gateway. (AP Photo/Thanassis Stavrakis)\nIn this photo taken on Saturday, Jan. 9, 2016 people sit outside their container houses at Eleonas refugee camp in Athens. A tightening of border controls closer to the promised lands of Germany and Sweden has left thousands trapped and destitute in the last place most want to be _ financially-wrecked Greece, which is Europe¿s main immigration gateway. (AP Photo/Thanassis Stavrakis)\nIn this photo taken on Saturday, Jan. 9, 2016 a boy plays with a soccer ball as a girl sits on a chair in front of graffiti at the Hellenikon shelter, a former Olympic field hockey venue, in southern Athens. A tightening of border controls closer to the promised lands of Germany and Sweden has left thousands trapped and destitute in the last place most want to be _ financially-wrecked Greece, which is Europe¿s main immigration gateway. (AP Photo/Thanassis Stavrakis)","url":"https://www.dailymail.co.uk/wires/ap/article-3393958/Tighter-border-checks-leave-migrants-trapped-Greece.html"}
