{"authors":["Harriet Mallinson For Mailonline"],"date_download":"2018-10-22 22:41:30","date_modify":"2018-10-22 22:41:30","date_publish":"2016-01-28 10:54:55","description":"Alfredo Alvarez, a Tijuana-based journalist, uploaded a video of what seems to be a poltergeist in a Mexican supermarket. Items fall off the shelves of their own accord, terrifying shoppers.","filename":"data/vaneerConsumption/TijuanajournalistAlfredoAlvarezuploadsvideoofpoltergeistinsupermarket.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9E44F00000578-0-image-a-2_1453980339025.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420562_Alfredo-Alvarez-Tijuana-based-journalist-uploads-video-poltergeist-supermarket_1540248090.html","title":"Tijuana journalist Alfredo Alvarez uploads video of poltergeist in supermarket","title_page":"Tijuana journalist Alfredo Alvarez uploads video of poltergeist in supermarket | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the frightening moment CCTV captured food flying off supermarket shelves... seemingly of its own accord.\nThe video was uploaded to YouTube by Tijuana-based journalist, Alfredo Alvarez, and is believed to be filmed in Mexico.\nWhile the footage begins as an innocuous supermarket scene, it soon becomes spooky when various items such as mayonnaise suddenly tumble on to the floor and scatter across the aisle as though thrown.\nJust a normal aisle: This is the frightening moment CCTV captured food flying off supermarket shelves... seemingly of its own accord. The video was uploaded to YouTube by Tijuana-based journalist, Alfredo Alvarez\nMysterious flying object: While the footage begins as an innocuous supermarket scene, it soon becomes terrifying when various items such as mayonnaise suddenly tumble on to the floor and scatter across the aisle as though pushed\nA confused shopper hurries over to investigate but looks around, baffled as to what could have happened.\nA few others approach the scene, some more cautiously than others.\nOne man goes up to examine the shelves, reaching out to touch them as well as staring at the floor in fascination.\nThe muffled audio captures people speculating as to whether it could have been the work of a poltergeist.\nOne customer even said she sensed the presence of a spectral being.\nMexican news source, TV Notas said the video's popularity on social media had provoked much discussion about whether supernatural beings like ghosts really do exist.\nPoltergeist is a German word meaning 'noisy spirit'.\nAccording to folklore and paranormal experts a poltergeist is a type of ghost responsible for physical disturbances including noises as the movement of objects.\nAccounts also involve poltergeists levitating objects and tripping, biting and hitting people.\nFallen goods: A confused shopper hurried over to investigate but looks around, baffled as to what could have happened. A few others approach the scene, some more cautiously than others","url":"https://www.dailymail.co.uk/news/article-3420562/Alfredo-Alvarez-Tijuana-based-journalist-uploads-video-poltergeist-supermarket.html"}
