{"authors":["Associated Press"],"date_download":"2018-10-22 23:53:52","date_modify":"2018-10-22 23:53:52","date_publish":"2017-03-16 08:09:15","description":"TOKYO (AP) - U.S. Secretary of State Rex Tillerson called on North Korea Thursday to abandon its nuclear and ballistic missile programs, saying the isolated...","filename":"data/vaneerConsumption/TillersonsaysNKoreaneednotfearUnitedStates.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/11/wire-228077-1489664363-18_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319202_Tillerson-says-Asia-allies-critical-addressing-NKorea_1540252432.html","title":"Tillerson says NKorea 'need not fear' United States","title_page":"Tillerson says NKorea 'need not fear' United States | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TOKYO (AP) - U.S. Secretary of State Rex Tillerson called on North Korea Thursday to abandon its nuclear and ballistic missile programs, saying the isolated nation \"need not fear\" the United States.\nTillerson made that declaration after meeting his Japanese Foreign Minister Fumio Kishida in Tokyo, where they discussed possible new approaches in dealing with Pyongyang.\nHe said 20 years of U.S. diplomatic and other efforts to get North Korea to denuclearize have failed, but gave no specifics about how the Trump administration, which is currently doing a policy review, would tackle the issue. Tillerson described the weapons programs as \"dangerous and unlawful.\"\nU.S. Secretary of State Rex Tillerson, left, and Japanese counterpart Fumio Kishida, right, shake hands prior to their bilateral meeting at the Foreign Ministry's Iikura Guesthouse in Tokyo, Thursday, March 16, 2017. Tillerson is in Tokyo for the first leg of the trip to Asia, which is occurring amid escalating tensions with North Korea.(AP Photo/Eugene Hoshiko)\nNorth Korea has long sought a peace treaty with the U.S. to replace the armistice that ended the 1950-53 Korean War. China recently proposed the two sides hold parallel negotiations on nuclear matters and a treaty. It wasn't clear if Tillerson was alluding to that suggestion in his remarks. Washington has said in the past that the North's nuclear weapons program must be settled first, and even talks on that issue have been stalled for years.\nThe former Exxon Mobil CEO is making his first trip to Asia as the top U.S. diplomat. Tensions are running high on the divided Korean Peninsula, and North Korea last week launched four missiles into seas off Japan and where the U.S. is currently conducting annual military drills with South Korea. Pyongyang views this as a rehearsal for invasion.\n\"North Korea and its people need not fear the United States or their neighbors in the region who seek only to live in peace with North Korea,\" the secretary of state told a news conference in Tokyo. \"With this in mind, the United States calls on North Korea to abandon its nuclear and ballistic missile programs and refrain from any further provocation.\"\nHe later met separately with Japanese Prime Minister Shinzo Abe.\nIn Beijing, a North Korean diplomat said Thursday that Pyongyang must act in self-defense against the U.S.-South Korea military drills which he said have brought the region to the brink of nuclear war. He said the drills were aimed at using atomic weapons for a pre-emptive strike against North Korea. Washington says the maneuvers are routine and defensive.\n\"The United States holds a joint military exercise every year to push the situation on the Korean Peninsula to a serious situation, and that is the source of the super tough measures we must take,\" Pak Myong Ho told reporters in a rare briefing at the North Korean Embassy in the Chinese capital. He spoke through a translator.\nNorth Korea has accelerated its weapons development in violation of multiple U.N. Security Council resolutions and despite tough sanctions levied against it. Last year, the North conducted two nuclear test explosions and 24 ballistic missile tests. Experts say it could have a nuclear-tipped missile that could reach the United States within a few years.\nCiting the continued North Korean missile launches this year, Tillerson said that \"in the face of this ever-escalating threat it is clear that a different approach is required.\" He said his trip was intended to get input from other governments. Tillerson will travel Friday to South Korea and then China on Saturday.\nBoth Tillerson and Kishida urged China use its economic leverage with North Korea to push it to change course.\nDuring last year's election campaign, presidential candidate Donald Trump called into question U.S. security alliances and called for Tokyo and Seoul to contribute more for their defense. Tillerson, however, stressed that cooperation with Japan and South Korea was \"critical.\"\nKishida said the U.S. and Japan had an \"unwavering bond.\" In a sign of that, Tillerson reiterated that a U.S.-Japan mutual defense treaty covers Japanese-administered islands in the East China Sea also claimed by China.\nJapan and South Korea both host tens of thousands of U.S. troops. Washington has been urging its two allies to step security up cooperation despite their historically strained relations. This week, the nations' three navies have conducted missile defense information-sharing drills in the region.\nKishida described the trilateral cooperation as \"indispensable.\" But he said the Japan-South Korea relationship has been strained over failure to implement a 2015 agreement in which Japan's government consented to compensate South Korean victims of sexual slavery inflicted by the Japanese military during World War II. In return, South Korea was to stop criticizing Japan on the issue.\nEarlier this year, Japan withdrew its ambassador from South Korea after activists there erected a statue outside a Japanese consulate to commemorate the wartime victims, known as \"comfort women.\"\nTillerson said he appreciated how \"painful\" it was to deal with such historical issues, but urged both sides to carry out the agreement and bring the matter to a rapid conclusion. He said it was important for all three nations to maintain a strong alliance \"in which there is no space between us.\"\n____\nAssociated Press writer Gillian Wong in Beijing contributed to this report.\nU.S. Secretary of State Rex Tillerson, left, speaks to Japanese counterpart Fumio Kishida, during their bilateral meeting at Iikura House in Tokyo, Thursday, March 16, 2017. (AP Photo/Eugene Hoshiko)","url":"https://www.dailymail.co.uk/wires/ap/article-4319202/Tillerson-says-Asia-allies-critical-addressing-NKorea.html"}
