{"authors":["Pauline Bartolone","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:52:48","date_modify":"2018-10-30 22:52:48","date_publish":"2016-07-13 01:19:44","description":"Review state measures granting rights, opportunities and protections to undocumented immigrants.   Highlights of state measures granting","filename":"data/vaneerConsumption/TimelineCaliforniapoliciesofinclusionfortheundocumented.json","image_url":"https://calmatters.org/wp-content/uploads/favicon-150x150.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939968.html","title":"Timeline: California policies of inclusion for the undocumented","title_page":"Timeline: California policies of inclusion for the undocumented | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Review state measures granting rights, opportunities and protections to undocumented immigrants.\nHighlights of state measures granting unauthorized immigrants rights, protections and opportunities.\n1996\nPrenatal care available for all low-income residents, regardless of legal status.\n2001\nIn-state tuition at public universities approved for undocumented students who attend high school in California for three or more years.\n2007\nCities may not require landlords to check whether tenants are in the country legally.\n2011\nAccess to state financial aid granted for undocumented students at public universities and community colleges.\nState, cities and counties may not require that private employers use E-Verify, a federal program for checking workers’ immigration status.\n2012\nThose who qualify for President Obama’s Deferred Action for Childhood Arrivals (DACA) order may apply for a California driver’s license as well as Medi-Cal, the state’s health care coverage for the poor.\n2013\nAll undocumented immigrants may apply for a driver’s license.\nLocal law enforcement agencies may not detain people for deportation if they are arrested for a minor crime and eligible to be released from custody.\n2014\nCollege students who qualify for may apply for state-funded loans.\nUndocumented immigrants who pass the State Bar exam may practice law in California.\nAll 40 state licensing boards — for doctors, dentists, security guards, etc — must consider applicants regardless of immigration status.\n2015\nComprehensive health care provided to all low-income children, regardless of immigration status.\nUnauthorized immigrants are protected from deportation if they are victims of certain crimes and cooperate with police.\nSources: UC Riverside School of Public Policy, California Department of Health Care Services","url":"https://calmatters.org/articles/timeline-california-policies-of-inclusion-for-the-undocumented/"}
