{"authors":[],"date_download":"2018-10-30 01:23:41","date_modify":"2018-10-30 01:23:41","date_publish":"2016-05-20 05:00:11","description":null,"filename":"data/vaneerConsumption/TimefortheMiyagiDoctrine.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/05/Karate_Kid_2944550918.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862621.html","title":"Time for the Miyagi Doctrine","title_page":"Time for the Miyagi DoctrineThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Who’ll teach our Karate Kid foreign policy wannabes what winning means?\nMy basic idea of a sane foreign policy outlook was best put by a B-movie actor in a 1980s film franchise that refuses to go away. “Fighting not good. But if must fight, win,” said Mr. Miyagi, played by Pat Morita, in one of the many Karate Kid sequels and reboots. I’ve decided to dub this the Miyagi Doctrine.\nThe Karate Kid movies, starring Ralph Macchio, Hilary Swank, and most recently Jaden Smith, are not high art but they do have their moments. Their central preoccupation, not just how we fight but why, is a worthy one. The different answers that the movies consider are for status, for love, for honor, and for survival.\nOne facet of the films that critics have lately brought out is how Daniel LaRusso, “Daniel-san,” does not exactly start out as a good guy. Movie buff J. Matthew Turner did a revisionist YouTube video titled “Daniel is the REAL bully” that has been viewed nearly 6 million times since last August. Turner challenges us to think of Karate Kid as the tale of “a violent sociopath” — Daniel — “who moves to a California town and begins tormenting a local boy and his friends.”\nThat interpretation may go a bit too far but it’s true that Daniel is a hothead who picks fights for dumb reasons that he can’t win. When Mr. Miyagi intervenes to save him from a beating by a bunch of boys — Johnny Lawrence and friends who train at the Cobra Kai dojo — he bloody well had it coming.\nThe thing that Mr. Miyagi manages to do over a few movies is to teach him not only how to fight if necessary but why he usually shouldn’t fight. That proves true not just for him but for the boys he goads into fighting as well. Many of the fighters end up much worse for the wear — at times bruised, bloodied, broken, and humiliated.\nBut Miyagi’s approach is not pacifism. The flip side of the Miyagi Doctrine is that when all other avenues for a peaceful settlement have been exhausted and the fight can no longer reasonably be ducked, it is vitally important to win the fight.\nAnd by “win,” I mean win it unambiguously so as to settle the dispute and thereby prevent further violence. Thus in the first movie, Miyagi strikes a deal to channel all of the conflict between Daniel and Johnny and company into a formal confrontation in a tournament. It works. When Daniel manages to knock Johnny to the mat, Johnny tearfully presents him with the trophy and thereby buries the hatchet.\nCan what is true in the world of hot blooded teen boys scale up to the world of international affairs as well?\nI think it can, though let’s not typecast America in the role of Daniel. We can learn from all of the players in the story.\nIn fact, with our vastly superior military and technology, you could say that we resemble the Cobra Kai kids a bit more. Our country has lately found itself drawn into just about every fight you can name in the Middle East and Northern Africa, from Afghanistan to Iraq to Libya to Syria to Yemen to Iraq again.\nMost of these wars and interventions turn out to be quite unpopular with voters, but we just seem to get sucked back into them, bringing more bombs and boots to fights that we might have been better to avoid in the first place.\nWe keep fighting with intermittent victories, but we don’t decisively win because we don’t have clear goals in mind. We vow to end “terror” or to pursue a democracy agenda or some such rather than fastening onto more limited and achievable goals, such as, oh I don’t know, “Let us use our undivided resources to find and kill Osama bin Laden, the guy most responsible for bringing down the World Trade Center, before we even think about doing anything else.”\nAnd then we get surprised when the latest upstart — “the JV team,” we might call them — gives us a crane kick to the face.\nSo remember: “Fighting not good. But if must fight, win.” Eight words, intentionally ungrammatical, that ought to be unforgettable. Just to be sure, somebody needs to tape that above the president’s computer monitor in the Oval Office. Perhaps the night janitor could do us all a favor.\nJeremy Lott is a senior fellow at Defense Priorities.\nHelgi Halldórsson/Creative Commons","url":"https://spectator.org/time-for-the-miyagi-doctrine/"}
