{"authors":["Associated Press"],"date_download":"2018-10-23 02:09:13","date_modify":"2018-10-23 02:09:13","date_publish":"2016-01-28 16:54:38","description":"Key events in the turbulent political career of former Providence Mayor Vincent \"Buddy\" Cianci, Jr., who died Thursday at 74: Nov. 5, 1974: Running as a Repu...","filename":"data/vaneerConsumption/TimelineofthelateBuddyCiancispoliticalcareer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:b5dbeb8671fc4e9288466e0957bd21f9-2vdWmEltwXfba0ce28e632acd720-257_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421310_Timeline-late-Buddy-Ciancis-political-career_1540260553.html","title":"Timeline of the late Buddy Cianci's political career","title_page":"Timeline of the late Buddy Cianci's political career | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Timeline of the late Buddy Cianci's political career\nKey events in the turbulent political career of former Providence Mayor Vincent \"Buddy\" Cianci, Jr., who died Thursday at 74:\nNov. 5, 1974: Running as a Republican anti-corruption candidate, Cianci, a prosecutor, wins his first race for Providence mayor against Democrat Joseph Doorley.\nJan. 6, 1975: Cianci sworn in as mayor of Providence, becoming city's first Italian-American mayor.\nFILE - In this Dec. 5, 2002, file photo, former Providence, R.I., Mayor Vincent \"Buddy\" Cianci Jr., walks away from the media following an impromptu news conference outside the Biltmore Hotel where he was living in Providence, R.I. Cianci died Thursday, Jan. 28, 2016, in Providence. He was 74. (AP Photo/Victoria Arocho, File)\n1976: Cianci speaks at Republican National Convention.\n1978: Cianci wins a second term.\n1980: Cianci runs unsuccessfully for governor as a Republican, losing to Democrat Joseph Garrahy in a landslide. He later calls it \"the worst campaign of my career.\"\n1982: Cianci wins a third term, this time running as an independent.\nMarch 20, 1983: Using a lit cigarette, ashtray and fireplace log, Cianci assaults a man he believed was having an affair with his estranged wife. Cianci's director of public works and police detail stand by.\nMarch 5, 1984: Cianci pleads no contest to felony assault with a dangerous weapon and simple assault and battery.\nApril 23, 1984: Cianci receives a five-year suspended sentence and five years of probation.\nApril 25, 1984: Cianci resigns as mayor.\nMarch 1985: Cianci launches a career as a radio talk show host.\nNovember 1990: In a comeback bid, Cianci wins a three-way mayoral race by 317 votes as an independent. He wins additional terms in 1994 and 1998.\nApril 2, 2001: Cianci is indicted on 28 counts.\nJune 24, 2002: Cianci is convicted of one count of racketeering conspiracy.\nSept. 6, 2002: Cianci is sentenced to more than five years in prison and forced out of office.\nMay 30, 2007: Cianci is released from prison to a Boston halfway house.\nJuly 27, 2007: Cianci is released from federal custody.\nSept. 20, 2007: Cianci returns to the airwaves as a radio talk show host.\nJune 25, 2014: Cianci launches another comeback bid for mayor.\nAug. 18, 2014: An Associated Press investigation reveals that Cianci's pasta sauce, marketed to help provide college scholarships, made no money in the last four years.\nOct. 8, 2014: Campaign finance reports show Cianci took donations from city workers despite pledging not to.\nNov. 4, 2014: Cianci loses comeback bid for seventh mayoral term to Jorge Elorza.\nNov. 19, 2015: Official portrait of Cianci is unveiled at City Hall; he quips, \"I've been framed.\" He is briefly hospitalized after becoming lightheaded at the ceremony.\nDec. 25, 2015: Cianci is engaged to former campaign worker Tara Marie Haywood.\nJan. 27, 2016: Cianci is hospitalized with severe stomach pains while taping his weekly TV show.","url":"https://www.dailymail.co.uk/wires/ap/article-3421310/Timeline-late-Buddy-Ciancis-political-career.html"}
