{"authors":["Thomas Colson"],"date_download":"2018-10-30 20:39:19","date_modify":"2018-10-30 20:39:19","date_publish":"2016-12-28 00:00:00","description":"After decades of runaway growth, 2017 could be the year the capital's property boom finally grinds to a halt.","filename":"data/vaneerConsumption/TimesSurveyLondonspropertybubblewillfinallyburstin2017.json","image_url":"https://amp.businessinsider.com/images/594a7d8c5d3e4e1aa5055ba5-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_times-survey-londons-property-bubble-will-finally-burst-in-2017-2016-12_1540931959.html","title":"Times Survey: London's property bubble will finally burst in 2017","title_page":"    Times Survey: London's property bubble will finally burst in 2017 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Gladstone Park in London's Willesden Green Wikipedia / CC 3.0 LONDON — After decades of runaway growth, 2017 could be the year the capital's property boom finally grinds to a halt.\nThat's according to a Times survey of leading economists released on Wednesday. Twenty-two from 39 economists surveyed predicted that London house prices would either flatline or drop in 2017.\nAt the more extreme end of the predictions, DeAnne Julius, a former member of the Bank of England's monetary policy committee, and Charles Dumas, chairman of Lombard Street Research, said prices could fall by as much as 10% next year.\nStephanie Flanders, chief market strategist at JP Morgan, predicted a 7% drop.\nA growing consensus\nThe survey forms part of a growing consensus that one of the greatest asset run-ups in British history is over — a boom which saw average house prices in the capital grow from £257,000 in 2006 to £474,000 in 2016.\nMortgage lender Nationwide predicts that house prices in central London will increase by a nominal 2% next year, which equates to a real terms drop if inflation hits its predicted 2.7%.\nMeanwhile, the Royal Institute for Chartered Surveyors (RICS) forecasts a flatlining housing market in 2017, with foreign investment offsetting a decline in UK buyers.\nResearch from Knight Frank in December found that house prices in \"prime\" central London — those properties worth over £2 million — has already dropped by in some areas by as much as 13% over the past 12 months. The estate agent expects \"broadly flat price growth in 2017 as declines start to bottom out.\"\nSo what's happening?\n1. An inflated housing market\nHalifax, Britain's biggest mortgage lender, warned that price falls are an inevitable consequence of an inflated housing market. \"House prices in relation to average earnings are at an historical high in the capital; at nine times annual average earnings,\" said Halifax's housing economist Martin Ellis in an emailed statement.\n\"Additionally, mortgage affordability in London is worse than its long run average ... price growth will slow more sharply in London than elsewhere during 2017. There is a risk of some price falls in parts of London, particularly in the most expensive central locations, in 2017,\" he added.\nMortgage lending is set weaken in 2017 compared to 2016, and the difficulty of securing a house-buying loan in London will be particularly significant.\n2. Brexit\nPolitical uncertainty will be a dominant theme of 2017. Knight Frank said: \"Political uncertainty is unlikely to subside in the early part of next year as the UK triggers the process to leave the European Union, Donald Trump potentially charts a new economic course in the US and ahead of elections in several European countries.\"\nThe UK's vote to leave the European Union in June is weighing particularly heavily on London's housing market. Market analysts Hometrack say that concerns over the financial impact of Brexit will \"weigh on the housing market sentiment, particularly in southern England.\" The importance of the financial services sector to London's economy makes it particularly vulnerable.\nAnother Brexit-related problem is rising inflation, which the Bank of England predicts will increase by 2.7% next year as pessimism over Brexit keeps the pound cheap and drives up the price of imports. That means that even the nominal price rise of 2% in London property values which Hometrack predicts will be outstripped by inflation.\n3. A fall in transaction volumes\nA report from estate agents Portico earlier in December identified another warning trend. It found that transaction volumes in London — the number of houses being bought and sold — was \"critically low,\" and in some areas 50% below than the previous year.\nVolume decline often indicates price decline. Take a look at this chart:\nPortico\nIt shows that volume decline preceded price decline at the beginning of 2008, when a recession hit the UK. Volume recovery preceded price recovery the following year.\nPortico said the London property market has \"clearly\" started reacting to the drop in volumes already, and forecasted a 6-7% decrease in prime central London prices next year. It also expected the price slump to \"filter out\" to greater London.\n4. Buyers are looking elsewhere\nResearch from estate agents Hamptons found that Housebuyers in the capital are fleeing at the fastest rate for 10 years, with 77,500 Londoners buying houses outside the city in 2016 — 22% more than in 2015. That demonstrates an increased willingness to purchase property in London's \"commuter belt,\" which may be contributing to a slowdown in demand in central London.\nHamptons head of research Johnny Morris believes, however, that next year's slowdown could actually attract buyers back to central London. He said: \"It is likely 2016 will be a peak for London leavers. While, overall, the year saw growth in Londoners buying outside of the capital, in recent months the pace has been slowing. A slower housing market in 2017 will likely mean that we see less Londoners buying outside of the capital than in 2016.\"\n5. Weak demand\nWhen supply grows faster than sales, slower house price growth is a natural market response. Take a look at this chart from Hometrack:\nHometrack\nIn Birmingham and Manchester, where house prices are set to grow faster, supply is not keeping pace with sales. In London, buyers aren't snapping up houses at the same rate they're being sold, meaning a stall in prices is more or less inevitable.","url":"https://www.businessinsider.com/times-survey-londons-property-bubble-will-finally-burst-in-2017-2016-12"}
