{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 18:43:43","date_modify":"2018-10-30 18:43:43","date_publish":"2015-10-06 17:19:14","description":"A senior member of the Gaza-ruling terrorist group Hamas has called for a third intifada, or terror uprising, against Israel","filename":"data/vaneerConsumption/TimeforThirdIntifadaAgainstIsrael.json","image_url":"https://media.breitbart.com/media/2015/10/Mideast-Palestinians-AP-PhotoAdel-Hana.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_10_06__1540925023.html","title":"Time for 'Third Intifada' Against Israel","title_page":"Hamas Leader: Time for 'Third Intifada' Against Israel","title_rss":"NULL","source_domain":"breitbart.com","text":"A senior member of the Gaza-ruling terrorist group Hamas has called for a third intifada, or terror uprising, against the Jewish state of Israel.\nMahmoud al-Zahar, who previously served as Foreign Minister of the Palestinian National Authority, but now helps lead Hamas, said that now is the time for Palestinians to rise up against Israel.\nAl-Zahar told the website of Hamas that an intifada is the only way to protect Jerusalem’s Al Aqsa mosque from Israel. Notably, Palestinian and regional leaders have decried Israel’s supposed “desecration” of the mosque. However, Israeli authorities are not even in charge of the grounds surrounding the mosque, and there has been no evidence presented of Israel tampering with the status quo around the holy site.\n“The image of Palestinians from the West Bank and Jerusalem throwing stones and Molotov cocktails has dealt a blow to the occupier,” Al-Zahar said in approval of Palestinian riot tactics.\nThe Palestinian Authority (PA), however, is refusing to openly call for another intifada, although their leadership continues to justify and incite violence against Israelis.\nPA President Mahmoud Abbas instructed his security forces to ramp up preventive measures in the West Bank in order to quell the surge in Palestinian violence, the Jerusalem Post reports. The office of President Abbas said the additional security measures were taken to “ensure security for the homeland and the people.”\nAlthough Palestinian leaders continue to incite terror and refuse to condemn the murder of innocents, Abbas made clear that he does not want to square off against the might of the Israel Defense Forces (IDF).\nAbbas said Tuesday at a meeting with the Palestine Liberation Organization (PLO): “We tell them (the Israelis) that we do not want either military or security escalation. All our instructions to our (security) agencies, our factions and our youth have been that we do not want escalation.”\nSeparately, the Israeli Defense Ministry announced on Tuesday that workers had completed construction of a security fence that provides protection for the Israeli communities situated near Israel’s Gaza border. The fence was built in anticipation of a future conflict with Hamas, which started a war with Israel in the summer of 2014 when its henchman assassinated three Israeli teenagers.","url":"https://www.breitbart.com/national-security/2015/10/06/hamas-leader-time-third-intifada-israel/"}
