{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:55:38","date_modify":"2018-10-30 19:55:38","date_publish":"2016-07-26 16:10:19","description":"In 2007, Seung-Hui Cho opened fire on gun-free zone Virginia Tech. In 2008, Gov. Kaine vetoed a bill to allow Virginians to keep a loaded gun in their car.","filename":"data/vaneerConsumption/TimKaineDemocratsRiskOurLivesforGunControl.json","image_url":"https://media.breitbart.com/media/2015/02/gun-free-zone-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_26__1540929338.html","title":"Tim Kaine, Democrats Risk Our Lives for Gun Control","title_page":"Tim Kaine, Democrats Risk Our Lives for Gun Control","title_rss":"NULL","source_domain":"breitbart.com","text":"On April 16, 2007, Seung-Hui Cho opened fire with a handgun on gun-free zone Virginia Tech University, killing 32 unarmed innocents. Less than a year later, in March 2008, Governor Tim Kaine (D) vetoed a bill intended to mitigate the chances of such a slaughter reoccurring by allowing Virginians to keep a loaded gun in their car for self-defense.\nWhile a repeal of the gun-free status of the Virginia Tech campus would have been ideal, at least allowing Virginians to keep a gun in the car that they could retrieve in an emergency would give them a fighting chance. But Kaine said no.\nMoreover, on March 4, 2008, the NRA-ILA announced that Kaine was also vetoing legislation that would have allowed concealed permit holders to carry guns for self-defense into restaurants that serve alcohol. The bill, SB 476, would have simply required that permit holders forgo alcohol in such establishments if they have a gun in their possession. Thirty-one states already allowed restaurant and/or bar carry at the time lawmakers passed SB 476. But Kaine said no.\nWith both vetoes, Kaine preserved gun-free zones in the wake of a shooting at gun-free Virginia Tech that rattled our nation to its core and cost 32 lives.\nOnly months after the heinous attack at Sandy Hook Elementary School–another seminal moment in gun-free zone violence–the Obama administration argued that the possibility of an “active shooter” situation is not, in itself, sufficient cause to allow teachers and/or school staff to be armed for self-defense. The Huffington Post published the report, which not only went against the idea of teachers and/or staff being able to shoot armed men who enter gun-free zones to do harm, but actually suggested the best response to such a dire situation is to throw “fire extinguishers,” “chairs,” or whatever else is close at hand.\nThe study said:\nIf neither running nor hiding is a safe option, as a last resort when confronted by the shooter, adults in immediate danger should consider trying to disrupt or incapacitate the shooter by using aggressive force and items in their environment, such as fire extinguishers, and chairs.\nSo when a Seung-Hui Cho or an Adam Lanza enters a teacher’s classroom armed, the first line of self-defense is a fire extinguisher that has to be pulled off a wall, a chair that may be too heavy to throw, or a book that the gunman will deflect as he continues to shoot.\nThis study came after Lanza entered a gun-free zone and killed 26 people at his leisure. No one could shoot back. Nonetheless, Democrats dug in, defended the gun-free status of schools, and then pushed for new laws via the Manchin/Toomey gun control bill, even though Senator Joe Manchin (D-WV) admitted that his gun control bill would not have prevented the Sandy Hook attack.\nSenator Tim Kaine (D-VA) supported Manchin/Toomey.\nGun-free zones are fertile ground for killers, but Kaine and Democrats have yet to act to repeal the existence of such zones. Instead, they work to preserve them. Kaine preserved them as governor, and Democrats, especially the Obama administration, worked to preserve them in the wake of Sandy Hook. Instead of removing such zones, which telegraph vulnerability and sitting-duck status to would-be assailants, Kaine and his fellow Democrats emerge from dastardly attacks like Sandy Hook working to increase gun control on the backs of law-abiding citizens, whereby lives continue to be sacrificed.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/07/26/tim-kaine-democrats-risk-our-lives-for-gun-control/"}
