{"authors":["Daily Mail Australia Reporter"],"date_download":"2018-10-23 01:15:51","date_modify":"2018-10-23 01:15:51","date_publish":"2017-04-26 11:33:08","description":"On Wednesday, reality star Tim Robards cooled off at Bondi Beach, flaunting his fit physique days after appearing awkward on the Logie Awards red carpet.","filename":"data/vaneerConsumption/TimRobardsshowsoffVERYchiselledchestatBondiBeach.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9DD46300000578-0-image-a-10_1493199063675.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446968_Tim-Robards-shows-chiselled-chest-Bondi-Beach_1540257351.html","title":"Tim Robards shows off VERY chiselled chest at Bondi Beach","title_page":"Tim Robards shows off VERY chiselled chest at Bondi Beach | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He raised eyebrows when he appeared uncomfortable alongside girlfriend Anna Heinrich at the Logie Awards earlier this week.\nBut on Wednesday, Tim Robards was back in his element, seen smiling as he stripped off for a swim at Bondi Beach.\nWhile Anna was nowhere to be seen, the 34-year-old exercise enthusiast was at his buff best, showing off his bulging biceps and chiselled chest during the daytime dip.\nStrip and dip! On Wednesday, reality star Tim Robards cooled off at Bondi Beach, flaunting his fit physique days after appearing awkward on the Logie Awards red carpet\nThe original Bachelor hunk wore nothing but a pair of blue patterned boardshorts, which hung perilously low as he emerged from the water.\nTim is a fixture at the famous beach, regularly seen flaunting his fit physique to the delight of many female onlookers.\nAs he walked across the sand, the star's sunny disposition was a stark contrast from the rather tense display he put on at the Logies.\nBack in his element: Tim looked at ease as he waded out of the water showing off his rippling abs\nShirtless display: The original Bachelor hunk wore nothing but a pair of blue patterned boardshorts, which hung perilously low\nThe chiropractor barely cracked a smile as he appeared on the red carpet.\nDespite the rather dour appearance, the handsome star looked dapper suited up in a Hugo Boss tuxedo.\nMeanwhile, girlfriend Anna appeared nervous as she arrived at the awards show, and was initially stone-faced as she posed for photographers.\nHunky: The fitness enthusiast showed off the results of his labour in the gym with his chiselled chest on prominent display\nBuff in Bondi: The star is a fixture on the famous beach, flaunting his fit physique for female admirers\nHowever, the lawyer and toothpaste brand ambassador, later cracked a smile while posing to one side, showing off the back of her Steven Khalil gown.\nThe glamorous couple seemed in a much better mood the following day as they flew home to Sydney from Melbourne.\nThe couple cosied up for an airport snap with Australian actor Shane Jacobson, boarding the aircraft.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446968/Tim-Robards-shows-chiselled-chest-Bondi-Beach.html"}
