{"authors":["Marta Jary For Daily Mail Australia"],"date_download":"2018-10-22 21:02:40","date_modify":"2018-10-22 21:02:40","date_publish":"2017-03-16 00:27:50","description":"Tim Robards has revealed he she stayed celibate for the entire three months he was on The Bachelor out of respect for the woman he eventually chose.","filename":"data/vaneerConsumption/TimRobardssayshestayedCELIBATEonTheBachelor.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4FE19800000578-0-image-a-24_1489624263386.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318362_Tim-Robards-says-stayed-CELIBATE-Bachelor_1540242160.html","title":"Tim Robards says he stayed CELIBATE on The Bachelor","title_page":"Tim Robards says he stayed CELIBATE on The Bachelor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tim Robards has revealed he stayed celibate for the entire three months he was on The Bachelor out of respect for the woman he eventually chose.\nBut the 34-year-old admits that he couldn't wait to jump in bed with his eventual pick, Anna Heinrich, 30, who he is still dating close to four years later.\nWhen asked by Kyle and Jackie O on Wednesday's breakfast show if he slept with any of the contestants on his season of the dating series, Tim said a definitive no.\nCouldn't wait! Tim Robards admits that he couldn't wait to jump in bed with his eventual pick, Anna Heinrich, 30, who he is still dating close to four years later.\nHe told the radio hosts, 'I just thought, at the end of the day you're going to have to explain that to your Mrs'.\nTim also hinted that he knew who he was going to pick all along and kept himself chaste for her.\n'Do you really, really not have any idea who you're going to end up with?' he said, indicating he did in fact have an idea of who he'd choose.\nMale urges! The fitness guru said, 'As a guy you have those urges. It's three months of no sex! But you just have to think a little bit with your brain and heart and exercise some control'\nHowever Tim did admit he was tempted and it was tough not to break his celibacy vow during filming.\nThe fitness guru said, 'As a guy you have those urges. It's three months of no sex! But you just have to think a little bit with your brain and heart and exercise some control.'\nOnce he picked Anna, Tim joked that the pair were in bed in 'minutes'.\nTempted: Tim did admit he was tempted and it was tough not to break his celibacy vow during filming\n'Minutes. Minutes! It was a matter of minutes I think,' he teased before admitting it was in fact that that evening after they spent a little more time together.\n\"(It was) that night. We didn't walk off straight away (and do it)' he said laughing.\nTim also joked that he had now 'set the tone' for the show, which means new Bachelor Matty J would also have to refrain from sex with the contestants in order to seem like a gentleman.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318362/Tim-Robards-says-stayed-CELIBATE-Bachelor.html"}
