{"authors":["Candice Jackson For Daily Mail Australia"],"date_download":"2018-10-23 02:23:11","date_modify":"2018-10-23 02:23:11","date_publish":"2017-03-16 12:51:28","description":"He made his return to the catwalk after more than a decade at Myer's fashion show in Sydney.","filename":"data/vaneerConsumption/TimRobardshitsMyerrunwayforfirsttimein10years.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E543BB100000578-0-image-a-78_1489668766945.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319988_Tim-Robards-hits-Myer-runway-time-10-years_1540261391.html","title":"Tim Robards hits Myer runway for first time in 10 years","title_page":"Tim Robards hits Myer runway for first time in 10 years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He made his return to the catwalk after more than a decade at Myer's fashion show in Sydney.\nAnd Tim Robards strutted the runway with the full support of his 'proud girlfriend' Anna Heinrich on Thursday night.\nThe 34-year-old modelled a variety of outfits for the department store as his partner took plenty of photos from the front row.\n'I was quite nervous': Tim Robards walked the runway for first time in 10 years at Myer's fashion show in Sydney on Thursday as 'proud girlfriend' Anna Heinrich took photos from the front row\nThe genetically-blessed couple were in high spirits before Tim's show, posing together backstage with big smiles.\nTim placed his arm around criminal lawyer Anna, while she playfully tussled her curled locks for photographers.\nThe former Bachelor star appeared as physically fit as ever, sporting a blue suit with his button-up revealing part of his chest.\nSmitten! Tim immediately cracked a smile when he saw the excitement on Anna's face capturing his modelling moment on her iPhone\n'I was quite nervous beforehand': Tim joked he had to 'learn to walk again' with a little walk through before the show as he was nervous about his return after 10 years\nEyes only for him! Anna's eyes followed the fitness guru around the room\nSitting in the front row, Anna was seen glued to her iPhone as she followed Tim walking down the runway.\nTim immediately cracked a smile when he saw the excitement on Anna's face.\nSwiveling in her seat, Anna's eyes followed the fitness guru around the room with a large grin.\n'That's my man': Anna watched as her partner walked past in numerous outfits for the department store's runway show\n'So proud of @mrtimrobards for killing it on the runway tonight': Anna took to Instagram to praise her man for an outstanding performance\nShe took to Instagram during the show with images and videos of Tim, claiming she was a 'proud girlfriend'.\nAnna wrote: 'So proud of @mrtimrobards for killing it on the runway tonight.'\nShe also paraded her man in a video, with 'That's my man' and 'Smokin hot' as the captions.\nStunning! The criminal lawyer looked glamorous in a plunging black jumpsuit\nBlonde beauty! Anna wore her hair in light curls over her right shoulder, while sporting a neutral makeup palette\nAnna looked glamorous in a plunging black jumpsuit with zipper detailing at the front of the design.\nShe flaunted her assets in the low-cut ensemble and kept her accessories to a minimum.\nThe flared trousers covered up her trim pins, as she elongated her statuesque frame with black strappy heels.\n'They're my biggest fans... beside Anna': Anna supported Tim from the front row with her parents and Tim's parents, who travelled from Newcastle to watch him\nShe attended the event in support of Tim with her family and also Tim's family in the front row to cheer him on.\nPrior to taking the runway, Tim told Daily Mail Australia he was feeling nervous about his modelling return after 10 years away from the catwalk.\n'I was quite nervous beforehand, we had a little walk through first so that was good to get my bearings and learn how to walk again,' he said.\nSpeaking of his family, who travelled from Newcastle to watch the show, Tim explained: 'They're my biggest fans... beside Anna.'\n'To walk out and see them put a smile on my face and relaxed me': Tim said his family were a huge support during the show and knowing they were in the audience helped calm his nerves\nFriends: Tim said he's ready to share a beer with model Kris Smith (right) after the next show\n'It was great to have my family there, they were a big support. Knowing they were in the audience and to walk out and see them put a smile on my face and relaxed me,' he added.\nTim also said he's ready to share a beer with fellow model Kris Smith after Melbourne's show on Friday.\nWhen asked whether 2017 would be the year he and Anna would move their relationship to the next level, he said: 'We're definitely committed and headed in that direction.'\n'We're definitely committed and headed in that direction': Could 2017 be the year Tim and Anna get engaged?","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319988/Tim-Robards-hits-Myer-runway-time-10-years.html"}
