{"authors":["Robert J. Marlow"],"date_download":"2018-10-30 19:53:55","date_modify":"2018-10-30 19:53:55","date_publish":"2016-07-14 16:32:05","description":"Devout Christian and former Heisman Trophy-winner Tim Tebow spearheads a list of sports celebrities to speak at next week’s Republican National Convention in Cleveland. | Sports","filename":"data/vaneerConsumption/TimTebowGetsSpeakingNodatGOPConventionNoTomBradyBobbyKnightDonKing.json","image_url":"https://media.breitbart.com/media/2015/04/Tim-Tebow-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2016_07_14__1540929235.html","title":"Tim Tebow Gets Speaking Nod at GOP Convention; No Tom Brady, Bobby Knight, Don King","title_page":"Tim Tebow Gets Speaking Nod at GOP Convention; No Tom Brady, Bobby Knight, Don King | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Devout Christian and former Heisman Trophy-winner Tim Tebow spearheads a list of sports celebrities to speak at next week’s Republican National Convention in Cleveland.\nThe New York Times reports that former Chicago Bears head coach Mike Ditka and Indiana’s legendary basketball coach Bobby Knight, both touted as possible speakers, will not be speaking at the GOP’s coronation of billionaire Donald Trump as the party’s presidential nominee for 2016.\nAlso, absent from the list of sports figures is Tom Brady, a known friend of Trump, previously mentioned as a possible speaker at what Trump dubbed a convention of “winners.” CBS Sports points out that promoter Don King, a Cleveland resident and enthusiastic Trump supporter, does not appear on the list as well.\nDana White, president of the Ultimate Fighting Championship, and LPGA’s Natalie Gulbis, known more for her great legs than her tournament victories, lend their oratory acumen to the event.\nGulbis, who has only one career victory on the LPGA tour, met “The Donald” when she was 21-years-old at the Tour Championship, held that year at Trump International in West Palm Beach, Florida. She told Golf Digest, she’s played several rounds with the GOP presumptive nominee: ”He’s a good player (and a sneaky-great putter). He has always made time for my calls and has offered some great advice over the years. If I could only tell you one thing about him, it’s that he’s probably the hardest-working individual I’ve ever met.”\nThe sports celebrities make up a fraction of the 62 speakers the RNC lined up for the convention. The GOP hopes to generate enough momentum at the convention to defeat Hillary Clinton in November and bring the presidency back to the Republicans after eight years of Democratic stewardship under president Barack Obama.","url":"https://www.breitbart.com/sports/2016/07/14/tim-tebow-gets-speaking-nod-gop-convention-no-tom-brady-bobby-knight/"}
