{"authors":["Jj Nattrass For Mailonline"],"date_download":"2018-10-22 21:49:31","date_modify":"2018-10-22 21:49:31","date_publish":"2016-01-28 09:00:57","description":"Looking every inch the doting mother, the 32-year-old arrived at the city's Palace Theatre with a huge smile on her face as she strolled in hand-in-hand with her seven-year-old daughter, on Wednesday.","filename":"data/vaneerConsumption/TinaOBrientreatsdaughterScarletttonightattheMaryPoppinsmusical.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/09/30A7ABE200000578-0-image-a-36_1453971634046.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420516_Tina-O-Brien-shows-understated-style-treats-daughter-Scarlett-night-Mary-Poppins-musical-Manchester_1540244971.html","title":"Tina O'Brien treats daughter Scarlett to night at the Mary Poppins musical","title_page":"Tina O'Brien treats daughter Scarlett to night at the Mary Poppins musical | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The musical famously features a line which reads, a spoonful of sugar makes the medicine go down.\nBut Tina O'Brien wasn't in need of any Nanny tips when she treated her daughter Scarlett to a trip to the Palace Theatre in Manchester, on Wednesday evening, to see Mary Poppins.\nLooking every inch the doting mother, the 32-year-old arrived at the venue with a huge smile on her face as she strolled in hand-in-hand with her seven-year-old daughter and a friend.\nScroll down for video\nUnderstated style: Tina O'Brien wasn't in need of any Nanny tips when she treated her daughter Scarlett to a trip to the Palace Theatre in Manchester, on Wednesday evening, to see Mary Poppins\nObviously filled with excitement at the prospect of singing along to all of the Walt Disney musical's classic songs, Tina's daughter and her friend could barely contain themselves - while the Corrie actress simply smiled in delight.\nOpting to showcase her repuatation as a chic,young mum, the cobbles stalwart chose an understated yet stylish ensemble for her evening out with the girls.\nEmbracing a classic look, Tina slipped her petite frame into a thigh-skimming, smock-style minim while she braced herself against the cool weather by pairing it with a long cardigan.\nDoting mother: Looking every inch the doting mother, the 32-year-old arrived at the venue with a huge smile on her face as she strolled in hand-in-hand with her seven-year-old daughter and a friend\nClassic style staple: Embracing a classic look, Tina slipped her petite frame into a thigh-skimming, smock-style minim while she braced herself against the cool weather by pairing it with a long cardigan\nAdding a chic flair to her wardrobe, the actress - who plays Corrie troublemaker Sarah Platt - threw on a camel overcoat.\nRounding off her look, Tina donned a pair of platform-heeled boots, which added some height to her frame.\nKeeping to her simply chic theme, the Manchester native kept accessories to a minimum - only adding a black leather bag to her look.\nWinter warmer: Adding a chic flair to her wardrobe, the actress - who plays Corrie troublemaker Sarah Platt - threw on a camel overcoat\nA well-heeled display: Rounding off her look, Tina donned a pair of platform-heeled boots, which added some height to her frame\nHaving a blast: Wearing a huge smile, Tina couldn't help but dote on her young daughter, Scarlett (right) - whom she shares with Corrie co-star, Ryan Thomas.=\nStyling her blonde locks into a sweeping fringe, the actress let her long blonde locks fall down around her shoulders, framing her pretty features.\nOpting for a minimal palette of make-up, she allowed her pretty features to shine through - adding only a hint of eyeliner and a flash of berry lipstick to accentuate her features.\nWearing a huge smile, Tina couldn't help but dote on her young daughter, Scarlett - whom she shares with Corrie co-star, Ryan Thomas.\nAnd the little girl appears to have inherited her mother's flare for fashion, as she chose a cute glittering dress featuring a geometric print for her evening at the theatre.\nBut Tina wasn't the only familiar face from the streets of Weatherfield attending the musical, as her co-stars Jennie McAlpine, Trisha Merry and Faye Brooks.\nOther stars at the event including: John Thomson, Roxanne Pallett and Emmerdale's star Natalie Anderson.\nAnother familiar: Other faces from Weatherfield's famous street were also out in force at the event, inclduig cobbles fave Jennie McAlpine\nStunning; Street newcomer Faye Brookes cut an immaculate figure in her chic spin on casual evening wear\nA night away from the street: Trisha Merry added some colour to her outfit by matching a pink skirt with a navy and black overcoat\nKeeping on his feet: Cold Feet's John Thomson was also in attendance for the musical\nMaking an entrance: Roxanne Pallette wore an eye-grabbing pink silk skirt to the event","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420516/Tina-O-Brien-shows-understated-style-treats-daughter-Scarlett-night-Mary-Poppins-musical-Manchester.html"}
