{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 23:24:23","date_modify":"2018-10-30 23:24:23","date_publish":"2014-08-13 19:07:47","description":"Oh, Tinder. The word alone elicits a hearty sigh because the dating app has completely revamped the way people not only look at dating, but at online dating. Remember when you had to be sitting at your enormous desktop computer as you crafted your…","filename":"data/vaneerConsumption/TinderInspiredSwipeSongMakestheDatingAppLookWayClassierThanitReallyIsVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/79409928-cbed-41aa-926d-949a72bc8893.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35653-tinder-inspired-swipe-song-makes-the-dating-app-look-way-classier-than-it-really-is_1540941863.html","title":"Tinder Inspired \"Swipe\" Song Makes the Dating App Look Way Classier Than it Really Is - VIDEO","title_page":"Tinder Inspired \"Swipe\" Song Makes the Dating App Look Way Classier Than it Really Is — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Oh, Tinder. The word alone elicits a hearty sigh because the dating app has completely revamped the way people not only look at dating, but at online dating. Remember when you had to be sitting at your enormous desktop computer as you crafted your longwinded profile? No, you probably don't, which is proof that dating motivated by tech is the new way to be. In fact, it's so entrenched in our romantic (or not romantic) pulses, that of course we now have a pop song called \"Swipe,\" by Miracles of Modern Science, featuring Kristen Slipp, which is about — you guessed it — Tinder.\nYou might think, \"oh, crap. Another song or video that just parodies EVERY DAY OF MY GODDAMNED LIFE,\" but rest assured, this song has a heart to it. It's not just humorous with its clever, on-point lyrics, but it's catchy and sweet, and is one of the first songs that captures the emotional crux of dating using tech— which is what we actually do in this generation. We make parodies and jokes about what it means to date in this day and age, but rarely do artists actually dig into the fact that we are people with feelings, too; not just jokesters who roll our eyes at our current romantic situations.\nMight this lead to a trend? Potentially. But think about it: there are so many songs that mention seeing someone at the bar or \"your face in a crowded place\" (yes, I did just allude to James Blunt circa 2006), but that's very rarely how people actually meet these days. Songs about Tinder can be just as heartfelt, romantic, and catchy as songs about summertime flings you met on the beach.\nAnd I must add: this song is really, really catchy and fun.\nCheck it out below.\nMiracles of Modern Science on YouTube\nImage: Miracles of Modern Science/Youtube","url":"https://www.bustle.com/articles/35653-tinder-inspired-swipe-song-makes-the-dating-app-look-way-classier-than-it-really-is"}
