{"authors":["Michelle Andrews"],"date_download":"2018-10-23 00:58:04","date_modify":"2018-10-23 00:58:04","date_publish":"2016-07-19 00:00:00","description":"Hospital systems are building tiny full-service hospitals in urban and suburban markets. They have a full array of emergency services, but only a handful of beds for admitted patients.","filename":"data/vaneerConsumption/TinyHospitalsMayImproveAccessToHealthCareShots.json","image_url":"https://media.npr.org/assets/img/2016/07/18/scl-health-2_wide-4d7e0247c6f16a54e0876e04d74ff3bb7ccf6547.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2016_07_19_486500835_microhospitals-may-help-deliver-care-in-underserved-areas_1540256284.html","title":"Tiny Hospitals May Improve Access To Health Care : Shots","title_page":"Tiny Hospitals May Improve Access To Health Care : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Microhospitals May Help Deliver Care In Underserved Areas\nEnlarge this image toggle caption Courtesy of Emerus and SCL Health Courtesy of Emerus and SCL Health\nEyeing fast-growing urban and suburban markets where demand for health care services is outstripping supply, some health care systems are opening tiny, full-service hospitals with comprehensive emergency services but often fewer than a dozen inpatient beds.\nThese \"microhospitals\" provide residents quicker access to emergency care, and they may also offer outpatient surgery, primary care and other services. They are generally affiliated with larger health care systems, which can use the smaller facility to expand in an area without incurring the cost of a full-scale hospital. So far, they are being developed primarily in a few states — Texas, Colorado, Nevada and Arizona.\n\"The big opportunity for these is for health systems that want to establish a strong foothold in a really attractive market,\" says Fred Bentley, a vice president at the Center for Payment & Delivery Innovation at Avalere Health, a consulting firm. \"If you're an affluent consumer and you need services, they can fill a need.\"\nEnlarge this image toggle caption Courtesy of Emerus and SCL Health Courtesy of Emerus and SCL Health\nSCL Health, a hospital system with headquarters in Broomfield, Colo., has opened two microhospitals in the Denver metropolitan area and has another two in the works.\nMicrohospitals \"are helping us deliver hospital services closer to home, and in a way that is more appropriately sized for the population compared to larger, more complex facilities,\" says spokesman Brian Newsome.\nThe concept is appealing, and some people suggest they should be developed in rural or medically underserved areas where the need for services is great.\nSmall hospitals, even tiny ones, with robust outpatient services could be a real boon for people who live far from major metro areas.\n\"Right now they seem to be popping up in large urban and suburban metro areas,\" says Priya Bathija, senior associate director for policy development at the American Hospital Association. However, \"We really think they have the potential to help in vulnerable communities that have a lack of access.\"\nAnalysts liken microhospitals to standalone emergency departments, which have been cropping up in recent years in fast-growing metropolitan areas where people are often well-insured and waits at regular hospital emergency departments may be long. Both can handle many emergencies and are equipped with lab, imaging and some diagnostic capabilities.\nHowever, patients facing serious emergencies, such as severe chest pain or major medical trauma, should call 911 and let trained medical personnel decide where best to seek treatment, says Bret Nicks, an associate professor of emergency medicine at Wake Forest Baptist Health.\nUnlike standalone EDs, microhospitals are fully licensed hospitals with inpatient beds to accommodate people admitted from the emergency room. They may have other capabilities as well, including surgical suites, a labor and delivery room, and primary care or specialist services on site or nearby.\nDignity Health, a health care system with facilities in Nevada, Arizona and California, opened its first microhospital in the Phoenix area more than a year ago and will open another one there this year, says Peggy Sanborn, vice president of strategic growth, mergers and acquisitions. It also plans to open four microhospitals in the Las Vegas area and is exploring the model for California.\nOne of the advantages of a microhospital is that it can help connect patients with specialty and primary care physician networks, says Sanborn. In Las Vegas, for example, the microhospital design includes a second floor with separate specialty and primary care physician offices to which patients could be referred.\nThe growing interest in microhospitals can be linked to the shift toward providing more care in outpatient settings, says Bathija. In addition to the emergency department, the facilities can include medical home services and other outpatient services.\nBetween 2010 and 2014, the annual number of inpatient hospital admissions declined by more than 2 million to 33.1 million, according to figures from the American Hospital Association. Meanwhile, the total number of outpatient hospital visits increased to 693.1 million in 2014 from 651.4 million four years earlier.\nMicrohospitals offer an opportunity to \"really ramp up outpatient services,\" Bathija says.\nKaiser Health News is an editorially independent news service that is part of the nonpartisan Henry J. Kaiser Family Foundation. Michelle Andrews is on Twitter: @mandrews110.","url":"https://www.npr.org/sections/health-shots/2016/07/19/486500835/microhospitals-may-help-deliver-care-in-underserved-areas"}
