{"authors":[],"date_download":"2018-10-30 17:51:25","date_modify":"2018-10-30 17:51:25","date_publish":"2016-06-21 22:09:00","description":"Never chewing gum and paying attention to direction are a few tips for nailing your Atlanta casting call.","filename":"data/vaneerConsumption/TipstonailyourcastingauditioninAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/06/20/Images/photos.medleyphoto.10227643.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_employment_ways-nail-your-casting-audition-atlanta__1540921885.html","title":"Tips to nail your casting audition in Atlanta","title_page":"Tips to nail your casting audition in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"When it comes to movies, television shows and commercials, Atlanta has become the quintessential place for actors in the film industry who want to find work. If you're not receiving as many callbacks as you would like, there's a good chance that you're doing something wrong and may need to brush up on your auditioning skills. Below are some tips two local casting directors say could help you nail your next casting audition.\nDo your homework before the audition\nCheryl Louden-Kubin, owner of The Atlanta Casting Director, says you need to know what you are going in to audition for before you ever even walk in the door. Do some homework ahead of time. Find out: What is the product? Who is the director? What series are you auditioning for? Check to see if there is dialogue involved ahead of time, so you're not caught off-guard if there are lines you will need to recite.\nBrian Beegle, casting director for Stilwell Casting, adds that doing the work beforehand allows you to relax a little and enjoy yourself during the audition. He says that \"if you are in the room with the director, you have already been picked over hundreds of other actors.\" Too many actors see casting directors as an obstacle, but in reality the casting director is their avenue to success.\n>>RELATED: Follow these 5 tips to prep for your casting call\nMake sure you are available for the shoot\nIn some cases, the audition may have gone well, but then the actor realizes they are not available to work during the days the production is scheduled to shoot. If you suddenly remeber that you have something else scheduled and you are not able to work on the days you are needed, you have just wasted everyone's time. Both directors say that as part of your homework, not only you should find out what the part is so that you are prepared, but you should also make a point to learn when the filming is scheduled to take place.\nPay attention to direction\nAlthough many auditions for film and television are self-taped these days, auditions for commercials are still mostly in person. Loudin-Kubin suggests that since it's difficult to act with little or no direction, when you are actually given some by the director – pay attention.\nKeep refining your craft\nAccording to Beegle, actors always seem to think the audition is where they do their work, and then they get to play on the set. Instead, he says if you're not working, you should find ways to improve your craft by taking an acting class. If the class looks fun and easy, it's not the class for you. You want one that will actually intimidate you, because attacking your weaknesses is what makes you become a stronger actor. If you consider yourself a \"starving\" actor, you can often still find classes in the local area you can audit for free.\nStop making excuses\nLoudin-Koubin says the worst thing she sees actors do is apologize as soon as they complete their audition. She often hears, \"that was so bad,\" and sees the actor make excuses when the director may have actually loved their read. Just that one little thing can change the mind of the director and make them choose someone else. Make choices, trust them and stay open if you want to succeed.\nMake every audition count\nA lazy or unprepared actor simply wastes everyone's time. Plus, they take a spot away from someone who would have loved to have had the opportunity. Beegle emphasizes that you need to treat every audition, even self-tapes and smaller auditions, as if they are all the same. Never hold back or get comfortable. And if you really want to win some points with the director, he says, never ever chew gum.","url":"https://www.ajc.com/business/employment/ways-nail-your-casting-audition-atlanta/vnZfOhfICUyagvnwSwjVlO/"}
