{"authors":["Associated Press"],"date_download":"2018-10-22 23:30:21","date_modify":"2018-10-22 23:30:21","date_publish":"2017-04-26 07:50:22","description":"MADISON, Wis. (AP) - Fairly or not, T.J. Watt will draw comparisons to his big brother when he gets to the pros.Oh sure, he can speed past an offensive...","filename":"data/vaneerConsumption/TJWattreadytowriteowntaleinNFLwithbigbrother.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/08/wire-463757-1493190025-820_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446524_T-J-Watt-ready-write-tale-NFL-big-brother_1540251021.html","title":"T.J. Watt ready to write own tale in NFL with big brother","title_page":"T.J. Watt ready to write own tale in NFL with big brother | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MADISON, Wis. (AP) - Fairly or not, T.J. Watt will draw comparisons to his big brother when he gets to the pros.\nOh sure, he can speed past an offensive tackle and split double teams just like another former Wisconsin star with the same last name and similar skillset as a pass rusher.\nBut J.J. Watt of the Houston Texans is an NFL star with the ability to change the game anytime he's on the field.\nFILE - In this Dec. 3, 2016, file photo, Wisconsin's T.J. Watt celebrates after recovering a fumble during the Big Ten championship NCAA college football game against Penn State in Indianapolis. Watt has a chance to get selected in the first round of the NFL draft on Thursday, just like his brother J.J. in 2011. (AP Photo/Michael Conroy, File)\nIs it fair to just assume T.J. Watt will simply follow in his older brother's footsteps ?\n\"T.J. has got to write his own story,\" Wisconsin coach Paul Chryst said when asked how family ties might influence NFL executives. \"What it does is when you're not sure, it (favors Watt) because of the way T.J. goes about it.\"\nChryst was the offensive coordinator at Wisconsin while the older Watt was there. He just finished his second season as head coach, having watched T.J. Watt overcome injuries and a move from tight end to turn into one of the top pass-rushing prospects in this year's rookie class.\nWatt has a chance to get selected in the first round of the NFL draft on Thursday, just as his brother did in 2011.\n\"I don't know why it wouldn't or shouldn't influence others,\" Chryst said about the Watt connections . \"But again, I think you've got make sure you're (looking at) two different people.\"\nT.J. Watt embraces any talk of potential similarities.\n\"Yeah, he's one of the best players to ever do it, why not take that comparison?\" he said at the NFL combine. \"The No. 1 thing I love about my brother's play is how he does it. He's 100 percent all out every single play. ... He's a game-changer. That's how I want to be viewed.\"\nHe has certainly stood out to NFL executives after getting 63 tackles, including 15½ for losses, and 11½ sacks in 2016, his only season as a starter. Watt might be a good fit with the 29th overall pick for the Green Bay Packers, who could use a young player in their pass rush.\nWhat makes Watt an even more intriguing pick for Green Bay is that the Packers have a pass-rushing role model with pedigree already on the roster in Clay Matthews.\nPro football is the Matthews family business. Matthews' father, Clay Jr., played 19 seasons in the NFL with the Browns and Falcons. His grandfather played four seasons as a defensive end with the 49ers.\nNot that family ties are a deciding factor for general manager Ted Thompson, who drafted Matthews in 2009.\n\"I think that happens from time to time during the process ... it might make you feel better,\" Thompson said last week.\n\"But at the end of the day, we try to see, is Clay Matthews a good football player and can he help our team, and is he the kind of person we'd like to add to our team? I think those are the questions we wind up asking.\"\nHard work on and off the field appears to be a family trait shared by J.J., T.J. and a third Watt brother, Chargers fullback Derek Watt. He is entering his second season in the NFL.\nJ.J. and T.J. ended up playing similar positions. But T.J. only started playing defense after moving from tight end after getting hurt early in spring practice two seasons ago. It was then that Chryst, in his first spring as head coach, approached Watt about moving across the line of scrimmage.\nThat season, Wisconsin had one of the Big Ten's best outside linebacker combinations in Vince Biegel and Joe Schobert, who is now with the Cleveland Browns.\nWatt picked things up so quickly that the defense was able to use him as a reserve outside linebacker as well as an interior rusher in a nickel package, giving the Badgers another athletic pass rusher.\nIt's a skill that an NFL team can't overlook, regardless of that famous last name.\n\"I think (T.J. Watt) just wants his shot, and I know some of the mock draft boards have him potentially coming here which would be great if he's even half the player that his brother is, but I'm sure there's pressure on him,\" Clay Matthews said. \"But I'm sure if he's anything like his brother, he'll have a drive and work ethic that can't be matched.\"\n___\nFor more NFL coverage: www.pro32.ap.org and www.twitter.com/AP_NFL","url":"https://www.dailymail.co.uk/wires/ap/article-4446524/T-J-Watt-ready-write-tale-NFL-big-brother.html"}
