{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 20:17:01","date_modify":"2018-10-30 20:17:01","date_publish":"2016-02-23 02:13:27","description":"The Tennessee State Senate passed a resolution requiring a state lawsuit against the federal program that is dumping refugees into the Volunteer State.","filename":"data/vaneerConsumption/TNStateSenatePassesResolutiontoSueFedsoverRefugeesADeclarationofOurRightsasaSovereignState.json","image_url":"https://media.breitbart.com/media/2015/12/GettyImages-477444344.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_22__1540930621.html","title":"TN State Senate Passes Resolution to Sue Feds over Refugees: 'A Declaration of Our Rights as a Sovereign State'","title_page":"TN State Senate Passes Resolution to Sue Feds over Refugees: 'A Declaration of Our Rights as a Sovereign State' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Tennessee State Senate overwhelmingly passed a resolution by a 27 to 5 margin requiring a state lawsuit against the federal government program that is dumping refugees into the Volunteer State.\nSenate Joint Resolution 467 now goes to the Tennessee House of Representatives, where sources tell Breitbart News it is expected to pass some time in the next three weeks\nPassage of the resolution by the State Senate means that it is certain a lawsuit will be filed against the federal government’s Refugee Resettlement Program on Tenth Amendment grounds, something that no other state has yet done.\nBoth Texas and Alabama have filed federal lawsuits claiming that the federal government has failed to comply with the “consultation clause” of the Refugee Act of 1980. That argument, however, is considered to be on very thin legal grounds because the standard required to establish “consultation” is very low.\nThe State Senate is expected to wait on filing the lawsuit until it is joined by the House of Representatives, so the entire Tennessee General Assembly will be the plaintiff.\n“This Resolution strikes a blow for liberty,” Majority Leader Sen. Mark Norris (R-Collierville), the co-sponsor of the bill who carefully guided it through the upper chamber tells Breitbart News in an exclusive statement.\nNorris calls the resolution, “a declaration of our rights as a sovereign state which upholds the principles by which we foster freedom.”\n“To do anything less would demonstrate deliberate indifference to our constitutional duty to defend the peace, safety and happiness of all Tennesseans,” Norris adds.\nThe resolution asks Tennessee Attorney General Herbert Slatery “to initiate or intervene in one or more civil actions on behalf of the State of Tennessee or, in the alternative, seek appropriate relief in a federal court of competent jurisdiction” in the matter. While he has not ruled that possibility out, neither Slatery nor Republican Governor Bill Haslam have given any indication they intend to step up and join the Tennessee General Assembly as plaintiffs.\nNorris reiterated on the floor of the Senate, and it was reiterated by Sen. Doug Overbey (R-Maryville) that the resolution merely urges the Attorney General to challenge the federal government but does not direct him. “It is precatory, not mandatory,” Norris said on the floor. (Precatory is a request.)\nTwenty-five state senators co-sponsored the resolution, including Sen. Mae Beavers (R-Lebanon), Sen. Kerry Roberts (R-Springfield), and Sen. Bill Ketron (R-Murfreesboro).\nTennessee, which formally withdrew from the U.S. Refugee Resettlement program in 2008, is one of 12 “Wilson-Fish alternative program” states in which the federal government has subsequently selected a voluntary agency (VOLAG) to operate the program.\nThat’s the basis for Tenth amendment claim. Even though it is no longer participating in the program, the state of Tennessee is required to pay for a number of social services delivered to the refugees that are settled in the state by the VOLAG, in this case, Catholic Charities.\nDespite the overwhelming passage of the bill, some refugee activists gathered to oppose it. “About 100 people gathered outside the Senate chamber before and after the floor vote to express their opposition to the measure,” The Tennessean reported.\nMajority Leader Norris addressed those refugee activists from the Senate floor immediately prior to the vote:\nThere are people who are here who are holding signs. They are advocating for refugees. I’m here arguing the rights of citizens and the state’s sovereignty to keep people safe and secure. The two are not incompatible. This is not unwelcoming. Who would want to come to Tennessee if we didn’t defend these rights? Especially people who never had rights like this in the countries from which they fled.\nSen. Brian Kelsey (R-Germantown) noted that, in Tennessee, “We are the Volunteer State, but we are not the volunteered state.”\n“I think Tennessee’s Tenth amendment argument can be a national model for other states,” Sen. Mae Beavers says in an exclusive interview with Breitbart News.\n“Our job as State senators is to protect and safeguard the taxpayers. These people, the refugees who are being settled in our state, we learned in committee this summer have not been vetted. The federal government has refused to consult with our state, and I was proud to vote for the resolution,” Beavers adds.\nThe key passage of the resolution reads as follows:\nBE IT RESOLVED BY THE SENATE OF THE ONE HUNDRED NINTH GENERAL ASSEMBLY OF THE STATE OF TENNESSEE, THE HOUSE OF REPRESENTATIVES CONCURRING, that the Tennessee General Assembly directs the Attorney General and Reporter of the State of Tennessee to initiate or intervene in one or more civil actions on behalf of the State of Tennessee or, in the alternative, seek appropriate relief in a federal court of competent jurisdiction regarding the failure of the federal government to comply with the Refugee Act of 1980, as amended, and any actions taken by the federal government, including the President of the United States, the head of any department or agency, or any other employee of the executive branch of the federal government, in violation of federal law or as\nprohibited by the Tenth Amendment to the United States Constitution, or any other statutory or constitutional provisions of the United States or the state of Tennessee, with respect to the\noperation or implementation in this state of any provision of the federal government’s Refugee Resettlement Program, including any revision or amendment by regulation or otherwise pertaining to the program.\nOther states who are seeking a way to stop the unhindered flow of refugees will see in the Tennessee State senate’s action a legal path to successfully resist the continued operation of the U.S. Refugee Resettlement program in their states.\nThe other 11 “Wilson-Fish alternative program” states can join the Tennessee lawsuit, or they can file their own Tenth amendment challenges to the U.S. Refugee Resettlement program.\nThe remaining states that are currently participating in the program can withdraw from it, thereby becoming “Wilson-Fish alternative program” states, and also file Tenth amendment challenges to the U.S. Refugee Resettlement program.","url":"https://www.breitbart.com/politics/2016/02/22/tennessee-state-senate-passes-resolution-to-sue-feds-over-refugee-resettlement-a-declaration-of-our-rights-as-a-sovereign-state/"}
