{"authors":["James Delingpole"],"date_download":"2018-10-30 20:06:14","date_modify":"2018-10-30 20:06:14","date_publish":"2015-05-05 15:32:34","description":"Yesterday I gave you my thoughts on the Conservatives. Today it's UKIP's turn. The reasons for not wanting to vote UKIP seem to me fairly obvious. Either |","filename":"data/vaneerConsumption/ToAnnoyLouiseMenschAndFiveMoreReasonsForVotingUKIP.json","image_url":"https://media.breitbart.com/media/2015/02/Ukip-supporter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_05_05__1540929974.html","title":"To Annoy Louise Mensch. And Five More Reasons For Voting UKIP","title_page":"To Annoy Louise Mensch. And Five More Reasons For Voting UKIP | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Yesterday I gave you my thoughts on the Conservatives. Today it’s UKIP’s turn.\nThe reasons for not wanting to vote UKIP seem to me fairly obvious. Either you’re a stupid lefty or you’re in a Tory/Labour marginal and you only want the phrase “new Prime Minister Ed Miliband” to exist in your nightmares.\nBut the reasons for voting UKIP, in most cases, seem to me to be stronger.\n1. Louise Mensch. I once Tweeted “There is no more loathsome Tory than the kind which sees UKIP as a bigger problem than Labour, the Greens, the SNP and the Lib Dems.” It was her I meant.\n2. Nigel Farage. The very worst of all possible outcomes of this election is if Farage doesn’t win South Thanet. He has fought in the teeth of the most scabrous and unjustified Establishment hate campaign I think I’ve ever witnessed and thoroughly deserves to be in Westminster so that he can hold that Establishment to account.\n3. The Manifesto. Never mind the debate over Libertarian UKIP versus Red UKIP. The manifesto’s pretty sound. (Independently costed too). You look at their policies and you think: “God, wouldn’t it just be amazing if a party like this ever got into power.” Well stop fantasising and put your money where your mouth is. Obviously you won’t get a UKIP majority this time (though to read by the rabid tone of some of the comments below my piece yesterday, some of you are sufficiently delusional to imagine otherwise) but “from tiny acorns…. etc”. In any case, see 4.\n4. For UKIP this election isn’t necessarily about winning, but gaining sufficient share of the vote – second places are very important – to qualify for the enhanced funding which will put them in good stead to fight 2020 really hard.\n5. If you don’t vote UKIP, you’re David Cameron’s bitch. No really, you are – and this goes way back, possibly even to before the last general election when Cameron and his advisers made a cynical calculation: it doesn’t matter if we drift left because our heartland has nowhere else to go, so as well as natural Tories we can hoover up the squishy centrists, disaffected Blairites, etc. Yeah, that worked, Dave. That’s why you won such a stonking majority you didn’t have to go into Coalition with your ideological polar opposites. No, wait…\n6. Not just for disaffected Tories, yadda yadda. I put that one in because I know some of you get affronted by the idea that UKIP are the true heirs to Thatcher and you’d never consider yourself natural Conservatives and the reason that you were attracted to UKIP is that they’re completely different and resemble nothing that has ever existed in the entire history of politics. To which I say: “Yeah. Wotevs.” Now off you go and unseat whichever northern Labour candidate in your constituency deserves unseating.","url":"https://www.breitbart.com/europe/2015/05/05/to-annoy-louise-mensch-and-five-more-reasons-for-voting-ukip/"}
