{"authors":["Ben Christopher","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:53:08","date_modify":"2018-10-30 22:53:08","date_publish":"2017-03-01 08:00:49","description":"Rizi Manzon is a teacher, so naturally, he has a lot to worry about: a stack of homework assignments to grade, a week’s worth of culinary arts classes to","filename":"data/vaneerConsumption/Toattractteacherspriceyschooldistrictsarebecomingtheirlandlords.json","image_url":"https://calmatters.org/wp-content/uploads/TEACHER_HOUSING.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939988.html","title":"To attract teachers, pricey school districts are becoming their landlords","title_page":"To attract teachers, pricey school districts are becoming their landlords | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Rizi Manzon is a teacher, so naturally, he has a lot to worry about: a stack of homework assignments to grade, a week’s worth of culinary arts classes to prepare for, kitchen supplies to purchase on his own time and dime. And the assorted crises, dramas, and anxieties of the 36 teenagers in his care at Wilcox High School in Santa Clara.\nBut unlike most public school educators in California’s Silicon Valley, one thing Manzon doesn’t need to worry about is how he’s going to pay rent this month.\nInstead, as one of Santa Clara Unified School District’s 822 teachers and specialists, he is one of the lucky few who get to call “Casa del Maestro” home. A picturesque plot of 70 suburban townhouses, bracketed by cherry blossoms and palm trees, this is the district’s answer to the Bay Area’s affordable housing crisis. To lure qualified teachers, the district provides below-market housing located on district property to new employees for up to seven years—if they can score a spot.\nFor teachers like Manzon, who gave up a career as a chef in Orange County to take the job at Wilcox, the move probably wouldn’t have penciled out without the district’s generous subsidized digs.\n“It would have been a hard sell for sure,” he says. “I would have had to come to terms with living in Gilroy.”\nNo offense to Gilroy. But along with the stresses of the job, not to mention Manzon’s personal challenges—he’s a veteran who “did some time in the sandbox” in Iraq and lives with his emotional support animal, Koa—a twice-daily hour-long commute, along with the familiar angst of finding housing in the Bay Area on a teacher’s salary, are extra stressors he’s happy to do without.\nCasa del Maestro, a radical experiment in teacher recruitment and retainment, is due to celebrate its 15th anniversary this year. But as school districts in the state’s pricey coastal enclaves struggle to attract and keep qualified teachers, many are considering Santa Clara’s “if you build it, they will come” model to teacher retainment.\nAnd now they have the support of Sacramento.\nLast fall, the governor signed the “Teacher Housing Act of 2016” to make it easier for school districts to get into the landlording business. Authored by Mark Leno, the former Democratic state senator from San Francisco, the law gives districts explicit permission to set aside housing exclusively for its employees and, crucially, to take advantage of state and federal low-income housing tax credits to develop these projects. Under prior law, projects that make use of these low-income housing subsidies had to be open to all tenants who met the income guidelines, to prevent public funds from subsidizing housing discrimination. The new law makes an exception for teachers and district employees.\nFor the state, extending those tax credits to school employees is a zero-sum game—it designates a fixed amount for the program. What it does mean, however, is less money for other low-income people who would otherwise take advantage such subsidies.\nNot everyone, of course, agrees that teachers should be the focal point of affordable housing policy. In areas where the supply of housing is constrained, providing special access to teachers necessarily comes at the expense of others who are just as inconvenienced by high rents and long commutes, if not more so.\n“I’m a teacher, so I love teachers. But this pick and choose mentality about professions that we value and professions that we don’t seems kind of crazy,” says Paavo Monkkonen, a professor of urban planning at UCLA. “We don’t want to allow all our service workers to live near us—just the ones we deem more ‘acceptable’ and more ‘meritorious.’”\nBut for many lawmakers, it’s an appealing way to kill two birds with one stone: tackle affordable housing while simultaneously addressing the teacher shortage plaguing California districts.\n“There’s a lot of interest in doing this now given the conflux of rapidly increasing housing prices coupled with a growing teacher shortage in so many districts” says Jeff Vincent, the deputy director and cofounder of the Center for Cities & Schools at UC Berkeley. “And those things are clearly related.”\nA recent survey by the Learning Policy Institute and the California School Boards Association found three-quarters of public schools across the state reported being unable to fill all of their teachers positions with qualified, credentialed faculty.\nThat comes at a cost for students—particularly those who attend schools serving mostly low-income households, where turnover is highest. But the cost is also financial. According to a report by the National Commission on Teaching and America’s Future, Los Angeles Unified School District pays an additional $94 million per year in recruitment, hiring, and training costs just to keep up with staff attrition. In San Francisco and Oakland, the annual price tag is over $11 million and $12 million, respectively.\nThe academic literature is equivocal about the connection between the cost of housing and teacher turnover.\n“We know that teachers who are in schools with higher compensation are more likely to stay,” says Anne Podolsky, a policy analyst at the Learning Policy Institute. “So if you think about housing incentives as just one form of compensation, we might have reason to believe that that would be associated with teachers who are going to stay in their schools longer.”\nPodolsky points to a national survey which found that 1 in 4 former teachers said that they would consider returning to the profession if offered housing incentives.\n“We know that it’s successful because we continue to have waitlists,” says Jennifer Dericco, a spokesperson for Santa Clara’s district.\nNow, it may be San Francisco’s turn. With some of the highest housing prices in the country and teacher attrition rates that hover around 10 percent every year, San Francisco seems a likely candidate for a robust teacher housing program. In 2015, the city’s mayor, Ed Lee, announced plans to build 100 new apartments specifically for teachers on district property. The new law allows the mayor and school district to take one step closer to that goal.\nOther districts may follow suit.\nHow much of a teacher’s salary goes for rent?\n“Anywhere in the Bay Area you’re going to have challenges for housing and you hear of teachers driving long distances to get to work everyday,” says Debra Carlton, senior vice president of public affairs for the California Apartment Association, a rental housing trade group. “This bill is step number one; step number two is making sure that your local officials, your school districts, et cetera, see it as just as important as San Francisco does.”\nBut it’s also clear that low-income housing tax credits—the affordable housing subsidies that the Teaching Housing Act now allows districts and their co-developers to draw from—are finite. Last year, the State Treasurer’s Office received 163 qualifying applications for its competitive low-income housing tax credit, but only had the resources to fund 82 of them.\nAnd it’s not even clear that most teachers would qualify for subsidized units. According to Mark Stivers, who heads the California Tax Credit Allocation Committee at the Treasurer’s Office, the rents charged at complexes constructed or renovated with low-income tax credit support range from 30 percent to 60 percent of an area’s median income. That puts the upper income threshold in a city like San Francisco at $45,250 for one person. Certainly some teachers make less than this, but the district’s average salary is $67,537.\nGiven the complexities, costs and delays associated with constructing housing specifically for teachers, there’s an obvious question: “Why not pay them more?” says UCLA’s Monkkonen. “That would be the easier thing to do.”\nBut is also assumes that schools could negotiate such a targeted pay hike with their respective teacher unions. And whereas districts cover operational costs like salaries with funds from the state, which vary little from year to year, districts can be more creative in funding capital projects. For example, Santa Clara’s district paid for the Casa del Maestro project by issuing “certificates of participation”—financial instruments in which rent payments are divided up and paid directly to investors.\nBeyond these purely financial considerations, there are other reasons that school districts may prefer brick and mortar, says Lindsay Maple, a graduate student researcher at UC Berkeley’s Center for Cities & Schools and a former teacher in Oakland and East Palo Alto.\n“This is a very visible way to commit and to show that they’re dedicated to finding a solution,” she says. Simply providing a plan to build housing may in and of itself serve as a recruitment and retainment tool. Plus, it’s more likely to grab the attention and sympathy of voters.\nStill, she’s skeptical that housing is the most effective solution, on a dollar-for-dollar basis.\n“If you have a school district with 6,500 teachers and you’re going to build a building with 100 units—do the cost benefit analysis,” she says. “Does that really impact student outcomes on such a level where (a housing project) makes sense when you’re using that much money?”\nIn any case, for school districts, housing can be a risky business. When the Santa Clara district built Casa del Maestro, it funded the nearly $6.5 million construction project with borrowed money, with the interest payments on those bonds paid for entirely with rental payments from the teacher tenants. The financial transactions, along with the day-to-day operations of the housing complex, are managed by independent third parties. According to the district, this is all designed to protect district dollars. But it’s also a unique—and uniquely complex—arrangement that other districts may have a difficult time replicating.\nAnd school districts will ultimately confront what is already obvious to developers: Building new housing in urban California is really hard.\nThe Cupertino Union School District discovered as much when it announced plans to convert a former elementary school into teacher housing in 2015, only to drop the idea in the face of fierce opposition from local residents who opposed giving up school land for residential development, and questioned whether new housing would actually retain teachers.\nLikewise, the Oakland Unified School District announced its own teacher workforce housing initiative two years ago, only to see the plan stall for lack of a developer.\nAnd while the Los Angeles Unified School District has had more success in developing affordable housing projects than any other district in the state, of the three housing complexes on district land, none can count a district teacher as a tenant. Because the projects were financed in part with state and federal affordable housing tax credits, the units have gone to lower-earning district employees, such as cafeteria workers and teacher assistants.\nOn top of the complications that confound housing developments across the state, local ordinances and regulations may pose further obstacles.\nTake Berkeley, which is considering a workforce housing initiative. Whereas a project like Casa del Maestro is based on the notion that subsidized housing should be provided to new teachers for a limited time (seven years), after which the tenancy agreement ends, as Maple from the Center for Cities & Schools points out, this would certainly violate Berkeley’s “just cause” eviction regulations.\n“The development idea is sexy at the moment,” says UC Berkeley’s Vincent. “But districts need to be really careful in understanding their risks associated with these developments.”\nVincent applauds what Santa Clara has done: Rather than placing young, inexperienced teachers in “dorm-style housing” for short period of time, the Casa del Maestro seems designed to keep educators in the district for the long-term. But he wonders how many school districts possess the expertise to pull it off.\n“It’s extremely complicated—and they can get hosed pretty easily,” he says. “Most districts aren’t set up to be landlords.”\nBen Christopher is a contributing writer to CALmatters.","url":"https://calmatters.org/articles/to-attract-teachers-pricey-school-districts-are-becoming-their-landlords/"}
