{"authors":["Megan C. Hills"],"date_download":"2018-10-31 01:41:39","date_modify":"2018-10-31 01:41:39","date_publish":"2018-08-28 09:08:08","description":"Saying goodbye to Matt Smith in The Crown definitely wasn’t easy, but Tobias Menzies is definitely softening the blow. Given that his predecessor set the bar so high, it was never going to be an easy job filling those shoes. However, so far, so…","filename":"data/vaneerConsumption/TobiasMenziesPrincePhilipinTheCrownHasBeenRevealedForTheFirstTimeWow.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/0d20fb0d-c8c2-4f54-a99a-32681e07e181-getty-904622936.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_tobias-menzies-prince-philip-in-the-crown-has-been-revealed-for-the-first-time-wow-10259025_1540950099.html","title":"Tobias Menzies' Prince Philip in 'The Crown' Has Been Revealed For The First Time & Wow","title_page":"Tobias Menzies' Prince Philip in 'The Crown' Has Been Revealed For The First Time & Wow","title_rss":"NULL","source_domain":"bustle.com","text":"Saying goodbye to Matt Smith in The Crown definitely wasn’t easy, but Tobias Menzies is definitely softening the blow. Given that his predecessor set the bar so high, it was never going to be an easy job filling those shoes. However, so far, so good. You see, Netflix just dropped the first official picture of Tobias Menzies as Prince Philip in The Crown, and on top of that, shared a cheeky image with Bustle of the royal trussed up in his best finery. All I can say is wow. Donning a perfectly pressed suit, white bow tie, and no end of medals, harkening to his time in the navy, Menzies absolutely looks the part and the new series needs to be here like now.\nBut why is Menzies replacing Smith in the first place I hear you ask? Well, although the Doctor Who actor initially played Prince Philip in the first two seasons of The Crown, the Netflix series features a time skip, leaping forward from the '50s to the'70s, according to Radio Times.\nInstead of deciding to age up the original actors, The Crown’s show runners decided to entirely re-cast the leads. (It was a very fragile day when that announcement dropped.) That meant that Smith had to clear the path for Menzies to play Prince Philip, and fans also had to say goodbye to Claire Foy as the Queen, as well as Vanessa Kirby as Princess Margaret. I know, I struggled with all the moving around too at first, but after seeing Menzies as Prince Philip, I'm now excited AF for the new series.\nCheck out Menzies as the Duke of Edinburgh, here:\nThe Crown / Netflix\nIf Menzies looks awfully familiar, then you’re probably a fan of the Scottish fantasy series Outlander. In it, he plays both Jack and Frank Randall. But if that’s still not ringing any bells, then he’s also been in Casino Royale, Atonement, and Game of Thrones. In my opinion, he's one of those actors you definitely recognise but can't quite place, however, I bet that after his stint on The Crown, you'll never forget his name again.\nIn case you're wondering, no, there isn't any bad blood between Menzies and his predecessor. In fact, Smith revealed on The Late Late Show with James Corden that the pair knew each other long before The Crown ever came along, as they previously starred on stage together in The History Boys. Proving they're on good terms, Smith explained that he even gave Menzies some advice before he took-over the role of Prince Philip: \"I said a few things to him. I told him a good book to read by Philip Eade, called The Young Prince, which is very good. You know how it’s like, you can’t really offer up too much. But, I just said God, make sure they pay you enough and make sure it’s even.\"\nThe Late Late Show with James Corden on YouTube\nIf you’re wondering what Smith is referencing, it’s the fact that The Crown was the subject of a massive gender pay gap row. Despite playing — you know — the Queen, it was revealed that Claire Foy was paid less than her on-screen husband, according to The Independent. Although it was reported that she would see £200,000 in back pay in order to make up for the difference, she later said that she hadn’t seen a penny of it during an interview with Al Arabiya.\n\"That was what was reported that I was back-paid,\" she said. \"But I’ve never mentioned anything about it and neither have the producers. The fact that that is 'fact' is — not quite correct.\"\nMichael Tullberg/Getty Images Entertainment/Getty Images\nMenzies has signed on for the next two series of The Crown, according to Deadline, meaning that either the show is going to come to a grinding halt or we’re going to get another cast reshuffle come Season 5. (I don't think my heart can take another goodbye, TBH.)\nWhile fans were initially torn when the decision to re-cast the show was revealed, it brought a new powerhouse cast to the table with Helena Bonham Carter taking up Princess Margaret’s tiara, and Olivia Colman sliding comfortably into the Queen throne.\nNetflix / The Crown\nIn the lead up to the third series, which will hit screens next year, Netflix has been sneakily releasing stills of their updated versions of the royal family. Colman looked steely, elegant ,and quintessentially British in her still as the Queen (above), staring stoically over a cup of tea.\nMeanwhile, Carter as Princess Margaret (below) was the picture of disdain, peering down her nose at a vintage cigarette with cat eyeliner sharp enough to kill.\nNetflix / The Crown\nThe new casting has since freed up the old crew to go and pursue any other endeavours. It’s something they’ve taken to heart as Vanessa Kirby’s been off kicking butt in Mission Impossible: Fallout alongside Tom Cruise. Meanwhile, Matt Smith is set to play Charles Manson in an upcoming film about the Manson murders, and Claire Foy’s full on chameleoned into Lisbeth Salander in The Girl In The Spider's Web. You can watch the trailer here:\nhollywoodstreams on YouTube\nPersonally, I just hope that Foy has a more lucrative contract this time round and gets the pay parity she deserves — she may have only played a queen, but she’s a queen of my heart now.\nThe Crown is set to return to Netflix in 2019 for Season 3.","url":"https://www.bustle.com/p/tobias-menzies-prince-philip-in-the-crown-has-been-revealed-for-the-first-time-wow-10259025"}
