{"authors":["Lucy Mapstone For Mailonline"],"date_download":"2018-10-23 03:23:47","date_modify":"2018-10-23 03:23:47","date_publish":"2016-01-11 16:01:50","description":"The handsome 25-year-old looked dapper as he rocked up to the British label's event, the morning after his sister confirmed her engagement on the red carpet at the Golden Globes.","filename":"data/vaneerConsumption/TobyHuntingtonWhiteleylooksdapperatBurberrysLCMshow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300B7EFE00000578-0-image-a-295_1452527885957.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394085_Toby-Huntington-Whiteley-looks-dapper-steps-Burberry-LCM-newly-engaged-lookalike-sister-Rosie-wows-Golden-Globes_1540265027.html","title":"Toby Huntington-Whiteley looks dapper at Burberry's LCM show","title_page":"Toby Huntington-Whiteley looks dapper at Burberry's LCM show | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Toby Huntington-Whiteley is doing his best to carve a career for himself as a model.\nBut the Brit was slightly overshadowed as he made an appearance at the Burberry menswear show on Monday as part of London Collections Men in the British capital.\nThe handsome 25-year-old looked dapper as he rocked up to the British label's event, the morning after his famous sister Rosie confirmed her engagement on the red carpet at the Golden Globes.\nScroll down for video\nCarving out his career: Up-and-coming model Toby Huntington-Whiteley cut a handsome figure on Monday as he attended the Burberry show as part of London Collections Mens\nThe stunning 28-year-old and her long-term partner Jason Statham, 48, had knowingly flashed her huge diamond ring while walking the red carpet at the annual awards ceremony, and the news was later confirmed to MailOnline by a spokesperson for the star.\nHowever, staying in London rather than being with his sister in the wake of her joyous news, Toby continued to do the rounds at LCM.\nA real Rosie lookalike, the handsome gent cut a seriously stylish, dapper figure as he rocked up to the Monday morning show, teaming a neat double-breasted grey jacket with a carefully-folded blue scarf and slim-fitting trousers.\nSee the latest Golden Globes news with more on Rosie Huntington-Whiteley's enagagement\nMeanwhile...: Toby's sister Rosie was across the pond, confirming her engagement to Jason Statham by flashing her huge engagement ring on the red carpet at the Golden Globes on Sunday night\nWorking the room: 25-year-old Toby - who has a few campaigns under his belt - posed with YouTube star Jim Chapman at the British designer label's showcase\nHandsome line-up: Jim and Toby joined forces with Swedish model Robert Konjic for a snap inside the fashionable event\nDoppelgangers! Toby - who looks remarkably similar to his big sister - is a personal trainer by trade, but is trying to make it as a model, and has already appeared in a campaign for Jacamo\nWith similar features to his superstar sister - who splits her time between Los Angeles and London - he certainly appears to have what it takes to become a top male model in the near future.\nThe previous evening, at the same time his sister was making headline news in the US, 6ft 4in Toby attended the official LCM dinner.\nLooking suave as ever, he rocked a blue tweed waistcoat and matching jacket, with a white shirt and taupe trousers.\nLast year saw personal trainer Toby burst onto the modelling scene, as he scored his debut campaign with menswear brand Jacamo.\nSuave: On Sunday night, Toby stepped out at the London Collections Men celebration dinner, while his sister and Jason were on the red carpet at the Globes\nWorking it: Toby rocked a greyish-blue tweed waistcoat with a matching jacket and taupe trousers at the LCM fashion dinner\nNot only was he part of the image-led campaign, but he also appeared in the TV advert,\nAnd, in December he also appeared in an advent calendar-themed campaign for modelling agency Models 1, in order to raise money for charities Coppafeel and Crisis.\nAs well as his professional modelling efforts, Toby is a keen Instagrammer, sharing photos of his healthy diet and exercise routine.\nMeanwhile, things are looking incredible for Rosie and Jason following their engagement news.\nHaving been an item since 2010, the couple - who are fast-approaching their sixth anniversary - are now set to tie the knot.\nRosie looked gorgeous as she walked the red carpet with her husband-to-be at the awards ceremony, rocking a figure-hugging golden gown, accentuating her willowy model curves.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394085/Toby-Huntington-Whiteley-looks-dapper-steps-Burberry-LCM-newly-engaged-lookalike-sister-Rosie-wows-Golden-Globes.html"}
