{"authors":["Matt Levin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:52:16","date_modify":"2018-10-30 22:52:16","date_publish":"2017-03-16 00:26:58","description":"Lifelong Californian Lori Thompson is well aware of the state’s dire affordable housing problem. She’s just wondering why she’s the one who has to pay to","filename":"data/vaneerConsumption/Tocreateaffordablehousinglawmakerseyeendingtaxbreaksforvacationhomes.json","image_url":"https://calmatters.org/wp-content/uploads/VACATION_HOMES.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939936.html","title":"To create affordable housing, lawmakers eye ending tax breaks for vacation homes","title_page":"To create affordable housing, lawmakers eye ending tax breaks for vacation homes | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Lifelong Californian Lori Thompson is well aware of the state’s dire affordable housing problem. She’s just wondering why she’s the one who has to pay to fix it.\nAfter her daughter moved to Reno to escape high rents in the Monterey Peninsula, Thompson and her husband decided last December to purchase a $360,000 cabin in South Lake Tahoe. It will allow them to spend summers where Thompson used to vacation as a child and to be closer to their grandchildren.\nBut now, as the state grapples with nearly 6 million California households struggling to afford housing, legislators are turning to people like the Thompsons as a logical source of revenue—owners of a second home who deduct the interest they pay on it from their state income taxes.\nAB 71 would eliminate that deduction and channel the gains—at least $220 million annually, according to initial estimates by the state Franchise Tax Board—to a state affordable housing program. Supporters say that would cover the cost of creating 3,000 new units of affordable housing, and it could leverage $600 million to $1 billion in additional federal housing dollars.\n“During this housing crisis we have to be sure everyone has a roof over their heads before we provide tax breaks to people with two roofs,” said the bill’s sponsor, Democratic Assemblyman David Chiu of San Francisco.\nThompson acknowledges California’s housing crisis needs attention—because of soaring Silicon Valley apartment rental rates, she and her husband invited a college student who attends their church to live rent-free in their San Jose home. But she’s adamant that taxing vacation homes is not the answer—and that without the mortgage interest deduction, she might not have ever bought a second property in the first place.\n“There’s a lot of people I know who have second homes in California. They’re not wealthy but they’re comfortable,” said Thompson, a 61-year-old retiree. “My husband and I don’t drive expensive fancy cars. We chose a second home over traveling.”\nAB 71, which last week cleared the Assembly’s housing committee, would apply only to Californians who spend a significant amount of time in their second homes. Those who rent out second properties could continue to deduct mortgage interest from their state tax returns (the Internal Revenue Service defines a rental property as a property where the owner spends less than 10 percent of time compared to rental tenants.)\nCurrently, Californians can deduct interest from up to a million dollars in mortgage debt.\nGiven that Gov. Jerry Brown and Democratic lawmakers failed to reach a compromise on affordable housing funding last year, Assembly and Senate Democrats now are championing a fleet of bills to address California’s soaring housing costs. Legislators already have sent more than 100 housing-related bills to the Assembly Housing and Community Development Committee alone—well above the number introduced last year.\nSo just how many Californians own second homes, and who are they?\nWhile traditionally considered an untouchable third rail of tax policy, the mortgage interest deduction has come under renewed scrutiny of late precisely because the deduction disproportionately benefits wealthy homeowners.\nNearly three-quarters of the tax benefit from mortgage interest deductions at the federal level go to households with cash incomes above $100,000, according to the Tax Policy Center.\nAB 71 targets an affluent group of Californians—those wealthy enough to afford a second house and not use it primarily for rental income. But it wouldn’t necessarily affect the richest of the rich, who may not need to finance a second property. Over the past ten years, about 44 percent of second homes not used for rentals were purchased without a mortgage, according to data from the California Association of Realtors.\nWhere are California’s second homes?\nWhere Are California’s Vacation Homes Map created by in CARTO\nBased on data from the federal home lender Fannie Mae (and not their own internal tax data), the Franchise Tax Board estimates that 195,000 homeowners would be affected by AB 71. On average, each of these second homeowners reduces his or her taxes by about $1,140 annually by taking advantage of the second mortgage interest deduction. That’s in addition to the sizable tax breaks they receive at the federal level on both their properties, which disproportionately benefit households with high incomes.\nThe state lacks a surprising amount of data on second homeowners, including their average income. So while it’s safe to assume that second homeowners are more wealthy than your average California taxpayer, by how much more remains unknown. The National Association of Realtors estimates that nationally, second home buyers have a median household income of about $91,000.\nAs for their location within California, certain regions contain high concentrations of second homes. In tiny Alpine County, home of the Kirkwood Mountain ski resort, more than 70 percent of the housing stock is comprised of vacation homes, according to U.S. Census data analyzed by the National Association of Home Builders. More than half of the homes in Mono County, near Mammoth Mountain, are seasonal.\nThat has led to concern from some of these regions that the bill could exact a hefty toll of their local economies and housing markets.\n“Local county assessors from my district have relayed their concerns regarding the removal of the (second mortgage interest deduction) and the potential impacts it could have for property values throughout California,” said Republican Assemblyman Frank Bigelow, whose district includes all of Alpine and Mono counties.\nThe revenue rub and the governor\nBigelow and legislators from both sides of the aisle supported a 2015 bill Chiu sponsored that increased funding for the state Low Income Housing Tax Credit program by $300 million, but it did not eliminate the mortgage interest deduction on second homes. After it won near-unanimous passage in both chambers, Brown vetoed the bill, noting that it lacked a way to pay for itself.\nWhile Brown has not taken a position on the new bill, Chiu expressed confidence that eliminating the second mortgage interest deduction would appease the fiscally cautious governor. “I have received every indication that if we are successful in passing this, that the governor will consider it seriously,” he said.\nBut while attaching a new revenue source to affordable housing may satisfy the governor, it means the bill faces a precarious political path through the Legislature, where it needs a two-thirds approval vote in both chambers because it is a tax measure.\nThat means supporters can’t afford to lose moderate Democratic votes in the Assembly or Senate, and will need to deflect the potent lobbying influence of the California Association of Realtors, which opposes the bill. The Realtors contributed $1.1 million to state legislative candidates in 2016, including $723,000 to Democrats, according to data from the National Institute on Money in Politics.\nCopy: Realtors big spenders in legislative campaigns No Description\nChiu “is trying to do the right thing,” said Stan Wieg, the association’s vice president. “He’s looking for a source of funding. We just think it’s misdirected.”\nA spokesman for Assemblyman Jim Cooper of Elk Grove, co-chair of the Assembly moderate Democratic caucus, said that he had not yet had time to study the bill.\nTrump complicates ‘dire need’ for housing dollars\nEven with its designated new funding source, AB 71 could face pushback from the governor’s office on the amount of revenue the bill forecasts.\nThe state will be on the hook for $300 million in additional state housing funds regardless of how much money the elimination of the second mortgage interest deduction actually brings in. But the Franchise Tax Board did not incorporate into its initial revenue forecast any possible behavioral responses to the bill—such as a drop in the number of people buying second homes, or more second homeowners converting their properties to rentals.\nAffordable housing advocates across the state argue that the $300 million would provide a small but critical boost to the state’s affordable housing supply, given the state’s urgent need and looming federal housing programs cuts.\nThe Trump administration is reportedly mulling a proposal to cut $6 billion from the U.S. Department of Housing and Urban Development, a dramatic rollback that could affect multiple affordable housing programs in California.\nAB 71 would direct $300 million to the state’s low-income housing tax credit program, which pairs state tax credits with federal tax credits to attract investors in low income housing projects.\nWhile investor demand for affordable housing tax credits could be waning, the U.S. tax credit program is one of the few federal housing programs receiving significant bipartisan support and not on Trump’s chopping block. That makes affordable housing advocates all the more eager to tap one of the remaining reliable sources of federal funds.\n“In the face of greater cuts to federal funding through the HUD budget, California needs affordable housing investments at the state level now more than ever,” said Sarah Brundage, state and local policy director for the affordable housing developer and advocacy group Enterprise Community Partners, Inc.\n“The (tax credit program) in California and nationally is currently the greatest investment we make in housing. So this bill would play a crucial role in ensuring developments can pencil out.”\nOther pending California bills take a different approach to funding affordable housing. One by Democratic Sen. Toni Atkins of San Diego would levy a $75 recording fee on real estate documents, excluding property sales. The California Association of Realtors supports that bill, but it’s opposed by mortgage lenders and county recorders.\nWhile maintaining that the governor has not taken any position on AB 71, a spokeswoman for Brown said that the governor is generally supportive of the Atkins bill.","url":"https://calmatters.org/articles/to-create-affordable-housing-lawmakers-eye-ending-tax-breaks-for-vacation-homes/"}
