{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 23:00:41","date_modify":"2018-10-30 23:00:41","date_publish":"2014-08-14 13:53:10","description":"Next up on The Today Show... Savannah Guthrie had a baby girl. Us Weekly reports that Guthrie and her husband Michael Feldman welcomed Vale Guthrie Feldman to the world on Wednesday, Aug. 13. Vale came in at 19.5 inches and 8 lbs. 5 oz., and she's…","filename":"data/vaneerConsumption/TodayShowsSavannahGuthrieGaveBirthtoaBabyGirlShesTotallyAdorablePHOTOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e323a3e2-4f82-4219-a098-c0dd5dad2bdc.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35745-today-shows-savannah-guthrie-gave-birth-to-a-baby-girl-shes-totally-adorable-photos_1540940441.html","title":"'Today Show's Savannah Guthrie Gave Birth to a Baby Girl & She's Totally Adorable - PHOTOS","title_page":"'Today Show's Savannah Guthrie Gave Birth to a Baby Girl & She's Totally Adorable — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"Next up on The Today Show... Savannah Guthrie had a baby girl . Us Weekly reports that Guthrie and her husband Michael Feldman welcomed Vale Guthrie Feldman to the world on Wednesday, Aug. 13. Vale came in at 19.5 inches and 8 lbs. 5 oz., and she's the 42-year-old anchor's first child.\nNaturally, Savannah Guthrie was thrilled for her baby's birth, so she took to Twitter share her excitement with the world. She tweeted:\nMy 3 am wake up call sounds a lot different now. Sweeter...\nThe anchor even got to share the news of her new daughter on The Today Show, which she mentioned on Twitter was especially exciting:\nEvery new parent must want to shout their happy news to the world. So lucky we got to do it on @TODAYshow We are bursting with joy. #Vale.\nIt's one thing to tweet and post on Facebook to your followers, it's another to get to literally tell everyone who is up at the crack of dawn and watching The Today Show all about your new addition. However, Guthrie also mentioned on social media that Vale didn't get to see the hoopla since she was asleep. Hopefully she'll get to see the video of it all someday (it's a safe bet that will happen).\nUnsurprisingly, her fellow anchors on The Today Show were happy to see the newborn Guthrie-Feldman baby, as they posted some photos of Guthrie and Vale on Instagram.\nYou can see The Today Show and Guthrie's photos below.\nSo adorable, right?\nImage: todayshow/Instagram","url":"https://www.bustle.com/articles/35745-today-shows-savannah-guthrie-gave-birth-to-a-baby-girl-shes-totally-adorable-photos"}
