{"authors":[],"date_download":"2018-10-30 14:20:11","date_modify":"2018-10-30 14:20:11","date_publish":"2018-10-30 14:12:47","description":"When the College Football Playoff selection committee reveals its first weekly ranking of the season...","filename":"data/vaneerConsumption/ToddStansburysroleonCFPcommitteeunderway.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/03/Images/080418%20tech%20photos_AP3.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_todd-stansbury-role-cfp-committee-under-way__1540909211.html","title":"Todd Stansbury’s role on CFP committee under way","title_page":"Todd Stansbury’s role on CFP committee under way","title_rss":"NULL","source_domain":"ajc.com","text":"When the College Football Playoff selection committee reveals its first weekly ranking of the season Tuesday evening, the list will have the influence of Georgia Tech athletic director Todd Stansbury.\nStansbury has been in Gaylord, Texas, in his new role as a member of the 13-person committee representing the ACC. Stansbury is serving a three-year term. Stansbury has been assigned to be a point person for the Big 12 Conference and Conference USA, although the role requires him to be informed on all teams vying to be in the top 25.\n“You watch games all year long,” said Clemson AD Dan Radakovich, whose place Stansbury took. “The technology allows you, that if you can’t see a game live or on television, that you’re able to pull it up on the iPad and watch it probably in about 40 minutes.”\nRadakovich estimated that he watched between 12 and 24 games each week. He said that he spoke with Stansbury about the position before he began serving at the start of the season.\n“We’ve spoken a couple times more about process and how my weekends worked and things like that,” Radakovich told the AJC. “I was able to share some of that with him. Every year is so different and, again, just getting all that data that’s necessary is probably the biggest part of the battle.”\nRadakovich also emphasized the importance of staying organized, doing homework and getting into a rhythm for each week for watching games.\n“Utilizing your time on that plane ride from Atlanta to Dallas is obviously some really good time there to make things work, getting organized for the actual meetings,” Radakovich said. “He’s going to do a great job.”\nStansbury was tabbed by ACC commissioner John Swofford to represent the conference. He was named to the position in January. The committee is the most scrutinized decision-making entity in college athletics and possibly in all of American sports. It is not a light endeavor.\nStansbury will share point-person duties on Conference USA with former Virginia Tech coach Frank Beamer and Big 12 duties with former Furman and Vanderbilt coach Bobby Johnson. Stansbury will be recused from any conversation about Georgia Tech.\nStansbury will attend the meetings on a weekly basis through the conference championship weekend. All but the last take place on Mondays and Tuesdays. The final weekend, when the four-team playoff is set, will be a Friday-Sunday conference.","url":"https://www.ajc.com/sports/college/todd-stansbury-role-cfp-committee-under-way/BdhrLsVnabOuiwIkXie20O/"}
