{"authors":["Tiffany Lo For Mailonline"],"date_download":"2018-10-23 02:17:22","date_modify":"2018-10-23 02:17:22","date_publish":"2017-04-26 13:16:58","description":"WARNING: DISTURBING CONTENT. This is the shocking moment a three-year-old boy died after pulling a desk on top of him at a bank in central China on April 23.","filename":"data/vaneerConsumption/Toddlerboyiskilledafterabankcounterfallsonhim.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F96AF00000578-0-image-a-2_1493208804824.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447116_Toddler-boy-killed-bank-counter-falls-him_1540261042.html","title":"Toddler boy is killed after a bank counter falls on him","title_page":"Toddler boy is killed after a bank counter falls on him | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the shocking moment a three-year-old boy pulls a desk on top of him at a bank in central China's Henan province.\nCCTV footage shows the desk falling on the boy's body while the father was busy at the front counter on April 23.\nSadly, the toddler died after being taken to the local hospital.\nA three-year-old boy was trying to reach a tall desk in the bank lobby in central China's Henan\nWhen he jumped to touch the desk, it fell on him hitting the toddler's chest instantly\nThe video, uploaded on Pear reported that the incident occurred in the Guangshan branch of Xinyang Zhujiang Rural Bank.\nAt the beginning of the footage, the father can be seen carrying the boy on his lap while dealing with his business matters in the bank's lobby.\nAs he gathers his belongings and prepares to leave, he lets go of the three-year-old and allows him to walk around.\nThe child waited a while before spotting a tall desk where people fill in forms.\nThe toddler jumped and attempted to touch the desk.\nHis father witnessed the shocking moment but it was too late to save his son\nThe boy was pronounced dead after being sent to the hospital\nThe desk then falls on the boy hitting his chest as the father looks at him with documents in his hands.\nA female onlooker rushes over to help.\nBoth the father and onlooker lift up the desk before he then can be seen shaking his son's hand.\nThe boy does not move.\nThe toddler was sent to a local hospital for emergency treatment however he died shortly after.\nVideo footage of the incident has been widely shared on Chinese social media.\n'Danms_1215' commented that the father should take the blame for not taking good care of the young child and said: 'Even for just a short 15 seconds, any parent should not leave their children alone and this has perfectly shown you the reason why!'\nBut another user 'LadyBing' questioned why the desk is not fixed to the ground and no security guard around to give warning to the children.","url":"https://www.dailymail.co.uk/news/article-4447116/Toddler-boy-killed-bank-counter-falls-him.html"}
