{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:51:05","date_modify":"2018-10-30 21:51:05","date_publish":"2015-06-03 12:36:28","description":"As\nEATER\nreported this week, \nTodd Richards...","filename":"data/vaneerConsumption/ToddRichardsisthenewexecutivechefatWhiteOakKitchenCocktai.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/06/03/Images/WPIMAGE_cmgajcfoodandmore_3475.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_to_87476e16dc8613592d11d8ed6dda544f__1540936265.html","title":"Todd Richards is the new executive chef at White Oak Kitchen & Cocktai","title_page":"Todd Richards is the new executive chef at White Oak Kitchen & Cocktai","title_rss":"NULL","source_domain":"ajc.com","text":"As EATER reported this week, Todd Richards is the new executive chef at White Oak Kitchen & Cocktails in Downtown Atlanta, replacing former White Oak chef, Timothy Magee, who is now the chef at Community Smith in Midtown.\nBrewed to Serve Restaurant Group, Inc. confirmed the move in a press release with a statement from Richards.\n“My decision to join White Oak Kitchen & Cocktails is founded on my desire to leverage the classical nature of my experience at The Ritz-Carlton with the unpretentious nature of my neighborhood restaurants,\" Richard said. \"WOKC offers the aesthetic and international client base to make this happen.”\nA self-taught cook and 2013 James Beard Awards semi-finalist for Best Chef Southeast, Richards served as executive chef at the Ritz-Carlton Buckhead , and most recently chef/partner at The Shed in Glenwood Park and The Pig & The Pearl at Atlantic Station.\nIn a phone call this afternoon, Richards confirmed that he will no longer be associated with The Shed or The Pig & The Pearl.\n\"I've wanted to revisit fine dining and this was the greatest opportunity to do that,\" he said. \"It's like a return to my early days as a chef. Beyond that, I really enjoy the location, which offers the best of both worlds, with local guests and visitors, like my days at the Ritz-Carlton.\"\nThough he's only been on the job a few days, Richards said he will change the entire White Oak menu in four-to-six weeks. Richards also confirmed that he will be working on other projects with Brewed to Serve in the near future.","url":"https://www.ajc.com/blog/atlanta-restaurants/todd-richards-the-new-executive-chef-white-oak-kitchen-cocktails/gqeS8Vz4rN3lwEczRiHhIM/"}
