{"authors":["Matt Levin","Dan Morain","California Dream Project"],"date_download":"2018-10-30 22:49:16","date_modify":"2018-10-30 22:49:16","date_publish":"2018-07-26 22:51:36","description":"Seattle has a lot in common with San Francisco. A thriving economy increasingly dominated by major technology companies. A deep blue electorate with a strong environmental ethos. And of course, a soaring cost of living that has made living in either city a prohibitively expensive proposition for many long-time residents. But Seattle has responded to its housing crisis much differently than its Bay Area counterpart: Seattle has built a lot more homes.","filename":"data/vaneerConsumption/TofixitshousingwoesshouldCalifornialooktoSeattle.json","image_url":"https://calmatters.org/wp-content/uploads/Seattle-Skyline-by-Howard-Ignatius-via-Flickr.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939756.html","title":"To fix its housing woes, should California look to Seattle?","title_page":"To fix its housing woes, should California look to Seattle? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Please subscribe to us on Apple Podcasts, Stitcher, Soundcloud, Google Play and Overcast.\nSeattle has a lot in common with San Francisco. A thriving economy increasingly dominated by major technology companies. A deep blue electorate with a strong environmental ethos. And of course, a soaring cost of housing that has made living in either city a prohibitively expensive proposition for many long-time residents.\nBut Seattle has responded to its housing crisis much differently than its Bay Area counterpart: Seattle has built a lot more homes. From 2010 to 2016, Seattle built more than twice as many homes as San Francisco, according to the San Francisco Business Times. And Seattle rents, while still far more expensive than they were just five years ago, have actually started to stabilize.\nIn this episode of Gimme Shelter, Matt and Liam talk with Mike Rosenberg, housing reporter for the Seattle Times and the best follow in all of housing Twitter. They compare how the housing crisis is playing out differently in the Pacific Northwest than in California, and what (if anything) California can learn from it’s northern neighbor.","url":"https://calmatters.org/articles/gimme-shelter-podcast-to-fix-its-housing-woes-should-california-look-to-seattle/"}
