{"authors":[],"date_download":"2018-10-30 18:39:24","date_modify":"2018-10-30 18:39:24","date_publish":"2018-08-29 17:39:00","description":"Perkerson Elementary, Carver High have culture change in common.","filename":"data/vaneerConsumption/TohelpkidslearnAtlantaprincipalsworkonhowschoolfeels.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/29/Images/newsEngin.22887445_080818-ENT-APS-partners-JE-04.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_help-k_85d58afa456fed0b807074cb461245c5__1540924764.html","title":"To help kids learn, Atlanta principals work on how school feels","title_page":"Atlanta principals emphasize school culture in turnaround efforts","title_rss":"NULL","source_domain":"ajc.com","text":"Efforts to improve poor-performing Atlanta schools have led to big changes in classrooms, shifts that are as much about trying to create a new culture as they are about new teachers.\nIn two schools — Perkerson Elementary and Carver High — it meant starting the year with a vastly different staff.\nAt Perkerson, 13 of the 39 teachers are new this year. At Carver, roughly a third of the total staff returned. Carver’s operations also were outsourced this year to the nonprofit Purpose Built Schools Atlanta, making the school one of a handful the Atlanta district has handed over to outside operators since adopting a wide-ranging turnaround plan in 2016.\nWhile experts question whether massive staff overhauls really improve schools, both principals want to change a big intangible: school culture.\nVIDEO: More on APS\nVideo: Day One with Atlanta Public Schools Superintendent Meria Carstarphen (Mandi Albright/The Atlanta Journal-Constitution)\nOn recent tours of the two schools, they spoke enthusiastically about a new approach to academics and the school environment. Both schools are in high-poverty neighborhoods and serve students who face significant hardships in their lives outside the classroom.\nAt Carver, the teachers are implementing a project-based learning model borrowed from Drew Charter School, with which Purpose Built is affiliated.\nThe teaching method puts students “at the core of the learning,” Carver principal Yusuf Muhammad said.\n“Instead of just, ‘Here’s a textbook, and you read the textbook’ or ‘… I’m going to lecture and tell you what to do and you have to memorize what you have to learn,’ the students will be designing projects that are aligned to, of course, the state standards but also to their lives, so it’s culturally based,” he said.\nStudents will learn math, science and history by studying different issues in their community, he said. Carver also has added engineering and robotics classes and scheduled time for the chess, debate and other clubs to meet during the school day.\nBut beyond instruction, the principals of Perkerson and Carver are trying to change the way their schools feel.\nMuhammad often talks about making sure his students know they matter.\n“I just really worked on culture, creating a culture of love … and that we have high expectations,” he said. “I knew that we couldn’t make huge academic gains right away without improving the culture.”\nMid-interview, one class period ended and another began. As if to underscore his point, instead of a shrill bell, an announcer’s voice filled the room: “Good afternoon kings and queens. At this time, we will start our transition to our third block.”\nAt Perkerson, Principal Tony Ford hugged and high-fived students, whom he calls his “babies” and his “kiddos.”\nWhen he stepped into the boisterous cafeteria, his friendly demeanor briefly switched to something slightly more stern:\n“It’s taking a long time to get your attention. I need you to be silent right now,” he said.\nThe lunch tables went silent, or nearly so. Ford returned to warmly greeting students by name.\nHe and his team have set up a system of rewards and competitions that acknowledge students and classes for excelling. The Perkerson Pit Stop is a school store where students can spend a “paycheck” that they earn for good behavior.\nThe school is divided into “houses” by grade level. Each house competes for tokens and a chance to win a party with Ford.\nHe’s already done pancakes with the principal (he wore an apron), pretzels with the principal, and puppy chow with the principal.\nImagine: Hanging out with the principal as an honor and not a punishment. That’s the school he’s trying to create.","url":"https://www.ajc.com/news/local-education/help-kids-learn-principals-work-how-school-feels/6B8Fn3ZQRSnvSLJeRc0jtN/"}
