{"authors":["Arielle Dachille"],"date_download":"2018-10-30 23:54:56","date_modify":"2018-10-30 23:54:56","date_publish":"2014-08-12 21:54:35","description":"The news of Robin Williams' death is the kind that knocks the wind out of you. Quite honestly, I'm still reeling along with the rest of the world from the loss of this prodigious comedic and dramatic talent. The actor/comedian that rambled and…","filename":"data/vaneerConsumption/ToHonorRobinWilliamsTheTCLChineseTheaterWillDimTheirLightsForthe8thTimeEver.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/8/6baaf5bb-5fab-4fbf-b252-7fd6a34832ed-getty-526090462.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35494-to-honor-robin-williams-the-tcl-chinese-theater-will-dim-their-lights-for-the-8th-time_1540943696.html","title":"To Honor Robin Williams The TCL Chinese Theater Will Dim Their Lights For the 8th Time Ever","title_page":"To Honor Robin Williams The TCL Chinese Theater Will Dim Their Lights For the 8th Time Ever","title_rss":"NULL","source_domain":"bustle.com","text":"The news of Robin Williams' death is the kind that knocks the wind out of you. Quite honestly, I'm still reeling along with the rest of the world from the loss of this prodigious comedic and dramatic talent. The actor/comedian that rambled and wisecracked his way into our hearts will receive a momentous tribute from the Hollywood community tonight. In honor of the life and prolific career of Robin Williams, the TCL Chinese Theater will dim their lights on Tuesday night at 8:30, according to NBC Los Angeles. In the 87-year history of the Hollywood Institution, formerly named Grauman's Chinese Theater, there have been only 7 other times that this has happened.\nWilliams was found unconscious on Monday in his Marin County apartment, and was pronounced dead shortly thereafter when authorities investigated the scene. On Tuesday it was ruled that his cause of death was asphyxia, due to a suicide by hanging. Williams was just 63, but has famously struggled with addiction and depression. He checked himself into rehab back in July to maintain his sobriety. Tributes from the entertainment community, the President, the media, and the world at large have inundated the internet, showing a tremendous outpouring of love and reverence for Williams, as well as support and sympathy for his family. To honor Williams' memory, TCL Theater forecourt, which has memorialized Williams' handprints and those of so many other industry greats, will go dark tonight for 60 seconds.\nWhile this dimming of the lights is typically reserved for the loss of American icons in show business, there have been a few exceptions to this rule. In the near-century life of the TCL Chinese Theater, here are the 7 other times in which the forecourt lights have been dimmed in tribute.\nShirley Temple\nFrederick M. Brown/Getty Images Entertainment/Getty Images\nThe OG child actress and namesake of your favorite childhood cocktail Shirley Temple passed away in April of this year at the age of 85. According to NBC Local, Temple received the honor of the \"dimming of the forecourt\" lights in memoriam of her contributions to the world of entertainment. Temple's handprints are memorialized in that iconic sidewalk right outside of the theater.\nPeter O'Toole\nFrederick M. Brown/Getty Images Entertainment/Getty Images\nIn December of 2013, the world lost the prolific actor of screen and stage Peter O'Toole at the age of 81. O'Toole was paid tribute with the dimming of the lights on the forecourt shortly after his death.The Lawrence of Arabia actor was in the entertainment industry for 56 years, and was considered one of the greatest actors of his time. According to CBS Local, his hands were imprinted on the Grauman's forecourt walk in 2011, which was obviously far overdue.\nMickey Rooney\nKevork Djansezian/Getty Images Entertainment/Getty Images\nBack in April, showbiz stalwart Mickey Rooney passed away at the ripe age of 93. He rose to fame as Andy Hardy of MGM's Hardy Boys films, and took home 2 honorary Oscars during his Hollywood tenure. Rooney's hands went in the cement in 1938, early on in his career. The grand Pagoda lights were dimmed to commemorate Rooney's long life in the biz and on Earth.\nDonna Summer\nFrederick M. Brown/Getty Images Entertainment/Getty Images\nIn May of 2013, legendary singer and queen of disco Donna Summer passed away after a long battle with cancer. The iconic diva was only 63. According to LAist, the lights at Grauman's theater went down in tribute to her on the same day as her passing.\nTony Scott\nKevin Winter/Getty Images Entertainment/Getty Images\nDirector Tony Scott, who worked on Top Gun & Man on Fire, passed away in August of 2012 at the age of 68 after nearly 40 years in showbiz. The British expat filmmaker tragically committed suicide by jumping off of a bridge, according to Daily Mail. According to Getty, the lights at Grauman's Chinese Theater were dimmed a few days later in tribute to the late director.\nNeil Armstrong\nChip Somodevilla/Getty Images News/Getty Images\nIn August 2012, space pioneer and American iconoclast Neil Armstrong departed this world at the age of 82, as a result of a complication from a heart bypass. The very same day, the lights on the theater were dimmed for 1 minute according to CBS Los Angeles. While this honor is typically reserved for entertainment industry vets, Armstrong's legacy as an American hero made this tribute necessary.\nAurora, CO Movie Theater Shooting Victims\nJoshua Lott/Getty Images News/Getty Images\nIn the wake of the horrific Dark Knight shooting in Aurora, CO back in July 2012, The TCL Theater held a candlelight vigil for the victims who tragically perished. That month, the theater facade went dark in remembrance of the 12 lives lost in the tragedy.\nEven though we are still in the wake of this tragedy, this is a fitting tribute for a man who has touched so many lives.\nImage: Getty Images (7)","url":"https://www.bustle.com/articles/35494-to-honor-robin-williams-the-tcl-chinese-theater-will-dim-their-lights-for-the-8th-time"}
