{"authors":["John Hayward"],"date_download":"2018-10-30 19:02:09","date_modify":"2018-10-30 19:02:09","date_publish":"2016-08-11 20:43:45","description":"A Washington Post profile of Tokyo's first female governor, Yuriko Koike, describes her as a \"staunch conservative.\"","filename":"data/vaneerConsumption/TokyosFirstFemaleGovernorAnArabicSpeakingStaunchConservativeNationalist.json","image_url":"https://media.breitbart.com/media/2016/07/wi/afp_4004dada317b9c0df0190a6f7c9b6d3590a1a293-e1470948208744.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_08_11__1540926129.html","title":"Tokyo's First Female Governor: An Arabic-Speaking 'Staunch Conservative' 'Nationalist'","title_page":"Tokyo's First Female Governor: An Arabic-Speaking 'Staunch Conservative' 'Nationalist' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Washington Post profile of Tokyo’s first female governor, Yuriko Koike, describes her as a “staunch conservative known for her nationalist positions,” an uncompromising renegade who wiped out her old party’s candidate after running as an independent, and a fan of Margaret Thatcher.\n“There will be no occasions on which I will compromise,” she said in an interview in her new office Wednesday, her first with a foreign news organization since being elected, when asked about how she would proceed with a legislature that is not exactly enamored with her. Instead, she invoked the maxim of one of her role models, Britain’s “Iron Lady” Margaret Thatcher, about acting on conviction, not by consensus. “In Japanese society, you try to build consensus and try to keep harmony, but I would like to convince people to change for the sake of our society,” Koike said. “I learned that from Mrs. Thatcher.” Koike, who is fluent in English, chose to speak mostly in Japanese.\nThe Post notes that Koike, 64, enjoys “outsider” status among her supporters, even though she has held a number of high government posts over the past 25 years, including Defense Minister – another post never previously held by a woman.\nShe also worked in the media, scoring interviews with Moammar Qaddafi and Yasser Arafat before their deaths – interviews she conducted in Arabic, another language she speaks.\nKoike seems untroubled by the prospect of facing a legislature full of men who look down on her, dominated by the political party she abandoned, and then defeated.\n“As the new governor, I will make policies, and I doubt that my ideas will be opposed by the assembly,” she cheerfully predicted to the Washington Post.\nKoike talked about breaking the glass ceiling in a CNN interview, but she called it a “steel ceiling.” She explained that it was “more rigid, more chauvinistic,” and “really hard to crash.”\n“It’s not fair. In the U.S. and other countries, women have more freedom to choose both [career and family],” she said.\nCNN asked for about her take on the U.S. political scene:\nKoike is often compared to Hillary Clinton, and she praised the former US Secretary of State’s campaign, though expressed relief that she didn’t have to run as long a one to win her seat. “My campaign lasted only 17 days,” she says, adding that the length of the US presidential race is “unthinkable for us.” A big proponent of close US-Japan ties, Koike says the country will work with whomever is elected in November, be it Clinton, or Donald Trump. One area where the two nations cooperate is on security, and Koike is conscious of the threat posed by international terrorism, especially around the upcoming 2020 Olympics. “We have to prepare for everything,” she says. “We have to be very careful of both international as well as domestic terrorism.”\nThe 2020 Olympics are a big issue that pops up in just about every piece on Koike, because they’ll likely be a headache throughout her term, with the games beginning just six days before that term ends.\nThings aren’t looking good for the Tokyo Olympics at the moment, with problems including 300% cost overruns, a lovely stadium design that proved too expensive to build, accusations of cronyism in the awarding of Olympic contracts, an international money-laundering investigation, and even charges the Tokyo Olympic logo was plagiarized.\nKoike told the Washington Post many of those problems grew from confusion over who was in charge.\n“We need to make it clear who’s making the decisions. As the governor of the host city, I’d like to take the leadership of the Olympics and Paralympics,” she said.","url":"https://www.breitbart.com/national-security/2016/08/11/tokyos-first-female-governor-staunch-conservative-known-nationalist-positions/"}
