{"authors":[],"date_download":"2018-10-23 00:23:09","date_modify":"2018-10-23 00:23:09","date_publish":"2017-03-10 06:43:09","description":"Already under fire over soaring expenses, Tokyo's 2020 Olympic organisers on Friday sought to downplay fears that further ballooning costs could hit the...","filename":"data/vaneerConsumption/TokyohitbynewOlympicstadiumcostfears.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/06/wire-194399-1489128192-0_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300118_Tokyo-hit-new-Olympic-stadium-cost-fears_1540254189.html","title":"Tokyo hit by new Olympic stadium cost fears","title_page":"Tokyo hit by new Olympic stadium cost fears | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Experts have warned that the 2020 Tokyo Olympic Games could cost an eye-watering 3 trillion yen\nAlready under fire over soaring expenses, Tokyo's 2020 Olympic organisers on Friday sought to downplay fears that further ballooning costs could hit the trouble-cursed main stadium.\nAmid media reports that temporary structures at the showpiece venue could more than double in cost from bid estimates, Japanese organisers did little to ease concerns.\n\"The estimate for the cost of temporary facilities is not final,\" Tokyo 2020 spokesperson Hikariko Ono told AFP. \"(It) will be made public after further discussion with parties involved.\n\"The current estimate has been provisionally set based on procedures outlined in IOC (International Olympic Committee) technical manuals, and figures from previous Games,\" she added.\nOverlay expenses on top of the construction costs for the permanent structure of the Olympic stadium, including practice facilities such as a running track, could top 10 billion yen ($87 million), according to local media.\nThe Japanese and Tokyo city governments, along with Games organisers, are looking into sharing costs for maintaining these temporary facilities at the stadium, which is scheduled to be completed in November 2019.\nJapan's new National Stadium has been a major source of controversy since Prime Minister Shinzo Abe scrapped the original blueprint in 2015 as costs raced beyond $2 billion.\nLate Iraqi-British architect Zaha Hadid's futuristic plan has since been replaced by Kengo Kuma's hamburger-shaped design -- a relative snip at $1.5 billion.\nBut organisers are still sweating over the price tag for the 2020 Games, which experts have warned could hit an eye-watering 3 trillion yen ($26 billion).\nEuphoria at winning the bidding war in 2013 quickly faded as public rows over costs and a series of scandals have overshadowed Tokyo's preparations for its second Olympics since hosting the 1964 Games.\nThe Tokyo city government says it expects the Olympics to generate a boost of 32 trillion yen ($280 billion) to the Japanese economy.\nHowever, organisers face a real battle to keep costs below the $20 billion cap demanded by the IOC.\nAs well as the stadium fiasco, embarrassing accusations of plagiarism from a Belgian theatre forced the Tokyo organising committee to bin the original design of the Games logo.\nMore seriously, French prosecutors are investigating allegations of illegal payments made during Tokyo's successful Olympic bid. Japanese Olympic officials strenuously deny any wrongdoing.","url":"https://www.dailymail.co.uk/wires/afp/article-4300118/Tokyo-hit-new-Olympic-stadium-cost-fears.html"}
