{"authors":["Valerie Edwards For Dailymail.Com"],"date_download":"2018-10-23 04:49:58","date_modify":"2018-10-23 04:49:58","date_publish":"2016-01-29 20:39:46","description":"A baby polar bear snuggles up to its mom in adorable footage released by the Toledo Zoo. The sixteen-year-old mother, Crystal, is caring for the cub in a secluded den that's off exhibit.","filename":"data/vaneerConsumption/ToledoZoospolarbearcubsnuggleswithitsmotherinvideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/20/30B50E4C00000578-0-image-a-25_1454098887120.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423388_Newborn-polar-bear-cub-melt-coldest-hearts-snuggles-mother-adorable-video_1540270198.html","title":"Toledo Zoo's polar bear cub snuggles with its mother in video","title_page":"Toledo Zoo's polar bear cub snuggles with its mother in video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A baby polar bear snuggles up to its mom in adorable footage released by the Toledo Zoo.\nThe zoo announced the birth of a polar bear cub on December 3, but recently released a video of the two bonding.\nThe sixteen-year-old mother, Crystal, is caring for the cub in a secluded den that's off-exhibit where animal care staff are carefully monitoring the cub's progress.\nAs in the wild, the two bears will stay secluded until the cub reaches about 20 to 30 pounds.\nThe newborn's name hasn't been decided, as the gender of the cub is unknown. The zoo is also waiting to announce a date for its zoo debut, but visitors will be able to see the baby in the spring.\nThis baby marks the fifth time polar bear cubs have been born at the zoo for a total of seven cubs since 2006.\nToledo Zoo announced the birth of a polar bear cub that was born on December 3. The cub and its mother, Crystal, are being closely monitored by zoo staff until the baby grows substantially\nThe cub will need to reach about 20 to 30 pounds before it leaves the den, according to the assistant director of animal programs\nThe zoo’s last cubs, twin brother and sister Sakari and Suka, were also born to Crystal and fathered by the zoo’s male named Marty in 2012.\nWhen the bears were two-years-old, they were moved to the Como Park Zoo and Conservatory in St. Paul, Minnesota, according to Toledo Blade.\nDr. Randi Meyerson, assistant director of animal programs, said in a statement that the cub 'still has a lot of important milestones to achieve before going on exhibit', but the zoo remains optimistic.\nBreeding at the Toledo Zoo is a part of the polar bear Species Survival Plan (SSP).\nThrough this program, zoos across the nation work together to maintain a healthy population of polar bears, who are listed on the International Union for Conservation of Nature (IUCN) Red List as a vulnerable species.\nPolar bears are also listed as a threatened species under the Endangered Species Act due to the loss of Arctic sea ice from climate change, according to the zoo's statement.\nThe gender of the cub is unknown as animal care staff are observing the two bears through a monitor in the den. The zoo has yet to release a debut date, but visitors should be able to see them in the spring\nBreeding at the Toledo Zoo is a part of the polar bear Species Survival Plan (SSP) and twin cubs were born to Crystal in 2012 as part of the program","url":"https://www.dailymail.co.uk/news/article-3423388/Newborn-polar-bear-cub-melt-coldest-hearts-snuggles-mother-adorable-video.html"}
