{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:13:12","date_modify":"2018-10-31 00:13:12","date_publish":"2017-03-15 16:38:14","description":"Grab a powerful political tool that few voters understand. Plan to fight in courts, statehouses and ballot boxes. Add an infusion of celebrity and more","filename":"data/vaneerConsumption/Tomakevoterscareaboutgerrymanderingcastitasavillain.json","image_url":"https://calmatters.org/wp-content/uploads/REDISTRICTING_Photo-e1534995141692.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944792.html","title":"To make voters care about gerrymandering, cast it as a villain?","title_page":"To make voters care about gerrymandering, cast it as a villain? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Grab a powerful political tool that few voters understand. Plan to fight in courts, statehouses and ballot boxes. Add an infusion of celebrity and more than a dash of cash.\nIt’s a recipe some activists are trying as they work to export to other states California’s model for drawing political lines—a change that ultimately could shake up Congress and the domination Republicans now enjoy.\nHaving collaborated to create California’s nonpartisan system for setting political boundaries nearly a decade ago, former Republican Gov. Arnold Schwarzenegger and the government watchdog group Common Cause are now teaming up to try to overhaul how political maps are drawn in several other large states.\nThey’re supporting ballot measures in Ohio, Michigan and Missouri; helping with lawsuits in Wisconsin, North Carolina and Maryland; and lobbying legislatures in Pennsylvania, Georgia and Texas. The details vary in each state, but the overarching similarity is an attack on partisan gerrymandering in favor of a system more like California’s, which has removed a lot of the politics from the process of setting boundaries for legislative and congressional districts.\n“The states that are thinking about these big changes are critical on the electoral map,” said Kathay Feng, director of the national redistricting effort at Common Cause. “These are all states where just in 2016… big battles were going on.”\nThe process for carving states into political districts is called “redistricting,” and while it may sound like a painfully boring word, it’s actually a potent political weapon. Drawing up the maps strikes at the bedrock of democracy: It influences how well elected officials represent their communities. That’s because regions can be divided in ways that dilute the concentration of Republicans or Democrats, giving one party more power than it deserves based on its proportional share of the voters.\nIn North Carolina, the advocates note, 47 percent of the votes for Congress last year went to Democratic candidates—but Democrats only won 23 percent of that state’s seats. In Maryland, it was the reverse: Republican candidates for Congress won 35 percent of the votes, but less than 13 percent of the seats.\nIn those states, like most across the country, the party that holds power in the state legislature gets to set the boundaries for congressional districts. Supporters of independent redistricting say the system creates an inherently politicized process, where maps are drawn to continue to benefit the party in power. Critics of the independent system say elected lawmakers—unlike independent commissioners—are accountable to voters and can be thrown out of office if people grow unhappy with how they draw the maps.\nIn California, voters passed ballot measures in 2008 and 2010 that took power to draw political maps away from the Legislature and handed it to an independent citizens commission made up of five Democrats, five Republicans and four people not affiliated with a major party. Politicians, lobbyists and campaign donors are not eligible to serve on the commission. California is the only state that’s removed politicians from the map-drawing process, though 15 other states have taken the authority away from the legislature.\nThe change in California has benefited Democrats—they’ve picked up five seats in Congress in the last decade and won a supermajority in both houses of the state Legislature. That’s because the old maps were drawn to favor incumbents from both parties, and the new maps create more competition, said Eric McGhee, a researcher with the Public Policy Institute of California. More Democrats have been elected, he said, because the districts mirror the growing share of Democratic voters in the state.\n“The plan is basically fair,” McGhee said. “The commission drew the lines to reflect the way the state had changed.”\nSchwarzenegger is touting the California model—and urging change in other states—in a series of kitschy social media videos designed to maximize his movie star appeal. Using clips from his early films and a smattering of foul language, the videos are trying to make an arcane subject relevant to the masses.\n“We’ve proven that gerrymandering can be permanently terminated,” the “Terminator” star says in one video. “Tell your leaders to let the people decide who should draw their maps,” he says in another. “Hint: Not them.”\nSchwarzenegger’s advocacy for the nonpartisan system marks a break from many others in the GOP. Republicans sued in 2011 to block California’s approach, but their case was thrown out by the courts. Jim Brulte, who heads the California Republican Party, said independent redistricting is good “in concept” but not the way it’s played out in California.\n“There were flat-out Democrat operatives on the commission in California that managed to get through the so-called independent process,” Brulte said. “So not everything that looks good on paper turns out the way it should.”\nNationally, Republicans have pursued a partisan approach to setting district boundaries that has been very successful. After Barack Obama was first elected president in 2008, Republicans crafted a strategy to win control of state legislatures. It worked. The GOP now controls 32 statehouses, while Democrats wield power in 14. Because in most states the congressional lines are drawn by state legislatures, this state-capitol control has translated to growing Republican domination in Congress.\nDemocrats, beset by defeat in the presidential race last year and weakened by minority positions in both houses of Congress, are now crafting their own campaign to redraw political maps. Obama has said he wants to make redistricting a priority in his years after leaving office, and his former Attorney General Eric Holder is now leading the Democratic effort to be better positioned when lines are re-drawn in 2021.\nBoth the Democratic campaign and the nonpartisan Common Cause effort will need serious money to put initiatives on the ballot and fight lengthy battles in court. And that is where California—home to many politically-active billionaires—is also likely to come into play.\nFeng, the Common Cause director, said she’s in early talks with Republican donor Charles Munger Jr., who bankrolled the ballot measures that created independent redistricting in California, and Democratic donor Tom Steyer, who has funded a variety of liberal initiatives. (Neither one has committed.) Schwarzenegger aide Bonnie Reiss said the former governor plans to raise money for the effort, as well as donate some of his own.","url":"https://calmatters.org/articles/to-make-voters-care-about-gerrymandering-cast-it-as-action-thriller-villain/"}
