{"authors":["Daniel J. Flynn"],"date_download":"2018-10-30 19:53:51","date_modify":"2018-10-30 19:53:51","date_publish":"2016-07-13 15:31:55","description":"The United States Court of Appeals for the Second Circuit rejected a Tom Brady attempt to reverse a decision by a three-judge panel siding with the NFL. | Sports","filename":"data/vaneerConsumption/TomBradysDeflategateAppealDeniedbyFederalCourt.json","image_url":"https://media.breitbart.com/media/2016/03/afp_0db8bc2726411af442aff4a6c70741dfe1053216.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2016_07_13__1540929231.html","title":"Tom Brady's Deflategate Appeal Denied by Federal Court","title_page":"Tom Brady's Deflategate Appeal Denied by Federal Court | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The United States Court of Appeals for the Second Circuit rejected a Tom Brady attempt to reverse a decision by a three-judge panel siding with the NFL.\nThe decision to not reconsider the case of Brady and the NFL Players Association maintains the NFL’s four-game suspension of the New England Patriots quarterback. Brady’s sole legal hope remains a hail mary at the U.S. Supreme Court.\nThe appeals court provided no rationale for the decision. The order simply read: “Appellees, National Football League Players Association and Tom Brady, filed a petition for panel rehearing, or, in the alternative, for rehearing en banc. The panel that determined the appeal has considered the request for panel rehearing, and the active members of the Court have considered the request for rehearing en banc. IT IS HEREBY ORDERED that the petition is denied.”\n“Even if an arbitrator makes mistakes of fact or law, we may not disturb an award so long as he acted within the bounds of his bargained-for authority,” read the initial decision by the second circuit’s three-judge panel overturning an earlier judge’s ruling siding with Brady. Judge Robert Katzmann, the senior jurist on the circuit, dissented. Citing Goodell’s “shifting rationale,” Katzmann opined: “I believe there are significant differences behind the limited findings in the Wells Report and the additional findings the Commissioner made for the first time in his written final decision.”\nNFL Commissioner Roger Goodell suspended Brady for four games, alleging the quarterback knew of a scheme to deflate footballs in the AFC Championship Game in early 2015 against the Baltimore Colts. The league’s fact-finding process and the facts it presented came under fire by Brady’s legal team, football fans, and scientists.\nWhile the referee of the game testified that he used a gauge whose subsequent calibration precluded the notion of a deflation scheme, NFL investigator Ted Wells opted to disbelieve the official and go with the opposite of what he said without any adequate explanation for his strange decision. Troy Vincent, head of football operations for the NFL, admitted at Brady’s appeal at league headquarters that he and other NFL officials remained ignorant of the Ideal Gas Law at the time his employees confiscated Patriots balls and alleged cheating. Though Goodell repeatedly called Wells an “independent investigator,” the league cited attorney-client privilege a half dozen times during Brady’s appeal in the league office to prevent his lawyers from obtaining notes and material pertinent to the case.\nBrady hopes these and other problems with the NFL’s case convinces the Supreme Court to hear his case.","url":"https://www.breitbart.com/sports/2016/07/13/tom-bradys-deflategate-appeal-denied-by-federal-court/"}
