{"authors":["Daniel J. Flynn"],"date_download":"2018-10-30 19:49:45","date_modify":"2018-10-30 19:49:45","date_publish":"2016-05-23 13:35:54","description":"Tom Brady files an appeal in the Deflategate case today, and the gridiron winner does so adding a courtroom winner as a teammate. | Sports","filename":"data/vaneerConsumption/TomBradywithTedOlsononHisSideFilesDeflategateAppealToday.json","image_url":"https://media.breitbart.com/media/2016/05/wi/ap_tom-brady_ap-photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2016_05_23__1540928985.html","title":"Tom Brady, with Ted Olson on His Side, Files Deflategate Appeal Today","title_page":"Tom Brady, with Ted Olson on His Side, Files Deflategate Appeal Today | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tom Brady files an appeal in the Deflategate case today, and the gridiron winner does so adding a courtroom winner as a teammate.\nTed Olson, the former U.S. solicitor general who argued for the victor in Bush v. Gore before the U.S. Supreme Court, joins Brady’s legal team seeking to invalidate his punishments meted out by NFL Commissioner Roger Goodell.\n“The facts here are so drastic and so apparent that the court should rehear it,” Olson told Good Morning America. He seeks an en banc hearing of all thirteen judges of the U.S. Court of Appeals for the Second Circuit.\nThe commissioner suspended Brady four games for alleged knowledge of a “more probable than not” scheme to let the air out of footballs prior to the AFC Championship Game against the Indianapolis Colts in early 2015. A federal judge initially sided with Brady. But in April, a three-judge panel ruled by a 2-1 majority that Brady should serve out the suspension.\n“Even if an arbitrator makes mistakes of fact or law, we may not disturb an award so long as he acted within the bounds of his bargained-for authority,” read that decision.\nJudge Robert Katzmann dissented. Citing Goodell’s “shifting rationale,” Katzmann, the chief judge for the U.S. Court of Appeals for the Second Circuit, wrote: “I believe there are significant differences behind the limited findings in the Wells Report and the additional findings the Commissioner made for the first time in his written final decision.”\nIt’s likely that Brady’s team focuses on that shifting logic from the same commissioner reviewing the fairness of his initial decision, rather than the NFL investigation’s bizarre decision to disbelieve the crucial testimony of the AFC Championship Game’s referee on what gauge he used to measure ball pressure or the league’s admission of its ignorance of the Ideal Gas Law that posits that cold weather depressurizes inflated items, to make its case on appeal.\n“He appointed himself to review his own decision,” Olson told GMA about Goodell. “Then he affirmed his own decision on different grounds than he specified the first time around.”","url":"https://www.breitbart.com/sports/2016/05/23/tom-brady-files-deflategate-appeal-today/"}
