{"authors":["Daniel J. Flynn"],"date_download":"2018-10-30 19:54:01","date_modify":"2018-10-30 19:54:01","date_publish":"2016-07-15 18:55:49","description":"Tom Brady announced via social media that he does not plan to appeal the decision upholding his four-game suspension to the U.S. Supreme Court. | Sports","filename":"data/vaneerConsumption/TomBradyAgreestoServeFourGameDeflategateSuspension.json","image_url":"https://media.breitbart.com/media/2015/08/ap_tom-brady-wes-horton_ap-photo-1024x745.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2016_07_15__1540929241.html","title":"Tom Brady Agrees to Serve Four Game Deflategate Suspension","title_page":"Tom Brady Agrees to Serve Four Game Deflategate Suspension | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tom Brady announced via social media that he does not plan to appeal the decision upholding his four-game suspension to the U.S. Supreme Court.\n“I’m very grateful for the overwhelming support I’ve received from Mr. Kraft, the Kraft family, coach Belichick, my coaches and teammates, the NFLPA, my agents, my loving family and most of all, our fans,” the four-time Super Bowl winner wrote on Facebook. “It has been a challenging 18 months and I have made the difficult decision to no longer proceed with the legal process. I’m going to work hard to be the best player I can be for the New England Patriots and I look forward to having the opportunity to return to the field this fall.”\nThe decision comes as a gift to the Arizona Cardinals, Miami Dolphins, Houston Texans, and Buffalo Bills. They likely face Brady backup Jimmy Garoppolo. The three-time Super Bowl MVP returns Week Five against the Cleveland Browns.\nNFL Commissioner Roger Goodell suspended Tom Brady for four games in the wake of the AFC Championship Game against the Indianapolis Colts in early 2015. The decision relied on the Wells Report, which found it “more probable than not” that Brady knew of a scheme to deflate game balls below the legal limit. Investigator Ted Wells chose to believe the opposite of what the game’s referee testified regarding which gauge he used to measure pressure prior to the game. Balls measured at halftime came in at the expected, natural range when referenced back to the gauge referee Walt Anderson said he used. Goodell upheld his own decision on appeal, a process which saw the NFL invoke attorney-client privilege six times when Brady’s lawyer asked questions of Ted Wells, a man Goodell had earlier referred to as an “independent investigator.” The league’s head of football operations admitted the NFL’s ignorance of the Ideal Gas Law — which expects deflation when balls move from warmer to colder environments — in this league appeal.\nBrady hoped such problems with his suspension would give him a favorable solution in court.\nBrady won his case in federal court only to watch a three-judge panel overturn the verdict in a 2-1 split decision. He failed to entice the 13-judge Second Court of Appeals to agree to hear his case en banc. The U.S. Supreme Court stood as his final option. But that looked like a hail mary. So, the quarterback opted to kneel on the ball.","url":"https://www.breitbart.com/sports/2016/07/15/tom-brady-agrees-to-serve-four-game-deflategate-suspension/"}
