{"authors":[],"date_download":"2018-10-30 14:29:25","date_modify":"2018-10-30 14:29:25","date_publish":"2017-03-29 17:21:00","description":"The six-bedroom Buckhead home Tom Cruise leased was featured in his 2017 movie \"American Made.\"","filename":"data/vaneerConsumption/TomCruiseLionelRichieoncelivedonthis349MBuckheadproperty.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/29/Images/5814271_13_1489504837.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_photos-tom-cruis_288884780a070e5baa8005ff9ea5a7b0__1540909765.html","title":"Tom Cruise, Lionel Richie once lived on this $3.49M Buckhead property","title_page":"Tom Cruise, Lionel Richie once lived on this $3.49M Buckhead property","title_rss":"NULL","source_domain":"ajc.com","text":"Ever wondered what it would be like to live in a house where a movie was filmed?\nIf you have $3.49 million, you can find out.\nA house that Tom Cruise leased is for sale in Buckhead. The home sits on 3.8 acres of gated property and is featured in the film “American Made” – a movie starring Cruise, Caleb Landry Jones (“Get Out”) and Jayma Mays (“Glee”). The film is based on the life of Barry Seal, a pilot turned drug smuggler for Pablo Escobar. It is set to hit theaters in September.\nTom Cruise leased this Buckhead home while filming \"American Made\" (Harry Norman Realtors)\nThe six-bedroom all-stone main house features a vaulted foyer, river rock fireplaces, a gourmet kitchen, a gym and a media room. Also on the property is a two-bedroom, 2.5-bath guest cottage.\n(Harry Norman Realtors)\nIn total, the main home features 7.5 baths. A four-car garage is also attached.\nThe property was originally owned by Lionel Richie, an Academy Award and Grammy winner. The house that was first on the property was replaced by the current one in 2000.\nHarry Norman Realtors\nA salt-water pool and hot-tub are some of the featured amenities. There is a pool house with a full kitchen, fireplace and full bathroom. When Richie lived on the property, the pool house was his recording studio.\n(Harry Norman Realtors)\nCruise may have gotten his game on while living there, as the property also has a lighted tennis court and a sports court with a basketball hoop.\n(Harry Norman Realtors)\nThe home was built in 2000 and last sold in September 2015 for $2.85 million, according to Zillow.\nIt is listed by Russell A. Gray of Harry Norman Realtors. For more information, visit harrynorman.com. A virtual tour of the property can be seen here.","url":"https://www.ajc.com/news/local/photos-tom-cruise-lionel-richie-once-lived-this-49m-buckhead-property/xFSawq1eGmib5OCZ0UxTCL/"}
