{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 00:53:41","date_modify":"2018-10-23 00:53:41","date_publish":"2017-03-10 08:06:02","description":"Tom Hanks, 60, looked like he was having a blast with longtime wife Rita Wilson, 60, as they left dinner with friends in Santa Monica on Thursday night.","filename":"data/vaneerConsumption/TomHanksandRitaWilsonlookhappygrabbingdinner.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/07/3E2184F600000578-0-image-a-39_1489131546712.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300252_Tom-Hanks-Rita-Wilson-look-happy-grabbing-dinner_1540256021.html","title":"Tom Hanks and Rita Wilson look happy grabbing dinner","title_page":"Tom Hanks and Rita Wilson look happy grabbing dinner | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They have one of Hollywood's most longest marriages.\nAnd Tom Hanks, 60, looked like he was having a blast with wife Rita Wilson, 60, as they left dinner with friends in Santa Monica on Thursday night.\nThe couple, who have almost been married for 30 years, looked happy and content as they left Giorgio Baldi Restaurant together and got into the car with Tom at the wheel.\nWhat's their secret? Tom Hanks, 60, looked like he was having a blast with longtime wife Rita Wilson, 60, as they left dinner with friends in Santa Monica on Thursday night.\nRita was the epitome of class in a crisp white knee-length jacket that she paired with leather pants and high heeled shoes.\nThe actress couldn't seem to keep a smile off her face as she exited the building and made her way to the car.\nShe paired the leather pants with a black shirt and completed her elegant look with a large gold chain around her neck.\nThe mother-of-two looked way less than her 60 years as she opted for a fresh face with very little makeup.\nGreat style! Rita was the epitome of class in a crisp white knee-length jacket that she paired with leather pants and high heeled shoes\nHer honey-blonde hair was styled to perfection in loose waves around her face and her broad smile lit up the entire sidewalk.\nFor his part, Tom looked sophisticated and handsome in a pair of black slacks and a green sweater that he paired with a grey t-shirt underneath.\nHe kept warm in the cool Los Angeles night temperatures in a olive green jacket and held money in his hand, presumably to tip the valet attendant.\nHe's got class: Tom looked sophisticated and handsome in a pair of black slacks and a green sweater that he paired with a grey t-shirt underneath\nTom completed his look with a pair of freshly shined brown leather shoes.\nOnce the duo said goodbye to their dining party, they hopped into their SUV where Tom took control of the wheel and drove the duo home.\nThey also had a couple passengers in the back seat who they were presumably giving a ride home.\nTaking the lead: Once the duo said goodbye to their dining party, they hopped into their SUV where Tom took control of the wheel and drove the duo home\nThe couple recently took lent their support to the Women's Cancer Research Fund gala in Beverly Hills last month.\nThe Saving Private Ryan star and his wife - who were co-chairs of the event - in recent years have been major celebrity advocates in the battle against cancer, with Rita opening up in 2015 that she underwent a double mastectomy after being diagnosed with breast cancer that spring.\nRita said her supportive husband Hanks helped her 'get it all done' when she needed his help the most.\nThe Forest Gump actor - who's proven over and over to be one of Hollywood's most genuine, down-to-earth stars - told the show he learned that the experience is one no one should go through without the proper support.\n'No one should go through this alone,' he said. 'That not only goes for the person who is carrying it and in bed for a very long time, but there's also the people who love them.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300252/Tom-Hanks-Rita-Wilson-look-happy-grabbing-dinner.html"}
