{"authors":["Alexandra Genova For Dailymail.Com"],"date_download":"2018-10-23 03:11:37","date_modify":"2018-10-23 03:11:37","date_publish":"2016-01-29 17:59:11","description":"The 59-year-old actor - who has been in the business for 36 years - has moved up four places from last year. Depp comes in behind and the first woman in the list is Sandra Bullock at number six.","filename":"data/vaneerConsumption/TomHanksisAmericasfavoritemoviestarforthefifthtime.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B46A4E00000578-0-image-a-87_1454088617373.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422989_Hollywood-heavyweight-Tom-Hanks-America-s-favorite-movie-star-fifth-time-36-years-business_1540264297.html","title":"Tom Hanks is America's favorite movie star for the fifth time","title_page":"Tom Hanks is America's favorite movie star for the fifth time | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tom Hanks has been named America's favorite star for the fifth time.\nThe Hollywood heavyweight - who has been in the business for an impressive 36 years - topped the annual Harris Poll survey followed closely by enduring heart-throb Johnny Depp.\nHanks, whose latest film 'The Bridge of Spies' is up for six Oscars, also came first in 2002, 2004, 2005 and 2013.\nTom Hanks, who won a Best Actor Oscar for his role in Forest Gump (left) has moved up four places from last year to be crowned number one. The Hollywood heavyweight is also well known for his role in the 1988 hit film Big (right)\nWhile he isn't up for an Oscar this year, his most recent release - Bridge of Spies, pictured - has been nominated for six\nThe 59-year-old actor from California jumped four places from last year and the cold war epic where he plays American lawyer James Britt Donovan, may have something to do with it.\nHe is also well-loved for his roles in Apollo 13, Saving Private Ryan and as the voice of woody in Pixar's first animation film, Toy Story.\nDepp jumped two places from last year's poll.\nHis recent film 'Black Mass', where he portrays notorious gangster Whitey Bulger, was critically acclaimed but snubbed in the Best Film category for this year's Oscars.\nJohnny Depp comes in at number two and was critically acclaimed for his role as notorious gangster Whitey Bulger in 2015 film Black Mass (pictured)\nDepp's popularity comes despite him being labeled Hollywood's least bankable actor, after it was revealed that he returns just $1.80 at the box office for every $1 he is paid.\nCompare that to Hollywood's most bankable male star Chris Evans, who makes $181.80 per $1, and it's clear that the public's perception of their favorite star has little to do with financial success.\nNeither Hanks nor Depp are up for a best actor Oscar, despite the buzz surrounding their 2015 films when they were first released.\nDenzel Washington is number three overall but is also the favorite in the Midwest of America and among 'Urbanites' and among those who support the Democrats. Despite his death 36 years ago, John Wayne's popularity endures and he is the only actor to remain in the top ten for over two decades\nHarrison Ford comes in fifth, shooting up four places from last year, presumably thanks to his part as Hans Solo in the much anticipated Star Wars: The Force Awakens film (pictured above)\nBut Hanks already has some Oscars under his belt and won Best Actor for Forrest Gump and Philadelphia.\nAlso in the top ten this year is Denzel Washington who comes in third, falling two places from his top spot last year.\nJohn Wayne, who died aged 72 in 1979, is in fourth place and is the only person who has never dropped off the top 10 in over two decades.\nHarrison Ford comes in fifth, shooting up four places from last year, presumably thanks to his part as Hans Solo in the much anticipated Star Wars: The Force Awakens film.\nThe first woman on the list is Sandra Bullock, at number six, followed by Jennifer Lawrence.\nSandra Bullock is the first woman in the list at number six while Jennifer Lawrence comes in next at number seven, where she remains from last year\nTwo of Hollywood's most loved female actors have dropped off this year's top ten: Meryl Streep drops off the list after a number seven showing last year, while Angelina Jolie drops off after holding the number ten spot last year.\nThe survey also reveals which demographic finds who most popular.\nUnsurprisingly, John Wayne is the top pick among men, while women show love for Johnny Depp.\nDepp is also popular with Millennials while Gen Xers rate Harrison Ford and Baby Boomers go for Tom Hanks.\nThe Harris Poll has conducted a survey of America's favorite actors since 1994. The above table shows the results from the last ten years\nJohn Wayne is the favorite among Matures.\nRegionally, Harrison Ford takes the East, Johnny Depp rules the South, Denzel Washington commands the Midwest and Tom Hanks is on top in the West.\n'Urbanites' favor Washington, while 'Suburbanites' cite Hanks as their number one, while Depp takes the top spot among 'Rural Americans'.\nAnd while politics may not inform people's decision, John Wayne, is the Republicans’ top pick, while Democrats prefer Washington.\nIndependents chose Harrison Ford.","url":"https://www.dailymail.co.uk/news/article-3422989/Hollywood-heavyweight-Tom-Hanks-America-s-favorite-movie-star-fifth-time-36-years-business.html"}
