{"authors":["Neil Munro"],"date_download":"2018-10-30 19:08:07","date_modify":"2018-10-30 19:08:07","date_publish":"2018-08-06 05:30:18","description":"\"The Left Has Gone way Overboard,\" former ICE Chief Tells Breitbar.","filename":"data/vaneerConsumption/TomHomanLeftsDemandforAbolishICEMeansOpenBorders.json","image_url":"https://media.breitbart.com/media/2017/12/GettyImages-886264880.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_05__1540926487.html","title":"Tom Homan: Left's Demand for 'Abolish ICE!' Means Open Borders","title_page":"Tom Homan: Left's Demand for 'Abolish ICE!' Means Open Borders | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Left-wingers are exposing their support for open borders as they compete to show their opposition to the immigration agencies, says Thomas Homan, the former director of the U.S. Immigration and Customs Enforcement agency.\n“I think the Left has gone way overboard,” Homan told Breitbart News Sunday on XM’s Patriot Channel.\nEvery day I hear something new. It is like a contest now, who can go further to the left? Now we have an [Attorney General] candidate in New York saying “Let’s prosecute ICE agents!“So it is ridiculous. I hope the American people are paying attention because the far Left is finally showing who they really are — they want open borders, they don’t want to enforce the laws that are in this country.\nThe calls to “Abolish ICE!” are thinly disguised calls to open the border to waves of foreign migrants, Homan said. Should Congress abolish ICE, he said, then:\nIf you are [a migrant who is] lucky enough to get by the Border Patrol and get into the United States, there will be no-one looking for you there is no ICE. If you actually get caught by the Border Patrol and request an [asylum] hearing in front of a judge, and you get released until that hearing, and let’s say the judge orders you removed, and so you’ve got a final order [of deportation], no-one is going to enforce that order because there is no ICE. If you get a visa to come to the United States and you overstay that visa, no-one will be looking for you. So what does that mean? That means open borders.\nICE also combats the people who smuggle drugs into the country and the people who try to smuggle U.S. military-related technology out to other countries, said Homan, who retired this summer. “It is a huge issue… I’m going to talk about this as much as I can.”\nICE also reduces the illicit employment of illegal migrants, he said. As ICE revs up worksite enforcement, employers are forced to hire Americans. Once employers “don’t have an illegal immigrant workforce, it has increased the working wage” for Americans and legal immigrants, he said.\n“The left [is] calling for the abolishment of ICE and I’m glad they’re actually saying it because I think they’re opening themselves, they are actually admitting for the first time in a long time they want open borders,” he said.\n“To abolish ICE would be to open borders.”","url":"https://www.breitbart.com/politics/2018/08/05/tom-homan-abolish-ice-means-open-borders/"}
