{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:39:05","date_modify":"2018-10-30 21:39:05","date_publish":"2016-02-23 08:05:02","description":"Back in Nov.","filename":"data/vaneerConsumption/TomMurphysettoopenMorningsideKitcheninearlyApril.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_to_5b6b09cdb0c83e440fcb42ba38bd7ee2__1540935545.html","title":"Tom Murphy set to open Morningside Kitchen in early April","title_page":"Tom Murphy set to open Morningside Kitchen in early April","title_rss":"NULL","source_domain":"ajc.com","text":"Back in Nov. 2015, Tom Murphy and the team behind Murphy’s in Virginia-Highland and Paces & Vine in Vinings expanded its restaurant group with the acquisition of the former Rosebud space in Morningside .\nNow comes news of the the name and the opening date of the new concept, with Morningside Kitchen officially set to open at 1397 N. Highland Ave. N.E. in the Morningside Shopping Centre in early April, serving dinner nightly and weekend brunch.\nAccording to a press release, \"Crafted sides and seasonal vegetables will complement wood- grilled fish and steaks, charcoal rotisserie chicken, and snacks made to share.\"\nMore details from the release:\nMorningside Kitchen is a collaboration between famed Atlanta restaurateur Tom Murphy, culinary director Ian Winslade, and managing partner Tom Harvey. Murphy explains, “After patiently cultivating the ideal team to grow on North Highland Avenue, we are ready! Morningside Kitchen will offer a fresh menu of wood-fired classics and brunch favorites in a beautiful new setting, with the genuine hospitality that keeps our friends coming back.”\nHarvey served as Executive Chef at Murphy’s until 2011, when he joined Eddie V’s Prime Seafood, opening their flagship location in Scottsdale, Arizona. Happy to be back home in Atlanta, Harvey is “so excited to be back in business with Tom Murphy. He has been a loyal mentor and friend, and I jumped at the opportunity to help bring this amazing new dining experience to the neighborhood. Morningside Kitchen will be the place for our guests to stop by often and linger over delicious cuisine and drinks at an exceptional value.”\nThe kitchen, led by Chef de Cuisine Bhavesh Patel, is anchored by a wood-burning grill and charcoal rotisserie. Beverage Director Dan Givens creates the progressive seasonal cocktail list, featuring housemade shrubs and bitters, with two signature cocktail recipes on\ndraft. Morningside Kitchen also features craft beer on tap and an accessible list of unique, value-driven wine selections.\nReservations are accepted for weekend brunch on Saturday and Sunday, with a menu built on cage-free eggs, local bacon and sausage, and locally roasted espresso. Says Harvey, “Brunch is an essential part of the weekly life of Morningside, and we are giving our neighborhood the perfect place to relax and recharge on the weekends.”\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook and following Atlanta Dining on Twitter.\nRead the AJC Fall Dining Guide, Atlanta Around the Clock, here.","url":"https://www.ajc.com/blog/atlanta-restaurants/tom-murphy-set-open-morningside-kitchen-early-april/QQBGbF9E0rqTDugXcrq4yN/"}
