{"authors":["Jack Montgomery"],"date_download":"2018-10-30 18:26:29","date_modify":"2018-10-30 18:26:29","date_publish":"2018-07-16 11:42:33","description":"Geert Wilders spoke to a 'Free Tommy Robinson' rally in London over video link, after the British Govt prevented him from attending in person","filename":"data/vaneerConsumption/TommyRobinsonDoesntDeservePrisonHeDeservesaMedal.json","image_url":"https://media.breitbart.com/media/2018/07/Geert.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_16__1540923989.html","title":"'Tommy Robinson Doesn't Deserve Prison, He Deserves a Medal'","title_page":"Geert Wilders: 'Tommy Robinson Doesn't Deserve Prison, He Deserves a Medal'","title_rss":"NULL","source_domain":"breitbart.com","text":"Geert Wilders, who leads the Freedom Party in the Netherlands, spoke to a ‘Free Tommy Robinson’ rally in London by video link after the British government prevented him from attending in the flesh.\nThe Dutchman, who delivered a speech in person at a June rally, placed second in the national elections last year, but as a prominent and strident critic of Islam has been living under a fatwa death warrant — and 24 hour police protection — for years.\nHowever, the British authorities not only told their Dutch counterparts that they would not protect Wilders, but also refused to issue weapons permits to the Dutch diplomatic police, stopping him from making a second trip.\n“Mrs May prevented me [from coming] to London today,” he told rally attendees in a prerecorded message.\n“She probably didn’t like my speech last time. Shame on you, Mrs May.”\nUK Ambassador in The Hague just informed the Dutch authorities that they will not provide for my security in London this Saturday and will not give the Dutch diplomatic police weapon permits either, so unfortunately I cannot attend nor speak at the #FreeTommy rally in London. pic.twitter.com/T9Hjal4Yjq — Geert Wilders (@geertwilderspvv) July 11, 2018\nWilders also took the British Prime Minister to task over what he described as her failure to tackle the grooming gangs which Robinson was imprisoned for reporting, allegedly because a juror hearing the activist express or imply a view on a suspect’s guilt might hopelessly prejudice their trial.\n“You did not act against the massive rape of young English girls. You allowed Tommy Robinson to be imprisoned. Your government betrayed our daughters. Your government betrayed our trust. Your government betrayed the people,” he accused.\n“And worst of all, Mrs Theresa May, your government betrayed Tommy Robinson.\n“My friends, I ask you: Is this how you want your country to be governed?” he demanded.\n“Tommy Robinson did not deserve jail. Tommy deserved a medal! He did what the media failed to do. He did what the British government should have done. He exposed child rapists. He fought for our children.\n“But the establishment wants to silence him, because the establishment wants to silence all of us!”\nEXCLUSIVE — Congressman Gosar: U.S. Should Intervene over ‘Persecution’ of Tommy Robinson https://t.co/yl52PsqPJ3 — Breitbart London (@BreitbartLondon) June 15, 2018\nThe Dutch MP warned that “all over Western Europe, our governments are turning out countries into provinces of the Middle East and Africa,” and claimed the political classes had deliberately “opened our borders to mass immigration and Islamisation”.\nThe end result, in his view, is that Europeans are “losing our countries, our culture, our identity, our freedom, and our children are no longer safe.”\n“And now they have started jailing those who object,” he added.\n“Here is our message to the peoples of Europe: Do not despair! The darkest hour is just before dawn, and it is almost dawn. We are going to reclaim our countries,” he vowed, promising Robinson’s supporters would “never abandon” him.\nFollow Jack Montgomery on Twitter: @JackBMontgomery","url":"https://www.breitbart.com/europe/2018/07/16/geert-wilders-tommy-robinson-doesnt-deserve-prison-deserves-medal/"}
