{"authors":["Tom Utley For The Daily Mail"],"date_download":"2018-10-22 22:45:38","date_modify":"2018-10-22 22:45:38","date_publish":"2017-03-10 01:29:23","description":"I read to my astonishment that this massive depository of fabrication has banned the Daily Mail as a source of information for its compilers. I almost choked on my breakfast coffee, writes TOM UTLEY.","filename":"data/vaneerConsumption/TomUtleyknowswhyWikipediapublishesanyoldnonsense.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/2593830700000578-0-image-a-39_1489109098998.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-4299492_Tom-Utley-knows-Wikipedia-publishes-old-nonsense_1540248338.html","title":"Tom Utley knows why Wikipedia publishes any old nonsense","title_page":"Tom Utley knows why Wikipedia publishes any old nonsense | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"One of my boys, Wikipedia informed me — and I leave the language and spelling as it appeared: ‘Is a proper belta at smokin tac.’ Another was ‘currently havin an affair with Myleene “sideboob” funbags Klass...’\nAnyone reading my Wikipedia entry a few months after I joined this newspaper would have learned some interesting things about me — or, rather, about my offspring.\n‘Tom Utley,’ it said, ‘is a British journalist who currently writes a witty weekly column for the Daily Mail.’ (I confess I liked the adjective ‘witty’, though I realise readers may question its truth in this context). It went on: ‘He is the son of the distinguished journalist T. E. Utley.’ So far, so good.\nBut then it became more controversial. ‘He is the proud father of four sons,’ it said — and I wondered about that word ‘proud’. Yes, my wife and I love our four sons dearly and I’ve often been proud of them. But like many fathers, I suspect, I’ve also experienced moments when my progeny have made me feel less so.\nSuch a moment came as I read on. One of my boys, Wikipedia informed me — and I leave the language and spelling as it appeared: ‘Is a proper belta at smokin tac.’\nAnother was ‘currently havin an affair with Myleene “sideboob” funbags Klass . . .’ A third was described as ‘MDMAzin’. As for the fourth: ‘There are rumours he was caught fornicating with a dead brown bear that was actually black. Funny that.’\nCall me a po-faced curmudgeon, but I didn’t find it funny at all — especially when I looked up the word ‘tac’ and found it was North-East slang for cannabis resin, while MDMA is the active ingredient in ecstasy.\nNow, I was as sure as it’s possible to be that our sons didn’t take illegal drugs, while I knew for a fact that none had met Myleene Klass — let alone had an affair with her.\nAs I hope should go without saying, I also knew that our youngest, then aged 14, had not the slightest romantic interest in dead bears, whatever their colour.\nNo, this was what would nowadays be called ‘fake news’ — one of those silly teenage pranks with which Wikipedia was riddled, then as now — and I had a shrewd idea that its author was very close to home.\nI read to my astonishment that this massive depository of fabrication has banned the Daily Mail as a source of information for its compilers. But there it was, in black and white in the Guardian, on whose board happens to sit Wikipedia’s founder, Jimmy Wales, whose wife was Tony Blair’s diary secretary\nI cross-examined the four boys. Sure enough, one confessed his guilt and then deleted the offending material. In the event, as Wikipedia devotees were quick to point out when I mentioned this incident many years ago, the lad’s puerile nonsense survived only 12 days.\nBut God knows how long it would have remained on my page if I hadn’t stumbled across it while Googling myself (a dreadful habit, I know).\nAnyway, I thought no more about it until a month ago when I read to my astonishment that this massive depository of fabrication has banned the Daily Mail as a source of information for its compilers.\nI almost choked on my breakfast coffee. But there it was, in black and white in the Guardian, on whose board happens to sit Wikipedia’s founder, Jimmy Wales, whose wife was Tony Blair’s diary secretary.\nTrue, the ban had been approved by only five ‘administrators’ and 53 of the site’s 30 million ‘editors’ — or only 0.00018 per cent of them.\nBut here was the allegedly politically neutral Wikipedia, which publishes any old rubbish with impunity, impugning a highly popular mainstream newspaper — a paper fully answerable to the courts and the toughest Press regulatory regime in the free world, for every word and fact it prints.\nWas there ever a more blatant example of hurling stones from a glass house? The sheer cheek of it knocked me sideways.\nYet unbelievably (in every sense), Wikipedia has become the first and often the only port of call for billions of people looking for facts, with 269 million visits every day.\nCould Sir Tim Berners-Lee ever have imagined, I wondered, that one of the effects of his invention of the internet would be that such a purveyor of dodgy assertions and outright falsehoods would become the world’s number one source of information?\nIndeed, the question has set me thinking about some of the other, perhaps unforeseen consequences of the marvels of the electronic age.\nI’m not such a fool that I can’t see the plus side of online shopping, sat nav, email, Skype, Kindle, mobile phones, translation apps and the rest. But as the years go by, we learn more and more of the downsides, and the profound effects of such wonders on human conduct for better or worse.\nTrue, the ban had been approved by only five Wikipedia ‘administrators’ and 53 of the site’s 30 million ‘editors’ — or only 0.00018 per cent of them\nTake the sharp decline in teenage pregnancies, which has been attributed at least in part to the young’s preference for virtual sex over the real thing.\nThey’re forever sexting each other, exchanging photos of their private parts. But apparently it’s increasingly rare for them to get close enough to make a baby.\nMore predictable, I suppose, has been the pressure on my own industry from unregulated websites, which not only spread vile pornography, terrorist training videos and fake news, but draw advertising away from the Press.\nFirst to suffer, of course, have been financially insecure local newspapers — too many of which have been driven to the wall.\nDid Sir Tim foresee that his invention would mean local court cases and council decisions going increasingly unreported?\nAnd who could have predicted the rise of the cyberbully and the internet troll, who compete behind the shield of anonymity to post the nastiest remarks they can imagine — causing an epidemic of depression, particularly among young girls and, even more annoying, thick-skinned, old hacks like me? It’s been a shock to realise human nature can be so twisted.\nIndeed, as I wade through the vitriol often directed at my columns, I almost welcome my old friend ‘Phil of Maidstone’, who likes to post the one-word critique: ‘Yawn’. I imagine him as a 15- year-old, so exhausted by self-abuse that he can just about manage to read the headline before leaving his magisterial four-letter comment and falling back into a comatose slumber.\nMeanwhile, easily available, dehumanising internet porn has put temptation in the way of many who would never pluck up the courage to walk into a newsagent and ask for a dirty mag. No wonder we’ve seen a boom in sex crime — particularly since networks such as Facebook, as the BBC revealed this week, refuse to delete pages explicitly aimed at paedophiles.\nAs for other phenomena, attributable in whole or part to the electronic age, well, here are just a few: the Arab Spring and similar bloody uprisings, co-ordinated through social media; the slow death of the High Street, killed off by online retailers; the threat to the traditional cab trade from app-oriented firms such as Uber.\nAlso, the wildfire spread of cyberfraud; the loss of skills such as spelling and map-reading, rendered redundant by auto-correct and sat nav; the mobile’s role in facilitating adultery — and the electronic trail that makes sinners easier to detect; the rise of the Twitterstorm, giving spurious weight to phoney grievances; the fragmentation of society, as people retreat into separate filter bubbles, where their prejudices are never challenged … And so it goes on.\nI happen to be reading the brilliant Sapiens: A Brief History Of Humankind by the Hebrew University lecturer Yuval Noah Harari. In it, he argues that the rot set in for the human race about 10,000 years ago, when our hunter-gatherer ancestors turned to farming.\nThis meant a longer and more arduous working day, a less varied and, therefore, less healthy diet — and more disease and violence, as settlements became larger and for the first time had permanent territories to attack and defend.\nI’m not enough of an expert to judge if he’s right — and I won’t be checking on Wikipedia. But if his point is that scientific progress isn’t necessarily for the better, I’m with him every inch of the way.","url":"https://www.dailymail.co.uk/debate/article-4299492/Tom-Utley-knows-Wikipedia-publishes-old-nonsense.html"}
