{"authors":["Leith Huffadine For Daily Mail Australia"],"date_download":"2018-10-22 20:26:03","date_modify":"2018-10-22 20:26:03","date_publish":"2016-01-28 01:16:45","description":"An Australian university student fed up with Centrelink's customer service found a contacts for the Department of Human Services' senior staff and took his complaints to the top.","filename":"data/vaneerConsumption/TomWaderingsAustraliangovernmentabouthisCentrelinkproblems.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30A617CB00000578-0-image-a-17_1453944591384.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420028_Man-uses-government-phone-directory-ring-executives-problems-Centrelink_1540239963.html","title":"Tom Wade rings Australian government about his Centrelink problems","title_page":"Tom Wade rings Australian government about his Centrelink problems | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A former university student has done what every person stuck on hold while calling Centrelink has dreamed of - going straight to the top and dealing with the boss.\nTom Wade, 23, had been struggling to contact the Australian government service regarding his youth allowance payments, which had been cancelled, but instead of battling it out in call waiting, he found an internal government phone directory and contacted senior staff with his issues.\nShortly after, his problems were resolved.\nTom Wade, 23, decided he would take his problems up with Centrelink by going straight to the management\nTom Wade, 23, was struggling to have problems with Centrelink resolved, so he went straight to the top and dealt with managers at the government's Department of Human Services\nMany people can likely relate to Mr Wade, who spent long stretches time on hold waiting to talk to somebody\nHe had used the Australian Government Directory to contact Department of Human Services (DHS) managers personally and even had the 'lady in charge of Medicare' ask him how he got her number, he told The Canberra Times.\nMr Wade is now encouraging people to do the same, saying those in charge should take responsibility.\nAfter getting started by using the internet to find out who senior staff at the DHS were, he came across the government directory.\nThen, he searched them online and came up with their contact details.\nHe turned his attention to the DHS national manager of service delivery performance and analysis, Brendan Jacomb.\nMr Wade had a break through when he found a contact directory for senior staff at the Department of Human Services\n'I got through to him directly and he's the one to who I started dishing out the (performance) targets from the department's annual report,' Mr Wade told The Canberra Times.\n'He was caught a bit off guard about that, kinda surprised, but he said they'd get back to me about the details.'\nThe problem that had caused his payments to be cut off was fixed, but Mr Wade was not finished.\nHe also had to correct details of his Medicare account, so went straight to 'lady in charge', who demanded to know where he got her number.\n'She didn't know what to say to that, but she did forward me to the right people and I got straight through,' he told The Canberra Times.\nAs a result, she put him in touch with people who could help him.\nAlthough Mr Wade has now left university, he said people should use the same techniques he did.\nHis suggestion was to go right up the ladder, so if senior staff would not deal with an issue they would refer it to someone else to handle.\nDaily Mail Australia contacted the Department for Human Services for comment.","url":"https://www.dailymail.co.uk/news/article-3420028/Man-uses-government-phone-directory-ring-executives-problems-Centrelink.html"}
