{"authors":["Alicia Vrajlal For Daily Mail Australia"],"date_download":"2018-10-22 23:15:40","date_modify":"2018-10-22 23:15:40","date_publish":"2016-01-11 05:06:01","description":"Tom Waterhouse took a break from the racetrack on Sunday to spend some quality time with his family.","filename":"data/vaneerConsumption/TomWaterhouseandLukeRicketsonstepoutwiththeirtinytotsforafamilydayatthebeach.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/04/30015BB900000578-0-image-a-101_1452485188728.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393312_Tom-Waterhouse-Luke-Ricketson-step-tiny-tots-family-day-beach_1540250140.html","title":"Tom Waterhouse and Luke Ricketson step out with their tiny tots for a family day at the beach","title_page":"Tom Waterhouse and Luke Ricketson step out with their tiny tots for a family day at the beach  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tom Waterhouse took a break from the racetrack on Sunday to spend some quality time with his family.\nThe 33-year-old Australian bookmaker was spotted at Sydney's Balmoral beach and he proved to be quite the doting dad to his four-month-old son William during the outing.\nAs he took a leisurely stroll, Tom was joined by sister Kate's husband Luke Ricketson and one-year-old daughter Sophia Edie.\nDoting dad: Tom Waterhouse and Luke Ricketson were spotted with their children at Sydney's Balmoral Beach on Sunday\nDitching his professional suit and tie for a more relaxed ensemble, Tom was seen wearing a light blue polo shirt.\nHe teamed it with a pair of blue and white printed board shorts, as well as a dark blue cap to shield his face from the son.\nTom held his son in his arms as he walked along the pavement.\nFather and son: Bookmaker Tom was seen cuddling his four-month-old son William\nLittle treasures: Luke, who is the husband of Tom's sister Kate, held onto the couple's daughter Sophia Edie\nLittle William was as cute as a button, wearing a long-sleeved blue top teamed with printed bottoms.\nCoordinating with his father, the mini Waterhouse had a navy floppy hat on.\nHis mother Hoda and two-year-old sister Rose were also present for the day of family fun in the sun.\nMatching: Both Tom and little William were wearing beach ready blue ensembles\nFamily of four: Tom's wife Hoda and daughter Rose were also seen\nBrunette beauty Hoda showed off her svelte figure in a grey sleeveless blouse teamed with a pair of white shorts.\nBoth she and Tom did their best to keep a low profile with dark sunglasses though there was no chance of the couple flying under the radar thanks to their daughter's eye-catching outfit.\nRose sported a cute baby blue tutu attached to a mermaid tail, a nautical themed ensemble perfect for a beach day.\nCuddles: The happy family kept close as they made their way down the pavement\nCasual chic: Brunette beauty Hoda wore a sleeveless grey top teamed with white shorts\nMeanwhile like Tom, Kate's husband Luke enjoyed cuddling young daughter Sophia during the beachside stroll.\nMaking the most of the golden rays, 42-year-old Luke went shirtless, wearing simply a pair of blue and white printed board shorts and comfortable thongs.\nLittle Sophia was seen wearing a bright yellow swimsuit featuring white spots, and was wrapped in a cool towel as she relaxed in her father's arms.\nTime for a dip: Later on Tom and Luke were seen getting ready to have a swim\nBoard shorts only: Both media personalities went shirtless\nLater on Tom and Luke decided to take a dip in the ocean, while Kate was seen by the shore with the kids.\nThe 32-year-old stunned in a sleek black swimsuit, her look complete with a pair of round black-rimmed sunglasses and a chic hat.\nKate and Luke, who tied the knot in June 2012, welcomed their first child Sophia into the world in May 2014.\nMeanwhile Tom and Hoda have been married since 2011.\nKeeping it cool: Tom simple wore a pair of blue and white printed board shorts","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393312/Tom-Waterhouse-Luke-Ricketson-step-tiny-tots-family-day-beach.html"}
