{"authors":["Press Association"],"date_download":"2018-10-23 03:18:05","date_modify":"2018-10-23 03:18:05","date_publish":"2016-01-28 18:38:50","description":"A suspected thief was found with 38 mobile phones stuffed down his trousers at a concert by rock band The Libertines. West Midlands Police arrested the man a...","filename":"data/vaneerConsumption/Toneitdownsuspectedthieffoundwith38mobilephonesstuffedintrousers.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-0dfe49b3-5dc5-447a-bf04-38712bdd7f91-2vdWmEltwXfba0ce28e632babd4b-738_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421383_Tone--suspected-thief-38-mobile-phones-stuffed-trousers_1540264685.html","title":"Tone it down - suspected thief found with 38 mobile phones stuffed in trousers","title_page":"Tone it down - suspected thief found with 38 mobile phones stuffed in trousers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tone it down - suspected thief found with 38 mobile phones stuffed in trousers\nA suspected thief was found with 38 mobile phones stuffed down his trousers at a concert by rock band The Libertines.\nWest Midlands Police arrested the man at Birmingham's Barclaycard Arena on Wednesday night and are appealing for gig-goers who had mobiles stolen to contact officers.\nThe man, 30, and another man of the same age, who was also arrested, were seen at the venue with their trousers taped closed at the bottom of the legs.\nCarl Barat (left) and Pete Doherty of The Libertines.\nThe arrests formed part of a proactive operation led by Birmingham Police, set up after intelligence suggested gig-goers had been targeted at another Libertines performance in Manchester.\nInspector Gareth Morris, who oversees local policing in the city, said: \"It's an unfortunate reality that large crowds at concerts such as this make rich pickings for career criminals.\n\"We're hot on the heels of these offenders but you can also reduce your chances of falling victim to such crimes by remaining extra vigilant when attending busy events.\n\"If you think you had your phone taken, please get in touch with us and we can check whether or not we have been able to recover it.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3421383/Tone--suspected-thief-38-mobile-phones-stuffed-trousers.html"}
