{"authors":["Heidi Parker For Dailymail.Com"],"date_download":"2018-10-23 02:41:47","date_modify":"2018-10-23 02:41:47","date_publish":"2016-01-11 15:05:24","description":"raxton seemed to want to make sure her fans got an eyeful of her curves as she hit the Weinstein Company Golden Globes After Party. The Un-break My Heart hit maker was nearly spilling out of her outfit.","filename":"data/vaneerConsumption/ToniBraxtonbralesswhileblowingkissesatNetflixGoldenGlobes2016afterparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300BAB2500000578-0-image-a-57_1452527408744.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394043_Toni-Braxton-goes-bra-free-nearly-spills-lace-blowing-kisses-GG-party_1540262507.html","title":"Toni Braxton braless while blowing kisses at Netflix Golden Globes 2016 after party","title_page":"Toni Braxton braless while blowing kisses at Netflix Golden Globes 2016 after party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is in incredible shape, especially considering she's 48-years-old.\nAnd singer Toni Braxton seemed to want to make sure her fans got an eyeful of her curves as she hit the Weinstein Company and Netflix Golden Globes After Party.\nThe Un-break My Heart hit maker was nearly spilling out of her white outfit.\nScroll down for video\nOn display: She is in incredible shape, especially considering she's 48-years-old. And singer Toni Braxton seemed to want to make sure her fans got an eyeful of her curves as she hit the Weinstein Company and Netflix Golden Globes After Party\nThe beauty leaned forward to blow kisses to onlookers and nearly had her chest come out of the lace top portion of her number.\nThe top was also very see-through and barely covered what was close to falling out.\nThe outfit was a jumpsuit with an opened front and zip-up slacks.\nSee more of the latest pictures and video updates from the 2016 Golden Globes after party\nThe look: The beauty leaned forward to blow kisses to onlookers and nearly had her chest come out of the lace top portion of her number\nNot shy: The top was also very see-through and barely covered what was close to falling out\nThe crooner was bra free and didn't seem at all self-conscious on the black carpet.\nBraxton seemed to be in ebullient spirits as well as she waved to fans and threw her arms in the air too.\nThe chart topper is best known in recent years for her stint on Dancing With The Stars and her reality show Braxton Family Values.\nDaring dame: The crooner was bra free and didn't seem at all self-conscious on the black carpet\nHere I am: Braxton seemed to be in ebullient spirits as well as she waved to fans and smiled","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394043/Toni-Braxton-goes-bra-free-nearly-spills-lace-blowing-kisses-GG-party.html"}
