{"authors":[],"date_download":"2018-10-30 20:26:30","date_modify":"2018-10-30 20:26:30","date_publish":"2015-11-02 22:33:46","description":"Commuting conditions continue to be hazardous this evening, as a day of heavy rain tapers to a misty, foggy mess that, because of the time change, also has darkness descending earlier.","filename":"data/vaneerConsumption/TonightscommuteAmistydarkeningmess.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_breaking-news_tonight-commute-misty-darkening-mess__1540931190.html","title":"Tonight’s commute: A misty, darkening mess","title_page":"Tonight’s commute: A misty, darkening mess","title_rss":"NULL","source_domain":"ajc.com","text":"Commuting conditions continue to be hazardous this evening, as a day of heavy rain tapers to a misty, foggy mess that, because of the time change, also has darkness descending earlier.\nMetro Atlanta remains under a flood watch through 7 p.m., and driver’s need to watch for pooling water from overflowing streams and clogged street drains. The coming darkness will make spotting them more challenging.\n“Clouds, mist, drizzle, dense fog,” said Channel 2 Action News Meteorologist Glenn Burns. “It’s terrible driving conditions, but much improved from the morning.”\nHe said the dreary weather showed that the climate pattern El Nino had arrived in this part of the country. The climate pattern is expected to make for an especially wet and cloudy winter in Georgia.\n“If you wonder what the winter’s going to look like, look out your window right now,” he said.\nMetro Atlanta was hit with anywhere from 2 1/2 to 4 inches of rain Monday, which, coming the day after Halloween, cast an evil spell over the roadways, resulting in numerous crashes, backups and a generally miserable day for travel.\nSeveral wrecks were reported before 6 a.m. on I-75 in Cobb and Henry counties, I-85 in Gwinnett County and I-20 east of downtown. On I-75 south of Atlanta, all northbound traffic was detoured into I-675 for nearly three hours following a 5 a.m. truck crash.\nMonday’s foul weather also led to scattered flooding and power outages.\nDeep standing water shut down the ramp from I-20 to Hill Street east of downtown, while other deep water was reported on I-575 at Bells Ferry Road in northern Cobb.\nBeaver Ruin Creek overflowed in Gwinnett County, and the water rose in Jones Mobile Home Park to four feet. There were 30 homes effected and about 15 people had to evacuated.\nA school trailer complex at I-85 and Indian Trail Road in Norcross was flooded, said Gwinnett school district spokeswoman Sloan Roach.\nIn DeKalb County, flooding forced about 20 people from their apartments along Peachtree Industrial Boulevard, said DeKalb spokesman Burke Brennan.\nWater was also coming close to homes along Burnt Creek Road, which is located near North Druid Hills Road, officials said.\nState Department of Transportation worked cleared standing water at numerous locations. Piedmont Road at Miami Circle is still a potential hot-spot for flooding this evening, according to City of Atlanta officials.\nGeorgia Power reported about 2,900 customers were without power during the day, with vast majority of them in the neighborhoods near the intersection of Piedmont Avenue and Monroe Drive in Atlanta. The great majority had power restored by evening.\nHartsfield-Jackson International Airport officials reported that, despite the rain, operations were running smoothly, with no significant backup of planes.\nBurns, the Channel 2 meteorologist, said he hardly expects to see the sun until Sunday. He anticipates much the rest of the week will continue these misty, foggy conditions, though temperatures will be warmer than usual, in the upper sixties and low seventies.\nStaff reporters Janel Davis, Eric Stirgus, Molly Bloom, Arielle Kass, Dan Klepal, Mark Neisse and Kelly Yamamouchi contributed to this report.","url":"https://www.ajc.com/news/breaking-news/tonight-commute-misty-darkening-mess/jhMYxKsyTwuEVnPgL0lTdJ/"}
