{"authors":["Monique Friedlander For Daily Mail Australia"],"date_download":"2018-10-22 22:50:24","date_modify":"2018-10-22 22:50:24","date_publish":"2016-01-29 10:20:41","description":"Muriel's Wedding co-stars Toni Collette and Rachel Griffiths re-unite to host G'Day USA black tie gala in LA on Thursday night.","filename":"data/vaneerConsumption/ToniCollettereuniteswithMurielsWeddingcostarRachelGriffiths.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1DBBF00000578-0-image-a-22_1454067984161.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422349_Toni-Collette-reunites-Muriel-s-Wedding-star-Rachel-Griffiths-pair-host-G-day-USA-black-tie-gala-Los-Angeles_1540248624.html","title":"Toni Collette reunites with Muriel’s Wedding co-star Rachel Griffiths","title_page":"Toni Collette reunites with Muriel’s Wedding co-star Rachel Griffiths | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's been 20 years since Toni Collette and Rachel Griffiths played unlikely best friends in the cult comedy classic Muriel's Wedding.\nAnd on Thursday, the two Australian showbusiness icons made history as they reunited to co-host the G'day USA black tie gala in Los Angeles.\nTaking the stage side-by-side, Toni, 43, and Rachel, 47, appeared to be two peas in a pod as they donned matching black floor-length gowns.\nScroll down for video\nBack in black! Toni Collette and Rachel Griffiths co-hosted the G'day USA black tie gala in Los Angeles on Thursday, 20 years after playing unlikely best friends in the cult comedy classic Muriel's Wedding\nMother-of-two Toni flaunted her slender frame in her floor-length gown, which featured a cascading tulle skirt and high-necked satin bodice.\nShe accessorised her glamorous look with a wrap-around leather waist belt, a pair of strappy heels and a set of dramatic drop earrings which hung by her shoulders.\nThe Golden Globe Award winner kept her makeup soft and feminine for the occasion, emphasising the apples of her cheeks with a peach glow and enhancing her blue eyes with a strong eyeliner.\nChic: Mother-of-two Toni flaunted her slender frame in her floor-length gown, which featured a cascading tulle skirt and high-necked satin bodice\nThe finer details: The 43-year-old accessorised her glamorous look with a wrap-around leather waist belt, a pair of strappy heels and a set of dramatic drop earrings which hung by her shoulders\nThe swanky black-tie event was held in celebration of some of Down Under's most noteworthy players in the entertainment, business, tourism and government sectors.\nEarlier on Thursday it was announced that Toni is set to join the ever-expanding cast of xXx3: The Return of Xander Cage, a reboot of the original 2002 flick.\nThe Vin Diesel action thriller, set for release in 2017, will see Toni take on the role of a bureaucrat in the intelligence service.\nPrimped: The Golden Globe Award winner kept her makeup soft and feminine for the occasion, emphasising the apples of her cheeks with a peach glow and enhancing her blue eyes with a strong eyeliner\nThe busy actress has also signed on to play a starring role in the upcoming film Please Stand By.\nToni will play the role of a caregiver to a brilliant young woman with autism in the film, which is set for release in 2016.\nJoining Toni in the comedic drama will be Dakota Fanning and Alice Eve and Matty Cardarople.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422349/Toni-Collette-reunites-Muriel-s-Wedding-star-Rachel-Griffiths-pair-host-G-day-USA-black-tie-gala-Los-Angeles.html"}
