{"authors":["Alison Millington"],"date_download":"2018-10-30 23:52:54","date_modify":"2018-10-30 23:52:54","date_publish":"2016-12-05 00:00:00","description":"We visited 69 Colebrooke Row, otherwise known as The Bar With No Name, where bartender Raife Bashford showed us how to make the perfect negroni.","filename":"data/vaneerConsumption/TonyConigliarosperfectnegroni.json","image_url":"https://amp.businessinsider.com/images/58459efbdd08953e448b4993-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_tony-conigliaros-perfect-negroni-2016-12_1540943574.html","title":"Tony Conigliaro's perfect negroni","title_page":"    Tony Conigliaro's perfect negroni - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Alison Millington The negroni was the second best-selling cocktail in the world in 2016, and with the holiday season approaching, there's no better time to learn how to mix and serve the classic cocktail.\nThe drink was named after an Italian libertine, Count Camillo Negroni, who in 1919 decided to swap the soda in his Americano — made with Campari, vermouth, and soda water — for gin.\nTo this day, the cocktail is made of equal parts vermouth, Campari, and gin, normally garnished with an orange.\nAcclaimed mixologist and author Tony Conigliaro — owner of Islington bar 69 Colebrooke Row and Soho favourite Bar Termini, consultant for Marylebone's Zetter Townhouse and International Bartender of the Year in 2009 — is a big proponent of the Italian cocktail. He's even created a bottle aged version.\nWith prepartions underway for Coniglario and his team to open a new bar called \"Untitled\" in Hackney in January, Business Insider paid a visit 69 Colebrooke Row, otherwise known as The Bar With No Name, where bartender Raife Bashford showed us how to make the perfect negroni.\nSee how to make what he calls \"a really simple, classic recipe\" in a few simple steps below.","url":"https://www.businessinsider.com/tony-conigliaros-perfect-negroni-2016-12"}
