{"authors":[],"date_download":"2018-10-30 01:14:17","date_modify":"2018-10-30 01:14:17","date_publish":"2018-07-02 00:05:48","description":null,"filename":"data/vaneerConsumption/TooCatholicfortheDemocrats.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/AmyBarrett.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862057.html","title":"Too Catholic for the Democrats","title_page":"Too Catholic for the DemocratsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Like sharks thrashing about in chum-filled bloody water, the unhinged hysterics of the progressive left have gone into a feeding frenzy as they prepare to attack whomever President Trump nominates to replace retiring Supreme Court Justice Anthony Kennedy. Thanks to Kennedy’s retirement, Trump is now in a position to appoint a non-activist, strict constructionist to the Court. Senate confirmation of the nominee will result in a solid, reliably conservative Court majority.\nNeedless to say, the Democrats in the Senate and their leftist supporters view this as the coming of the Apocalypse. But it was the triumphant Democrats who, during the heady days of the Obama administration, changed the Senate rules to allow judicial confirmations to proceed on a simple majority vote. Thanks to their lack of foresight and the existing bare majority of Republicans in the Senate, they are facing a tough uphill battle. So we should expect the desperate Democrats to resort to every device and artifice to slime, smear, destroy, and defeat the nominee.\nFor a preview of just how low they may go, consider the road taken by Senate Democrats last September as they tried to derail the nomination of Notre Dame Law School professor Amy Coney Barrett for a position on the Seventh Circuit Court of Appeals. Ultimately, Barrett was confirmed and is now a circuit court judge. And, according to news reports, she is on Trump’s short list for the Supreme Court.\nBut, when Barrett appeared before the Senate Judiciary Committee, the bigoted and outrageous antics of Senators Dick Durbin and Dianne Feinstein prompted me to write the following column which was published by the Philadelphia Inquirer:\nQuestioning of judicial nominee’s Catholicism by Feinstein and Durbin would make the Klan proud September 15, 2017 Article VI of the Constitution prohibits a religious test for public office. Nevertheless, last week in the Senate Judiciary Committee, Democratic Sens. Dick Durbin and Diane Feinstein grilled a judicial nominee about the depth of her Catholic faith and made clear that, in their estimation, she was “too Catholic” to hold office. Why would Durbin, who is Catholic, and Feinstein believe such a public display of intolerance was either warranted or politically advisable? To answer this question, their jaw-dropping behavior must be placed in its historical context. For example, in 1912, former Georgia congressman and onetime vice presidential candidate Tom Watson published The Roman Catholic Hierarchy, a reprise of his voluminous anti-Catholic polemics and speeches. To him, Catholics constituted an alien and immoral subversive force bent on turning America into a vassal state of the Vatican. Quoth Watson, “We have heard the potentates of this faith in America confess that, on an issue between our Government and the Pope, they would adhere to Papa.” Based in no small part on the popularity of his anti-Catholicism, Watson was elected to the U.S. Senate. By the 1920s, the Ku Klux Klan had become a politically powerful organization with more than four million members. The July 1, 1925, issue of the American Standard, the Klan’s official publication, featured an expose headlined “Jesuit Hypnotism of Protestants Uncovered.” This article contended that, acting under Jesuit mind control, “depraved and enslaved Romanists” had assassinated Presidents Lincoln, Garfield, and McKinley. The same issue set forth the Klan’s Program for America, which advocated “[r]ecognition of the fact, that since Roman Catholics give first allegiance to an alien potentate, the pope, who claims supremacy over all secular governments, their claim to citizenship, the ballot, and to public office in this Protestant country is illegitimate, and must be forbidden by law.” When John Kennedy, a Catholic, ran for president in 1960, groups such as Protestants and Other Americans United for Separation of Church and State opposed his candidacy because they believed Catholics’ loyalty would always be to Rome and to their religion and not to the rule of American law. Kennedy’s presidency should have proved once and for all that Catholics were capable of following the law regardless of their religious beliefs. Given this — and the similar performance by legions of Catholic public servants at all levels of government — you might think that by 2017, being a Catholic would no longer be a political liability. But if you believe that, you are wrong. Although the bigotry has been sugarcoated for intellectual consumption, and the Klan robes are being left in the closet, the ugly intolerance and hatred remain. They come to us today under the cloak of liberal progressivism, which advocates an inclusive society open to all cultures and beliefs — unless you happen to be a traditional practicing antiabortion* Catholic. Which brings us back to Durbin and Feinstein’s outrageous interrogation of Notre Dame law professor Amy Coney Barrett, a nominee to the Court of Appeals for the Seventh Circuit. Among her many accomplishments, Barrett has clerked for the U.S. Supreme Court and served on its appellate rules committee. She has taught law at George Washington University and the University of Virginia and has published numerous scholarly articles in leading law reviews. Her nomination has received bipartisan endorsement from more than 70 law professors (including the Obama administration’s former acting solicitor general). But instead of exploring Barrett’s impressive qualifications, Feinstein and Durbin, acting as ex officio arbiters in matters of faith and morals, set out to determine whether the nominee was perhaps too devoutly Catholic to be trusted with a judgeship. They focused on a law review article Barrett coauthored when she was a student that discussed what should be done if a Catholic judge’s religion conflicted with his duty to follow established death penalty law. It concluded that “[t]he legal system has a solution for this dilemma — it allows (indeed it requires) the recusal of judges whose convictions keep them from doing their job.” Unsatisfied with this endorsement of the primacy of law over religion, Durbin probed the depths of Barrett’s faith, going so far as to ask, “Do you consider yourself an orthodox Catholic?” Not to be outdone, Feinstein concluded her questioning by telling Barrett, “the [Catholic] dogma lives loudly within you, and that’s of concern.” Durbin and Feinstein’s egregious antics fall into that time-honored political tradition of pandering to their supporters’ prejudices. In that respect, liberal progressives are intolerant and contemptuous of the Catholic Church’s position on the sanctity of life and fear traditional antiabortion Catholics as a collective threat to the secular sacrament of abortion, an institution that must be preserved without restriction at all costs. Progressives have a peculiar conceit that they are too intelligent, enlightened, and sophisticated to be swayed by base prejudice. But by opposing antiabortion Catholics for their supposed subversive loyalty to the religion of Rome over the interests of American society, Durbin, Feinstein, and their like-minded progressive liberal supporters are treading a well-worn path of hate, bigotry, and religious intolerance. Tom Watson and the old Ku Klux Klan would heartily approve.\nThat column described how far the left was willing to go to defeat a nominee to a circuit court of appeals. Given the relatively higher stakes riding on the upcoming Supreme Court nomination, Durbin and Feinstein’s utterly shameful behavior may prove to be a model of senatorial decorum compared to what awaits Justice Kennedy’s putative replacement at the hands of increasingly desperate leftists who correctly perceive the looming threat to their judicially conjured and enforced progressive world order.\n*Throughout the original column submitted to the Philadelphia Inquirer for publication, I used the term “pro-life Catholic.” For reasons unknown, the editors changed every use of that term to “antiabortion Catholic.” A minor point possibly, but one that I believe obfuscates the affirmative motivation of my co-religionists who seek to protect innocent life in the womb.\nGeorge Parry is a former federal and state prosecutor who practices law in Philadelphia. He blogs at knowledgeisgood.net and may be reached by email at kignet1@gmail.com.","url":"https://spectator.org/too-catholic-for-the-democrats/"}
