{"authors":["Press Association"],"date_download":"2018-10-23 03:39:35","date_modify":"2018-10-23 03:39:35","date_publish":"2016-01-28 19:17:07","description":"Hitting the gym in the hope of burning up calories to lose weight can backfire as the body adapts to higher activity levels, a study has found. The change in...","filename":"data/vaneerConsumption/Toomuchexercisecanaffectbodysabilitytoloseweight.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-a52316ad-9d31-4a93-9fdf-21dda70f891f-2vdWmEltwXfba0ce28e632bfbfd7-506_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421377_Too-exercise-affect-bodys-ability-lose-weight_1540265975.html","title":"Too much exercise can affect body's ability to lose weight","title_page":"Too much exercise can affect body's ability to lose weight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Too much exercise can affect body's ability to lose weight\nHitting the gym in the hope of burning up calories to lose weight can backfire as the body adapts to higher activity levels, a study has found.\nThe change in metabolism means that slimmers who rely on exercise to achieve their goals are likely to be disappointed, say scientists.\nPeople who start rigorous exercise programmes to shed unwanted flab often see a decline in their rate of weight loss - or even a reversal - after a few months.\nToo much time in the gym can be an issue if you want to lose weight\nResearchers in the US investigated the phenomenon by measuring the daily energy expenditure and activity levels of more than 300 men and women over the course of a week.\nThey found above a certain threshold of activity, the extra work people put in had no effect on the number of calories they burned up.\nThe findings, published in the journal Current Biology, reinforce the message that you cannot duck the importance of diet when trying to lose weight.\nLead scientist Dr Herman Pontzer, from the City University of New York, said: \"Exercise is really important for your health. That's the first thing I mention to anyone asking about the implications of this work for exercise.\n\"There is tons of evidence that exercise is important for keeping our bodies and minds healthy, and this work does nothing to change that message.\n\"What our work adds is that we also need to focus on diet, particularly when it comes to managing our weight and preventing or reversing unhealthy weight gain.\"\nDr Pontzer decided to explore the link between activity and energy expenditure after working among the Hadza, a community of traditional hunter-gatherers in northern Tanzania.\nHe said: \"The Hadza are incredibly active, walking long distances each day and doing a lot of hard physical work as part of their everyday life.\n\"Despite these high activity levels, we found that they had similar daily energy expenditures to people living more sedentary, modernised lifestyles in the United States and Europe. That was a real surprise.\"\nThe new research showed a weak but measurable effect of physical activity on daily energy expenditure, but this did not apply to everyone.\nWhile moderately active individuals burned about 200 more calories each day than most sedentary people, those who did higher levels of exercise saw no extra benefit.\n\"The most physically active people expended the same amount of calories each day as people who were only moderately active,\" said Dr Pontzer.","url":"https://www.dailymail.co.uk/wires/pa/article-3421377/Too-exercise-affect-bodys-ability-lose-weight.html"}
