{"authors":[],"date_download":"2018-10-22 22:28:37","date_modify":"2018-10-22 22:28:37","date_publish":"2014-06-09 21:54:57","description":"The White House admits it's having trouble meeting a 72-hour deadline to process children arriving at the U.S.-Mexico border.","filename":"data/vaneerConsumption/TooManyTooFastBorderChildrenSwampingAgents.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/498041/140609-undocumented-immigrant-minors-jms-1854_67e9c274014313d626607ff2870918df.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_too-many-too-fast-border-children-swamping-agents-n126751_1540247317.html","title":"Too Many, Too Fast: Border Children Swamping Agents","title_page":"Too Many, Too Fast: Border Children Swamping Agents","title_rss":"NULL","source_domain":"nbcnews.com","text":"The administration has asked for about $2.3 billion, about $140 million more than President Barack Obama requested in the annual budget he sends Congress, to cover costs of the program for unaccompanied children based at Health and Human Services.\nThe senior administration official said another $160 million has been requested for the Department of Homeland Security, which includes the Border Patrol.\nDespite the bump up in money requests, the official dismissed suggestions that the administration was caught unprepared for the influx of unaccompanied children whose arrivals President Barack Obama declared to be a humanitarian crisis.\n“The federal government did prepare for this trend. We prepared for an increase compared to previous years. The increase that we saw this year was much larger than anticipated, which is why we are just undertaking this major effort across the federal government,” the official said.\nIn previous years, 6,000 to 8,000 children a year crossed the border without an adult or guardian. But the numbers jumped in 2011 to about 13,525, then to 25,000 in 2012 and about 47,000 in 2013. This year they were expected to number 60,000 but may be as much as 90,000.\nWhite House officials blame violence, gangs and other problems in Central America and say they are working with the officials of those countries to try to stem the influx.\nMarc Rosenblum, deputy director of the Migration Policy Institute's U.S. immigration program, said it's likely a combination of factors, including a law signed by former President George W. Bush that set up different treatments for children from Mexico versus children from countries not contiguous to the United States. Many Mexican children are simply sent back across the border, the 2008 law known as the Trafficking Victims Protection Reauthorization Act guaranteed certain protections for unaccompanied children from children not from Mexico or Canada. That law was implemented in 2009. It took a little time for word to get back to Central America and other countries about those protections, as well as for criminal organizations to develop smuggling infrastructure around them.\nAdd to the mix the deterioration of conditions in those countries, especially the rising violence. In addition, large populations of people legally present in the U.S. are from Central America but do not have a right to petition for their families to join them. Family members then come illegally.\nThere also are anecdotes that smuggling networks have been using a tactic in Central America they have used previously on the southwest border - the would-be crosser pays the smuggler and gets three tries, according to Rosenblum.\n\"It's sort of a perfect storm of immigration pushes and pulls,\" said Rosenblum, whose institute is researching the issues and has an upcoming report.\nMeanwhile families who have been trying to enter the U.S. illegally have been sent to Border Patrol stations in Nogales, Arizona, which angered Gov. Jan Brewer. White House Press Secretary Josh Earnest said they were sent there because the facility has more capacity and was not related to the influx of unaccompanied children.","url":"https://www.nbcnews.com/news/latino/too-many-too-fast-border-children-swamping-agents-n126751"}
