{"authors":[],"date_download":"2018-10-22 21:53:49","date_modify":"2018-10-22 21:53:49","date_publish":"2014-05-08 18:14:31","description":"Sotheby's impressionist-modern sale was one of the worst since the financial crisis. More than 30 percent of the lots failed to sell.","filename":"data/vaneerConsumption/TooRichfortheRichArtPiecesFailtoSellatAuction.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/429846/140508-art-picasso-auction-sothebys-mms-1404_e18f4c4b53062dca3b7f4ef6fc807b29.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_too-rich-rich-art-pieces-fail-sell-auction-n100566_1540245229.html","title":"Too Rich for the Rich: Art Pieces Fail to Sell at Auction","title_page":"Too Rich for the Rich: Art Pieces Fail to Sell at Auction","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTwitter. FireEye. Netflix. Picasso?\nAlong with the high-flying momentum stocks that have come crashing back to earth in recent weeks, we might soon be adding some of the highest-priced artists like Picasso, Monet and Degas.\nWednesday night's impressionist-modern sale at Sotheby's was one of the worst since the financial crisis. More than 30 percent of the lots — or 21 pieces — failed to sell at their minimum price.\nOf the 50 lots that sold, nearly half went for less than $3 million, a surprise disappointment in a market where $20 million paintings had supposedly become commonplace. The auction total, of $219 million, barely met the estimated range of $218 million to $318 million.\nArt is not the stock market, of course. And skeptics have been calling the art market a bubble for years, only to see it soar higher. But the Sotheby's sale, along with a mixed sale by Christie's on Tuesday night, suggests that art prices and expectations may have gotten ahead of themselves.\n\"A lot of things got overpriced,\" said Andrew Fabricant, a director of the Richard Gray Gallery in New York. \"The asset piece of this market was overdone. The idea that you could sell a Picasso for six or eight million dollars even though it should be three million just no longer works.\"\nStill, there have been some successes and upside surprises in the art market this week. At Sotheby's Wednesday night, Picasso's 1932 work \"Le Sauvetage\" went for a $28 million hammer price (or $31.5 million with commission), way above the high estimate of $18 million. The work was purchased a decade ago for $14.8 million.\nChristie's racked up an auction total of $286 million, led by one of Monet's water lily paintings that sold for $27 million. Yet Picasso's \"Portrait de femme (Dora Maar),\" the second-highest priced work at the Christie's sale, sold for $22.56 million with commission — below the $25 million to $35 million expected.\nThe big test for the art market will be next week, when Sotheby's and Christie's hold their big evening sales for post-war and contemporary art. Those sales are expected to total more than $1 billion.","url":"https://www.nbcnews.com/business/business-news/too-rich-rich-art-pieces-fail-sell-auction-n100566"}
