{"authors":["Jon Fleischman"],"date_download":"2018-10-30 22:16:09","date_modify":"2018-10-30 22:16:09","date_publish":"2014-12-13 17:04:59","description":"The General Election ballot in 2016 is likely to have more statewide ballot measures on it than California voters have seen in a long time. The main |","filename":"data/vaneerConsumption/Top10MeasuresLikelytoAppearonNovember2016CaliforniaBallot.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-California/2014/12/13/BALLOT-measures-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2014_12_13__1540937769.html","title":"Top 10 Measures Likely to Appear on November 2016 California Ballot","title_page":"Top 10 Measures Likely to Appear on November 2016 California Ballot | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The General Election ballot in 2016 is likely to have more statewide ballot measures on it than California voters have seen in a long time. The main reason for this is that the number of signatures needed in order to qualify a statutory measure or even a constitutional amendment have plummeted with the pathetically low turnout in last month’s election (the signature requirement is 5% of the number of people who voted in the last gubernatorial election).\nTo be specific, it previously took 504,760 valid signatures to place a statutory initiative on the ballot. It will now take less than 370,000. For a constitutional amendment, the number has dropped from 807,615 to less than 590,000. A couple of years ago, a law was signed that requires that all measures placed on the ballot by signature petitions must appear on the November-not the June-ballot.\nBelow are the top ten measures most likely to appear on the November, 2016 ballot:\nPLASTIC GROCERY BAG BAN — In a naked profit grab supported by the California Grocers Association, the legislature passed and Governor Brown signed into law a bill that would ban single-use plastic grocery bags and would mandate that stores charge at least ten cents for every paper bag given to a customer. This paper bag fee puts hundreds of millions of dollars of profits straight into the pockets of grocery store owners. A coalition representing plastic bag manufacturers is currently gathering signatures to refer this bill to the voters.\nMEDICAL MARIJUANA — In 1996, California voters passed a ballot measure legalizing medical marijuana. Now the push is on to put another measure before Golden State voters that would decriminalize recreational marijuana use and regulate it, much the same way that alcohol use is currently regulated. Similar measures have recently passed in a handful of other states, and advocates are already targeting California.\nPROP. 30 EXTENSION — In 2012, at the behest of Governor Jerry Brown, California voters approved a significant increase in sales and income taxes in California. It was sold to voters as needed to fund California schools, although money from these tax increases has been spent much more broadly. It is virtually certain that a “renewal” of this tax hike package will be placed on the ballot by Governor Brown.\nOIL SEVERANCE TAX — Billionaire former hedge fund manager Tom Steyer has, on many occasions, talked about his desire to see California impose an oil extraction tax — taxing oil companies on each barrel of oil extracted from the ground. Steyer calls the absence of such a tax in California a “loophole” that he thinks should be closed. Of course someone of Steyer’s means could easily hire the paid signature gatherers to put this on the November ballot.","url":"https://www.breitbart.com/local/2014/12/13/top-10-measures-likely-to-appear-on-november-2016-ballo/"}
