{"authors":["Associated Press"],"date_download":"2018-10-23 00:49:55","date_modify":"2018-10-23 00:49:55","date_publish":"2016-01-28 14:57:13","description":"NEW YORK (AP) — The Super Bowl is a little more than a week away, but advertisers are going strong online, offering up celebrity laden teasers well ahead of ...","filename":"data/vaneerConsumption/Top10celebritySuperBowladteasers.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:336b1cdb0991407c9b0c353953900b2b-4vVdYopwYQ7f641721b07ae61fb8-512_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421076_Top-10-celebrity-Super-Bowl-ad-teasers_1540255795.html","title":"Top 10 celebrity Super Bowl ad teasers","title_page":"Top 10 celebrity Super Bowl ad teasers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Top 10 celebrity Super Bowl ad teasers\nNEW YORK (AP) — The Super Bowl is a little more than a week away, but advertisers are going strong online, offering up celebrity laden teasers well ahead of the game. Teasers are one way Super Bowl advertisers can build buzz without revealing their full Super Bowl ads too far in advance. Here's a look at the top celebrity teasers so far.\nMost advertisers will also reveal their full spots next week ahead of Super Bowl 50 on Feb. 7.\nAPARTMENTS.COM\nThis image provided by Skittles shows Aerosmith front man Steven Tyler promoting Skittles in the company's Super Bowl 50 ad. This is the first time Skittles has ever featured a celebrity in a TV commercial, and the brand¿s second Super Bowl ad after debuting during the 2015 Super Bowl. (Skittles via AP)\nThe site, which helps people rent and lease apartments, enlisted Jeff Goldblum and Lil Wayne for its first Super Bowl ad. The teaser spot shows Wayne buzzing George Washington into his apartment.\nWatch online: https://youtu.be/bmPcPxXnCVI\nAMAZON\nThe first time Super Bowl advertiser will promote its Echo speaker during the game. A teaser released Wednesday shows \"30 Rock\" actor Alec Baldwin and former star quarterback Dan Marino brainstorming what they'll need for their Super Bowl party with the help of Echo's voice-controlled software Alexa.\nWatch online: https://youtu.be/_y-4pGhRxek\nBMW\nBMW enlisted six celebrities — former baseball pitcher Randy Johnson, tennis star Serena Williams, \"Smoke\" actor Harvey Keitel, singer/rapper T-Pain, soccer player Abby Wambach and skateboarder Tony Hawk — who \"Defy Labels\" for its Super Bowl ad. Each celeb stars in their own teaser spot online.\nWatch online: https://www.youtube.com/user/MINIUSA\nBUD LIGHT\nSuper Bowl veteran Bud Light is touting the brand's revamped logo and packaging with a teaser showing \"Trainwreck\" actress Amy Schumer and \"Neighbors\" actor Seth Rogen introducing the fake Bud Light political party.\nWatch online: https://youtu.be/JAP7JGnwT1c\nHYUNDAI\nHyundai has enlisted Ryan Reynolds and Kevin Hart to promote their Genesis and Elantra sedans. Although the company announced that the stars will be in the ads on Thursday, the teasers only hint at their presence. In one, two girls drive around in a town called \"Ryanville.\"\nWatch online: https://youtu.be/tpa3sTKzkP4\nKIA\nKia's cryptic teaser shows a man dressed in beige looking for his beige socks in a teaser called \"Walken Closet.\" Guess who's hiding inside the closet? Spoiler alert: It's Christopher Walken.\nWatch online: https://youtu.be/ZILIr1412wc\nLG\nLG's first Super Bowl ad is produced by Ridley Scott's production company RSA and directed by his son, Super Bowl ad veteran Jake Scott. The teaser features Liam Neeson as the \"man from the future.\"\nhttps://youtu.be/WWCLhBzkAE8\nSHOCK TOP\n\"Silicon Valley\" star T.J. Miller may be one of the lesser known names this year. But his ad-libbed riff on the coming epicness of the Shock Top Super Bowl ad is one of the funnier teasers out there.\nWatch online: https://youtu.be/L6Ph-7UlDnI\nSKITTLES\nIn true millennial fashion, Skittles launched a series of GIFs to announce that Aerosmith lead singer Steven Tyler will be in its Super Bowl spot.\nWATCH ONLINE: http://skittles.com/post/137777315075/i-cant-wait-to-meet-steven-tyler-i-just-hope-he\nSNICKERS\nSnickers has been a Super Bowl favorite with its \"You're Not You When You're Hungry\" campaign. Past ads featured Betty White playing football and a hungry Marsha Brady depicted by character actor Danny Trejo. This year Snickers has released a teaser that shows Willem Defoe channeling Marilyn Monroe's \"Happy Birthday\" performance to JFK.","url":"https://www.dailymail.co.uk/wires/ap/article-3421076/Top-10-celebrity-Super-Bowl-ad-teasers.html"}
