{"authors":["Lea Rose Emery"],"date_download":"2018-10-31 01:48:45","date_modify":"2018-10-31 01:48:45","date_publish":"2018-09-13 22:13:39","description":"Dealing with finances in a relationship is rarely easy. From deciding who pays for what to deciding whether or not to open a joint account, there can be a lot of different financial issues to negotiate. But one of the most difficult financial…","filename":"data/vaneerConsumption/Top5WaysPeopleAcquireDebtThroughARelationship.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/5/b84cb52a-9814-4f0e-915b-486b1680180f-bustle_102416_487.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_top-5-ways-people-acquire-debt-through-a-relationship-11761031_1540950525.html","title":"Top 5 Ways People Acquire Debt Through A Relationship","title_page":"Top 5 Ways People Acquire Debt Through A Relationship","title_rss":"NULL","source_domain":"bustle.com","text":"Dealing with finances in a relationship is rarely easy. From deciding who pays for what to deciding whether or not to open a joint account, there can be a lot of different financial issues to negotiate. But one of the most difficult financial hurdles — and one that we don't talk about enough — is debt. Because debt is a huge problem in the United States and, even if you and your partner break up, you can end up taking their debt along with you.\nA recent survey of over 2,000 adults from finder.com, the personal finance comparison site, found that a startling number of Americans accrue debt through a romantic relationship — and many of them retain that debt after the relationship has ended. In fact, 30 percent of those surveyed had absorbed debt through a relationship, which translates into around 74 million Americans country-wide. The total amount of debt accrued through a relationship is a whopping $250 billion, which averages out to around $11,485 per person. But understanding your partner's relationship with money is so important — for a lot of reasons.\n\"Remember that at the end of the day, how we interact with money is a direct reflection of our values,\" Priya Malani, a founding partner at Stash Wealth, tells Bustle. \"If you and your partner are not on the same page with money, I can almost guarantee you differ on your core values as well and once the honeymoon phase of the relationship is over — that will become much more apparent.\" And money problems go way deeper than just debt issues, so you should have a holistic look at how your partner handles their money.\nHere were the top five ways people acquired debt through a relationship, according to finder's survey.\n1 Marriage: 28% Giphy Marriage was the number one way that people absorbed their partner's — or ex partner's — debt, with 28 percent of people surveyed taking on debt that way. Prenups might not seem like the most romantic thing in the world, but these numbers show just how important they can be. Marriage often doesn't last forever, but once you're legally tied to someone their debt can outlast the marriage.\n2 Purchases Made In Their Name: 25% Giphy Twenty-five percent of respondents had their partners make purchases in their name. Lending your partner a debit or credit card once in a while might seem like no big deal, but the consequences can be huge. Make sure that you really trust them and know what they're doing before you give them access to any of your money.\n3 Purchases Made Via Joint Accounts: 20% Giphy Having a joint account is a big decision, as you're both responsible for what happens there. Twenty percent of those surveyed ended up with debt because of a partner misusing the joint account.\n4 Secret Spending: 16% Giphy Financial infidelity is a real thing. Sometimes, people keep huge amounts of spending and reckless financial behavior from their partner, even when it affects their credit and financial security.","url":"https://www.bustle.com/p/top-5-ways-people-acquire-debt-through-a-relationship-11761031"}
