{"authors":["Amanda Chatel"],"date_download":"2018-10-31 01:40:57","date_modify":"2018-10-31 01:40:57","date_publish":"2018-09-14 20:35:47","description":"When it comes to sexual fetishes and kinks, it's not totally fair to say one fantasy is more \"normal\" than another. As long as all those who are participating are consenting adults, then what you do to get off is your business. But of course, a lot…","filename":"data/vaneerConsumption/Top5SexualFetishesKinksAccordingToANewSurvey.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/11d033f6-fa20-4f22-bc2e-8827caf2e403-zaeh_bustle_oct2015-253.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_top-5-sexual-fetishes-kinks-according-to-a-new-survey-11782631_1540950057.html","title":"Top 5 Sexual Fetishes & Kinks, According To A New Survey","title_page":"Top 5 Sexual Fetishes & Kinks, According To A New Survey","title_rss":"NULL","source_domain":"bustle.com","text":"When it comes to sexual fetishes and kinks, it's not totally fair to say one fantasy is more \"normal\" than another. As long as all those who are participating are consenting adults, then what you do to get off is your business. But of course, a lot of us are curious about other people's sex lives, and it's always interesting to know what the most popular sexual fetishes and kinks are — and what people really want to try in bed.\nTo find out what the most popular kinks are, The Sex Expo, a sexual wellness event in Brooklyn on September 22 and 23, teamed up with third party pollster, CheckMarket, to survey over 400 people (54 percent identified as female, 45 percent identified as male, and one percent identified as gender non-binary) mostly in their 20s and 30s, about their sexual fetishes and kinks.\nIn addition to finding out the sexual fetish people are dying to try but haven't (electronic stimulation electrosex) and the most popular fetish people tried before they turned 20 (public sex), the Sex Expo survey also found the top sexual fetishes among participants overall. Here are the top five sexual fetishes and kinks, from BDSM to erotic spanking.\n1 BDSM Ashley Batz/Bustle The most common sexual fetish is BDSM, according to the survey. While 32.6 percent of survey participants tried it for the first time between the ages of 21 and 29, about half that, at 17.1 percent, have never tried it. And 14 percent haven't tried it, but want to try BDSM.\n2 Public Sex Andrew Zaeh for Bustle In second place for sexual fetishes is public sex. Although it might not seem like a fetish, the desire to possibly get caught in the act or be seen is, in itself, a fetish — exhibitionism. Of those surveyed, 43 percent had had sex in public for the first time before 20, 28.7 percent tried it for the first time between 21 and 29, and 7.7 percent never tried it, but would be open to giving sex in public a try. A survey from earlier this year found that when it comes to having sex in public, the most favored spot, at 26.1 percent, is a park, garden, forest and/or field.\n3 Erotic Fantasy Role-Play Andrew Zaeh for Bustle The fun with role-playing is that the sky's the limit, and anyone who's ever tried role-playing can attest to that. It's probably because of this that fantasy role-play is third on the list of sexual fetishes. According to the survey, 29.5 percent had tried it for the first time between the ages of 21 and 29, 21 percent have never tried it, but would like to give it a whirl, and 11.4 percent tried it before the age of 20. As for what type of role-play the respondents were into, the survey didn't say, but the 2015 SKYN Condoms Millennial Sex Survey found that millennial couples prefer role-playing that they're strangers above all other scenarios.\n4 Sex Toys Andrew Zaeh for Bustle Half of respondents first tried a sex toy with a partner between 21 and 29, 9.4 percent have never tried it but would like to, and only six percent have never tried it.","url":"https://www.bustle.com/p/top-5-sexual-fetishes-kinks-according-to-a-new-survey-11782631"}
