{"authors":["Lana Shadwick"],"date_download":"2018-10-30 19:33:15","date_modify":"2018-10-30 19:33:15","date_publish":"2016-01-07 16:49:23","description":"Three of the highest ranking leaders of the Bandidos Outlaw Motorcycle Organization (OMO) were arrested in Texas on Wednesday.","filename":"data/vaneerConsumption/TopBandidosArrestedinTexas.json","image_url":"https://media.breitbart.com/media/2016/01/AP_111011115149.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_01_07__1540927995.html","title":"Top Bandidos Arrested in Texas","title_page":"Top Bandidos Arrested in Texas","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, Texas – Three of the highest ranking leaders of the Bandidos Outlaw Motorcycle Organization (OMO) were arrested in Texas on Wednesday.\nThe 23 month investigation by authorities, called “Operation Texas Rocker,” has resulted in the arrest of three of the highest leaders in the organization.\nNational President Jeffrey Fay Pike (60), National Vice President John Xavier Portillo (56), and National Sergeant at Arms Justin Cole Forster (31), were arrested on federal racketeering and drug distribution charges.\nPike is from Conroe, Texas, and Portillo and Forster are from San Antonio.\nA statement from the U.S. Department of Justice states that the three men are accused of “directing, sanctioning, approving and permitting other members of the organization to carry out racketeering, including, “murder, attempted murder, assault, intimidation, extortion, and drug trafficking to protect and enhance the organization’s power, territory, reputation, and profits.”\nThe indictment states that the activities of the Bandidos enterprise include “robbery of property of rival motorcycle organizations, and other criminal activities,” and “[m]aking money for the enterprise through, among other things, extorting money from other motorcycle organizations through fear and threats of violence, drug trafficking and illegal gambling activities.”\nThe leaders have also been accused of “Maximizing profits for enterprise leaders and members from a variety of illegal activity.”\nThe federal grand jury indictment was unsealed on Wednesday and charges the defendants with one count of conspiracy to violate the Racketeering Influenced Corrupt Organization (RICO) statute, and one count of conspiracy to commit violent crimes in aid of racketeering (VICAR).\nPike is also charged with one count of interference with Commerce by extortion.\nPortillo is also charged with two substantive VICAR counts, plus one count each of conspiracy to possess with intent to distribute methamphetamine, possession with intent to distribute methamphetamine, and interference with Commerce by extortion.\nThe indictment alleges that in 2014, Portillo received methamphetamine from Colorado-area Bandidos members and that Forster was selling ounce quantities of methamphetamine.\nForster is also charged with conspiracy to possess with intent to distribute methamphetamine, two counts of possession with intent to distribute methamphetamine, and one count of interference with Commerce by extortion.\nJoseph M. Arabit, Special Agent in Charge of the Drug Enforcement Administration-Houston Field Division said, “Operation Texas Rocker has inflicted a debilitating blow to the leadership hierarchy and violent perpetrators of the Bandidos Outlaw Motorcycle Gang.” The agent added, “This 23-month operation highlights a deliberate and strategic effort to cut off and shut down the supply of methamphetamine trafficked by the Bandidos as well as other related criminal activity.”\nAccording to the indictment, in 2013, the Bandidos OMO declared it was “at war” with the Cossacks OMO. The indictment specifically alleges a number of violent acts committed by Bandidos OMO members in furtherance of this “war.”\nThe Bandidos and the Cossacks were at the Twin Peaks restaurant in Waco, Texas, in May 2015 when there was a shootout. Breitbart Texas has reported extensively about the event, and about the arrests and indictments after the shootout in which nine bikers were killed and many more were wounded.\nIn a statement obtained by the DOJ, U.S. Attorney General Richard L. Durbin, Jr. said, “This joint investigation by the DEA, the FBI, the Texas Department of Public Safety, and the U.S. Attorney’s Office has led to the charging and arrest of the highest ranking leadership of the Bandidos Outlaw Motorcycle Organization. Of course, the defendants will have their day in court, but today’s arrests have struck a significant blow to the Bandidos’ criminal enterprise.”\nLana Shadwick is a writer and legal analyst for Breitbart Texas. She has served as an associate judge and prosecutor. Follow her on Twitter @LanaShadwick2","url":"https://www.breitbart.com/border/2016/01/07/top-bandidos-arrested-texas/"}
