{"authors":[],"date_download":"2018-10-22 20:58:32","date_modify":"2018-10-22 20:58:32","date_publish":"2014-06-03 16:09:32","description":"Ohio's highest court has agreed to hear the case of a death-row prisoner whose 2009 execution was halted after two hours of failed attempts.","filename":"data/vaneerConsumption/TopCourtWillHearRomellBroomsExecutionDoOverAppeal.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2015_05/484636/140603-ohio-gurney-tnc-1255_72e58e251b9b1de030cdea6d23d28097.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_lethal-injection_top-court-will-hear-romell-brooms-execution-do-over-appeal-n121366_1540241912.html","title":"Top Court Will Hear Romell Broom's Execution Do-Over Appeal","title_page":"Top Court Will Hear Romell Broom's Execution Do-Over Appeal ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nOhio's highest court has agreed to hear the case of a death-row prisoner whose 2009 execution was halted after two hours because officials failed to get a needle into his veins.\nThe state wants to take a second try at killing Romell Broom, a child molester who was sentenced to die for raping and killing a 14-year-old girl in 1984.\nTwo lower courts have turned down his appeals, but the Ohio Supreme Court is taking on the case and will decide if a do-over would be cruel and unusual punishment or violate double-jeopardy rules.\nLawyers said it would likely be months before the court issues a decision.\nIn 2009, Broom's would-be executioners tried for more than two hours to put in an intravenous line to deliver a three-drug cocktail, pricking him 18 times before the governor called it off.\n\"The pain made me cry,\" Broom said in an affidavit days later.","url":"https://www.nbcnews.com/storyline/lethal-injection/top-court-will-hear-romell-brooms-execution-do-over-appeal-n121366"}
