{"authors":["Rob Milford"],"date_download":"2018-10-30 18:51:49","date_modify":"2018-10-30 18:51:49","date_publish":"2015-07-28 16:06:40","description":"The police chief of a small town in Texas has found himself behind bars for what prosecutors say was sexual assault on a fourteen year old girl.","filename":"data/vaneerConsumption/TopCopinSmallTexasTownBustedforAllegedSexwithTeen.json","image_url":"https://media.breitbart.com/media/2015/07/Kevin-Coffey.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_07_28__1540925509.html","title":"Top Cop in Small Texas Town Busted for Alleged Sex with Teen","title_page":"Top Cop in Small Texas Town Busted for Alleged Sex with Teen","title_rss":"NULL","source_domain":"breitbart.com","text":"The police chief of a small town in Texas has found himself behind bars for what prosecutors describe as a sexual assault on a 14-year-old girl.\nKevin Coffey, 49, surrendered at the Ellis County Courthouse in Waxahachie on July 22, according to the Waxahachie Daily Light. His surrender came ten days after the Texas Rangers started an investigation into allegations that he had solicited a teenager online and through her phone. He used both text messages and video chats to get her to expose her genitalia and to touch herself in a sexual manner.\nAs of Thursday morning, Maypearl Mayor Adele Mooney said that Coffey no longer serves as the city’s police chief. An interim chief has not yet been appointed, according to the story in the Daily Light. Maypearl, a town of less than a thousand people in Ellis Count, lies about a 45-minute drive south of the DFW metroplex.\nThe former chief was arraigned Thursday morning on four felony charges: Indecency with a child by exposure; indecency with a child by contact; sexual performance by a child; and sexual assault of a child. His bond was set at $350,000. He remains in the Ellis County jail and the only concession he received is that he is segregated from all other inmates because of his law enforcement background.\nThe arrest warrant was issued on Wednesday the 22nd. On July 7th, the mother of a 14-year-old girl contacted Texas Ranger Adam Sweaney and informed him that her daughter made an outcry about having an inappropriate relationship with Coffey, the arrest warrant stated. The Ellis County Children’s Advocacy Center performed a forensic interview with the girl. As a result of the interview, the girl relayed she met Coffey in his office at the Maypearl Police Department. The 14-year-old female stated that soon after she met Chief Coffey, they began a video chat exchange in which he told her she was “beautiful, a beautiful person and had a beautiful body,” the warrant stated.\nThe story by Andrew Branca of the Daily Light continues; The girl said she liked Coffey and the video chat escalated into her showing him her genitalia, the warrant stated. Coffey then asked her to take off her clothes, and he eventually exposed himself to her, the document read. The 14-year-old stated Coffey would talk sexually to her, stating how much he wanted to have sex with her and what he wanted to do to her during the act, as well as observing Coffey pleasing himself on video multiple times, the warrant stated.\nThe girl also stated when she met Coffey in person, he would grab her hair and kiss her, as well as touch her in inappropriate ways; he would (imitate a sexual act) and spank her,” among other things, the warrant stated. He would also send her messages, calling her vulgar names, the document read.\nHe even advised her to “watch what she sent him on text messages because he could get in trouble, but they could go all out sexually over the phone,” the warrant read.\nOn July 11, the Texas Rangers executed two search warrants at Coffey’s residence and the Maypearl Police Department in relation to the investigation of allegations made by the minor. In the search warrants, the parents of the minor met with a Texas Department of Public Safety Trooper and told the trooper their daughter told them she felt Coffey was messaging and saying inappropriate things to her, and she felt his end goal was to have sex with her.\nForensic investigations of two cellphones obtained during the searches corroborate the allegations made by the minor, the search warrants state.\nThe parents stated Coffey drove to Abilene to retrieve the minor’s cellphone from another person’s impounded vehicle without their consent or a search warrant to search the cellphone. They advised that Coffey kept the cellphone, would not return it and requested the password from the parents, the warrant states. The warrant also states the parents said Coffey told them he connected the girl’s cellphone to his computer in an attempt to obtain information from it.\nCoffey was alleged to have made sexual comments about the girl’s body to her in person and contacted her on Facebook when she was 14. The minor also told the trooper that Coffey would wait outside her house and stop her, and that Coffey has been talking with five other juvenile females through text messages and would stop them in the same manner, the warrant states.\nOther allegations against Coffey include asking the minor to come by his office late at night about 2-3 a.m. and visiting her house in his patrol vehicle and personal vehicle to see her.\nCoffey is a five year veteran of the Maypearl Department, and was promoted to chief in 2013. He was previously employed as an officer in Italy, Texas, and as an investigator with the Johnson County District Attorney’s Office, and prior to that he did several years of law enforcement work in North Carolina after leaving the Marine Corps.\nThe Texas Rangers and the Ellis County District Attorney’s Office continue the investigation.\nMilford is a news contributor to Breitbart, Texas. You can follow him on Facebook.","url":"https://www.breitbart.com/border/2015/07/28/top-cop-in-small-texas-town-busted-for-alleged-sex-with-teen/"}
