{"authors":["Richard Spillett","Crime Correspondent For Mailonline"],"date_download":"2018-10-23 04:59:31","date_modify":"2018-10-23 04:59:31","date_publish":"2017-03-10 15:06:31","description":"Lindsey Kushner QC spoke out as she jailed a man for six years after he raped a drunken girl he met in a Burger King Restaurant in Manchester city centre.","filename":"data/vaneerConsumption/Topfemalejudgeissueswarningtodrunkenwomen.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/16/3E23762000000578-0-image-a-133_1489162573051.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301558_Top-female-judge-issues-warning-drunken-women_1540270771.html","title":"Top female judge issues warning to drunken women","title_page":"Top female judge issues warning to drunken women | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lindsey Kushner QC has warned women that, if they get drunk, they could be targeted by sex offenders\nOne of Britain's most senior female judges warned drunken women that they will be a target for rapists as she retired from the bench today.\nLindsey Kushner QC said all women were entitled to 'drink themselves into the ground' but she warned their 'disinhibited behaviour' put them in danger of being raped by men who 'gravitate' to drunken females.\nShe spoke out as she jailed a man for six years after he raped a drunken girl he met in a Burger King in Manchester city centre in July last year.\nBut victims' charities have accused the judge of 'victim blaming' in the speech.\nIn an impassioned speech, her last as a judge, the 64-year-old mother of a son and daughter said: 'We judges who see one sexual offence trial after another, have often been criticised for suggesting and putting more emphasis on what girls should and shouldn't do than on the act and the blame to be apportioned to rapists.\n'There is absolutely no excuse and a woman can do with her body what she wants and a man will have to adjust his behaviour accordingly. But as a woman judge I think it would be remiss of me if I didn't mention one or two things.\n'I don't think it's wrong for a judge to beg women to take actions to protect themselves. That must not put responsibility on them rather than the perpetrator.\n'How I see it is burglars are out there and nobody says burglars are OK but we do say 'please don't leave your back door open at night, take steps to protect yourselves'.\nShe spoke as she jailed Ricardo Rodrigues-Gomes for raping a drunken women in Manchester\nShe added: 'Girls are perfectly entitled to drink themselves into the ground but should be aware people who are potential defendants to rape, gravitate towards girls who have been drinking.\n'It should not be like that but it does happen and we see it time and time again.'\nMs Kushner, who has sat as a senior circuit judge since 2002, said drunken women were a target because sex offenders thought they would be less likely to put up a fight, and less likely to report an offence.\nShe finished her speech saying: '[Women] are entitled to do what they like but please be aware there are men out there who gravitate towards a woman who might be more vulnerable than others. That's my final line, in my final criminal trial, and my final sentence.'\nBut her comments have come under fire from victims' charities, who fear they may deter victims from coming forward.\nRachel Krys, co-director of End Violence Against Women Coalition said: 'When judges basically blame victims for rape - by suggesting such how much alcohol a woman drinks or what she wears is part of what causes rape - we remove the responsibility from the man who did it. That is really alarming.\n'What this judge is saying is exactly the kind of thing that deters women from reporting assaults. Women understandably think that they will not be believed, or will be blamed for their own attack if they've had a drink.\n'This judge should set a tone much higher than the victim-blaming attitudes which support and perpetuate violence against women.'\nThe judge spoke after the case of a woman raped in Manchester's Canal Street district after she was removed from the nightclub after drinking lager and vodka and inhaling amyl nitrite\nThe judge's comments came at the end of a case which heard how factory worker Ricardo Rodrigues-Gomes, 19, and a work colleague took in turns to have sex with the 18-year old victim on a canal bank.\nThe girl, who had been drinking lager and vodka as well as inhaling the party drug amyl nitrite, could be heard saying: 'No, stop. I don't want to do it. It's not fair,' in footage taken by a passerby.\nThe woman had been out in Manchester's Gay Village with two friends and all three had been 'drinking significant quantities of alcohol.' She was removed from a nightclub by a bouncer at 5.10am after falling asleep.\nShe spent some time slumped on the pavement outside the venue before she went with to Burger King, where she met Gomes and his friend.\nA member of the public called police, who arrested Gomes nearby.\nJudge Kushner gave her comments on her last day in the job at Manchester Crown Court\nPortuguese Gomes, from Gorton, Manchester, was convicted of rape whilst his friend was cleared after a trial. Gomes was jailed for six years in prison for two counts of rape.\nIn a statement read to the court, the victim, who was due to enrol as a student at Salford University, said she felt like she had 'lost an entire year of my life and as a result of what happened'.\nJudge Kushner, who has a son and a daughter, was educated at Manchester High School for Girls and Liverpool University before qualifying as a barrister in 1974. She became a Recorder in 1993 before being appointed a senior circuit judge in 2002.\nShe came under fire last year after handing a suspended sentence to a woman who stabbed a man in the eye with the stiletto heel of her Christian Louboutin shoes.\nThe judge also attracted attention when she said she couldn't bear to watch the twisted child abuse videos of a paedophile. He also controversially avoided jail on a community order.","url":"https://www.dailymail.co.uk/news/article-4301558/Top-female-judge-issues-warning-drunken-women.html"}
