{"authors":["Andrew Meola"],"date_download":"2018-10-30 21:05:04","date_modify":"2018-10-30 21:05:04","date_publish":"2016-12-22 00:00:00","description":"The most innovative financial services providers with the BI list of top fintech startups and financial technology companies. Stay on top of the future of financial technology.","filename":"data/vaneerConsumption/TopFinancialServicesProvidersFintechStartups.json","image_url":"https://amp.businessinsider.com/images/581b5050b28a648a058b6716-1136-568.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_top-financial-services-providers-and-fintech-startups-2016-12_1540933504.html","title":"Top Financial Services Providers & Fintech Startups","title_page":"    Top Financial Services Providers & Fintech Startups - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII The fintech industry is growing every year, and the market is starting to fill up with financial services providers and fintech startups who are trying to fulfill customers' needs and shape the future of finance.\nAfter reaching $19 billion in total in 2015, global fintech funding had already hit $15 billion by mid-August 2016. Several innovative financial services and fintech companies are driving that growth by attracting investors who are offering new financial products and services.\nBut as more and more companies pour into the fintech space, it can be tough to sift through them and identify the major players. To help, we've listed below the most important financial technology startups across six areas: Banking, Payments, Investment and Financial Management, Insurance, Currency and Exchange, and Lending and Financing.\nNote: All employee and funding data comes from Crunchbase.\nBanking Fintech Providers & Startups\nNumber of Employees: 11 to 50\nTotal Funding: $17,699,015\nOne Thing to Know: U.K. digital-only mobile bank Monzo was founded as Mondo in 2015.\nNumber of Employees: 1 to 10\nTotal Funding: $70,000,000\nOne Thing to Know: Amazon Web Services named Starling Bank as one of its four Hot Startups to watch in November 2016.\nThe Street\nNumber of Employees: 1,000 to 5,000\nTotal Funding: N/A\nOne Thing to Know: Ally Financial went public on April 10, 2014\nNumber of Employees: 101 to 250\nTotal Funding: $34.8 million\nOne Thing to Know: Digital-only bank Tandem has an official banking license with the Bank of England.\nNumber of Employees: N/A\nTotal Funding: N/A\nOne Thing to Know: Groupe BPCE acquired the Munich-based web bank on July 28, 2016.\nNumber of Employees: N/A\nTotal Funding: $2 million\nOne Thing to Know: Tide claims it can get you a business MasterCard in just three minutes.\nNumber of Employees: 101 to 250\nTotal Funding: $52.73 million\nOne Thing to Know: Famous Silicon Valley investor Peter Thiel has backed the company, which obtained a full German banking license in July 2016.\nNumber of Employees: 251 to 500\nTotal Funding: $15.29 million\nOne Thing to Know: Simple has more than 100,000 customers and processed $1.7 billion in annual transactions in 2015.\nNumber of Employees: 11 to 50\nTotal Funding: $166.34 million\nOne Thing to Know: Atom users can log in to the mobile banking app using facial recognition.\nPayments Fintech Providers & Startups\nNumber of Employees: 51 to 100\nTotal Funding: $32.45 million\nOne Thing to Know: The Des Moines-based company announced in November 2016 that it would drop its consumer app.\nVenmo\nNumber of Employees: 51 to 100\nTotal Funding: N/A\nOne Thing to Know: Braintree acquired the peer-to-peer payments company in 2012, and today it has become a household name in P2P payments.\nNumber of Employees: More than 10,000\nTotal Funding: N/A\nOne Thing to Know: PayPal was founded on December 1, 1998 and acquired by eBay on July 8, 2002.\nNumber of Employees: 51 to 100\nTotal Funding: $34.6 million\nOne Thing to Know: PayPal-owned Paydiant uses a cloud-based platform that helps merchants and banks deploy their own mobile wallets inside their own apps.\nNumber of Employees: N/A\nTotal Funding: N/A\nOne Thing to Know: The mobile wallet supports more than 300 banks, and Samsung has plans to add more.\nNumber of Employees: N/A\nTotal Funding: N/A\nOne Thing to Know: Visa Checkout has partnerships with Best Buy, Starbucks, the Home Shopping Network, Under Armour, and more.\nNumber of Employees: 11 to 50\nTotal Funding: $1.75 million\nOne Thing to Know: BitPesa currently accepts Bitcoin and delivered fiat currency directly to mobile phones in Kenya, Nigeria, Uganda, and Tanzania. It also sells Bitcoin in Kenya, Nigeria, and Uganda.\nNumber of Employees: 101 to 250\nTotal Funding: $147.66 million\nOne Thing to Know: WorldRemit is available in more than 50 countries and has received backing from investors such as Accel Partners and TCV.\nNumber of Employees: 501 to 1,000\nTotal Funding: $440 million\nOne Thing to Know: Stripe's latest funding round of $150 million values the company at more than $9 billion.\nBraintree\nNumber of Employees: 251 to 500\nTotal Funding: N/A\nOne Thing to Know: The PayPal-owned company powers payments for companies such as Airbnb, Facebook, GitHub, Pinterest, and Uber.\nNumber of Employees: 1,000 to 5,000\nTotal Funding: $291.33 million\nOne Thing to Know: Klarna recently acquired Berlin-based peer-to-peer payment startup Cookies, which had announced its was shutting down.\nNumber of Employees: N/A\nTotal Funding: N/A\nOne Thing to Know: Android Pay has a nearly 60% market penetration in Singapore.\nNumber of Employees: N/A\nTotal Funding: N/A\nOne Thing to Know: Chase Pay officially debuted its app on November 21, 2016.\nNumber of Employees: 51 to 100\nTotal Funding: $46.59 million\nOne Thing to Know: Azimo promises money transfers in one hour or less.\nNumber of Employees: N/A\nTotal Funding: N/A\nOne Thing to Know: PayPal acquired this international money transfer company on July 2, 2015.\nNumber of Employees: 251 to 500\nTotal Funding: $172.29 million\nOne Thing to Know: iZettle boasts the world's first mini chip card reader and software for mobile devices in 2010.\nNumber of Employees: 501 to 1,000\nTotal Funding: N/A\nOne Thing to Know: Square went public on November 19, 2015 and raised $243 million.\nNumber of Employees: 251 to 500\nTotal Funding: $266 million\nOne Thing to Know: Adyen's customers include Facebook, Uber, Netflix, Spotify, Airbnb, Yelp, Booking.com, SoundCloud, Vodafone, and more.\nNumber of Employees: 101 to 250\nTotal Funding: $72.2 million\nOne Thing to Know: ShopKeep has more than 23,000 customers and is a member of Apple's Mobile Partnership Program.\nNumber of Employees: 101 to 250\nTotal Funding: $100 million\nOne Thing to Know: Remitly operates in 49 of the 50 U.S. states and Washington D.C., as well as Canada.\nNumber of Employees: 251 to 500\nTotal Funding: $116.37 million\nOne Thing to Know: Transferwise CEO Taavet Hinrikus was part of the small team that started Skype in 2003.\nNumber of Employees: N/A\nTotal Funding: N/A\nOne Thing to Know: Apple Pay launched on October 20, 2014.\nInvesting & Financial Management Providers\nNumber of Employees: 101 to 250\nTotal Funding: $205 million\nOne Thing to Know: Betterment is the most popular robo-advisor in the U.S. and has more than $6 billion in assets under management.\nNumber of Employees: More than 10,000\nTotal Funding: N/A\nOne Thing to Know: The Vanguard Group manages approximately $3.6 trillion in assets.\nNumber of Employees: N/A\nTotal Funding: N/A\nOne Thing to Know: BillGuard announced on September 24, 2015 that it would become part of Prosper Marketplace.\nNumber of Employees: 51 to 100\nTotal Funding: $29.81 million\nOne Thing to Know: Moneyfarm operates in Italy and the United Kingdom.\nNumber of Employees: 51 to 100\nTotal Funding: $66 million\nOne Thing to Know: Robinhood has a service called Robinhood gold that allows for pre-market and after-market trading, additional buying power, and larger instant deposits.\nNumber of Employees: 1 to 10\nTotal Funding: $3.59 million\nOne Thing to Know: Advizr CEO Hussain Zaidi worked as a client-facing advisor for 12 years before he came up with the idea for his company.\nNumber of Employees: N/A\nTotal Funding: $75.02 million\nOne Thing to Know: Nutmeg specializes in ISAs and pensions.\nNumber of Employees: N/A\nTotal Funding: $129.5 million\nOne Thing to Know: Wealthfront manages accounts less than $10,000 for free and charges a 0.25% fee after that.\nNumber of Employees: 11 to 50\nTotal Funding: $2.2 million\nOne Thing to Know: Habito targets home buyers and tries to remove the friction of mortgage applications.\nNumber of Employees: 51 to 100\nTotal Funding: $126.5 million\nOne Thing to Know: Motif offers eight different types of accounts for different varieties of investors.\nNumber of Employees: 11 to 50\nTotal Funding: $1.85 million\nOne Thing to Know: Hedgeable focuses on millennials and touts itself as \"your personal investing sensei.\"\nNumber of Employees: 51 to 100\nTotal Funding: $60 million\nOne Thing to Know: SigFig has backing from UBS, New York Life, Santander InnoVentures, Eaton Vance, Comerica Bank, and more.\nNumber of Employees: 11 to 50\nTotal Funding: $12.27 million\nOne Thing to Know: The Munich-based company focuses primarily on risk management.\nNumber of Employees: N/A\nTotal Funding: N/A\nOne Thing to Know: Intuit acquired Mint on September 14, 2009.\nNumber of Employees: 11 to 50\nTotal Funding: $25.66 million\nOne Thing to Know: Wealthsimple is the largest automated investing service in Canada.\nNumber of Employees: N/A\nTotal Funding: N/A\nOne Thing to Know: Charles Schwab went public on January 10, 2003.\nInsurance Fintech Providers\nNumber of Employees: 11-50\nTotal Funding: N/A\nOne Thing to Know: Bought by Many was a Fintech Innovation Awards winner in 2015 and 2016.\nNumber of Employees: 11 to 50\nTotal Funding: $3.9 million\nOne Thing to Know: The insurance technology startup offers a pay-per-use policy for Uber and Lyft drivers while they are on the job.\nNumber of Employees: 11 to 50\nTotal Funding: $11.8 million\nOne Thing to Know: Shift Technology uses data to automatically detect networks of fraudsters in the insurance and e-commerce sectors.\nNumber of Employees: 1 to 10\nTotal Funding: $759,150\nOne Thing to Know: The UK-based company provides insurance on a car for only as long as the customer needs it, whether that's an hour or a day.\nNumber of Employees: 251 to 500\nTotal Funding: $727.5 million\nOne Thing to Know: The health insurance startup was founded on July 1, 2013.\nNumber of Employees: 1 to 10\nTotal Funding: $40,000\nOne Thing to Know: WeSavvy provides insurance policy rewards for healthy behaviors such as walking, running, and bicycling.\nNumber of Employees: 101 to 250\nTotal Funding: $18.3 million\nOne Thing to Know: The mobile insurance company has offices in Switzerland, Germany, and Serbia.\nNumber of Employees: 11 to 50\nTotal Funding: $6.48 million\nOne Thing to Know: Roost specializes in smart home technology.\nNumber of Employees: 1 to 10\nTotal Funding: $682,710\nOne Thing to Know: Kasko was founded on New Year's Day 2015.\nNumber of Employees: 11 to 50\nTotal Funding: $13 million\nOne Thing to Know: Lemonade has access to more than 2,500 retailers and advertisers through back-end partnerships with companies such as Apple, Netflix, Macy's, Nordstrom, Walmart, and more.\nNumber of Employees: N/A\nTotal Funding: N/A\nOne Thing to Know: Teambrella's users provide coverage to each other. When one person submits a claim within his or her team, the teammates reimburse it.\nNumber of Employees: 1 to 10\nTotal Funding: $44,000\nOne Thing to Know: Fitsense uses wearables data to help insurance companies personalize their health and life insurance packages for individuals.\nNumber of Employees: 51 to 100\nTotal Funding: $15.3 million\nOne Thing to Know: The P2P insurance company rewards small user groups with cash back bonuses at the end of the year if they remain claimless.\nNumber of Employees: 11 to 50\nTotal Funding: $4.11 million\nOne Thing to Know: Cocoon specializes in smart home security.\nMarkets, Currency, & Exchange Fintech Companies\nNumber of Employees: 101 to 250\nTotal Funding: $93.6 million\nOne Thing to Know: Ripple claims that it has partnerships with 15 of the top 50 banks.\nMary Evans Picture Library/Wikimedia\nNumber of Employees: 11 to 50\nTotal Funding: $6.5 million\nOne Thing to Know: The bitcoin exchange says it was the first to have its trading price and volume displayed on the Bloomberg terminal.\nNumber of Employees: 101 to 250\nTotal Funding: $117.21 million\nOne Thing to Know: Coinbase was founded on June 1, 2012.\nNumber of Employees: 11 to 50\nTotal Funding: $10 million\nOne Thing to Know: Bitstamp was the first regulated and licensed virtual currency exchange in the European Union.\nNumber of Employees: 11 to 50\nTotal Funding: N/A\nOne Thing to Know: BTC is the world's largest Bitcoin media group.\nNumber of Employees: 11 to 50\nTotal Funding: N/A\nOne Thing to Know: Ethereum works with bitcoin, developer APIs, consumer applications, and more.\nNumber of Employees: N/A\nTotal Funding: $67.2 million\nOne Thing to Know: Digital Asset has formed partnerships with Accenture, Broadridge, and PwC.\nNumber of Employees: 51 to 100\nTotal Funding: $136 million\nOne Thing to Know: Goldman Sachs, Accel, and other heavyweights have poured their financial support into Circle.\nLending & Financing Technology Companies\nNumber of Employees: N/A\nTotal Funding: N/A\nOne Thing to Know: AvantCredit, a subsidiary of Avant, has lent more than £2 billion to more than 450,000 around the world.\nNumber of Employees: N/A\nTotal Funding: $68.63 million\nOne Thing to Know: Zopa was one of the first three members of the U.K.'s Peer-to-Peer Finance Association, along with FundingCircle and RateSetter.\nNumber of Employees: 11 to 50\nTotal Funding: $11.50 million\nOne Thing to Know: Bond Street offers small business loans of $50,000 to $500,000 with rates starting at 6% for terms of one to three years.\nNumber of Employees: 501 to 1,000\nTotal Funding: $1.38 billion\nOne Thing to Know: SoFi has loaned $13 billion to date to more than 200,000 members.\nNumber of Employees: 11 to 50\nTotal Funding: $4.94 million\nOne Thing to Know: Assetz claims that no investor has ever made a loss in its automatic investment accounts.\nNumber of Employees: 251 to 500\nTotal Funding: $273.24 million\nOne Thing to Know: Funding Circle has provided loans to more than 20,000 businesses and helped more than 55,000 people around the world invest in small businesses.\nNumber of Employees: 101 to 250\nTotal Funding: $74.34 million\nOne Thing to Know: Younited Credit was formerly known as Prêt d'Union.\nNumber of Employees: 11 to 50\nTotal Funding: $44.70 million\nOne Thing to Know: Orchard uses its technology and infrastructure to build systems that help marketplace lenders grow.\nNumber of Employees: 1,000 to 5,000\nTotal Funding: $91 million\nOne Thing to Know: The company is the largest online consumer lending marketplace in China that serves online users and the growing middle class in the world's most populous nation.\nLending Club founder and CEO Renaud Laplanche REUTERS/Brendan McDermid\nNumber of Employees: 11 to 50\nTotal Funding: $24.8 million\nOne Thing to Know: Through the third quarter of 2016, Patch of Land had $194,083,766 in loans originated, $168,283,766 in loans funded, and returned $46,733,895 to investors.\nNumber of Employees: 101 to 250\nTotal Funding: $111.5 million\nOne Thing to Know: LendUp offers credit education courses through its website that cover credit building, consumer credit rights, and more.\nNumber of Employees: 501 to 1,000\nTotal Funding: $354.9 million\nOne Thing to Know: Prosper was the first marketplace lender in the U.S. when it launched in 2006.\nNumber of Employees: 101 to 250\nTotal Funding: $420 million\nOne Thing to Know: The San Francisco-based financial services company was found in 2012.\nNumber of Employees: 251 to 500\nTotal Funding: $152.19 million\nOne Thing to Know: Kreditech focuses on providing credit access to people with little or no credit history.\nNumber of Employees: 101 to 250\nTotal Funding: $198.18 million\nOne Thing to Know: Auxmoney is a German peer-to-peer loan marketplace.\nNumber of Employees: 501 to 1,000\nTotal Funding: $190 million\nOne Thing to Know: OnDeck has delivered more than $5 billion to small businesses worldwide.\nNumber of Employees: 101 to 250\nTotal Funding: $58.62 million\nOne Thing to Know: LendInvest touts itself as the UK's leading online platform for property lending and investing.\nNumber of Employees: 51 to 100\nTotal Funding: $7.01 million\nOne Thing to Know: Bondora has processed more than 400 million euro in loan applications from prime and near-prime borrowers.\nNumber of Employees: 11 to 50\nTotal Funding: $51 million\nOne Thing to Know: Lendio takes a customer's free application and places it in front of more than 75 lenders.\nNumber of Employees: 501 to 1,000\nTotal Funding: N/A\nOne Thing to Know: CEO Renaud Laplanche resigned after an internal probe in early May 2016.\nNumber of Employees: N/A\nTotal Funding: $22.76 million\nOne Thing to Know: Seedrs boasts that it is the leading equity crowdfunding platform in Europe, and it plans to open to U.S. investors soon.\nNumber of Employees: N/A\nTotal Funding: $238.65 million\nOne Thing to Know: Kabbage has provided more than $2 billion in funding to more than 84,000 businesses.\nNumber of Employees: 501 to 1,000\nTotal Funding: $1.69 billion\nOne Thing to Know: Lufax was incorporated in September 2011 in Shanghai with the support of Shanghai's Municipal Government and has since become China's largest Internet finance company.\nNumber of Employees: 51 to 100\nTotal Funding: $29.74 million\nOne Thing to Know: The P2P fintech platform has funded against £1,021,631,610 to date.\nNumber of Employees: 11 to 50\nTotal Funding: $4.9 million\nOne Thing to Know: The Los Angeles-based company focuses on changing U.S. laws to make it easier for startups and small businesses to raise funds through equity or revenue-based financing.\nNumber of Employees: N/A\nTotal Funding: $28.23 million\nOne Thing to Know: The equity-based crowdfunding platform has invested £197,333,589 for 325,220 registered members.\nNumber of Employees: 11 to 50\nTotal Funding: $64 million\nOne Thing to Know: BlueVine offers credit lines up to $100,000 and fixed repayments over a six-month period.\nNumber of Employees: 51 to 100\nTotal Funding: $46.83 million\nOne Thing to Know: RateSetter has lent £1,581,503,579 to date.\nMore to Learn\nThis comprehensive list of fintech companies merely scratches the surface of the fintech industry, which is growing in unprecedented ways.\nThat's why BI Intelligence spent months compiling the best and most exhaustive guide on the world of fintech entitled The Fintech Ecosystem Report: The Emerging Technologies and Firms Driving Change in Financial Services and How Legacy Players Can Navigate The Disruption.\nTo get your copy of this invaluable guide to the payments industry, choose one of these options:\nSubscribe to an ALL-ACCESS Membership with BI Intelligence and gain immediate access to this report AND over 100 other expertly researched deep-dive reports, subscriptions to all of our daily newsletters, and much more. >> START A MEMBERSHIP Purchase the report and download it immediately from our research store. >> BUY THE REPORT\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of the fast-moving world of financial technology.","url":"https://www.businessinsider.com/top-financial-services-providers-and-fintech-startups-2016-12"}
