{"authors":[],"date_download":"2018-10-23 02:59:16","date_modify":"2018-10-23 02:59:16","date_publish":"2017-04-26 14:16:27","description":"An El Salvadoran transgender advocate, five detained Cambodian activists and an Egyptian legal scholar were nominated on Wednesday for one of the world's...","filename":"data/vaneerConsumption/Tophumanrightsprizenamesfinalists.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/14/wire-465407-1493212588-926_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4447810_Top-human-rights-prize-names-finalists_1540263556.html","title":"Top human rights prize names finalists","title_page":"Top human rights prize names finalists | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Nay Vanda (C), pictured outside the court in Phnom Penh in 2016, is among five Cambodian rights campaigners nominated for the Martin Ennals Award\nAn El Salvadoran transgender advocate, five detained Cambodian activists and an Egyptian legal scholar were nominated on Wednesday for one of the world's most prestigious human rights prizes.\nOrganisers of the Martin Ennals Award expressed hope that the spotlight could offer protection to the nominees, who like many rights campaigners worldwide are facing an increasingly hostile climate.\nOne finalist for the prize, to be awarded in October, is Mohamed Zaree, a legal scholar and the Egypt Office Director of the Cairo Institute for Human Rights Studies (CIHRS).\nAmid a general crackdown on human rights movements in Egypt, the CIHRS has had its assets frozen while Zaree has faced death threats and been slapped with a travel ban, and he fears imprisonment, the prize committee said.\nGerald Staberock, head of the World Organisation Against Torture and a Martin Ennals jury member, warned that the situation for rights defenders in Egypt was more dire than it was under Hosni Mubarak's 30-year regime, which was toppled in 2011.\n\"Now it is worse than ever before... It's frightening,\" he told reporters in Geneva.\nEgypt is not alone in seeing its rights situation deteriorate.\nIn 2016, 281 human rights activists were murdered across 25 countries -- more than double the number in 2014, according to statistics from Front Line Defenders.\n- 'Climate change' on rights -\n\"There is a real human rights climate change around the world,\" Staberock warned, pointing to the spread of political discourse that defies long-accepted norms, including US President Donald Trump's explicit endorsement of torture.\nAmong the finalists for this year's Martin Ennals prize are five Cambodian rights defenders known as the Khmer Five.\nCambodia is also witnessing a rising crackdown on activists and the political opposition.\nThe five -- Ny Sokha, Yi Soksan, Nay Vanda, Lim Mony and Ny Chakrya -- have languished in pre-trial detention for the past year, facing charges linked to their work with the Cambodian Human Rights and Development Association (ADHOC).\nThis year's third nominee is Karla Avelar, a 39-year-old transgender woman who suffered horrific rape, abuse and violence.\nShe then helped found El Salvador's first association for trans people, and its first organisation for trans women with HIV.\nMichael Khambatta, director of the Martin Ennals awards, said it was important to shine a light on abuse targeting the LGBT community in El Salvador, where he said trans people especially suffer \"astronomical\" levels of crime.\nThat is certainly true for Avelar, who was abused as a child before fleeing to the streets where she was forced into prostitution at the age of 11, contracted HIV and was shot multiple times.\nThe Geneva-based Martin Ennals Foundation is named after the first secretary general of Amnesty International, who died in 1991.\nThe prize is judged by 10 leading rights groups, including Amnesty and Human Rights Watch.","url":"https://www.dailymail.co.uk/wires/afp/article-4447810/Top-human-rights-prize-names-finalists.html"}
