{"authors":["Edwin Mora"],"date_download":"2018-10-30 17:54:41","date_modify":"2018-10-30 17:54:41","date_publish":"2016-09-02 02:36:17","description":"Afghanistan is combating the devil, intent on destroying humanity, declared the country’s Chief Executive Officer (CEO) Abdullah Abdullah.","filename":"data/vaneerConsumption/TopLeaderAfghanistanIsFightingTheDevil.json","image_url":"https://media.breitbart.com/media/2016/08/fire-fight-against-taliban-helmand-afghanistan-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_09_01__1540922081.html","title":"Top Leader: Afghanistan Is Fighting 'The Devil'","title_page":"Top Leader: Afghanistan Is Fighting 'The Devil' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Afghanistan is combating forces of the “devil and darkness” intent on destroying humanity, declared the country’s Chief Executive Officer (CEO) Abdullah Abdullah as he called for increasing support to the U.S.-backed Afghan National Defense and Security Forces (ANDSF).\nTogether with President Ashraf Ghani, Abdullah leads the Afghanistan National Unity Government (NUG).\nHis comments come amid growing rifts between the two leaders that some analysts believe place the country’s security at risk. Khaama Press reports:\nThe Chief Executive Officer Abdullah Abdullah said Afghanistan is fighting the forces of devil and darkness as he insisted on increasing support to the Afghan National Defense and Security Forces (ANDSF). In his speech during a conference on the Future of Police in Afghanistan, CEO Abdullah said Afghanistan is facing a fight that is against humanity. Abdullah further added that the terrorist groups fighting in Afghanistan have no faith in peace and stability.\nThe ANDSF, which includes police and military units, are primarily focused on fighting the Taliban and its rival, the Islamic State (ISIS/ISIL) branch in the Afghanistan-Pakistan region known as the Khorasan Province (ISIL-K/IS-KP).\nDespite more than a decade of training provided by the U.S. military and nearly $70 billion in American taxpayer funds devoted to its development, the Afghan security forces continue to face capability gaps.\nMeanwhile, the Taliban, the most prominent jihadi group in Afghanistan, continues to seize territory.\nCiting the U.S. forces in Afghanistan, the Special Inspector General for Afghanistan Reconstruction (SIGAR) recently reported that the Afghan government has lost control of nearly one-third of Afghanistan, primarily to the Taliban.\nMoreover, the terrorist group has inflicted a record number of casualties on the ANDSF and civilians, particularly targeting children.\nAlthough the Taliban remains the strongest jihadi group in Afghanistan, ISIL-K has also contributed the growing unrest in the country.\nIn late July, the group claimed responsibility for what is considered the deadliest attack in the Afghan capital of Kabul since the war started nearly 15 years ago — killing 80 and injuring 231 others.\nSecurity conditions in Afghanistan have deteriorated since President Barack Obama declared an end to the U.S. combat mission in late December 2014 after dramatically reducing the American military presence in the country.\nThe end of the combat mission allegedly marked a full transition to a train, advise, and assist (TAA) role and limited counterterrorism efforts.\nHowever, U.S. forces have since been drawn into combat against the Taliban and ISIL-K. The Obama administration has also been forced to increase the number of U.S. troops in Afghanistan to deal with an increase in terrorist activity that followed Obama’s end of combat declaration.\nObama has decided to keep 8,400 U.S. troops in Afghanistan through 2017.\nThe chief of U.S. Central Command, which oversees U.S. military operations in most of the Middle East and Southwest Asia, painted a rosy picture of security conditions in Afghanistan earlier this week.\nGen. Joseph Votel, the CENTCOM commander, told reporters at the Pentagon:\nOur efforts in Afghanistan also continue to pay dividends… The Afghans today are in the lead and they are taking the fight to the enemy through their sustainable security strategy… They continue to demonstrate resiliency and they are proving capable of defending their sovereign spaces. Meanwhile, our train, advise and assist and our counterterrorism efforts in Afghanistan are also proving effective, to include our efforts against the ISIL affiliate in Afghanistan, the Islamic State in the Khorasan province.\nIn July, U.S.-backed Afghan security forces launched an operation targeting ISIL-K in its stronghold of Nangarhar province, located in eastern Afghanistan along the Pakistan border.\nGen. Votel noted that the operation has “resulted in destruction of 25 percent” of ISIL-K’s forces.\n“With President Obama’s decision to keep 8,400 U.S. troops in-country through 2017, and with the additional authorities that have allowed us to target the Islamic State in the Khorasan, and to accompanying Afghan forces, I’m confident that we will see the Afghans continue to build on the momentum achieved to date,” he added.\nIn July, Gen. John Nicholson, the top commander of U.S. and NATO forces in Afghanistan, estimated that the number of ISIL-K fighters had dropped to “between 1,000 and 1,500 at the present time.”","url":"https://www.breitbart.com/national-security/2016/09/01/top-afghan-leader-afghanistan-fighting-forces-devil-darkness/"}
