{"authors":["Virginia Hale"],"date_download":"2018-10-30 21:56:05","date_modify":"2018-10-30 21:56:05","date_publish":"2016-08-11 17:17:16","description":"Countries should have their funding slashed if they fail to show sufficient “solidarity” on migrant issues, two influential MEPs have said.","filename":"data/vaneerConsumption/TopMEPsThreatenToSlashFundsToMigrantScepticCountries.json","image_url":"https://media.breitbart.com/media/2016/08/EUROPE-MIGRANTS-CZECH-POLAND-SLOVAKIA-HUNGARY.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_08_11__1540936565.html","title":"Top MEPs Threaten To Slash Funds To Migrant-Sceptic Countries","title_page":"Top MEPs Threaten To Slash Funds To Migrant-Sceptic Countries | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hungary, Poland and other countries should have their funding slashed if they fail to show sufficient “solidarity” on migrant issues, or respect for “European values”, two influential MEPs have said.\nThe recommendation comes as three anti-mass migration leaders of Visegrad countries are set to unite against pressure from Brussels demanding they accept a quota of migrants.\nIngeborg Grässle, head of the European Parliament’s committee on budgetary control, said: “There needs to be stronger rules for the disbursement of funds.”\n“Countries that don’t respect EU laws, or countries that don’t participate enough in the resettlement of migrants or the registration of refugees, should be deprived of funds,” the Christian Democratic Union (CDU) politician told Die Welt.\nEuropean Parliament Vice President Alexander Graf Lambsdorff noted that the European Union (EU) budget will be reviewed in Autumn, and pointed to Poland and Hungary as nations that could face punishment.\nHe told the German newspaper: “The federal government must ensure, when the EU budget is reviewed this autumn, that EU countries that are net recipients, such as Poland and Hungary, show more solidarity in the issue of refugees and also respect European values.”\nAt the end of next month Hungarian Prime Minister Viktor Orbán, Czech president Miloš Zeman, and Slovakian leader Robert Fico will meet at the Rhodes Forum. All three object to Brussels plans which would see large numbers of mostly Muslim migrants sent to their nations.\nRobert Fico, who proclaimed in May that “Islam has no place in Slovakia”, has been critical of how much decision-making power certain member states hold in the EU.\n“Crucial decisions about the future of Europe cannot be defined by two, three member states, or the founding states of the EU,” Mr. Fico told reporters last month.\nHe said: “There are policies of the EU that need to be labeled as failed ones quite clearly. The vast majority of EU citizens fully disagree with the current state of migration policies in the EU.”\nIn October, Hungary is set to hold a referendum on Brussels’ demand that the country accept a quota of migrants from the Middle East.\nHungary’s Minister of State Károly Kontrát last week insisted migration had brought terrorism to Europe. He said: “It is clearly demonstrable and can be stated as a fact that there is a connection between immigration and terrorism.\n“Other consequences of the migration crisis are health care implications as well as implications of a social, cultural and economic nature.\n“More than 300 people have died in Europe as a result of terrorist attacks since mass illegal immigration started, and these attacks were committed by terrorists, with an immigrant background.”","url":"https://www.breitbart.com/europe/2016/08/11/slash-funds-migrant-sceptic-countries/"}
