{"authors":["Jessica Taylor"],"date_download":"2018-10-23 01:06:50","date_modify":"2018-10-23 01:06:50","date_publish":"2015-11-30 00:00:00","description":"New Jersey Gov. Chris Christie nabbed the backing of the New Hampshire Union Leader this weekend, citing his executive and national security experience. But that doesn't mean he's guaranteed a win.","filename":"data/vaneerConsumption/TopPapersEndorsementDoesntAlwaysEqualSuccessInNewHampshire.json","image_url":"https://media.npr.org/assets/img/2015/11/30/ap_934080359283_wide-b53ea763c94c9b8e31980b10bf6336790abfeb19.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_11_30_457910303_top-papers-endorsement-doesnt-always-equal-success-in-new-hampshire_1540256810.html","title":"Top Paper's Endorsement Doesn't Always Equal Success In New Hampshire","title_page":"Top Paper's Endorsement Doesn't Always Equal Success In New Hampshire : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Top Paper's Endorsement Doesn't Always Equal Success In New Hampshire\nEnlarge this image toggle caption Jim Cole/AP Jim Cole/AP\nChris Christie was giving thanks this weekend for one of the biggest prizes in Granite State politics: the endorsement of the New Hampshire Union Leader.\nIt's a notable get for the New Jersey governor, who has struggled to catch fire both nationally and in the early states. Christie had a good performance in this month's GOP debate despite dropping down to the undercard faceoff. He has gotten some momentum after that performance and has been playing up his national security experience in the aftermath of this month's deadly terrorist attacks in Paris.\nThat experience is exactly why the newspaper declared it was backing Christie on its front page on Sunday. Union Leader Publisher Joe McQuaid wrote in the editorial:\n\"Gov. Christie is right for these dangerous times. He has prosecuted terrorists and dealt admirably with major disasters. But the one reason he may be best-suited to lead during these times is because he tells it like it is and isn't shy about it. Other candidates have gained public and media attention by speaking bluntly. But it's important when you are telling it like it is to actually know what you are talking about.\"\nChristie can only go up from here — he's currently at less than 3 percent in the RealClear Politics average of polling in the state. But the paper's endorsement isn't a silver bullet. The Union Leader doesn't have the best track record when it comes to picking the next president, the eventual GOP nominee — or even the winner of the New Hampshire primary.\nIn the past 50 years, the paper has endorsed only four New Hampshire primary winners — Richard Nixon in 1968, Ronald Reagan in 1980, Pat Buchanan in 1996 and John McCain in 2008. Of those, only Nixon, Reagan and McCain would go on to win the Republican nomination, and just Nixon and Reagan would be successful in their quest for the presidency.\nSo, in the past 35 years, the Union Leader hasn't picked a president.\nMore recently, the Union Leader's choice has faded quickly once voting began. In 2000, wealthy publishing executive Steve Forbes finished a very close second to George W. Bush in Iowa. He fell to a distant third in New Hampshire, far behind winner McCain and the second-place Bush. He would withdraw days later.\nBut no endorsement by the Union Leader flopped more than its pick of Newt Gingrich in 2012. The former House speaker looked like he was on the rise in late November 2011 but began to slide in mid-December. He would finish a disappointing fourth in New Hampshire but did rebound to win the South Carolina primary — the apex of his White House bid.\nBut the paper's endorsement should not be outright dismissed, especially for a candidate deeply in need of a boost, like Christie. The candidates who have been endorsed by the Union Leader in the past have at least gotten a marginal boost in the New Hampshire primary, according to FiveThirtyEight.\nIn 2008, McCain climbed 21 points from where he was polling to where he finished on Election Day. Gingrich went up 9 percentage points.\nSo, while history may not be entirely on Christie's side as far as winning the state goes, the endorsement is still a coup for him, especially if he can leverage it right.\nUniversity of New Hampshire political science professor Dante Scala noted that right now Christie's campaign in the state is closely mirroring McCain's from eight years ago — an aggressive town hall schedule and strong retail politicking in every corner of the state.\n\"I think for Christie, it gives him something to hang his hat on,\" Scala said. \"He's been all over the state trying to duplicate McCain's magic. He can tell donors, 'Look I'm getting traction. Even though I'm not at the top of the polls, stick with me.' \"\nThere are a few reasons Christie is likely to fare better than Gingrich. He has a more robust operation in the state than the former speaker ever did. And he is a natural in the freewheeling town hall events that are popular with New Hampshire Republicans. They showcase his blunt, no-nonsense style that made him a national favorite initially.\nPlus, Scala noted, Christie is stopping in many far-flung towns, where presidential candidates don't typically stop, which could help him build deep support.\nNew Hampshire voters also are traditionally late to decide whom to support. So, while Donald Trump is still leading polls there, many in the state are skeptical he can keep that lead until the Feb. 9 primary. In 2012, Gingrich began with a distinct disadvantage: Not only was his organization shallow, but Mitt Romney, the former Massachusetts governor with a home in New Hampshire, started with a commanding lead. Far more candidates are in the race this year; the contest is more unsettled, and there's an opening for several candidates to still break out.\nStill, there's the question of how relevant newspaper endorsements are in the age of social media and 24/7 news. While many conservatives in the state may read and respect the Union Leader's right-leaning editorial board, they also have far more sources to choose from than they did even eight years ago. While the paper's pick of Christie could make them take notice, they're also likely to be listening to talk radio and conservative TV like Fox News.\n\"Those New Hampshire conservatives who are certainly going to vote Republican next February, are they going to be hearing varying messages from other conservative messengers?\" Scala asked.\nThe Union Leader's endorsement does note a shift in thinking since the Paris attacks, though. McQuaid, the paper's publisher, said on NBC's Meet The Press that the board only considered governors when making its choice. And it was Christie's experience as a U.S. attorney that stood out over his two other gubernatorial rivals, Ohio Gov. John Kasich and former Florida Gov. Jeb Bush.\n\"Jeb Bush doesn't look like he wants it, and the public senses that,\" McQuaid said on NBC. \"I'm looking for somebody who can get the nomination, and I don't think either Bush or Kasich can do so.\"\nIn the editorial, he took a particularly noticeable swing at some of the freshman senators running — Ted Cruz (Texas), Marco Rubio (Florida) and Rand Paul (Kentucky) — comparing them to President Obama eight years ago.\n\"We don't need another fast-talking, well-meaning freshman U.S. senator trying to run the government,\" McQuaid wrote. \"We are still seeing the disastrous effects of the last such choice.\"\nAnd there was another dig that seemed aimed at Trump, Ben Carson and Carly Fiorina: \"We don't need as President some well-meaning person from the private sector who has no public experience.\"\nAnother line that seemed squarely about Trump signaled that the paper would use its power to go after the controversial businessman: \"Other candidates have gained public and media attention by speaking bluntly. But it's important when you are telling it like it is to actually know what you are talking about. Gov. Christie knows what he is saying because he has experienced it. And unlike some others, he believes in what he says because he has a strong set of conservative values.\"\nThough this endorsement came around the same time the paper backed Gingrich in 2012, its pick has time to have more impact. The 2016 primary is a month later.\nIf the paper spends time not only boosting Christie but attacking Trump, it could truly test whether the front-runner is bulletproof. On NBC Sunday, McQuaid even said some of Christie's \"Trumplike\" qualities in the way he speaks could help him peel away voters.\n\"Americans seem to be fed up with Washington, and they are looking for somebody who speaks with the 'bark off,' as we say in New Hampshire,\" McQuaid argued. \"And I think Christie does that. But as we said in the editorial, he does that knowing what he's talking about, as opposed to some others who don't.\"","url":"https://www.npr.org/2015/11/30/457910303/top-papers-endorsement-doesnt-always-equal-success-in-new-hampshire"}
