{"authors":["John Hayward"],"date_download":"2018-10-30 17:54:30","date_modify":"2018-10-30 17:54:30","date_publish":"2016-03-10 05:39:35","description":"Flourishing in the ruins of post-Qaddafi Libya, the Islamic State has grown ambitious enough to attack neighboring Tunisia.","filename":"data/vaneerConsumption/TopUSGeneralinAfricaCallsLibyaFailedState.json","image_url":"https://media.breitbart.com/media/2016/02/Libya-Nationalism-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_09__1540922070.html","title":"Top U.S. General in Africa Calls Libya 'Failed State'","title_page":"Top U.S. General in Africa Calls Libya 'Failed State'","title_rss":"NULL","source_domain":"breitbart.com","text":"Flourishing in the ruins of post-Qaddafi Libya, the Islamic State has grown ambitious enough to attack neighboring Tunisia. Meanwhile, the Pentagon has drawn up plans for U.S. military operations, including airstrikes against up to 40 targets, while the top American general in Africa pronounced Libya a “failed state.”\nThe New York Times describes Tunisians as engulfed by fear of an ISIS invasion after “dozens of militants stormed a Tunisian town near the border, assaulting police and military posts in what the president called an unprecedented attack.”\nAccording to the Times report, some of the militants “had local accents and had pronounced themselves as liberators,” but Tunisian President Beji Caid Essebsi was convinced they were agents of the Islamic State, looking to establish a foothold in his country to expand their Libyan holdings.\n“Most Tunisians are in a state of war against this recklessness, against these rats,” President Essebsi declared.\nAl-Jazeera describes Ben Gardane, the town that came under attack, as the “gateway to Libya,” and also “a hub for arms trafficking and smuggling of everyday goods.” Tunisian officials seem nervous about the number of ISIS militants that might have already crossed the border and taken positions inside their country, ready to launch further attacks.\nThe battle on Monday killed at least 54 people, including 36 militants. Another clash nearby involved some 50 attackers and resulted in six more deaths. After the invaders were driven out and security forces sealed the border, an “enormous stash of weapons” was discovered, including “rifles, explosives, and rocket launchers.” Some of the militants are thought to be hiding in uninhabited homes near the sites of their assaults.\nAs the Times sadly observes, Tunisia was the closest thing to a success story anyone could point to after the “Arab Spring” in 2011. Just about everywhere else in the Middle East, the Arab Spring was merely a prelude to a bitter Islamist winter, as well-organized Islamic fascist parties seized control from deposed kleptocrats, using the “flowering of democracy” as a means to impose a different brand of authoritarianism.\nVarious Islamist factions have been salivating over Tunisia ever since, launching high-profile murder sprees against both Tunisians and Western tourists to destabilize the country and cripple its economy. It looks like all of those Islamist attacks source back to post-Obama Libya, as the terrorists responsible for the bloody massacres in Tunisia were trained there.\nIn response, Tunisia has begun construction on “a 125-mile-long berm along half of the border with Libya, and says it has contracted American and German firms to install electronic surveillance equipment to further secure that border.”\nThe Pentagon has drawn up plans for an aggressive U.S. military campaign against Libyan ISIS, including airstrikes against “as many as 30 to 40 targets in four areas of the country,” followed by ongoing bombing missions to support Libyan militia forces, according to another New York Times report.\nHowever, the plan has been set aside by the White House, because it wants to push forward with “a diplomatic initiative to form a unity government from rival factions inside Libya.”\nThis has often been cited as a reason Western powers will not intervene against the Islamic State in Libya. They do not want to relieve pressure from the warring factions in the divided country before they work out a sustainable unity government deal, something that has not happened even with both of Libya’s “capitals” threatened by ISIS.\nAlso, Western military planners often speak of how difficult it would be to coordinate even a limited bombing campaign without a central Libyan command authority, much as efforts to assist the Syrian rebellion were complicated by its chaotic nature.\nIt does not help that the Obama administration is chaotic itself, in these fading days of his presidency, torn by conflicting priorities for military action, diplomatic leverage, and domestic political considerations.\nFor example, the New York Times reports “the scope of the military plan surprised some senior administration officials, and it drew warnings from some State Department officials that such airstrikes, if not coordinated properly, could jeopardize the United Nations-led effort to forge a unity government from Libya’s fractious political actors.”\n“Where there is opportunity to conduct operations against ISIL, to disrupt them at this point and not undermine the political process, that is where we are. At some point in the future, if I believe we are at risk with that strategy, I will certainly come back to the secretary and make some different recommendations,” said Joint Chiefs chairman General Joseph F. Dunford Jr.\nThe Times only briefly alludes to the even grimmer testimony of America’s top general in Africa, Army General David Rodriguez, before the Senate Armed Services Committee on Tuesday, but Defense One has a fuller account of Rodriguez’s judgment that Libya is a “failed state,” despite the much-ballyhooed agreement in principle to form a unity government:\nRodriguez estimated that it would take “10 years or so” to achieve long-term stability in Libya. He cited a “fractured society” and the lack of government institutions as major hurdles to overcome. “The continued absence of central government control will continue to perpetuate violence, instability and allow the conditions for violent extremist organizations to flourish until the (government) and appropriate security forces are operational within Libya,” Rodriguez told the committee.\nDefense One notes that even Secretary of State John Kerry came very close to pronouncing doom for Libya two weeks ago, brought up short only by an expression of faith in the very same unity negotiations Rodriguez views with pessimism. “It’s close. If they cannot get themselves together, yes, it will be a failed state,” said Kerry.","url":"https://www.breitbart.com/national-security/2016/03/09/libya-isis-attacks-tunisia-as-pentagon-considers-air-strikes/"}
