{"authors":["Associated Press"],"date_download":"2018-10-23 01:19:44","date_modify":"2018-10-23 01:19:44","date_publish":"2016-01-28 15:38:44","description":"BAGHDAD (AP) — The top U.S. general in Iraq warned Thursday of the potential collapse of Mosul Dam in the country's north, saying such an event could prove \"...","filename":"data/vaneerConsumption/TopUSgeneralinIraqwarnsMosulDamcouldcollapse.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420983_Top-US-General-Iraq-warns-Mosul-Dam-collapse_1540257584.html","title":"Top US general in Iraq warns Mosul Dam could collapse","title_page":"Top US general in Iraq warns Mosul Dam could collapse | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Top US general in Iraq warns Mosul Dam could collapse\nBAGHDAD (AP) — The top U.S. general in Iraq warned Thursday of the potential collapse of Mosul Dam in the country's north, saying such an event could prove \"catastrophic.\"\nThe U.S.-led coalition is still determining the likelihood the hydroelectric dam could collapse but has developed a contingency plan alongside the Iraqi government, said U.S. Army Lt. Gen. Sean MacFarland.\nBuilt in the early 1980s, the dam is made largely of earth and situated on soft mineral foundations, which are easily dissolved by water. A report in 2006 by the U.S. Army Corps of Engineers called it \"the most dangerous dam in the world\" because of its propensity to erode.\nSince the Islamic State group extended its territory across Iraq in summer 2014, maintenance teams have at times struggled to gain access to the site. IS seized the dam in July of that year, but Iraqi forces and Kurdish fighters, with coalition air support, took it back within weeks.\nSituated on the Tigris River, the dam is the largest in Iraq and the fourth-largest in the Middle East. It once supplied electricity and water to much of the country, but now only operates at partial capacity.\nThe coalition and Iraqi forces have drafted plans to move civilians to safety should the dam collapse, MacFarland said, warning that \"when it goes, it's going to go fast, and that's bad.\"\nSpeaking to The Associated Press by phone, Riyadh Izeddin, the director general of the dam, said he had not been informed by the U.S. about any such contingency plan.\n\"The Americans didn't tell us anything,\" he said, countering the coalition's assessment that the structure is in serious danger.\n\"There is nothing to be afraid of. There is nothing seriously wrong with the dam,\" Izeddin said.\nThe 2006 report by the corps said the dam's collapse would put Mosul — Iraq's second-largest city — under 20 meters (65 feet) of water and kill an estimated half a million people.\n\"If this dam was in the United States, we would have drained the lake behind it,\" MacFarland said.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3420983/Top-US-General-Iraq-warns-Mosul-Dam-collapse.html"}
