{"authors":[],"date_download":"2018-10-23 03:04:03","date_modify":"2018-10-23 03:04:03","date_publish":"2016-01-28 18:25:26","description":"The hunt for a vaccine to prevent the Zika virus could take years, a top US health chief said Thursday amid a worrying outbreak of the mosquito-borne illness...","filename":"data/vaneerConsumption/TopUSresearchersaysZikavaccineisyearsaway.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h3xt-2vdWmEltwXfba0ce28e632b925d3-786_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421480_Top-US-researcher-says-Zika-vaccine-years-away_1540263843.html","title":"Top US researcher says Zika vaccine is years away","title_page":"Top US researcher says Zika vaccine is years away | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Top US researcher says Zika vaccine is years away\nThe hunt for a vaccine to prevent the Zika virus could take years, a top US health chief said Thursday amid a worrying outbreak of the mosquito-borne illness blamed for birth defects.\nThere is no vaccine or treatment for Zika, which the World Health Organization said is \"spreading explosively\" through the Americas and may lead to as many as four million cases in the region.\nZika can cause microcephaly -- abnormally small heads and brains -- in babies born to infected women.\nA lab technician analyses blood samples in Rio de Janeiro, Brazil, on January 25, 2016 ©Vanderlei Almeida (AFP/File)\nAnthony Fauci, the director of the National Institute for Allergy and Infectious Diseases (NIAID), said the US government is working on two approaches toward a vaccine against Zika, based on research already done on related mosquito-borne viruses.\nThe first is a \"DNA-based vaccine using a strategy very similar to what we employed for another flavivirus, the West Nile virus,\" he told reporters. Flaviviruses are generally transmitted by mosquitoes or ticks.\n\"Secondly, a live attenuated vaccine, building on similar and highly immunogenic approaches used for the closely related dengue virus,\" he added.\nHopes are high that a so-called Phase I clinical trial could begin later this year to test the safety and efficacy of a Zika vaccine in people, but Fauci cautioned that a finished product will take far longer.\n\"While these approaches are promising, it is important to understand that we will not have a widely available, safe and effective Zika vaccine this year and probably not even in the next few years,\" he said.\nThe US Centers for Disease Control and Prevention (CDC) has warned women who are pregnant or want to become pregnant to avoid traveling to areas in Latin America and the Caribbean that are experiencing outbreaks of the virus.\nAlthough the Zika virus was first documented in 1947, it caused only sporadic and small outbreaks of illness until recently. Little is known about it.\n\"Please take this seriously,\" said CDC principal deputy director Anne Schuchat.\n\"It is very important that you understand that we don't know as much as we want to know about this yet, and while we are learning more it is prudent to consider postponing travel.\"\nSome airlines are offering refunds to expectant mothers with tickets to any of 22 countries or territories with outbreaks of the disease.\nBrazil experienced its first outbreak of Zika last year and has seen the number of microcephaly cases soar, from 163 a year on average to more than 3,718 suspected cases, according to the health ministry.\nA total of 31 cases of Zika have been documented in the United States since last year, all involving people who were infected while they were out of the country, Schuchat said.\nIn the future, \"it is possible, even likely, that we will see limited Zika outbreaks in the US,\" Schuchat said, particularly in the southern parts of Florida and Texas.\nFauci said the United States typically spends $97 million per year on viruses that are transmitted by mosquitoes and ticks, and it will draw from that pool of money to fund new Zika research in a host of areas, including diagnostic tests, vaccines, basic research and vector control.","url":"https://www.dailymail.co.uk/wires/afp/article-3421480/Top-US-researcher-says-Zika-vaccine-years-away.html"}
