{"authors":[],"date_download":"2018-10-30 14:38:47","date_modify":"2018-10-30 14:38:47","date_publish":"2018-07-03 15:17:00","description":"It's good in a variety of recipes, beyond just cutting one up and eating it on the spot.","filename":"data/vaneerConsumption/Topwatermelonrecipesforthesummer.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/04/Images/newsEngin.22017847_070518-Watermelon-13.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_food--cooking_ch_531e04381bdf878d1d302292ab5c470c__1540910327.html","title":"Top watermelon recipes for the summer","title_page":"Top watermelon recipes for the summer","title_rss":"NULL","source_domain":"ajc.com","text":"Summer, for me, has always meant an abundance of watermelon.\nGrowing up in rural South Georgia in the ’60s and ’70s, you’d see pickups so overloaded with ginormous melons that they almost touched the ground. (You still do, in fact. You just can’t score one for a dollar bill.) And when it came time to cut a watermelon, it wasn’t unusual to have an entire half melon all to yourself.\nDressed in wet swimsuits, we’d cut out the frothy pink heart and slurp it down, juice dripping down our arms and legs. The adults would warn us not to swallow too many seeds, lest a vine take root in our stomach. (Yuk, yuk.) We’d throw what we didn’t want to the hogs and let them go at it, jostling for choice chunks of watermelon that I’d probably save in the refrigerator today.\nA few weeks ago, I posted a note on Facebook asking for watermelon recipes. No surprise that a number of folks from my hometown, Bainbridge, told me they were purists. “No salt, no feta, no basil, no onion. Just cold and unadorned,” said Bryant Conger, now a physician in Roswell.\nOthers offered exotic ideas reflecting their own heritage.\nCookbook author and Mumbai native Raghavan Iyer said he likes to make watermelon curry with red chiles and garlic. The dish, from the Indian region of Rajasthan, is in his cookbook “660 Curries” (Workman Publishing, $29.95).\nNandita Godbole, a chef, cookbook author and blogger in Roswell, piqued my attention with the mention of Watermelon Bombs, so I asked her to elaborate. Seems she dusts melon balls with a mixture of rock salt, pepper, dried mint, dried mango and roasted cumin. Sometimes she douses them with rum or mango vodka.\nWhile many people make a salad of watermelon and feta, often with red onion and fresh mint or basil, New Orleans chef Alon Shaya likes to spice it up with harissa, a red-chile paste from northwest Africa that is common in his native Israel.\nAs the James Beard Award-winning chef writes in his new cookbook, “Shaya: An Odyssey of Food, My Journey Back to Israel” (Knopf, $35), the harissa adds “a whole new dimension, a darker, ruddier flavor, to the mix.” Made from rehydrated arbol, guajillo and ancho chiles, and a cooling touch of cumin and coriander, Shaya’s harissa is downright addictive. It makes a strong case for putting hot sauce on cool, sweet watermelon.\nAs I tested recipes for this article, I was reminded how lovely watermelon is to sip. And there’s no need to be fancy about it: Once you’ve scooped the flesh out of half a melon, I invite you to turn it up like a cup and slurp down the accumulated pink juices.\nLearn how to tap a watermelon with AJC food and dining editor, Ligaya Figueras. The perfect summer drink awaits. (Erica A. Hernandez/AJC)\nTo get a watermelon base for concocting drinks, you can puree chunks in a blender or food processor. Or simply put it in a bowl and crush it with a potato masher—the soft flesh breaks up easily. If you want a cleaner juice, strain it through a wire-mesh sieve or cheesecloth.\nNow you can concoct agua frescas, teas, lemonades, cocktails.\n<","url":"https://www.ajc.com/lifestyles/food--cooking/chomped-slurped-even-sipped-watermelon-taste-summer/EdH1pYRnZuPo7Cc0PX5NMP/"}
