{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 21:51:58","date_modify":"2018-10-22 21:51:58","date_publish":"2016-01-29 08:19:09","description":"There have been some ugly financial disclosures lately involving the actress and her family. And Tori Spelling, 42, only added to the confusion on Thursday while she was out running some errands","filename":"data/vaneerConsumption/ToriSpellingforksoutonextravagantlyexpensivecakedespitemoneyworries.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30B01A3A00000578-0-image-a-47_1454049412252.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422258_Tori-Spelling-forks-extravagantly-expensive-cake-despite-money-worries-unpaid-bills_1540245118.html","title":"Tori Spelling forks out on extravagantly expensive cake despite money worries","title_page":"Tori Spelling forks out on extravagantly expensive cake despite money worries | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"There have been some ugly financial disclosures lately involving the actress and her family.\nBut that seemed like the furthest thing from Tori Spelling's mind as she forked out on an expensive cake on Thursday while out running errands in Los Angeles.\nJust as it appeared the 42-year-old may be starting to humble, she surprised with the rather opulent purchase.\nScroll down for video\nPriorities? Tori Spelling, 42, only added to the confusion surrounding her financial situation on Thursday while she was out running some errands in Los Angeles\nThe ex 90210 star decided to keep things simple for her day out, opting for a long white loose-weave shirt with a low cut neckline, some form-fitting blue jeans with the bottoms rolled up and brown leather slip-ons.\nA brown fringe purse, oversize cat-eye shades and a black floppy-brim fedora completed the airy look.\nAfter gassing up her car, the only daughter of deceased television mega producer Aaron Spelling went to buy what looked to be a red bow and a card, then headed over to pick up a cake from the sumptuous Sweet Lady Jane bakery.\nFrequented by many celebrities and other well-to-do pastry enthusiasts, a cake from the establishment starts at $40 and can end up costing hundreds for a custom order.\nNothing fancy: The ex 90210 star decided to keep things simple for her day out, opting for a long white loose-weave shirt with a low cut neckline, some form-fitting blue jeans with the bottoms rolled up and brown leather slip-ons\nShopping: After gassing up her car, the only daughter of deceased television mega producer Aaron Spelling went to buy what looked to be a red bow and a card, then headed over to pick up a cake from the sumptuous Sweet Lady Jane bakery\nThe luxurious purchase comes at a time of financial hardship for the Mystery Girls star.\nIt was reported only last week by TMZ that Tori is allegedly being sued by American Express for an unpaid credit card balance of $37,981.97.\nAccording to legal documents obtained by the news outlet, Tori’s last attempt to pay off the debt came on June 26 of last year, when she tried to pay $1,070. However, the payment bounced.\nFancy frosting: Frequented by many celebrities and other well-to-do pastry enthusiasts, a cake from the establishment starts at $40 and can end up costing hundreds for a custom order\nIn an episode of her show True Tori in October 2014, Tori said: 'I feel so responsible for so many people and I can't do it. [I can't handle] the responsibility of having to take care of so many people financially, the fear of that. [It] doesn't matter.'\n'I know people look at me and they're like, \"Oh, poor you.\" Like, \"Boohoo, you have so many problems.\"'\nThe beauty has been plagued by financial problems since she was left with only $800,000 after her producer father died. Her mother Candy ended up with hundreds of millions of dollars.\nMoney troubles: The beauty has been plagued by financial problems since she was left with only $800,000 after her producer father died. Her mother Candy (left) ended up with hundreds of millions of dollars\nLast week Candy added controversy, telling TMZ on Tuesday that while she is more than happy to help the actress out with the necessities, she draws the line at 'extravagance'.\nThe publication asked the 70-year-old widow if she'd be willing to help out, and she brusquely replied that she already has been.\n'I’ve been helping out and I’m paying all her bills now,' Candy said. 'I’m not paying extras like that. I’m not paying any back payments – just for the house and the kids’ school and the food. That’s all.'\nTori, who shares four children with husband Dean McDermott, 49, has yet to comment on the lawsuit.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422258/Tori-Spelling-forks-extravagantly-expensive-cake-despite-money-worries-unpaid-bills.html"}
