{"authors":["Christopher Joyce"],"date_download":"2018-10-23 00:46:22","date_modify":"2018-10-23 00:46:22","date_publish":"2016-12-01 00:00:00","description":"A new study looks at clusters of tornadoes, like those that hit the Southeast this week. They are costly in lives and insurance payouts.","filename":"data/vaneerConsumption/TornadoOutbreaksAreOnTheRiseAndScientistsDontKnowWhy.json","image_url":"https://media.npr.org/assets/img/2016/12/01/ap_16336693728629_wide-bf85ac970e6e0d8b0399ee66b40c01cf006b5ef9.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_12_01_504039462_tornado-outbreaks-are-on-the-rise-and-scientists-dont-know-why_1540255582.html","title":"Tornado Outbreaks Are On The Rise, And Scientists Don't Know Why","title_page":"Tornado Outbreaks Are On The Rise, And Scientists Don't Know Why : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Tornado Outbreaks Are On The Rise, And Scientists Don't Know Why\nEnlarge this image toggle caption Brynn Anderson/AP Brynn Anderson/AP\nA single tornado can cause a lot of damage. But even worse are tornado outbreaks. Just this week, a cluster of at least 18 tornadoes struck the Southeast over two days.\nScientists are seeing bigger clusters in recent years, and they're struggling to figure out what's happening.\nWhen weather conditions are just right — lots of rising heat and moisture, and vertical wind shear — sometimes you get more than just a tornado. Mathematician Michael Tippett at Columbia University, who tracks these outbreaks, says that while the number of tornadoes nationwide varies a lot year to year, the overall average is pretty steady.\n\"But the number of tornadoes in outbreaks is increasing,\" he says. And the number of tornadoes in the most extreme outbreaks — those where at least a dozen tornadoes hit a region within one to three days — is increasing the fastest.\nScientists who study climate suspect that warming temperatures may affect how many tornadoes we get. After all, warmer, wetter conditions are like priming the tornado pump.\nBut Tippett says so far he is not seeing a connection between climate change and these bigger outbreaks. \"It's not the expected signature of climate change,\" he says, \"it could be either something else, or we really don't understand what climate change is doing.\"\nAll sorts of things influence weather: for example, the circulation of warm water in the Pacific and Atlantic oceans. That circulation changes over decades, which in turn alters long-term weather patterns. Writing in the journal Science, Tippett says those ocean changes could be implicated here, but there's no evidence yet. The only thing that seems to be changing are certain kinds of wind patterns near these clusters — when wind at different elevations is blowing in different directions (wind shear), for example.\nNo matter what the cause, these bigger outbreaks hurt people in their path. This week's killed five. And they affect the insurance industry. Bigger outbreaks usually mean more damage, and more payouts.","url":"https://www.npr.org/sections/thetwo-way/2016/12/01/504039462/tornado-outbreaks-are-on-the-rise-and-scientists-dont-know-why"}
