{"authors":[],"date_download":"2018-10-22 21:14:57","date_modify":"2018-10-22 21:14:57","date_publish":"2014-06-04 10:28:11","description":"More than 35 million Americans are in the path of damaging winds Wednesday - part of severe storms that pelted Nebraska with baseball-sized hail.","filename":"data/vaneerConsumption/TornadoThreatsDestructiveWindsSevereStormsThreatenMillions.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/486091/140604-weather-hail-kia-7a_12ffc77d11b810c96589bc9b10b98cdf.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_tornado-threats-destructive-winds-severe-storms-threaten-millions-n122091_1540242897.html","title":"Tornado Threats, Destructive Winds: Severe Storms Threaten Millions","title_page":"Tornado Threats, Destructive Winds: Severe Storms Threaten Millions","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMore than 35 million Americans could face destructive winds Wednesday as a dense pattern of severe storms pelted Nebraska with baseball-sized hail before spreading across the Midwest.\nTornadoes are possible across a broad swath of the Midwest and parts of the Mississippi River Valley, the Weather Channel’s lead forecaster Kevin Roth said.\nOne tornado was confirmed by spotters on the ground in Ord, Nebraska late Tuesday, according to the National Weather Service said. The Weather Channel said it had reports of 11 other unconfirmed tornadoes – 7 more in Nebraska, two in Kansas, one in Iowa and one in western Wyoming.\nA gustnado — a low-level, rolling cloud accompanying a thunderstorm — also was recorded in Seward, Nebraska late Tuesday.\nAcross that state, storms uprooted trees, pummeled homes, blew off roofs, shattered windshields and dented car hoods. Ninety percent of the state was affected by severe weather, Roth said.\nOver the span of eight minutes starting at around 5 p.m. local time (6 p.m. ET), the NWS recorded 1.08 inches of rain at the Omaha airport, which closed due to risk of flash flooding on the airfield. The airport reopened hours later.\nAcross the Plains and the Midwest, the line of wind damage stretched for hundreds of miles – although the National Weather Service Storm Prediction Center had yet to declare that a derecho had occurred. “Certainly it meets the criteria for a derecho,” said Roth.\nThe huge weather system responsible for this week’s storms was spreading south and east Wednesday, bringing gusts of up to 70 mph for many across the Midwest, the Ohio Valley and as far as Tennessee and western Kentucky.\nMSNBC meteorologist Bill Karins said that the threat of wind and hail damage on Wednesday will likely only be half as bad as Tuesday, but could be over a much more populated area — with about 20 million people being threatened in those areas.\nThe Deep South and Southeast could also see heat-related severe thunderstorms later Wednesday, Roth said.\nHowever, the milder thunderstorms that drenched Washington, D.C., Philadelphia and New York on Tuesday evening were expected to have dried out by Wednesday.\nThis week's severe weather arrives amid an unusually quiet late spring, with fewer documented tornadoes in May than in previous years.\n— Alastair Jamieson and Becky Bratu","url":"https://www.nbcnews.com/news/us-news/tornado-threats-destructive-winds-severe-storms-threaten-millions-n122091"}
