{"authors":[],"date_download":"2018-10-22 22:31:30","date_modify":"2018-10-22 22:31:30","date_publish":"2014-05-11 10:03:09","description":"The tornado uprooted trees, downed power lines and scattered debris across the town.","filename":"data/vaneerConsumption/TornadoDownsPowerLinesUprootsTreesinMissouriTown.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/434691/140511-tornado-orrick-missouri-840a_18a05353f44447fa945c6882222259a0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_weather_tornado-downs-power-lines-uproots-trees-missouri-town-n102426_1540247490.html","title":"Tornado Downs Power Lines, Uproots Trees in Missouri Town","title_page":"Tornado Downs Power Lines, Uproots Trees in Missouri Town","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA tornado hit the Missouri town of Orrick on Saturday night, reportedly uprooting trees, downing power lines and scattering debris.\nMother's Day was expected to be stormy for much of the country.\nThe twister was part of a severe weather system that marched across the Kansas City area, with tornadoes also being reported elsewhere in northwestern Missouri overnight.\nBecca Foote, a resident of the hard-hit town, told the The Kansas City Star she was watching the storm approach.\n\"It started getting larger and larger,\" she told the newspaper.\nWhile the twister caused widespread damage to homes and businesses, the town's 800 or so residents were able to take shelter early on when tornado sirens sounded, the newspaper said.\n“We’ve been very fortunate,” Orrick Fire Chief Mike Arnold told the newspaper.\nLooking ahead, Mother's Day promised to be stormy or snowy for much of the country, with more thunderstorms expected to threaten parts of the Midwest, according to The Weather Channel.\nTornadoes, large hail and damaging winds were expected in Iowa, southeast Nebraska, northeast Kansas and northern Missouri, forecasters said. The weather system could producer \"a few strong, long-track tornadoes,\" according to The Weather Channel.","url":"https://www.nbcnews.com/news/weather/tornado-downs-power-lines-uproots-trees-missouri-town-n102426"}
