{"authors":["Scott Neuman"],"date_download":"2018-10-23 00:46:26","date_modify":"2018-10-23 00:46:26","date_publish":"2014-06-16 00:00:00","description":"Two twisters swept through the state's rural northeast, flattening one small town and causing serious damage in two others. One person was killed.","filename":"data/vaneerConsumption/TornadoesCauseWidespreadDamageInjuriesInNebraska.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_06_16_322740339_tornadoes-cause-widespread-damage-injuries-in-nebraska_1540255586.html","title":"Tornadoes Cause Widespread Damage, Injuries In Nebraska","title_page":"Tornadoes Cause Widespread Damage, Injuries In Nebraska : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Tornadoes Cause Widespread Damage, Injuries In Nebraska\nA pair of large tornadoes ripped through rural northeastern Nebraska, devastating one small town, causing damage to two others and killing at least one person, reports say.\nReuters says: \"The tornadoes, part of a supercell thunderstorm system, cut a swath across northeastern Nebraska, uprooting trees and leveling homes, officials said. The still-dangerous storm system was headed into northwestern Iowa.\"\nPowerful tornado near Wisener, NE, earlier Monday - Full video: https://t.co/n6JA5r8xT4 https://t.co/lJvn002fFd — Micah Grimes (@MicahGrimes) June 17, 2014\nThe town of Pilger, with a population of about 400, and the town of Stanton suffered damage, and emergency officials were searching for survivors, Al Vacanti, city administrator for the nearby town of Wisner, was quoted by Reuters as saying.\n\"Pilger is totally destroyed,\" Cathy Ruppert, wife of Stanton Councilman Mike Ruppert, told Reuters. She did not know whether there were injuries.\nSue Roush, a spokesperson for Nebraska Gov. Dave Heineman, has confirmed to NPR that one person was killed when the vehicle they were in near Stanton was picked up and dropped by a twister.\nRoush said authorities were expecting more injuries.\nKTIV television quotes a spokesperson for Faith Regional Health Services in Norfolk, Neb., as saying 16 patients are in critical condition and being treated there with tornado-related injuries.\nThe Associated Press quotes meteorologist Barbara Mayes as saying the tornadoes that touched down were about a mile apart, near the towns of Stanton and Pilger, 100 miles northwest of Omaha.\nKMTV reports:\n\"Right now, the Nebraska State Patrol has closed off the town of Pilger. No one is being allowed in or out, including volunteers. Norfolk Police Capt. Mike Bauer says damage is extensive, resources are in place to help, and they're asking people to stay away so first responders can do their jobs.\"\nUSA Today says:","url":"https://www.npr.org/sections/thetwo-way/2014/06/16/322740339/tornadoes-cause-widespread-damage-injuries-in-nebraska"}
