{"authors":["Associated Press"],"date_download":"2018-10-22 20:21:25","date_modify":"2018-10-22 20:21:25","date_publish":"2016-01-28 01:00:46","description":"MIAMI (AP) — A tornado picked up a southbound vehicle on Florida's Turnpike near Fort Lauderdale Wednesday morning and dropped it in the northbound lane as a...","filename":"data/vaneerConsumption/TornadotossesvehiclealongFloridaturnpike.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:b24bcc486d3a4808b4d6e2ea8d4fe447-4vVdYopwYQ7f641721b07a6f1d37-621_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419415_Possible-tornado-tosses-vehicle-Florida-turnpike_1540239685.html","title":"Tornado tosses vehicle along Florida turnpike","title_page":"Tornado tosses vehicle along Florida turnpike | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tornado tosses vehicle along Florida turnpike\nMIAMI (AP) — A tornado picked up a southbound vehicle on Florida's Turnpike near Fort Lauderdale Wednesday morning and dropped it in the northbound lane as a line of severe storms hit the area, officials said.\nThey said the storms tossed cars and trucks, knocked down trees and damaged some roofs in south Florida.\nBroward Fire Rescue spokesman Mike Jachles said one person was hurt on the turnpike. He didn't know how many vehicles were overturned in the area. The southbound lanes were closed for a time north of Fort Lauderdale.\nA large tree is toppled over, Wednesday, Jan. 27, 2016, in Coconut Creek, Fla., after a severe storm. (AP Photo/Wilfredo Lee)\nAt least six cars were damaged in the parking lot at the nearby north campus of Broward College, said Coconut Creek police spokesman Henry Cabrera. The college issued an advisory in an email urging students to take precautions shortly before the storm.\nMiami television stations showed video of numerous downed trees, downed power lines, and minor roof damage to condominiums and other buildings.\nThe National Weather Service issued a tornado warning for parts of Broward and Palm Beach counties earlier Wednesday. The agency confirmed later Wednesday evening that the area had been hit by a tornado.\nRodael Hernandez checks the condition of his car after trees were damaged on his property, Wednesday, Jan. 27, 2016, in Coconut Creek, Fla., after a severe storm. (AP Photo/Wilfredo Lee)","url":"https://www.dailymail.co.uk/wires/ap/article-3419415/Possible-tornado-tosses-vehicle-Florida-turnpike.html"}
