{"authors":[],"date_download":"2018-10-22 21:13:08","date_modify":"2018-10-22 21:13:08","date_publish":"2014-05-06 13:24:04","description":"Ford flew to Chicago after he announced he would enter rehab, but turned around and left after a \"discussion\" with U.S. Customs and Border Protection.","filename":"data/vaneerConsumption/TorontoMayorRobFordTurnedAwayFromUS.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/423326/140506-toronto-mayor-rob-ford-11a_8787258ced6ed08d9dd09418477def1d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_toronto-mayor-rob-ford-turned-away-u-s-n98071_1540242788.html","title":"Toronto Mayor Rob Ford Turned Away From U.S.","title_page":"Toronto Mayor Rob Ford Turned Away From U.S.","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nToronto’s embattled mayor reportedly boarded a plane for Chicago last week bound for a substance-abuse rehab center, but he never formally entered the United States after meeting with customs and border agents at the airport.\nRob Ford \"arrived in Chicago last Thursday and that after discussion with US CBP he withdrew his request to enter the USA and departed,\" Roy Norton, Consul General at Canadian Consulate General at Chicago, told NBC News in an email.\nU.S. Customs and Border Protection said Ford \"voluntarily\" withdrew the request, Norton added.\nThe federal agency would not comment specifically on the mayor to NBC News, but released a statement saying there are numerous reasons a non-U.S. citizen might be stopped from entering the country, “including health-related grounds, criminality, security reasons, public charge, labor certification, illegal entrants and immigration violations, documentation requirements and miscellaneous grounds.”\nFord's lawyer Dennis Morris confirmed to CTV that the mayor checked in to rehab but wouldn't disclose the location of the facility.\nThe mayor’s brother wouldn’t either.\n\"The most important thing, everyone who is concerned if he's in rehab, the answer is yes,” Toronto Councillor Doug Ford, told The Associated Press. “As for his whereabouts that's personal and that should stay with Rob.\"\nFord has endured repeated calls to step down as mayor and was even stripped of many of his powers after admitting in November that he had used crack cocaine “in a drunken stupor.”\nAllegations had for months swirled around the mayor after the Toronto Star reported it had been shown a video of the politician smoking the illegal substance. Ford’s admission finally came after Toronto Police said they had recovered a copy of the footage.\nFord has resisted calls for his resignation — even after the city council stripped him of several mayoral powers — and boldly launched a campaign for re-election. About two weeks after formally kicking off that campaign, The Globe and Mail released stills of the troubled mayor obtained from a video in which he allegedly was smoking a crack pipe, inhaling and \"frantically shaking his right hand,\" according to the Canadian newspaper.\nA day later, he took a leave of absence.\n\"I have decided to take a leave from campaigning and from my duties as Mayor to seek immediate help,\" Ford said in a statement. \"I have a problem with alcohol, and the choices I have made while under the influence. I have struggled with this for some time.\"","url":"https://www.nbcnews.com/news/world/toronto-mayor-rob-ford-turned-away-u-s-n98071"}
