{"authors":["George Odling For Mailonline"],"date_download":"2018-10-23 01:30:40","date_modify":"2018-10-23 01:30:40","date_publish":"2016-01-29 15:36:16","description":"The tortoise was attacked while she hibernated in a box in Dorset and had her two front limbs nibbled down to the bone. Vets almost had to put the plucky pet down but she is now slowly recovering.","filename":"data/vaneerConsumption/TortoiseNormaleftinplastercastafterbeingsavagedbyarat.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B2437000000578-0-image-a-205_1454081746216.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422944_Traumatised-tortoise-Norma-left-plastercast-savaged-rat-hibernating-box_1540258240.html","title":"Tortoise Norma left in plastercast after being savaged by a rat","title_page":"Tortoise Norma left in plastercast after being savaged by a rat | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A traumatised tortoise has been left in plastercast after it was savaged by a rat.\nShell-shocked Norma was hibernating when the rodent pounced and her owner found her covered in blood with her front legs 'eaten down to the bone'.\nHer injuries were so bad vets were close to putting the 35-year-old tortoise down.\nBut Norma is now making a slow recovery after both her front legs were put in plaster to allow her limbs to heal.\nVet Tom Felton said: 'Rats will chance their luck especially with an animal that can't fight back, and a hibernating tortoise is easy prey.\nNorma the tortoise (pictured with vet Tom Felton) was savaged by a rat while she was hibernating in a box\n'She has damage on both front legs which have been nibbled to the bone, on both front edges of her legs.\n'The first week has been important, and she's responding well, but she is not out of the woods yet.'\nNorma had been hiberating at her home in Stalbridge, Dorset, since November when she was given a rude awakening by the rodent last Sunday.\nHer owner, who does not wish to be named, said she only checked on her tortoise as the weather was unseasonably warm.\n'I have kept tortoises all my life and nothing like this has ever happened before,' she said.\n'I have four tortoises and have been checking on them daily as the weather's been so warm.\nBoth Norma's front legs were nibbled down to the bone and vets were almost forced to put down the tortoise\n'They're in the greenhouse, which has a concrete base, and I leave the door ajar in the morning to let the air circulate, then shut it at night.\n'I found her on Sunday evening, out of her hibernation box and there was blood everywhere - her front legs had been eaten down to the bone and it was horrible.'\nVets at Friars Moor Veterinary Clinic in Sturminster Newton thought there was nothing they could do to save her.\nMr Felton said: 'My colleague who initially saw her feared the worst.\n'However, we got hold of a vet at Piddle Valley Vets who specialises in exotic pets, who gave us some advice on how to treat Norma.\nBut the plucky 35-year-old pet is safely home and back under her heat lamp while starting a slow recovery\n'We'll give it a try for a month, complete with antibiotics, pain relief and regular changes of bandages.'\nIt will take four to six weeks for Norma's skin to heal and there may still be a risk of infection.\nWhile Norma can still use her legs and move about, vets still don't know the full extent of damage to her joints.\nNorma is now safely home, enjoying a heat lamp and her favourite snack of cherry tomatoes.","url":"https://www.dailymail.co.uk/news/article-3422944/Traumatised-tortoise-Norma-left-plastercast-savaged-rat-hibernating-box.html"}
