{"authors":["Eleanor Harding For The Daily Mail"],"date_download":"2018-10-22 21:06:45","date_modify":"2018-10-22 21:06:45","date_publish":"2017-03-16 00:47:45","description":"More grammar schools are necessary to stop rich former public school pupils dominating top professions such as law, senior Tory backbencher Graham Brady has said.","filename":"data/vaneerConsumption/ToryMPsaysgrammarschoolsopenupjobsinprofessions.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/1FD1CBA100000578-0-image-a-6_1489625163244.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318506_More-grammar-schools-open-jobs-professions_1540242405.html","title":"Tory MP says grammar schools 'open up jobs in professions'","title_page":"Tory MP says grammar schools 'open up jobs in professions' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Graham Brady is and MP and chair of the Conservative 1922 Committee\nMore grammar schools are necessary to stop rich former public school pupils dominating top professions such as law, a senior Tory backbencher has said.\nGraham Brady, chair of the Conservative 1922 Committee, said politics, the civil service and even acting are now disproportionately dominated by those who went to private schools.\nHe said part of the reason is that comprehensives often ‘lack’ the capacity to get their pupils into the top universities, meaning success in life is limited.\nAllowing more poorer pupils to access selective state schools which can provide an academically rigorous education would help combat the trend, he suggested.\nIt comes as Theresa May formulates plans to introduce a new wave of grammar schools – the first to be created in decades.\nIt will mean a change in legislation to overturn a ban imposed by Labour in 1998.\nMrs May has pledged to help the ‘just about managing families’ who may have felt left behind by the success of the wealthy metropolitan elite.\nSpeaking at a debate in Westminster organised by the Conservative Woman website, Mr Brady said the new grammars would help boost social mobility.\nThe Royal Grammar School in Guildford, Surrey. Theresa May has formulated plans to introduce a new wave of grammar schools\nHe said: ‘One of the areas in which all too often comprehensive education in our country has been lacking is in getting pupils through the highest grades at A-level, especially in the most challenging subjects.\n‘That is one of the reasons why, in some of the highest profile professions, we have seen social mobility go backwards in our country.\n‘Because some of those professions, whether it be politics or the upper reaches of the civil service, or the law, even now acting, if you look at people who now populate our television screens day in day out, are all too often products of independent schools, disproportionately.’\nHe added that these professions often recruit from Oxbridge and other Russell Group universities, which require high grades in tough A-level subjects.\nEight of the top ten local authorities for getting state schools to achieve those grades are selective or partially selective, he said.\nComprehensive schools often ‘lack’ the capacity to get their pupils into the top universities, according to Brady\nHe added: ‘It’s very telling, that the people who campaign against selective education in the state sector are frequently entirely silent on the question of whether it should remain possible to have these choices if you are able to afford to pay fees for your child’s education.\n‘I’m in favour of freedom, I’m in favour of choice. I’ve never said that people can’t pay for a place independent schools if that’s what they want to do.\n‘But what I do care passionately about is giving people who can’t afford to pay the same amount of freedom as those who can.‎’\nResearch by the Sutton Trust found recently that nearly two thirds of top doctors and three quarters of top judges were educated at independent schools.\nOnly 7 per cent of the general population were privately educated while less than 1 per cent go to Oxbridge.","url":"https://www.dailymail.co.uk/news/article-4318506/More-grammar-schools-open-jobs-professions.html"}
