{"authors":["Tim Sculthorpe","Deputy Political Editor For Mailonline"],"date_download":"2018-10-23 03:22:10","date_modify":"2018-10-23 03:22:10","date_publish":"2017-03-16 14:14:31","description":"Patrick McLoughlin was walking outside Parliament when he was approached by Sky News' Darren McCaffrey who asked questions about today's Electoral Commission report.","filename":"data/vaneerConsumption/TorychairmanPatrickMcLoughlinswatsreportersphone.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54ABC900000578-0-image-a-51_1489673644961.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320458_Tory-chairman-Patrick-McLouhlin-swats-reporter-s-phone_1540264930.html","title":"Tory chairman Patrick McLoughlin swats reporter's phone","title_page":"Tory chairman Patrick McLoughlin swats reporter's phone | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Conservative Party chairman Patrick McLoughlin today shoved a reporter's phone towards the floor to avoid questions about the Tory elections expenses scandal.\nThe angry exchange came as Mr McLoughlin was walking outside Parliament when he was approached by Sky News' Darren McCaffrey who asked questions about today's Electoral Commission report.\nThe Tories have been fined £70,000 by the watchdog for not properly reporting their general election expenses.\nAnd the party faces at least 12 criminal cases which have been handed to prosecutors over allegations the party wrongly declared local campaign expenses on its national return.\nConservative Party chairman Patrick McLoughlin has shoved a reporters phone towards the floor to avoid questions about the Tory elections expenses scandal\nMr McLoughlin was walking outside Parliament when he was approached by Sky News' Darren McCaffrey who asked questions about today's Electoral Commission report\nMcCaffrey's phone was almost sent skidding into the road by Mr McLoughlin's swipe as he refused to answer questions about the Electoral Commission fine\nMr McLoughlin insisted to Sky News the party had made a statement and refused to answer any more questions before heading inside Parliament.\nHe pushed McCaffrey's phone toward the floor after the reporter introduced himself as from Sky News.\nUp to 20 Tory MPs are in the firing line after a dozen police forces investigating allegations of general election expenses fraud passed files to prosecutors.\nThe probes, which all relate to Conservatives who won seats in 2015, have seen at least two MPs questioned under police caution.\nMeanwhile, pressure on the Tories grew today as the central party was fined a record £70,000 for failing to declare election spending properly.\nIt mis-declared a total of £275,813 from the 2015 campaign, which resulted in an overall majority for David Cameron.\nThe Electoral Commission concluded that a 'proportion' of the party's spending on a national battlebus campaign should have been regarded as spending by local authorities.\nThe party failed to maintain records explaining the amounts it invoiced to candidates in three 2014 by-elections, for work on their campaigns, meaning their spending could not be verified.\nMr Mcloughlin insisted the party had already made a statement on today's report and said he would not make any further comment\nThe incident was over in seconds as the party chairman reached an entrance to Parliament\nMr McLoughlin stalked in to the Palace of Westminster through the Black Rod's Garden entrance, leaving the reporter in his wake\nThe Electoral Commission has referred the party's registered treasurer, Simon Day - who is now chief financial officer - to Scotland Yard over the campaign spending errors.\nA Conservative Party spokesman said the party had 'complied fully' with the watchdog's year-long probe. Labour and the Liberal Democrats have previously been hit with smaller fines.\n'This investigation and these fines relate to national spending by CCHQ, and the Conservative Party's national spending return for the 2015 general election,' the spokesman said.\n'As we have consistently said, the local agents of Conservative candidates correctly declared all local spending in the 2015 general election.\n'CCHQ accepted in March 2016 that it had made an administrative error by not declaring a small amount constituting 0.6 per cent of our national spending in the 2015 election campaign.\n'This error was subsequently corrected and the Party has since improved its accounting practices, reporting structures and staff guidance.'","url":"https://www.dailymail.co.uk/news/article-4320458/Tory-chairman-Patrick-McLouhlin-swats-reporter-s-phone.html"}
