{"authors":["Julie Cart","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:25:13","date_modify":"2018-10-30 22:25:13","date_publish":"2016-11-26 08:47:57","description":"RYER ISLAND—The report’s findings were unequivocal: Given the current pace of water diversions, the San Francisco Bay and the Delta network of rivers and","filename":"data/vaneerConsumption/TosaveSFBayanditsdyingDeltastateaimstoreplumbCalifornia.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/DeltaGrassUSFWSbySteveMartarano-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938313.html","title":"To save SF Bay and its dying Delta, state aims to re-plumb California","title_page":"To save SF Bay and its dying Delta, state aims to re-plumb California | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"RYER ISLAND—The report’s findings were unequivocal: Given the current pace of water diversions, the San Francisco Bay and the Delta network of rivers and marshes are ecological goners, with many of its native fish species now experiencing a “sixth extinction,” environmental science’s most-dire definition of ecosystem collapse.\nOnce a vast, soaked marsh and channel fed by the gushing Sacramento and San Joaquin rivers, the Delta has diminished dramatically over the previous century as those rivers and their mountain tributaries have been diverted to irrigate Central Valley farms and Bay Area urbanity. With winnowing supplies of Chinook salmon available for food, Orcas off the coast are starving. So, too, are seals and fish-eating birds. And the Gulf of the Farallones, a national marine sanctuary, is suffering from a lack of freshwater fed by the Bay.\nThose grim conclusions in this fall’s report by scientists at the Bay Institute, an environmental group focused on the bay’s ecosystem, would normally have set off alarm bells— except that those warnings have been sounding for decades. That’s about as long as state agencies have been in the planning process to re-plumb the region that supplies close to half of California’s water and supports world-leading agricultural production, fisheries and tourism.\nThe state’s goal: recalibrate the water flows that have drained vital rivers down to as low as 10 percent of their natural levels—just a fifth of the 60 percent flow scientists say is necessary to preserve the ecosystem.\nBut the mechanism for change—the state water board’s much-anticipated update to its Bay-Delta plan—is running “way, way behind,” according to board officials. The plan hasn’t had a significant update in more than two decades. And recent progress has been agonizingly slow.\nThe first of the plan’s phases—setting targets for turning the tap on and off on the vanishing San Joaquin river, and for reducing water salinity— has been six years in the making and runs thousands of pages long. It isn’t expected to be finalized until next summer.\nAfter analyzing possible flow rates, the state board’s staff, in its draft, sets a target that would have to be met: an “adaptive range” of 30 to 50 percent of the average unimpeded water flow for the San Joaquin River and its key tributaries, the Merced, Stanislaus and Tuolumne rivers. Such a flow, averaging about 40 percent, will “provide reasonable protection of fish and wildlife while moderating impacts to water supply for drinking water and agriculture.”\nThe second phase will set water quality targets for the Sacramento River and its tributaries, including the Delta and its outflow.\nIn the third phase, at best a few years down the road, the state will play the role of Solomon, determining which competing parties get what amount of water. “It’s when lawyers begin to line up in front of a judge,” said Jon Rosenfield, the lead scientist on the Bay Institute report.\nThe state hopes to avoid that contentious period, instead encouraging the various factions to come to agreements on their own.\nAs is the way with California water policy, everyone’s share of water is going to be cut, so no one is happy. Farmers predict fallowing of crops, Bay Area officials say impeding development will drive up housing prices, rural counties say the policies are inhibiting growth, and environmental groups still insist that not enough water is being set aside to maintain the health of the complex water system and the fish and wildlife that depend on it.\nAnd, as the tedious, divisive planning process creeps along, the region’s economy is at a standstill. Farms and harbors are in disrepair, private sector investments have withered, and residents are waiting for a consistent policy from Sacramento. Further adding to the uncertainty is the incipient presidency of Donald Trump, who, while campaigning in Fresno in May, proclaimed that it was “insane” to “shove water out to the sea” on behalf of endangered fish.\nNobody knows quite what to expect from a Trump administration, but it could try to undermine the state effort by withholding federal funds for restoration of the San Joaquin River and by relaxing federal Endangered Species Act protections. A Republican-controlled Congress also could weigh in by passing federal laws that could govern how water is divvied up.\nThat uncertainty may have spurred a last-minute, across-the-aisle water agreement signed by President Obama near the end of the 2016, which included a bill rider that was the product of extensive behind the scenes negotiating between Democratic Sen. Dianne Feinstein and Republican Rep. Kevin McCarthy of Bakersfield.\nThe legislation is a marvel of open-ended language that seems to leave most state officials mystified about its upshot. Environmentalists say it sells out fish in favor of farms and Southern California’s voracious water needs, but very little is clear.\nIt allows the Delta’s powerful pumps to operate at full blast during storms when water is high, exceeding limits set by federal agencies intended to protect fish.\nBut its real calculation may be to secure federal funding for California water projects and flood control before President-elect Trump takes office. The bill calls for $335 million for water storage, $15 million to improve Salmon habitat along the Sacramento River and $3 million to fund Delta smelt studies.\n“We all know that the Delta as it exists today is not sustainable,” said Michael George, who serves as the Delta Watermaster for the state Water Resources Control Board. “People have been waiting for a policy and no one is making any long term investments because the policy is so uncertain. There’s wariness. Nobody in the Delta wants Sacramento to do anything other than go away.”\nAmid the cacophony of claims and assertions about who owns water in California, there is one sobering point that all seem to agree upon: There’s not enough water to satisfy all takers and that is not likely to change.\nWhat will have to change is the way scarce water supplies are allocated. And that’s where the fight begins.\n“It’s a game of musical chairs right now and we are missing about three chairs,” said Chris Scheuring, a water lawyer for the California Farm Bureau Federation, which is fighting to preserve water supplies on behalf of the state’s powerful agriculture industry. “It’s a zero-sum game and somebody has to lose. The drought has intensified. Climate change is on the horizon. We have a declining snow pack. This is putting us on the path of an epic train wreck.”\nOn a recent morning, the fog shrouding parts of the Delta was so dense that a pessimist might have seen it as a misty manifestation of the gloom enveloping the intense debate about the state’s pending plans.\nBut the Watermaster is not given to negativity. George, whose background is as a water attorney, sees past the bitterness, the name-calling and the state’s redlining spiral of water guzzling. He is focusing instead on the chance for an enduring agreement.\nThe situation has come down to powerful forces wrestling over a few drops. At any given time more than 80 percent of the water that would naturally flow through the various rivers, tributaries and sloughs feeding the Delta and Bay is siphoned off for storage, agricultural or municipal use. What comes out the south end, or into the San Francisco Bay, is often less a flow than a trickle. The San Joaquin River, for example, at some points has become almost a dry bed, its key tributaries also tapped (the Tuolumne, for example, feeds the Hetch Hetchy Reservoir that supports San Francisco.) As a result, last year less than 10 percent of the San Joaquin River’s water was available to replenish the Delta.\nDrought and climate change have transformed an intermittent crisis into a full-time emergency.\n“We all recognize the Delta is broken, and there’s blame to go around,” said Heather Cooley, director of the Water Program at the Pacific Institute, a global water think tank. “Several years before the drought I would attend meetings and people said, ‘Is there a water problem?’ I don’t think you would get that any more.”\nThe catastrophic collapse of the estuary has driven the three-inch Delta Smelt to the brink of extinction and decimated the Sacramento Splittail, as well as two runs of chinook salmon, Central Valley steelhead, among others. The first phase of the state’s plan, by setting its 40 percent flow target, attempts to help fish populations recover.\nAlthough that flow would amount to a veritable flood in sections that are seeing less than 10 percent of natural levels, it would still be one-third below the board’s own 2010 analysis that pegged 60 percent flow as best for fisheries recovery.\n“If the 40 standard does anything beneficial for the fish, it sends them to extinction less quickly,” said Rosenfield, of the Bay Institute. “Chinook salmon are the hardiest fish species we know of. They colonized every watershed from Monterey through Alaska to Japan. If Chinook salmon cannot live in your rivers, something is very, very wrong.”\nFed by mountain tributaries, the San Joaquin River runs up the spine of California before flowing into Delta.\nBut water board chairwoman Felicia Marcus stressed that a 60 percent standard represents “what fish would have asked for if the fish could talk”—and that the final plan must balance the needs of all water users.\n“I was stunned to see that over half the time we are diverting 80 and as much as 90 percent of water out of these rivers. That’s gonna be tough on these fish,” she said. “At the same time, people have to realize you can’t put it all back. We’re coming to grips with where we’ve been and where we need to go. We need to figure out how to share the rivers and water more thoughtfully, between human use and nature. It’s a question of figuring out how to get there. It’s not going to be easy.”\nWhat’s good for the fish is often in conflict with the reality of a region that has been markedly altered by human hands. Nineteenth-century federal policy that favored bending nature to boost commerce meant draining the Delta’s marshes and swamps to make way for farming islands and ever-growing settlement. Today an estimated 98 percent of the Delta’s historic tidal wetlands have disappeared.\nThe state—and the estuary itself—has been struggling to accommodate all the claims on its waters.\n“We don’t have enough water to serve all of the demands that we put on it,” George said, framing the obvious and most difficult issue in the debate. Not farms versus fish, not cities versus rural areas, not California’s age-old North verses South. It’s an all-of-the-above crisis.\nThe point is not that the state is simply going to run out of water, as a report on water myths from the Public Policy Institute of California once noted. But it will have scarcity, said Jay Lund, one the report’s authors and director of the Center for Watershed Sciences at UC Davis. “There a wonderful saying that economists have: There’s not a shortage of water, there’s a shortage of cheap water. If we are at all smart, we will make sure that we have enough water for the most important things. That’s not going to be easy.”\nIt’s particularly difficult because everyone’s favorite pastime is the blame game, said Jon Christensen, an environmental historian at UCLA’s Institute of the Environment and Sustainability. “Farmers, cities, salmon fisheries offshore, people in Los Angeles, like myself, where some portion of my drinking water comes from the Bay-Delta. I’d like to think that history has bequeathed this responsibility to us. We are all in this together.”\nDriving along a misty levee above the Sacramento River, George swept an arm to take in what was once a bustling commercial corridor of towns and farms huddled by waterways that had been teeming with barge traffic.\nMuch of that farm-to-town economy is dormant, as investors have waited for consistent signals from Sacramento about the future of water policy. Farm machinery sits rusting and once-busy marinas and docks are choked with mats of invasive water hyacinth.\n“The economy is stagnant, uncertainty about policy has been hanging there for a decade,” said Jeffrey Michael, director of the Center for Business and Policy Research at the University of the Pacific in Stockton.\nHis group produced an economic study in 2011 that recommended against one of the state’s largest water engineering projects ever, the proposed twin 40-foot wide Delta tunnels that would ferry water from the Sacramento River to serve cities and farms to the south. The project’s supporters say the twin tunnels, the centerpiece of Gov. Brown’s WaterFix , would be an improvement on the current powerful pumping stations whose operations entrap threatened and endangered fish, and thus need to be shut down when the fish are running. The proposed twin tunnels, if ever built, would have to comply with the flow requirements and other standards set out in the Bay-Delta plan.\nRegardless, the complex and often conflicting plans have added to the region’s apprehension about its water future.\n“These projects could turn the Delta into a massive construction zone for decades,” Michael said. “That’s an investment deterrent. The combination of uncertainty about the future of the Delta as well as the regulatory climate poses too much risk. The businesses out there today are on pretty thin margins. They are small enterprises that are not heavily capitalized. I am very concerned about their ability to survive.”\nThe farm bureau’s Scheuring said growers have adopted new water methods that have enabled them to produce twice the value of crops with the same amount of water as they required 30 years ago. Now, he says, farmers can’t give up any more water.\nNeither can San Francisco, according to Charles Sheehan, spokesman for the city’s Public Utilities Commission. The region’s 2.6 million frugal customers are already consuming water at less than half the statewide average, he said. Less water has meant shorter showers, browner public parks and, officials say, restrictive economic development.\nThe commission’s analysis of the Bay-Delta plan envisions “serious economic impacts,” Sheehan said, especially in drought years. “This has the potential to restrict new housing development. Affordable housing is a big issue here.”\nThe collapse of the state’s water systems is taking a financial toll on other industries, such as the seafood business. Only about 3 percent of salmon survive the weeks-long journey through the Delta to the Pacific. Part of the problem is that salmon fry cannot survive in the Delta’s waters, which are now shallower and therefore warmer. The other is a deadly migratory collision—the fewer young salmon swimming downstream to the Bay, the more these new generations are wiped out in a feeding frenzy when they run into oncoming spring spawning runs of striped bass. That’s a hard blow on coastal businesses waiting on the other end of the pipe for salmon.\nAn October report from the National Oceanic and Atmospheric Administration showed that between 2014 and 2015, the value of the California fishing harvest plummeted 53 percent.\nIt’s not only fish that can’t make it to the endpoint in the San Francisco Bay. Freshwater is in scarce supply, creating fewer stocks of fish that themselves support fish-eating birds and whales. Wetlands and beaches are missing the sediment that would have been carried along with high flows. And without the natural flushing action of arriving freshwater, a dangerous mix of pollutants and toxic algae blooms continues to accumulate and worsen water quality.\nAcross the state, people are lining up to recount similar tales of water woes. Often at the top of their lungs. In recent months, Stanislaus County officials flatly accused state water officials of lying—and the rhetoric at a Merced County Board of Supervisors meeting got so overheated that one citizen compared the impact of the Delta plan on farmers to the Holocaust.\nAt the most recent meeting of the San Joaquin County Board of Supervisors, local water district representatives characterized the state water board’s draft Bay-Delta plan as a “water raid” and a “dirty deal.” The board unanimously voted to oppose the state draft after Les Grober, the water board’s deputy director in the Division of Water Rights, was subjecting to a verbal flaying.\n“To propose any kind of change is never going to make everyone happy,” Grober, a long-suffering veteran of many acrimonious public meetings, said in an interview. “We hear, ‘How can you take our water?’ But this is the water of the people of the state of California. The science tells us we need 60 percent flows for fish and habitat. On the supply side there is an unlimited demand for water. How do you balance all that? We have to keep talking about it.”\nMarcus, the state water board’s hard-nosed but pragmatic chair, invites all the parties to engage in a “rational conversation instead of lobbing grenades from the corner.\n“It’s not the most comfortable place to be, people are always mad at you,” she said. “But we are going to make these decisions. Either you help us make the decision or we are going to move. Our objective is to make this work.”\nBack in the Delta, George—himself an avid boatman—relishes showing off every waterway and marsh. Making it all work for as many groups as possible will be a heavy lift, he said, and requires careful, careful planning. But he’s optimistic despite the President-elect’s campaign comments, insisting he sees no indication from federal partners that the government would wish to undo what the state has put in motion. Even if the federal government delisted various threatened and endangered fish species—which would take years and need to be accompanied by an extensive scientific report—that would remove just one of many justifications for restoring flows. As far as the state board is concerned, increased flows are necessary for the health of the entire system.\n“We are way behind and we feel it,” he said. “I think we ought to be moving at warp speed. But before we move at warp speed, you better know where you are going to end up.”","url":"https://calmatters.org/articles/to-save-sf-bay-and-its-dying-delta-state-aims-to-re-plumb-california/"}
