{"authors":[],"date_download":"2018-10-30 20:35:30","date_modify":"2018-10-30 20:35:30","date_publish":"2016-12-29 00:00:00","description":"Faced with the prospect of a multibillion-dollar write-down that could wipe out its shareholders' equity.","filename":"data/vaneerConsumption/Toshibaisburningcashatanalarmingrate.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_r-battered-toshiba-out-of-easy-options-to-plug-nuclear-hole-2016-12_1540931730.html","title":"Toshiba is 'burning cash at an alarming rate'","title_page":"    Toshiba is 'burning cash at an alarming rate' - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Toshiba Corp President and CEO Tsunakawa. Toru Hanai/Reuters TOKYO — Faced with the prospect of a multibillion-dollar write-down that could wipe out its shareholders' equity, Japan's Toshiba is running out of fixes: It is burning cash, cannot issue shares, and has few easy assets left to sell.\nThe Tokyo-based conglomerate, which is still recovering from a $1.3 billion accounting scandal in 2015, dismayed investors and lenders again this week by announcing that cost overruns at a US nuclear business bought only last year meant it could now face a crippling charge against profit.\nToshiba says it will be weeks before it can give a final number, but a write-down of the scale expected — as much as 500 billion yen ($4.3 billion), according to one source close to Toshiba — would leave the group scrambling to plug the financial hole and keep up hefty investments in the competitive memory chip industry, which generates the bulk of its operating profit.\nShareholder equity, which represents its accumulated reserves, stood at 363.2 billion yen at the end of September, already just 7.5% of total assets.\nToshiba cannot raise cash by issuing shares because of restrictions imposed by the stock exchange after last year's scandal. One source close to the matter said Toshiba had been considering a share issue of about 300 billion yen, but the imminent lifting of those restrictions are now unlikely.\nThe news conference room on the 39th floor of the Toshiba head office in Tokyo. Thomas Peter/Reuters Private-equity funding could be an option, but financial sources and investors said Toshiba would most likely be forced to sell off more assets and stakes, months after having sold its two most easily marketable businesses: white goods and medical devices.\n\"Toshiba's immediate problem is that it is burning cash at an alarming rate, and this will be more than challenging,\" said Ken Courtis, the chairman of Starfort Investment Holdings.\n\"I see little option but to sell a slew of non-core assets.\"\nIts loss-making PC and TV businesses would be poor candidates for sale, while its many cross-shareholdings are unlikely to fetch enough.\n\"Toshiba doesn't have many salable assets in hand,\" Standard & Poor's analyst Hiroki Shibata said after the ratings agency downgraded Toshiba.\nA Toshiba 55-inch HD TV. Ethan Miller/Getty Images \"It has mostly sold assets which have big price tags or that could easily find buyers already. It would be difficult to secure big funds through asset sales.\"\nOne source in the semiconductor industry said Toshiba could revive plans to list a slice of the memory-chip business, which though highly profitable burns through cash for reinvestment.\n\"Toshiba will probably need to sell 30-40% of the NAND business in an IPO to secure enough cash,\" the source said, adding that China's aggressive drive into NAND flash memory chips could make the timing reasonable.\nThe group has already said it could reconsider the \"positioning\" of its nuclear business, deemed core last year, and has signaled it could trim an 87% stake.\nToshiba has said it will consider a capital strategy but has given no details.\nCash gap\nFor now, creditor banks are expected to step into the liquidity breach, betting on Toshiba's growing chips business — though they were blindsided by the news and expressed concerns over continued governance and disclosure issues.\nSome bankers had been on a factory tour with Toshiba on the day before the announcement, two of the banking sources said. They were told about the write-down that night.\nToshiba Corp. demonstrates its communications android named Ms. Aiko Chihira in 2014. Issei Kato/Reuters Two days later, Toshiba's top executives, including CEO Satoshi Tsunakawa, were asking for help.\n\"We really need a proper explanation of how, and to what extent, President Tsunakawa came to know of this,\" an executive at one of Toshiba's regular bankers said.\n\"It just defies common sense that this would come out only now about a deal done a year ago.\"\nJust last month, Toshiba raised its annual profit forecast, thanks to strong demand for its NAND flash memory chips.\nBankers and analysts said the latest shock should at least push Toshiba to resolve long-standing headaches like its poor disclosure and governance and could force it to offload some cross-shareholdings.\nOne Toshiba shareholder estimated that the book value of all its cross-shareholdings would be about $3.2 billion, and it could get more than that based on past experience.\nSale options would include its roughly 50% stakes in Toshiba Plant Systems and Services and Toshiba Tec (6588.T), both worth about $670 million at current market prices, according to Thomson Reuters data.\n\"If the company wants to survive, it needs to go through a 'scrap-and-build' process,\" said Norihiro Fujito, senior investment strategist at Mitsubishi UFJ Morgan Stanley Securities.\n\"Right now, even if banks are assisting, it's like they are throwing their money down the drain.\"\nReporting by Makiko Yamazaki, Taro Fuse, Kentaro Hamada, Emi Emoto and Ayai Tomisawa in TOKYO; Additional reporting by Umesh Desai and Michelle Price in HONG KONG; Writing by Clara Ferreira Marques; Editing by Will Waterman.","url":"https://www.businessinsider.com/r-battered-toshiba-out-of-easy-options-to-plug-nuclear-hole-2016-12"}
