{"authors":["Makiko Yamazaki","Greg Roumeliotis","Ayai Tomisawa"],"date_download":"2018-10-30 20:43:38","date_modify":"2018-10-30 20:43:38","date_publish":"2016-12-28 00:00:00","description":"Cost overruns at US power projects handled by the CB&I Stone & Webster business Toshiba acquired last December will be much greater than initially expected.","filename":"data/vaneerConsumption/Toshibasharescrashed20afteritwarnedaboutamultibillionwritedown.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_toshiba-shares-fall-20-percent-december-28-multibillion-stone-and-webster-writedown-2016-12_1540932218.html","title":"Toshiba shares crashed 20% after it warned about a multibillion writedown","title_page":"    Toshiba shares fall 20% after warning of multibillion Stone & Webster writedown - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Toshiba Corp President and CEO Satoshi Tsunakawa attends a news conference at the company's headquarters in Tokyo, Japan, December 27, 2016. REUTERS/Toru Hanai TOKYO (Reuters) - Shares in chips-to-construction group Toshiba Corp tumbled 20% on Wednesday, hitting the Tokyo exchange's daily downward limit after the company said it could face a multi-billion dollar charge on a US nuclear power business bought last year.\nThe Japanese group said cost overruns at US power projects handled by the CB&I Stone & Webster business it acquired last December from Chicago Bridge & Iron (CB&I) would be much greater than initially expected, potentially requiring a huge writedown.\nToshiba's announcement came as its Westinghouse Electric subsidiary is engaged in a legal and accounting row with CB&I, which has argued in court that it expected a relatively small payment from Westinghouse of only $161 million (£131 million) when the deal closed on the understanding that the latter was taking on a challenged business. Markets Insider Toshiba's latest writedown would be another slap in the face for a sprawling conglomerate hoping to recover from a $1.3 billion (£1 billion) accounting scandal, as well as a writedown of more than $2 billion (£1.6 billion) for its nuclear business in the last financial year.\n\"This will come as an additional shock to Toshiba's institutional investors that may further undermine confidence in company management, as well as significantly weakening its international nuclear credentials,\" said Tom O'Sullivan, founder of energy consultancy Mathyos Japan.\nAddressing reporters late on Tuesday, Toshiba executives declined to provide further details on the hit, adding the sum would be finalised by mid-February.\nSatoshi Tsunakawa, who took the helm in June after his predecessor embarked on a series of restructuring steps to clean up Toshiba's books, said Toshiba was considering options to bolster its capital base, which could fall close to zero if Toshiba logs significant losses. It will also meet its banks to seek support.\nToshiba has been on the Tokyo bourse's watch list since the 2015 scandal, due to concerns about internal controls.\n(Reporting by Ayai Tomisawa; Editing by Clara Ferreira-Marques and Sam Holmes)","url":"https://www.businessinsider.com/toshiba-shares-fall-20-percent-december-28-multibillion-stone-and-webster-writedown-2016-12"}
