{"authors":["Press Association"],"date_download":"2018-10-23 04:34:59","date_modify":"2018-10-23 04:34:59","date_publish":"2016-01-11 17:34:25","description":"Harry Kane is aiming to fire Tottenham to success in all competitions this season after dismissing the latest speculation linking him with a move away from W...","filename":"data/vaneerConsumption/Tottenhamstrikerharrykaneseeshislongtermfutureatwhitehartlane.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-b1a5ac9e-aa52-4823-9caa-86966a3a298a-3WAQP5SaQH704788ebcf7e150552-420_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393869_Tottenham-striker-Harry-Kane-sees-long-term-future-White-Hart-Lane_1540269299.html","title":"Tottenham striker harry kane sees his long-term future at white hart lane","title_page":"Tottenham striker harry kane sees his long-term future at white hart lane | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tottenham striker Harry Kane sees his long-term future at White Hart Lane\nHarry Kane is aiming to fire Tottenham to success in all competitions this season after dismissing the latest speculation linking him with a move away from White Hart Lane.\nThe 22-year-old came off the bench on Sunday to score a last-gasp penalty and earn Spurs a 2-2 draw and an FA Cup third-round replay at Leicester next week.\nWith Kane one of a number of players rested by Mauricio Pochettino, Tottenham looked to be heading out after goals from Marcin Wasilewski and Shinji Okazaki had cancelled out Christian Eriksen's opener.\nHarry Kane is 'raring' to be a part of Tottenham's future\nBut Kane was called upon with a little over 20 minutes remaining and slammed home an 89th-minute penalty after Nathan Dyer was adjudged to have handled in the box.\nPochettino played down reports the England striker had emerged as a target for Real Madrid last week and Kane himself insists his future lies in north London.\n\"Yes, definitely,\" he replied when asked if Tottenham was where he wanted to spend his long-term future.\n\"There are always going to be rumours flying around but I'm happy here. The club is in a good shape, we have a great future and I'm raring to go so we will see what happens.\n\"We have got a lot of young players raring to go who are getting better and better with each game and that is all we have got to do. Keep working hard on the training field, we are getting better and more experienced the more we play and I think we can only get better.\"\nKane was one of seven changes made for the FA Cup tie, with Leicester making a swift return to White Hart Lane for a Barclays Premier League meeting on Wednesday night.\nPochettino is likely to welcome back the majority of those given a break on Sunday and Kane believes fourth-placed Spurs have enough to fight for honours across the board this season - even without strengthening in the transfer window.\n\"We have got a very good squad,\" he added. \"You see here we made some changes and they came in and did very well.\n\"It is down to the manager what he wants to do in the transfer window, us as players just have to focus on each game that comes along and try and do our best.\n\"That is what we will do and we have a busy period coming up now especially with the replay, so we have got to keep working hard.\n\"If the gaffer doesn't want anyone in, we are happy to go and fight for places in the league and fight for the cup competitions.\"\nLeicester could yet end the week back at the top of the Premier League table and Claudio Ranieri also kept one eye firmly on the midweek meeting as he made eight alterations.\nHe handed a debut to recent recruit Demarai Gray, who was partnered on the left flank by young defender Ben Chilwell.\nThe 19-year old made just his second start for the Foxes after a loan spell at Huddersfield earlier in the season and, while this was his first taste of Premier League opposition, the England youth international believes he will take plenty from the afternoon.\n\"It is all part of the learning curve for me. It was good experience and I learned as the game wore on,\" he told the Leicester Mercury.\n\"It was tough, very difficult. I have played in the Championship and played against Hull City, but that was my first experience against Premier League players.\n\"It was a lot more technical and you find players drifting into your area that you don't normally have. But I still enjoyed it and I am just gutted we didn't win.","url":"https://www.dailymail.co.uk/wires/pa/article-3393869/Tottenham-striker-Harry-Kane-sees-long-term-future-White-Hart-Lane.html"}
