{"authors":["Nicholas Godden For Mailonline"],"date_download":"2018-10-23 00:24:42","date_modify":"2018-10-23 00:24:42","date_publish":"2016-01-28 14:13:30","description":"Glenn Hoddle is convinced Tottenham can win the Barclays Premier League this season but has doubts about whether the north Londoners believe they can do it.","filename":"data/vaneerConsumption/TottenhamcanwinthetitleandDeleAlliispushingforRooneysEuro2016spotGlennHoddlesays.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30985FBF00000578-0-image-a-43_1453990336298.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421024_Tottenham-win-title-season-Dele-Alli-pushing-Wayne-Rooney-hard-Euro-2016-starting-spot-says-Glenn-Hoddle_1540254282.html","title":"Tottenham can win the title and Dele Alli is pushing for Rooney's Euro 2016 spot, Glenn Hoddle says","title_page":"Tottenham can win the title and Dele Alli is pushing for Rooney's Euro 2016 spot, Glenn Hoddle says | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The former midfielder has doubts about whether they\nGlenn Hoddle is convinced Tottenham can win the Barclays Premier League this season but has doubts about whether the north Londoners believe they can do it.\nThe former Spurs midfielder also thinks Wayne Rooney's position in the England team is coming under threat from 19-year-old sensation Dele Alli.\nTottenham, who have not won a league title since 1961, are within touching distance of the top flight summit entering the final 15 games of the season.\nGlenn Hoddle believes Tottenham can win the Barclays Premier League title this season\nThe Spurs squad have been in Barcelona this week for a training camp ahead of their next fixture\nTottenham's 19-year-old midfielder has been a revelation this season, earning international recognition\nMauricio Pochettino's side are five points adrift of surprise leaders Leicester City and just two behind title favourites Manchester City and Arsenal.\nHoddle, who played for Tottenham for 12 years between 1975 and 1978, thinks there is enough quality in the current squad to go all the way this season.\n'There is no doubt that Tottenham have the ability to win the Premier League title in this unpredictable season, but I ask the question whether they seriously believe they can do it,' Hoddle told ESPN.\n'This is a one-off year, with Manchester United struggling and the champions Chelsea falling out of the top four in inexplicable circumstances.\nTottenham consolidated their position in the top four with a 3-1 victory against Crystal Palace on Saturday\nMauricio Pochettino's side are five points behind league leaders Leicester City with 15 games left to play\n'I look at that Tottenham squad and there is no reason they cannot compete with Arsenal and Man City, and I guess we have to put Leicester in the mix for the title now. If Leicester are in there, Spurs are certainly contenders as well.'\nMidfielder Alli has hit the ground running in the Premier League and has been a key player for Tottenham this season – his ability was further evidenced with his stunning volley against Crystal Palace last Saturday.\nHoddle has been mightily impressed with the former MK Dons youngster and believes he is putting pressure on captain Wayne Rooney for a starting berth at this summer's European Championship in France.\nHoddle (left) believes England should play with a No 10 behind Tottenham striker Harry Kane\nHoddle says Dele Alli is pushing Wayne Rooney hard for a starting spot at Euro 2016\nAlli scored a brilliant volley against Crystal Palace to help Spurs remain in the hunt for the title\n'I like the idea of Rooney playing in the hole behind Kane and that's a role which would suit him at this stage of his career, but Alli is pushing hard to claim that position for himself at the moment.\n'There is always a lot of hype around young players who catch the eye and that is especially the case when they are English. Comparisons to myself are not something I want to get into and it would not help him to be compared to anyone.'","url":"https://www.dailymail.co.uk/sport/football/article-3421024/Tottenham-win-title-season-Dele-Alli-pushing-Wayne-Rooney-hard-Euro-2016-starting-spot-says-Glenn-Hoddle.html"}
