{"authors":["Sam Cunningham For Mailonline"],"date_download":"2018-10-23 05:38:24","date_modify":"2018-10-23 05:38:24","date_publish":"2017-03-10 15:22:18","description":"Tottenham's record signing last played in their EFL Cup defeat to Liverpool four-and-a-half months ago and what appeared a minor problem first felt in training has not gone away.","filename":"data/vaneerConsumption/TottenhamwingerLamelacouldmisstherestoftheseason.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E2398FA00000578-0-image-a-223_1489158916010.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301626_Tottenham-winger-Lamela-miss-rest-season_1540273104.html","title":"Tottenham winger Lamela could miss the rest of the season","title_page":"Tottenham winger Lamela could miss the rest of the season | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Erik Lamela could miss the rest of the season with the mysterious hip injury that has kept him out since October.\nTottenham's record signing last played in their EFL Cup defeat to Liverpool four-and-a-half months ago and what appeared a minor problem first felt in training has not gone away.\nThe 25-year-old returned to Roma, who sold the player to Spurs for £25.7million in 2013, in January to work with a physiotherapist whom he grew close to at his former club. It was hoped the change of scenery would aid his recovery.\nTottenham forward Erik Lamela could miss the rest of the season with his strange hip injury\nThe Argentine forward has not featured for Spurs since the EFL Cup defeat by Liverpool\nHe has since returned to England and Tottenham announced in their squad news on Friday that the player 'continues to work outdoors and is now stepping up his rehabilitation.'\nBut manger Mauricio Pochettino clarified in a press conference that he had no idea how long the player will be out for.\n'I don't want to lie you and give some information that after you use — you are right to use — but I can't say one two weeks three weeks one month or maybe next season, I don't know.\n'It's too difficult my position because we are assessing him every day, how he is in the morning, we prepare a plan, sometimes he is involved from the beginning in the warm-up with the team, sometimes he feels pain, we change the plan.\n'Now is day by day, we see. We hope he can be available again as soon as possible as that is our idea but we can't give any more information.'\nLamela spent time back at his old club Roma earlier this season to aid his recovery","url":"https://www.dailymail.co.uk/sport/football/article-4301626/Tottenham-winger-Lamela-miss-rest-season.html"}
