{"authors":["Tom Bellwood For Mailonline"],"date_download":"2018-10-23 02:10:12","date_modify":"2018-10-23 02:10:12","date_publish":"2016-01-29 16:32:50","description":"Nacer Chadli believes he can solve Tottenham's need for a new striker to support Harry Kane for the season run-in. Saido Berahino remains the club's No 1 priority in this window.","filename":"data/vaneerConsumption/TottenhamforwardNacerChadlireadytoanswerstrikersearchafterBelgianoffershimselfasanalternativetoSaidoBerahino.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30AC97F400000578-0-image-a-19_1454084702762.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423097_Tottenham-forward-Nacer-Chadli-ready-central-role-Belgian-offers-alternative-Saido-Berahino_1540260612.html","title":"Tottenham forward Nacer Chadli ready to answer striker search after Belgian offers himself as an alternative to Saido Berahino","title_page":"Tottenham forward Nacer Chadli ready to answer striker search after Belgian offers himself as an alternative to Saido Berahino | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Nacer Chadli believes he can solve Tottenham's need for a new striker to support Harry Kane for the season run-in.\nSaido Berahino remains the club's No 1 priority in this window, but a deal looks more unlikely with a deal some way from being agreed.\nSpurs are just five points from the top of the table and cannot be discounted from the title race, although a top four finish remains the priority.\nNacer Chadli says he can solve Tottenham's need for a new striker to support Harry Kane for the run-in\nSaido Berahino remains the club's No 1 priority in this window but a deal looks increasingly unlikely\nAnd Chadli believes that if chairman Daniel Levy doesn't open his cheque book for a new forward before Monday's deadline, he can fill that role.\nChadli told the Evening Standard: 'I can play in all three positions up front and the manager (Mauricio Pochettino) knows that.\n'It's good that I can be versatile. I haven't played in the position very often. Apart from in pre-season, the FA Cup game at Leicester last week was the first time I had done so.\n'But I like it. I like to be close to the goal, to attack the goal, so for me it is fine.'\n26-year-old Chadli believes he can fill the striker role if chairman Daniel Levy doesn't open his cheque book\nMauricio Pochettino has confirmed that Kevin Wimmer now has the opportunity to impress him with starts\nCHADLI SPURS PL STATS 2015-16 Appearances: 15 Goals: 2 Chances created: 19 Shooting accuracy: 38% Passing accuracy: 83%\nTottenham travel to League One side Colchester for Saturday's fourth-round FA Cup tie, with Pochettino admitting he could yet start England stars Harry Kane and Dele Alli from the bench.\nAustrian defender Kevin Wimmer is poised to deputise for Jan Vertonghen, missing with knee ligament trouble.\nPochettino insists Spurs have sufficient quality within their current ranks to cope with the loss of both Vertonghen, and Andros Townsend, who joined Newcastle this week.\nTottenham travelled to Barcelona for some warm weather training this week ahead of their FA Cup tie\nTottenham will be without defender Jan Vertonghen for several weeks but he was present in Barcelona\nVictory at Colchester would hand Tottenham 10 games in 35 days, but Pochettino continues to insist his squad boasts the depth to cope with such rigour.\n'I think yes, I believe that we already have enough quality, and it's true that we lost people a few times, but that's why we have a squad of 24 to 25 players,' said Pochettino.\n'With Jan's injury it's important that a player like Kevin Wimmer can show his quality.\n'It's important for that that you always keep all the players fit and focused. It's a very good period now to show that we have a very strong squad.\n'It's a test for our squad that's true, a very busy period with a lot of games.","url":"https://www.dailymail.co.uk/sport/football/article-3423097/Tottenham-forward-Nacer-Chadli-ready-central-role-Belgian-offers-alternative-Saido-Berahino.html"}
