{"authors":["Kieran Gill For Mailonline"],"date_download":"2018-10-23 02:15:19","date_modify":"2018-10-23 02:15:19","date_publish":"2016-01-28 17:04:12","description":"Mauricio Pochettino had to leave Tottenham's training ground early on Thursday after being struck down by illness. The Spurs boss was due to hold a pre-match press conference ahead of the FA Cup fourth round.","filename":"data/vaneerConsumption/TottenhamcancelpressconferenceafterbossMauricioPochettinoleavestraininggroundearlywithillness.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30A1D06000000578-0-image-a-112_1453999662740.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421306_Tottenham-cancel-press-conference-boss-Mauricio-Pochettino-leaves-training-ground-early-illness_1540260919.html","title":"Tottenham cancel press conference after boss Mauricio Pochettino leaves training ground early with illness","title_page":"Tottenham cancel press conference after boss Mauricio Pochettino leaves training ground early with illness  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Spurs boss was due to hold a press conference ahead of the FA Cup\nMauricio Pochettino had to leave Tottenham's training ground early on Thursday after being struck down by illness.\nThe Spurs boss was due to hold a pre-match press conference ahead of their trip to Colchester in the FA Cup fourth round on Saturday.\nBut Pochettino was forced to cancel speaking to the media after coming down with a virus.\nTottenham manager Mauricio Pochettino left the club's training ground early after falling ill\nHarry Kane gestures during the Tottenham Hotspur training session on Thursday in Enfield, England\nDele Ali shares a joke as Tottenham are put through their paces after returning from Barcelona\nSpurs defender Kevin Wimmer (left) tackles team-mate Mousa Dembele during a training session\nTottenham will hope their manager can recover in time for their lunch-time kick-off at Colchester in two days.\nPochettino was due to shed light on where Spurs stand in their search for a striker, with only a week to go in the January transfer window.\nTottenham have made no secret about wanting to buy back-up for Harry Kane, who is unlikely to start on Saturday.\nPochettino made wholesale changes for Tottenham's FA Cup third round meetings against Leicester with Kane starting neither of the ties.\nMidfielder Alli is all laughs as he trains in chilly Enfield following Tottenham's return from Barcelona\nMichel Vorm pays the bills with his skills as Alli looks on at the impressive Tottenham goalkeeper\nTottenham flew out to Spain earlier this week for a warm weather training camp in Barcelona","url":"https://www.dailymail.co.uk/sport/football/article-3421306/Tottenham-cancel-press-conference-boss-Mauricio-Pochettino-leaves-training-ground-early-illness.html"}
