{"authors":["Press Association"],"date_download":"2018-10-22 23:23:55","date_modify":"2018-10-22 23:23:55","date_publish":"2016-01-29 11:07:36","description":"Toulon's former England full-back Delon Armitage is eyeing a return to the Aviva Premiership next season. The 32-year-old is out of contract this summer and ...","filename":"data/vaneerConsumption/Toulonfullbackdelonarmitageeyeingmovebacktoengland.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-b2aa6c05-4299-447a-8ee5-00ef963bec43-3bmscybNe842cce83474b54b2461-60_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421160_Toulon-Delon-Armitage-eyeing-England_1540250635.html","title":"Toulon full-back delon armitage eyeing move back to england","title_page":"Toulon full-back delon armitage eyeing move back to england | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Toulon full-back Delon Armitage eyeing move back to England\nToulon's former England full-back Delon Armitage is eyeing a return to the Aviva Premiership next season.\nThe 32-year-old is out of contract this summer and could end up surplus to requirements at Stade Mayol, owing in part to tougher rules around the quotas of homegrown players at French clubs.\nLast year's Premiership finalists Bath are understood to have held discussions with Armitage over bringing the 26-cap star to the Recreation Ground, but club bosses insist no deal is in the offing.\nDelon Armitage could be heading back to England\n\"We are not in talks with Delon Armitage,\" said a Bath Rugby spokesperson.\nArmitage is finding his future options in France limited, with triple European champions Toulon stalling on retaining his services beyond the summer.\nThe former London Irish player has proved integral to Toulon conquering Europe in the last three successive seasons, having joined the French giants in 2012.\nNow, though, Toulon owner Mourad Boudjellal may see no room for Armitage next term, after Wales full-back Leigh Halfpenny committed his future to the Cote d'Azur club.\nWasps came close to convincing British and Irish Lions full-back Halfpenny to make a move to England, but the 27-year-old has opted to take up the final year of his contract with Toulon.\nBath came close to signing Armitage's younger brother and renowned openside flanker Steffon in autumn 2014, but the 30-year-old is expected to stay at Toulon next season in what will be the final year of his current contract.\nNext season all Top 14 teams must have at least 14 players registered with the French Rugby Federation (FFR) for five years before turning 21, or to have spent at least three years in an approved training centre if under 21.\nThreats of hefty fines for non-compliance, coupled with the imposition of new salary cap rules, led to Toulon owner Boudjellal to send a written request to join England's Premiership.\nWhile this ought to end up as muscle-flexing designed as a bartering tool with the French authorities, Boudjellal continues to vent Toulon's frustrations in public.\nThe Toulon chief has already admitted the club may face some tough decisions on which overseas players they cannot retain in the summer, and Delon Armitage is among those whose future is under scrutiny.\nBath boast another former London Irish star in Tom Homer as their main natural full-back this term, with England flyer Anthony Watson also able to operate in the 15 shirt.\nArgentina stalwart Horacio Agulla also features across the back-three, but Bath are understood to be weighing up bolstering their options.\nWhile Armitage's quality is not in doubt, the attacking talent has also endured his fair share of controversy over the years.\nAfter a handful of suspensions with Irish, Armitage was widely criticised for mocking Brock James en route to scoring a crucial try in Toulon's 16-5 Heineken Cup final victory over Clermont in 2013.","url":"https://www.dailymail.co.uk/wires/pa/article-3421160/Toulon-Delon-Armitage-eyeing-England.html"}
