{"authors":["Rita Sobot In Tenerife For Mail Online"],"date_download":"2018-10-22 21:46:47","date_modify":"2018-10-22 21:46:47","date_publish":"2017-03-16 02:00:52","description":"Seventy tourists 'abseiled' 250ft to safety after two cable cars on Mount Teide in Tenerife stopped in mid-air. The dramatic rescue took place yesterday afternoon on the island's 3,700 metre high volcano.","filename":"data/vaneerConsumption/TouristsabseiltosafetydownTenerifevolcano.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E4F6E3100000578-0-image-a-107_1489629478276.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318608_Seventy-tourists-abseiled-Tenerife-volcano-cable-car_1540244807.html","title":"Tourists 'abseil' to safety down Tenerife volcano","title_page":"Tourists 'abseil' to safety down Tenerife volcano | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tourists had to 'abseil' 250ft to safety after two cable cars on Mount Teide in Tenerife stopped in mid air\nThis is the incredible moment 70 tourists 'abseiled' 250ft to safety after two cable cars on Mount Teide in Tenerife stopped in mid-air.\nThe dramatic rescue took place yesterday afternoon on the island's 3,700 metre high volcano.\nHelicopters, firemen, police and park rangers were called in to help with a pulley system to get the trapped tourists back on the ground.\nOne by one, they were lowered to safety during a four hour rescue operation. Each one was placed in a harness and then dropped through the hatch of the cable car.\nThere were no fatalities and it is understood no-one was hurt. However, there are reports of some of the people needing treatment for shock and altitude sickness.\nThere were 35 people in each of two cable cars which were automatically stopped half way up the volcano, the highest mountain in Spain and a major tourist attraction.\nThe dramatic rescue took place yesterday afternoon on the island's 3,700 metre high volcano\nThere is already widespread praise for the heroics of the rescuers who worked flat out to get people down safely.\nThe accident happened at about 2pm this afternoon, suspending the tourists in mid-air and only concluded at 7pm just before it got dark.\nIt is believed that many of the trapped were British tourists as Tenerife is a favourite destination for UK holidaymakers.\nAbout 200 people were at the top of the cable car, having visited Mount Teide, and were waiting to come back down.\nHelicopters, firemen, police and park rangers were called in to help with a pulley system to get the trapped tourists back on the ground\nMost of them were able to walk to safety despite the rocky terrain but a group of people with reduced mobility are staying the night in a refuge on the mountain.\nThey include a number of elderly holidaymakers and families with children. It is understood there are between 40 and 70 of them.\n'They have been given warm clothes, blankets and food and will be brought back down on Thursday morning,' said a spokesman.\nAbout 50 firefighters freed those trapped using a pulley system from the ground to the cars which involved an 'abseil' with ropes. The Canary Government officially activated its emergency plan.\nAbout 200 people were at the top of the cable car, having visited Mount Teide, and were waiting to come back down\nA spokesman for the cable car operator said the emergency system had stopped the cable cars midway, presumably having detected a fault or problem.\nThe exact cause will not be known until tomorrow but a full rescue plan had already been prepared in case it was ever needed.\nThe stuck cable cars were about 40 to 50 metres above the ground. One French couple on board said they felt a 'strong blow' as the cable car shuddered to a halt.\nTenerife's island council said the rescue had gone very smoothly and there had been no risk involved.\nA team of pyschologists was called in to help any of the tourists suffering from trauma.\nThe base station of Teide Cable Car is located at the foot of the volcano, at an altitude of 2,356 metres, and the station exceeds 3,555 metres.","url":"https://www.dailymail.co.uk/news/article-4318608/Seventy-tourists-abseiled-Tenerife-volcano-cable-car.html"}
