{"authors":[],"date_download":"2018-10-30 14:23:26","date_modify":"2018-10-30 14:23:26","date_publish":"2016-03-23 00:00:00","description":null,"filename":"data/vaneerConsumption/TowardasolutiontoIslamicterrorismpostBrussels.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_03_toward_a_solution_to_islamic_terrorism_postbrussels_1540909406.html","title":"Toward a solution to Islamic terrorism post-Brussels","title_page":"Toward a solution to Islamic terrorism post-Brussels","title_rss":"NULL","source_domain":"americanthinker.com","text":"Everyone – except the left – knows that the Quran teaches and permits violence against the non-Muslim when a Muslim believes he is in a perpetual state of war. Many Muslims believe this, so terrorism is justified in their sight.\nIn Brussels, Belgium, on March 22, 2016, a crime was perpetrated in the name of Islam.\nOld liberal Christopher Dickey says ISIS may gain from xenophobia in Europe. A summary from The Today Show:\nSpeaking to TODAY from Brussels, Christopher Dickey, foreign editor for the Daily Beast, calls the mood there \"very somber,\" and says there was worry earlier in the day that further attacks were ahead. He says there is a \"large population\" of disaffected young Muslim and Arab men who are tempting targets for terrorist recruitment. He says that \"we can be winning the war on the ground in Syria and Iraq\" and yet losing it in the face of terrorist attacks elsewhere. He warns of rising xenophobia in Europe - which may lead to even more recruitment opportunities for ISIS.\nAnd leftist organization Think Progress conveniently has a roundup of what its editors call \"Islamophobic responses\" to Brussels, quoting Ted Cruz:\n\"We need a president who sets aside political correctness. In the wake of Brussels, we don't need another lecture from Obama on Islamophobia,\" Cruz said. \"We need a commander-in-chief who does everything necessary to defeat the enemy, and we need to immediately halt the president's ill-advised plan to bring in tens of thousands of Syrian Muslim refugees.\"\nCan't the left come up with better strategies than unthinking, knee-jerk calls against Islamophobia? They treat us as if we're little children – dumb and means ones at that.\nThe problem is found in Islam itself, not in Western values, nor indeed in the human instinct to defend oneself. We need solutions.\nYes, let's fight terrorists. Let's expand our laws. Let's be sure that immigrants are thoroughly vetted. Syrian refugees? Sorry.\nAt the same time, however, we need eyes-wide-open, sober, long-range solutions, without being naïve ourselves or lectured to by our betters.\nMuslims must reform their religion, and here are three of the several needed steps in the right direction.\n1. Muslims scholars must admit that the Quran and Hadith teach violence, without covering it up or claiming, \"You don't read Arabic!\" (No one needs a Ph.D. in English literature to read road signs. The verses are clear enough.) And it's useless to throw around the accusation of Islamophobia or xenophobia. We know better. Admit that the verses exist.\n2. Scholars must come up with interpretive methods that conclude that the violent verses don't apply to the world today, but have an expiration date back in the seventh century. We do this with the Old Testament. Like those old verses, violent Quranic verses are not universal today.\n3. They must write articles in a variety of languages, especially Arabic, explaining the interpretive methods to schoolchildren.\nTo speak personally, I express my condolences to all the victims and their families. In the meantime, I wrote a lot about Islam ten years ago. So I don't have any illusions about its reformation. It may never happen, or certainly not in our lifetime.\nBut we have to start the process – now.\nJames Arlandson's website is Live as Free People, where he has posted How to reinterpret the Quran, Why sharia is incompatible with American values, Thirty sharia laws, Time to reform Islam, and A Brief history of war in earliest Islam.","url":"https://www.americanthinker.com/blog/2016/03/toward_a_solution_to_islamic_terrorism_postbrussels.html"}
