{"authors":["Ciara Farmer For Mailonline"],"date_download":"2018-10-22 23:41:49","date_modify":"2018-10-22 23:41:49","date_publish":"2017-04-26 08:30:02","description":"In shocking scenes, the duo lock horns after Tommy and his girlfriend Georgia Kousoulou pledged allegiance to Chloe Sims in the midst of the row","filename":"data/vaneerConsumption/TOWIEsPeteWickscomestoblowwithTommyMallet.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F9D401000000578-0-image-a-7_1493192412720.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446512_TOWIE-s-Pete-Wicks-comes-blow-Tommy-Mallet_1540251709.html","title":"TOWIE's Pete Wicks comes to blow with Tommy Mallet","title_page":"TOWIE's Pete Wicks comes to blow with Tommy Mallet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Their explosive relationship has been the focal storyline of TOWIE's 20th season.\nAnd Pete Wicks and Megan McKenna's now-defunct romance continues to seize the spotlight on the ITVBe show as Wednesday night's episode sees the tattooed hunk, 28, come to blows with Tommy Mallet regarding his convoluted love life.\nIn shocking scenes, the duo lock horns after Tommy and his girlfriend Georgia Kousoulou pledged allegiance to Chloe Sims in the midst of the row, after the beauty salon owner was catapulted into the split on unfounded infidelity rumours.\nScroll down for video\nExplosive: Pete Wicks and Megan McKenna's now-defunct romance continues to seize the spotlight on the ITVBe show as Wednesday night's episode sees the tattooed hunk, 28, come to blows with Tommy Mallet regarding his convoluted love life\nMegan and Pete's love story has spun a lengthy tale ever since they first coupled up in March last year - with accusations of adultery flaring up resentment and hurt.\nIn January, the couple were seen rowing at the NTAs while filming descended into chaos earlier this month when the duo were locked in a furious row in the street shortly after Pete was pictured looking close with co-star Chloe.\nAfter rows on both sides, including a now-iconic flare up in the street, the duo decided to put their differences aside and remain civil.\nOn Wednesday evening, Megan is seen to bump into Tommy and Georgia during dinner during which they suffer an awkward meet which culminates in Georgia vowing to stand by Chloe in the ongoing rift.\nHaving it out: In shocking scenes, the duo lock horns after Tommy and his girlfriend Georgia Kousoulou pledged allegiance to Chloe Sims in the midst of the row, after the beauty salon owner was catapulted into the split on unfounded infidelity rumours\nFurious: On Wednesday evening, Megan is seen to bump into Tommy and Georgia during dinner during which they suffer an awkward meet which culminates in Georgia vowing to stand by Chloe in the ongoing rift\nRowing: Megan and Pete's love story has spun a lengthy tale ever since they first coupled up in March last year - with accusations of adultery flaring up resentment and hurt\nAdvice: While Pete is still quenching the flames of his love woes, Chloe becomes infuriated with her involvement in the argument as she seeks support from pals Mario Falcone and James Lock\nAs Megan departs the conversation to feed the exchange back to Pete over the phone, the handsome star becomes enraged at the turn of events.\nLater in the show, Pete and Tommy come head to head and wind up locked in one of the most shocking arguments in the already explosive season.\nWhile Pete is still quenching the flames of his love woes, Chloe becomes infuriated with her involvement in the argument as she seeks support from pals Mario Falcone and James Lock.\nOut and a pout: In January, the couple were seen rowing at the NTAs while filming descended into chaos earlier this month when the duo were locked in a furious row in the street shortly after Pete was pictured looking close with co-star Chloe\nBack on? Other scenes will undoubtedly leave Little Mix's Jesy Nelson devastated as her ex-beau Chris Clark is seen getting more and more involved with his ex-girlfriend Amber Turner, with whom he enjoyed their first reunion date\nElsewhere on the show, Chloe Meadows becomes frustrated with best pal Courtney Green when she will not cut ties with former friend Amber Turner despite her ongoing feud with both Amber and Megan.\nOther scenes will undoubtedly leave Little Mix's Jesy Nelson devastated as her ex-beau Chris Clark is seen getting more and more involved with his ex-girlfriend Amber Turner, with whom he enjoyed their first reunion date.\nThe Only Way Is Essex airs on Wednesday 26th April at 10pm on ITVBe","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446512/TOWIE-s-Pete-Wicks-comes-blow-Tommy-Mallet.html"}
