{"authors":["Jj Nattrass For Mailonline"],"date_download":"2018-10-23 03:45:23","date_modify":"2018-10-23 03:45:23","date_publish":"2016-01-11 16:35:55","description":"Cutting a demure figure in a lace tea dress on Monday morning's show, the 25-year-old recalled her 'incredible' upbringing shared with foster children, revealing she was 'never short of a playmate'.","filename":"data/vaneerConsumption/TOWIEsLydiaBrightandmotherDebbieraiseawarenessforfosteringonThisMorning.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300BB00200000578-0-image-a-62_1452530097360.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394109_Lydia-Bright-cuts-demure-figure-red-lace-dress-mother-Debbie-raise-awareness-fostering-Morning_1540266323.html","title":"TOWIE's Lydia Bright and mother Debbie raise awareness for fostering on This Morning","title_page":"TOWIE's Lydia Bright and mother Debbie raise awareness for fostering on This Morning | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They have a famously close relationship.\nSo it was no surprise to see Lydia Bright lending her support to her mother Debbie Douglas on Monday, as the pair appeared on ITV's This Morning to raise awareness for fostering.\nCutting a demure figure in a lace tea dress, the 25-year-old recalled her 'incredible' upbringing shared with foster children, revealing she was 'never short of a playmate'.\nScroll down for video\nSupportive daughter: TOWIE's Lydia Bright lending her support to her mother Debbie Douglas on Monday, as the pair appeared on ITV's This Morning to raise awareness for fostering\nThe mother/daughter duo appeared on the popular daytime show to talk about Barnardo's Fostering and Adoption week, hoping to raise awareness of the need for new foster parents.\nSpeaking of her 'chaotic' up-bringing in a house, which has seen Debbie take in 250 children over 23 years, Lydia revealed to host Phillip Schofield and Holly Willoughby that she never felt any negative feelings about her busy home.\nShe explained: 'I think for me, because I never knew any different, and I was only two when mum and dad decided to become foster carers, I don’t really remember life without it.'\nAdding: 'Life was very chaotic, the children were always changing and it would be very manic. But, it was an incredible childhood, and I was never short of a playmate.'\n'It was an incredible childhood, and I was never short of a playmate': Cutting a demure figure in a lace tea dress, the 25-year-old recalled her 'incredible' upbringing shared with foster children\nBut despite the ever-changing nature of her home, Lydia extolled the virtues that Debbie's generous and selfless endeavour taught her, revealing she learned 'a lot of life lessons'.\nAlthough when Phillip reminded her of a poem she wrote at school, in which she mentioned she wished she could be an only child, Lydia revealed there were trying times.\n'I got sick of children breaking my toys,' the TOWIE star explained, laughing away any negative implications of her primary school homework.\nMeanwhile Debbie revealed that she's still fostering now, and regularly has seven children in her house - including her own four.\nA worthwhile endeavour: But despite the ever-changing nature of her home, Lydia extolled the virtues that Debbie's generous and selfless endeavour taught her, revealing she learned 'a lot of life lessons'\n'I've always said if there’s anything that I want to say on my dying bed, it's that I've made a difference': Debbie explained her reasons for fostering for 23 years, saying she wanted to make a difference to lives\nExplaining her reasons for continuing her tireless work, the 52-year-old explained: 'I've always said if there’s anything that I want to say on my dying bed, it's that I've made a difference.'\nFor her appearance on the sofa alongside Debbie, Lydia showcased her impeccable fashion taste by channelling a demure yet chic look.\nOpting for a reserved yet stylish ensemble, Lydia slipped into a red lace tea dress, which featured a pussy bow collar.\nDemure style: For her appearance on the sofa alongside Debbie, Lydia showcased her impeccable fashion taste by channelling a demure yet chic look.\nReserved yet stylish: Opting for a reserved yet stylish ensemble, Lydia slipped into a red lace tea dress, which featured a pussy bow collar\nThe blonde reality star - who is currently dating co-star James Argent - teamed the garment with a pair of black tights and stilettos, which featured a rose design and gem-stone embellishments.\nWearing her blonde tresses in an off-centre parting, the ITVBe star let her locks fall in down to her shoulder in a flourish of flicks.\nKeeping to her demure theme, Lydia opted for a pale and natural palette of make-up which; only choosing to emphasize her eyes with mascara, and her lips with a coat of red lipstick.\nDebbie meanwhile opted for a casual ensemble, teaming a black wool jumper with flared trousers and dark tan suede boots.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394109/Lydia-Bright-cuts-demure-figure-red-lace-dress-mother-Debbie-raise-awareness-fostering-Morning.html"}
