{"authors":["Andrew Bullock For Mailonline"],"date_download":"2018-10-23 01:11:11","date_modify":"2018-10-23 01:11:11","date_publish":"2017-03-16 10:59:54","description":"On Wednesday evening Mario Falcone returned to Essex to gush about his romantic vacation to his fellow TOWIE cast mate Chloe Sims.","filename":"data/vaneerConsumption/TOWIEsMarioFalconecallsBeckyMiesnerTheOne.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53A91900000578-0-image-a-58_1489663120786.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319598_Mario-Falcone-calls-Becky-Miesner-One_1540257071.html","title":"TOWIE's Mario Falcone calls Becky Miesner 'The One'","title_page":"TOWIE's Mario Falcone calls Becky Miesner 'The One' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's been frolicking with new girlfriend Becky Miesner on the beaches of Barbados.\nBut on Wednesday evening Mario Falcone returned to Essex to gush about his romantic vacation to his fellow TOWIE cast mate Chloe Sims.\nBranding Becky 'The One', Mario, 29, has simply fanned the flames where it comes to the rumours he is planning to propose to her soon.\nScroll down for video\n'She definitely is The One': Mario Falcone fuels rumours that he's planning on popping the question to girlfriend Becky Miesner as he gushes about her to Chloe Sims on TOWIE\n'He's crazy about her': The couple's loved-up display comes in light of reports that the hunk may be gearing up to get down on one knee and ask Becky to be his wife, years after popping the question to Lucy on TOWIE\n'She definitely is The One,' he told Chloe. 'I'm obsessed with her, she's amazing! I love everything about her.'\nChloe then asked about the potential possibility of a wedding and asked if she'd be invited.\n'Yes!' he assured her.\nThe couple looked every inch the lovebirds in a sizzling snap on Instagram last Wednesday, where they continued their sun-soaked Barbados getaway.\nThe reality star couldn't resist displaying his chiselled torso and bulky biceps in a pair of tiny red swim shorts, while his other half sizzled in a skimpy black bikini.\nKiss me, quick! They put on a raunchy display on the beach on Monday, where they puckered up while wearing sizzling swimwear\nMario soared to fame when he entered the ITVBe show as Lucy Mecklenburgh's boyfriend in 2011 before becoming a central character once he split from the health guru after she cheated on him with Mark Wright.\nHowever, he seems to have moved on with gorgeous Becky, which was evident as he cosied up to her in the snap, which boasted a crystal clear waters behind them.\nWearing a bandada to tame his long brunette locks, Mario looked every inch the hunk as he exhibited his gym-honed frame.\nHe utilised one inked arm to keep his girlfriend close - and it wasn't difficult to see why he was marking his territory.\nSmitten display: The pair have been lining Instagram with stunning photos from their Caribbean getaway\nBecky flaunted her impossibly flat stomach and long legs in the black bikini, which boasted white detailing.\nAdding a casual element to the ensemble, the brunette covered up slightly with an oversized-white tee, which was unbuttoned down the front.\nThe pair have been lining Instagram with stunning photos of their sun-kissed getaway.\nThe couple's loved-up display comes in light of reports that the hunk may be gearing up to get down on one knee and ask Becky to be his wife, years after popping the question to Lucy on TOWIE.\n'Barbados with my best friend': Mario Falcone displayed his ripped physique as he cosied up alongside his girlfriend Becky Miesner on Instagram on Wednesday\nA source recently told The Sun: 'Mario is crazy about Becky and she feels the same way. He has been planning to propose to her and can't wait to show the world how serious he is.'\nMeanwhile Becky herself appears equally as smitten with the reality star - referring to him as the 'best boyfriend ever' and the 'love of her life' on her Instagram page in recent weeks.\nMario had previously teased at an engagement with the beauty, after he posted a video of Becky dancing on his Twitter page.\nReality star: Mario soared to fame when he entered the ITVBe show as Lucy Mecklenburgh's boyfriend in 2011 before becoming a central character once he split from the health guru after she cheated on him with Mark Wright\nGushing of his girl in the caption, he wrote to fans: 'I truly hope and pray I marry this girl one day!'\nMario went public with the make-up artist last year, and the pair have since moved in together. In a recent interview with Star magazine, the tailor even admitted that he is keen to start a family with Becky - confessing he had 'never felt that way' before.\nHe admitted to the publication: 'I can't stand to think about upsetting her like I have with other girls in the past. I can see us having kids and getting engaged, which I have never felt before.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319598/Mario-Falcone-calls-Becky-Miesner-One.html"}
