{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 01:16:18","date_modify":"2018-10-23 01:16:18","date_publish":"2017-03-16 11:05:08","description":"after being questioned by fans on social media, James Lock has been forced to deny claims he has secretly had plastic surgery due to his puffy eyed appearance.","filename":"data/vaneerConsumption/TOWIEsJamesLockforcedtodenyplasticsurgeryclaims.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53A93500000578-0-image-a-86_1489663176065.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319732_TOWIE-s-James-Lock-forced-deny-plastic-surgery-claims_1540257378.html","title":"TOWIE's James Lock forced to deny plastic surgery claims","title_page":"TOWIE's James Lock forced to deny plastic surgery claims | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He was sporting a painful looking black eye on Wednesday night's installment of TOWIE.\nAnd after being questioned by fans on social media, James Lock has been forced to deny claims he has secretly had plastic surgery due to his puffy-eyed appearance.\nThe reality star was seen chatting to new girlfriend Yazmin Oukhellou in scenes aired on the ITVBe show, wearing a flat cap pulled down low on his face.\nScroll down for video\nSporting a shiner: James Lock has been forced to deny claims he has secretly had plastic surgery due to his puffy-eyed appearance on Wednesday's episode of TOWIE\nHe took to Twitter to post: 'Just to clear something up! I haven't had plastic surgery! Got the black eye from sparring at boxing training! Total accident! #TOWIE'.\nThe star has been incredibly loved up with brunette beauty Yazmin since they struck up a relationship earlier this year.\nThe stunner - who has joined the show as a new cast member - was seen chatting about her feelings to Megan McKenna and Amber on Wednesday night's installment.\nHitting back: The reality star was seen chatting to new girlfriend Yazmin Oukhellou in scenes aired on the ITVBe show, wearing a flat cap pulled down low on his face\nNewly-single Megan enthused: 'When I see you together, you two are like, all over each other.'\nYazmin confessed: 'You know I've been through s**t... and I think I've found The One! Don't laugh at me!'\nMegan replied: 'I know he treats you lovely, I just think - good luck to the both of you.'\nHappy: James has been incredibly loved up with brunette beauty Yazmin since they struck up a relationship earlier this year\nThe girls then addressed former cast member Danielle Armstrong, who was in a long-term, on/off relationship with Lockie.\nAmber enthused: 'I am glad because I only know Lockie in a relationship with Dan, and obviously they had their ups and downs.'\n'I think that a lot of boys mess about don't they til they find the one girl that they truly like. Hopefully he behaves!', Yazmin quipped.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319732/TOWIE-s-James-Lock-forced-deny-plastic-surgery-claims.html"}
