{"authors":["Elizabeth Aguilera","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:58:13","date_modify":"2018-10-30 22:58:13","date_publish":"2017-03-09 04:14:33","description":"Struggling with what officials call the largest and most expensive toxic contamination in California history, embattled state regulators have changed the formula for assessing the level of lead-laced soil in residential areas—a move that could result in a significant number of homes falling off the priority cleanup list.","filename":"data/vaneerConsumption/ToxicPrioritiesSwitchingcleanuprulesstaterisksleavinghomescontaminated.json","image_url":"https://calmatters.org/wp-content/uploads/TOXICS_Photo_2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940293.html","title":"Toxic Priorities: Switching cleanup rules, state risks leaving homes contaminated","title_page":"Toxic Priorities: Switching cleanup rules, state risks leaving homes contaminated | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"In the months since, the state toxics department has been working on the required draft plan and environmental impact review. Department officials said the stalled cleanup could resume as early as this summer. Full cleanup, assuming the funds are found to do it, could take many years.\nMeanwhile thousands of families continue to live with lead-contaminated soil around their homes, trying their best to keep their kids and grandkids away from it while they wait.\nAsked why the change was necessary, officials at the state toxics department said the new formula is more precise.\n“We changed the approach to use the U.S. EPA’s approach, the approach that is used pretty much across the nation, because of the number of properties we have to prioritize,” said Barbara Lee, the department’s director. “We will start with those that have the greatest potential exposure to vulnerable populations and work our way down and we will do as many as we can do.”\nShe insisted the change has “nothing to do with the expense.”\nTamara Zielinski, the department’s branch chief overseeing the Exide residential cleanup, said the department was prioritizing based on a federal hazard-ranking system that takes into account “a likelihood of people coming in contact with it, the type of property it is and several other factors”—with special consideration given to homes with small children and pregnant women.\nBut other experts challenged the rationale for the switch to the new formula, noting that California often has stricter environmental standards than the federal government—for good reason.\n“It’s clear this is a large problem, and if one set of rules tells them a certain number of homes to clean up and another set of rules says a smaller number, frankly, the right thing to do is to do the big one,” said Peter Green, a researcher at the University of California, Davis, department of civil and environmental engineering who specializes in lead contamination. “I understand it’s costly, but trying to drag it out and trying to do it a little cheaper I bet will cost more in the long run with lawsuits….These are people’s homes, they have children, exposure. You can’t trim it back, you have to do it right.”\nDavid Bellinger, a professor of neurology at Harvard Medical School who studies lead exposure, said if forced to choose a property that has one spike score and another property with more consistent levels, he would prioritize the one with the spike “because that would increase my index of suspicion because there are other high spots.”\nTensions between the department and the community continue to rise, over both the pace and the transparency of the cleanup.\nThe latest flare-up came late last month when the department, responding to allegations from local workers, asked the state attorney general to investigate whether the state-hired contractor Arcadis was improperly sampling soil, manipulating data, and being racially derogatory toward staff.\nBut the community is also unsettled by the state’s decision to change its formula for determining which homes qualify for cleanup and which will be cleaned up first.\nThe Exide cleanup—by the numbers\nOne such home belongs to World War II veteran Fermin Vega, who is 93. He has lived in the house, or the one next door, for more than 60 years. His soil results, which he keeps handy in a manila envelope in his kitchen, show that one part of his yard has a high point of 841 parts per million. But under the new formula’s average-based calculation, which will determine his place in the cleanup line, his score is only 492 ppm.\nThe federal Centers for Disease Control says there is no safe level of lead, a neurotoxin responsible for developmental disabilities and cognitive deficiencies.\n“It’s not right. They should prioritize wherever it’s high, period, no matter,” said his son Joseph Vega, who wryly jokes that perhaps his young daughter should move in with her grandpa to help him get his yard cleaned up quicker. “Like for my father, he’s elderly and he’s more susceptible, he’s like a young child so that shouldn’t matter.”\n“They’re rigging the game now,” he added. “They are playing by their rules.”\nThe state standard for cleanup of lead in residential areas is 80 parts per million. The original cleanup plan for the Exide area tagged any property with at least one sample above 80 ppm. Properties with at least one sample above 1,000 ppm were placed in the first priority group for cleanup.\nThe new formula averages all the samples taken from various spots around a property, adding some additional points for areas with higher sample results. But some homes with elevated levels near the bottom of the spectrum—close to the state’s limit of 80 ppm—could be left off the cleanup list entirely once their slate of samples is averaged out under the new formula.\nZielinski, the toxics department’s branch chief, said she did not believe that any properties would be left entirely off the cleanup list—although without more funding, being on the list may not be a guarantee of getting cleaned up. But in response to further CALmatters questioning, Moreno, the department’s spokesman, acknowledged a property could have a sample above 80 ppm and no longer be slated for cleanup.\n“They are not cleaning up every home that is above 80 (ppm). It puts an already impacted community at risk to do partial cleanup that leaves their kids and future generations at risk of lead exposure.”” said Jill Johnston, assistant professor of preventative medicine at the University of Southern California, and community outreach director for its environmental health division. She’s also a member of the state-created Community Advisory Group on the Exide cleanup.\nJohnston also finds fault with the agency’s draft plan to clean up only areas considered contaminated—for example, only the right side yard but not the left or back or front.\n“They should clean up the whole yard,” she said. “It’s not worth leaving hot spots behind that you didn’t test.”\nThe state toxics department says it has used the federal EPA formula once before, in the Sacramento Railyards cleanup, but it was unable to provide any examples where it had been used in a California residential cleanup.\nPlenty of people remain unsatisfied with the new risk calculation, said Mark Lopez, head of East Yard Communities for Environmental Justice and a member of the Community Advisory Board. “We would like for the highest score to be the standard,” Lopez said. “So if I’m testing one sample over a 1,000, that should place me in priority 1. It should not be averaged out with a bunch of my other samples….Because that acute threat of exposure should be enough to put me there.”\nLopez accuses the state agency of not respecting or valuing the community it serves. After a recent community meeting, he said the new formula is difficult to understand and has not been explained well. “And when you come to understand what it is,” he said, “it’s a different scheme for watering down the numbers.”\nIn recent years, the Legislature created an Independent Review Panel to oversee how the agency operates. Its most recent annual report, de León said, “shows numerous deficiencies with operations, communications, accountability and transparency.”\nSeveral proposed bills aim to further reform its operations.\nThe state says it intends to sue Exide to recover its costs, but nothing has been filed in court yet. The company filed for bankruptcy in 2013. It’s also unclear if a new law that placed a $1 fee on all lead car battery purchases beginning this year— intended for future toxic cleanup— will cover Exide remediation.\n“We are not cleaning up every property right now,” said Moreno, the department spokesman. “If funding becomes available later, all of those houses that have been ranked, eventually they will get cleaned up.”\nDe León said the additional money needed to complete the project is part of the budget process discussions.\n“Ideally we would de-lead every home in the country and excavate every urban yard but that is not going to happen,” said Bellinger at Harvard. “Unfortunately we just keep learning that lead is worse than we thought it was. It’s an element, it doesn’t degrade, it’s there forever. It’s very insidious.”\nMore than 3 percent of children in the area now show elevated blood levels, according to the Los Angeles County Public Health Department. Because lead only stays in the blood for 30 days, many residents fear that many more have been poisoned over the decades.\nMeanwhile, on Garnet Street in the Boyle Heights neighborhood near the old Exide battery smelter, Emma Flores sweeps her porch, her two little dogs napping nearby under the shade of a tree on her front lawn. She points to a small garden shovel thrown in the dirt under one of those trees.\n“My grandson likes to dig there, but we don’t let him do that anymore,” she said. “Now the boys go straight upstairs.”\nLike many households in the impacted area, the Flores home is a multi-generational one. Her son, who is fighting colon cancer, and his two sons, ages 7 and 10, live there, in the house the Flores family has called home for 37 years. The family’s soil sampling results sit in the same big yellow envelope they came in, delivered by the mailman weeks ago. No one from the state has been by to help the family decipher the documents.\nAt her property, the highest samples show readings of 2,155 ppm and 1,006 ppm. None of the results on the surface layer are lower than 398 ppm. Under the new formula, her score is 1,135. That still puts her house on the priority list, but lower than before.\n“What can we do,” she said, sighing. “They are going to do whatever they want. We just have to wait.”","url":"https://calmatters.org/articles/toxic-priority-hed-here/"}
