{"authors":["Press Association"],"date_download":"2018-10-22 23:45:34","date_modify":"2018-10-22 23:45:34","date_publish":"2016-01-28 12:59:44","description":"Campaigners have urged more major toy manufacturers to make products featuring characters with disabilities after Lego bowed to pressure to include one in it...","filename":"data/vaneerConsumption/Toymanufacturersurgedtofollowlegosleadinproducingdisabledcharacters.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-fa093e11-87d8-441f-88c3-64a8f44e9b2d-2vdWmEltwXfba0ce28e6328dc9b2-472_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420716_Toy-manufacturers-urged-follow-Legos-lead-producing-disabled-characters_1540251934.html","title":"Toy manufacturers urged to follow lego's lead in producing disabled characters","title_page":"Toy manufacturers urged to follow lego's lead in producing disabled characters | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Toy manufacturers urged to follow Lego's lead in producing disabled characters\nCampaigners have urged more major toy manufacturers to make products featuring characters with disabilities after Lego bowed to pressure to include one in its new range.\nPictures of the plastic mini-figure of a young man using a wheelchair and apparently accompanied by an assistance dog were spotted at the Nuremberg toy fair in Germany and shared on websites devoted to the world's largest toy firm's products.\nLego confirmed that the wheelchair would form part of a set which would go on sale in June.\nThe first Lego disabled mini-figure (promobricks/PA)\nJournalist Rebecca Atkinson, who sparked a global campaign when she posted pictures of toys she had adapted with different disabilities on the internet, said it was a massive step towards ending \"cultural marginalisation\".\nThe mother of two, who is partially deaf and has tunnel vision due to genetic condition retinitis pigmentosa, established the #toylikeme movement to secure better representation of the 770,000 disabled children in the UK and 150 million across the globe.\nIt quickly gained tens of thousands of supporters on social media and resulted in her working as a creative disability consultant with Playmobil to work on adding characters to its range - with more than 20,000 people signing a petition urging Lego to follow suit.\nThe Danish firm had been criticised by the campaign for \"pandering to disability stereotypes\" because its only previous wheelchair-using character was an elderly man.\nAn online campaign via a Lego website for the creation of a Lego wheelchair skatepark was rejected on the basis that submissions with a \"political agenda\" would not be accepted.\n\"We are beyond happy right now,\" Ms Atkinson said.\n\"Lego have just rocked our brick-built world and made 150 million disabled kids, their mums, dads, pet dogs and hamsters very very happy.\n\"We're all conga-ing up and down the street chucking coloured bricks like confetti.\n\"But on a serious note, this move by Lego is massive in terms of ending cultural marginalisation, it will speak volumes to children, disabled or otherwise, the world over.\"\nMs Atkinson is now seeking investment via a crowdfunding website to grow the organisation and create an online hub to help parents find products which represent disability, and has raised £3,638 of a £16,000 target within just a few days.\nA photograph of the figure - by the Promobricks blog - was featured on the BrickFans website which paid tribute to the campaign.\n\"For a number of months a social media campaign called Toys Like Me has called upon toy makers including Lego to start featuring more characters and toys that reflect real life a little more,\" it said.\n\"I'm sure you'll agree this is a great step in the right direction by The Lego Group. With Lego being the number one toy brand in the world right now, their products are greatly influential for its younger fan base.\n\"Providing an able bodied person with the notion that a disability isn't something to be frowned upon while also offering a young disabled person with a positive representation for them to project themselves onto during play, is an achievement which should be saluted.\"\nPasca Lane, head of PR at disability charity Scope, said: \"Everything is awesome!\n\"Many parents tell us it is important for their children to have toys which they can identify with because it builds their confidence, self-esteem and the feeling of being included in society.\n\"It is great that Lego has responded to this demand and will go on sale in June. We hope this move will help build a better future and improve attitudes towards disabled children and their families.\n\"But too many toy manufacturers are still missing a trick by not making toys with impairments widely available. After all, the spending power of disabled consumers is worth over £200 billion.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3420716/Toy-manufacturers-urged-follow-Legos-lead-producing-disabled-characters.html"}
