{"authors":["Press Association"],"date_download":"2018-10-23 01:43:43","date_modify":"2018-10-23 01:43:43","date_publish":"2017-03-16 11:58:09","description":"The Japanese car-maker will upgrade its Burnaston centre with new equipment, technologies and systems.","filename":"data/vaneerConsumption/Toyotatoinvest240minUKcarplant.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/11/wire-228167-1489665494-9_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4319908_Toyota-invest-240m-UK-car-plant_1540259023.html","title":"Toyota to invest £240m in UK car plant","title_page":"Toyota to invest £240m in UK car plant | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Toyota is to invest £240 million in its plant in Derbyshire, but the car giant’s boss has called for continued tariff- and barrier-free access between the UK and Europe.\nThe Japanese firm said the investment into its plant in Burnaston will see the centre upgraded with new equipment, technologies and systems.\nDr Johan van Zyl, president and chief executive of Toyota Motor Europe, said the cash injection was a sign of confidence in employees and suppliers, but warned: “Continued tariff- and barrier-free market access between the UK and Europe that is predictable and uncomplicated will be vital for future success.”\nToyota announces new investment in its UK car plant: https://t.co/pzL0vs3pJ7 pic.twitter.com/KIZ18TNHDi — ToyotaGB (@ToyotaGB) March 16, 2017\nHis comments come as the Government faces intense pressure to secure tariff-free access to the EU’s single market for car manufacturers following Brexit.\nThe money will improve competitiveness and enhance the car marker’s “supply chain efficiencies”, as well as enable the production of vehicles on the Toyota New Global Architecture (TNGA) platform, the group said.\nDr van Zyl added: “We are very focused on securing the global competitiveness of our European plants. The roll-out of TNGA manufacturing capability is part of this plan.\nThe Toyota assembly line in Burnaston (Chris Radburn/PA)\n“This upgrade of Toyota Motor UK is a sign of confidence in our employees and suppliers and their focus on superior quality and greater efficiency. We welcome the UK Government funding contribution for this activity.”\n“Our investment demonstrates that, as a company, we are doing all we can to raise the competitiveness of our Burnaston plant in Derbyshire.”\nThe money will be backed by up to £21.3 million of Government investment, subject to independent assessment, to support skills and training, research and development and innovation.\nBusiness and Energy Secretary Greg Clark said: “Our automotive sector is one of the most productive in the world and Toyota’s decision to invest £240 million upgrading its Burnaston plant is a further boost to the UK auto sector.”\nTheresa May has given special Brexit assurances to rival Japanese carmaker Nissan as thousands of jobs in the sector hang in the balance after the Prime Minister confirmed that she will extricate Britain from the free trade area.\nUnite general secretary Len McCluskey said: “The confirmation of this platform upgrade at Toyota is further evidence that the UK car industry and the people who work in it are among the best in the world at what they do.\n“They need to know that the Government has their back and will do whatever is necessary to ensure new models and new investment keeps coming to Britain.\nMinisters urged to secure tariff free access as Toyota confirms investment plans https://t.co/p9H49KXTft pic.twitter.com/3QOU8mrQNi — Unite the union (@unitetheunion) March 16, 2017\n“With discussions set to start on the replacement of models such as Vauxhall’s Astra and decisions due on BMW’s electric Mini, it is vital that Government ministers calm nerves by stating they will secure tariff-free access to the European single market and customs union in Brexit negotiations.”\nMike Hawes, chief executive of the Society of Motor Manufacturers and Traders (SMMT), said: “After a decline in investments in the sector last year, government must continue to collaborate with industry and, as we leave the EU, deliver a deal that safeguards as many of the trading benefits we currently enjoy.”","url":"https://www.dailymail.co.uk/wires/pa/article-4319908/Toyota-invest-240m-UK-car-plant.html"}
