{"authors":[],"date_download":"2018-10-22 22:17:28","date_modify":"2018-10-22 22:17:28","date_publish":"2014-06-09 17:32:12","description":"Toyota will launch production of its first commercially available hydrogen fuel-cell vehicle before the end of the year, according to a report from Japan.","filename":"data/vaneerConsumption/ToyotaAdvancesProductionDateofHydrogenCarReportsays.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/497041/toyota-hydrogen-car-concept-300x157_87f4771ed6c35920f588a36d4f6a53d5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_autos_toyota-advances-production-date-hydrogen-car-report-says-n126436_1540246648.html","title":"Toyota Advances Production Date of Hydrogen Car, Report says","title_page":"Toyota Advances Production Date of Hydrogen Car, Report says","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nToyota will launch production of its first commercially available hydrogen fuel-cell vehicle before the end of the year, earlier than expected, according to a report from Japan.\nToyota first revealed plans to get into the hydrogen car market last year, at the Tokyo Motor Show. It has produced a number of prototypes in recent years, but the Japanese giant has been suggesting it might go the fuel-cell route as an alternative to depending on battery-electric vehicles to meet tough new Zero-Emission Vehicle, or ZEV standards.\nThe first Toyota battery cars would come in at around 8 million yen, according to the Japan Times, which would work out to a hefty $78,000, though the English-language publication noted that by the beginning of the next decade, Toyota would like to trim that to somewhere between 3 million to 5 million yen, or between $30,000 and $50,000 at current exchange rates.","url":"https://www.nbcnews.com/business/autos/toyota-advances-production-date-hydrogen-car-report-says-n126436"}
