{"authors":["Robert Wilde"],"date_download":"2018-10-30 20:18:07","date_modify":"2018-10-30 20:18:07","date_publish":"2015-06-15 14:43:25","description":"Stephen Miller, one of the staff leaders for Alabama Sen. Jeff Sessions, joined Breitbart News Sunday and was asked by Breitbart’s Executive Chairman and host, Stephen K. Bannon: “Isn’t the Trans Pacific Partnership Agreement (TPP) really a global governance deal, rather than a trade agreement? |","filename":"data/vaneerConsumption/TPPEntersUSAintoaNewTransNationalUnion.json","image_url":"https://media.breitbart.com/media/2015/06/TPP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_15__1540930687.html","title":"TPP Enters USA into a 'New Trans-National Union'","title_page":"TPP Enters USA into a 'New Trans-National Union'","title_rss":"NULL","source_domain":"breitbart.com","text":"Breitbart News Sunday and was asked by Breitbart’s Executive Chairman and host, Stephen K. Bannon: “Isn’t the Trans Pacific Partnership Agreement (TPP) really a global governance deal, rather than a trade agreement? Is this a way to get the United States into a Pacific Union, as Senator Sessions lays out, that is very much like the European Union?” Stephen Miller, one of the staff leaders for Alabama Sen. Jeff Sessions, joinedand was asked by Breitbart’s Executive Chairman and host, Stephen K. Bannon: “Isn’t the Trans Pacific Partnership Agreement (TPP) really a global governance deal, rather than a trade agreement? Is this a way to get the United States into a Pacific Union, as Senator Sessions lays out, that is very much like the European Union?”\n‘That’s exactly what is happening here,” said Miller. “The Pacific Union that Sen. Jeff sessions refers to is the new transnational governance body that would be created by the Transpacific Partnership.”\nMiller says that in effect the first trade deal would be fast-tracked under the Trade Promotion Authority (TPA), of which both houses of congress are in favor.\n“What this means,” explained Miller, “is the house and the senate together would be authorizing the president to enter the United States into a new trans-national union.”\nThe Union would consist at first of twelve countries, but additional countries could join and be added over time. “It could issue regulations about labor policy, about immigration policy, about environmental policies, and many other areas impacting American life, American jobs, and American wages.”\nAlso appearing on the program, which airs on Sirius XM, Patriot Radio, channel 125, was Lord Christopher Monckton. Monckton, who served as a policy advisor for former UK Prime Minister Margaret Thatcher, argues that a Trans Pacific Union would bear a significant resemblance to the European Union, which Monckton insists is a serious detriment to democracy and leads to dictatorship.\nMoncton asked Miller, “Does the TPP constitutes a treaty in U.S. Law?” Sessions lead staffer replied, “One of the most important things about the “fast track” (Trans Pacific Authority), is it takes what is far more like a treaty then a trade deal, as Sen. Sessions has explained, and eliminates the treaty vote, and even eliminates the senate filibuster.”\nAs a result, Miller added, “the president can enter into an unlimited number of large sweeping international agreements. And, congress can’t filibuster them, at any point, for the next six full years.”\nMonckton retorted, “We’ve used this word before on this program—dictatorship. This is dictatorship.”\nMiller further informed:\nFor anyone out there who feels like their sovereignty is slipping away, we are moving towards a trans-national government, where international elites meet in secret and affect their lives and their futures, where they can no longer make basic decisions as citizens about who can come into the country and what the rules are–like we have seen in the EU–then they should be telling their lawmakers that they don’t think we should be moving trade deals under a “fast-track.”\nBannon asked Miller “How did we get to where the Republican establishment is being a cheerleader and ceding these powers to Pres. Obama?”\nWhen people ask Miller difficult question like that, he says that he usually quotes his boss Sen. Sessions:\nFor some people if you put free-trade on the outside of a folder it doesn’t matter what’s on the inside of the folder, nobody looks. So you can take something that is not a free trade deal, that doesn’t advance America’s economic interests, that is much much more than a trade agreement, like the Trans-Pacific Partnership, and all you have to say on the outside is “free trade” and no one will look on the inside.\nMiller added, that regarding the TPA, “the purpose of ‘fast-track’ is to pre-approve deals before they are made public.” Moreover, he stated about the Trade and Services Agreement, TSA, one of its goals would be to prevent the USA from clamping down on H-1B visa abuses from over 50 countries. Porponents would argue that America is violating the agreement.","url":"https://www.breitbart.com/politics/2015/06/15/tpp-enters-usa-into-a-new-trans-national-union/"}
