{"authors":[],"date_download":"2018-10-22 22:07:04","date_modify":"2018-10-22 22:07:04","date_publish":"2014-06-08 21:18:32","description":"Former SNL actor Tracy Morgan, 45, broke several bones as a result of a fatal car accident on the New Jersey Turnpike.","filename":"data/vaneerConsumption/TracyMorganMoreResponsiveFollowingFatalCrash.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/495446/140608-tracy-morgan-jms-1652_354e3a9a692db65b12588612c0d4951b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/pop-culture_celebrity_tracy-morgan-more-responsive-following-fatal-crash-n125781_1540246024.html","title":"Tracy Morgan \"More Responsive\" Following Fatal Crash","title_page":"Tracy Morgan \"More Responsive\" Following Fatal Crash ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFrom NBC Philadelphia\nFormer SNL actor Tracy Morgan, 45, broke several bones as a result of a fatal car accident on the New Jersey Turnpike at 1 a.m. Saturday morning. The crash killed Morgan's mentor James \"Jimmy Mack\" McNair, 62, of Peekskill, New York.\nThe comedian remains in critical condition but his family is encouraged by his progress after he underwent surgery on his leg today.\n\"While Tracy remains in critical condition, he has been more responsive today, which is an incredibly encouraging sign. He sustained a number of injuries including a broken leg, a broken femur, a broken nose and several broken ribs,\" said his publicist Lewis Kay.\n\"He had surgery earlier today on his leg. We expect him to remain in the hospital for several weeks. His family is tremendously overwhelmed and appreciative of the outpouring of love and support from his fans.\"\nKevin Roper was driving a Walmart big rig on the turnpike and hit the limo that Morgan was riding in.\nThe tractor-trailer driver, Kevin Roper, 35, of Jonesboro, Georgia, was charged with one count of death by auto and four counts of assault by auto, Middlesex County Prosecutor’s Office said in a news release. Roper, accompanied by his attorney, turned himself in to state police. He was released on $50,000 bail Saturday night.\nThe accident happened about 15 miles north of Trenton near Exit 7A of the Turnpike in Cranbury, N.J.\nJeffrey Millea, of Shelton, Connecticut, and comedian Ardie Fuqua Jr. were listed in critical condition along with Morgan at Robert Wood Johnson Hospital, hospital spokeswoman Zenaida Mendez said Sunday, The Associated Press reported. Another comedian, Harris Stanton, was treated and released from the hospital Saturday.\nA court appearance is expected Monday but has not been scheduled, according to the Middlesex County Prosecutor's Office","url":"https://www.nbcnews.com/pop-culture/celebrity/tracy-morgan-more-responsive-following-fatal-crash-n125781"}
