{"authors":[],"date_download":"2018-10-22 22:21:14","date_modify":"2018-10-22 22:21:14","date_publish":"2017-04-26 04:26:19","description":"The green mosque in the Afghan military compound attacked by Taliban militants is scarred -- disfigured by bullet holes, blast marks and with blood...","filename":"data/vaneerConsumption/TracesofdeathatAfghanbaseattackedbyTaliban.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/04/wire-463091-1493177181-874_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446212_Traces-death-Afghan-base-attacked-Taliban_1540246874.html","title":"Traces of death at Afghan base attacked by Taliban","title_page":"Traces of death at Afghan base attacked by Taliban | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Taliban militants wearing Afghan army uniforms rampaged through the military compound near Mazar-i-Sharif, spraying bullets, with some detonating suicide vests\nThe green mosque in the Afghan military compound attacked by Taliban militants is scarred -- disfigured by bullet holes, blast marks and with blood splattered across the ceiling -- telltale signs of the deaths of at least 144 young Afghan recruits.\nImages filmed by an AFP journalist reveal some of the horror of one of the deadliest attacks ever perpetrated in Afghanistan.\nThe images and testimony collected there have helped piece together the unbridled brutality that ripped through the base, home to the 209th Army Corps, about 15 kilometres (10 miles) from the city of Mazar-i-Sharif.\nEarly on Friday afternoon, at the time of prayer, at least 10 men armed with guns and suicide vests travelling in Humvees and military trucks arrived at the first checkpoint leading to the base.\nThey were dressed in Afghan army uniforms, multiple sources have told AFP, fuelling suspicions of complicity on the 30,000-strong base, where Western instructors are sometimes called on as part of NATO's training, assist and advise mission.\nThe militants passed the checkpoint, a huge portico, by persuading guards that they were rushing a seriously wounded colleague to hospital, a high-ranking security source with access to the base and to witnesses told AFP.\nThe base near Mazar-i-Sharif is one of the largest in the north of insurgency-wracked Afghanistan\nAt the second checkpoint one officer became suspicious, the source said -- only to have two of the militants trigger their suicide vests, as the rest hurtled past at full speed towards the mosque, roughly a kilometre from the entrance.\nThey knew the base, the source said, stressing the meticulous preparation involved -- four of them had trained there in the past, and all carried valid passes.\nThey knew that in the part of the base they were headed no soldier was allowed to carry a weapon.\nAfghan authorities have been elusive on a death toll, but late Tuesday a senior US defence official told AFP that at least 144 recruits were killed, with more than 60 wounded.\nMilitary sources on the base have put the death toll as high as 160.\n- Blood on the ceiling -\nBlood stains and bullet holes mark a mosque at the Afghan army base near Mazar-i-Sharif where Taliban militants killed scores of young recruits in one of the deadliest attacks the country has ever seen\nWhen the first fighting broke out, one of the assailants dressed in a special forces uniform rushed into the mosque, the security source said.\nHe herded the panicked recruits to take cover together in a room. \"And there he blew himself up,\" the source said.\nAny survivors were gunned down by the remaining militants, he added.\nThe pitted cement of the mosque's facade bears the marks of the ferocious assault.\nAt the door, a suicide bomber detonated his vest, leaving black scorch marks up the wall and splashes of blood on the ceiling.\nOne 19-year-old survivor, Mohammad Qurban, previously said many victims were shot at close range.\n\"Their leader was telling them 'aim for their heads',\" he said from a hospital in Mazar.\n\"They killed a lot of my friends, I jumped out of a window to survive.\"\nA little further, the mess hall has collapsed under the onslaught from the machine guns, the metallic structure twisted and the roof ripped open.\nZabiullah, 22, told AFP he was eating lunch in the hall at the time.\n\"An army truck pulled over near us with four men who looked like our soldiers,\" Zabiullah, who was wounded in the shoot-out, said.\n\"Two of them with suicide vests jumped out of the car, entered the dining room and started shooting. The other two started shooting with a heavy machine gun on top of the truck,\" he told AFP.\nThe US defence official, who spoke on condition of anonymity, noted that weapons are not allowed in the dining hall or mosque.\nHe echoed the security source in stressing the well-planned nature of the assault, targeting areas hosting large numbers of unarmed people in a confined space.\nHe also said some 30 coalition forces -- likely German or American -- were at a different part of the base in their training capacity at the time, but were not involved in repelling the assault.\nThe commander of the 209th Army Corps, Mohmand Katawazi, said he hoped those responsible for the horror would be held to account.\nPresident Ashraf Ghani transferred him on Monday following accusations of complicity. The defence minister and army chief also resigned, leaving embattled security forces facing disarray as the Taliban gear up for the spring fighting season.\nAfghan authorities have been elusive on the death toll from the Taliban assault on the military base in Mazar-i-Sharif, but a senior US defence official told AFP that at least 144 recruits were killed, with more than 60 wounded\n\"I am leaving this position but I should be punished. I myself asked to be suspended in the wake of the attack that took place here,\" Katawazi insisted.\n\"Everyone has their own responsibilities in a military base. I am not a gatekeeper and I have nine provinces under my responsibility. But someone must be accountable for this horrible incident.\"","url":"https://www.dailymail.co.uk/wires/afp/article-4446212/Traces-death-Afghan-base-attacked-Taliban.html"}
