{"authors":[],"date_download":"2018-10-22 22:29:05","date_modify":"2018-10-22 22:29:05","date_publish":"2014-06-09 21:40:04","description":"U.S. motorists face higher injury risks because federal rules compel some commercial drivers to skip their rests, trucker advocates asserted Monday.","filename":"data/vaneerConsumption/TracyMorganCrashWhyAreSomeLongHaulTruckersSoTired.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/498656/140610-tracy-morgan-jsw-802a_82e7397909f8fb6ed4930d2c8c0a92f3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_tracy-morgan-crash-why-are-some-long-haul-truckers-so-n126731_1540247345.html","title":"Tracy Morgan Crash: Why Are Some Long-Haul Truckers So Tired?","title_page":"Tracy Morgan Crash: Why Are Some Long-Haul Truckers So Tired?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAmerican motorists face a higher injury risk involving long-haul rigs because federal rules are compelling some commercial drivers to skip their rest stops, the leader of a truckers trade group asserted Monday.\nFresh scrutiny is being aimed at the U.S. trucking industry following the fatal New Jersey collision Saturday between an allegedly fatigued Wal-Mart truck driver and several cars, leaving one man dead and three people -- including comedian Tracy Morgan –- in critical condition.\nFederal regulations now limit commercial drivers to 14-hour workdays -– part of a series of moves meant to give truckers more down time and inject more safety into the nation’s highways.\nBut the hourly ceiling removed the deadline flexibility that commercial drivers once had if they needed to wait out traffic jams and bad weather, forcing some to max out their 14-hour windows and hold the wheel when they’d prefer to pull off the road, trucker advocates argue.\n“If the regulations are so strict that a driver can’t stop and take a break or take a nap when they need to, then I don’t know how you can conclude anything other than the regulations have made highways less safe,” said Todd Spencer, executive vice president of the Owner-Operator Independent Drivers Association (OOIDA). The trade group represents 150,000 members, spanning all states.\n“A driver might prefer to take two to three hours off to relax or take a nap to avoid the nuttiness, but you can’t because (they can’t) extend that 14-hour window,” said Spencer, a former driver. “The (federal government) says this makes things better. Well, it hasn’t made things better. If anything, it’s made things far worse.”\n\"No matter what the limits on driving and work hours are, if the motor carrier and driver plan the schedule so tightly that the driver can barely complete the run legally, this problem will occur.\"\nWal-Mart driver Kevin Roper, who according to police had not slept for more than 24 hours before the accident involving Morgan, was expected to appear in court Monday on charges of vehicular homicide, assault and reckless driving in connection with the crash.\n\"With regards to news reports that suggest Mr. Roper was working for 24 hours, it is our belief that Mr. Roper was operating within the federal hours of service regulations,\" David Tovar, Wal-Mart's vice president of communications, wrote in a statement. \"The details are the subject of the ongoing investigation and we are cooperating fully with the appropriate law enforcement agencies.\"\nIf the accusations are proved, Roper exceeded the federal driving limit by more than 10 hours. One year ago, the U.S. Department of Transportation installed several rules to try to keep weary truckers off highways, including mandating a 30-minute break during the first eight hours of their shift and reducing maximum workweeks to 70 hours over eight days — including a 34-hour break once per week.\nBut federal transportation officials say if commercial drivers feel a time squeeze that induces them to skip breaks or naps, the blame rests with transportation companies that demand loads be hauled and delivered to certain places by exact times.\n“No matter what the limits on driving and work hours are, if the motor carrier and driver plan the schedule so tightly that the driver can barely complete the run legally, this problem will occur,” reads a fact sheet provided to NBC News by Marissa Padilla, director of communications for the Federal Motor Carrier Safety Administration, part of the DOT.\n“This rule also does not prevent carriers and drivers from setting their own schedules, nor does it restrict drivers from being on the road during any time of the day,” reads the fact sheet.\nAre some of America’s more than 10 million commercial truckers operating their rigs when sleepy — and is that fatigue factor injuring or killing other motorists?\nDuring 2012, there were an average of 868 big-rig crashes per day, leading to an average of 11 fatalities and 200 injury accidents each day of that year, according to DOT figures.\n“Driver fatigue is a leading factor in large truck crashes,” according to a statement emailed by Padilla. What's more, the 2006 Large Truck Crash Causation Study reported that 13 percent of Commercial Motor Vehicle drivers were considered to have been fatigued at the time of a serious crash.\nThe revised trucker-driving rules, however, will prevent approximately 1,400 crashes each year, saving 19 lives and avoiding 560 injuries, according to DOT analysis.\nStill, the American Automobile Association remains “concerned with the uptick of truck-related fatalities in the past few years,” said Patrice Vincent, an AAA spokesperson.\nAAA cites statistics from the National Highway Traffic Safety Administration that road fatalities involving large trucks increased by 4 percent between 2011 and 2012 — from 3,781 to 3,921. Of the big-rig-related deaths in 2012, 73 percent were occupants of other vehicles, 10 percent were non-occupants, and 18 percent were occupants of commercial trucks.\n“With a projected freight increase over the next five to 10 years and with roads becoming more congested, it's more important than ever that all road users, motorists and truck drivers, share the road and follow all the laws and regulations on the books,” Vincent said. “Economics cannot trump safety.”","url":"https://www.nbcnews.com/business/business-news/tracy-morgan-crash-why-are-some-long-haul-truckers-so-n126731"}
