{"authors":["Sarah Barns For Mailonline"],"date_download":"2018-10-22 23:10:31","date_modify":"2018-10-22 23:10:31","date_publish":"2016-01-28 11:51:13","description":"GRAPHIC CONTENT: Mother-of-two Tracy Kiss, 28, from Buckinghamshire, posted the intimate image to raise awareness as part of Cervical Cancer Prevention Week, which runs until Saturday.","filename":"data/vaneerConsumption/TracyKisssharesanintimatephotographofherCERVIX.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9F9F700000578-0-image-a-45_1453981422490.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420564_Former-glamour-model-shares-intimate-photograph-CERVIX_1540249831.html","title":"Tracy Kiss shares an intimate photograph of her CERVIX","title_page":"Tracy Kiss shares an intimate photograph of her CERVIX | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A former glamour model has shared a photograph of her cervix in the hope it will encourage other women to go for smear tests.\nMother-of-two Tracy Kiss, from Buckinghamshire, posted the intimate image to raise awareness as part of Cervical Cancer Prevention Week, which runs until Saturday.\nThe campaign is close to the 28-year-old's heart as last year she had to have a biopsy after a check-up discovered abnormal cells.\nScroll down for video\nA former glamour model has shared a photograph of her cervix in the hope it will encourage other women to go for smear tests\nMother-of-two Tracy Kiss, from Buckinghamshire, posted the intimate image and one of her in the hospital room to raise awareness as part of Cervical Cancer Prevention Week\nWriting candidly on her blog Tracy, who is mum to Millisent, eight, and three-year-old Gabriele, said she didn't think changes in her body was anything to worry about at first.\n'At the age of 28 I never would have thought that something like this could happen to me, I thought irregular bleeding, period cramps that linger and back ache was just a sign of getting old and having children but it’s not,' she said.\n'You know in yourself when something isn’t right and when your body isn’t behaving as normal. A quick smear test could save your life and I’m incredibly thankful that I had mine.'\nAfter having a smear test she wast sent from a biopsy. The procedure graded the cells as CIN2, which is usually caused by certain types of human papillomavirus (HPV). Although they are not cancerous they can become so and spread if not treated.\nWriting candidly on her blog Tracy, who is mum to Millisent, eight, and three-year-old Gabriele, said when she was given the news she feared the worst\nThe campaign is close to the 28-year-old's heart as last year she had to have a biopsy after a check-up discovered abnormal cells\nTracy is having the abnormal cells removed in hospital on January 3.\n'HPV is a common virus found in most women at one point in their life which can come and go and doesn't require treatment,' she told FEMAIL.\n'However if the body doesn't expel the virus (just like cold and flu) it can cause abnormal cell growth in the cervix which is why girls are now being vaccinated for it at school. I never had the injection as it was after my school days.'\nShe added: 'I have abnormal cells and HPV present which may have caused these pre-cancerous changes in my body that the NHS aims to remove to prevent the development of cervical cancer.'\nTracy said she feels 'in safe hands with the NHS' and is pleased with the treatment she has received so far.\nShe's keen to dispel the myth that smear tests are scary - and says the consequences of not having one could be much worse.\n'On my blog I like to talk about things other people won't and I am urging women to go for a smear test – it would be amazing if this advice saved somebody,' she said.\nTracy is having the abnormal cells removed in hospital on January 3. 'HPV is a common virus found in most women at one point in their life which can come and go and doesn't require treatment,' she told FEMAIL\nTracy said she feels 'in safe hands with the NHS' and is pleased with the treatment she has received so far\n'It is a bit uncomfortable and embarrassing but these feelings won't bring you back from the dead.'\nTracy believes her cervix photo - taken during the biopsy - is the first of its kind ever to be posted on social media.\nRecalling having it done, she wrote on her website: 'With a TV monitor on the side I was able to watch exactly what the examiner could see from deep inside of me as he inserted a speculum before aligning the microscope to point at my cervix and abnormal cells on screen which was absolutely fascinating to see.'\nTracy has also taken a lipstick-smeared selfie to support Jo's Cervical Cancer Trust and its #smearforsmear campaign.\nThe online blogger, who has more than 150,000 followers, hit the news last year when she posted a beauty video promoting the benefits of sperm as a facial treatment.","url":"https://www.dailymail.co.uk/femail/article-3420564/Former-glamour-model-shares-intimate-photograph-CERVIX.html"}
