{"authors":[],"date_download":"2018-10-30 00:53:19","date_modify":"2018-10-30 00:53:19","date_publish":"2018-06-20 00:05:39","description":null,"filename":"data/vaneerConsumption/TraditionalLiberalismUnderUnprecedentedPressure.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/06/1024px-Angela_Merkel_and_Vladimir_Putin_2018-05-18_04.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860799.html","title":"Traditional Liberalism Under Unprecedented Pressure","title_page":"Traditional Liberalism Under Unprecedented PressureThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"For most political analysts, the liberal democratic malaise, so often discussed, is a byproduct of the liberal world order’s success. While it is easy to observe the evolution of events in the post-Cold War period as a sign of collapse, that, in my judgment, would be a mistake.\nRecent challenges should certainly not be underestimated, although they seem as a setback to the Fukuyama “end of history position.” In the sweep of history, the new nationalism and the politics attached to it are seemingly not so perilous to a world order that survived the Great Depression, the Axis powers, and the international communist movement.\nAlthough this may not be immediately recognized by President Trump, the solutions or anodyne for contemporary problems lies within the liberal order. Because of the protean nature of liberalism, a vision of interdependence emerges that has managed to mitigate tumultuous change. Even President Trump’s tariff ideas will not undermine the system as much as stimulate adjustments within it.\nOf course, it is conceivable that the emerging challenges are of a very different nature, exposing liberalism to shocks it has not experienced heretofore. The Five Star Movement in Italy could lead to an Italian withdrawal from the EU and a continental financial collapse; Brexit could have consequences not yet revealed; Germany may at some point resist the idea of paying Europe’s bills; Russia’s meddling in the EU and NATO is designed to reduce U.S. influence; the immigration and integration issue have forced governments to impose higher taxes; U.S. nationalist fervor seems to be moving the nation in an isolationist direction; the Chinese vision of a trade belt throughout EuroAsia could topple the EU structure.\nAre these factors in combination a threat to the liberal order more noteworthy than historical challenges of the past? Because they are different from those in the 1930s and beyond, it is difficult to say how they will unfold and how liberalism’s structure will respond to them. As free markets spread, economic inequality grew leading to a breakdown between capital and labor. The benefits of globalization were distributed disproportionately to elites. Economists like Thomas Piketty exaggerate economic inequality to make their point, but the public embrace of this position seems to suggest a political order searching for new and perhaps extreme solutions.\nLiberalism has enshrined the idea of tolerance, which had been widely and reflexively embraced. But the excessive behavior of Europe’s new immigrants and the growing anger toward terrorism seem to usher in inconsolate hard-core resentment. In fact, it is not clear liberalism can accommodate the rising tide of resentment as the emergence of radical political parties in Europe would suggest.\nLiberalism is also committed to individual freedom. But suppose the burdens of freedom have become so great that individuals would prefer to rely on government for the knotty decisions in their life rather than personal resources. Moreover, this shift to a reliance on government has also accelerated a trend to identity politics; from a belief in the power of an American ideology that contains liberty and individual conscience to group or identity politics that emphasizes the interests of race, gender, or class. Can liberalism cope with this degree of fragmentation, a transformation of democracy into an engine of zero-sum political tribalism?\nIt was the unifying ideology of the past that gave the U.S. its standing in the world. Can the U.S. provide leadership with an atomized population estranged from government yet increasingly reliant on it? Variants of intolerant tribal populations are erupting across Europe threatening any supranational entity. My guess is the EU will be a dead letter in a decade.\nHow then can the liberal world order that may possess answers to the affliction of difficult problems be reconciled with the new order of issues unprecedented on the global stage? This competition that is unfolding doesn’t have facile answers. However, an understanding of the competition is critical in appreciating where the West is headed and, of course, the leadership the United States can provide.","url":"https://spectator.org/traditional-liberalism-under-unprecedented-pressure/"}
