{"authors":["Will Martin"],"date_download":"2018-10-31 00:25:46","date_modify":"2018-10-31 00:25:46","date_publish":"2018-07-10 00:00:00","description":"Switzerland becomes the eighth nation to challenge Trump's steel tariffs. The mountainous central European nation has filed a formal complaint with the World Trade Organisation.","filename":"data/vaneerConsumption/TradewarSwitzerlandchallengesTrumpsunjustifiedtariffs.json","image_url":"https://amp.businessinsider.com/images/5651bb90c281449f018b4898-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trump-trade-war-switzerland-challenge-unjustified-tariffs-2018-7_1540945546.html","title":"Trade war: Switzerland challenges Trump's 'unjustified' tariffs","title_page":"    Trade war: Switzerland challenges Trump's 'unjustified' tariffs - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A Swiss soccer fan cheers during the World Cup group H soccer match between Spain and Switzerland at the stadium in Durban, South Africa, Wednesday, June 16, 2010. AP Photo/Schalk van Zuydam\nSwitzerland has become the eighth country to challenge Donald Trump's recently introduced tariffs.\nThe Swiss government formally filed a complaint with the World Trade Organisation, the global arbiter of trade, against the US on Tuesday.\nThe Swiss complaint is against tariffs the US placed on steel. Switzerland exported steel and aluminium products worth around 80 million Swiss francs ($80 million) to the USA last year, its government said in a statement.\n\"Switzerland first intervened with the US in March and also submitted a formal request to the US Administration for a country-specific exemption from these import duties,\" the government said, adding that the US has not responded to this request.\nSwitzerland joins a growing list of countries to challenge the tariffs, including the EU, Russia, China, India, Canada, Mexico and Norway.\nSwitzerland's complaint is on the same grounds as other complaints, namely that the Trump administration's justification for the tariffs — national security — is not fair or true.\n\"From Switzerland's point of view, the additional duties, which according to the US have been introduced to protect national security, are unjustified,\" a statement from the Swiss Federal Council said.\nThe WTO is the body meant to settle international trade disputes using a rules-based system, theoretically ending unfair trade practices and tamping down the threat of trade wars. The organization grew out of the General Agreement on Tariffs and Trade and was officially founded in 1995.\nIt is rumoured that Trump wants to pull the US out of the organisation. Reports in June suggested that Trump had repeatedly asked his advisers about pulling the US out of the WTO and complained that the rest of the world used the organization to \"screw the United States.\"\nSenior officials in the Trump administration denied those reports.","url":"https://www.businessinsider.com/trump-trade-war-switzerland-challenge-unjustified-tariffs-2018-7"}
