{"authors":["Emma Lord"],"date_download":"2018-10-31 01:43:25","date_modify":"2018-10-31 01:43:25","date_publish":"2018-09-14 15:28:06","description":"Trader Joe's is really having a Week, y'all. First the chain dropped all of its pumpkin spice goods for 2018, breaking the brains of fall stans everywhere. Then they basically reinvented pancakes with the Vermont Ghosted Maple Syrup that's been…","filename":"data/vaneerConsumption/TraderJoesCarrotCakeSpreadJustHitShelvesTheTasteIsSuperUnique.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/ea814ef3-0bdd-4a60-839e-72f8d8a62d78-tjsc.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_trader-joes-carrot-cake-spread-just-hit-shelves-the-taste-is-super-unique-11913490_1540950205.html","title":"Trader Joe's Carrot Cake Spread Just Hit Shelves & The Taste Is Super Unique","title_page":"Trader Joe's Carrot Cake Spread Just Hit Shelves & The Taste Is Super Unique","title_rss":"NULL","source_domain":"bustle.com","text":"Trader Joe's is really having a Week, y'all. First the chain dropped all of its pumpkin spice goods for 2018, breaking the brains of fall stans everywhere. Then they basically reinvented pancakes with the Vermont Ghosted Maple Syrup that's been popping up all over Instagram. But of all of Trader Joe's triumphs this week, none, perhaps, are quite as controversial as the Trader Joe's Carrot Cake Spread that was recently shared by Instagram account @junkbanter.\nTo be fair, carrot cake itself is often a controversial topic — some humans don't believe in the union of vegetables and cake. They're wrong, but considering that means more carrot cake for the rest of us, I'm more than happy to let them stew in that wrongness. That being said, even carrot cake devotees might be a little bit wary of this new ~spread~ coming out of TJ's, only because it seems to be very difficult to define. Is it a butter? Is it a jelly? Is there actual cake inside of it, or are we all about to open a jar up to disappointment?\nHere at Bustle we got our hands on a jar of our own, because, intrepid dessert reporter that I am, I had to experience this for myself. And while I am a self-professed human garbage disposal who enjoys 99 percent of anything with sugar in it, I ... well. I did not love this. It is somehow, weirdly, too sweet and too bitter at the same time. In actual carrot cake, you don't get the full \"crunch\" of the carrot, but in this, you decidedly do. While the texture might be nice for some, for me my whole body was like \"NO, A VEGETABLE! DO NOT WANT!\", and it kind of shut down the whole experience for me. That, and the aftertaste is really sharp.\nEmma Lord/Bustle\nThat being said, I think this might appeal to some people who don't have the palate of the average five-year-old (aka me). In fact, @junkbanter wrote in their caption, \"This spread is more like a jam or marmalade; I would have LOVED a Carrot Cake Cookie Butter. I’ll follow up when I follow up; plan is to try this on a graham cracker with some cream cheese and see how that does. The label suggests scones, toast, muffins, cake, pork tenderloin, or a spoon.\"\n(Also worth noting — in their post @junkbanter mentions a discontinued Pumpkin Pie Spice Cookie Butter, which is a thing I did not know about, and just launched all kinds of darkness in my pumpkin-loving heart.)\nIf you're curious what else is in it, the ingredient list also mentions apple juice, crushed pineapple, golden raisins, orange peel, and molasses, which objectively sound great mixed together, but just didn't do it for me. If you can get past the crunch and the unexpected sharpness of it, though, it does seem like something that would pair well on a cheese plate, or with meats; as for pairing this with a dessert, I think the sweetness might be a little overpowering (and that's really saying something, coming from someone as sugar-prone as I am).\nThis spread is currently available at Trader Joe's, where it retailed for $2.99 in the New York City location where I picked it up — definitely worth a try, if you're looking for a cheap foodie adventure this week.","url":"https://www.bustle.com/p/trader-joes-carrot-cake-spread-just-hit-shelves-the-taste-is-super-unique-11913490"}
