{"authors":["Michael Cunningham"],"date_download":"2018-10-30 19:24:55","date_modify":"2018-10-30 19:24:55","date_publish":"2018-07-04 18:53:00","description":"It can be difficult to evaluate NBA summer-league games because they are like real NBA games only su...","filename":"data/vaneerConsumption/TraeYoungisntmakingshotsbuthesmakinggoodplays.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/USAT_Sports/2018/07/02/Images/111181606_ap_hawks_grizzlies_basketball.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-hawks_hawks-ro_1eaab401f23dd70fb35d7e1732d2a4a3__1540927495.html","title":"Trae Young isn’t making shots, but he’s making good plays","title_page":"Trae Young isn’t making shots, but he’s making good plays","title_rss":"NULL","source_domain":"ajc.com","text":"It can be difficult to evaluate NBA summer-league games because they are like real NBA games only superficially. But shooting is shooting, and Trae Young has shot poorly from the field in his first two games.\nSome of the reaction to Young’s subpar shooting was predictably over-the-top. Young’s high profile, and the bold trade made by general manager Travis Schlenk to acquire him, makes Young a prime target for premature told-you-so’s.\nBut, again, shooting is shooting, and Young has missed a lot more than he’s made: 9-for-28 from the field, including 2-for-15 on 3-pointers. Summer-league games don’t count, but all those missed shots are real, and some of them have been ugly.\nStill, there can more than meets the box score in basketball, and that’s especially true at summer league. My view is that Young’s poor shooting is no real cause for concern, and it carries much less weight than his playmaking, which has been very good in the context of summer-league play.\nDon’t be fooled by Young’s modest six assists over 56 minutes. He would have a lot more assists if he were on the court with a full lineup of bona fide NBA players. A coach for another team at summer league who analyzed Young’s debut on video counted at least six high-level plays he made as a passer in that game.\nHawks coaches do their own charting, of course, and they also see that the box scores don’t necessarily reflect how Young is playing.\n“We are not going to look at the stat sheet and say he played good or bad,” Hawks coach Lloyd Pierce said. “It’s a matter of, is he playing the right way, is he doing what we are looking for and is he facilitating and getting his teammates involved.”\nI’d say Young has done well with those things, and that he was noticeably better at them in his second game. It’s a good sign for Young that he adjusted to defensive pressure and still made passes that resulted in high-percentage chances for his teammates.\n“Definitely, from the last game you can see the growth, the feel of the game, making the right plays and finishing at the rim,” Hawks guard Tyler Dorsey said after the second game. “I think as a team we just couldn’t make any shots.”\nThe missed shots by Young and his teammates are exacerbated by the nature of summer-league games. There’s been less space for Young to operate because the floor isn’t spread by 3-point shooting, and the sometimes-comically physical play in Utah has made matters worse for him especially.\nTeams don’t reach the penalty in summer-league games until they commit 10 fouls in a 10-minute period (or two in the final minute). Players don’t foul out until they’ve committed 10 fouls. These rules incentivize physical play, and after sitting courtside, I can tell you that game officials also let lots of fouls go that they wouldn’t if the games were official.\nYoung is small by NBA standards, and his summer-league opponents have been free to clutch, grab and bump him when he tries to drive to the basket with no fear of fouling out or costing their team.\n“It’s a lot more physical,” Young said after Tuesday’s game. “It’s different, but that’s how you want it. You want it to be competitive. This is all a learning experience. This is just my second game.”\nThat’s not to say that Young doesn’t need to get stronger. NBA games are not as physical as summer contests, but they can be rugged around the rim. Finishing through contact at the basket is an essential skill for the best point guards, and Young will struggle to do that if he doesn’t add more muscle.\nBut we already knew that about Young, so summer league has been no revelation in that regard. We also knew that he can be a streaky shooter. Young was a so-so finisher at the rim in college and he’s been the same in Utah (though he was much better in the second half of Tuesday’s game).\nWhat’s more significant is that, even while playing in disjointed summer league alongside non-roster teammates, Young has been a good playmaker. He’s shown the court vision and passing ability that impressed me so much when I went to watch him play at Oklahoma.\nI think Young will look much better once he’s playing alongside his NBA teammates in real NBA games. More of his sharp passes will turn into points, better shooting will create more space and then everyone will forget how bad he looked in his first summer-league game.","url":"https://www.ajc.com/blog/atlanta-hawks/hawks-rookie-trae-young-isn-making-shots-but-making-plays/XzrYyphppRBSdiRDW76CCL/"}
