{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 20:43:44","date_modify":"2018-10-30 20:43:44","date_publish":"2015-05-15 16:27:59","description":"The remains of a U.S. UH-1Y Huey helicopter that recently went missing with six U.S. Marines and two Nepali nationals on board has been found, and there appear to be no survivors of the crash, Pentagon officials stated on Friday.","filename":"data/vaneerConsumption/Tragedy6USMarinesBelievedKilledAfterNepalHelicopterCrash.json","image_url":"https://media.breitbart.com/media/2015/05/UH-1Y-Huey-helicopter-Nepal-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_15__1540932224.html","title":"Tragedy: 6 US Marines Believed Killed After Nepal Helicopter Crash","title_page":"Tragedy: 6 US Marines Believed Killed After Nepal Helicopter Crash | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The remains of a U.S. UH-1Y Huey helicopter that recently went missing with six U.S. Marines and two Nepali nationals on board has been found, and there appear to be no survivors of the crash, Pentagon officials stated on Friday.\nU.S. Marine Lt. General John Wissler, who is the commanding general in Nepal, said that “it is unlikely there are any survivors at this time,” CNN reports. The helicopter lost communications with ground control at some point Tuesday evening. It was tasked with delivering humanitarian assistance as part of a U.S. mission to aid survivors of a series of deadly earthquakes.\nGeneral Wissler added that the U.S. has not yet confirmed a report from the Nepal government that three deceased bodies have been found near the crash site. According to Nepal Defense Secretary Ishwori Paudyal, three bodies were found near the burned helicopter wreckage.\nThe crew on board had been tasked with providing aid to survivors of two deadly earthquakes, both of which have occurred within the last three weeks. The combined death toll of the quakes is now over 8,500 people, officials said. The first earthquake, which hit Nepal on April 25 with a magnitude of 7.8, resulted in the deaths of some 8,460 people, with thousands more injured. The latest, a magnitude 7.3 quake, which occurred on Tuesday, has taken over 117 lives.\nThe U.S. spokesman said that the crash could have been due to the harsh navigating conditions in the area. He said that the U.S. Marines’ mission to aid victims of the deadly quake would continue until they had completed their objective.\nNepalese Brigadier General Binoj Basnet said that the wreckage was found at an altitude of 11,200 feet, 8 miles north of Charikot, which is located about 50 miles east of Kathmandu, the country’s capital city.\nAs of Friday, there are about 300 American personnel on the ground to assist in providing earthquake relief.","url":"https://www.breitbart.com/national-security/2015/05/15/tragedy-6-us-marines-believed-killed-after-nepal-helicopter-crash/"}
