{"authors":["John Hayward"],"date_download":"2018-10-30 17:54:57","date_modify":"2018-10-30 17:54:57","date_publish":"2015-08-25 04:29:31","description":"Defeated train jihadi Ayoub el-Khazzani has been claiming he wasn't embarking on a murder spree at all.","filename":"data/vaneerConsumption/TrainJihadiLaughsatLinkstoTerrorismClaimsHeFoundWeapons.json","image_url":"https://media.breitbart.com/media/2015/08/terrorist-detained-on-train-in-france-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_08_24__1540922097.html","title":"Train Jihadi Laughs at Links to Terrorism, Claims He Found Weapons","title_page":"Train Jihadi Laughs at Links to Terrorism, Claims He Found Weapons | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Defeated railway jihadi Ayoub el-Khazzani has been claiming he wasn’t embarking on a murder spree at all, when he emerged from the bathroom of a high-speed train in France with an arsenal of weapons and 300 rounds of ammunition, only to be tackled and beaten senseless by heroic passengers.\nInstead, Khazzani claims he merely intended to rob the passengers without hurting anyone, using a stash of guns he discovered in an abandoned suitcase in a public park. Investigators, however, are uncovering more links between the lone-wolf gunman and organized terror, suggesting he followed a course used by many other ISIS recruits.\nKhazzani didn’t get on the radar screen of international anti-terrorist authorities by tripping over a bag full of guns in Brussels. The Germans gave French authorities a heads-up when Khazzani flew from Berlin to Istanbul in May, “following a path that has been used hundreds of times by Islamist militants seeking to join the Islamic State,” as McClatchy News puts it. ISIS recruits often fly into Turkey and then cross the border to Syria to link up with Islamic State forces.\n“Little is known about the trip, which authorities said lasted 16 days. But the fact that police in three countries were tracking El-Khazzani prior to Friday’s train attack makes the Turkey excursion even more suspicious,” McClatchy continues. “A Moroccan national, El-Khazzani had lived in Spain, France and Belgium, according to reports.”\nSpanish police think Khazzani spent time in Syria between 2014 and 2015, where he “possibly participated in the activities of the Islamic State,” according to a German paper quoted by McClatchy. The city in Spain where he lived, Algeciras, is a hotbed of jihad activity, and his mother is described as attending “what is considered the most radical mosque in the city.”\nSpain warned France about him when he moved from Spain to France in 2014, prompting the French to put him on a fairly exclusive list of people with suspected terror connections—right alongside the Charlie Hebdo shooters.\nThat’s an impressively cosmopolitan lifestyle for a 26-year-old man who claims to be broke and homeless, and whose father is said to be squatting in a “rubbish-strewn flat on the fifth floor of a dilapidated eleventh-floor tower black in the rundown Algeciras neighbourhood of El Saladillo” by the UK Daily Mail.\nMohamed Khazzani, the 64-year-old father of six children, said he was in “shock” over the allegations against his son, describing him as a “good boy” who would “never want to kill anyone.”\nHe railed against the insufficient generosity of Spain toward its immigrant population, claiming that young Ayoub moved to France because he couldn’t find work in Spain. “You should ask them why they’re doing that to young people, selling them empty promises and then dumping them on the street,” he cried. “My son a terrorist? The only terrorism he is guilty of is terrorism for bread because he hasn’t got enough money to feed himself properly.”\nAs for Mrs. Khazzani, she hasn’t gotten the bad news about Ayoub yet, because she’s currently in Morocco “visiting relatives, and won’t be back until later this week,” according to her husband. There’s always money in this family for travel, it would seem.\nAccording to members of the mosque where Ayoub el-Khazzani used to pray on occasion, he also had money for partying at nighclubs and popping pills. The Daily Mail reports he was arrested at least once in Spain for drug-related offenses. Other members of the mosque professed great surprise that Khazzani could have become radicalized, along with anger that actions such as his were making life more difficult for law-abiding Muslims in the Western world.\nAccording to lawyer Sophie David, Khazzani literally laughed off suggestions that he was involved in a terrorist attack. She claimed he was “very sick, somebody very weakened physically, as if he suffered from malnutrition, very, very thin and very haggard.”\nAnother lawyer, unnamed in the Daily Mail piece, related Khazzani’s story of finding “this Kalashnikov automatic rifle, his Luger pistol and a mobile phone in a suitcase, which had been left in a park close to the Brussels railway station in Belgium where he slept rough.” (In other words, sleeping on park benches, which the lawyer said his client had been doing “since his identity papers were stolen.”)\nNaturally, some Europeans are concerned that a man who was on the anti-terrorist radar screen of four different nations—Spain, France, Germany, and Belgium—could pop up on a crowded train with an arsenal of murder weapons, subdued only by the heroics of a trans-Atlantic alliance of American, British, and French passengers, who appear to have gotten very lucky, because Khazzani’s rifle reportedly jammed during the scuffle.\nNBC News reports the Belgians are taking no further chances, with chief prosecutor Eric Van Sypt saying a judicial investigation has been initiated because Khazzani boarded the train in his country. He also said the authorities were looking into the possibility of accomplices or a “wider framework” of terrorist sponsorship.","url":"https://www.breitbart.com/national-security/2015/08/24/train-jihadi-laughs-at-links-to-terrorism-claims-he-found-weapons/"}
