{"authors":["Zoe Szathmary For Dailymail.Com"],"date_download":"2018-10-22 23:14:10","date_modify":"2018-10-22 23:14:10","date_publish":"2017-03-16 06:12:43","description":"While arriving in Rhinecliff, New York, the train drove into snow on the ground. Dramatic video shows snow flying everywhere and hitting people on the platform in the Wednesday incident.","filename":"data/vaneerConsumption/TrainpullsintoNewYorkstationsendingsnowEVERYWHERE.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E51E82000000578-0-image-a-136_1489643683030.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318908_Train-pulls-New-York-station-sending-snow-EVERYWHERE_1540250050.html","title":"Train pulls into New York station sending snow EVERYWHERE","title_page":"Train pulls into New York station sending snow EVERYWHERE | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An Amtrak train made a dramatic entrance when it pulled into a station this week.\nWhile arriving in Rhinecliff, New York, the train drove into thick snow on the ground.\nDramatic video shows snow flying everywhere and hitting people on the platform in the Wednesday incident.\nThe slow-motion clip of the train's arrival was posted to YouTube by user Nick Colvin.\nHere it comes: An Amtrak train is seen driving into snow, sending it flying on Wednesday\nLook out! A thick cloud of snow appears to form during the train's arrival\nHe wrote: 'Train moving faster than usual plus fresh snow from Stella resulted in a more spectacular arrival than expected.'\nAnother video of the incident was posted to Facebook by Craig Oleszewski.\nHis video was captioned: 'First train into Rhinecliff since the storm.'\nIn the video's comments section, Oleszewski said: 'I wish I hadn't panned on the engine, should have stayed on the unsuspecting crowd of passengers, most of whom boarded after me and were covered in snow like little frosty ice-men.'\nWhoa: The snow is seen hitting commuters at the platform in Rhinecliff, New York\nThe dramatic video shows snow flying everywhere and hitting people on the platform in the Wednesday incident\nSeveral people were knocked down to the ground, one person told NBC New York.\nThe train seemingly traveled at a normal speed so as to clear the snowfall, Gus Ubaldi, a railroad expert, told the local news station.\nForecasters had predicted storm Stella would dump up to 2 feet of snow in New York City, but instead the Big Apple was hit with sleet and a few inches of snow.\nOfficials warned 50 million people on Monday to prepare for the would-be crippling effects of a blizzard that was supposed to hit the Northeast region of the country Tuesday with up to 24 inches of snow and 60mph winds.\nA state of emergency was even declared in New York, New Jersey, Connecticut and Maryland, as many flocked to prepare for what was thought to be the worst storm of the winter season.\nHelp: Despite being a milder storm than anticipated, Stella still dumped at least seven inches of snow in some parts of New York City on Tuesday. Above men work together to push a cab stuck in the snow in the city on Tuesday\nA worker clears snow in Times Square Tuesday morning as snow continues to fall during the winter storm\nBut Tuesday morning around 9am, forecasters downgraded their predictions of New York City receiving up to 2 feet of snow and canceled the blizzard warning, and instead now predict that the Big Apple will only receive 4 to 8 inches of snow.\nThe storm tracked a little farther west than forecasters originally anticipated, resulting in a sloppy mix of snow and sleet for larger portions of Pennsylvania and New Jersey.\nIn New York, there was 24 inches of snowfall in Norwich, 13 inches in Albany and 7.2 inches in Central Park on Tuesday.\nThe snow storm began hitting the Tri-State area early Tuesday morning causing thousands of flights to be cancelled. Above the 'Charging Bull' statue and the recently added statue of the Fearless Girl are covered in light snow in New York's Financial District on Tuesday\nAbout three inches of snow was estimated to have fallen on New York overnight and pictures show how the usually packed Times Square in Manhattan was virtually empty apart from a few emergency crews clearing snow\nSnow plows were working overtime in a bid to clear the streets of snow before rush hour Tuesday morning. This was the scene in Times Square early on Tuesday morning\nAs millions woke up to the storm Tuesday morning, attorney generals in New York and Pennsylvania issued a warning about price-gouging amid panic buying.\nEric Schneiderman in New York said consumers should contact his office about 'excessive increases' in the price of goods and services. Examples include food, water, gas, generators, hotels and transportation.\nThe price-gouging law also could apply to snow removal and equipment, salt and contractor services for storm-related damage.\nPennsylvania Attorney General Josh Shapiro also alerted consumers and businesses about potential scams, urging people to report any 'suspicious activity' about home repairs, snow plowing, government assistance programs and fraudulent disaster-related fundraising to his office's Bureau of Consumer Protection.\nMajority of flights were canceled at Boston's Logan International Airport on Tuesday as the nor'easter Stella crippled the country's air travel","url":"https://www.dailymail.co.uk/news/article-4318908/Train-pulls-New-York-station-sending-snow-EVERYWHERE.html"}
