{"authors":["Mark Duell For Mailonline"],"date_download":"2018-10-23 02:12:04","date_modify":"2018-10-23 02:12:04","date_publish":"2017-03-16 12:35:08","description":"Eric Austin, 46, who kept his smart outfit in his rucksack, tried to fool waiters in Oxford with a posh accent before running off to avoid settling the bill - but has now been jailed for six weeks.","filename":"data/vaneerConsumption/Trampwholeavesrestaurantswithoutpayingisjailed.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E54211800000578-0-image-a-107_1489667684357.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319860_Tramp-leaves-restaurants-without-paying-jailed_1540260724.html","title":"Tramp who leaves restaurants without paying is jailed","title_page":"Tramp who leaves restaurants without paying is jailed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Conman: Homeless drifter Eric Austin tried to fool waiters in Oxford with a posh accent before running off to avoid settling the bill\nA tramp known for a 'Mister Posh' scam where he donned a Savile Row suit to dine at upmarket restaurants but left without paying has been jailed again.\nEric Austin, who kept his smart outfit in his rucksack, tried to fool waiters in Oxford with a posh accent before running off to avoid settling the bill.\nThe 46-year-old homeless drifter was so well known for his scams that Thames Valley Police had put up posters bearing his photo to warn restaurants about him.\nHe had previously received a criminal behaviour order, but appeared at Oxford Magistrates' Court after breaching this and obtaining services dishonestly.\nAustin was jailed for six weeks and banned from entering any business with a food or drink service where payment is taken in the city for two years.\nThe conman was also given a two-year extension on his existing criminal behaviour order which had been imposed for 15 previous similar offences.\nPC Mike Ellis from the force said: 'He is an incorrigible offender and the court rightly identified that the public need to be protected from this type of behaviour.'\nIn February 2015 he walked out of the Quod Brasserie (pictured) in Oxford after eating a meal and drinking wine worth £108\nIn October 2015 he tucked into a £139.50 dinner at Oxford's upmarket Malmaison restaurant\nIn Austin's latest con, he racked up an £81.35 bill at Chinese restaurant My Sichuan in the university city last Friday before leaving without paying.\nIn February last year he conned the All Bar One restaurant into giving him a meal and leaving without paying.\nHe had not long been released after being jailed for 12 weeks the previous October for flouting a ban on entering restaurants in Oxford until 2017.\nThe October 2015 offence saw him tuck into a £139.50 dinner at the upmarket Malmaison restaurant.\nStaff had no suspicions when the 'well-presented gentleman' came in and ordered several drinks at the bar before sitting down to a starter and a main course.\nAustin finally left at 0.15am without paying a penny, prompting restaurant staff to call the police. He was arrested just 15 minutes later.\nIn 2015 he ate £81 worth of food and drink at the Old Parsonage Hotel and left without paying\nPC Ellis and his team have previously handed out posters with Austin's picture to 200 city restaurants warning them not to be fooled by the conman.\nAustin's £653 bill at 7 restaurants which he left without paying My Sichuan: £81.35 Malmaison: £139.50 Quod Brasserie: £108 Marco's New York Italian: £67 Old Parsonage Hotel: £81 Rose Tree Chinese: £74.45 River Hotel: £84\nOfficers say he dresses and conducts himself in a manner that does not look out of place in high-end eateries.\nHe is neatly shaved, with a smartly-cut suit or sports jacket and cavalry twills, complete with a Savile Row-style shirt and tie, and polished shoes.\nAustin is known to walk through the door and greet waiters with a dazzling smile and a firm handshake as they guide him to the best table in the restaurant.\nBut in February 2015 he walked out of the Quod Brasserie in the city after eating a meal and drinking wine worth £108.\nThe next day he went to Marco's New York Italian and ran up a £67 bill before trying to pay with a card which had no money on it.\n'He dresses smartly so he looks the part - he always wears a smart shirt, jacket and trousers and sometimes a tie, and he always shaves.' said PC Ellis.\nIn May 2015, Austin stayed the night at the River Hotel in Oxford and did not pay the £84 bill\n'He picks posh restaurants and often spends between £100 and £200 at a time. He gets out of there without paying or uses a Post Office card which has no money on it.\nHe always wears a smart shirt, jacket and trousers and sometimes a tie, and he always shaves PC Mike Ellis, Thames Valley Police\n'It is Austin's habit to go to establishments serving expensive food with a quality wine list and order a meal with several bottles of wine... but he never has the wherewithal to pay.'\nIn June 2015 he ate £81 worth of food and drink at the Old Parsonage Hotel and left without paying.\nFour days later he spent a pleasant evening at the Rose Tree Chinese restaurant and left behind an unpaid bill for £74.45.\nIn May 2015 he stayed the night at the River Hotel and did not pay the £84 bill.\nAustin went to Marco's New York Italian in Oxford and ran up a £67 bill before trying to pay with a card which had no money on it\nPC Ellis said: 'In some of our independent restaurants, £100 or £150 can be the difference between a profitable night or not, which could cause restaurant owners significant distress.'\nIn 2015 Peter Watt, general manager of Marco's, said 'I don't think it's acceptable, I don't think people should do it, but if people need help they should go and get help.'\nWhen Austin was handed his 24-week suspended sentence in June 2015, his solicitor Julian Richards said his client had schizophrenia and depression and had previously wanted to be sent back to prison because he had run out of money.\n'This is someone who feels he is unable to help himself and he knows prison is somewhere he can get help and get a roof over his head,' he said at the time.","url":"https://www.dailymail.co.uk/news/article-4319860/Tramp-leaves-restaurants-without-paying-jailed.html"}
