{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:18:24","date_modify":"2018-10-30 21:18:24","date_publish":"2015-09-17 18:04:11","description":"Transgender People Rip 'I Am Cait' Reality Show: 'She Wasn't Elected by the Trans Community'","filename":"data/vaneerConsumption/TransgenderCommunityRipsIAmCaitJennerRealityShow.json","image_url":"https://media.breitbart.com/media/2015/07/Bruce-Jenner-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_09_17__1540934304.html","title":"Transgender Community Rips 'I Am Cait' Jenner Reality Show","title_page":"Transgender Community Rips 'I Am Cait' Jenner Reality Show","title_rss":"NULL","source_domain":"breitbart.com","text":"As the first season of E! network’s I Am Cait reality television show came to an end last weekend, many in the transgender community have blasted both the show and its star, Bruce “Caitlyn” Jenner, for failing to represent the struggles that ordinary trans people face on a daily basis.\nExpectations ran high among the trans community when E! announced that Jenner would document his transition into a woman with an eight-part docu-series in the vein of his family’s television show, Keeping up with the Kardashians.\nBut those hopes were apparently dashed after the community got a chance to see how Jenner lives, as the famous and wealthy head of one of America’s most well-documented families.\n“There is some tension coming from the [trans] community about it,” Trans Oral History Project founder Andre Perez told the Wrap of the series. “Caitlyn Jenner is put on this pedestal… to become the authoritative voice on trans issues and that happened overnight. It wasn’t anything that she did to particularly earn that title. She wasn’t elected by the trans community.”\nThe Wrap reported that “Perez’s comments were echoed by many in the transgender community” who spoke with the outlet.\n“[The show] doesn’t really mirror or reflect the struggles or the reality for women of color,” Jennicet Gutierrez, the trans woman who interrupted President Obama’s speech at an LGBT pride event in June, told the Wrap. “It doesn’t reflect the experience of transgender women in general.”\nStill, some defended the show and its star, including Perez, who told the Wrap that seeing a transgender woman as “part of a community” was a positive development for the community at large.\n“In the past we’ve almost always seen trans people as these isolated individuals,” Perez said. “We see them outside of communities. We see them as struggling with their own bodies. And so the idea we are seeing a trans person who is part of an entire community that is diverse and where people have different opinions and experiences, that’s huge.”\nScott Tuner Schofield, the Bold and the Beautiful actor who became the first transgender actor in daytime television earlier this year, told the Wrap that the transgender community should not disregard the show just because Jenner is wealthy.\n“I think Caitlyn really put herself out there in a way that she did not have to for the greater good,” Schofield said. “I really take exception with the people who chuck her story because she’s rich… She got schooled on her privilege by the other people on the show. And that was a wonderful moment of learning.”\nOf course, Jenner took heat from other transgender women earlier in the season who took issue with the star’s conservative political views.\nThose offended by the show’s messages can take solace in its lukewarm ratings totals: last weekend’s season premiere pulled in an average of 1.262 million viewers in Live + Same Day ratings, a four-week high for the show but a far cry from the highly-rated premiere episode, which hit an estimated 2.7 million viewers in L+SD viewing.\nE! has not yet confirmed a second season.","url":"https://www.breitbart.com/entertainment/2015/09/17/transgender-community-rips-cait-jenner-reality-show/"}
