{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 18:48:09","date_modify":"2018-10-30 18:48:09","date_publish":"2016-06-28 03:57:27","description":"President Barack Obama's deputies have decreed that single-sex bathrooms will be eliminated in national parks because the administration is trying to make the nation's outdoors into a transgender-supportive environment. | Politics","filename":"data/vaneerConsumption/TransgenderIdeologyObamaBansSingleSexBathroomsatNationalParks.json","image_url":"https://media.breitbart.com/media/2016/06/AP_407413262260.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_27__1540925289.html","title":"Transgender Ideology: Obama Bans Single-Sex Bathrooms at National Parks","title_page":"Transgender Ideology: Obama Bans Single-Sex Bathrooms at National Parks | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Barack Obama’s deputies have decreed that single-sex bathrooms will be eliminated in national parks to help make the nation’s outdoors into a transgender-supportive environment.\nThe Department of Interior tried to put a positive spin on the new ban. “As it relates to recently passed state laws relating to the transgender community, visitors to public lands and water sites are welcome to use restrooms that best align with their gender identity,” not with their sex, the agency said in an email to the Heritage Foundation.\nProgressives are now insisting that each person’s feelings about “gender identity” is more important in law than the anatomical sex of Americans’ bodies. So they’re pushing government to undermine public support for the “gender binary” — the reality of distinct and complementary male and female sexes – and to promote the idea of fluid “gender identity,” even though cross-dressers comprise only about 1 in every 2,400 Americans.\nNational Park Service spokesman Jeremy K. Barnum insisted the Interior Department won’t discriminate against people who want to use bathrooms reserved for the other sex.\nWe welcome all visitors regardless of their race, sex, religion, national origin, sexual orientation, or gender identity to visit public lands and waters in their back yard and beyond. … We remain committed to appropriately representing our nation’s diversity on our public lands, and continue to work alongside local communities and leaders to find meaningful ways to preserve and tell the stories that reflect the narrative of all Americans.\nBarnum also said that the policy “is not new” and that visitors to America’s federally-operated parks and museums could always choose whatever bathroom they feel like using.\nThe administration’s gender-over-sex, binary-hating, anti-sex policy mean that the national parks’ focus on nature, evolution and science must now also embrace the newly created political idea of “gender identity.”\nThe rule matches Obama’s decree in May which declares that all of the nation’s public schools must implement transgender-friendly policies, so that boys pretending to be girls, or girls pretending to be boys, must be made welcome in the other sex’s bathrooms and showers, regardless of science or the wishes of normal kids and teenagers or their parents.\nIn his May decree, Obama banned single-sex bathrooms and single-sex locker rooms, so takin sexual privacy from almost 55 million American school kids in some 100,000 K-12 public schools.\nAs soon as Obama’s Departments of Justice and Education issued the decree, though, several lawsuits were filed. One was filed by a group of Illinois parents who opposed plans of a local school to enforce Obama’s policies. Another was filed by Texas Attorney General Ken Paxton who announced on May 25 that the Lone Star State was suing the Obama administration to put an end to the administration’s plans to force every school in the country to implement a pro-transgender policy. Ten other states joined Texas in its suit.\nThe state of Kansas also began to look for ways to sue the Obama administration over the school bathroom policy.\nA recent poll showed that roughly two out of three Americans prefer that bathroom policies be set by state or local officials, not by the central government. Other polls show the public strongly opposes the removal of single-sex bathrooms for K-12 schools. A study of the 2010 census showed that only one out of every 2,400 adults have changed their names to the opposite sex.\nIn general, the transgender ideology says government should push every American to validate every person’s choice of created “gender identity,” even though a man who wants to be a woman is still a man by every known scientific measure of evolutionary life. For example, an Oregon law recently allowed a jury to award $60,00 t0 a transgender teacher because other teachers declined to use the teacher’s preferred pronoun, which is “they” rather than “him” or “her.” New York City has also establish similar forced-speech rules.\nThe ideology’s claim that the government must enforce a new right to “gender identity” also means that the governments must ignore and often dismantle many civic rules that evolved to help the two distinct sexes — men and boys, women and girls — meet their legally equal, but different and complementary, needs. For example, the transgender ideological demand means that single-sex bathrooms and locker rooms must opened up to people of the opposite sex, regardless of age, and without any verification of created “gender identity.”\nAs a result, it is now an offense in Washington State to ask a man in a woman’s bathroom if he thinks he is male or female. Similarly, Obama and gay advocacy groups have slammed a popular North Carolina law, dubbed HB2, because it requires people to undergo medical procedures before they can use a bathroom reserved for the opposite sex. Teenage boys who say they are girls are also allowed to compete against girl athletes — and bump them off the winner’s podium. Also, the White House now demands that soldiers salute, trust and fight alongside people who think they are the other sex.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com","url":"https://www.breitbart.com/politics/2016/06/27/transgender-national-parks/"}
