{"authors":["William Bigelow"],"date_download":"2018-10-30 18:46:21","date_modify":"2018-10-30 18:46:21","date_publish":"2015-10-31 01:00:37","description":"Six-year-old Devina Keswani—born male but now assuming the role of female—is starring in a new web series created for People.com.","filename":"data/vaneerConsumption/Transgender6YearOldStarsinPeoplecomWebSeries.json","image_url":"https://media.breitbart.com/media/2015/10/Dev-Devina-Keswani-transgender-child-screenshot.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_10_30__1540925181.html","title":"Transgender 6-Year-Old Stars in People.com Web Series","title_page":"Transgender 6-Year-Old Stars in People.com Web Series | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In a frightening sign of how even the youngest of children can now be exploited by gender-confused fanatics, six-year-old Devina Keswani—originally named Dev and born male but now assuming the role of female—is starring in a new web series created for People.com: The Keswanis: A Most Modern Family.\nThe prototypical 21st century American family, the Keswanis include Big Nik, the 17-year-old star on Vine who suffers from dwarfism; Sarina, 15, the shy teenager learning to pose in a bikini for beauty pageants; Anil, the father who is a doctor; and Vaishali, the mom.\nThe parents live in a world all their own—in the third episode of the series, Vaishali insists, “The day Dev could walk, the walk was feminine. The day Dev could talk, it was really feminine.”\nAnil boasts, “We had this perfect kid.” Then he adds, “But it wasn’t easy. There was something that was not clicking.”\nA kindergarten teacher set the parents straight, telling them that one of the child’s assignments indicated something might be awry. The parents then discussed the situation with their kindergarten child. According to People, “the family realized they couldn’t deny Devina’s true self any longer.”\nVaishali hardly hesitated; “It took me about 30 seconds to take that in. I just wrapped my arms around her and said ‘You will never have to be Dev again, ever.'”\nNow Devina hangs out with “peers,” such as Lily Rubenstein, a transgender 15-year-old. Rubenstein pontificated, “Family support is the number one way to ensure that your child will have a happy and healthy transition. The Keswanis are setting the example here. Because of their support, Devina has been able to live a happy and authentic life. There is nothing better than being able to do that.”\nDevina claims in the series that a transgenderphobic boy bullied Devina. The child has also joined the Girl Scouts. In the series, Devina plans to speak at school about transgenderism.\nMeanwhile, Anil attended a photoshoot for Sarina, claiming he felt uncomfortable when she was told to be “young sexy.”\nVaishali admits, “That is not your normal American family. It’s not necessarily how we envisioned our life to be, but it’s a life that’s so full and rich.”","url":"https://www.breitbart.com/the-media/2015/10/30/transgender-6-year-old-stars-people-com-web-series/"}
