{"authors":["Lucy Waterlow For Mailonline"],"date_download":"2018-10-22 21:31:15","date_modify":"2018-10-22 21:31:15","date_publish":"2016-01-28 07:52:43","description":"Michigan-born Miss Kimberly, who now lives in London, appears on the latest episode of Channel 4's Bodyshockers to reveal how she used crowdfunding to pay for her cosmetic surgery.","filename":"data/vaneerConsumption/Transgenderwomancrowdfundstopayfor3000forbreastimplants.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/18/30A3B0FC00000578-0-image-a-61_1453919690229.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3419580_Transgender-woman-crowdfunds-pay-3-000-breast-implants_1540243875.html","title":"Transgender woman crowdfunds to pay for £3,000 for breast implants","title_page":"Transgender woman crowdfunds to pay for £3,000 for breast implants | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A transgender woman has revealed how she achieved the figure she has always wanted after appealing to the public to pay for her to have a boob job.\nMichigan-born Miss Kimberly, who now lives in London, appeared on the last night's episode of Channel 4's Bodyshockers to reveal how she used crowdfunding to pay for her cosmetic surgery.\nThe cabaret performer, who was only identified on the show by her stage name, said she had an A cup thanks to hormone therapy after making the transition from being a man to a woman.\nScroll down for video\nMiss Kimberly tells presenter Katie Piper, left, that she wants to have a boob job to increase her confidence but can't afford to pay for the £3,000 op herself\nMiss Kimberly is an A cup thanks to hormone therapy but wants to boost her size to a C cup\nBut she said she wanted to enhance her cleavage further to boost her confidence and make her feel more feminine.\nHowever, as she couldn't afford to pay for the £3,000 breast augmentation herself, she decided to raise the money by asking for donations.\nShe said: 'My teenage boobs are too small and I don't have the money to have a boob job so I am getting all my friends to help pay for them.'\nMiss Kimberly raised £2,400 towards her op using crowdfunding and by hosting a 'boobathlon' night at the cabaret club where she worked.\nProceeds from ticket entry went towards her cause as well as donations made into a bucket passed around on the evening.\nExplaining why having the surgery meant so much to her, she said: 'So much of my time is spent using push up bras with chicken fillets, it is all smoke and mirrors. When I take off the bra they are small, very small.\nShe said her A cups are 'too small' so she would like to have them surgically enhanced\nThe cabaret performer, pictured taking to the stage, said she would feel more confident if she had bigger breasts as she used to have to enhance her cleavage using push up bras and chicken fillets\n'Having a boob job is going to make me feel more feminine and it is going to look better on stage.'\nShe added on why she chose to appeal for money to pay for it: 'Crowdfunding for boobs is growing in popularity. I haven't felt good about myself for a while and I would like to feel good about myself.'\nMiss Kimberly told Bodyshockers presenter Katie Piper that she wanted to increase her cup size to a C using the money she has raised.\nAcid attack survivor Katie said she understood why the cabaret performer was turning to surgery to boost her self-esteem.\n'More than most I know how important surgery can be to boost confident and crowdfunding is a new way to pay for body modifications,' she said.\nMiss Kimberly was able to go under the knife after raising enough money to pay for the op using crowdfunding\nHowever, she asked Miss Kimberly how she would respond to critics who may say she should earn the money to pay for her surgery rather than using fundraising methods.\nMiss Kimberly responded: 'If I let people like that control my life I would be unhappy. People do enjoy giving money to different projects, they enjoy it and feel part of it.'\nShe added: 'I am at a huge turning point in my life and it would make me feel more complete.'\nKatie said 'good on' Miss Kimberly for finding a way to fund her surgery.\n'She is not forcing anyone to give money, they are giving it willingly so good on her,' she said.\nMiss Kimberly shows off her new cleavage to Katie following her operation to boost her to a C cup\nMiss Kimberly said she feels great now she has had a boob job\nThe Channel 4 cameras followed Miss Kimberly after she went under the knife last August after raising enough money.\nShe said afterwards she was delighted with her new cleavage.\n'The boobs I have always wanted are there, boobs that suit my body frame,' she said. 'I was in pain all summer after having them done but I feel so great, I feel like I can finally breathe.'\nKatie said she was glad Miss Kimberly has been able to boost her confidence and complete her journey to become a woman.\nShe said after seeing Miss Kimberly after her surgery: 'I was so happy to see her confidence up there and she genuinely seemed complete, she is now the woman she was born to be.'","url":"https://www.dailymail.co.uk/femail/article-3419580/Transgender-woman-crowdfunds-pay-3-000-breast-implants.html"}
