{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 00:36:57","date_modify":"2018-10-23 00:36:57","date_publish":"2016-01-28 14:40:13","description":"Brandon Morrison, 17, from La Quinta, California, has become a woman named Brittney Kade after years of being physically attacked and teased by her peers.","filename":"data/vaneerConsumption/TransgenderteenBrittneyKadedreamsofbecomingamodelaftertransitioning.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB3C8500000578-0-image-a-2_1453996282919.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420971_Transgender-teen-17-beaten-tormented-bullies-boy-dreams-model-transitioning-beautiful-confident-young-woman_1540255017.html","title":"Transgender teen Brittney Kade dreams of becoming a model after transitioning","title_page":"Transgender teen Brittney Kade dreams of becoming a model after transitioning | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A nerdy teenage boy who was bullied out of school says life has been transformed since becoming a glamorous woman.\nBrandon Morrison, 17, from La Quinta, California, was beaten up and tormented by her classmates - to the point where she was too depressed and terrified to return to school.\nBut since becoming a woman called Brittney Kade, the blonde teen's confidence has soared and she now has dreams of becoming a model and finding love.\nFollowing her heart: Transgender teen Brandon Morrison (L) has found confidence after becoming a woman called Brittney Kade (R)\nHigh hopes: The 17-year-old from southern California said her life has been transformed since she became a beautiful woman, and she now dreams of starting a career as a model\n'Before becoming Brittney my life was so miserable, but now I'm feeling positive about the future and I would love to find someone to spend my life with,' she said.\n'I dream of becoming a model and showing the bullies that they haven't broken me.'\nLeggy Brittney knew from a very young age that her body on the outside felt very different to the person she was on the inside.\n'I first realized I was born in the wrong body when I was probably three of four years old, when I would play with normal toys that girls would and not normal boy toys,' she explained. 'I was suppressing all of my feelings of just wanting to be myself.'\nFinding herself: Brittney said she first realized she was in the wrong body when she was about three or four years old\nDifficult times: When Brittney was known as Brandon (pictured), she had to be home schooled because of the bullies who would torment her daily\nBrittney's mom Staci Morrison, 33, watched helplessly as her daughter struggled with her identity and fell into a deep depression.\n'I started to notice that Brittney was identifying as a female probably around 18 months when a child starts walking,' Staci said. 'She wanted to wear my high heels, she wanted to dress and play with the girl toys. I noticed really young.\n'She was just a depressed kind of sad child and it would really hurt me.'\nAnd things only went from bad to worse when Brittney was targeted by school bullies who made her life hell.\n'Peers were not very nice to me at school,' she said. 'They would get physical with me - I've been punched in the stomach, I've been trampled by other kids at school, I've had my hair pulled and I've been pushed and shoved.'\nOvercoming adversity: Brittney, who can be seen holding up a picture of herself from 2006, said she was physically abused by bullies who would hit punch her and pull her hair\nMother's heartbreak: Brittney's mom Staci Morrison, 33, said Brandon (pictured) was a 'depressed' and 'kind of sad' child growing up\nThe bullying became so bad that Brittney was too terrified to return to school and at 15 she dropped out and started being home educated.\n'It was just really hard for me and I was miserable. I wanted to take a step back and find out who I was myself,' she recalled. 'I was pretty quiet and numb and I didn't like who I was.'\nBrittney told her mom, and step-dad Andy Fraga, that she was transgender when she was 14 and with their full support she started taking hormones a year later.\nAnd the transformation in both Brittney's character - and appearance - has been remarkable.\nNow Brittney's peroxide blonde locks and trim figure cut a drastically different departure from the gawky awkward boy she once was.\nSupport system: Brittney told her mom Staci (pictured) and her step-dad Andy Fraga that she was transgender when she was 14 and with their full support she started taking hormones a year later\nLoving family: Brittney can be seen posing with her mom and her step-father at their home in La Quinta, California\nBrittney - who has never had cosmetic surgery - said: 'The way I feel about my body today is a whole different change. I am a lot more confident and I think that shows on the outside too.'\nStaci added: 'Brittney has changed a lot mentally during her transition. She has brightened up. It's like watching a flower bloom. It's amazing.\n'I've seen her grow and lose her insecurities. She stands up for herself, stands up for other people, she's become compassionate and she's self-driven. Her personality has changed completely.'\nSadly, not everyone has been so supportive of Brittney's transition, and she is now estranged from her father.\nBut despite the struggles she has suffered, Brittney said she wouldn't change anything.\nBig decision: Brittney, who has never had plastic surgery, said she is undecided about full gender re-assignment surgery\nPositive outlook: The size six beauty revealed that she and her boyfriend of two years broke up because his family struggled to accept that she is transgender, however, she still hopes to find love\n'I've cut the toxic people out of my life and now I'm excited about what the future holds,' she added. 'I spent so many years being told how I should behave, how I should look and what I should like, but since embracing my true self I've never felt more positive and free.'\nNow size six Brittney turns heads wherever she goes but noted that being transgender makes it difficult to find someone special.\nBrittney was dating a boy for two years, but the relationship came to an end because her boyfriend's family struggled to accept that she was transgender.\nThe striking teen, who is undecided about full gender re-assignment surgery, said: 'I believe there is someone out there for everyone and I hope that I can find someone who will just love me as I am.\n'I guess one thing I would like to say to other people who have been in my situation in the past is never give up, you are never alone.\n'There is always a light at the end of the tunnel and just keep going through what you're doing.","url":"https://www.dailymail.co.uk/femail/article-3420971/Transgender-teen-17-beaten-tormented-bullies-boy-dreams-model-transitioning-beautiful-confident-young-woman.html"}
