{"authors":["Dana D. Kelley"],"date_download":"2018-10-30 18:34:40","date_modify":"2018-10-30 18:34:40","date_publish":"2016-04-22 02:02:00","description":"It wasn't that long ago that opponents to the addition of \"gender-neutral\" civil-rights language in city ordinances here in Arkansas were ridiculed for their fears about transgender students demanding to use restrooms inconsistent with their biology.","filename":"data/vaneerConsumption/Transgendertrampling.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_apr_22_transgender-trampling-20160422__page=4_1540924480.html","title":"Transgender trampling","title_page":"Transgender trampling","title_rss":"NULL","source_domain":"arkansasonline.com","text":"It wasn't that long ago that opponents to the addition of \"gender-neutral\" civil-rights language in city ordinances here in Arkansas were ridiculed for their fears about transgender students demanding to use restrooms inconsistent with their biology.\nWorries expressed by parents that their teenage daughters might be forced to have boys who identify as females sharing their school restrooms were haughtily pooh-poohed as a shameful, peripheral, over-reactive non-arguments.\nInstead, they were prophecies.\nA federal court in Virginia has now ruled that a school creating gender-neutral restrooms to accommodate transgendered students is not nearly enough. On the contrary, that's discrimination.\nOur founders and forefathers have spun so much in their graves by this point in time that this latest topsy-turvy episode of liberty as they understood it probably can't increase their RPMs.\nThe utter illogic of this whole \"gender identity\" issue is truly mind-warping, despite an official medical diagnostic term: Gender Dysphoria, which is a recent evolution from Gender Identity Disorder. It's not truly a mental illness--thus the change from a \"disorder\"--but \"dysphoria\" refers to the dissatisfaction, anxiety and restlessness resulting from mis-identity. People who have gender dysphoria feel strongly they are not the gender reflected by their physical anatomy, and associate their identity as a member of the opposite sex.\nDoes that mean the person is then attracted to members of the opposite sex from his or her new gender identity (which would be the same biological sex)? No, psychologists say, gender dysphoria and homosexuality are not one and the same.\nIn plain-sense terms, one might suppose it depends on whether the \"-sexuality\" portion of the word \"homosexuality\" refers to biological sex or gender identity.\nSo, if a transgendered boy (born as a girl) and regular boy (born as a boy) like each other, is that a heterosexual or homosexual relationship? Is it heterosexual or homosexual if a transgendered girl (born as a boy) and and a regular boy (born as a boy) get together?\nThe murky bottom line seems to be it's whatever the two people say it is, so it can be both or either or neither depending on individual situations.\nThe law never fares well when it wanders out of what's factual into what's speculative, hypothetical or theoretical. Legality requires evidence and proof, not belief or emotion, and for good obvious reasons.\nOpening the door to creating some civil right that is defined purely by a person's stated belief about their gender identity is about as silly as silly gets. That's what we'd call somebody who claimed economic dysphoria, which might be defined as feeling strongly that you are not in the financial strata reflected by your bank account. Or career dysphoria, where a person might claim association with identity as a CEO even though his actual job is a janitor. Or sports dysphoria, when a person might associate his identity as a star athlete even though he's 100 pounds overweight.\nIf there's a medical term for it, then gender dysphoria isn't normal. Abnormalities can be accommodated--which is what the school in Virginia did by creating three gender-neutral restrooms. But, with the ACLU's urging, the student demanded to be able to use the bathroom of his/her choice.\n\"I'm fighting for my right,\" the student told one interviewer.\nWhen asked which right exactly, the student replied, \"My right to use the right bathroom.\"\nHow is that an equal right? No students are allowed to decide arbitrarily which restroom they get to use. Under the school's policy, all students are treated the same and have the same two choices: Use either a restroom associated with anatomical sex, or a gender-neutral restroom.\nWhere's the discrimination in that?\nThat's the problem with the \"civil rights\" lobby of today--they don't want equal rights, they want special privileges.\nThe 4th Circuit appeals court opted for special consideration as well in its decision. It cited no case law at all, instead relying entirely on a letter from the Department of Education that was noncommittal on specific restroom rights of transgender students--except to encourage schools to build gender-neutral restrooms (which the school did).\nJudge Paul Niemeyer's stinging dissent laid bare the ridiculous goings-on: \"This unprecedented holding overrules custom, culture, and the very demands inherent in human nature for privacy and safety, which the separation of such facilities is designed to protect.\n\"More particularly, it also misconstrues the clear language of Title IX and its regulations. And finally, it reaches an unworkable and illogical result.\"\nOnce again, judicial activists are trampling traditional liberty in the name of a conjured-up \"right\" definition that is absent in the text of the law (Title IX's wording is limited to \"sex\" and makes no mention of \"gender identity\"). If the people want Title IX to include gender identity, Congress needs to amend it.\nCases like this do so much more bad than good. Even the student admits that the high school and its community was respectful and compassionate when she announced her wish to be known and accepted as a male. She/he wanted her own set of rules, however.\nSuch confusion in a transgendered 16-year-old is understandable--but it's bewildering from a federal appeals court.\n------------v------------\nDana D. Kelley is a freelance writer from Jonesboro.\nEditorial on 04/22/2016","url":"https://www.arkansasonline.com/news/2016/apr/22/transgender-trampling-20160422/?page=4"}
