{"authors":["Madeline Stone"],"date_download":"2018-10-31 00:04:24","date_modify":"2018-10-31 00:04:24","date_publish":"2016-12-04 00:00:00","description":"The modern traveler has a completely different attitude.","filename":"data/vaneerConsumption/Travelershaveanewattitudeabouttraveling.json","image_url":"https://amp.businessinsider.com/images/57caf2ebb996ebed008b60d4-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_travelers-have-a-new-attitude-about-traveling-2016-12_1540944264.html","title":"Travelers have a new attitude about traveling","title_page":"    Travelers have a new attitude about traveling - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Havana, Cuba, is one destination that has grown in popularity as travelers seek out opportunities to experience something outside of the norm. Alexandre Meneghini/Reuters When busy people go on vacation, they're often looking to put their feet up, catch up on sleep, and just generally enjoy being somewhere else for a spell.\nBut in addition to the mental break, it seems more and more likely that what well-heeled travelers value is the chance to have a truly authentic experience, wherever they're headed on vacation.\nWhen the rewards-focused travel portal American Express Travel surveyed 1,540 affluent American adults — defined as having an annual household income of at least $100,000 — it found that 81% valued having a personalized experience over anything else in their travel itineraries. 73% of those surveyed said they would be willing to exceed their budget to have a unique local experience when they travel, and more than half said they would splurge to enjoy the cuisine of a particular destination.\nAnd when it comes to where affluent travelers want to stay when they vacation, it seems that cookie-cutter hotel rooms are out, and authentic flavors are in.\n\"We see lifestyle-inspired, design-focused hotels increasing on the consumer wish list and in fact, are seeing a more than 30% spike in bookings for these type of hotels in the US for 2017,\" said Claire Bennett, executive vice president of American Express Travel.\nTravelers want to sample a destination's food, take in its art scene, and go out where the locals do. And with the rise of Airbnb — which launched its travel agent-like Trips feature in November — travelers in the know can do this with ease. Trips offers two services for now: Experiences, like going truffle hunting or driving classic cars, which are led by locals, and Places, which are recommendations from local residents. Airbnb plans to add Flights and Services in the near future.\nA cooking class in the home of a local woman in Bali. richardha101 / Flickr\nMany traditional hotels see this as a challenge to how they conduct their business.\n\"Experiential vacations — this is the big trend, and that has a major impact on the industry. I think you can say that has been one of the things that contributed to the creation of things like Airbnb, because [travelers] want to experience how someone in Prague, in Paris, in Rome, or in New York lives in his own flat,\" Henri Giscard D'Estaing, global CEO of Club Med, recently told Business Insider.\nOf course, what exactly constitutes an authentic experience is difficult to pin down, and people who come from the same place might disagree on what cuisine or landmark most authentically represents a destination. As Adam Dennett and Hanqun Song recently wrote for The Conversation, \"One can argue that an 'authentic tourism experience' is a contradiction in terms. When places or experiences are discovered and populated by tourists, they ultimately change by the demands of tourists themselves and the economic opportunity this presents to providers.\"\nThe hospitality industry has responded to this shift in perspective in varied ways. Over the last decade, many hospitality companies have either launched or acquired boutique-style brands that are great at capturing local flavors (InterContinental Hotels Group acquired Kimpton Hotels in 2014, for example, and Marriott launched the Autograph Collection in 2010).\nOther hotels are focusing on redefining themselves as lifestyle brands that prioritize culture and design, and as places where travelers can completely customize their own experience.\nTo do this, hotels might pay an Instagram \"influencer\" to visit and post filtered photos of a property so that their large audiences can see what kinds of experiences they can have there. They might hire food trucks to serve local fare certain days of the week, or incorporate craft beers into the beverage program.\nA screenshot from Standard International's One Night app. One Night In September, Standard International — the company behind the trendy Standard hotels in Los Angeles, Miami, and New York — launched a new spontaneous-booking app called One Night, where users can book rooms at a curated selection of hotels. The goal is to target the next generation of travelers — people who are on the go, accustomed to the convenience of on-demand apps, and who still want the very best experience possible.\nThe Standard International team created a local guide for each of the hotels, providing hour-by-hour suggestions of the best things to do in that neighborhood throughout the day.\nClub Med, the all-inclusive chain founded in 1950, continues to invest in resorts in emerging markets, like ski mountains in China and Japan, that are not yet popular with mainstream travelers. The brand has also introduced the ability to have a 360-degree virtual tour of each property so travelers can experience it before they book.\nIn April, Hilton's Conrad Hotels hired former Conde Nast Traveler Executive Editor Peter Jon Lindberg as the brand's director of inspiration. Lindberg works with concierges across Conrad's 28 properties to build out itineraries lasting one, three, or five hours.\nThe goal is to get Conrad guests to see the destination as the locals do. Lindberg says that food experiences — whether that's an outing to a local market or a beachside grill — are always extremely popular with guests.\n\"Travelers want to find things that exist only here, that remind them why they came, and that they'll remember for years later. We think of it as collecting stories, not just souvenirs,\" Lindberg told Business Insider. \"What will they tell their friends back home about their trip? How can we give them something they can't find anywhere but here?\"\n\"Give us a compelling reason to choose this path over that one, and lead with how it will feel. That's the primary task of the travel industry now: finding the emotion and inspiration behind every journey.\"","url":"https://www.businessinsider.com/travelers-have-a-new-attitude-about-traveling-2016-12"}
