{"authors":["Chris Kitching For Mailonline"],"date_download":"2018-10-23 01:01:39","date_modify":"2018-10-23 01:01:39","date_publish":"2016-01-28 15:07:27","description":"People who work in UK customer service travel centres have heard it all - from the tourist who wanted his Big Mac heated up mid-flight to the one who wanted to bring her cat on a cruise.","filename":"data/vaneerConsumption/Travelcompaniesrevealholidaymakersmostbizarrecustomerservicecalls.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AAEDA800000578-0-image-a-52_1453990632485.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3421017_Travel-companies-reveal-holidaymakers-amusing-bizarre-customer-service-calls_1540256499.html","title":"Travel companies reveal holidaymakers' most bizarre customer service calls","title_page":"Travel companies reveal holidaymakers' most bizarre customer service calls | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"From mid-call arrests to requests for an in-flight Big Mac, people who work in customer service for airlines, hotels or travel companies have heard it all.\nThere has been no shortage of absurd complaints from irate customers who had it all wrong or hilarious questions from those who rarely travel.\nMailOnline Travel spokes to a number of travel companies to reveal the most amusing and bizarre tales from their customer call centres.\nOne man who called to cancel his flight booking for that day had to hang up because he was being arrested\nMonarch Airlines once received a call from a customer who needed to change his flight booking for that day, but didn’t explain why.\nMoments later, as the advisor was looking up his flight details, the man said he was sorry but he had to go because he was being arrested at that very moment. He said he would try to call back later.\nAnother passenger once asked if he could bring his goldfish on board a Monarch flight if it was kept in a container under 100ml of water, so not to violate liquid restrictions.\nOne group of travellers called to find out if they could blindfold a husband-to-be as he passed through a security checkpoint because the destination was a surprise.\nOnline travel agency eDreams occasionally fields requests or queries that leave employees scratching their heads.\nOne customer asked if they could bring more hand luggage on board a flight if they weighed less than other passengers.\nAnother wanted to know if the airline would be able to hold onto their order from McDonald’s and serve it to them at dinner time.\nOften, some of the most amusing tales revolving around pets or unusual objects.\nA woman called to find out if she could bring her six Chihuahuas - even though the hotel didn't allow dogs\nChris Clarkson, managing director of sunshine.co.uk, said: ‘One that sticks out in my mind is hearing about an elderly lady who phoned to enquire about whether or not the hotel she'd booked to stay in would allow her to have her six Chihuahuas staying in the room with her and her husband.\n‘The best part? She wanted the hotel, which had a no pets policy, to provide a dog bed for each of her pets.’\nAnother traveller wanted to bring their cat with them on a cruise because they couldn’t find a sitter.\nA football-mad customer tried to cancel his holiday because he had a season ticket for Middlesbrough FC and the team was on the verge of being promoted while he was scheduled to be away.\nClarkson added: ‘On a separate occasion, a male customer called to ask if he could have his holiday for free because he'd had a particularly stressful year.’\nFrom time to time, travel companies book getaways for holidaymakers who are travelling with a secret lover – not their wife or husband.\nOne customer asked Lastminute.com not to call him back about his booking because he was travelling with his mistress.\nAnother customer went so far that his booking had to be protected with a ‘code word’ to ensure that his wife wouldn’t find out, the website said.\nAnd then there are misconceptions that make for amusing tales.\nA customer booked a flight to a country where a visa was required and was notified by the travel agent.\nThe customer said it would be a problem because he used MasterCard instead.\nWhile staying at The Edge at Whitsand Bay, in Cornwall, a furious guest called Unique Home Stays to complain that the view from the clifftop beach hut she was staying at was ‘misrepresented’ on the company’s website and there was hardly any golden sand.\nShe failed to apologise when the employee explained that the beach would be ‘more sandy’ in a few hours when the tide goes out.","url":"https://www.dailymail.co.uk/travel/travel_news/article-3421017/Travel-companies-reveal-holidaymakers-amusing-bizarre-customer-service-calls.html"}
