{"authors":[],"date_download":"2018-10-22 21:04:01","date_modify":"2018-10-22 21:04:01","date_publish":"2014-06-03 22:03:09","description":"U.S. travelers heading for long-term visits to 10 countries with active polio transmission should get booster shots to prevent spread of the disease.","filename":"data/vaneerConsumption/TravelerstoPolioRiddenNationsMayNeedBoosterShotsCDC.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/485416/140603-polio-pakistan-1659_41a7d52ae6c490138ea4929dda33a9e8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-news_travelers-polio-ridden-nations-may-need-booster-shots-cdc-n121766_1540242241.html","title":"Travelers to Polio-Ridden Nations May Need Booster Shots: CDC","title_page":"Travelers to Polio-Ridden Nations May Need Booster Shots: CDC","title_rss":"NULL","source_domain":"nbcnews.com","text":"Those going to seven other countries with active disease within their borders — Afghanistan, Guinea, Ethiopia, Iraq, Israel, Somalia and Nigeria — are highly encouraged to get an extra shot, according to a health advisory issued this week by the Centers for Disease Control and Prevention.\n“We normally recommend that travelers to any country that’s polio endemic be up to date on their vaccinations, including receiving at least one dose of polio vaccine after age 18,” said Dr. Stephen Cochi, a senior advisor with the CDC’s global immunization program. “This ups the ante further.”\nEven those traveling for less than four weeks ought to check their vaccination status and bring papers to prove it, Cochi recommended. Documentation will ease travel in those countries. Pakistan has already started checking records, he said.\nThe new guidance comes in the wake of the World Health Organization declaring last month that the spread of polio is an international health emergency that requires “extraordinary measures” to bring under control. There were 417 cases in 2013 of the disease that was once nearly eradicated, the WHO said.\nIt’s aimed at long-term travelers — think students, researchers and those with families abroad — who may be heading to polio-endemic places long enough to catch the virus and carry it silently home, Cochi said. That can happen even when people are up to date on their immunizations.\n“With polio, the individual can be protected by having responded with antibodies in their blood,” he said. “But the immunity conferred in the intestinal tract wears off over time.”\nThat means within one to two years of last vaccination — and even quicker with the inactivated polio vaccine used in the U.S. — people can become infected with polio abroad and pass it to unvaccinated people when they return. Polio is a virus that only infects humans and symptoms are obvious only in about 1 in every 200 who have it.\n“It’s very much similar to what we continue to experience with the measles virus brought back to the U.S. and then exploding after it enters a susceptible population,” Cochi said. Measles cases in the U.S. are at a 20-year high, fueled almost entirely by unvaccinated travelers.\nThe eradication of polio is still well within reach, but certain steps are necessary to make sure that continues, he added.\n“We’re trying now to focus on those last few countries that might be spreading the virus and imposing restrictions,” he said.","url":"https://www.nbcnews.com/health/health-news/travelers-polio-ridden-nations-may-need-booster-shots-cdc-n121766"}
