{"authors":["Brianne Tolj For Daily Mail Australia"],"date_download":"2018-10-22 21:14:13","date_modify":"2018-10-22 21:14:13","date_publish":"2017-03-16 00:58:10","description":"Australian travel agents have revealed the strangest questions and requests they've received, from some very confused clients.","filename":"data/vaneerConsumption/Travelagentsrevealquestionstravellershaveasked.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4FEFD500000578-0-image-a-29_1489625557166.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318414_Travellers-ask-travel-agents-bizarre-questions_1540242853.html","title":"Travel agents reveal questions travellers have asked","title_page":"Travel agents reveal questions travellers have asked | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Australian travel agents have revealed the strangest questions and requests they've received, from guaranteeing there will be no crying children on a flight to trying to check in a bucket of KFC.\nMatt Castell from Escape Travel in Sydney's Bondi Junction told Escape.com.au he receives a lot of 'random questions' from clients about what they can and cannot bring with them on their flight.\n'23kg of prawns to New Zealand, a bucket of KFC to Manila, human remains [ashes] and even a mummified human head!' he said.\nMatt Castell from Escape Travel in Sydney said he gets 'random questions' from clients about what they can bring on their flight, from 23kg of prawns to a mummified human head (stock picture)\nOne client even tried to check in a bucket of KFC before their flight (stock picture)\nMr Castell said he loves receiving bizarre requests from his clients because it keeps him on his toes.\n'A colleague was recently asked by a male customer if she had any tips on sneaking an engagement ring through airport security as he was worried it may beep and ruin his planned surprise,' he said.\n'On the other side of the romance spectrum, break-ups can put travel agents in an awkward position. I've been asked to make sure that my client's ex-boyfriend be seated on the opposite side of the plane so they wouldn't have to see each other [it was a non-refundable holiday].'\nMs Castell said another client also complained because he hadn't warned him about coconut trees and he was afraid of being hit on the head by the falling fruit (stock picture)\nAn Australian heading on a cruise asked their travel agent how much Coke they could bring because it is all they drink (stock picture)\nOne of the oddest comments he received was from a client who was terrified of coconut trees, Mr Castell said.\n'I once had a customer that was angry that I hadn't warned him that there would be coconut trees in Fiji,' Castell said.\n'He said he was afraid to leave his room because one could fall from a tree and kill him.'\nJenni Marr, helloworld's managing director in Vermont South in Melbourne, told Escape.com.au she would prefer her clients ask a question they're unsure about than not, but some have left her scratching her head and giggling.\nA confused traveller also asked Ms Marr if they could drive from London (pictured) to Dublin\nAnother client who was travelling to Vietnam (pictured) didn't quite understand the need for a visa when he had a MasterCard\nMs Marr said some of her favourites included a client's concern over whether or not they would have to stand during their flight if they didn't pay for a seat reservation.\nAnother client who was travelling to Vietnam didn't quite understand the need for a visa when he had a MasterCard.\nA confused traveller also asked Ms Marr if they could drive from London to Dublin.\nKim Culyer, Escape's travel advice columnist, said she has been asked how many Cokes a person can bring on a cruise because that was all the reader drank.\nShe was also asked about how to avoid crying children on a plane and how to avoid getting a rash from a backpack rubbing on skin.","url":"https://www.dailymail.co.uk/news/article-4318414/Travellers-ask-travel-agents-bizarre-questions.html"}
