{"authors":["Timmhotep Aku"],"date_download":"2018-10-23 01:57:37","date_modify":"2018-10-23 01:57:37","date_publish":"2015-09-11 00:00:00","description":"On his debut album, Rodeo, the young rapper appropriates the sounds of his forebears, like collaborator and mentor Kanye West, to create a musical collage of his own.","filename":"data/vaneerConsumption/TravisScottBorrowsAndBlendsWithExquisiteTasteOnHisDebutAlbum.json","image_url":"https://media.npr.org/assets/img/2015/09/11/travis_rodeo_std_cvr_5x5_nopa_wide-6991e1ad495604187d7c592a179003eb7e1293f3.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_09_11_439499238_travis-scott-a-master-thief-with-exquisite-taste_1540259857.html","title":"Travis Scott Borrows And Blends With Exquisite Taste On His Debut Album","title_page":"Travis Scott Borrows And Blends With Exquisite Taste On His Debut Album : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Travis Scott Borrows And Blends With Exquisite Taste On His Debut Album\nEnlarge this image toggle caption NABIL/Courtesy of the artist NABIL/Courtesy of the artist\nRapper and producer Travis Scott, 23, is one of the most polarizing and intriguing figures in hip-hop today. Born Jacques Webster and hailing from a suburb of Houston, Scott was first known for his relationship with two megastars: rapper T.I., whose label imprint puts out his music; and Kanye West, his mentor and a frequent collaborator.\nLike West, Scott is a college dropout with a middle-class background who chose music over higher education. Scott has a lot in common with West when it comes to attitude, too. He's passionate — almost to a fault — and a recent spate of controversial outbursts and actions has earned him a reputation as an enfant terrible.\nEnlarge this image toggle caption Courtesy of the artist Courtesy of the artist\nScott is both a musician and a master thief. On his full-length debut, Rodeo, he appropriates the sounds and aesthetics of forebears like Kid Cudi — as well as contemporaries like Chief Keef — to create a dark, visceral sonic collage of his own.\nMusically, Rodeo is sprawling: It blends the cinematic synths of Atlanta's trap scene, the aggressive percussion of Chicago's drill music and the AutoTuned sing-song rap of the city's bop music with the \"more is better\" maximalism for which West is known.\nLyrically, Rodeo is debaucherous, disaffected and rude, with an air of causeless youthful rebellion. This is attitude for attitude's sake — or, more precisely, because the words aren't there to convey deep meaning as much as to accompany the music's overall mood.\nTravis Scott's musical collage is all about atmosphere. Some will dismiss Rodeo as derivative, but that's not Scott's concern. He knows that if you're going to be known as a thief, you should be known as one with impeccable taste.","url":"https://www.npr.org/2015/09/11/439499238/travis-scott-a-master-thief-with-exquisite-taste"}
