{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:59:09","date_modify":"2018-10-30 20:59:09","date_publish":"2016-04-18 14:35:41","description":"Trayvon Martin's mother, Sybrina Fulton, campaigned for Hillary Clinton and told supporters that gun control is \"about human rights.\"","filename":"data/vaneerConsumption/TrayvonMartinsMotherCampaignsforHillaryClintonGunControlAboutHumanRights.json","image_url":"https://media.breitbart.com/media/2016/04/Sybrina-Fulton-Hillary-Clinton-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_04_18__1540933149.html","title":"Trayvon Martin's Mother Campaigns for Hillary Clinton: Gun Control 'About Human Rights'","title_page":"Trayvon Martin's Mother Campaigns for Hillary Clinton: Gun Control 'About Human Rights' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Saturday night, Trayvon Martin’s mother, Sybrina Fulton, campaigned for Hillary Clinton and told supporters that gun control is “about human rights.”\nFulton was one of a group of mothers who campaigned for Clinton in two black churches, one in Brooklyn and one in Queens. The other mothers had lost sons or daughters through clashes with members of law enforcement.\nAccording to the New York Daily News, Fulton referenced her son’s death and said gun control “is about human rights.” She added, “Not only about civil rights, but this is about human rights.”\nShe said the narrative must be changed so that everyone sees gun control as tied to human rights, and she believes Clinton is the one who can secure that change. Fulton said:\nWe have to do everything we can to change that narrative. That’s why it’s so important that you vote, because that’s your voice. We don’t have another voice. You can do all the marches you want. You can do all the petitions that you want. What’s important is your vote.\nGeorge Zimmerman shot and killed Fulton’s son in self-defense in February 2012.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2016/04/18/trayvon-martins-mother-clinton-gun-control-human-rights/"}
