{"authors":["Will Martin"],"date_download":"2018-10-30 21:08:01","date_modify":"2018-10-30 21:08:01","date_publish":"2016-12-22 00:00:00","description":"The House of Commons' Treasury Select Committee will lead an inquiry into the impact of the Bank of England’s policy since 2008.","filename":"data/vaneerConsumption/TreasurySelectCommitteetolaunchinquiryintoBankofEngland.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_treasury-select-committee-bank-of-england-monetary-policy-jacob-rees-mogg-mark-carney-2016-12_1540933681.html","title":"Treasury Select Committee to launch inquiry into Bank of England","title_page":"    Treasury Select Committee to launch inquiry into Bank of England - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bank of England Governor Mark Carney. Bank of England / Twitter LONDON — A parliamentary committee that has placed intense scrutiny on the Bank of England and its Governor Mark Carney is launching an inquiry into the \"effectiveness and impact\" of monetary policy in Britain since the financial crisis.\nThe House of Commons Treasury Select Committee (TSC) announced on Thursday that it will look into the unconventional monetary policies that have helped support the British economy since the 2008 crash, namely super low interest rates and quantitative easing.\n\"Interest rates are stuck near zero, the Bank of England has used increasingly unconventional forms of quantitative easing, and inflation has been below the two per cent target for three years,\" TSC Chairman Andrew Tyrie said in a statement announcing the inquiry.\n\"The efficacy of monetary policy or otherwise, its unintended consequences, and its prospects, need careful examination,\" he added. The Committee's role is to scrutinise economic policy, both fiscal and monetary, helping to hold government and the Bank of England to account.\nThe bank's base interest rate currently sits at a record low of 0.25%, and in August, it announced an extended programme of £60 billion worth of quantitative easing.\nThe role of the Bank of England, and particularly that of Governor Carney, have come under serious pressure in recent months, with Carney's alleged pro-EU bias in the run-up to the Brexit vote drawing the ire of many TSC members. Tory MP Jacob Rees-Mogg has been hugely critical of Carney, accusing him of making \"speculative, pro-EU comments beneath the dignity of the BoE,\" and afrequently calling for Carney's resignation.\nThe impact of the unusual monetary policy pursued by the bank has also been criticised by Prime Minister Theresa May in a speech at the Conservative Party Conference in October. May told the audience in Birmingham that a \"change has got to come\" when it comes to UK monetary policy.\n\"While monetary policy - with super-low interest rates and quantitative easing - provided the necessary emergency medicine after the financial crash, we have to acknowledge there have been some bad side effects,\" May said.\nFollowing the speech, May was quickly forced to clarify that she wasn't attacking BoE independence, and that her words had simply been a little clumsily phrased.\nHowever, the comments started a debate about conflicts within the government surrounding the bank, and reports suggested at the time that friction exists between May and Chancellor Philip Hammond on the issue.\nThe Treasury Select Committee made very clear in its announcement that it seeks to ensure the BoE's total independence from government, with Tyrie saying:\n\"The Treasury Committee will continue to act as a safeguard on the operational independence of the Bank. The Treasury indemnity, which underpins parts of the Bank's monetary policy, could all too easily encourage the Treasury, or politicians, to put undue pressure on the Bank. The Committee will examine the risks of that, too.\"","url":"https://www.businessinsider.com/treasury-select-committee-bank-of-england-monetary-policy-jacob-rees-mogg-mark-carney-2016-12"}
