{"authors":[],"date_download":"2018-10-30 00:58:40","date_modify":"2018-10-30 00:58:40","date_publish":"2015-01-15 09:00:00","description":null,"filename":"data/vaneerConsumption/TreasurePlanetIsaDelightfulMashup.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/01/Screen20Shot202015-01-1420at207.00.2220PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861120.html","title":"‘Treasure Planet’ Is a Delightful Mashup","title_page":"‘Treasure Planet’ Is a Delightful MashupThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"“Well, I suppose a human being isn’t the best judge. You humans do it differently from us. We are not kind. But deep down you are utterly ferocious on a level we Kzin can’t reach. All the truly frightful things you can’t face, you let your subconscious handle. That’s how you beat us. Only you don’t see it, you won’t let yourself see it; you fool yourselves into thinking there’s something nice at your core. But down there in the id, you have a monster lurking, little Peter. You can’t see it, but I can.”\nIf you were to hold a cutlass to my throat and force me to name the greatest adventure story ever written, I’m pretty sure I’d have to say Robert Louis Stevenson’s Treasure Island. I’ll never forget how much I loved it as a boy; how deeply satisfying it was at a primal level. Better yet, it still works when I return to it as an adult. Other great adventure books were written before and have been written since, but Treasure Island just rings true. It’s hard to imagine a way to make it better.\nSo it was with some hesitancy that I picked up the homage to Treasure Island, Treasure Planet, by Spectator contributor Hal G.P. Colebatch and Jessica Q. Fox (full disclosure: Hal is a friend, and I got my copy free).\nIt should be emphasized, to avoid confusion, that despite sharing a general concept and a title, this novel is in no way related to the 2002 Disney animated feature also called Treasure Planet. Colebatch and Fox’s novel is set in Larry Niven’s well-established “Man-Kzin Wars” science fiction universe, in which the gigantic, tiger-like, imperialistic Kzin have been battled to an armistice by the surprisingly formidable human race. Today, on the planet Wunderland, where the story’s action begins, humans and Kzin live together in a mostly amicable peace that has benefited both species.\nThe Jim Hawkins character here is Peter Cartwright, a young man who helps his mother run an inn in a remote part of Wunderland. The appearance of Captain Skel, a demanding and dangerous old space-farer, sets off a plot whose general outlines will be familiar to any Stevenson fan. Long John Silver here is “Silver,” a Kzin with a prosthetic leg, and instead of a ship we have, of course, a spacecraft. The treasure in this book is not gold, but an alien library full of technological information left behind by a long-extinct species.\nMost of the characters are much as they are in Stevenson, but Jack Hawkins is augmented. Such a change would be hard to avoid in this fictional universe, as any human left on his own to face the physical strength and ferocity of Kzin pirates wouldn’t last long. So Peter Cartwright is given a protector, a young female Kzin named Marthar. Their relationship is complex; Marthar seems to think of Peter as a pet. But she watches over him, and even needs his help when seriously wounded.\nThe necessary trappings of a space opera provide novelty that prevents Treasure Planet from being a mere re-staging. The logistics of getting from a space ship to a planet and back, for instance, present problems unknown to eighteenth-century mariners. And how would an advanced alien library work? The discovery of its secrets adds a fresh element to the familiar plot. And back of it all is the intriguing love/hate interplay between two species that has made the Man-Kzin Wars universe so fascinating to readers for years.\nThe authors made the right decision, I think, in allowing the pirates to talk like Stevenson pirates. I’m convinced that any adaptation that fails to supply the pleasures of Silver’s dialogue would have to disappoint. But “talking like a pirate,” as anyone knows who’s ever tried to do it on the annual unofficial holiday, is harder than you’d imagine. I’m happy to report that the West Country dialect we’ve come to associate with pirates, ever since Stevenson transcribed it and Robert Newton gave it music, comes off pitch perfect here. “Ye has me affy-davy on it.”\nI enjoyed Treasure Planet quite a lot. It offers most of the pleasures of revisiting Treasure Island, plus some new fun. Recommended for young people and adults.","url":"https://spectator.org/61489_treasure-planet-delightful-mashup/"}
