{"authors":[],"date_download":"2018-10-30 18:25:08","date_modify":"2018-10-30 18:25:08","date_publish":"2017-04-12 14:28:00","description":"The DeKalb Board of Commissioners awarded a $7.2 million sewer cleaning contract that will add capacity without rebuilding infrastructure.","filename":"data/vaneerConsumption/TreesinsidesewerlinesDeKalbspends72Mtocleanthemout.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/12/Images/rootintrusion.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_t_8b5e32997c027c78e4243a508959db60__1540923908.html","title":"Trees inside sewer lines? DeKalb spends $7.2M to clean them out","title_page":"DeKalb County plans to remove trees and grease that block sewer lines","title_rss":"NULL","source_domain":"ajc.com","text":"For more than 50 years, trees took root and grease built up inside DeKalb County sewer lines.\nThese blocked pipes caused repeated sewage spills and threatened the county’s ability to grow.\nThe DeKalb Board of Commissioners voted 7-0 on Tuesday to clean congested sewer trunk lines for the first time in decades.\nGovernment officials hope the $7.2 million cleaning contract will allow the county to add sewer capacity without having to spend far more money on new infrastructure.\n“That was a full-grown tree inside of the sewer,” said Commissioner Larry Johnson before the vote. Cleaning pipes “enhances economic development and keeps us moving forward as a county.”\nDeKalb CEO Mike Thurmond said removing sediment buildup will help accommodate businesses that want to build in the county.\n“This presents an opportunity for upsizing these lines and reducing costs,” Thurmond told commissioners. “This is a significant moment for the taxpayers and ratepayers of this county.”\nCommissioners awarded the contract to Atlanta-based Compliance Envirosystems, which was the lowest responsive bidder.\nSeparately, the commission also approved a $28.2 million contract for Atlanta-based Brown and Caldwell to rebuild a gravity sewer system. The project is intended to reduce frequent sewage spills at 19 locations in Decatur and Avondale Estates.","url":"https://www.ajc.com/news/local-govt--politics/trees-inside-sewer-lines-dekalb-spends-clean-them-out/ySylU1ePCssb5pAgPzo12M/"}
