{"authors":["Associated Press"],"date_download":"2018-10-23 04:43:02","date_modify":"2018-10-23 04:43:02","date_publish":"2017-04-26 16:15:57","description":"KATHMANDU, Nepal (AP) - A Taiwanese man who was missing on a mountain in Nepal for 47 days was rescued Wednesday, but his girlfriend died just three days...","filename":"data/vaneerConsumption/Trekkermissingfor47daysrescuedinNepalfrienddead.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/16/wire-466317-1493222155-857_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448258_Trekker-missing-47-days-rescued-Nepal-friend-dead_1540269782.html","title":"Trekker missing for 47 days rescued in Nepal, friend dead","title_page":"Trekker missing for 47 days rescued in Nepal, friend dead | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"KATHMANDU, Nepal (AP) - A Taiwanese man who was missing on a mountain in Nepal for 47 days was rescued Wednesday, but his girlfriend died just three days before they were discovered, trekking officials said.\nAsian Trekking agency official Madhav Basnet said 21-year-old Liang Sheng Yueh was found Wednesday on a ledge under a waterfall and was flown by helicopter to a hospital in the capital, Kathmandu. He said the body of his girlfriend, 19-year-old Liu Chen Chun, was also taken to the capital.\nThey were on a long trek on the Ganesh Himal trail, which is not as crowded as other popular routes, and were caught in a snowstorm in March and lost their way.\nTaiwanese man Liang Sheng-yueh talks to a doctor at the Grande Hospital in Kathmandu, Nepal, Wednesday, April 26, 2017. Trekking officials in Nepal say they have a rescued the Taiwanese man who was missing on a mountain for 47 days, but his girlfriend had died just three days before they were discovered. (AP Photo/Niranjan Shrestha)\nAccording to Basnet, they appeared to have followed a river hoping to find a village but slipped and fell over a waterfall. They landed on the ledge and were unable to climb up or down. The area is an altitude of 2,600 meters (8,520 feet).\nBasnet said the weather improved a few days after the snowstorm, but the temperature was unclear.\nThey had no guides or porters and were carrying their own food, tent and sleeping bags.\nFor the first two weeks they survived on food they had in their backpacks but after that they consumed only salt and water, he said.\nRescuers first scoured the area for two weeks before suspending their search, but resumed the search on April 20.\nBasnet said they spotted a red tent and managed to climb down.\n\"We found the man alive and able to speak to us, but the woman was already dead. We could not carry them so we called a helicopter,\" Basnet said.\nThe man was winched up by the helicopter and immediately flown to Kathmandu, followed by the body of the woman.\nThe man appeared to be in good health in the emergency room.\n\"He appears exhausted and lost some 30 kilograms of body weight,\" said Ajay Singh Thapa, a doctor at the Grande Hospital. \"He was suffering from severe malnutrition. His foot was covered with maggots and hair full of lice. Despite having to live like that for 47 days, he appears to be mostly normal.\"\nHe said the man probably could survive because he was able to get both salt and water in his body.\nThe man said he spent the past three days next to the body of his dead girlfriend.","url":"https://www.dailymail.co.uk/wires/ap/article-4448258/Trekker-missing-47-days-rescued-Nepal-friend-dead.html"}
