{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 18:53:06","date_modify":"2018-10-30 18:53:06","date_publish":"2015-10-31 13:58:30","description":"Christians celebrate All Saints Day on November 1, and Halloween, or “All Hallows Eve,” was born as a vigil celebration in preparation.","filename":"data/vaneerConsumption/TrendingChristiansDumpGhostCostumestoDressUpasSaintsforHalloween.json","image_url":"https://media.breitbart.com/media/2015/10/Halloween-Costumes-Wiki.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_31__1540925586.html","title":"Trending: Christians Dump Ghost Costumes to Dress Up as ‘Saints’ for Halloween","title_page":"Trending: Christians Dump Ghost Costumes to Dress Up as ‘Saints’ for Halloween | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A growing trend among Christian families is dressing children as saints for Halloween, rather than as ghouls or witches, to take back the celebration of the “Hallowed Eve” of the Feast of all Saints.\n“All Hallows is an exceptionally important vigil,” writes Mary Regan. “We prepare not just to celebrate the feast that honors all the canonized saints, but also the saints that are unknown; the unidentified multitudes of humble souls who were not high-profile during their lives but nonetheless were true to goodness and made it through the Pearly Gates.”\nChristians celebrate All Saints Day on November 1, and Halloween, or “All Hallows Eve,” was born as a vigil celebration in preparation for the solemnity. Over the years it became transformed into a secular holiday, focusing more on door-to-door candy collection and clever costumes than on the spiritual origins of the day.\nOne Filipino archbishop expressed his regret that Halloween, like other holidays, seems to have lost its religious character and is now just a secular feast. “Unfortunately, secular, consumerist and pagan practices have seeped into what was sacred and spiritual in our religious observances,” he wrote in a circular letter to the faithful of his diocese.\nNow, however, many Christian families are crusading to put the “holy day” back in the holiday.\n“Let’s resolve to take back the holiday,” writes Christian author Angelo Stagnaro, “and celebrate it as it was originally intended: a spiritual preparation for the two more important holidays following it: All Souls Day and All Saints Day. For years, my parish school has had the delightful custom of asking students to dress as their favorite saints for their Halloween party.”\nPopular costumes include Saint Francis of Assisi, Saint Joan of Arc, Saint Michael the Archangel and even the dragon-slaying Saint George, but other parents are encouraging their kids to study up on their own patron saints and to dress for the one they were named after.\nThis new trend among Christians may well be a reaction against the progressive degeneration of children’s costumes, which have become more explicit and graphic over the years.\n“Practically gone are innocent depictions of supernatural beings that inspire laughter and smiles. Instead, the images of Halloween are fraught with a disquieting ugliness, genuine horror, and pornography,” writes Pennsylvania school principal Sean Fitzpatrick.\n“The costume trend for little girls at Halloween is almost wholly centered on slinkiness and sexuality,” Fitzpatrick laments. “Practically gone is the innocence of princesses and pumpkins. Now there are Goths, Monster High, and a prostitute version of every character imaginable from witches to nuns.”\nSome, like Kendra Tierney, are dressing their children in costumes that can pass for both Christian saints and well-known figures from film or literature.\nOne of her daughters will be wearing all white with a wide sash, doubling both as the Christian Saint Lucy, an early Roman martyr, and Princess Leia from Star Wars. Meanwhile her son Bobby will trick-or-treat in a hooded black tunic, representing either the monastic founder Saint Benedict of Norcia or one of the Death-Eaters from the Harry Potter series.\nFortunately, with more than 10,000 officially recognized Christian saints to choose from, children wishing to dress as one won’t suffer from a lack of options.","url":"https://www.breitbart.com/politics/2015/10/31/trending-christians-dump-ghost-costumes-dress-saints-halloween/"}
