{"authors":["Rachael Levy"],"date_download":"2018-10-30 23:52:59","date_modify":"2018-10-30 23:52:59","date_publish":"2016-12-05 00:00:00","description":"Trian's Nelson Peltz, a billionaire activist investor, spoke about the Donald Trump stock rally, Mondelez and bringing companies back to the US.","filename":"data/vaneerConsumption/TriansNelsonPeltzonDonaldTrumpandderegulation.json","image_url":"https://amp.businessinsider.com/images/58458250e02ba78f1c8b73fa-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trians-nelson-peltz-on-donald-trump-and-deregulation-2016-12_1540943579.html","title":"Trian's Nelson Peltz on Donald Trump and deregulation","title_page":"    Trian's Nelson Peltz on Donald Trump and deregulation - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Nelson Peltz. AP/EMILE WAMSTEKER Trian Partners' Nelson Peltz said he thinks companies could come back to the US under President-elect Donald Trump.\n\"If he gets the kinds of tax reductions he's talking about, we will wind up having more employment, more companies coming back to the United States,\" Peltz told CNBC's David Faber on Monday's \"Squawk on the Street.\"\n\"I think the Trump rally is celebrating that capitalism is back,\" he added.\nThe activist investor, who is a board member at Mondelez, has drawn scorn for cutting jobs at the Oreo-maker. Trump, Hillary Clinton and Bernie Sanders earlier this year criticized Mondelez's decision to move some jobs to Mexico. Mondelez is one of Trian's largest positions.\nIn a speech last year, Trump said that he'll \"never eat another Oreo again,\" according to CNN Money.\nFor Mondelez, Peltz said those jobs never should have been there in the first place, and that many of the cut jobs weren't in the US. \"There were lots of jobs cut all through Europe, Asia,\" he said. \"We were fat.\"\nHe added that there's a \"suffocating bureaucracy\" in many large companies that Trian invests in. \"You've got to cut fat and know when you hit muscle, and you better not be hitting bone,\" he told CNBC.\nPeltz has been associated with job cuts, for instance at Legg Mason in 2010.\nTrump has since ended his criticism of Mondelez, Peltz said.\n\"I explained to him that we have a dozen plants across America today making Oreos. We have one plant that's been open for about two years in Mexico making Oreos for Mexico and for the United States,\" he said.\n\"Mondelez's margins when I got on the board, we were coming off an 11% year in 2014. And now they're 15 to 16,\" he added.\nPeltz also told CNBC that Trian recently starting buying stocks in a new target company, but declined to identify the new position.","url":"https://www.businessinsider.com/trians-nelson-peltz-on-donald-trump-and-deregulation-2016-12"}
