{"authors":["Associated Press"],"date_download":"2018-10-23 03:37:10","date_modify":"2018-10-23 03:37:10","date_publish":"2017-03-16 14:39:50","description":"BISMARCK, N.D. (AP) - Tribes suing to stop the Dakota Access pipeline are asking a federal appeals court to head off the imminent flow of oil.The move comes...","filename":"data/vaneerConsumption/Tribesopposingoilpipelineturntofederalappealscourt.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/14/wire-228979-1489675195-127_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320536_Tribes-opposing-oil-pipeline-turn-federal-appeals-court_1540265830.html","title":"Tribes opposing oil pipeline turn to federal appeals court","title_page":"Tribes opposing oil pipeline turn to federal appeals court | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BISMARCK, N.D. (AP) - Tribes suing to stop the Dakota Access pipeline are asking a federal appeals court to head off the imminent flow of oil.\nThe move comes after U.S. District Judge James Boasberg rejected a similar request Tuesday and a motion last week to halt the final stage of construction for the $3.8 billion pipeline to move North Dakota oil to Illinois.\nThe Standing Rock and Cheyenne River Sioux appealed that decision to the U.S. Court of Appeals for the District of Columbia Circuit. Attorney Nicole Ducheneaux (DOO'-shuh-noh) on Wednesday asked the appeals court for an emergency order preventing oil through the pipeline until the appeal is resolved.\nFILE - This Feb. 13, 2017, aerial file photo, shows a site where the final phase of the Dakota Access pipeline is taking place with boring equipment routing the pipeline underground and across Lake Oahe to connect with the existing pipeline in Emmons County near Cannon Ball, N.D. Federal Judge James Boasberg on Tuesday, March 14 denied a request by the Standing Rock and Cheyenne River Sioux to stop oil from flowing while they appeal his earlier decision allowing pipeline construction to finish. (Tom Stromme/The Bismarck Tribune via AP, File)\nTexas-based pipeline developer Energy Transfer Partners is wrapping up construction and says it could be moving oil as early as Monday.","url":"https://www.dailymail.co.uk/wires/ap/article-4320536/Tribes-opposing-oil-pipeline-turn-federal-appeals-court.html"}
