{"authors":["Ben Moshinsky"],"date_download":"2018-10-31 00:35:24","date_modify":"2018-10-31 00:35:24","date_publish":"2016-12-01 00:00:00","description":"Privacy hearings surrounding a former senior Barclays investment banker's whistleblowing case have been adjourned until May next year, the FT reported.","filename":"data/vaneerConsumption/TribunaladjournsexBarclaysbankerswhistleblowingcase.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_richard-boath-wrongful-dismissal-claim-barclays-sfo-case-adjourned-2016-12_1540946124.html","title":"Tribunal adjourns ex-Barclays banker's whistleblowing case","title_page":"    Richard Boath wrongful dismissal claim related to Barclays SFO case adjourned - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters\nLONDON — Privacy hearings surrounding a former senior Barclays investment banker's unfair dismissal claim have been adjourned until May next year, t he FT reported.\nBarclays dismissed Richard Boath, who was global co-head of finance, earlier this year after reading transcripts of his interview with the Serious Fraud Office, Boath's lawyers alleged in an employment tribunal last week.\nThe SFO petitioned the employment tribunal to keep details of the Boath interview and investigation out of the public eye.\nThe Financial Times and other publications have challenged the SFO's petition. The SFO has said it expects to decide whether to charge former Barclays executives by March next year.\nBoath had claimed the lender fired him as a \"direct response\" to what he told fraud investigators about the bank, his lawyer said. He is suing Barclays for unfair dismissal for whistleblowing.\nThe SFO is investigating a round of capital raising in 2008 that enabled Barclays to avoid a state bailout.\nThe SFO has been investigating \"certain commercial arrangements between Barclays Bank and Qatar Holdings\" since 2012. In 2013, the Financial Conduct Authority alleged in its own investigation that Barclays paid around £322 million to Qatari investors in return for a £4.6 billion capital injection at the height of the 2008 financial meltdown.\nBoath was interviewed in 2014 as part of the investigation. The transcript, which ran to 900 pages according to a report in The Guardian, was seen by Barclays this year after the SFO used it to boost its case to get a warrant to search the bank.","url":"https://www.businessinsider.com/richard-boath-wrongful-dismissal-claim-barclays-sfo-case-adjourned-2016-12"}
