{"authors":["Kate Thomas","Simon Tomlinson For Mailonline"],"date_download":"2018-10-23 00:43:05","date_modify":"2018-10-23 00:43:05","date_publish":"2016-01-11 10:29:39","description":"Elton John, David Beckham, Mick Jagger and Kanye West led the mass influx of messages as celebrities took to social media thank the late star for his unforgettable influence on music.","filename":"data/vaneerConsumption/TributespourintoDavidBowiewith43milliontweetsdedicatedtoicon.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/22/30109B3600000578-0-image-a-2_1452552489764.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393666_Madonna-Kayne-West-David-Beckham-lead-Twitter-tributes-David-Bowie_1540255385.html","title":"Tributes pour in to David Bowie with 4.3million tweets dedicated to icon","title_page":"Tributes pour in to David Bowie with 4.3million tweets dedicated to icon | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tributes have poured in for David Bowie from around the world and beyond, with celebrities, politicians, astronauts and even the Vatican praising the singer's legacy.\nThe glam rock legend passed away in New York yesterday after a secret 18-month battle with cancer, just days after his 69th birthday.\nA-list names like Elton John, Madonna, David Beckham, Mick Jagger and Kanye West led the tributes as around 4.3million tweets - some 20,000 a minute - flooded onto Twitter in the hours after his death. Elton wrote on Instagram: 'I am still in shock. Never saw it coming. My deepest condolences to Iman and the family. An amazing life. An amazing career'.\nScroll down for video\n'In shock': Elton John mourned the loss of Bowie, and sent his condolences to the star's family, including his wife Iman\n'A true original' Mick Jagger posted this poignant photograph with David Bowie, saying he was an 'inspiration'\nBut his impact during a stellar career spanning six decades went far beyond his own industry, with world leaders and religious figures alike thanking him for his unforgettable influence.\nDevastated at the loss of his friend, rock star Mick Jagger tweeted pictures of the pair together, adding: 'We had so many good times together. He was my friend, I will never forget him.\n'David was always an inspiration to me and a true original. He was wonderfully shameless in his work.'\nUploading vintage images of Bowie as well as a sweet picture of the two of them together, Madonna wrote: 'Im Devastated! This great Artist changed my life! First concert i ever saw in Detroit! R.IP. ❤ #rebelheart'\n'So lucky to have met you!': Madonna led the celebrity tributes on social media on Monday morning, expressing her shock and sadness at the news\nFirst love: 'Im Devastated! This great Artist changed my life! First concert i ever saw in Detroit!', she wrote\nThe Queen of Pop added: 'Talented . Unique. Genius. Game Changer. The Man who Fell to Earth. Your Spirit Lives on Forever!❤ #rebelheart'.'\nSo lucky to have met you!!!! Hot Tramp I love you So! ❤ #rebelheart -madonna'.\nKanye West hailed Bowie as one of his 'most important' inspirations and thanked him for shaping his own musical career.\nHe wrote: 'David Bowie was one of my most important inspirations, so fearless, so creative, he gave us magic for a lifetime. I pray for his family and friends.'\nDavid Beckham showed his solidarity for the British legend, posting, 'A creative genius and influence over us all.. Rest In Peace STARMAN'.\nGladiator star Russell remembered him as 'one of the greatest performance artists' ever.\nHe posted: 'RIP David. I loved your music. I loved you. One of the greatest performance artists to b have ever lived. #sorrow'.\nAnd hours after hosting the Golden Globe Awards, Ricky Gervias - who convinced his reclusive idol to appear on his 2006 sitcom Extras - was morning the passing of his hero.\nSee full news coverage on David Bowie's death as the tributes pour in from artists\nSaddened: Sports star David Beckham paid tribute to the Ziggy Stardust hitmaker on Instagram\nDevastated: The star's close friend Iggy Pop shared one of the most moving messages\nInspiration: Rapper Kanye West hailed the late British icon as one of his biggest influences\nRIP: Stars from every field including actor Russell Crowe expressed their sorrow\n'Hero': Fresh from hosting the Golden Globes, Ricky Gervais revealed his shock\nDevastated: Cher wrote on the social media site, 'a legend is gone'\nIn shock: Billy Idol admitted he almost shed tears when he heard the shocking news\nHe tweeted: 'I just lost a hero. RIP David Bowie.'\nSinger and producer Pharrell Williams called Bowie 'a true innovator, a true creative', and actor Joseph Gordon-Levitt quoted from his song Eight Line Poem writing: 'But the key to the city is in the sun that pins the branches to the sky...'\nTim Peake, the British astronaut whose nickname 'Major Tim' derives from the song Space Oddity, said: 'Saddened to hear David Bowie has lost his battle with cancer - his music was an inspiration to many.'\nArchbishop of Canterbury Justin Welby told the BBC that he became a fan during Bowie's early rise to prominence.\n'I remember sitting listening to his songs endlessly in the 1970s particularly and always really relishing what he was, what he did, the impact he had,' Welby said. 'Extraordinary person.'\nFans: British Prime Minister David Cameron (left) said Bowie's death is 'a huge loss' while the Archbishop of Canterbury Justin Welby (right) said he remembered 'listening to his songs endlessly in the 1970s'\nThe Vatican's culture minister paid tribute to Bowie by tweeting the lyrics to his song Space Oddity.\nCardinal Gianfranco Ravasi wrote: 'Ground Control to Major Tom Commencing countdown, engines on Check ignition and may God's love be with you.'\nDavid Cameron said Bowie's death was 'a huge loss.'\nThe British Prime Minister tweeted that he had grown up listening to and watching Bowie.\nHe called the singer a 'master of reinvention' and a pop genius who kept on getting it right.\nEddie Izzard wrote: 'Please could every radio station around the globe just play David Bowie music today - I think the world owes him that.'\nBilly Idol was one of many people to suggest that Bowie's death was a moment of unusually powerful grief, writing on Twitter: 'Nearly brought to tears by sudden news of David Bowie's passing.'\nComedian Ricky Gervais, who persuaded his idol to appear on his television show, 'Extras,' wrote on Twitter: 'I just lost a hero. RIP David Bowie.'\nPaying tribute: Stars took to Twitter in their droves to express their sadness at the sudden death of David Bowie, who passed away following a secret 18-month battle with cancer\nNews: Bowie's death was announced by his management on his website and social media this morning\nIconic: This photograph of Bowie in character for the album Aladdin Sane is one of the most recognisable images of the 1970s\nHaunting: Bowie's final music video, Lazarus, shows him in a hospital bed with his eyes covered by a bandage in an apparent premonition of his death\nMeanwhile, comedian James Corden shared a snap of a service information update from TFL bearing a m,ivign quote from Bowie, reading, 'I don't know where I am going from here, but I promise it won't be boring. corden\n'Farewell Major Tom .. There are no words. RIP David, another hero remembered', Courtney Love shared, while Gene Simmons posted, 'Bowie's Changes and the Ziggy story songs were a major influence for me', and Cher simply wrote: 'Devastated... A legend is gone'.\nHis friend Iggy Pop posted one of the most heartfelt tributes to the fallen star, writing, 'David's friendship was the light of my life. I never met such a brilliant person. He was the best there is.'\nYoung singers of today including the One Direction boys and Tom Odell also thanked the musical hero for his incredible legacy.\n1D's Niall Horan shared, 'Very sad to wake up to the news of David Bowie's passing . He is a true music legend and his legacy will live on forever ..', while Harry Styles simply stated, 'RIP David Bowie. An icon'.\nHigh praise: Happy hitmaker Pharrell joined the droves of celebrities expressing their condolences\nPoignant quote: Comedian James Corden shared a picture of a message from Transport For London on the Underground, featuring a moving Bowie quote\nFarewell Major Tom: Courtney referenced one of the star's most iconic lyrics\nBoy band tribute: Members of One Direction including Harry Styles paid their respects\nYoung generation: Many young musicians including Tom Odell shared their sadness\nPersonal touch: Presenter Fearne Cotton revealed her favourite Bowie song\nTom Odell posted, 'farewell to a truly brilliant artist, i'll miss you dearly', while music presenter Fearne Cotton shared a YouTube link to The Width of a Circle', addin, 'My fave Bowie song. Sleep well dear David.'\nAmerican actors including Joseph Gordon-Levitt and Mark Ruffalo also expressed their devastation, with the former posting the lyric, 'But the key to the city is in the sun that pins thebranches to the sky.'\nJemaine Clement, one half of Flight of the Conchords, tweeted: 'It's sad to lose Bowie, but it beautiful to think millions of people across the world are listening to his music right now.'\nTogether with comedy partner Bret McKenzie, he created the song Bowie's In Space for an episode centred around the music icon in 2007.\nIt features lyrics such as: 'Do you have one really freaky sequin space suit, man? / Or do you have several ch-ch-ch-changes?'\nGrieving: Fans left flowers next to a mural of Bowie's face in Brixton, South London, where he was born\nUniversally loved: The pop pioneer, pictured at the Isle Of Wight Festival in 2004, was even honoured by Prime Minister David Cameron and the Archbishop of Canterbury\nClement added: 'A lot of people having singalongs finding out how complex his songs were, right now.\n'If you haven't heard Blackstar, listen to it. It is brilliant. I listened to it on repeat last night and tonight... he's gone...'\nChris Hadfield, the former commander of the International Space Station who recorded a video of a version of Bowie's Space Oddity during his final mission in 2013, said the singer had been an inspiration.\nAlongside a picture of Bowie he tweeted: 'Ashes to ashes, dust to stardust. Your brilliance inspired us all. Goodbye Starman'\nAmerican fashion designer Tommy Hilfiger paid tribute to a ltrue style iconl on Instagram: lDavid Bowie is and always will be a rock 'n' roll legend, a true style icon and a dear friend. My heart is with his loved ones today. -TH.'\n'Stardust': Victoria Beckham uploaded this image of the visionary musician\nJoint statement: The Rolling Stones paid tribute to their musical peer and friend\nRemembering a legend: Fashion designer Tommy Hilfiger shared a snapshot of himself with Bowie and his wife Iman\nPaying tribute: Harry Potter author J.K. Rowling also took to social media to voice her upset\nModern influence: Swedish DJ Avicii posted a heartfelt statement\nViral video: Cara Delevingne was one of the many Instagram users to share this montage of Bowie through the ages, adding, 'RIP David Bowie and all the characters within him'\nSwedish musician Avicii posted a photo of Bowie with the words: 'I don't know where I'm going from here, but I promise it won't be boring', accompanied by a tribute of his own: ''A timeless icon has left us. David Bowie you will be deeply missed.'\nModel and actress Megan Gale shared a black and white image of the star swaddled in a coat in snowy New York, writing: 'One of the best - gone but never forgotten & his music will live on forever,' while model Shanina Shaik wrote simply; 'legendary.'\nBowie, who released his new Blackstar album just last week, passed away from the illness yesterday surrounded by his family, according to an announcement on his official website and Facebook page.\nThe singer's son said that he was 'very sorry and sad to say it's true' after the news emerged this morning.\nLast picture: Bowie attended the premiere of the musical Lazarus, based on his songs, in New York last month\nHis longtime producer Tony Visconti suggested that Bowie knew for a year that his cancer was incurable, and added that 'his death was no different from his life - a work of art'.\nA spokesman for the singer said this morning: 'David Bowie died peacefully surrounded by his family after a courageous 18-month battle with cancer.\n'While many of you will share in this loss, we ask that you respect the family's privacy during their time of grief.'\nBowie's latest album Blackstar - described by Mr Visconti as 'his parting gift' - was released just last Friday, the singer's 69th birthday, although he had rarely performed or appeared in public in recent months.\nHis final video, Lazarus, was released last week and featured haunting footage of the singer confined to a hospital bed with his eyes covered by a bandage.\nSad loss: Bowie with his supermodel wife Iman, whom he married in 1992 and with whom he had a daughter\nHe was seen in public for the last time in December, attending the premiere in New York of a musical based on his songs, also called Lazarus.\nDavid's widow Iman is seemingly relying on her faith in God to cope with the death of her husband.\nShe is yet to publicly comment on his death, but cryptically posted on Twitter on Sunday, 'The struggle is real but so is God.'\nThe Somalian beauty also shared a sad post on January 9 - the day after her late spouse's birthday - in which she told her followers, 'Sometimes you never know the true value of a moment until it becomes a memory.'\nIman and David married in April 1992 in a private ceremony in Lausanne, and the wedding was later solemnised in June in Florence, Italy.\nThey had a daughter, 15-year-old Alexandria Zahra Jones, together and she also acted as stepmother to his son Duncan Jones - whose mother is the musician's first wife Angie Bowie.\nHeartfelt quote: David's widow Iman shared a saying about understanding the value of a moment\nSeeking solace: The star, who is yet to publicly comment on the sad news, revealed she was consoling herself with prayer\nMeanwhile Chris Difford, founding member and songwriter of the British group Squeeze, blogged a personal tale of how he had been influenced by Bowie throughout his career.\nHe wrote: ‘In 1971 I was sitting in my bedroom in my tiny house on a council estate in London when the penny dropped.\n‘I put pen to paper and picked up my battered guitar and began to write my first song... On my record player the constant revolving of David Bowie and Space Oddity.\n‘A few years ago I received some tapes recorded in 1971 by a friend of mine who lived down the block from me, these were my first demos.\n‘When I listen to them now I can hear how much I leant on David Bowie's inspiration, even the voice...\n‘I saw Bowie play at Eltham Collage in 1972, the audience were sat on the floor and during the show he came out and shared his guitar with us, we reached out strumming at his blue 12 string.\n‘After the show I walked home with a friend, whatever Bowie had I wanted some too, but like his guitar it all seemed out of reach.\n‘One afternoon I stood outside his house in Beckenham, just to see him and to have a chance maybe to say hello. It was a wasted journey, he never showed up, maybe we had the wrong house.’\nDifford also recalled a time he had hung out backstage with his friend Will, who was road manager to Bowie - who at the time was playing as Ziggy Stardust.\nHe added: ‘I even wrote a song called Welcome To Mars. Will was kind enough to let me help him paint the lighting strike on the stage.’\nSqueeze supported Bowie on a leg of his Glass Spider tour, and Difford wrote about how Bowie and his crew had given them a standing ovation on their first night.\nHe admitted initial misgivings about Bowie's new album, Blackstar, but added: ‘Now watching the video for Lazarus I'm struck by its meaning. This morning when my wife Louise woke me up to tell me he had died, the penny dropped.’\nAnd John Lennon's widow Yoko Ono said in a statement on Facebook: ‘John and David respected each other. They were well matched in intellect and talent. As John and I had very few friends we felt David was as close as family.\n‘After John died, David was always there for Sean and me. When Sean was at boarding school in Switzerland, David would pick him up and take him on trips to museums and let Sean hang out at his recording studio in Geneva.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393666/Madonna-Kayne-West-David-Beckham-lead-Twitter-tributes-David-Bowie.html"}
