{"authors":["Rachael Levy"],"date_download":"2018-10-30 22:23:23","date_modify":"2018-10-30 22:23:23","date_publish":"2016-12-14 00:00:00","description":"Valinor Management and Tricadia Capital join a group of funds that are dropping fees to woo investors.","filename":"data/vaneerConsumption/TricadiaValinorhedgefundscuttingfeestoinvestors.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_tricadia-valinor-hedge-funds-cutting-fees-to-investors-2016-12_1540938203.html","title":"Tricadia, Valinor hedge funds cutting fees to investors","title_page":"    Tricadia, Valinor hedge funds cutting fees to investors - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"flickr / Images Money Hedge funds have historically marketed themselves as a prestige investment, promising an exclusive group of investors higher returns in exchange for higher fees.\nThe higher returns haven't been there of late, though. Now the high fees are starting to budge, too.\nTricadia Capital Management has lowered its management fees for existing investors who opt into a new share class, according to a September investor letter viewed by Business Insider. The letter didn't specify the new fees.\nThe letter said that existing investors could add money to the fund at reduced minimum amounts up until March 1. For one class, for instance, existing investors can add just $5 million, as opposed to $25 million for new investors.\nMeanwhile, Valinor Management, a long-short equity Tiger fund launched by David Gallo, is dropping it management fee, according to a person familiar with the matter. A spokesman for Valinor declined to comment.\nBoth Tricadia and Valinor have seen their assets fall by nearly a quarter in recent months. They both managed $3.1 billion each as of mid-year, according to the Hedge Fund Intelligence Billion Dollar Club ranking.\nFor Tricadia, that was a 24% drop in assets from mid-2015, and for Valinor it was a 23% drop, according to the ranking.\nTricadia's flagship credit fund was down 1.7% through the end of November, according to a person familiar with the matter.\nHedge fund critics have long complained about high fees, which are traditionally priced at 2% management and 20% performance on assets. The fees are some of the highest in asset management. But as fund performance has slumped, investors have been less willing to pay the fees.\nOther big hedge funds have also reduced their charges in recent months.\nCaxton Associates, Och-Ziff Capital Management and Tudor Investment Corp have also all dropped their fees this year, Reuters reported. Moore Capital has also cut fees on its biggest fund, according to a Wall Street Journal report.","url":"https://www.businessinsider.com/tricadia-valinor-hedge-funds-cutting-fees-to-investors-2016-12"}
