{"authors":["Laurel Rosenhall","Dan Morain","Robbie Short"],"date_download":"2018-10-30 22:27:50","date_modify":"2018-10-30 22:27:50","date_publish":"2016-10-12 08:00:00","description":"In California’s Democrat-dominated statehouse, big business usually plays defense. Liberal groups—like labor unions and environmentalists—typically push","filename":"data/vaneerConsumption/TrioofcorporateinterestsspendbigurgingCalifornianstojustvoteno.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/IndustryTrioPhoto-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938470.html","title":"Trio of corporate interests spend big, urging Californians to just vote no","title_page":"Trio of corporate interests spend big, urging Californians to just vote no | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"In California’s Democrat-dominated statehouse, big business usually plays defense. Liberal groups—like labor unions and environmentalists—typically push for new bills, while corporate interests work to kill them. Legislators feel that push and pull.\nA similar dynamic is now at play on California’s ballot, where major industries are spending big bucks to defeat policies backed by progressives. On three key ballot measures, corporate opponents have collectively raised four times as much money as supporters. Now it’s voters in the middle of that push-and-pull—and voters who will determine which side wins.\nHere are three corporate industries pouring millions into “no” campaigns on California ballot measures:\nPharma:\nWith the rising price of medicine sparking national fury, the pharmaceutical industry marked a victorious year in the California Legislature.\nThe year began just after the announcement that Henry Perea, a powerful assemblyman who led a caucus of business-oriented Democrats, had quit mid-term to take a job with PhRMA, the industry’s lobbying association. Drug companies went on to score two big wins in Sacramento, beating back bills that would have compelled them to report the costs and profits of specialty drugs, and required health plans to disclose more details about medication prices.\nNow the industry’s fight turns to the ballot, where voters will decide the fate of Proposition 61. The measure would prohibit the state from paying more for drugs than the U.S. Department of Veterans Affairs, which pays the lowest prices prices in the nation.\nIt’s shaping up as the most expensive measure on the ballot, with the anti-Prop. 61 campaign raising nearly $87 million, almost entirely from the pharmaceutical industry. The “no” campaign argues the policy could wind up raising prices for the many consumers who don’t get their prescriptions through state health care plans. The nonpartisan Legislative Analyst said the fiscal impacts of the measure are impossible to predict.\nProp. 61 Money\nProp. 61 supporters have raised $14.5 million, much of it from the AIDS Healthcare Foundation. The measure’s most high-profile supporter is Vermont’s Democratic Sen. Bernie Sanders, whose losing presidential campaign fired up liberals as he castigated corporate America. Sanders is featured in a Prop. 61 commercial saying its passage would be a “real blow against this greedy industry that will reverberate all over America.”\nThough the initiative has his support, many progressive groups have shied away from Prop. 61. The California Labor Federation, which had backed the unsuccessful legislation to compel more information about drug pricing, did not take a position on Prop. 61. The California Democratic Party also is sitting this one out.\n“It’s very easy for the ‘yes’ side to rail against the pharmaceutical manufacturers and hold up Prop. 61 as the solution,” said Kathy Fairbanks, spokeswoman for the anti-Prop. 61 campaign.\n“The problem is that like a lot of initiatives, it’s filled with flaws and the devil is in the details.”\nTobacco:\nAfter several years of getting its way in Sacramento—extinguishing bills that would have upped regulation of electronic cigarettes and banned smoking at schools and beaches—the tobacco industry suffered some serious blows in the Legislature in 2016. Lawmakers passed six bills backed by health advocates aimed at reducing smoking and the illnesses it causes. They included bills to raise the smoking age from 18 to 21 and to impose tighter rules on vaping – and Gov. Jerry Brown signed all but one of them.\nThe only one Brown vetoed dealt with taxes: It would have allowed local governments to tax tobacco. In his veto message, Brown wrote that he was “reluctant to approve this measure in view of all the taxes being proposed for the 2016 ballot.”\nOne of those ballot-box taxes is Proposition 56, which would levy a $2 state tax on every pack of cigarettes. The roughly $1 billion generated by the tax annually would largely be devoted to the state’s Medi-Cal health care program for the poor.\nShow me the money: Prop. 56\nResearch shows that raising taxes is an effective way to reduce smoking. So it’s not surprising that cigarette companies are spending millions to defeat Prop. 56. As of Oct. 10th, the campaign against Prop. 56 had raised $66.3 million—almost all of it from tobacco companies Philip Morris and R.J. Reynolds.\nIn the Legislature, the anti-smoking bills were backed by health groups including the American Cancer Society and the American Lung Association. Those groups are also pushing Prop. 56, with funding from hospitals, doctors, labor unions and billionaire Tom Steyer. The “yes” side has so far raised $21.2 million.\nPlastic:\nThe Legislature began debating a statewide ban on plastic shopping bags several years ago, and for a long time the plastic industry won, killing bills that would have hurt its ability to do business in California.\nThe tides changed in 2014, though, when lawmakers approved a law banning flimsy plastic bags—the kind designed to be used just one time—and requiring stores to charge customers a dime for bags made of paper or heavier plastic. That’s when the plastic industry turned its attention to the ballot, gathering signatures to put the bag ban up for a referendum. Now, with Prop. 67, voters get to decide if they want to undo what the Legislature did.\nEnvironmental groups are supporting Prop. 67, arguing that plastic bags mar the landscape and harm wildlife. They say shoppers will adapt to bringing their own bags—a lifestyle change that helps the planet—and have raised $1.6 million, mostly from grocery stores that support having a policy that’s consistent across the state.\nPlastic bag makers have put $6.1 million into a two-prong attack on the Legislature’s bag ban. They are opposing Prop. 67 to overturn the ban, and supporting Prop. 65, which would take the 10-cent fee grocers charge for bags and shift it instead to an environmental fund. If both measures pass, the one with more votes goes into effect. If both measures fail, the plastic industry wins by defeating a statewide ban (though local bans would still be in effect).\nProp. 67 Money\nIndustry spokesman Phil Rozenski would not say how much plastic bag manufacturers stand to lose if California approves Prop. 67. The state represents about 10 percent of the industry’s sales nationwide, said Rozenski, who works for the Novolex packaging company and serves as spokesman for the industry’s political committee.\n“There will definitely be a fiscal impact,” he said. “We will lose domestic jobs.”\nThe bottom line for all three industries comes down to economic defense: Spending millions to defeat a California ballot measure is an investment in maintaining a business model in the nation’s biggest state.","url":"https://calmatters.org/articles/trio-of-industries-in-ballot-battle-to-preserve-their-bottom-lines/"}
