{"authors":[],"date_download":"2018-10-23 00:27:41","date_modify":"2018-10-23 00:27:41","date_publish":"2017-04-26 10:06:22","description":"Three suicide bombings rocked the northeast Nigerian city of Maiduguri on Wednesday, killing one civilian militia member and injuring several others,...","filename":"data/vaneerConsumption/TriplesuicideblastshitNigeriasMaidugurisources.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/10/wire-464151-1493197583-906_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446858_Triple-suicide-blasts-hit-Nigerias-Maiduguri-sources_1540254461.html","title":"Triple suicide blasts hit Nigeria's Maiduguri: sources","title_page":"Triple suicide blasts hit Nigeria's Maiduguri: sources | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Boko Haram insurgency has intensified suicide attacks in and around Maiduguri in recent months after losing captured territory to the military\nThree suicide bombings rocked the northeast Nigerian city of Maiduguri on Wednesday, killing one civilian militia member and injuring several others, security personnel told AFP.\nThe bombings came two days after multiple suicide attacks near the strategic city that killed four members of the civilian joint taskforce (JTF) and injured two others.\n\"There have been three suicide bombings in the city this morning in which one civilian JTF was killed and one other wounded,\" a senior military officer, who asked not to be identified, said.\nIn the first blast, a female suicide bomber struck near a sprawling camp for displaced people in the Muna Garage area of the city at about 4:20 am (0320 GMT).\nSoon afterwards, another woman exploded her device in the nearby Muna Kuwait area. Neither blast caused casualties.\n\"The general assumption is that the explosives on the two female bombers went off prematurely before reaching their targets,\" said Musa Ari, a JTF member.\n\"They were obviously trying to sneak into either the IDP (internally displaced people) camp or neighbouring communities under the cover of darkness.\"\nTwenty minutes later a male suicide bomber blew himself up in the Usmanti area of the city, killing a JTF member and injuring another, the officer said, an account supported by Ari.\nThe militia had tried to stop the bomber for questioning when they became suspicious of his movements, Ari said.\nNigeria's National Emergency Management Agency (NEMA) said 11 people in total were injured.\nThe Boko Haram insurgency has intensified suicide attacks in and around Maiduguri in recent months after losing captured territory to the military.\nOn March 22, four suicide blasts rocked the camp for the displaced in Muna, killing at least three and wounding 20 more.\nBombers -- most of them women and girls -- sneak into the city before dawn, often to attack mosques during morning prayers.\nJTF patrols usually stop them, and the attackers often detonate the explosives prematurely to avoid arrest.","url":"https://www.dailymail.co.uk/wires/afp/article-4446858/Triple-suicide-blasts-hit-Nigerias-Maiduguri-sources.html"}
