{"authors":[],"date_download":"2018-10-22 21:38:28","date_modify":"2018-10-22 21:38:28","date_publish":"2014-05-07 13:42:07","description":"The Dow ended with a triple-digit rise after a see-saw day of trading but the Nasdaq swam in red ink as investors cycled out of the technology sector.","filename":"data/vaneerConsumption/TripleDigitRiseforDowbutNasdaqisMiredintheRed.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_markets_triple-digit-rise-dow-nasdaq-mired-red-n99161_1540244308.html","title":"Triple-Digit Rise for Dow, but Nasdaq is Mired in the Red","title_page":"Triple-Digit Rise for Dow, but Nasdaq is Mired in the Red ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Dow ended up with a triple-digit rise after a see-saw day of trading on Wednesday but the Nasdaq swam in red ink as investors cycled out of momentum stocks in the technology sector.\nThe Dow Jones Industrial Average closed unofficially 117 points up and the S&P 500 rose 10 points as Federal Reserve Chair Janet Yellen's testimony did nothing to rattle investors and after Russian President Vladimir Putin signaled a willingness to talk on Ukraine. But the tech-heavy Nasdaq ended up 13 points in the red.\n\"We've got a healthy release of air from high-growth names,\" said Joe Peta, managing director at Novus.\n\"Even with the froth that has come out of the Nasdaq, it has still outperformed the S&P in the last year, so there is still more to go. Athenahealth and Twitter are still taking on water,\" said Peta of the companies, both of which declined for a second session. Athenahealth was hit after hedge fund manager David Einhorn said investors had vastly overvalued the software company. Shares of Twitter fell hard as a lock-up that had prevented insiders from selling expired on Tuesday.\n\"All the buzz is what technology company is going to blow up. Good news is taking the stairs up and bad news is taking the elevator down. It's a continuation of a trend we've had for six weeks. The Nasdaq is going to be under pressure until this growth-to-value rotation completes its course,\" said Art Hogan, chief market strategist at Wunderlich Securities.\nFederal Reserve Chair Yellen did little to change views of the timing of rate hikes ahead either. In congressional testimony, she said the labor market continues to improve, but remains at less-than-ideal levels.\nInvestors are \"watching for any hints of the timing of the first interest rate hike, but I certainly think Janet Yellen has learned her lesson in speaking off the cuff after that six-month comment that jilted the markets,\" said Hogan.\nThe strategist was referring to a March news conference at which Yellen told reporters the phrase \"considerable time\" in regards to how long the Fed was likely to keep benchmark interest rates near zero \"probably means something on the order or around six months or that type of thing.\"\nStocks and bonds stumbled in the aftermath of Yellen's words, which were viewed as suggesting rate hikes could come sooner than previously expected. But on Wednesday, Yellen refrained from stipulating any sort of a date, telling the Joint Economic Committee that \"there is no mechanical formula or timetable.\"\nAhead of the open, the Labor Department reported U.S. productivity fell at its fastest pace in a year in the first quarter as severe weather took its toll, leading to the largest gain in unit labor costs in more than a year. Productivity declined 1.7 percent in the first quarter, with the larger-than-expected decline the biggest since the first quarter of 2013.","url":"https://www.nbcnews.com/business/markets/triple-digit-rise-dow-nasdaq-mired-red-n99161"}
