{"authors":["Lauren Hirsch"],"date_download":"2018-10-30 21:54:57","date_modify":"2018-10-30 21:54:57","date_publish":"2016-12-15 00:00:00","description":"Trivago joins the ranks of other tech companies that have had a challenging year with IPOs.","filename":"data/vaneerConsumption/TrivagosIPOfallsbelowexpectations.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trivagos-ipo-reportedly-falls-below-expectations-2016-12_1540936497.html","title":"Trivago's IPO falls below expectations","title_page":"    Trivago's IPO reportedly falls below expectations - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"CEO of Expedia, Inc. Khosrowshahi attends Allen & Co Media Conference in Sun Valley Thomson Reuters\n(Reuters) - Trivago, the hotel search platform that is majority owned by U.S. online travel firm Expedia, raised $287 million in an initial public offering (IPO) on Thursday, far below expectations, according to a person familiar with the matter.\nThe underwhelming pricing of the Düsseldorf, Germany-based company's offering reflects some concerns among investors, in a challenging year for technology IPOs, that it may be too reliant on a few online travel companies for its revenue.\nTrivago priced 26.1 million American depository shares (ADS) on Thursday, fewer than its planned 28.5 million. At $11 an ADS, the pricing was also below its indicated range of $13 and $15, the source said, asking for anonymity become the details are not yet public.\nExpedia and Trivago did not immediately respond to a request for comment.\nThe downsized IPO comes on the tail-end of a difficult year for IPOs. Amid investor jitters and poor post-IPO performances, the total amount raised by IPOs is down 42 percent so far this year, according to Thomson Reuters data. Proceeds raised by internet software and service companies such as Trivago are $450 million, down 41 percent from $762 million this time last year.\nHotel booking platforms such as Trivago allow customers to search through hotel deals aggregated across a variety of online travel sites. It makes much of its money from online travel agencies, which pay for each click a customer makes on their hotel offers.\nYouTube/trivago\nMajority shareholder Expedia is one of its biggest customers, which along with brand affiliates such as Travelocity and Hotwire comprised 35 percent of its total revenue this year through the end of September. Priceline Group Inc and its affiliated brands such a Booking.com, contributed 43 percent of the company's revenue through the same time period.\nGlobal travel spend grew to an estimated $1.1 trillion in 2015, excluding Canada, Latin America and Eastern Europe, a compound annual growth rate of 4.7 percent since 2010, according to Phocuswright Data cited in Trivago's prospectus.\nStill, the industry has been challenged by the increasing number of hotels that encourage booking directly through their own websites.\nTrivago rival Tripadvisor Inc has seen its stock tumble in recent months, as its growth has slowed and it has sought to shift to a model that allows customers to book directly.\nExpedia paid 477 million euros ($531 million) in 2012 for a 62 percent stake in Trivago.\nTrivago will list on Friday on the Nasdaq under the ticker symbol \"TRVG.\"\nJPMorgan Securities LLC, Goldman Sachs & Co and Morgan Stanley & Co LLC are among the underwriters.\n(Editing by Sandra Maler and Lisa Shumaker)","url":"https://www.businessinsider.com/trivagos-ipo-reportedly-falls-below-expectations-2016-12"}
