{"authors":[],"date_download":"2018-10-30 14:15:59","date_modify":"2018-10-30 14:15:59","date_publish":"2018-10-30 11:00:00","description":"Four former Georgia high school players, including two brothers, were named SEC players of the week...","filename":"data/vaneerConsumption/TriviaGeorgiahighschoolswherefourSECplayersoftheweekplayed.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/AP_Top_News_Sports_Stories/2018/10/28/Images/ae53b3092304403fb38576a83da4c8a4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_high-school-sports_tri_7dfca5299ed3334daad65286cc5b78c0__1540908959.html","title":"Trivia: Georgia high schools where four SEC players of the week played","title_page":"Trivia: Georgia high schools where four SEC players of the week played","title_rss":"NULL","source_domain":"ajc.com","text":"Four former Georgia high school players, including two brothers, were named SEC players of the week for their games on Oct. 27. Jake Fromm of Georgia and Nick Fitzgerald of Mississippi State were co-offensive players of the week. Fitzgerald accounted for 329 yards of total offense and four touchdowns in a 28-13 victory over Texas A&M. Fromm passed for 240 yards and three touchdowns in a 36-17 win over Florida. D.J. Wonnum of South Carolina was the defensive lineman of the week for his performance, which included two sacks, in a 27-24 win over Tennessee. Younger brother Dylan Wonnum was the freshman of the week. He got his first career start in the Tennessee game. For what high schools did Fromm, Fitzgerald, Wonnum and Wonnum play? (Answer Wednesday)\nAnswer to Monday's question: Benedictine is the only military school to win a state championship in football in the GHSA. The Cadets won Class AA in 2014 and 2016.\nProduced by Georgia High School Football Daily, a free e-mail newsletter. To join the mailing list, click here.","url":"https://www.ajc.com/blog/high-school-sports/trivia-georgia-high-schools-where-four-sec-players-the-week-played/1fxvQ9VZeEANHbN35iP84L/"}
