{"authors":["Associated Press"],"date_download":"2018-10-23 04:36:58","date_modify":"2018-10-23 04:36:58","date_publish":"2016-01-28 20:44:15","description":"MARIETTA, Ga. (AP) — Police radio calls released Thursday provide a glimpse of the high-speed chase on a busy interstate that ended with the driver of a pick...","filename":"data/vaneerConsumption/TrooperdownOfficerscallforhelpafterchaseshootout.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:e83bc5a56dc14f83b889c4768a89d13d-2vdWmEltwXfba0ce28e632c812ff-618_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420673_Suspect-dies-trooper-wounded-Atlanta-area-chase_1540269418.html","title":"'Trooper down!' Officers call for help after chase, shootout","title_page":"'Trooper down!' Officers call for help after chase, shootout | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'Trooper down!' Officers call for help after chase, shootout\nMARIETTA, Ga. (AP) — Police radio calls released Thursday provide a glimpse of the high-speed chase on a busy interstate that ended with the driver of a pickup truck in a shootout with state troopers.\nOfficers scream \"shots fired, shots fired\" followed by \"trooper down,\" according to the calls obtained by The Associated Press.\nTroopers chased the pickup in and out of traffic at speeds of nearly 100 mph on Wednesday before it crashed into a civilian vehicle, authorities said. The driver got out with a handgun and started firing, wounding Trooper Jacob Fields in the leg and stomach, just below his bullet-proof vest, authorities said.\nFirst responders are shown working on a suspect that was shot following a chase on Interstate 75 in Cobb County. A state trooper and a suspect were shot Wednesday, Jan. 27, 2016, in a police chase in suburban Atlanta, the Georgia State Patrol said. The GSP said in an email that the trooper and suspect were shot in a pursuit on Interstate 75 in Marietta. (Johnny Edwards/Atlanta Journal-Constitution via AP)\nThe driver, 26-year-old Israel Vladimir Rodriguez, was hit by troopers' gunfire. Rodrigeuz died at a hospital.\nFields had chased the Chevrolet Silverado for about 10 miles with two other troopers and they tried a \"box-in maneuver\" to bring it to a slow stop, highway patrol Capt. Mark Perry said. The Silverado crashed. No one else was seriously hurt.\nLaw enforcement agencies have various policies regarding how they may pursue vehicles, and under what circumstances.\nAsked about the decision in this case, Perry told reporters Wednesday that \"the criteria for a chase is at officer discretion.\"\n\"This gentleman is the one who chose to flee,\" Perry said of the suspect. \"The trooper made the decision and this is something he will have to speak to at some point on why he chose to pursue at that point.\"\nIn Memphis, Tennessee, police officers started to pursue a car during a chase Wednesday but backed off, authorities said. The car eventually crashed as police officers were watching it and one of the suspects died in a shootout with police pursuing on foot. The officers were not hurt.\nIn the Georgia radio transmissions, a trooper tells the dispatcher that the pickup isn't stopping, and is \"in and out of traffic\" and failing to maintain its lane. The trooper says that the pickup is traveling 98 mph as the chase heads south down I-75, at times in the emergency lane. At one point, Fields pulls alongside the pickup.\n\"Southbound on Canton Road, I'm right beside him... He's a Hispanic male. He's on the cellphone with somebody, I can't tell. Will somebody get in front of him we can box him in.\"\nAbout four minutes later, the urgent calls for help come.\nFields was improving Thursday after a successful surgery. Fellow troopers are taking turns staying by his side at the hospital.\n\"But for the grace of God, it could have been any of those troopers who were there,\" Perry said.\nThe Georgia Bureau of Investigation is looking into the shooting and trying to figure out why Rodriguez fled in his pickup.\nBooking records from the Cobb County Sheriff's Office show Rodriguez had been arrested and jailed in 2008 for misdemeanor traffic charges of reckless driving, following another vehicle too closely and driving on a suspended or revoked license.\nThe records gave no other details surrounding Rodriguez's prior arrest, and they did not indicate how the courts ultimately dealt with the charges.\nFields, a 26-year-old trooper who has been on the force for three years, is expected to make a full recovery. He's from Jasper, Georgia, a small town in the foothills of the north Georgia mountains, about 45 miles north of the shootout.\nAll three troopers who exchanged fire with Rodriguez were placed on paid administrative leave during the investigation, standard procedure in such cases.\nThe southbound lanes were completely blocked off for several hours Wednesday with numerous police cars, fire trucks and an ambulance parked at the scene. Police diverted traffic off I-75 to clear the way for the investigation.\nMany truck drivers pulled over and parked on the shoulder of the interstate during the traffic jam. Dozens of big rigs remained on the side of the highway before dawn Thursday, a sight reminiscent of the 2014 snow and ice storm that led to motorists to abandon their vehicles.\n___\nAssociated Press writers Jonathan Landrum Jr. in Atlanta, Russ Bynum in Savannah, Georgia, and Adrian Sainz in Memphis, Tennessee, contributed to this report.\nThis photo released by the Georgia Department of Public Safety shows Trooper Jacob Fields. Fields and a driver who led him on a chase on a highway in suburban Atlanta both suffered gunshot wounds after exchanging fire Wednesday, Jan. 27, 2016, a Georgia State Patrol spokesman said. (Georgia Department of Public Safety via AP)\nPolice work at the scene of an officer-involved shooting on I-75 in Cobb County on Wednesday, Jan. 27, 2016. Georgia State Police say they were trying to stop a speeder following a 10-mile chase when the speeder struck another vehicle and exited his truck with a gun. A state trooper and a suspect were shot Wednesday, in a police chase in suburban Atlanta, the Georgia State Patrol said. The GSP said in an email that the trooper and suspect were shot in a pursuit on Interstate 75 in Marietta. (Ben Gray/Atlanta Journal-Constitution via AP)\nGeorgia State Police Cpt. Mark Perry briefs the media outside of WellStar Kennestone Hospital following an officer-involved shooting in which the suspect and an officer were both shot on I-75 in Cobb County on Wednesday, Jan. 27, 2016. A state trooper and a suspect were shot Wednesday, in a police chase in suburban Atlanta, the Georgia State Patrol said. The GSP said in an email that the trooper and suspect were shot in a pursuit on Interstate 75 in Marietta. (Ben Gray/Atlanta Journal-Constitution via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3420673/Suspect-dies-trooper-wounded-Atlanta-area-chase.html"}
