{"authors":["Associated Press"],"date_download":"2018-10-23 04:43:46","date_modify":"2018-10-23 04:43:46","date_publish":"2017-04-26 16:20:51","description":"LONDON (AP) - Joey Barton has been suspended from all football activity for 18 months with immediate effect after the Burnley midfielder admitted to a...","filename":"data/vaneerConsumption/TroubledcareerofbannedsoccerplayerJoeyBarton.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448300_Troubled-career-banned-soccer-player-Joey-Barton_1540269826.html","title":"Troubled career of banned soccer player Joey Barton","title_page":"Troubled career of banned soccer player Joey Barton | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LONDON (AP) - Joey Barton has been suspended from all football activity for 18 months with immediate effect after the Burnley midfielder admitted to a Football Association misconduct charge related to betting.\nIt is the latest incident in the 34-year-old Barton's troubled career:\nDec. 2004: While at Manchester City, Barton stubs lit cigar in the eye of teammate Jamie Tandy during club Christmas party. Fined six weeks' wages by City.\nJuly 2005: Involved in altercation with a 15-year-old Everton fan at Manchester City's team hotel in Bangkok during a pre-season tour. Fined eight weeks' wages by City after being found guilty of gross misconduct.\nSept. 2006: Drops his shorts in the direction of Everton fans following City's 1-1 draw at Everton.\nMay 2007: Suspended by City after training-ground altercation with Ousmane Dabo, which leaves his teammate needing hospital treatment. Charged with assault and receives a four-month suspended jail sentence. Also punished by FA with a 12-match ban, six matches of which are suspended.\nMay 2008: Jailed for six months after admitting common assault and affray during an incident in Liverpool the previous year.\nNov. 2010: While playing for Newcastle, punches Blackburn winger Morten Gamst Pedersen during a game at St James' Park. Accepts an FA charge and is banned for three games.\nMay 2012: While playing for Queens Park Rangers, is sent off for elbowing Carlos Tevez on the final day of the season at former club Manchester City. Also knees Sergio Aguero, and attempts to headbutt Vincent Kompany before being ushered off the field. Later banned for 12 matches.\nSept. 2016: Shortly after joining Rangers, is banished from the Glasgow club's training ground following an alleged altercation with teammate Andy Halliday.\nApril 2017: Banned from soccer for 18 months after placing 1,260 bets on matches between 2006 and 2016.","url":"https://www.dailymail.co.uk/wires/ap/article-4448300/Troubled-career-banned-soccer-player-Joey-Barton.html"}
