{"authors":[],"date_download":"2018-10-30 18:00:30","date_modify":"2018-10-30 18:00:30","date_publish":"2017-04-25 14:21:00","description":"On Tuesday morning, the High Museum of Art announced the acquisition of 54 works of folk art from th...","filename":"data/vaneerConsumption/TroveofselftaughtartworkacquiredbyHighMuseum.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/25/Images/newsEngin.18501582_Dial-Birmingham-News-1997-High.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_arts--theater_3f3f0fe5135f62f561e27bc173582999__1540922430.html","title":"Trove of self-taught artwork acquired by High Museum","title_page":"High Museum acquires more works by Thornton Dial, Ronald Lockett","title_rss":"NULL","source_domain":"ajc.com","text":"On Tuesday morning, the High Museum of Art announced the acquisition of 54 works of folk art from the Souls Grown Deep Foundation, including 13 works by the late Thornton Dial.\nDescribed as a combination purchase and gift, the new works are by 33 artists, all African-American and all from the South. The acquisition includes 11 quilts from the women of Gee’s Bend, Ala., tripling the museum’s holdings of these creations.\nA quilt made by Arlonzia Pettway called “Birds in the Air” is among the Gee’s Bend quilts that have been acquired by the High Museum. It is among 54 new works of folk and self-taught art that have become part of the High’s permanent collection. CONTRIBUTED BY HIGH MUSEUM (The Atlanta Journal-Constitution)\nIt’s one of the most significant additions to the High’s folk and self-taught art department since it was established in 1994.\n“This is art that breaks boundaries and defies expectations,” said Katherine Jentleson, curator of folk and self-taught art at the High. “The force of their work is overcoming the kinds of prejudice we once had about who can be an artist.”\nRELATED: High Museum’s ‘Cross Country’ is a sweeping view of America\nRELATED: Children’s book author-artist Ashley Bryan’s works come to High Museum\nRELATED: Colorblind artist Daniel Arsham explores modern artifacts in bold hues\nIn addition to the Gee’s Bend quilts and the Thornton Dial work, the acquisition includes:\nThree found-object sculptures by Atlanta-based artist and musician Lonnie Holley, including “What’s on a Pedestal Today” (1990) and “Not Olympic Rings” (1994).\nSeveral works by Ronald Lockett, including “Civil Rights Marchers” (1988) and “Once Something Has Lived It Can Never Really Die” (1996), which complement the High’s existing holdings of Lockett’s cut-metal drawings and deer paintings.\nRare work by Atlanta artist Eldren Bailey, who began decorating his property in the Mechanicsville neighborhood with concrete sculpture in 1945. Bailey’s “Pyramid” (1970s) is a concrete sculpture embedded with costume jewelry, pennies and a Freemason’s pin.\nSnackable video of 7 must see art Works at High Museum in 2017\nMany of these artists were brought to national attention by William S. Arnett, who began collecting their work in the 1980s. He contributed much of his collection to the Atlanta-based Souls Grown Deep Foundation when it was established in 2010.\nThe new artworks represent important moments in contemporary art. A welded construction by Dial called “Turkey Tower” was one of the first works of art that convinced Arnett to focus his attention on Dial.\nA mixed media work by Thornton Dial called “Looking Out the Windows” was created after he visited the site of the World Trade Center and reflected on the 9/11 attack. It is among the 54 works of art acquired by the High Museum in a major addition to its folk art collection announced Tuesday. CONTRIBUTED BY HIGH MUSEUM (The Atlanta Journal-Constitution)\nBefore this acquisition, the High already had the largest public collection of Dial’s work, and in 2012 was among several museums to present “Hard Truths,” a sweeping review of Dial’s career. The new acquisition nearly doubles that collection, and expands it to cover almost 40 years of the artist’s output. “Now we will have the greatest comprehensive display of his works of any institution,” said Jentleson. “We haven’t invested like this in an artist in well over a decade. There was never any question that Dial should be that artist.”\nThe High began ramping up its outsider art holdings in 2014, after receiving a $2.5 million gift from Dan and Merrie Boone, which endowed a position for a full-time folk and self-taught art curator. Jentleson joined the High the next year to fill that position. In the past two years, the High has acquired more than 100 works by folk artists, expanding its collection to more than 1,000 items.\nRELATED: What you need to know before visiting Atlanta’s High Museum of Art\nMaxwell Anderson, president of the Souls Grown Deep Foundation and former Atlantan, said the High was a natural ally in the foundation’s effort to create greater exposure for artists of color who live throughout the South. “We’re looking to change American art history,” said Anderson, adding wryly, “it’s just a modest aspiration.”\nWhen Anderson became president of the foundation last year, he began conversations with Rand Suffolk, the new director of the High, about a possible acquisition.\nKatherine Jentleson, curator of folk and self-taught art at the High Museum, said the new acquisition will be a \"defining moment\" in the history of outsider art. Photo by Travis Dove (Bo Emerson)\nObjects from the new acquisition won’t go on display until 2018, when the High plans a reinstallation of its permanent collection. The house-cleaning will affect all seven curatorial departments and will add 30 percent more space to folk and self-taught art, Jentleson said.\n“We want to hold this new collection for this big moment, when we will be able to give the works the impact they deserve,” she said.","url":"https://www.ajc.com/entertainment/arts--theater/trove-self-taught-artwork-acquired-high-museum/5BxwQsLK70wJaDt37hmHaK/"}
