{"authors":["Akin Oyedele"],"date_download":"2018-10-31 00:36:47","date_modify":"2018-10-31 00:36:47","date_publish":"2018-07-07 00:00:00","description":"BI PRIME: There aren't enough truck drivers to move the world's cargo around. According to a team of analysts at Morgan Stanley, costs across the industry are likely to continue rising and could reach a breaking point where shippers explore other options.","filename":"data/vaneerConsumption/Truckdrivershortagetohikecostsforcarriersshippersconsumers.json","image_url":"https://amp.businessinsider.com/images/5ae9e6db19ee861d008b47ab-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_truck-driver-shortage-costs-for-carriers-shippers-consumers-2018-7_1540946207.html","title":"Truck driver shortage to hike costs for carriers, shippers, consumers","title_page":"    Truck driver shortage to hike costs for carriers, shippers, consumers - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Trucks seen January 25 in Chicago. Near-record levels of freight volume driven by an improving economy and new federal safety regulations have contributed to a nationwide truck shortage. Scott Olson/Getty\nThere aren't enough truck drivers to move the world's cargo around.\nThe US, Germany, and Japan face a shortfall of 565,000 drivers — about 7% of the driver population in the US and nearly one-third in the other two countries — according to data compiled by Morgan Stanley.\nThe trucking industry is an essential pillar of the US economy because it's responsible for moving roughly 75% of all freight. But a shortage is poised to worsen for reasons including driver retirement and new regulations. In the US, for example, the electronic-logging device mandate imposes an 11-hour cap on drivers' work days and is limiting their productivity, Business Insider's Rachel Premack reported.\n\"Unaddressed, this shortfall of drivers will lead to rising costs for trucking carriers, shippers and eventually consumers,\" a team of analysts at Morgan Stanley said in a research note on Sunday.\nMorgan Stanley\n\"While the trucking industry globally is relatively fragmented and historically has not had too much pricing power, the scope of the driver shortage problem is raising the cost tide for all players and thereby driving effective pass-through of the cost inflation.\"\nIn other words, this driver shortage is so severe that it could lead to cost increases unlike any we're used to.\nMorgan Stanley\nThe outcome that Morgan Stanley considers most likely — its base case — is already unfolding, in that freight rates are increasing. The firm estimates that trucking carriers would adjust driver rates roughly equal to how much more their customers are paying.\nIn this scenario, the companies with the most cash are best positioned for themselves and their investors. They include J.B. Hunt Transport Services, Schneider National, and Werner Enterprises.\nMorgan Stanley forecasts, however, that if prices rise by 10% or more for longer than two years, shippers will push back by asking trucking companies to absorb more of the cost increases and threatening to switch to other transportation options.\nThat could lead to what Morgan Stanley considers the worst-case scenario, where drivers are earning more but their employers struggle to stay profitable because of rising costs. Longer term, it could force larger shippers to invest in logistics, which would be yet another big expense.\nThe best-case scenario would be a win-win for the trucking industry and those that rely on it. But it could take a while to materialize.\n\"We assume technology provides a viable and sustainable solution to the driver shortage problem,\" the team at Morgan Stanley said. If it all works out, TuSimple, the maker of self-driving trucks, would start selling by 2020 and help truck carriers cut about 10% in total costs over the first five years, Morgan Stanley estimated.\nAnalysts at Bernstein estimate that autonomous trucks would net the industry $100 billion to $125 billion in savings on driver pay.","url":"https://www.businessinsider.com/truck-driver-shortage-costs-for-carriers-shippers-consumers-2018-7"}
