{"authors":["Anton Nilsson For Dailymail.Com"],"date_download":"2018-10-23 03:31:41","date_modify":"2018-10-23 03:31:41","date_publish":"2016-01-11 16:12:26","description":"A mother driving her two kids to school was inches from death after the axle of a passing truck flew through the air and hit the windshield of her SUV in Pennsylvania on Wednesday.","filename":"data/vaneerConsumption/TruckaxlecrashesintoPennsylvaniawomanswindshieldonhighway.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300CCB9900000578-0-image-a-37_1452529251797.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394165_Mother-inches-death-truck-axle-crashes-windshield-Pennsylvania-highway_1540265501.html","title":"Truck axle crashes into Pennsylvania woman's windshield on highway","title_page":"Truck axle crashes into Pennsylvania woman's windshield on highway | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A mother driving her two kids to school was inches from death after the axle of a passing truck flew through the air and hit the windshield of her SUV traveling on a highway in Pennsylvania.\nNobody was hurt in the accident on Wednesday, according to Scranton television station WNEP.\nThe mother, who was not been identified, told WNEP that she was rattled by the incident, but happy that everyone is well.\nPhotographs posted to Facebook by a local towing company show how close the axle came to injuring the driver.\nScroll down for video\nThe axle and tire of a pickup truck was sent flying through the air on a Pennsylvania highway on Wednesday, crashing into the windshield of an SUV\nThe driver said that because her teenage son had been driving her car the previous night, her seat was positioned farther back than usual.\nThe extra inches may have saved her life, the woman said.\n'That's something you see in a movie. That's like Final Destination. Actually, that's exactly what I said. She's lucky, lucky to be alive,' said David Duchnik of Duchnik's towing, who was assigned to tow the woman's car from the crash site on the Casey Highway in Lackawanna County, according to WNEP.\nThe driver of the SUV, a mother taking two of her kids to school, was inches from death in the freak accident\n'I've seen a lot, a lot of good stuff, a lot of really bad stuff, but I've never seen something like this. This could have been a real, real tragedy,' Duchnik told WNEP.\nThe flying tire came off of a 1998 Ford pickup truck moving in the opposite lane. It is unclear what caused the accident, which left the truck driver uninjured.\nState police could cite that driver, WNEP reports.","url":"https://www.dailymail.co.uk/news/article-3394165/Mother-inches-death-truck-axle-crashes-windshield-Pennsylvania-highway.html"}
