{"authors":["Wolf Richter","Wolf Street"],"date_download":"2018-10-31 00:25:57","date_modify":"2018-10-31 00:25:57","date_publish":"2018-07-09 00:00:00","description":"Fleets are desperate for more equipment, but trucks are in short supply due to the supplier constraints. Meanwhile, demand for shipments that trucking companies are trying to respond to has been enormous. But the transportation crisis will work itself out over time.","filename":"data/vaneerConsumption/Truckingindustrycapacitycrisisjustpartofthebusinesscycle.json","image_url":"https://amp.businessinsider.com/images/5b0584e01ae6621b008b4579-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trucking-industry-capacity-crisis-just-part-of-the-business-cycle-2018-7_1540945557.html","title":"Trucking industry capacity crisis: just part of the business cycle","title_page":"    Trucking industry capacity crisis: just part of the business cycle - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Orders for heavy trucks that haul trailers loaded with anything from junk food to oil-field equipment across the US skyrocketed 141% in June compared to a year ago, to 41,800 orders, making it the highest June ever recorded, according to transportation data provider FTR. For the first six months this year, order volume of Class 8 trucks surged nearly 90% from a year ago to a phenomenal 235,050 units.\nThe chart below shows the percentage change of Class 8 orders compared to the same month a year earlier. Note the transportation recession when orders plunged, and truck makers were responding with layoffs. Orders began to rise in early 2017, including the year-over-year spike of 158% in October 2017, compared to the terrible October a year earlier:\nWolf Street\nTruck manufacturers \"cannot keep up with demand due to component shortfalls,\" FTR reported. \"The backlogs are being moved out further, which is pushing fleets to get orders in sooner rather than later so they can find a build slot.\"\nThis chart of Class 8 truck orders in units also shows that orders are seasonal, that month-to-month declines starting in March are typical, and that June is typically a weak month. But not this year:\nWolf Street\nFTR points out how the circularity of rising orders and subsequent delays getting orders filled leads to even more orders and even greater delays - which is part of the boom-and-bust cycle of the industry:\n\"There is an enormous demand for trucks due to burgeoning freight growth and extremely tight industry capacity. However, supply is severely constrained because OEM suppliers cannot provide the needed parts and components required to build more trucks fast enough. This bottleneck is causing fleets to get more orders in the backlog in hopes of getting more trucks as soon as they are available.\" \"Fleets are desperate for more equipment, but trucks are in short supply due to the supplier constraints. This is creating a surge in orders as fleets react to this unusual situation. If OEMs were producing at capacity, the truck build this year could have been as high as 360,000 units. Orders for the last twelve months have now reached 411,000, so there are some excess orders in the backlog.\"\nThe boom in shipments that trucking companies are trying to respond to has been enormous. Soaring freight rates, higher diesel prices, and blistering shipping volume pushed transportation spending by shippers up by 17.3% in May from a year ago, the 8th double-digit year-over-year increase in a row (Cass Freight Index). The Cass Truckload Linehaul Index, which tracks per-mile full-truckload pricing but does not include fuel or fuel surcharges, jumped 9.0% in May, the largest year-over-year increase in the data going back to 2005.\nAnd manufacturers are complaining about it. The Manufacturing ISM Report for June, released earlier this week, which came in with strong readings, quoted some participants in the panel, including these:\n\"Strong economic growth continues to put pressure/strain on capacity, lead time, availability and pricing across a broadening array of commodities and components.\" (Computer & Electronic Products) \"Electronic component supply issues continue to disrupt production.\" (Transportation Equipment) \"Transportation costs are going through the roof right now, which definitely impacts the decisions we're making with regard to quantities we're bringing in versus truckload and LTL.\" (Furniture & Related Products)\nAnd these - the winners during the Transportation Recession when their costs plunged - are the losers in the transportation boom: desperate shippers that are facing soaring shipping costs and long delays.\nThis is reflected in the FTR Shippers Conditions Index (SCI), which covers four conditions that impact shippers using trucks and rail: freight demand, freight rates, fleet capacity, and fuel price. The SCI has been solidly negative since the end of the Transportation Recession and has deteriorated sharply over the past nine months. The April index, released two days ago, dropped to -13.4, \"signifying that there has not been capacity or rate relief for shippers in the current strong freight environment\":\nWolf Street\nBut in this cyclical business with all kinds of ebbs and flows, the transportation \"capacity crisis\" will work itself out over time.\n\"April may be the nadir in this cycle as conditions likely will not get significantly worse for shippers over the balance of the year,\" according to FTR. \"Overall year-over-year rate growth is close to near-term peak. Shippers could see some stabilization in 2019 as more capacity comes on line.\"\n\"Truckstop.com's Market Demand Index for the past four weeks remains nearly double 2017,\" said Jonathan Starks, COO at FTR. \"The spot market is producing record rates every few weeks, though this trend will soon hit its peak.\"\n\"Shippers facing significant increases in rates for truck and rail intermodal movements have not yet seen relief,\" said Todd Tranausky, Senior Transportation Analyst at FTR. \"However, record truck orders should begin hitting the market in the second half of the year, and we are closely watching the driver situation, which will determine if shippers see improvements as the trucks become available.\"","url":"https://www.businessinsider.com/trucking-industry-capacity-crisis-just-part-of-the-business-cycle-2018-7"}
