{"authors":["Meg Kelly"],"date_download":"2018-10-23 05:48:54","date_modify":"2018-10-23 05:48:54","date_publish":"2017-01-29 00:00:00","description":"President Trump has loosely followed former New York City Mayor Michael Bloomberg's model for managing his wealth while in office, but the risk isn't the same.","filename":"data/vaneerConsumption/TrumpFollowsMayorBloombergsEthicsStepsCriticsCallThatInadequate.json","image_url":"https://media.npr.org/assets/img/2017/01/27/gettyimages-602350044_wide-da75f6b90494c3f2997209d6823c5216cb1a39bd.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2017_01_29_511635305_trump-follows-mayor-bloombergs-ethics-steps-critics-call-that-inadequate_1540273734.html","title":"Trump Follows Mayor Bloomberg's Ethics Steps; Critics Call That Inadequate","title_page":"Trump Follows Michael Bloomberg, Former New York Mayor, In Ethics Steps : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Trump Follows Mayor Bloomberg's Ethics Steps; Critics Call That Inadequate\nEnlarge this image toggle caption Brendan Smialowski/AFP/Getty Images Brendan Smialowski/AFP/Getty Images\nPresident Trump isn't the first wealthy New York businessman to hold a high public office.\nNelson Rockefeller, an heir to one of America's greatest fortunes, served as the state's governor in the 1960s, and then vice president in the mid-1970s in the Ford administration.\nMore recently, billionaire Michael Bloomberg served as mayor of New York City, where he held office for 12 years. To avoid conflicts of interest, Bloomberg cobbled together a plan for disentangling his private interests from his public office — but without surrendering ownership of his business empire.\nNow Trump appears to be trying to follow a similar path.\nEthics experts say that using the Bloomberg template won't be good enough because Trump's two roles — one as president and the other as business owner — will come into perpetual conflict, with more serious consequences that could reach far beyond just one city.\nStill, the new president may see many similarities between his own situation and Bloomberg's. For example, Bloomberg, who governed as an independent after his 2001 election, repeatedly said he did not consider himself a politician. Instead, he would say he was a businessman spending some time in politics. Bloomberg saw his lack of political experience and business background as a strength — believing it gave him more credibility with some of New York's most powerful companies.\nDuring his second-term run, Bloomberg told New York Magazine, \"Most of the guys that run these big firms, they're my age. And because of my company, there's a credibility. They respect somebody who's not a politician, who's trying to get things done.\"\nTrump's campaign rallying cry was that the country needs someone who can \"make good deals.\"\nLike Trump, when Bloomberg was elected, he faced many questions about how he would separate himself from his sprawling business empire, known as Bloomberg L.P. That firm did deals with many of the wealthiest and most powerful companies in New York City — including investment banks like Goldman Sachs and Merrill Lynch.\nTo address some of his conflicts, Bloomberg resigned from the boards of many cultural institutions. But much like Trump, he refused to put his ownership stake of his namesake company into a blind trust. At the time, his stake was worth around $5 billion, which, according to Politico, is about the same as Trump's estimation of his current net worth.\nBloomberg recused himself from day-to-day decision making, as Trump has promised to do. But Bloomberg's managers were not relatives, whereas Trump has appointed his two sons to run his business. Bloomberg, in accordance with the city's Conflicts of Interest Board (COIB) ruling, reserved his right to participate in any talks about selling the company.\nThat is where the similarity between the two billionaires ends. Although critics suggest Bloomberg was not truly successful in preventing conflicts between his business interests and his mayoral role, he was able to satisfy the COIB requirements without divesting.\nIn contrast, Trump is not following recommendations from the U.S. Office of Government Ethics, which works like the COIB, but on the federal level. OGE publicly asked the new president to divest, or at least put his assets in a blind trust not ruled by a family member. Trump says he will not do that, even though presidents traditionally follow OGE guidance.\nOGE Director Walter Shaub has been highly critical of Trump's plan. Speaking at the Brookings Institution earlier this month, Shaub denounced it as inadequate and meaningless, saying: \"The plan the president-elect has announced doesn't meet the standards of the best of his nominees are meeting and that every president in the last four decades has met.\"\nSo the bottom line is: Even if Trump follows Bloomberg's precedent for managing assets, he is rejecting the recommendations of the ethics officials who guide his public office. That may open up Trump to far more criticism than Bloomberg ever faced.","url":"https://www.npr.org/2017/01/29/511635305/trump-follows-mayor-bloombergs-ethics-steps-critics-call-that-inadequate"}
