{"authors":["Associated Press"],"date_download":"2018-10-23 05:24:07","date_modify":"2018-10-23 05:24:07","date_publish":"2017-03-16 16:14:57","description":"WASHINGTON (AP) - In the latest outreach effort following a contentious campaign, top Trump administration officials - as well as first daughter Ivanka Trump...","filename":"data/vaneerConsumption/TrumpaidesdaughtermeetwithHispanicbusinessowners.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320916_Ivanka-Trump-meets-Latina-business-owners_1540272247.html","title":"Trump aides, daughter, meet with Hispanic business owners","title_page":"Trump aides, daughter, meet with Hispanic business owners | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - In the latest outreach effort following a contentious campaign, top Trump administration officials - as well as first daughter Ivanka Trump - met Thursday with Hispanic business leaders.\nUnderscoring her unusual role working outside the administration, Ivanka Trump attended a round-table discussion Thursday morning with Hispanic women business owners in Washington.\nLater, White House officials, including chief of staff Reince Priebus, held a meeting with other Hispanic business leaders, focused on jobs, the economy and access to capital.\nThe meetings were organized by the U.S. Hispanic Chamber of Commerce, whose president, Javier Palomarez, slammed Donald Trump during the presidential campaign, calling him a buffoon, among other slights. He has since joined the president's National Diversity Coalition and says he's open to working with the president on issues they agree on.\n\"The reality of it is,\" Palomarez said, \"I'd much rather campaign from the inside than complain from the outside.\"\nTrump has been eyed warily by the Hispanic community since the beginning of his presidential campaign, when he claimed Mexico was sending its criminals over the border and railed against illegal immigration. Nonetheless, Trump won about 28 percent of the Latino vote - a similar share to Mitt Romney in 2012, according to exit polls.\n\"My representatives had a great meeting w/ the Hispanic Chamber of Commerce at the WH today,\" the president tweeted after the meetings. \"Look forward to tremendous growth & future mtgs!\"\nPalomarez said Ivanka Trump, who has no official role in the administration, spent an hour and a half with the women business owners, talking about issues such as entrepreneurship and science education.\n\"She made it clear that she has a passion around empowering women,\" Palomarez said in an interview between the two meetings, adding that the topics of Trump's proposed border wall and his crackdown on people living in the U.S. illegally had not been raised.\n\"There will be time and the circumstances to do that,\" said Palomarez, adding: \"They're not done deals. The negotiation, the conversation continues.\"\nTrump said Thursday night at a rally in Nashville that his wall is \"way ahead of schedule,\" and he has signed orders making it easier to deport people living in the U.S. illegally.","url":"https://www.dailymail.co.uk/wires/ap/article-4320916/Ivanka-Trump-meets-Latina-business-owners.html"}
