{"authors":["Ben Christopher","Julie Cart","David Gorn","Felicia Mello"],"date_download":"2018-10-30 23:08:01","date_modify":"2018-10-30 23:08:01","date_publish":"2017-04-27 16:54:00","description":"President Trump is rounding out his first 100 days in office with an ambitious tax reform proposal that threatens to nix a provision that Californians particularly enjoy—axing the state and local tax deduction.","filename":"data/vaneerConsumption/TrumptaxreformproposalcouldcostCaliforniansacherishedloophole.json","image_url":"https://calmatters.org/wp-content/uploads/favicon-150x150.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_trump_california__1540940881.html","title":"Trump tax reform proposal could cost Californians a cherished loophole","title_page":"Trump tax reform proposal could cost Californians a cherished loophole | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"President Trump is rounding out his first 100 days in office with an ambitious tax reform proposal that threatens to nix a provision that Californians particularly enjoy.\nYesterday, the White House unveiled a long-awaited blueprint to restructure the tax code, a plan that is short on detail, but big on bold proposals. Those proposals include doubling the standard deduction and slashing the tax rate on corporate income and capital gains. To pay for these cuts, the administration plans to plug up some of the tax code’s most expensive loopholes.\nBut axing the state and local tax deduction, one of the largest tax expenditures on Trump’s chopping block, would hit more prosperous Californians. In fact, in the words of the Sacramento Bee, it would “hurt California more than almost any other state.”\nIRS tax data indicates that of the nearly $516 billion that American taxpayers deducted in state and local taxes, Californians claimed $101 billion (or 19.6 percent).\nThe state and local deduction allows people who itemize on their tax forms to write off some of their payments made to state and local governments. Conservatives have long characterized the deduction as a giveaway to blue states where lawmakers can raise taxes without paying the commensurate political price.\nIt also comes at a big cost to the federal government. The federal Joint Committee on Taxation estimates that closing the loophole would bring in an average of $100 billion in extra federal revenue each year.\nBut although the deduction may be beloved by blue states, it disproportionately benefits high-earners. That’s both because low-income filers tend not to itemize their deductions, and because the wealthy typically pay higher state taxes—particularly in California with its progressive rate structure. Californians earning over $100,000 take home 83 percent of the deduction, despite making up 18 percent of taxpayers statewide.\nWhich countries benefit the most from the state and local tax deduction? No Description\nWhile the average taxpayer in the less affluent, inland counties of Modoc, Imperial, and Tehama claim an average of around $1,500 from the state and local deduction, the average Marin taxpayer reduces their taxable income by $17,000.\nStill, rich California need not fret. If enacted—and we’re still a long way from that—President Trump’s tax plan looks like a plum deal for most high earners.","url":"https://calmatters.org/articles/trump_california/trump-tax-reform-proposal-cost-californians-cherished-loophole/"}
