{"authors":["Linette Lopez"],"date_download":"2018-10-30 21:39:55","date_modify":"2018-10-30 21:39:55","date_publish":"2016-12-19 00:00:00","description":"Companies that borrow heavily and charge the interest on that debt to their American subsidiaries can lower their tax bill.","filename":"data/vaneerConsumption/Trumpstaxplancouldkneecapabunchofhugecompanies.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trumps-tax-plan-could-knee-cap-a-bunch-of-huge-companies-2016-12_1540935595.html","title":"Trump's tax plan could knee-cap a bunch of huge companies","title_page":"    Trump's tax plan could knee-cap a bunch of huge companies - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"President-elect Donald Trumpwith House Speaker Paul Ryan of Wis. after a meeting in the Speaker's office on Capitol Hill in Washington, Thursday, Nov. 10, 2016. AP Photo/Alex Brandon The stock market has staged a glorious rally since Donald Trump won the US presidential election last month, and analyst after analyst says that it is, in part, because of the promise of a lowered tax rate on corporations.\nTrump and House Speaker Paul Ryan (R-WI) both have plans that would lower the corporate tax rate from 35% (where it has been sitting since John F Kennedy was president) to 15% (Trump's plan) or 20% (Ryan's).\nThis sounds wonderful, but there's some fine print. Not all companies are going to have their taxes lowered.\nDepending on a couple factors, some companies could see their tax rate shoot up. One of those companies is former Wall Street darling and current Wall Street headache, Valeant Pharmaceuticals. We'll get to that in a moment.\nIdeologically, Ryan's plan has always intended to ensure that big corporations and small businesses pay the same rate. To do that, he wants to eliminate a bunch of special preferences and loopholes, like enhanced deductions and tax credits, that big companies get in order to pay for the lowered rate.\nTrump's plan includes a bunch of the same changes.\nYou're special\nThe special preference we're talking about here is the deduction for net interest on future loans. Its existence makes it super attractive for companies to do inversions — that is to say, technically move their residence out of the United States.\nOnce a company moves, of course, it pays a lower tax rate. Then, quite often, it places its foreign debt into a US held entity. That debt can then be deducted from US profits through the net interest deduction.\nThe practice is called earnings stripping.\nThe Senate had a hearing about this last year, and Jim Koch, the founder of Boston Beer Company (they make Sam Adams) explained the debacle really well [emphasis ours]:\nIt is not uncommon for me to receive visits from investment bankers interested in facilitating the sale or merger of Boston Beer Company to foreign ownership. One of the principal financial benefits of such transaction is the ability to reduce the tax rate we currently pay. We are vulnerable because we currently report all of our income in the United States and pay a tax rate of about 38% on that income.\nUnder foreign ownership, that rate, I am told, would be reduced to the range of 25-30% through various practices like expatriation of intellectual property,earnings stripping and strategic use of debt, offshoring of services, and transfer pricing.\nThat means that a dollar of pre-tax earnings is worth about sixty two cents under American ownership but about seventy two cents under foreign ownership. To put it another way, Boston Beer Company is worth 16% more to a foreign owner simply because of the current US corporate tax structure.\nThe Obama Administration, after failing to close this loophole through policy, tried to tackle it through the Treasury by creating a rule that classifies a portion of debt held in US companies as equity.\nThe problem is, Obama's rule will only bring in between between $461 million and $600 million annually from 6,300 companies. That means it collects less than $100,000 per company for only the top 0.01%.\nThis is chump change. Koch told Congress that \"companies are saving millions or even hundreds of million of dollars through complex tax planning every year.\"\nAnd more importantly, it's not a solution, especially not if the overall tax rate is going to be lowered by 15%.\n\"This sets up the possibility that further offsets will be required,\" wrote analysts at Morgan Stanley in a recent note, \"meaning investors who benefit from tax preference items should not be complacent... Consider, for example, that limits on interest deductibility may already be in play, given that limiting interest deductibility is the third largest corporate deduction at $455 billion.\"\nI repeat, this deduction costs us $455 billion.\nThe Trump/Ryan plan, however, would write the elimination (or at least significant limitation) of this deduction into code. That's where certain kinds of companies will start feeling the pain. The trade off here is that foreign profits wouldn't be taxed at all, removing the incentive for companies to horde cash overseas.\nStripping for cash\nSo, you may be asking yourself — what kind of company would get crushed by this kind of policy change?\nI submit you the multi-billion dollar international drugmaker Valeant Pharmaceuticals. Years ago the company did a corporate inversion by acquiring Canada's Biovail in order to pay a lower tax rate. It also has subsidiaries in Ireland, Luxembourg and Switzerland, which all have lower tax rates. The US, however, remains its largest market.\nOver the years, it has used this situation to pay a tax rate of about 4% on its income. It did this, in part, by taking a $16.5 billion loan from its Luxembourg subsidiary and putting it in its US subsidiary.\nAccording to documents viewed by the WSJ, that means the company will save over $560 million over the next five years.\nThe US government, naturally, has been upset about this. Former CFO Howard Schiller testified at the same hearing as Koch, but unlike Koch, he was on the defensive.\n\"Valeant does not take into account tax synergies in either identifying or pricing potential acquisition targets,\" he said. \"We do not value proposed transactions based on the ability to achieve tax synergies and we do not pay higher prices to the sellers based on our ability to achieve tax synergies. \"\nHowever, former CEO Michael Pearson touted the company's low tax rate as a selling point when the company was making a hostile bid for Allergan.\n\"No other potential acquirer of Allergan has the operational and tax synergies that we have,\" he said in an October 2014 letter to Allergan, announcing plans to raise its bid. (Allergan eventually slipped through Valeant's fingers.)\nFrom left, Valeant's outgoing CEO, J. Michael Pearson; former chief financial officer Howard Schiller are sworn in on Capitol Hill in Washington, Wednesday, April 27, 2016, prior to testifying before the Senate Special Committee on Aging hearing on drastic price hikes by Valeant and a handful of other drugmakers that have stoked outrage from patients, physicians and politicians nationwide. AP Images/Manuel Balce Ceneta\nThis feature of Valeant's business would vanish if the net interest deduction were eliminated. That means the company — which paid a tax bill of $76.9 million on over $1.5 billion of operating income last year — would see that bill rise substantially. In the same year, Valeant was holding just under $600 million in cash.\nThis is perilous for a company that has seen its market cap fall from over $40 billion to around $4.6 billion over the last year. Accusations of fraud and drug price gouging have sent investors fleeing from the company, and it's holding over $30 billion in debt. The company's annual report cites that debt (and any reduction in cash flow hampering its ability to pay it) as a risk.\nFrom the report:\nOur ability to satisfy our debt obligations will depend principally upon our future operating performance. As a result, prevailing economic conditions and financial, business and other factors, many of which are beyond our control, may affect our ability to make payments on our debt. If we do not generate sufficient cash flow to satisfy our debt service obligations, we may have to undertake alternative financing plans, such as refinancing or restructuring our debt, selling assets, reducing or delaying capital investments or seeking to raise additional capital.\nValeant is not the only company that could get hit if the interest deduction is eliminated. There are a number of companies with this structure, including Mylan, the now infamous maker of EpiPen medication.\nThere's no telling how Congress will handle these companies once new legislation is passed and there's a transitional phase as American companies adjust. It could grandfather the debt that's already in the country and chalk these stripped earnings up to a loss in terms of tax revenue. It could also phase in this debt gradually.\nOr, if Congress wants to be petty about this, it can single out companies that have inverted for punishment. Hating inverters is a bipartisan pastime in Washington, so experts tell Business Insider that this is definitely not out of the realm of possibility.\nPunishing perceived tax dodgers makes politicians look good to their constituents and could possibly bring in much-needed revenue.\nCheck out this handy infographic of inverted companies from the Democrats on the House Ways and Means Committee back in 2014.","url":"https://www.businessinsider.com/trumps-tax-plan-could-knee-cap-a-bunch-of-huge-companies-2016-12"}
