{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:46:30","date_modify":"2018-10-30 19:46:30","date_publish":"2018-07-25 21:09:07","description":"President Donald Trump and European Commissioner Jean-Claude Juncker announced agreement Wednesday to work toward a zero tariffs trade deal.","filename":"data/vaneerConsumption/TrumpEUPresidentAnnounceZeroTariffsTradeAgreementNegotiations.json","image_url":"https://media.breitbart.com/media/2018/07/Trump-Rose-Garden-Saul-LoebAFPGetty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_25__1540928790.html","title":"Trump, E.U. President Announce 'Zero Tariffs' Trade Agreement Negotiations","title_page":"Trump, E.U. President Announce 'Zero Tariffs' Trade Agreement Negotiations","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump and European Commissioner Jean-Claude Juncker gave a late-announced press conference in the White House Rose Garden Wednesday as they announced an agreement to work toward and operate in the spirit of a “zero tariffs, zero non-tariff barriers, zero subsidies on non-auto industrial goods” trade deal.\nThe United States and the European Union together account for more than $830 million citizens and more than 50 percent of the global GDP,” said Trump, adding this means they make up more than 50 percent of trade. “If we team up, we can make our planet a better, more secure, and prosperous place.”\nTrump continued:\nAlready today the United States and European Union have a $1 trillion bilateral trade relationship. The largest economic relationship anywhere in the world. We want to further strengthen this trade relationship to the benefit of all American and European citizens. This is why we agreed today, first of all, to work together toward zero tariffs, zero non-tariff barriers, and zero subsidies on non-auto industrial goods.\n“We will also work to reduce barriers that increase trade in services, chemicals, pharmaceuticals, medical products, as well as soybeans,” said Trump. “Soybeans is a big deal and the European Union is going to start almost immediately to buy a lot of soybeans…from our farmers in the midwest primarily.”\nTrump thanked Juncker for this agreement.\n“This will open markets for farmers and workers, increase investment, and lead to greater prosperity in both the United States and the European Union,” said Trump. “It will also make trade fairer and more reciprocal, my favorite word, reciprocal.”\nTrump then moved to the second portion of the agreement, “strengthening of [America’s] strategic cooperation with respect to energy.”\n“The European Union wants to import more liquified natural gas, LNG, from the United States,” said Trump who added that the E.U. will be a “massive buyer.” He said the U.S. will be making it easier for the E.U. to do so in order to “diversify their energy supply, which they want very much to do.”\nThe third agreement between Trump and Juncker was to “launch a close dialogue on standards in order to ease trade, reduce bureaucratic obstacles, and slash costs dramatically.”\nTheir fourth agreement was to “join forces to protect American and European companies from better and really better than ever…we will therefore work closely together with likeminded partners to reform the WTO and to address unfair trading practices including intellectual property theft, forced technology transfer, industrial subsidy, distortions created by state-owned enterprises, and overcapacity.” These practices ring of criticisms the U.S. and President Trump have lodged against the Chinese as unfair trading practices.\nTrump and Juncker agreed to immediately set up an executive working group comprised of “very intelligent people on both sides” to be their “closest advisers” and carry out the joint agenda. Initially the group will “identify short-term measures to facilitate commercial exchanges and assess existing tariff measures and what [they] can do about that to the betterment of both.”\nTrump said that in the course of working out this agreement, both parties will not “go against the spirit of this agreement unless either party terminates the negotiation.”\n“We also will resolve the steel and aluminum tariff issues and we will resolve retaliatory tariffs,” said Trump.\nJuncker then spoke of the deal and said they identified a number of areas where the U.S. and E.U. can work together. He said that he came to the White House Wednesday with the intension of working out a trade agreement. He said his primary focus was on working toward “zero tariffs on industrial goods.” He echoed President Trump and efforts to strengthen energy cooperation and importation of LNG. He also spoke of the soybean import increase and working toward reforms of the WTO. The two will hold off on further tariffs and the U.S. will relent on steel and aluminum tariffs.\n“This was a very big day for free and fair trade, very big day indeed,” said Trump in closing.\nThe announcement came after Trump and Juncker spent the early afternoon meeting on issues of trade between the U.S. and E.U.\nTrump called out the names of several Senators present at the joint press conference.\nMichelle Moons is a White House Correspondent for Breitbart News — follow on Twitter @MichelleDiana and Facebook","url":"https://www.breitbart.com/politics/2018/07/25/ttrump-e-u-president-announce-zero-tariffs-trade-agreement-negotiations/"}
