{"authors":["Associated Press"],"date_download":"2018-10-23 00:57:03","date_modify":"2018-10-23 00:57:03","date_publish":"2016-01-29 14:37:27","description":"DES MOINES, Iowa (AP) — Front-runner Donald Trump's boycott of the final Republican debate before the Iowa caucuses created space for his rivals to delve mor...","filename":"data/vaneerConsumption/Trumpsabsencefromdebategivesrivalsroomtotalkissues.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:8ea98992f9df4890b5c796e718905501-3bmscybNe842cce83474b56b7e54-755_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422858_Trumps-absence-debate-gives-rivals-room-talk-issues_1540256223.html","title":"Trump's absence from debate gives rivals room to talk issues","title_page":"Trump's absence from debate gives rivals room to talk issues | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Trump's absence from debate gives rivals room to talk issues\nDES MOINES, Iowa (AP) — Front-runner Donald Trump's boycott of the final Republican debate before the Iowa caucuses created space for his rivals to delve more deeply into their differences on immigration, foreign policy and their approach to governing.\nIowa voters kick off the 2016 nominating process with Monday's caucuses, and they'll provide the first indication of whether Trump's abrupt decision to skip the debate will have any impact on his standing atop the party's field.\nHis lead in Iowa had become more tenuous in recent days, as Texas Sen. Ted Cruz pulled in support from conservative and evangelical voters.\nRepublican presidential candidates (L-R) New Jersey Gov. Chris Christie, Sen. Marco Rubio, R-Fla., former Florida Gov. Jeb Bush and Sen. Ted Cruz, R-Texas, talk after the Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nTrump's decision to pull out of the debate over a feud with host Fox News was a gamble, particularly so close to the state of voting. He tried to steal attention away from his rivals with a competing rally that he said raised $6 million for military veterans.\nTrump's absence put the spotlight on Cruz and Florida Sen. Marco Rubio, who needs a strong showing in Iowa in order to stay in the top tier of candidates.\nThe two senators were confronted with video clips suggesting they had changed their positions on immigration, one of the most contentious issues among Republicans. Both denied they had switched their own views on allowing some people in the U.S. illegally to stay.\nCruz accused Rubio of making a \"politically advantageous\" decision to support a 2013 Senate bill that included a pathway to citizenship, while Rubio said his Texas rival was \"willing to say or do anything to get votes.\"\nThe candidates worked hard to present themselves as best prepared to be commander in chief and take on terror threats.\nRubio pledged that as president he would go after terrorists \"wherever they are. And if we capture them alive, they are going to Guantanamo.\" Rubio also stood by his previous calls for shutting down mosques in the U.S. if there were indications they were being used to radicalize terrorists.\nKentucky Sen. Rand Paul warned against closing down mosques. A proponent of a more isolationist foreign policy, Paul also raised concerns about the U.S. getting involved militarily in Syria, where the Islamic State group has a stronghold.\nThe crowded Republican field includes more mainstream candidates who have struggled to break through in an election year where Trump, and increasingly Cruz, have tapped into voter anger with the political system. Party leaders have grown increasingly anxious for some of the more traditional candidates to step aside to allow one to rise up and challenge for the nomination.\nFormer Florida Gov. Jeb Bush said: \"We're just starting out. The first vote hasn't been counted. Why don't we let the process work?\"\nBush and New Jersey Gov. Chris Christie, along with Ohio Gov. John Kasich, are looking beyond Iowa and hoping New Hampshire's Feb. 9 primary jumpstarts their campaigns.\n___\nAssociated Press writer Kathleen Ronayne contributed to this report.\n___\nFollow Julie Pace and Jill Colvin on Twitter at: http://twitter.com/jpaceDC and http://twitter.com/colvinj\nRepublican presidential candidate Sen. Rand Paul, R-Ky., answers a question as New Jersey Gov. Chris Christie, right, listens during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nRepublican presidential candidates (L-R) New Jersey Gov. Chris Christie, Sen. Marco Rubio, R-Fla., former Florida Gov. Jeb Bush and Sen. Ted Cruz, R-Texas, talk after the Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)","url":"https://www.dailymail.co.uk/wires/ap/article-3422858/Trumps-absence-debate-gives-rivals-room-talk-issues.html"}
