{"authors":["Will Martin"],"date_download":"2018-10-30 23:12:10","date_modify":"2018-10-30 23:12:10","date_publish":"2018-07-20 00:00:00","description":"President Donald Trump on Friday threatened to place tariffs on all goods imported to the US from China in a major escalation of the burgeoning trade war between the two nations.","filename":"data/vaneerConsumption/Trumpthreatenstariffsonall500billionofChineseexportstoUS.json","image_url":"https://amp.businessinsider.com/images/5b23dd581ae6621a008b5250-1136-568.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trump-trade-war-tariffs-500-billion-chinese-imports-2018-7_1540941130.html","title":"Trump threatens tariffs on all $500 billion of Chinese exports to US","title_page":"    Trump threatens tariffs on all $500 billion of Chinese exports to US - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"President Donald Trump. Jae C. Hong/AP Images\nPresident Donald Trump on Friday threatened to place tariffs on all goods imported by the US from China in a major escalation of the burgeoning trade war between the two nations.\n\"I'm ready to go to 500,\" Trump said in an interview with CNBC's Joe Kernen that aired Friday morning.\nThe US imported $505 billion worth of goods from China in 2017, according to Census Bureau data.\n\"I'm not doing this for politics — I'm doing this to do the right thing for our country,\" he added. \"We have been ripped off by China for a long time.\"\nTrump's comments come amid a multitude of trade threats between major economies around the globe and after his initial tariffs on Chinese goods sparked a major conflict. The Trump administration has already begun placing tariffs on $50 billion worth of Chinese goods and threatened to put levies on $200 billion more of imports.\nThe threat to place tariffs on all Chinese goods sent to the US would effectively end the tit-for-tat trade battle between the two nations, as Chinese imports from the US are a comparatively small $129.9 billion.\nEven while threatening China, Trump tried to reassure the Chinese government that he was not looking to \"scare\" the country.\n\"I don't want them to be scared,\" he told CNBC. \"I want them to do well. I really like President Xi a lot, but it was very unfair.\"\nGoods already affected by Trump's tariffs against China include batteries, trains, and ball bearings, but they could extend to more consumer goods if further tariffs are imposed. You can see a full list of goods subject to tariffs here.\nThe trade war escalates\nResponding to the president's latest comments, the White House economic adviser Larry Kudlow told the news website Axios that provoking Trump would be a mistake for China.\n\"They're picking the wrong customer, I'll tell you that — you know how intense he is on this issue,\" he said, adding: \"Xi seems to think if he waits out the November elections, Trump will be weakened and therefore will lighten the bite. That's a very bad bet.\"\nOn Thursday, the European Union said it was developing plans to hit back at the US if it attempted to place import tariffs on cars, something Trump has repeatedly threatened to do.\nHis administration is considering tariffs of as much as 20% on US automobile imports from Europe. EU officials are readying a list of retaliatory tariffs that would be applied in response.\nSenior EU officials, including the European Commission's president, Jean-Claude Juncker, are set to fly to Washington, DC, next week with the aim of persuading Trump not to levy punitive tariffs on European automobiles.\nSee also:","url":"https://www.businessinsider.com/trump-trade-war-tariffs-500-billion-chinese-imports-2018-7"}
