{"authors":["Akin Oyedele"],"date_download":"2018-10-30 23:35:36","date_modify":"2018-10-30 23:35:36","date_publish":"2018-07-18 00:00:00","description":"Manufacturers in all the Federal Reserve's 12 districts are concerned about tariffs. The Fed's Beige Book, with anecdotes from businesses across the country, showed companies that rely on steel and aluminum for production are grappling with higher costs.","filename":"data/vaneerConsumption/TrumptariffsFedsaysmanufacturersinallitsdistrictsareworried.json","image_url":"https://amp.businessinsider.com/images/5b4f866de121fe9a028b46cc-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trump-tariffs-fed-says-manufacturers-in-all-districts-worried-2018-7_1540942536.html","title":"Trump tariffs: Fed says manufacturers in all its districts are worried","title_page":"    Trump tariffs: Fed says manufacturers in all its districts are worried - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Manufacturers are worried about Trump's tariffs. Reuters\nThe manufacturers most affected by US tariffs on imported goods are worried about their future, according to the Federal Reserve.\nThe Fed's Beige Book, which compiles anecdotes on business activity from across its 12 districts, showed Wednesday that manufacturers in all districts expressed concern about tariffs. In many districts, manufacturers said US trade policy had driven up their costs and disrupted supply.\nThe US has this year entered into trade disputes with several economies including China, Mexico, Canada, and the European Union. Several companies, including Whirlpool, which first supported import taxes on washing machines, have also expressed concern that the administration's goal of protecting US businesses from unfair trade practices may end up being harmful to them.\nA can manufacturer in Maryland, faced with rising steel costs, told the Fed they expected to lose business to foreign competitors who were not faced with tariffs. Some of the Cleveland Fed's contacts said there was a rush to buy metals in anticipation of more price increases.\n\"This is short-term,\" Sarah Huckabee Sanders, the White House press secretary, said at a press briefing on Wednesday. \"The president hopes to open up a number of different markets and to create a more [even-] playing trade field across the globe.\"\nIn Congressional testimony on Tuesday, Fed Chairman Jerome Powell said a lengthy trade war that affects more goods \"will be bad for our economy and for other economies too.\"\n\"In general, countries that have remained open to trade, that haven't erected barriers including tariffs, have grown faster, they have higher incomes, higher productivity,\" Powell said.\nEvery district reported \"modest\" economic growth, according to the Fed's Beige Book, which was compiled on or before July 9.","url":"https://www.businessinsider.com/trump-tariffs-fed-says-manufacturers-in-all-districts-worried-2018-7"}
