{"authors":["Penny Starr"],"date_download":"2018-10-30 22:12:10","date_modify":"2018-10-30 22:12:10","date_publish":"2018-07-21 00:21:17","description":"The federal government said on Thursday regulatory revisions to the Endangered Species Act will better serve Americans and protect wildlife.","filename":"data/vaneerConsumption/TrumpAdministrationMovestoReviseRegulationsYetProtectWildlife.json","image_url":"https://media.breitbart.com/media/2018/07/Bog-Turtle-New-Jersey-Photo-Credit-Rosie-Walunas-USFWS.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_20__1540937530.html","title":"Trump Administration Moves to Revise Regulations Yet Protect Wildlife","title_page":"Trump Administration Moves to Revise Regulations Yet Protect Wildlife","title_rss":"NULL","source_domain":"breitbart.com","text":"The U.S. Fish and Wildlife Service (NFWS) and the National Oceanic Atmospheric Administration (NOAA) announced on Thursday regulatory revisions to the Endangered Species Act to accomplish what the agencies say will be continued protection for threatened and endangered species while reducing “burdens” to Americans living on lands that are also habitats to wildlife.\n“The Trump administration is dedicated to being a good neighbor and being a better partner with the communities in which we operate,” Greg Sheehan, principal deputy director with NFWS said in an announcement of the revisions. “One thing we heard over and over again was that ESA implementation was not consistent and often times very confusing to navigate.”\n“We are proposing these improvements to produce the best conservation results for the species while reducing the regulatory burden on the American people,” Sheehan said.\nThe agencies have sought public comment throughout the process, which began in 2017, and will continue to do so until the revisions are finalized, the announcement said.\nChris Oliver, NOAA assistant administrator for fisheries, said the revisions would not put endangered wildlife at risk.\n“We work to ensure effective conservation measures to recover our most imperiled species,” Oliver said.\nBut some who promote expansive regulations to protect wildlife at all cost are claiming the move will be detrimental.\n“These proposals would slam a wrecking ball into the most crucial protections for our most endangered wildlife,” Brett Hartl, government affairs director at the Center for Biological Diversity, said in a statement published by Yahoo News.\nYahoo News reported:\nUnder the proposed revisions the administration would end a practice that automatically conveys the same protections for threatened species as for endangered species, and would strike language that guides officials to ignore economic impacts of how animals should be safeguarded. Threatened species are defined as those at risk of becoming endangered. The 1970s-era Endangered Species Act is credited with bringing back from the brink of extinction species such as bald eagles, gray whales and grizzly bears, but the law has long been a source of frustration for drillers, miners and other industries. New species listings can put vast areas of territory off limits to development. The proposed changes also include evaluating a species’ critical habitat initially only in places where it currently lives, rather than including areas where it could be expected to live if its population recovered.\n“These rules will be very protective and enhance the conservation of the species,” Interior Department Deputy Secretary David Bernhardt said on a conference call with reporters, including one with Yahoo News.\n“At the same time we hope that they ameliorate some of the unnecessary burden, conflict, and uncertainty that is within our current regulatory structure,” Bernhardt said on the call.\n“The U.S. Departments of Interior and Commerce worked jointly to develop the new rules as part of President Donald Trump’s push for federal agencies to streamline regulatory processes,” Yahoo News reported.\n“All changes are being proposed as part of a robust, transparent public process,” a notice about the revisions states. “The agencies encourage the public to provide input to ensure these regulations are effective in furthering the ESA’s ultimate goal—recovery of our most imperiled species to the point they no longer need federal protection.”\nFollow @PennyStarrDC on Twitter","url":"https://www.breitbart.com/politics/2018/07/20/ttrump-administration-moves-to-revise-regulations-yet-protect-wildlife/"}
