{"authors":["Neil Munro"],"date_download":"2018-10-30 19:10:21","date_modify":"2018-10-30 19:10:21","date_publish":"2016-02-17 15:36:56","description":"Donald Trump flipped the Democrats' demand for an amnesty of younger illegal migrants -- which they call 'dreamers' -- by declaring that he wants Americans' kids to dream big. |","filename":"data/vaneerConsumption/TrumpOnMigrantsIWantDreamerstoComeFromTheUnitedStates.json","image_url":"https://media.breitbart.com/media/2016/02/Donald-Trump-Supporters-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_17__1540926621.html","title":"Trump On Migrants: 'I Want Dreamers to Come From The United States'","title_page":"Trump On Migrants: 'I Want Dreamers to Come From The United States' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Donald Trump flipped the Democrats’ demand for an amnesty of younger illegal migrants — which they call ‘dreamers’ — by declaring that he wants Americans’ kids to dream big.\n“I want dreamers to come from the United States,” Trump responded on Monday to a question from an advocate for illegal migrants.\nI want the people in the United States that have children, I want them to have dreams also. We’re always talking about ‘DREAMers’ for other people. I want the children that are growing up in the United States to be dreamers also. They’re not dreaming right now.\nTrump’s visceral response emerged during a Monday afternoon press conference, when a questioner asked him about the demands of foreign migrants. “There are over 100,000 young people known as DREAMers who have deferred action given to them. What should they expect?,” said the questioner.\nThe “DACA” is President Barack Obama’s quasi-amnesty for migrants who claim they were brought into the country as minors by their parents. Since he announced his quasi-amnesty in June 2012, at least 660,00 younger migrants — not just “over 100,000” as the questioner said — have gotten work-permits and drivers’ licenses. Those documents allow them to compete for jobs against the 4 million Americans who begin looking for work each year in an economy where a surplus of immigrant labor has kept wages flat and stock-market prices high for at least 15 years.\nIn a video posted by Real Clear Politics, Trump responded by saying he’s focused on helping American parents and their kids, not on foreign illegal migrants.\nI want dreamers to come from this country. You mentioned DREAMers. You mentioned DREAMers? I want dreamers to come from the United States. I want the people in the United States that have children, I want them to have dreams also. We’re always talking about ‘DREAMers’ for other people. I want the children that are growing up in the United States to be dreamers also. They’re not dreaming right now. And you look at African-American youth. I mean, 58 percent unemployment. You look at African-Americans and they’re 30 years old and 40 years old and we have an African-American president, and he has not done anything for the African-Americans in this country, okay? And he got a free pass. And he shouldn’t have. Because if that were me or that were somebody else, we would be taking over the calls, believe me. It would not be a good situation. President Obama has done nothing for the African-Americans. You look at African-American youth, you look at African-Americans that are 30 years old, 40 years old and 50 in their prime nd take a look at the statistics. It’s very sad.\nTrump’s focus on unemployed Africa-American youth is noteworthy, partly because it may draw a critical mass of support from the Democratic candidates, both of whom support an amnesty for the estimated 11 million foreign migrants now living inside the United States.","url":"https://www.breitbart.com/politics/2016/02/17/3058861/"}
