{"authors":["Bob Price"],"date_download":"2018-10-30 21:20:03","date_modify":"2018-10-30 21:20:03","date_publish":"2016-02-25 12:11:23","description":"A television station poll in the Dallas/Fort Worth metroplex says that Ted Cruz and Donald Trump are now tied in the Texas GOP primary.","filename":"data/vaneerConsumption/TrumpCruzTiedinTexasGOPPrimary.json","image_url":"https://media.breitbart.com/media/2016/02/WFAA-Poll.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_25__1540934403.html","title":"Trump, Cruz Tied in Texas GOP Primary","title_page":"Trump, Cruz Tied in Texas GOP Primary","title_rss":"NULL","source_domain":"breitbart.com","text":"A television station poll in the Dallas/Fort Worth metroplex says that Ted Cruz and Donald Trump are now tied in the March 1st Texas GOP primary. Trump is leading in North Texas.\nThe WFAA/Texas TEGNA poll, which was conducted after the South Carolina primary and before the Nevada caucus, shows Cruz and Trump tied at 32 percent with Marco Rubio trailing by 15 points.\nSouthern Methodist University political science professor Cal Jillson told the DFW news outlet, “He’s [Cruz] fading. Trump has proven to be stronger and more resilient than anyone expected.”\nWhile Trump and Cruz polled at 32 percent each, Rubio came in at 17 percent. Dr. Carson and Ohio Governor John Kasich are in single digits at five and six percent respectively.\nIn North Texas, which includes the DFW metroplex, Trump actually has taken a six point lead over the Texas senator. The North Texas numbers show Trump – 34 percent, Cruz – 28 percent, Rubio- 18 pecent, Kasich – 7 percent, and Carson – 6 percent.\nTrumps lead in this region is very surprising given the performance of Sen. Cruz in this market during his 2012 campaign for the U.S. Senate.\nIn East Texas, home to Sen. Cruz, the senator is maintaining a small 3 point lead over Trump.\nAmong Hispanic voters statewide, Cruz leads Trump by seven points, 34-27 percent. Trumps performance in the Nevada caucus where the Washington Post reports he won 44 percent of the Hispanic vote, and his apparent strong showing in this Texas poll, show that he can compete in that market despite media claims that he hates Hispanics. Trump has always countered the claim that he can’t win the Hispanic vote and the numbers appear to show he is right.\n“If he [Cruz] is beaten in Texas that means he is beaten across the SEC primary,” Jillson told WFAA. “Cruz exudes a determination that sort of borders on the frantic. He is deeply supported by the true believers. But once you get beyond that slice of the electorate people have a natural concern about Cruz and his approach to the campaign and his willingness to play dirty tricks. Those charges have stuck to him because he has a lean and hungry look that worries people. Trump is showing real resilience and even increasing his support and Rubio is becoming the alternative. That doesn’t leave much of a lane for Cruz.”\nBreitbart Texas attended the Harris County Republican Party’s Lincoln-Reagan dinner on Wednesday night. Sen. Cruz and Dr. Carson both spoke at the event and each received standing ovations before and after their speeches.\nThe mood among attendees about the Cruz campaign was very guarded. Many seemed resigned to the fact that Cruz’s lead in the Texas primary appears to have disappeared.\nMany of the attendees expressed an almost resignation to the prospect of a Trump nomination this summer.\nAn Emerson College poll reported on Wednesday by Breitbart Texas also showed the tightness of the Texas race. In that poll, conducted on a similar timeframe, Cruz had a one-point lead. The week before, a University of Texas/Texas Tribune poll showed Sen. Cruz with a eight-point lead.\nIn the Democrat primary, WFAA reports Hillary Clinton has a 29 point lead over Bernie Sanders, 61-32 percent.\nThe poll was conducted on February 21 and 22 by contacting 1,750 adults across Texas. The sampling was conducted via phone and internet based surveys by SurveyUSA. It reflects voters opinions after the South Carolina primary but before the Nevada GOP caucus.\nBob Price is a senior political news contributor for Breitbart Texas and a member of the original Breitbart Texas team. He is also a Life Member of the NRA. Follow him on Twitter @BobPriceBBTX.","url":"https://www.breitbart.com/politics/2016/02/25/poll-trump-cruz-tied-in-texas/"}
