{"authors":[],"date_download":"2018-10-30 01:16:29","date_modify":"2018-10-30 01:16:29","date_publish":"2018-08-02 22:16:00","description":"Jobs on the line with added costs in auto sector, plants that make cars and parts.","filename":"data/vaneerConsumption/TrumptariffsworryautosectorinGeorgia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/02/Videos/4452852.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_georgia-auto-sector-fears-tariff-damage__1540862189.html","title":"Trump tariffs worry auto sector in Georgia","title_page":"Trump tariffs worry auto sector in Georgia","title_rss":"NULL","source_domain":"ajc.com","text":"With a blinding flash, Alejandra Ferrel started welding a steel pipe destined to be part of a truck’s exhaust system.\nShe finished, flipping back her protective mask amid the relentless sounds of a three-shifts-a-day factory.\nFerrel is one of 300 workers at American BOA in Cumming who make metal hoses and “bellows” used as sleeves in vehicle engine and exhaust systems. Half the steel comes from Europe, and new tariffs initiated by the Trump administration this spring have raised the company’s costs by more than $200,000 a month, said Vincent Delphin Jr., who heads the auto division.\nAmerican BOA hasn’t raised prices yet to cover the higher costs, but it needs to, he said. Best case, customers pay it. Worst case, customers switch to lower-cost competitors, most of them in Mexico.\n“We’ll see how it goes,” Delphin said.\nAmerican BOA is not the only company in Georgia’s booming $2.9 billion auto industry sweating the impact of the White House’s escalating trade battles.\nCar, truck and auto parts manufacturers rely heavily on foreign-made steel and aluminum, which are now taxed an extra 25 percent and 10 percent. That alone is tough to swallow for businesses that use metal and export their end products.\nBut then came reports that the White House was also mulling a 25 percent tariff on imported vehicles. The prospect spooked many in the state’s business community, which has spent significant political capital wooing investment from foreign car companies.\n08/02/2018 -- Cumming, Georgia -- Vincente Delphin, Jr., director of the automotive business unit at American BOA Inc., watches over production at the manufacturing plant in Cumming, Thursday, August 2, 2018. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM) (Alyssa Pointer)\nPresident Donald Trump has said he wants to see more American cars on the roads, an argument that could win him points in states such as Michigan and Pennsylvania ahead of the midterm elections. Several U.S. steel companies and United Automobile Workers have voiced support for broader protective measures.\nBut auto manufacturers and parts makers warn the strategy could increase the cost of cars and trucks for consumers by thousands of dollars and potentially drive foreign auto companies out of the country, taking tens of thousands of jobs with them.\nIt’s also created discomfort for Georgia’s Republicans on Capitol Hill. Many are free-traders who are concerned about the tariffs’ impact on their districts but don’t want to be seen as directly crossing the president, who remains popular with many of their constituents.\n“The president is right to go after the bad guys in this, but I have a commitment to fight for the good guys in Georgia-3,” said U.S. Rep. Drew Ferguson, R-West Point, whose district is home to a Kia Motors assembly plant.\n‘Dumping ground’\nTrump’s ticket to the White House was punched in the Rust Belt, a region that saw much of its manufacturing strength whittled away in recent decades.\nThe president argues he can revive many of those lost industries by forcing trade partners to renegotiate better terms for American exports.\nTrump instituted steel and aluminum tariffs this spring, an action that’s had ripple effects in countless industries, including Georgia’s beverage and agriculture sectors, as some trading partners have retaliated with duties of their own. In May came news that the White House was setting its sights further.\n“There will be big news coming soon for our great American Autoworkers,” Trump tweeted shortly before directing the Commerce Department to study the auto sector.\nThe prospect won praise from a key constituency: union groups, which said they support policies that will lead to more jobs for U.S. workers.\nBut the reaction was far different in other corners of the Southeast. Many states, from Alabama to South Carolina, have seen their manufacturing sectors blossom over the last two decades after European and Asian auto companies moved in and began employing tens of thousands of workers.\nAtlanta plays host to the North American headquarters for two European car companies: Porsche and Mercedes-Benz. And a Kia assembly plant helped revive Ferguson’s hometown of West Point when it opened up in 2006. It now employs roughly 3,000 workers.\nThe industry group Here for America estimates that foreign automakers generated more than 69,000 direct, indirect and car dealership jobs in the Peach State, contributing to more than $7 billion to Georgia’s gross state product in 2016.\n“Auto plants are important to Georgia’s economy because they create excellent jobs,” said Rick Walker, president of the Georgia Automotive Manufacturers Association.\nQuality technician LaMar McDougal measures the “convolution” of a metal hose at the American BOA Inc. manufacturing plant in Cumming. It can’t be off by more than 0.4 millimeters. (ALYSSA POINTER/ALYSSA.POINTER@AJC.COM) (The Atlanta Journal-Constitution)\nSatellite industries\nThe auto industry’s Georgia footprint extends far beyond the car companies themselves.\nA constellation of small businesses provide parts and services to Kia and the other big assembly plants that are within driving distance, including BMW in South Carolina, Honda and Mercedes in Alabama, and Volkswagen in Chattanooga.\nAbout 24,000 people in Georgia work for more than 40 vehicle parts suppliers, according to Cindy Sebrell of the Motor & Equipment Manufacturers Association.\nGeorgia’s two major ports at Savannah and Brunswick have become massive export-import hubs for cars and parts. Last year, those ports handled 630,000 autos, many made in the Southeast being exported for sale overseas, according to Griffith Lynch, executive director of the Georgia Ports Authority.\nRoughly $14 billion worth of vehicle-related shipments come through those ports in a year, according to the Auto Alliance.\n‘Domino effect’\nGiven the industry’s large regional footprint, the new duties have created major anxiety among industry players big and small.\nThe prospect of higher costs leading to layoffs is frightening, said Page Estes, president of the LaGrange Troup Chamber of Commerce, which covers the area surrounding Kia’s plant. About 15,000 jobs in that region are either with Kia or area suppliers, she said.\n“Of course, we have to be concerned, because Kia is so important economically to this area. Kia and its suppliers employ so many of our residents.”\nMajor companies with a Southeast presence have ramped up their lobbying efforts in Washington, but many have been reluctant to publicly take on the president and his supporters.\nBut in a June filing with the Commerce Department, Kia said its U.S. business, employees and the communities that depend on them would be “severely harmed” by tariffs on imported autos.\nMercedes said in its own filing that there was “no suitable basis” for tariffs, warning that they could have a “devastating impact” leading to fewer sales at car dealerships, smaller operations and higher prices for new autos.\nKristin Dziczek, vice president at the Center for Automotive Research, said that if the administration sticks with the tariffs, prices of all vehicles and parts are going to rise. “We think the 25 percent tariffs mean an added average cost of $4,400 per vehicle,” she said. “There are no 100 percent U.S.-built vehicles.”\nFor imported vehicles, the price will go up an average $6,800, she said.\nSearching for off-ramps\nThe industry pushback in Georgia has created a wedge with business groups and Republican officials who have otherwise been supportive of Trump’s agenda on Capitol Hill.\nTen of Georgia’s 16 members of Congress signed onto a letter to Commerce Secretary Wilbur Ross in late June expressing alarm about the auto tariffs.\n“We share your desire to bring more automobile production to the United States and ensure America has a strong and vibrant automobile manufacturing presence,” the group of eight Republicans and two Democrats wrote. “However, we are concerned that adding a 25 percent tariff on automobiles and auto parts will have the reverse affect.”\nOne of the signatories was U.S. Sen. David Perdue, who has been one of Trump’s most steadfast supporters in the state. The freshman Republican said he’s supportive of renegotiating trade deals, particularly with China, but that the U.S. should look for “off-ramps” on tariffs.\nPerdue, however, hasn’t gone as far as the majority of his Senate Republican colleagues to halt the tariffs. His Georgia GOP colleague Johnny Isakson backed a bill that would do just that, and also signed onto an effort last week seeking to specifically prevent the auto tariffs.\n“It’s just not a good way to do business,” Isakson said of the auto tariffs on Wednesday. “I think it hurts expansion, it hurts new investment and it just impacts the business climate negatively.”\nThe trade impacts have particularly hit home for Ferguson, who remembers textile mill closures roiling his hometown in decades past. He said it’s incumbent on him to talk to the administration about the negative impact of the tariffs on his community.\n“I’ve watched bureaucrats and policymakers here in D.C. destroy my hometown once,” he said in an interview the same day he spoke at a Capitol Hill press conference with auto workers. “I’ll do everything to make sure they don’t do it again.”","url":"https://www.ajc.com/business/georgia-auto-sector-fears-tariff-damage/lT9ZkTnli54RJltUfZT2OI/"}
