{"authors":["Daily Mail Reporter"],"date_download":"2018-10-22 21:29:03","date_modify":"2018-10-22 21:29:03","date_publish":"2017-03-16 01:30:19","description":"Rep. Brian Mast, frustrated with a delay over hanging Trump's portrait in a Florida VA hospital, decided to do it himself, only to have it taken down right after he left.","filename":"data/vaneerConsumption/TrumpsportraittakendowninVAhospital.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E501D0200000578-0-image-a-44_1489628095981.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318524_Trump-s-portrait-taken-VA-hospital_1540243743.html","title":"Trump's portrait taken down in VA hospital","title_page":"Trump's portrait taken down in VA hospital | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Donald Trump's official presidential photo will be hung in thousands of federal agencies - but they might get taken down too.\nThe contentiousness of Trump's victory has already played out in a power struggle at one VA medical facility in Florida.\nAfter what some vets perceived as a delay in getting Trump's portrait up in the West Palm Beach's VA hospital's hallway, they complained to first term Republican Congressman Brian Mast, who lost both legs to an IED in Afghanistan.\nRep. Brian Mast of Florida, above, went into the West Palm Beach VA medical center and hung portraits of Trump and Secretary of Veteran's Affairs David Schulkin with the help of staff after becoming frustrated with the delay\nShortly after he left, the portraits were taken right back down by staff\nPortraits of the sitting president, vice president, and other cabinet members are standard through thousands of federal agencies across the country. When they go up, however, seems to depend.\nObama's portrait was ordered removed from VA facilities on January 20, according to ABC News.\nTrump's photo has already been hung at the Pentagon and most photos were expected to be hung by early March.\n'It should be there. Every other president was there wasn’t it? Something’s wrong,' Vietnam vet Walter Korabiak told CBS 12.\nThe portraits were hung by staff members, but Mast claims he was told 'He's not my president' when he complained about the delay in getting Trump's portrait on the wall\nMast told Fox News when he complained to an unnamed federal employee, the bureaucrat answered 'He's not my president.'\nOn Tuesday, Mast took matters into his own hands when he decided to hang Trump's photo in the facility himself.\nSo Mast went to the facility, where he also gets treatment, and had the maintenance staff help him put up portraits of Trump and Secretary of Veteran's Affairs David Schulkin.\nBut after he left, the photos were promptly taken back down.\nWatch the latest video at video.foxnews.com\nMast wrote on his Facebook page: 'Yesterday I visited the West Palm Beach VA after numerous calls from constituents that there was a delay in hanging up photos of the new VA Secretary and Commander In Chief - photos that are hung in every VA facility across the country.\nThe VA hospital where Mast hung the portrait sent a letter to veterans saying as of March 6 it was still awaiting the official portrait from Trump's office\n'While there, we helped to hang the official photos of Secretary Shulkin and President Trump, but they've now been taken down again. Especially after so many veterans contacted me about this issue, it's disappointing to see resistance from the VA over hanging these portraits.'\n'I left and the leadership had the portraits removed,' Mast told Fox News.\nThe outlet claimed a similar incident happened at the Environmental Protection Agency office. But the EPA denied it, with spokesman Doug Ericksen saying, 'Anyone is taking them down, it’s illegal. We’re focused on protecting public health and the environment - we’ll let them play politics on the Hill.'\nOfficials at the West Palm Beach office told CBS 12 that the portraits were taken down not because of any ill will towards Trump but because they hadn't been approved by the central office when they're authenticated as official.\nVideo courtesy of CBS 12","url":"https://www.dailymail.co.uk/news/article-4318524/Trump-s-portrait-taken-VA-hospital.html"}
