{"authors":["Morgan Brinlee"],"date_download":"2018-10-31 01:47:41","date_modify":"2018-10-31 01:47:41","date_publish":"2018-08-27 18:09:00","description":"Memorial services for Sen. John McCain are slated to be held in both Arizona and Washington D.C. later this week. While planning for those events remains underway, the Arizona senator reportedly helped to plan his own funeral in the weeks leading up…","filename":"data/vaneerConsumption/TrumpWontAttendJohnMcCainsFuneralThatMayBeExactlyWhatTheSenatorWanted.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/2eefeec9-7ab4-4153-bf9f-e72a2c7a0ff7-getty-673467348.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_trump-wont-attend-john-mccains-funeral-that-may-be-exactly-what-the-senator-wanted-10249971_1540950461.html","title":"Trump Won't Attend John McCain's Funeral & That May Be Exactly What The Senator Wanted","title_page":"Trump Won't Attend John McCain's Funeral & That May Be Exactly What The Senator Wanted","title_rss":"NULL","source_domain":"bustle.com","text":"Memorial services for Sen. John McCain are slated to be held in both Arizona and Washington D.C. later this week. While planning for those events remains underway, the Arizona senator reportedly helped to plan his own funeral in the weeks leading up to his death Saturday. In fact, it's been reported that McCain didn't want President Donald Trump at his funeral , instead asking former Presidents Barack Obama and George W. Bush to give eulogies.\nEarlier this week, The New York Times reported that the White House had already been informed that current plans for McCain's memorial and funeral events included an invitation for Vice President Mike Pence to attend the service at the Washington National Cathedral, but no invitation for President Trump.\nOn Monday, a spokesperson for McCain confirmed that Trump would not attend any of the late senator's funeral services. \"The president will not be, as far as we know, attending the funeral, and that's just a fact,\" he said, refusing to comment on whether or not Trump's absence was a result of McCain or the president's wishes.\nMcCain is expected to lie in state in the Capitol all day Friday, with a ceremony honoring his life and service taking place in the Capitol's Rotunda that morning. McCain will then receive a national memorial service the following day at the Washington National Cathedral. In Arizona, the senator will lie in state at the Arizona State Capitol on Wednesday with a memorial service to celebrate his life planned for Thursday at the North Phoenix Baptist Church.\nMcCain's purported preference for not extending an invitation to Trump doesn't come as a complete surprise given the strained and often combative relationship the two men had. In 2015, McCain criticized Trump's rhetoric on immigration and accused the then-GOP presidential hopeful of having \"fired up the crazies\" in Arizona.\nShortly after that, Trump hit back, disparaging McCain's military service and claiming he'd been \"not so hot\" as a senator. \"He's not a war hero,\" Trump said while at the 2015 Family Leadership Summit in Iowa.\n\"He's a war hero because he was captured,\" he said. \"I like people that weren't captured.\" McCain served as a Navy aviator during the Vietnam War and was, in 1967, shot down and held as a prisoner of war for more than five years.\nWhen McCain would publicly condemned Trump's comments on Muslims, Russia, women, and Gold Star families during the 2016 presidential campaign, Trump would often respond by attacking the senator over Twitter. According to NBC News, Trump tweeted about McCain roughly 40 times during his campaign, calling the senator at one point a \"dummy\" and, at another point, \"lousy\" for veterans. The two continued to butt heads throughout Trump's presidency, with McCain voting against Trump's efforts to repeal Obamacare and a White House aide being caught remarking that McCain's opposition didn't matter because he was \"dying anyway.\"\nFollowing news of McCain's death, CNN reported that Trump opted to tweet his condolences rather than recognize the senator's public service in a proposed official White House statement. The flag at the White House had been returned to full staff Monday, despite previous administrations keeping flags lowered from the day of the death to the day of the burial. On Monday, Trump was also reported to have refused to answer questions regarding his thoughts on McCain's legacy.\nBut while the president appears to be carrying on with his feud against McCain, the Arizona senator seems to have gotten the last word by not only excluding Trump from his memorial services, but asking two former presidents to deliver speeches.","url":"https://www.bustle.com/p/trump-wont-attend-john-mccains-funeral-that-may-be-exactly-what-the-senator-wanted-10249971"}
