{"authors":["Scott Neuman"],"date_download":"2018-10-23 05:50:26","date_modify":"2018-10-23 05:50:26","date_publish":"2015-08-08 00:00:00","description":"In an appearance on CNN, the maverick candidate called Fox News host and debate moderator Megyn Kelly a \"lightweight\" and \"highly overrated.\" And those were just the nice things.","filename":"data/vaneerConsumption/TrumpBootedFromConservativeForumAfterLatestRemarks.json","image_url":"https://media.npr.org/assets/img/2015/08/08/ap_720874142443_wide-1f39977729afaa11e6427908fe6d6c105a4e9638.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2015_08_08_430635431_latest-trump-remarks-gets-him-booted-from-conservative-forum_1540273826.html","title":"Trump Booted From Conservative Forum After Latest Remarks","title_page":"Trump Booted From Conservative Forum After Latest Remarks : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Trump Booted From Conservative Forum After Latest Remarks\nEnlarge this image toggle caption Andrew Harnik/AP Andrew Harnik/AP\nUpdated at 11:40 a.m. ET\nDespite Thursday night's debate having solidified Donald Trump's standing as a GOP frontrunner, he's not backing off of a feud with Fox News host and debate moderator Megyn Kelly, who he calls a \"lightweight\" who is \"highly overrated.\"\nAnd this:\nBut wait. There's more ...\nIn an interview with CNN's Don Lemon, Trump described his perception of the debate, saying Kelly \"gets out and she starts asking me all sorts of ridiculous questions.\n\"You could see there was blood coming out of her eyes. Blood coming out of her — wherever.\"\nNo doubt it was the \"— wherever\" that prompted this backlash from fellow GOP presidential contender Carly Fiorina:\nIn a late night entry on the RedState blog, Erick Erickson disinvited Trump to the RedState Gathering, saying he admired the GOP candidate \"for being a blunt talker\" but that \"there are even lines that blunt talkers and unprofessional politicians should not cross.\"\n\"Decency is one of those lines,\" he wrote, adding that Trump's comment about Megyn Kelly on CNN \"is a bridge too far for me.\"\nAs The New York Times notes: \"Mr. Trump was to have been the final speaker at the RedState Gathering, appearing at a 'tailgate party' at the Football Hall of Fame in Atlanta on Saturday night.\"\nHours later (apparently too late to get him re-invited to the forum), Trump sought to clarify his remark:\nLater, Trump's campaign released a rambling statement in which he repeated that he had meant \"nose\" and stated: \"Only a deviant would think anything else.\"\nHe pointed out that Erick Erickson had had to retract or apologize for some over-the-top statements of his own in the past.\n\"Also, not only is Erick a total loser, he has a history of supporting establishment losers in failed campaigns so it is an honor to be uninvited from this event,\" Trump's campaign statement read.\nIn an interview with NPR's Weekend Edition Saturday, Erickson acknowledged some past indiscreet comments.\n\"I am a sinner like everyone else and have said some really dumb, stupid things in my life and had to apologize for them,\" Erickson told host Linda Wertheimer.\n\"Donald Trump not only didn't apologize — his campaign, when I called them last night — wouldn't even acknowledge that Donald Trump had said what he'd said,\" Erickson said. \"They didn't want to acknowledge it. Then, when I asked them if they'd clarify, they only wanted to do a private clarification to me that he had said 'whatever,' not 'wherever.'\"\n\"I think he confuses political correctness and common decency,\" he said of Trump. \"It's not common decency to accuse a reporter of being, well, on her menstrual cycle because she asked him a tough question.\"","url":"https://www.npr.org/sections/thetwo-way/2015/08/08/430635431/latest-trump-remarks-gets-him-booted-from-conservative-forum"}
