{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 20:20:16","date_modify":"2018-10-30 20:20:16","date_publish":"2018-08-16 19:03:55","description":"A Trump supporter claimed the lead singer of the punk band Social Distortion physically attacked him over politics at a Sacramento concert.","filename":"data/vaneerConsumption/TrumpSupporterSaysSocialDistortionSingerAttackedHimoverPolitics.json","image_url":"https://media.breitbart.com/media/2018/08/Mike-Ness-Social-distortion-guitar-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_08_16__1540930816.html","title":"Trump Supporter Says Social Distortion Singer Attacked Him over Politics","title_page":"Trump Supporter Says Social Distortion Singer Attacked Him over Politics","title_rss":"NULL","source_domain":"breitbart.com","text":"A President Trump supporter claimed the lead singer of the punk rock band Social Distortion physically attacked him for silently protesting the singer’s criticism of the president at a concert in Sacramento, California.\nConcertgoer Tim Hildebrand, 30, told CBS Sacramento on Wednesday that he flipped the bird at Social Distortion frontman Mike Ness during a July 17 show at Ace of Spades in Sacramento to protest his political statements. The singer then reportedly got off stage, spat on him, and punched him several times.\nHildebrand said the lead singer was “badmouthing President Trump and America” during the show.\n“I pretty much said, ‘I paid for your music, not your politics,’” Hildebrand told CBS Sacramento. “I stood pretty much with my silent protest with my middle finger up for the next two songs.”\nBut the 56-year-old frontman did not look pleased when he took note of Hildebrand’s silent protest. A cellphone video taken by a fan at the concert showed Ness motioning toward one of the fans in the crowd before he took off his guitar and hopped off stage.\nThe video then showed the lead singer throwing multiple punches at the fan until the footage cut out. The singer then continued to play the concert on stage.\nHe takes “his guitar off, jumps off the stage, and proceeds to punch me multiple times in the head,” Hildebrand said.\nHildebrand added that the lead singer also spat on him and the two got into an argument before Ness allegedly attacked him.\n“I wasn’t able to defend myself because people in the crowd were holding me back,” he said.\nSecurity guards then placed Hildebrand in a chokehold and dragged him outside the venue, where the 30-year-old spoke with officers before filing a police report.\nThe Republican concertgoer said he suffered two black eyes, a concussion, and a busted lip from the altercation.\nLinda Matthew, a spokesperson for the Sacramento Police Department, told the New York Times on Wednesday that the department is “aware of the allegations” and is actively investigating the incident.\nRepresentatives for Social Distortion have not responded to requests for comment.","url":"https://www.breitbart.com/entertainment/2018/08/16/trump-supporter-says-social-distortion-singer-attacked-him-politics/"}
