{"authors":["Neil Munro"],"date_download":"2018-10-30 19:09:27","date_modify":"2018-10-30 19:09:27","date_publish":"2018-06-20 19:46:17","description":"The AG 'shall promptly file a request with the U.S. District Court'","filename":"data/vaneerConsumption/TrumpsMigrationEOProsecuteMigrantsandChallengeFloresLoophole.json","image_url":"https://media.breitbart.com/media/2018/06/GettyImages-979571870.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/immigration_2018_06_20__1540926567.html","title":"Trump's Migration E.O: Prosecute Migrants and Challenge 'Flores' Loophole","title_page":"Trump's Migration E.O: Prosecute Migrants and Challenge 'Flores' Loophole | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump’s new Executive Order does not back down on his “zero tolerance” enforcement of border laws, and it directs his lawyers to challenge the 1997 Flores court settlement which forces the Department of Homeland Security to release migrants with children in just 20 days.\nThe E.O. states:\nIt is the policy of this Administration to rigorously enforce our immigration laws. Under our laws, the only legal way for an alien to enter this country is at a designated port of entry at an appropriate time. When an alien enters or attempts to enter the country anywhere else, that alien has committed at least the crime of improper entry and is subject to a fine or imprisonment under section 1325(a) of title 8, United States Code. This Administration will initiate proceedings to enforce this and other criminal provisions of the INA until and unless Congress directs otherwise.\nThat section does not restate the current policy of prosecuting all illegal migrants — “zero tolerance” — but it does not suggest that the government will scale back prosecutions.\nAs he signed the document, Trump said “we are keeping a very powerful border, and it continues to be a zero tolerance, we have zero tolerance for people who enter our country illegally.”\nTrump may not want to put a zero-tolerance policy in an E.O. because that would raise the question of whether officials should separate mothers from infants. There are no confirmed reports that officials are detaining new mothers.\nThe E.O. says the federal government will try to keep families together while the parents’ cases are completed:\nIt is also the policy of this Administration to maintain family unity, including by detaining alien families together where appropriate and consistent with law and available resources.\nThe families will be kept at federal facilities overseen by the Department of Homeland Security, and Attorney General Jeff Sessions will seek the judiciary’s approval to end the 1997 Flores settlement which forces the release of migrants with children:\nIt is unfortunate that Congress’s failure to act and court orders have put the Administration in the position of separating alien families to effectively enforce the law … … (e) The Attorney General shall promptly file a request with the U.S. District Court for the Central District of California to modify the Settlement Agreement in Flores v. Sessions, CV 85-4544 (“Flores settlement”), in a manner that would permit the Secretary, under present resource constraints, to detain alien families together throughout the pendency of criminal proceedings for improper entry or any removal or other immigration proceedings.\nHere is the full text of the E.O.","url":"https://www.breitbart.com/immigration/2018/06/20/trump-migration-eo-prosecute-challenge-flores-loophole/"}
