{"authors":["John Carney"],"date_download":"2018-10-30 20:45:08","date_modify":"2018-10-30 20:45:08","date_publish":"2018-07-11 15:00:35","description":"Saudi Arabia met Donald Trump's demands for more oil, hiking its output in June to the highest level since 2016.","filename":"data/vaneerConsumption/TrumpWinsReliefforAmericansatGasPumpasSaudiArabiaRampsupOilProduction.json","image_url":"https://media.breitbart.com/media/2018/04/wi/ap/05/1c4v2s_trump-59248-donald-trump-mohammed-bin-salman-in-20-2018-file-photo-president-e1531320032651.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_11__1540932308.html","title":"Trump Wins Relief for Americans at Gas Pump as Saudi Arabia Ramps up Oil Production","title_page":"Trump Wins Relief for Americans at Gas Pump as Saudi Arabia Ramps up Oil Production | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Saudi Arabia met Donald Trump’s demands for more oil, hiking its output in June to the highest level since 2016.\nPresident Trump has been pressuring the Organization of the Petroleum Exporting Countries, or OPEC, to increase production to cool off oil prices, which recently hit the highest levels in over three years. Saudi Arabia has the unique ability to increase supply to meet demand, pushing prices in the direction the desert kingdom’s rulers desire.\nOil prices were falling Wednesday following the announcement by the Trump administration of new tariffs on Chinese goods. A further escalation of trade disputes could depress demand for oil from China and elsewhere.\nSaudi Arabia said that it pumped nearly 10.5 million barrels per day last month, compared with 10 million in May.\nLower oil prices are particularly important to U.S. consumers in the summer months when driving reaches its heaviest. Higher gas prices can leave U.S. households with less money to spend on other products. Higher oil prices tend to increase trade deficits, as more money is paid for foreign oil.\nDue to higher U.S. oil production, however, higher prices are not necessarily a net loss for the U.S. economy. They can increase investment in U.S. production, raising employment in extraction and raising demand for oil drilling equipment.","url":"https://www.breitbart.com/politics/2018/07/11/trump-wins-relief-for-americans-at-gas-pump-as-saudi-arabia-ramps-up-oil-production/"}
