{"authors":["Akin Oyedele"],"date_download":"2018-10-31 00:36:29","date_modify":"2018-10-31 00:36:29","date_publish":"2018-07-08 00:00:00","description":"Red states that voted for President Donald Trump in 2016 stand more to lose if other countries retaliate US tariffs, according to economists at Citi.","filename":"data/vaneerConsumption/Trumptariffsandtradewarwillhurtredstatesmosteconomistssay.json","image_url":"https://amp.businessinsider.com/images/5b3fc03b77ac2d23008b49be-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trump-tariffs-and-trade-war-impact-will-hurt-red-republican-states-most-economists-say-2018-7_1540946189.html","title":"Trump tariffs and trade war will hurt red states most, economists say","title_page":"    Trump tariffs and trade war will hurt red states most, economists say - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A longshore worker returns to work at sunset at the APM Terminals in the Port of Los Angeles on October 9, 2002 in Los Angeles, California. David McNew/Getty\nIn President Donald Trump's trade war, the states he won during the election are the most defenseless.\nThat's according to economists at Citi, who last week published a research note on which US states are most exposed to a trade war and what this means for the midterm elections.\n\"With several economies now imposing retaliatory trade actions in the wake of the Trump administration's trade tariffs, the stakes have risen for, and the evidence more compelling against, 'red' states by several measures,\" Citi's Dana Peterson said in the note. Trade wars may reverse the \"hiring bonanza,\" she added.\nThe tariffs — taxes on imports to the US — were sold as a way to level the playing field between US producers and their foreign competition, and grow industry even more. But China, the European Union, Canada, India, and Mexico are set to retaliate.\nOn Friday, the US and China imposed tariffs on $34 billion worth of each other's goods, with China's Ministry of Commerce saying in a statement that Trump launched \"the largest trade war in economic history.\"\nRed states, so-called because they're historically Republican or voted for Trump in 2016, stand to lose more because they benefit the most from trade with other countries, Citi's Peterson said. Imports and exports to red states totaled $2.1 trillion last year, compared to $1.7 trillion for Democratic blue states. Texas, Michigan, and Illinois were among the largest contributors to trade nationwide, since they have some of the largest ports.\nAfter examining the kinds of goods that could be taxed, Citi found that red states ship more to countries that could retaliate US tariffs. These exports include various kinds of food, beverages, luxury goods and medical appliances — all of which are under the purview of tariffs.\nThis chart shows the red states exposed to reciprocal tariffs:\nCiti\nThey're more than blue states:\nCiti\nThis analysis was based on data from the Census Bureau, which tell us where these products were shipped from, not where they were made. But even after looking at Bureau of Economic Analysis data that show what each state produces, Citi's conclusion was that tariffs would hurt red states more than they help.\n\"The Trump administration hopes that the US tariffs can simultaneously aid negotiations with foreign economies and help US firms,\" Peterson said. \"However, it appears the benefits of tariffs to US producers will be eroded by reciprocal retaliatory actions that are specifically targeting sectors the administration champions, and Republican strongholds.\"\nThe state-level data further show that 80% of red-state economies benefit, at a level above the national median, from producing goods targeted by tariffs. Only 10% of blue states are above the median.\nCiti\nThe retaliatory tariffs could hit where they hurt the most: ordinary voters' pockets. According to Commerce Department data compiled by Citi, red states accounted for 3.9 million jobs related to goods exports, compared to 2.5 million in blue states.\n\"With few exceptions (Texas, Florida), many 'red' states lack large, coastal international hubs, which might make each additional exports-related job loss associated with reduced global trade that much more detrimental to per capita income growth,\" Peterson said.\nAnd five months to the election, it's possible that trade wars become a major campaign issue, she added.\n\"Every region of the US is affected by trade dispute intensification, but the data suggest that voters living in states that supported President Trump in 2016 may bear the brunt of the negative repercussions of heightened tensions and the imposition of retaliatory measures,\" Peterson said.\n'A fighting chance'\nTo gauge the impact of the trade wars, the manufacturing sector is a good place to start. Many business owners are worried, but aren't slowing hiring yet. Contacts that spoke to the regional Federal Reserve banks and responded to surveys, particularly those who rely on steel and aluminum, have flagged higher prices.\nThe outcry is not industrywide, however. That's partly because manufacturers are still on a hiring spree that gained steam after the 2016 elections. The Labor Department's jobs report for June, the fourth month since tariffs were implemented, showed manufacturing jobs increased by 36,000. That was the third-best month in the last five years.\n\"It's time to acknowledge that predictions that the steel tariffs would bring doom and gloom were wildly off-base,\" Scott Paul, president of the Alliance for American Manufacturing, said in a statement Friday after the jobs report.\n\"The long-term benefits to employment and the US economy from leveling the playing field on trade can be secured,\" Paul said.\n\"But we've got to give this strategy a fighting chance.\"","url":"https://www.businessinsider.com/trump-tariffs-and-trade-war-impact-will-hurt-red-republican-states-most-economists-say-2018-7"}
