{"authors":["John Binder"],"date_download":"2018-10-30 19:07:38","date_modify":"2018-10-30 19:07:38","date_publish":"2018-07-29 17:52:17","description":"President Trump says he will \"shut down\" the federal government if Congress does not deliver border wall funding.","filename":"data/vaneerConsumption/TrumpIWillShutDownGovernmentoverWallFundingCatchandRelease.json","image_url":"https://media.breitbart.com/media/2018/07/wi/afp/29/3f3d5f_president-donald-trump-questions-reporters-white-house-has-met-publisher-e1532886654702.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_29__1540926458.html","title":"Trump: I Will 'Shut Down' Government over Wall Funding, Catch and Release","title_page":"Trump: I Will 'Shut Down' Government over Wall Funding, Catch and Release | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Trump says he will “shut down” the federal government if the Republicans and Democrats in Congress do not deliver border wall funding and an end to the Catch and Release loophole system in their latest funding bill.\nOn Sunday, Trump took to Twitter to not only call the United States’ immigration laws the “DUMBEST & WORST” around the world—the U.S. imports more than 1.5 million foreign nationals every year—but also sent a warning to Congress where he says the government will be shut down if he does not get his funding for a wall along the U.S.-Mexico border and an end to Catch and Release:\nPlease understand, there are consequences when people cross our Border illegally, whether they have children or not – and many are just using children for their own sinister purposes. Congress must act on fixing the DUMBEST & WORST immigration laws anywhere in the world! Vote “R” — Donald J. Trump (@realDonaldTrump) July 29, 2018\nI would be willing to “shut down” government if the Democrats do not give us the votes for Border Security, which includes the Wall! Must get rid of Lottery, Catch & Release etc. and finally go to system of Immigration based on MERIT! We need great people coming into our Country! — Donald J. Trump (@realDonaldTrump) July 29, 2018\nHouse Republicans, led by Rep. Kevin Yoder (R-KS), have tied $5 billion in southern border wall funding to a slew of pro-open borders and pro-big business immigration changes.\nFor example, as Breitbart News noted, GOP-run House appropriations committee voted to revive President Obama’s Catch and Release policies—where illegal aliens and asylum seekers are caught at the border, then released into the U.S. general public—by deliberately defunding Attorney General Jeff Sessions’ tightening of asylum laws.\nYoder and the GOP-led House appropriations committee’s efforts to codify the Catch and Release policy into law would give the entire populations of El Salvador, Guatemala, and Honduras—32 million Central Americans—the right to migrate to the U.S., as well as any other foreign nationals who travel to the country and claim they are fleeing gangs or domestic violence. This translates to a foreign population at least half the size of the American midwest being given the right to migrate to the country under the GOP’s Homeland Security funding measure.\nThe border wall funding has also been tied to a green card giveaway for at least 200,000 Indian nationals who are in the U.S. on guest worker visas, Breitbart News reported, along with a tripling of the number of H-2B visa workers who let into the country and allowed to take U.S. blue collar jobs and an expansion of the H-2A visa program, which would deliver more cheap foreign workers to farms across the country.\n.@KrisKobach1787: “Asylum would become meaningless and rampant with fraud because anyone can say that they live in fear of gang violence. This would be a colossal mistake for Republicans to support this.”https://t.co/Bbtn2Oubjp — John Binder 👽 (@JxhnBinder) July 27, 2018\nDespite immigration being the number one issue for GOP voters in the midterm elections, Senate and House Republicans are already touting a plan to not fund the border wall before the midterms.\nIn a recent interview with local media, Senate Majority Leader Mitch McConnell (R-KY) said he would “probably” hold off on funding the border wall until after the midterm elections.\n“That’s not going to happen,” McConnell said when asked about a shut down of the government.\nMidterm voters have repeatedly said they want less immigration to the U.S. A majority of swing voters and white voters in battleground districts say immigration from Central America and Mexico has made life in America “worse.” More than four-in-nine black Americans in swing districts say the same of immigration.\nMeanwhile, nearly two-in-three likely American voters say they want to see legal immigration to the U.S. reduced, as Breitbart News noted. A most recent poll found that a majority of conservatives say they generally oppose all immigration to the U.S.\nMost recent polling finds that a majority of white, black, and Hispanic Americans support Trump’s agenda of increased immigration enforcement with stricter measures.\nCongress has until September 30 to fund the federal government.\nCurrently, the U.S. admits more than 1.5 million legal and illegal immigrants every year. In 2016, the legal and illegal immigrant population reached a record high of 44 million. By 2023, the legal and illegal immigrant population is expected to make up nearly 15 percent of the entire U.S. population if current immigration levels continue.","url":"https://www.breitbart.com/politics/2018/07/29/trump-wall-shut-down/"}
