{"authors":[],"date_download":"2018-10-30 21:13:14","date_modify":"2018-10-30 21:13:14","date_publish":"2018-06-28 14:05:00","description":"President Donald Trump and Russian President Vladimir Putin plan to meet next month for a summit in...","filename":"data/vaneerConsumption/TrumptomeetwithPutinonJuly16.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/06/28/Videos/4426389.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_trump-and-putin-meet-helsinki-july__1540933994.html","title":"Trump to meet with Putin on July 16","title_page":"Trump to meet with Putin on July 16","title_rss":"NULL","source_domain":"ajc.com","text":"President Donald Trump and Russian President Vladimir Putin plan to meet next month for a summit in Helsinki, Finland, White House and Kremlin officials announced Thursday.\n>> Read more trending news\nThe meeting will take place July 16. Officials said Trump and Putin plan to discuss the relationship between their two countries and a range of national security issues.\n“I think we’ll be talking about Syria. I think we’ll be talking about Ukraine. I think we’ll be talking about many other subjects,” Trump told reporters at the White House on Wednesday.\nNational security adviser John Bolton finalized plans for the summit Wednesday during a slew of meetings in Moscow with Russian officials, including Putin, according to NPR.\nPutin noted that U.S.-Russian relations are at a low point while greeting Bolton Wednesday in the Kremlin, The Associated Press reported. Bolton acknowledged after the meetings that the planned summit might generate “political noise,” but he said the meeting would ultimately benefit the U.S.\n“It’s important for the leaders of these two countries to meet,” Bolton said. “There are a wide range of issues, despite the differences between us, where both President Trump and President Putin think they may be able to find constructive solutions. I’d like to hear someone say that’s a bad idea.”\nVladimir Putin - Fast Facts\nTrump has called for improving the relationship between the two countries, although critics at home have expressed worry that he might be willing to overlook Russian abuses in order to reach that goal.\n“A lot of people have said or implied over time that a meeting between President Trump and President Putin would somehow prove some nexus between the Trump campaign and the Kremlin, which is complete nonsense,” Bolton said. “The president recognizes there may be some criticism of this decision to have the meeting. … But what must guide his conduct of American foreign policy is the pursuit of American national interests. And he judges – correctly in my view – that this bilateral summit between himself and President Putin is something he needs to and will do, regardless of political criticism at home.”\nThe meeting comes as the Justice Department continues to investigate Russian meddling in the 2016 presidential election and its possible ties to Trump and his campaign. The president has denied colluding with Russia to win the election and frequently calls the federal probe a “witch hunt.” Putin has denied that his government interfered in the election.\nAhead of Thursday’s announcement, Trump wrote on Twitter that “Russia continues to say they had nothing to do with Meddling in our Election!”\nRussia continues to say they had nothing to do with Meddling in our Election! Where is the DNC Server, and why didn’t Shady James Comey and the now disgraced FBI agents take and closely examine it? Why isn’t Hillary/Russia being looked at? So many questions, so much corruption! — Donald J. Trump (@realDonaldTrump) June 28, 2018\nU.S. intelligence officials have said there is clear evidence Russia meddled in the election.","url":"https://www.ajc.com/news/national/trump-and-putin-meet-helsinki-july/tHLGJoIXyoT0bsWVDY2o9K/"}
