{"authors":[],"date_download":"2018-10-30 01:05:11","date_modify":"2018-10-30 01:05:11","date_publish":"2018-09-09 00:01:35","description":"An anonymous Trump administration official confessed in an opinion piece published Wednesday that many senior officials “are working diligently from within to frustrate parts of his agenda and his worst inclinations.“I know. I am one of them.”","filename":"data/vaneerConsumption/TrumpOthersQuestionCredentialsIntegrityofAnonymous.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/Donald_Trump_Cabinet_meeting_2017-03-13_02.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861511.html","title":"Trump, Others Question Credentials, Integrity of Anonymous","title_page":"Trump, Others Question Credentials, Integrity of AnonymousThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Washington\nAn anonymous Trump administration official confessed in an opinion piece published Wednesday that many senior officials “are working diligently from within to frustrate parts of his agenda and his worst inclinations.\n“I know. I am one of them.”\nThere are many ways to react to the anonymous piece published by the New York Times.\nSen. Lindsey Graham, R-S.C., offered one take. He told CNN that in his world, people don’t care much about what runs in the New York Times. Fair enough.\nOthers questioned the author’s integrity or credentials.\nAri Fleischer, press secretary for President George W. Bush, tweeted, “Support the President or don’t work there.”\nJennifer Palmieri, former communications director for President Barack Obama, noted that “this person could easily be someone most of us have never heard of” — for example, a deputy of a department most voters don’t know.\nFox News host Tucker Carlson berated the unknown official’s presumption for bashing the anti-free trade positions that Trump promised Americans as he campaigned for office. Ditto Trump’s attempts to make nice with Russia, which the author said steady hands in the bureaucracy have undermined.\nCarlson found the notion that staffers would try to sabotage an elected official’s policies downright anti-democratic.\nFirst lady Melania Trump had a message for the author: “To the writer of the op-ed, you are not protecting this country, you are sabotaging it with your cowardly actions.”\nIndeed, the piece seemed written deliberately to send the president down a nasty rabbit hole with rants and recriminations — the exact behavior to which the unknown author objected.\nPresident Donald Trump’s reaction was a combination of rage and self-pity.\nThe president addressed a group of sheriffs gathered in the East Room shortly after the Timesposted the piece. “A lot of times you’re looked at and you’re scorned,” Trump told the room, scorned, that is, by “the media because the media is very dishonest.”\nTrump then offered that the men and women in uniforms were “I guess, a little bit like me.”\nTrump cited the good economic news under his watch — 4 million jobs created, 400,000 new manufacturing jobs and record unemployment — all claims that were close enough to accurate and worthy of praise. And he was right that he does not get enough credit for the strong economy.\nThen he called the unknown author’s piece “gutless,” and later tweeted, “TREASON?”\nThe White House press corps’ reaction was to ask every administration suit who walked near a camera if he or she wrote the piece. Cable TV could not get enough of the story. Pundits were demonstrably unperturbed at having to rely once again on an anonymous source.\nThe story had every element that many Americans hate about the news media: a backstabber hiding in the shadows, palace intrigue in lieu of policy, and a reward for lack of loyalty.\nLike the anonymous author, I support Trump’s commitment to deregulation and increasing military spending. I strongly approve of his Supreme Court picks, his decision to move the U.S. embassy to Jerusalem, and his decision to reach out to Egypt after President Obama.\nStill, I believe that there are people in the administration toiling to protect the president from himself and the country from the president’s worst impulses. And I believe that one of them snapped.\nAfter the story appeared, Vice President Mike Pence’s office and members of Trump’s Cabinet tweeted denunciations of the “gutless op-ed” and declarations denying authorship.\nBut I believe the anonymous official in the New York Times, however high or low that person might be. I believe it because I’ve read the president’s tweets.\nContact Debra J. Saunders at dsaunders@reviewjournal.com or 202-662-7391. Follow @DebraJSaunders on Twitter.\nCOPYRIGHT 2018 CREATORS.COM","url":"https://spectator.org/trump-others-question-integrity-credentials-of-anonymous-author/"}
