{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:08:11","date_modify":"2018-10-30 20:08:11","date_publish":"2016-12-06 23:52:14","description":"President-elect Donald Trump so far appears inclined to appoint a total of five military officers to top national security posts.","filename":"data/vaneerConsumption/TrumpMayAppoint5MilitaryOfficerstoTopAdminPosts.json","image_url":"https://media.breitbart.com/media/2016/11/wi/afp/21/3ln7iht-e1481068324201.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_12_06__1540930091.html","title":"Trump May Appoint 5 Military Officers to Top Admin Posts","title_page":"Trump May Appoint 5 Military Officers to Top Admin Posts","title_rss":"NULL","source_domain":"breitbart.com","text":"President-elect Donald Trump so far appears inclined to appoint a total of five military officers to top cabinet and national security posts within his administration, a move that has been described as “unprecedented” by some analysts.\nTrump has already named retired Marine Gen. James “Mad Dog” Mattis as his secretary of defense and retired Army Lt. Gen. Michael Flynn as White House National Security Adviser.\nRetired Marine Gen. John Kelly, a border security hawk and the U.S. military’s longest serving general, has emerged as the president-elect’s top contender for Secretary of Homeland Security.\nTwo other retired high-ranking military officer, Army Gen. David Petraeus and Navy Adm. Michael Rogers are also being considered for top posts within the Trump administration.\nGen. Petraeus could be the next Secretary of State and Adm. Rogers the Director of National Intelligence (DNI). The Senate will have to confirm Gens. Mattis, Petraeus, and Kelly for their cabinet posts.\nIn an article published by the Washington Post’s (WaPo) Monkey Cage blog, author Peter White, a postdoctoral researcher at the Center for International Development and Conflict Management at the University of Maryland, points out that it would be a groundbreaking accomplishment if Trump succeeds in placing five military officers in top positions.\nOther presidents have appointed retired military officers to top posts within their administration: President George W. Bush appointed retired four-star Army general and former chair of the Joint Chiefs of Staff Colin Powell to the Secretary of State position.\nHowever, the number of former military officers being considered by President-elect Trump and their potential positions “is unprecedented,” writes White.\nUnsurprisingly, Trump’s decision to appoint high-ranking military officers has stirred controversy, particularly when it comes to retired Gen. Mattis for secretary of defense, which critics believe defies one of the oldest traditions of America’s constitutional government: civilian control of the military.\nSupporters of Trump’s decision argue such tradition is satisfied by the president serving as the commander-in-chief of the U.S. armed forces.\nWhen the U.S. Department of Defense replaced the War Department in 1947, Congress determined that the Secretary was to be appointed from “civilian life,” noting no military officer could hold the post until seven years after his or her service.\nHowever, Congress has the prerogative to issue a waiver. It did just that under President Truman, who appointed five-star Army Gen. George C. Marshall to serve as Pentagon chief from 1950 to 1951.\nCongress has the authority to do so again to accommodate Trump’s choice for Pentagon chief.\nIn the WaPo op/ed, White criticizes Trump for trying to place more than three high-ranking military officers within his cabinet, arguing that doing so would place the United States in the same category as dictator-led autocracies such as Zimbabwe, adding that advanced democracies have no more than two military officers holding top positions in the executive branch.\nMeanwhile, the New York Times (NYT) suggests:\nTurning to the retired officers reflects Mr. Trump’s preference for having strong, even swaggering, men around him. But it worries national security experts and even other retired generals, who say that if Mr. Trump stacks critical jobs purely with warriors, it could lead to an undue emphasis on military force in American foreign policy.\nStephen K. Bannon, the president-elect’s chief strategist and Breitbart News’ former chairman, defended the president-elect’s decision to bring in high-ranking military officers with combat experience into the incoming administration.\n“The generation that has fought in these wars is now coming into leadership,” said Mr. Bannon, who served in the Navy. “These people, all patriots, come with a shared experience that is incredibly important.”\nSome lawmakers who served in combat, namely Rep. Ryan Zinke (R-MT), Sen. John McCain (R-AZ), have also welcomed Trump’s decision.","url":"https://www.breitbart.com/national-security/2016/12/06/peter-white-trumps-appointments-military-officers-will-turn-u-s-autocracy/"}
