{"authors":[],"date_download":"2018-10-23 02:53:58","date_modify":"2018-10-23 02:53:58","date_publish":"2017-03-10 12:13:11","description":"US President Donald Trump will on Friday speak by telephone with Palestinian president Mahmud Abbas, the White House said, in the first call between the two...","filename":"data/vaneerConsumption/TrumptospeakwithPalestinianpresidentAbbas.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/14/wire-196463-1489156392-120_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4301054_Trump-speak-Palestinian-president-Abbas_1540263238.html","title":"Trump to speak with Palestinian president Abbas","title_page":"Trump to speak with Palestinian president Abbas | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US President Donald Trump (L) is to speak over the phone with Palestinian president Mahmud Abbas for the first time on March 10, 2017\nUS President Donald Trump will on Friday speak by telephone with Palestinian president Mahmud Abbas, the White House said, in the first call between the two leaders.\nTrump received Israeli Prime Minister Benjamin Netanyahu at the White House in mid-February.\nAt that meeting, Trump said he was not bound to the two-state solution for ending the Israeli-Palestinian conflict, distancing himself from a position held by his predecessors for years.\nHe said he would back whichever solution -- one-state or two -- that the two sides agreed on.\nAbbas spokesman Nabil Abu Rudeineh confirmed Friday's call to AFP and said the Palestinian leader would \"reaffirm his commitment to peace.\"\nThe peace process has been deadlocked since April 2014 following the collapse of indirect negotiations led by then secretary of state John Kerry.\nThe US ambassador to the United Nations, Nikki Haley, on Tuesday met for the first time with the Palestinian envoy to the world body, Riyad Mansour.\nAfter the talks, Haley tweeted that the Palestinians should \"meet with Israel in direct negotiations rather than looking to the UN to deliver results that can only be achieved through the two parties.\"","url":"https://www.dailymail.co.uk/wires/afp/article-4301054/Trump-speak-Palestinian-president-Abbas.html"}
