{"authors":["Charlie Spiering"],"date_download":"2018-10-30 18:42:39","date_modify":"2018-10-30 18:42:39","date_publish":"2017-03-08 13:52:55","description":"President Donald Trump recognized International Women’s Day on Wednesday, citing his “tremendous respect” for women throughout the world.","filename":"data/vaneerConsumption/TrumpAnnouncesTremendousRespectforWomenonInternationalWomensDay.json","image_url":"https://media.breitbart.com/media/2016/10/Women-for-Trump-in-Florida-Joe-RaedleGetty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_03_08__1540924959.html","title":"Trump Announces 'Tremendous Respect for Women' on International Women’s Day","title_page":"Trump Announces 'Tremendous Respect for Women' on International Women’s Day","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump recognized International Women’s Day on Wednesday, citing his “tremendous respect” for women throughout the world.\n“I have tremendous respect for women and the many roles they serve that are vital to the fabric of our society and our economy,” he wrote on Twitter. “On International Women’s Day, join me in honoring the critical role of women here in America & around the world.”\nIvanka, Trump’s daughter, also recognized the day.\n“Today, we celebrate women and are reminded of our collective voice and the powerful impact we have on our societies and economies,” she tweeted:\nToday, we celebrate women and are reminded of our collective voice and the powerful impact we have on our societies and economies. #IWD2017 — Ivanka Trump (@IvankaTrump) March 8, 2017\nSome women have organized to recognize the day by boycotting their jobs and duties for “A Day Without a Woman” so that more people understand women’s contributions to society.\nThe protest has led some schools to cancel classes for the day and some employers to offer female employees the day off.","url":"https://www.breitbart.com/politics/2017/03/08/trump-announces-tremendous-respect-women-international-womens-day/"}
