{"authors":["Jack Montgomery"],"date_download":"2018-10-30 18:26:28","date_modify":"2018-10-30 18:26:28","date_publish":"2018-07-15 12:06:38","description":"Reuters claims Sam Brownback intervened on behalf of Tommy Robinson and expressed concern over his safety to Britain's ambassador to the U.S.","filename":"data/vaneerConsumption/TrumpAdminSupportedTommyRobinsoninMeetingwithBritAmbassador.json","image_url":"https://media.breitbart.com/media/2018/07/Tommy-Robinson-Sign.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_15__1540923988.html","title":"Trump Admin Supported Tommy Robinson in Meeting with Brit Ambassador","title_page":"Claim: Trump Admin Supported Tommy Robinson in Meeting with Brit Ambassador","title_rss":"NULL","source_domain":"breitbart.com","text":"Donald Trump’s administration intervened on behalf of anti-grooming gangs campaigner Tommy Robinson and expressed concerns over his safety to Britain’s ambassador to the U.S., sources claim.\nSam Brownback, President Trump’s Ambassador-at-Large for International Religious Freedom, reportedly asked Britain’s Sir Kim Darroch to treat the counter-extremism activist more sympathetically, or the U.S. administration may feel compelled to publicly criticise Britain’s handling of his case, according to two sources in contact with the organisers of a ‘Free Tommy’ demonstration held on July 14th.\nReuters, which broke the story, claimed a British official confirmed the intervention, telling them that Ambassador Brownback had raised the issue of Robinson’s imprisonment during a meeting which covered a range of “religious freedom issues”.\nPresident Trump’s son, Donald Jr., is known to be sympathetic to Robinson’s case, describing his imprisonment as “Reason #1776 for the original Brexit” — a reference to the American colonies’ break with the mother country in the 18th century.\nOfficially, Robinson was sent down for contempt of court for breaking reporting restrictions surrounding certain grooming gang trials, with critics claiming that if jurors heard him express or imply a view on defendants’ guilt it could prejudice their deliberations.\nSuch gagging orders are essentially impossible in the United States due to the First Amendment, which prevents the state from “abridging the freedom of speech, or of the press”, with jurors trusted to exercise their personal judgement in sifting out third-party opinions and judging cases on the evidence presented in court.\nReason #1776 for the original #brexit. Don’t let America follow in those footsteps. https://t.co/6QLejT61i4 — Donald Trump Jr. (@DonaldJTrumpJr) May 27, 2018\nA source close to the story told Breitbart London that “Free Tommy advocates in Washintgon D.C. have been in contact not just with the U.S. State Department, but with members of Congress on Capitol Hill and more,” claiming that Ambassador Brownback “heard about Tommy case and was immediately disturbed by the implications for free speech.”\nSeveral figures on Capitol Hill have already expressed concerns over the Robinson case, with Congressman Paul Gosar, of Arizona, publicly tweeting to the President that he was “concerned about the arrest & conviction of Tommy Robinson in Great Britain,” and that the “British Gov’t seems more interested in covering up rape than seeking truth.”\nCongressman Gosar later told Breitbart London: “I certainly hope the United States intervenes and speaks up over the persecution of Tommy Robinson. I think the injustice of not being able to bring light to the situation dissolves all equitable application of the rule of law.”\nA spokesman for the U.S. State Department disputed the “characterizations” of Reuters’ account of Ambassador Brownback’s meeting with Sir Kim.\nFollow Jack Montgomery on Twitter: @JackBMontgomery","url":"https://www.breitbart.com/europe/2018/07/15/claim-trump-administration-spoke-up-tommy-robinson-meeting-british-ambassador/"}
