{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:31:51","date_modify":"2018-10-30 19:31:51","date_publish":"2018-07-11 14:59:08","description":"President Trump and German Chancellor Angela Merkel discussed a German gas pipeline to Russia that Trump had openly criticized Wednesday.","filename":"data/vaneerConsumption/TrumpandGermanysMerkelDiscussRussiaGasPipeline.json","image_url":"https://media.breitbart.com/media/2018/07/TRump-Merkel.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_11__1540927911.html","title":"Trump and Germany’s Merkel Discuss Russia Gas Pipeline","title_page":"Trump and Germany’s Merkel Discuss Russia Gas Pipeline | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump and German Chancellor Angela Merkel held a pull-aside meeting at the NATO summit in Brussels, Belgium, on Wednesday during which they discussed a German gas pipeline to Russia that Trump had openly criticized that morning.\n“We’re having a great meeting,” Trump told reporters of his meeting with Merkel. The Chancellor and Trump were seated next to each other as they spoke with the press about their meeting.\n“We have a very, very good relationship with the Chancellor,” said Trump and he called the U.S.-Germany relationship “tremendous.”\nPresident Trump said that the two leaders were discussing military spending and trade.\nHe commended the Chancellor on Germany’s “tremendous success.”\n“I believe that our trade will increase, and lots of other things will increase,” said Trump. “We’ll see what happens over the next period of a few months.”\nTrump Blasts Hypocritical Germany as ‘Captive of Russians’ at NATO summit https://t.co/tXeNwfRaVg — Breitbart London (@BreitbartLondon) July 11, 2018\nMerkel then spoke to the press in German. The comments were interpreted through a translator. She welcomed the “opportunity to be here for this exchange of views.”\n“Indeed, we have an opportunity to have an exchange of our economic developments on issues such as migration and also the future of our trade relations,” Merkel said according to the translator. “We are partners, we are good partners and we wish to continue to cooperate in the future.”\nPress asked Trump if he and Merkel had discussed the natural gas pipeline to Russia that Germany has paid Russia for and Trump had brought up at a morning breakfast meeting with NATO Secretary General Jens Stoltenberg.\nTrump confirmed that “yes” he and Merkel had discussed the pipeline in their meeting. He did not elaborate on the content of that discussion.\nAt a breakfast meeting with NATO Secretary General Jens Stoltenberg Wednesday morning Trump excoriated Germany for making a “massive oil and gas deal with Russia, where you’re supposed to be guarding against Russia.”\n“So we’re protecting you against Russia, but they’re paying billions of dollars to Russia, and I think that’s very inappropriate,” Trump said to Stoltenberg.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/europe/2018/07/11/trump-germany-merkel-discuss-russia-gas-pipeline/"}
