{"authors":[],"date_download":"2018-10-30 01:06:26","date_modify":"2018-10-30 01:06:26","date_publish":"2016-02-11 00:00:00","description":null,"filename":"data/vaneerConsumption/TrumpMaybeCitizenKanebutnotLonesomeRhodes.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_02_trump_maybe_emcitizen_kaneem_but_not_emlonesome_rhodesem_1540861586.html","title":"Trump: Maybe Citizen Kane, but not Lonesome Rhodes","title_page":"Trump: Maybe Citizen Kane, but not Lonesome Rhodes","title_rss":"NULL","source_domain":"americanthinker.com","text":"Trump: Maybe Citizen Kane, but not Lonesome Rhodes\nMarc Fisher’s Washington Post comparison of Donald Trump to 1957s A Face in the Crowd fictional movie character Larry “Lonesome” Rhodes, an anti-hero played brilliantly by Andy Griffith, is a superficial one at best. University of Pennsylvania Ivy Leaguer, Mr. Trump may be a showman in the vein of P.T. Barnum -- a candid, uncensored, larger than life presentation style like Rhodes -- but the billionaire is no folksy hayseed or drunken jailbird. Both men ride the tide of the public's discontent to the height of political influence as non-politicians in the age of television, but neither “character” can be blamed for doing that. In the case of Lonesome Rhodes he thinks his audience is stupid and has contempt for them: “Only they're more stupid than I am, so I got to think for them.” On the other hand, Trump referring to himself as stupid is out of the question (just ask him). Likewise, while it was a mistake for him to mislabel Iowans as stupid in the specific case of believing in Ben Carson's claim to have been a violent youth, that is not the sweeping hatred Lonesome Rhodes has for his viewing audience. That's just Mr. Trump bluntly calling political circumstances as he sees them. It's a political double-edged sword that appeals to some and turns off others, but that polarizing love-hate dynamic is true of every candidate running for public office. The critical difference lies in Rhodes's smarmy, manipulative scorn for his followers versus Trump's trust in the American people's intelligence to share his disdain for how poorly the political establishment on both sides has run things specifically over the last 7 years.\nThe rise of Joe Biden's storybook (“[F]irst mainstream African-American who is articulate and bright and clean and a nice-looking guy”) Barack Obama was an extreme and untested adverse reaction to the then unpopular George W. Bush. To extend the parallel, Donald Trump is an equivalent negative reaction to the current administration, incompetent Democrats and weak-willed Republicans alike. The Trump political phenomenon is a wholesale rejection of the establishment candidates of the beltway bubble, and specifically a repudiation of Obama's multitude of failures, phantom pipe dream promises of hope and “change” resulting in economic downturn and long-term stagnation. Naysayers criticize Trump of a lack of detail related to his campaign pledges, but government is now so powerful and bureaucratic (read: “the problem”) that explicit “plans” are unnecessary. Today a U.S. president is little more than a director of intention and a manager of resources. Indeed, how is that different from being a captain of industry like Mr. Trump? And unlike the professional politician ruling class susceptible to the economic catnip of special interest lobbyists, Mr. Trump is bankrolling his own campaign and is not “for sale” to the highest bidder á la the influence-peddling Clintons (read: “Clinton Cash”). Despite being a colorful and controversial figure, bombastic Donald Trump won in New Hampshire and leads in the national polls because he is outspoken for America first. (Contrast that to Democrats who are always blindly party first, party always). Mr. Trump says the things average Americans grumble about as radically far left Democrats push America further over a cliff to mediocrity and socialistic ruin. What a novel concept: a plain-speaking leader who recognizes the people's will for a change! Because Lonesome Rhodes wasn't the genuine article, comparing Trump to him reveals The Washington Post's essay is in actuality a propagandist smear piece. In truth, Lonesome Rhodes is much more like modern day Democrats: snake-oil salesmen who depend on the ignorance (\"Those morons out there? Shucks, I could take chicken fertilizer and sell it to them as caviar\") of MSM-fed low information voters. Ignore your lying eyes on the incompetence, they imply with sleazy, disingenuous smiles. Elect me solely on the basis of the novelty of ethnicity or gender. (Sound familiar, Hillary supporters?) She’s the real “face in the crowd” political trickster whom the Post ignores here, and supports overall. Is Mr. Trump presidential material? Only time will tell, but it is overtly cynical to compare The Donald to Lonesome Rhodes. An apt comparison is actually cinematic classic Citizen Kane, a man whose vast wealth fueled an even bigger ego, an obsessive need for public adoration and, like Trump, a birthright entitlement to high elective office. David L. Hunter is on Twitter and blogs at davidlhunter.blogspot.com. He has previously been published in The Washington Post, The Washington Times, \"FrontPage Mag,\" and extensively in \"Canada Free Press\" and \"American Thinker.\"","url":"https://www.americanthinker.com/articles/2016/02/trump_maybe_emcitizen_kaneem_but_not_emlonesome_rhodesem.html"}
