{"authors":["Abc News","More Conor"],"date_download":"2018-10-30 00:57:42","date_modify":"2018-10-30 00:57:42","date_publish":"2018-10-29 12:30:29","description":"President Trump called Brazil's new conservative president to congratulate the controversial leader who has praised the country's former military dictatorship.","filename":"data/vaneerConsumption/TrumpcongratulatesBrazilsnewfarrightpresident.json","image_url":"https://s.abcnews.com/images/International/jair-bolsonaro-01-gty-jef-181029_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Politics_trump-congratulates-brazils-president_story_id=58829346_1540861062.html","title":"Trump congratulates Brazil's new far-right president","title_page":"Trump congratulates Brazil's new far-right president - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"President Trump called Brazil's new conservative president to congratulate the controversial leader who has praised the country's former military dictatorship and made disparaging remarks about women, Afro-Brazilians, and the LGBT community.\nInterested in Donald Trump? Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News. Add Interest\nJair Bolsonaro, who won election on Sunday in a run-off vote, ran on a campaign similar to Trump's, tapping into the country's deep dissatisfaction with economic stagnation, years of corruption, and rising violence. With an 11 percentage point victory, he emerged as the clear winner despite those incendiary remarks of the past.\nBut it's also because of those comments that he was sometimes referred to as \"Trump of the Tropics\" – a comparison that he embraced.\nTrump tweeted on Monday that the two leaders had \"a very good conversation\" when they spoke Sunday night.\n\"We agreed that Brazil and the United States will work closely together on Trade, Military and everything else! Excellent call, wished him congrats!\" the president said.\nKevin Lamarque/Reuters\nThe administration embraced Bolsonaro on Monday, with White House Press Secretary Sarah Sanders saying, \"We value our longstanding relationship with Brazil. We want to be able to continue to work with them.\" The State Department added that the U.S. \"look[s] forward to working with President-elect Bolsonaro in the coming years,\" in areas of mutual concern \"to promote security, democracy, economic prosperity, and human rights.\"\nThe similarities between the presidents could usher in a new era of cooperation between the Western hemisphere's two largest countries on trade, as Trump tweeted, but also on the humanitarian and political crisis in Venezuela, countering drug trafficking, and pushing back against environmental regulations.\nBolsonaro has proposed opening up the Amazon rainforest to agribusinesses like farming and logging and threatened to withdraw Brazil from the Paris climate accord, just as Trump did.\nBut there are fears from human rights groups that the country will see a democratic decline under Bolsonaro, who's been criticized as \"a far-right, gun-loving, media-baiting hyper-nationalist\" by former World Bank chief economist Kaushik Basu, now a nonresident fellow at the Brookings Institute.\nIt's likely inevitable that his time in office will see \"human rights violations and retrenchment of social and environmental policies,\" according to Elizabeth Leeds, a senior fellow at the Washington Office on Latin America.\nAs Bolsonaro's victory became more likely, \"An atmosphere of permissiveness towards intolerance, hate crimes, and violation of electoral laws has permeated the country,\" Leeds wrote Sunday. \"Whether Bolsonaro will temper his remarks and his policies if elected remains to be seen, but his growing popularity has unleashed an unprecedented number of hate crimes and violence throughout the country.\"\nIn particular, a Brazilian investigative journalism group reported more than 70 politically motivated attacks in the first 10 days of this month.\nThe political violence comes on top of a record 63,880 murders across the country in 2017, or 175 per day.\nLike Trump, Bolsonaro's answer for a country reeling from violence has been to talk tough about \"law and order\" – at times, by touting violence as the answer to quell crime. He himself was a victim of violence, stabbed in the chest while out campaigning in early September.\nAFP/Getty Images\nHe's called for laxer gun ownership laws and giving police greater license to kill suspected criminals. He's also talked fondly of Brazil's military dictatorship, which ruled the country with brutality from 1964 to 1985, saying it should have killed more dissidents instead of jailing them. More recently during the campaign, he's pledged to uphold democracy.\nBut minority groups fear that that won't extend to them. Bolsonaro's history of disparaging remarks is more widely known, including saying he would not love a gay son and would rather he died and telling a fellow member of Congress, a woman, \"I would never rape you because you do not deserve it.\"\nIn fact, last month, Brazil's public prosecutor charged Bolsonaro with inciting discrimination against black people, indigenous people, women, and gays with his public comments, according to Reuters.\nThose comments may have also made Bolsonaro more popular, casting an image of a rebel and an outsider – which was popular in a country sick of the status quo.\n\"Bolsonaro rejects the policies and corruption of the past that brought Brazil to its current state,\" wrote Roger Noriega, the top U.S. diplomat for Latin America and U.S. envoy to the Organization of American States under President George W. Bush. \"Using blunt attacks that are not new in Brazil, he is an authentic voice against a corrupt political class that has dug the country into a very deep hole.\"\nBut that does not make him the Brazilian Donald Trump, Noriega wrote for the conservative American Enterprise Institute, where he is a visiting fellow because he \"isn't copying anyone's style.\"\nWhen asked at the White House on Monday about the comparisons, Sanders said with a smile, \"There's only one Donald Trump in my opinion.\"","url":"https://abcnews.go.com/Politics/trump-congratulates-brazils-president/story?id=58829346"}
