{"authors":["Dan Bobkoff"],"date_download":"2018-10-30 23:52:10","date_modify":"2018-10-30 23:52:10","date_publish":"2016-12-05 00:00:00","description":"Trump's tax plan may make it harder for many taxpayers to deduct their mortgage interest, charitable giving, and state taxes.","filename":"data/vaneerConsumption/Trumptaxplancouldchangemortgageinterestandcharitydeductions.json","image_url":"https://amp.businessinsider.com/images/5841df31e02ba75f658b64a0-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trump-tax-plan-mortgage-charity-deduction-changes-2016-12_1540943530.html","title":"Trump tax plan could change mortgage interest and charity deductions","title_page":"    Trump tax plan could change mortgage interest and charity deductions - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Steve Mnuchin. AP President-elect Donald Trump's pick for treasury secretary, Steven Mnuchin, told CNBC last week that the incoming administration is about to embark on the \"largest tax change since Reagan.\"\nThe change he's referring to could have a big effect on mortgage interest deductions — a driver of the housing market — and weaken an incentive for charitable giving.\nKey features of Trump's plan could also lead to changes with state and local government tax collection. It all comes down to standardized deductions — the amount of write-offs you can claim without having to provide lots of documentation (or even spending money on any of the things you can write off).\nTo be clear, only two things are certain at this point about the tax code under Trump's plan: It will look very different, and we don't fully know the details.\nTrump's plan differs in some significant ways from one put forward by Republican Speaker of the House Paul Ryan. And Trump's plan is vague in places, and it has changed during the campaign.\nThat said, here are some of Trump's major objectives:\nBoth Trump and Ryan say they want to simplify tax filing for most Americans. Independent analysts at the Tax Policy Center and the Tax Foundation agree that's likely. Of the roughly 143 million tax filers in the US, currently about 48 million of them itemize their deductions, which means they need detailed records of how much they gave to charity, paid in mortgage interest to a bank, and anything else that might offer a write-off. That number would fall by more than half, to 22 million itemizers, if Trump's plan goes through.\nHere are some of the effects that could have:\nMortgage interest deduction\nFewer Americans would deduct their mortgage interest under Trump's tax plan. Thomson Reuters The deductions for mortgage interest and charitable giving are \"apple pie and baseball for the tax code,\" Richard Auxier, a research associate at the Tax Policy Center, told Business Insider.\nThat's why neither plan eliminates these deductions — that would be a political disaster.\nHowever, \"Trump's tax plan does effectively limit two itemized deductions without explicitly doing so,\" Kyle Pomerleau, director of federal projects at the Tax Foundation, told Business Insider. \"By increasing the standard deduction, it reduces the number of itemizers.\"\nHere's what Pomerleau means:\nLet's say a single filer pays about $10,000 in mortgage interest in the first year they own a home. That far exceeds the current $6,300 standard deduction, so they itemize their deduction to claim a greater tax break. It's one reason they decided to buy rather than rent.\nBut under Trump's plan, they're better off taking the standard deduction. Their taxes are simpler, but no longer significantly different than if they had rented. That's why industry groups are watching closely.\n\"Doing anything that would limit incentives for homeownership is a fundamental step in the wrong direction that could harm home values and keep more buyers on the sidelines,\" William Brown, president of the National Association of Realtors, said in a statement to Business Insider.\nMichael Fratantoni, chief economist at the Mortgage Bankers Association, told Business Insider that few would defend the current tax code's complexity, but \"the other side of the argument is that mortgage interest deduction helps homeowners by lowering the cost of their interest on an after-tax basis,\" which is particularly effective for first-time buyers, he said.\nMany economists, though, say the mortgage interest deduction does not actually incentivize more Americans to buy homes. But it does encourage those who do to spend more on housing or buy a bigger home, which brings us to the next possible effect of these plans: It could push down home prices, especially in expensive cities like New York and San Francisco, where the mortgage deduction takes some of the sting out of taking out jumbo loans to pay for small spaces.\n\"They might still own the house, but they won't pay as much\" for it, Roberton Williams of the Tax Policy Center told Business Insider.\nThat said, many lower-income Americans would have lower taxes, which would encourage them to spend money on all sorts of things, including housing, according to Todd Sinai of the University of Pennsylvania's Wharton School.\nFeeling less charitable?\nFewer people itemizing could mean fewer donations to charities. Flickr/Emery Graham When that hypothetical homeowner above started itemizing their taxes to get the mortgage interest deduction, they likely became more generous, too — because once you start itemizing, every dollar you donate lowers your tax bill further.\nHere again, the higher standard deduction under the Trump proposal means that this benefit of charitable giving would vanish for many taxpayers.\nAs the standard deduction \"goes up, it's reducing the incentive for giving,\" David Thompson, vice president for public policy at the National Council of Nonprofits, told Business Insider.\nBut there's an even bigger threat to nonprofits. One version of Trump's tax plan proposes capping the wealthiest Americans' deductions to $100,000 for single filers, and twice that for those who are married. This means that wealthy couples who want to give a million dollars to fight poverty or put their names on a college building would be able to deduct a fifth of that.\n\"Clearly we feel strongly on that,\" Thompson said, adding that data from states that have capped deductions show it seriously hurt nonprofits, sometimes by amounts greater than the additional revenue the government brought in.\nOn top of that, there's another reason wealthy givers may be disincentivized to be generous under the tax plans: A lower top tax bracket also means donors save less on their taxes when they give.\nRight now, \"if you're a high-income tax payer [donating to charity], you're getting 39 cents on the dollar,\" Pomerleau said. \"If you take it from 39.6% to 33%, you've automatically reduced the incentive right there.\"\nGiven the popularity of charitable deductions, this is a benefit that could end up surviving without a cap in a final tax plan. The Ryan plan, for instance, preserves the charitable-giving tax break. Pomerleau said there are other options, too. The government could give directly to charities, or write checks to Americans who give.\nState and local governments\nThe Connecticut State Capitol. Flickr Our current tax system makes it easier for state and local governments to raise your taxes. That's because those property, sales, and income taxes are deductible from your federal earnings.\n\"Some consider it an implicit subsidy to state and local governments,\" Pomerleau said. \"When they increase their taxes, they're passing their burden to the federal government. At the margin, it allows states and local governments to increase taxes.\"\nFor wealthy Americans living in higher-tax states like California and New York, it can be a big tax break at the 39.6% bracket, so those wealthy residents are less likely to complain to their statehouse. The states with higher taxes tend to be more liberal. And the various tax plans differ on whether they completely or partially eliminate the subsidy for local taxes.\nPomerleau said this is likely to spark a big debate in Congress.\n\"From a policy standpoint, limiting the state and local deduction requires states to have their citizens realize the full burden of their taxation,\" he said. State and local leaders would have to say, \"We're providing you these services, we think they're valuable, so we're going to sell them on their merits rather than passing some of it onto the federal government.\"\nIt's unclear if eliminating this deduction would actually lead to higher or lower taxes at the local level. Auxier said past experiences suggest the effect could be minimal. States didn't lower sales taxes during a brief period in the 1980s when the deduction was eliminated. And when the top tax rate went from 35% to roughly 39% in 2012, states didn't take advantage by raising taxes.\n\"A lot of states don't want to see it go because of the advantage it gives them,\" Auxier said. \"But what states do is an open question.\"\nSome in the middle class could be worse off\nSome middle-class Americans may be worse off under the Trump plan. There are other big changes and effects from Trump's tax proposal. Despite caps on total deductions, the wealthy may still benefit greatly from much lower taxes on business income.\nTwo changes in the plan could also increase taxes for many middle-class families.\nFirst, it eliminates personal exemptions, which are about $4,000 for individuals and each of their children or dependents. Second, it eliminates the \"head of household\" tax filing status that's typically used by single parents. So millions of families with many kids — and single parents — could end up with higher taxes under Trump's proposal, according to an analysis by Lily Batchelder of the New York University School of Law.\n\"All heads of household would be made worse off,\" said Williams of the Tax Policy Center.\nMnuchin, Trump's treasury secretary pick, told CNBC that the members of the incoming administration \"don't believe in that analysis.\"\nAnd he left open the possibility that this could be fixed in a final plan.\n\"When we work with Congress and go through this, it will be very clear,\" he said. \"This is a middle-income tax cut.\"\nIt'll be up to Congress to decide the ultimate winners and losers in the tax changes that are likely in the next year.","url":"https://www.businessinsider.com/trump-tax-plan-mortgage-charity-deduction-changes-2016-12"}
