{"authors":[],"date_download":"2018-10-23 01:58:38","date_modify":"2018-10-23 01:58:38","date_publish":"2016-01-28 16:40:26","description":"Is it a combover? Contemporary art, maybe? Or, wait, a cross between an otter's tail and a blooming ear of corn? Donald Trump's signature helmet of hair has ...","filename":"data/vaneerConsumption/Trumpshairhasstylistsshakingtheirheads.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h2d9-4vVdYopwYQ7f641721b07af4a06f-373_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421287_Trumps-hair-stylists-shaking-heads_1540259918.html","title":"Trump's hair has stylists shaking their heads","title_page":"Trump's hair has stylists shaking their heads | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Trump's hair has stylists shaking their heads\nIs it a combover? Contemporary art, maybe? Or, wait, a cross between an otter's tail and a blooming ear of corn?\nDonald Trump's signature helmet of hair has top stylists shaking their heads and spewing scathing criticism.\nThe Republican frontrunner's do -- which descends down his forehead and ranges in shade from canary yellow to tawny orange depending on the season and lighting -- has become so synonymous with the man himself that it even made it onto a cover of The Economist.\nUS Republican presidential candidate Donald Trump removes his hat to show that his hair is real during a political rally at Ladd-Peebles Stadium on August 21, 2015 in Mobile, Alabama ©Mark Wallheiser (Getty/AFP/File)\n\"Washington, we have a problem ...\" the respected magazine entitled a tongue-in-cheek photo montage showing Trump's tresses suspended from a helicopter hovering above the White House.\nIndeed, hairdressers to the rich and famous told AFP.\nTrump's mop is a \"cross between an otter's tail and an ear of corn,\" quipped Frederic Mennetrier, a French coiffeur whose high-end clientele includes reality star Kim Kardashian and Brazilian model Alessandra Ambrosio.\nAs for the color?\n\"In a word: abstract. Contemporary art,\" he added. \"It makes us think of many things -- except what he'd like us to.\"\nStephane Bodin, whom Hollywood stars Uma Thurman and Naomi Watts have trusted with their locks, piled on.\nTrump's \"egg yolk yellow\" hair is the \"height of bad taste.\"\n\"Normally, people hide their foreheads because they're timid or introverted, but that's not the case here,\" Bodin said of the outspoken real estate mogul known for not mincing words and sparking scandal in the process.\nTrump's hair -- or possible lack of it -- has supposedly preoccupied \"The Donald\" for decades.\nAccording to an unauthorized biography, it sparked a fight as far back as 1989 between him and his then-wife Ivana -- the couple divorced in 1991 -- who recommended a doctor he blamed for a botched scalp reduction procedure.\nIf Ivana's loyal hairdresser Louis Licari is to be believed, Trump ended up getting hair transplants.\n- Working it -\nWaving wagging tongues aside, Trump knows how to work the hair hullabaloo to his advantage.\n\"It may not be pretty but it's mine,\" he has insisted unabashedly.\nThis summer, he went so far as to summon a supporter on stage during a campaign event in South Carolina to prove his point, letting her get up close to check for herself in an episode that once again proved Trump's media savviness and ability to connect with the public.\nStill, the do debate rages on.\n\"I think it is real hair and that is the reason he has a combover,\" said Cristophe, a Beverly Hills stylist whose roster of high-profile customers has contained the names Dustin Hoffman and Bruce Springsteen.\n\"Eighty percent of Donald Trump's hair is combed over to one side to cover as much as possible and make it look as thick as possible,\" he added.\nJoseph Kendall, cofounder of Joseph Martin Hair and Beauty in Beverly Hills who has counted Paris Hilton among his clients, was blunter.\nIt is \"a combover to hide either a receding hairline or bald spot,\" he said.\n\"Looked a lot better on singer Little Richard than on Mr. Trump.\"\n- Hair in the headlines -\nThe style gurus suggested that toning down the look a little could go a long way.\n\"I have no issue with a bit of color as long as it looks natural,\" Kendall said.\n\"I would then suggest cutting it into a more normal style that would not raise so many negative comments.\"\nCristophe said he would go slow, snipping off a little more each month.\n\"His sides should be shorter and I think you can make the top look better without having a combover,\" he said. \"The back of his hair is also substantially too long.\"\nBut Cristophe -- who famously cropped former president Bill Clinton's hair while Air Force One stood on the tarmac in Los Angeles in what became known as \"Hairgate\" -- acknowledged that a revamp would cause a ruckus.\n\"I think he is doing the best with what he has and has gotten attached to a certain image,\" he said.\n\"If he ever changed his hair that would create headlines around the world.\"\nDonald Trump's signature helmet of hair has top stylists shaking their heads and spewing scathing criticism ©Darren McCollester (Getty/AFP/File)\nDonald Trump's signature hairstyle is even featured on top of the Republican elephant symbol in campaign buttons for sale in Iowa ©Jim Watson (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3421287/Trumps-hair-stylists-shaking-heads.html"}
