{"authors":["John Nolte"],"date_download":"2018-10-30 20:32:37","date_modify":"2018-10-30 20:32:37","date_publish":"2015-07-13 12:57:51","description":"Because he's a left-wing propagandist working for a left-wing propaganda outlet, CNN New Day anchor Chris Cuomo told the world today that sanctuary cities |","filename":"data/vaneerConsumption/TrumpReducesCNNtoOutrightLyingSanctuaryCitiesDontExist.json","image_url":"https://media.breitbart.com/media/2015/03/zucker_cnn_rect.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_07_13__1540931557.html","title":"Trump Reduces CNN to Outright Lying: Sanctuary Cities Don't Exist","title_page":"Trump Reduces CNN to Outright Lying: Sanctuary Cities Don't Exist | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Because he’s a left-wing propagandist working for a left-wing propaganda outlet, CNN New Day anchor Chris Cuomo told the world today that sanctuary cities don’t exist. The description is a “misnomer,” Cuomo said. “They are not safe havens,” Cuomo added, “It’s about how they follow the [immigration law] process.”\nWith a straight face, Cuomo dropped this nuclear lie while doing what he never does to Democrats: interrogating Michael Cohen, an advisor to Republican presidential frontrunner Donald Trump:\nMICHAEL COHEN: I’ll tell you what [Trump] did do, he opened up the eyes of many Americans who didn’t even know sanctuaries existed. CHRIS CUOMO: What sanctuaries? MC: These sanctuaries on the border that allow illegals to stay — if in fact they end up getting caught, they cannot deport them. CC: You’re talking about sanctuary cities that exist all over the country? MC: Exactly. CC: That’s misnomer. Those are cities that are in dispute with ICE about how you deal with people they are holding. MC: They are part of the United States. You can’t be in dispute with the federal government. CC: They are not safe havens the way you’re describing. MC: They most certainly are safe havens. CC: They are not. It’s about how they follow the process. MC: They will not turn them over, Chris. They will not turn them over. CC: They will. There’s a legal process\nThere are over 250 cities and counties in America that refuse to deport illegal aliens. According to the Center for Immigration Studies, “These sanctuary policies obstruct federal law authorizing U.S. Immigration and Customs Enforcement (ICE) to administratively deport illegal aliens without seeking criminal warrants or convictions from federal, state, or local courts.”\nThis is open defiance of federal law, and no different from the defiance we saw from racist Southern Democrats during the civil rights struggle.\nAccording to Cuomo, in just 8 months there have been 8145 “misnomers” across the country.\nCuomo is both a liar and a charlatan. If cities and counties were to defy federal law regarding same sex marriage or any other left-wing cause, he’d be screaming MISSISSIPPI BURNING, not inventing lies about “legal disputes.”\nThe left, and this obviously includes CNN and Cuomo, don’t want to discuss sanctuary cities because they know it’s a losing issue with voters. The left’s goal is to flood America with undocumented Democrats and these 250-plus sanctuary cities are a vital tool in that battle.\nOn top of simply refusing to cover the horror show of these outlaw cities and counties, when the issue is brought up the rape-deniers and CNN have now decided to outright lie with, “Elephant? What elephant?”\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/the-media/2015/07/13/trump-reduces-cnn-to-outright-lying-sanctuary-cities-dont-exist/"}
