{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:30:19","date_modify":"2018-10-30 19:30:19","date_publish":"2018-07-24 18:52:32","description":"The Trump administration announced a $12 billion farmer emergency aid plan to temporarily mitigate the effects of U.S. tariffs.","filename":"data/vaneerConsumption/TrumpAdminAnnouncesEmergencyFarmerAidPlantoMitigateTariffEffects.json","image_url":"https://media.breitbart.com/media/2018/07/farmer-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_24__1540927819.html","title":"Trump Admin Announces Emergency Farmer Aid Plan to Mitigate Tariff Effects","title_page":"Trump Admin Announces Emergency Farmer Aid Plan to Mitigate Tariff Effects","title_rss":"NULL","source_domain":"breitbart.com","text":"The Trump administration announced on Tuesday that a $12 billion farmer emergency aid plan is in the works on Tuesday to temporarily mitigate the effects of U.S. tariffs and ongoing trade negotiations.\nThe U.S. Agriculture Department, headed by Secretary Sonny Perdue, released the plan on Tuesday. Perdue was instructed this year to investigate potential remedy to farmers’ concerns about tariffs and trade disputes between the U.S. and its trading partners.\nThe Washington Post reported details of the $12 billion plan, according to two sources who had been briefed on it:\nThe funds will come through direct assistance, a food purchase and distribution program, and a trade promotion program. It will rely in part on a Depression-era program called the Commodity Credit Corporation, a division of the Agriculture Department created in 1933 to offer a financial backstop for farmers.\nThe plan is expected to go into effect by Labor Day according to the Post.\nThe Associated Press also reported the news and cited two anonymous sources briefed on the plan. The plan was expected to involve temporary relief measures.\nRetaliatory tariffs levied on the U.S. by trading partners have taken aim at America’s farmers, including many soy and pig farmers, the AP noted. The retaliation followed new U.S. tariffs on Chinese goods and tariffs on steel and aluminum aimed at Chinese steel dumping and heavy-handed Chinese import requirements.\nPerdue said the temporary relief measures are an attempt to help American farmers challenged by “disruptive markets,” according to the AP.\nIn June, Perdue assured farmers that President Trump “will Protect American Farmers from China’s Trade Retaliation.” He pointed to the benefits the tax cut plan passed in 2017 will have on farmers while emphasizing the importance of combatting China’s rule-breaking trading practices. He wrote in the op-ed that ran in the USA Today, “The president has instructed me to craft a strategy to support our farmers in the face of retaliatory tariffs.”\n“The president is a tough negotiator, and I am confident that American agriculture will flourish because of trade relationships that are smarter, stronger and better than before,” Perdue said in the June op-ed. “China might underestimate the strength and resolve of American farmers, but the president does not. And he will not allow our agricultural producers to suffer because of China’s continued bad actions.”\nMichelle Moons is a White House Correspondent for Breitbart News — follow on Twitter @MichelleDiana and Facebook.","url":"https://www.breitbart.com/politics/2018/07/24/trump-admin-announces-emergency-farmer-aid-plan-mitigate-tariff-effects/"}
