{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 18:36:39","date_modify":"2018-10-30 18:36:39","date_publish":"2017-02-02 02:38:43","description":"President Trump started off 2017 with more than $7 million in his campaign coffers, according to new Federal Election Commission filings. | Politics","filename":"data/vaneerConsumption/TrumpAlreadyRaisedOver7Millionfor2020ReElectionCampaign.json","image_url":"https://media.breitbart.com/media/2017/02/Trump-and-Supporters-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_02_01__1540924599.html","title":"Trump Already Raised Over $7 Million for 2020 Re-Election Campaign","title_page":"Trump Already Raised Over $7 Million for 2020 Re-Election Campaign | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Trump started off 2017 with more than $7 million in his campaign coffers, according to new Federal Election Commission filings.\nThe majority of the donors have been small donors who continued to donate after the 2016 election, giving Trump a head start on fundraising for his 2020 re-election campaign, the Washington Post reported.\nTrump’s campaign committee started the year debt-free and has continued to solicit donations from supporters.\nHis campaign had $7.6 million in the bank as of Dec. 31, but that figure has likely grown since then.\nTrump easily reached the $5,000 threshold that requires filing an official statement of candidacy for the next election thanks to ongoing fundraising efforts by the president’s campaign committee.\nHe submitted a letter to the FEC on Inauguration Day, but emphasized that the paperwork “does not constitute a formal announcement of my candidacy for the 2020 election.”\nTrump’s campaign committee, the Republican National Committee, and their two joint fundraising committees collected $13.5 million between Nov. 29 and Dec. 31, a year-end surge that showed how supporters were excited about a Trump win.\nEven though Trump hasn’t formally announced his candidacy, he has already trademarked his 2020 campaign slogan, which will be “Keep America Great.”","url":"https://www.breitbart.com/politics/2017/02/01/trump-already-raised-over-7-million-for-2020-re-election-campaign/"}
