{"authors":[],"date_download":"2018-10-22 21:33:03","date_modify":"2018-10-22 21:33:03","date_publish":"2016-12-01 00:00:00","description":"His new hotel's $200 million renovation was financed by Deutsche Bank. The Justice Department is set to impose a multibillion-dollar fine on the bank. And Trump will oversee the Justice Department.","filename":"data/vaneerConsumption/TrumpsLoansFromTroubledGermanBankPoseConflictOfInterest.json","image_url":"https://media.npr.org/assets/img/2016/11/30/gettyimages-618307512_wide-42fcafb58740b1700f59b174fdb24d68dc1bb14c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=503903737_1540243983.html","title":"Trump's Loans From Troubled German Bank Pose Conflict Of Interest","title_page":"Trump's Loans From Troubled German Bank Pose Conflict Of Interest : Parallels : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nForty-four Americans have been elected president of the United States. So far as we know, none has ever run a brand-new luxury hotel down the street from the White House. President-elect Donald Trump has such a hotel, the Trump International, in a landmark building that used to be the U.S. Post Office. Now that hotel is a focus of the debate over conflicts of interest between his public duty and private business. NPR's Jackie Northam reports on the loans that finance the hotel and a contract that says a government official cannot run it.\nJACKIE NORTHAM, BYLINE: The Trump International Hotel is a stately old building with turrets, arches and a clock tower soaring 300 feet into the air. Inside, the lobby is equally impressive. It's a vast, airy indoor courtyard with massive chandeliers, a grand staircase and a glass ceiling 10 floors up there's a restaurant at one end. At the other, overlooked by four giant TV screens, is the bar.\n(SOUNDBITE OF CHAMPAGNE CORK POPPING)\nNORTHAM: In 2013, Trump signed a 60-year lease for the building and then began a $200 million renovation with the help of loans from a large German bank, Deutsche Bank. Trump's financial disclosure reports, viewed by NPR, shows he currently owes Deutsche Bank roughly $365 million dollars in loans for the Washington hotel, another in Chicago and a Florida golf course.\nSIMON JOHNSON: Deutsche Bank is one of the large global banks investing in, betting on real estate around the world. So it makes some sense that they would be exposed to Mr. Trump.\nNORTHAM: Simon Johnson, a professor at MIT's Sloan School of Management, says Trump has had a relationship with the Frankfurt-based bank spanning nearly two decades, and it's his largest financial backer. But he says Deutsche Bank is in deep trouble with the Justice Department over a number of allegations.\nJOHNSON: The tip of the iceberg is a particular fine by the Department of Justice, a large fine, which the opening numbers are around $14 billion, with regard to how they created and sold mortgage-backed securities before 2008.\nNORTHAM: Johnson says there are private negotiations underway over the amount of that fine, with the bank and the German government pushing back. Johnson says this sets up a huge conflict of interest for Trump once he takes office - because Trump will then be overseeing the Justice Department, which is negotiating a fine with his biggest lender.\nJOHNSON: Does it look bad? Does it look like exactly someone might cut Deutsche Bank a deal because they want their boss's boss to be happier? Yeah. Absolutely, of course - and that's why we try to avoid the appearance of a conflict of interest.\nRICHARD PAINTER: It would be best if that particular case were resolved under the Obama administration, with a settlement in the few weeks here that remain.\nNORTHAM: Richard Painter is the former chief White House ethics lawyer in the George W. Bush administration. He says even if the case against Deutsche Bank can be resolved, there are other potential conflicts surrounding the Trump International Hotel, such as guests staying there as a way to curry favor with Trump.\nPAINTER: The foreign diplomats who are coming in to stay at the hotel at the expense of their governments could create a very serious issue for the president.\nNORTHAM: Steven Schooner with George Washington University Law School says Trump's lease with the hotel should be terminated immediately because the terms of that lease say so.\nSTEVEN SCHOONER: The contract specifically says that no elected official of the United States government shall be party to, share in or benefit from the contract. It couldn't be any more clear than that.\nNORTHAM: The Trump transition team did not respond to requests for comment. On Wednesday, Trump said in tweets that he is taking steps to separate himself from his business operations. He gave no details but promised a December 15 press conference to reveal his plans.\nJackie Northam, NPR News.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=503903737"}
