{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:08:27","date_modify":"2018-10-30 21:08:27","date_publish":"2017-02-19 14:31:19","description":"The meeting between President Donald Trump and Prime Minister Benjamin Netanyahu marked a “symbolic reset of relations”.","filename":"data/vaneerConsumption/TrumpNetanyahuResetUSIsraelRelations.json","image_url":"https://media.breitbart.com/media/2017/02/bt.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_02_19__1540933707.html","title":"Trump, Netanyahu 'Reset' U.S.-Israel Relations","title_page":"Elliott Abrams: Trump, Netanyahu 'Reset' U.S.-Israel Relations","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – The meeting between President Donald Trump and Prime Minister Benjamin Netanyahu marked a “symbolic reset of relations” after eight years of “tension” between the two countries, a top American foreign policy expert said on Friday.\nSenior fellow for Middle Eastern Studies at the Council on Foreign Relations Elliott Abrams said on a conference call organized by the Jewish Institute for National Security of America (JINSA),\nWe have come through a period of eight years of tension at various levels, but particularly the top level. It’s clear that [former president Barack] Obama and Netanyahu didn’t get along, didn’t like each other. And that attitude was then communicated to the White House staff. You had a lot of backbiting, criticism of Netanyahu — all of that is over. We’ve returned now to the idea that there should be no daylight in public between the two governments. There will be plenty of disagreements, but those will be discussed in closed rooms and the relations at the top are obviously genuinely good. There is no artifice here about getting along.\n“That’s a critically important thing,” Abrams noted. “The whole US government takes its cue from the relationship at the top.”\nAbrams, who also served as deputy national security adviser to President George W. Bush, added, “Other governments also pay attention. I’ve always believed that most governments, particularly in Europe, base their relationship [with Israel] on ours. They don’t want to be quite as close to Israel. So if we’re distant, they’re more distant. If we’re close, then they get closer.”\nAbrams lauded Trump’s ambivalence regarding the two-state solution as being the key to solving the Israeli-Palestinian conflict.\nThe goal should never be a two-state solution, the goal is peace. And there are many ways of moving in that direction and there are several potential endpoints. And I think that it’s useful to the Israelis and for us to remind everybody that the goal is peace. We should not let the means become more important than the end, and we should think about that goal, rather than saying there is no other possible arrangement ever than the two-state solution.\nAbrams said that Trump’s request to Netanyahu to “hold back on settlements for a little bit” was not necessarily an instruction to stop building entirely.\nI think that [Trump was] moving back to the George W. Bush approach. And what was the Bush approach? Basically it was, don’t change the footprint [and] don’t expand the settlements geographically. Population growth, that’s different. Build up and in. In built-up areas, if you want to build a new house, a new apartment, that doesn’t affect the Palestinians or the chances of peace really. So the Google Earth map, if you put it that way, of the settlements doesn’t change.\n“We had a deal with [late Prime Minister Ariel] Sharon that was basically no new settlements, no physical — territorial — expansion of settlements and no financial inducements to move to a settlement. I think this administration is moving back to that view,” he added.","url":"https://www.breitbart.com/middle-east/2017/02/19/fmr-national-security-adviser-netanyahu-trump-reset-frayed-u-s-israel-relations/"}
