{"authors":["Julie Cart","David Gorn","Felicia Mello"],"date_download":"2018-10-30 23:07:49","date_modify":"2018-10-30 23:07:49","date_publish":"2017-04-28 00:00:00","description":"President Trump today signed an executive order that could open waters off the California coast to new oil and gas drilling, triggering outrage from state officials—and the unveiling of a plan to try to thwart future drilling.","filename":"data/vaneerConsumption/TrumpordercouldopenCaliforniacoasttooilandgasdrillingbutstateleadersunveilaplantothwartthat.json","image_url":"https://calmatters.org/wp-content/uploads/Screen-Shot-2017-04-28-at-1.05.13-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_trump_california__1540940869.html","title":"Trump order could open California coast to oil and gas drilling-but state leaders unveil a plan to thwart that","title_page":"Trump order could open California coast to oil and gas drilling—but state leaders unveil a plan to thwart that | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"President Trump today signed an executive order that could open waters off the California coast to new oil and gas drilling, triggering a volley of outrage from state officials scrambling to craft legislation to thwart future drilling.\n“It is stunning for us to learn this morning that the new administration in Washington is considering opening up California’s waters to new drilling,” said Kevin de Leon of Los Angeles, the state Senate’s Democratic leader. “We will oppose those efforts.”\nThe order instructs U.S. Interior Secretary Ryan Zinke to review locations in the Pacific for lease sales—areas that were placed off limits at least through 2022 by President Obama. The last time federal oil leases were offered off California was in 1984.\nThe battle could shape up as a war of words—the state has no jurisdiction over how Washington manages its mineral estate in federal waters, which begin three miles off the coast. California has authority over the Pacific from the beach to the three-mile limit. But Democratic legislators weighed in with a significant potential roadblock, preparing to introduce a bill next week that would prohibit the State Lands Commission from approving any new infrastructure that supports offshore oil and gas development.\nCalifornia Lt. Gov. Gavin Newsom, who chairs the Lands Commission, issued a statement saying the agency is “unequivocally resolved to create an environmental rampart along California’s coast. California’s door is closed to President Trump’s Pacific oil and gas drilling.”\nOffshore rigs generally pump crude through submerged pipelines to onshore receiving facilities, joining an extensive network of pipelines that move the oil to refineries. The proposed bill, while not stopping the drilling outright, would make it more expensive for companies to operate and could limit the volume of oil shipped at a time when the low price per barrel is already discouraging new exploration.\nDemocratic state Sen. Hanna-Beth Jackson, who is sponsoring the legislation, said a return to offshore oil exploration would take the state back to an “outdated, retro, madman era” and does not align with California’s values.\n“This not a distant or abstract issue,” she said. “This is deeply personal.”\nJackson represents Santa Barbara, where the memory of the massive 1969 oil spill that despoiled beaches and killed wildlife is still vivid. The area was hit again in 2015, when a pipeline failure sent more than 140,000 of crude oil onto the beach at Refugio State Park.\nState officials have long sought a permanent ban on offshore drilling, citing potential disruption to California’s $44 billion coastal economy. They have been joined by political leaders from Oregon and Washington in calling for legislation that would permanently protect the Pacific’s offshore waters from energy exploration.\n“New oil drilling along our coasts is unnecessary and dangerous,” said U.S. Sen. Dianne Feinstein, one of two Democrats representing California. “There’s no reason to expose more coastal economies to the risk of disastrous spills so oil companies can drill for hard-to-reach fossil fuels. Rather than signing reckless executive orders, the president should focus on investing in safer, cleaner energy sources.”\nTrump’s plan, which is certain to face legal challenges, also call for new leasing in the Atlantic and the Arctic Seas.\nIn signing the order, Trump said the directive would lead to prosperity and energy security: “It’s going to lead to a lot of great wealth for our country, a lot of great jobs for our country.”","url":"https://calmatters.org/articles/trump_california/trump-order-open-california-coast-oil-gas-drilling/"}
