{"authors":["Danielle Kurtzleben"],"date_download":"2018-10-23 00:47:20","date_modify":"2018-10-23 00:47:20","date_publish":"2017-01-09 00:00:00","description":"The appointment of the president-elect's son-in-law to a senior role could run into legal and ethics issues related to nepotism. Kushner plans to largely divest from his sizable business interests.","filename":"data/vaneerConsumption/TrumpNamesSonInLawJaredKushnerAsWhiteHouseSeniorAdviser.json","image_url":"https://media.npr.org/assets/img/2017/01/09/gettyimages-624198444_wide-3513f2d7fd59adccb89c7bd35088ca4baed66702.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2017_01_09_508990297_trump-to-reportedly-name-son-in-law-jared-kushner-as-senior-advisor_1540255640.html","title":"Trump Names Son-In-Law Jared Kushner As White House Senior Adviser","title_page":"Jared Kushner, Donald Trump's Son-In-Law, Named Senior Adviser To Incoming President : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Trump Names Son-In-Law Jared Kushner As White House Senior Adviser\nEnlarge this image toggle caption Spencer Platt/Getty Images Spencer Platt/Getty Images\nDonald Trump has named his son-in-law to a top White House job. Jared Kushner will serve as a senior adviser to the president, and the transition team says he will work with incoming Chief of staff Reince Priebus and chief strategist Stephen Bannon \"to execute President-elect Trump's agenda.\"\nBest News of the Day. Trump Son-in-Law Jared Kushner to Be Named Senior White House Adviser https://t.co/GGmpeUq2oA — Kellyanne Conway (@KellyannePolls) January 9, 2017\nThe announcement also says Kushner will not receive a salary while serving in the Trump administration, which could help alleviate legal problems stemming from federal anti-nepotism law.\nKushner, a 36-year-old real estate developer and publisher of the New York Observer, has been married to Trump's daughter Ivanka since 2009. When it was reported last week that they would be moving to Washington, D.C., it fed into speculation that one or both would serve as advisers in the Trump administration.\n\"Jared has been a tremendous asset and trusted advisor throughout the campaign and transition and I am proud to have him in a key leadership role in my administration,\" Trump said in a statement, nothing Kushner's success in business and politics, with his role in the inner circle of the president-elect's 2016 campaign.\nIn the statement, Kushner said, \"It is an honor to serve our country. I am energized by the shared passion of the President-elect and the American people and I am humbled by the opportunity to join this very talented team.\"\nBringing family members into the White House may prove difficult, though. That's because of a 1967 anti-nepotism law, inspired by another famous family, as NPR's Jim Zarroli recently reported:\n\"The anti-nepotism law was passed by Congress in response to President John F. Kennedy's decision to appoint his brother Robert as attorney general, says Darrell West, vice president and director of governance studies at the Brookings Institution. \" 'It was very controversial at the time. Lyndon Johnson in particular did not like that, and when he became president he helped shepherd this anti-nepotism law through the U.S. Congress,' West says.\"\nBut it's not entirely clear what that law means. Here is what the statute lays out, as NPR's Ailsa Chang reported in November:\n\"A public official may not appoint, employ, promote, advance, or advocate for appointment, employment, promotion, or advancement, in or to a civilian position in the agency in which he is serving or over which he exercises jurisdiction or control any individual who is a relative of the public official.\"\nAnalysis What Role Will Ivanka Trump Play In Her Father's Administration? What Role Will Ivanka Trump Play In Her Father's Administration? Listen · 4:46 4:46\nThe question now is what exactly \"agency\" means, Chang reported. This question has come up before — in a 1993 case pertaining to President Bill Clinton, who appointed wife Hillary to head up a health care reform task force. In that case (which was not in fact about nepotism at all), the judge mentioned in his decision that the statute didn't seem to apply to White House staff. But that still isn't settled law, Chang also reported.\n\"There's plenty of disagreement in the legal community about whether that bit from Judge Silberman's opinion is legally binding because it wasn't part of the reasoning for the central holding in the case.\"\nBut the fact that Kushner will not draw a salary could be key. Government ethics lawyer Ken Gross pointed out to NPR last November that the statute requires violators give up compensation, which he described as an ineffective way to enforce the law.\n\"So it sounds like you could have someone in an unpaid position, and then they've already suffered the penalty for violating the provision, and presumably, they would go on their merry way as an unpaid member,\" said Gross at the time.\nEven leaving aside the appointment's legality, it could also raise plenty of ethical questions. In a recent piece, the New York Times laid out the many possibilities for conflicts of interest to arise with Kushner in the White House. For example, the Times reports that Kushner \"played a pivotal role in persuading\" Trump to appoint Goldman Sachs President Gary Cohn — whose bank lent money to the Kushner Cos. — as director of the National Economic Council.\nKushner's legal counsel, Jamie Gorelick — who served as deputy attorney general during Bill Clinton's administration — told NPR's Jackie Northam on Monday that Kushner plans to divest from his real estate holdings in anticipation of serving in public office. \"He is going to restructure his business, so that he will no longer have any active involvement in Kushner Co. entities, which are real estate entities mostly in New York. He will divest a substantial number of his assets, and for any of those that remain he will abide by all the appropriate recusal requirements of the ethical guidelines,\" Gorelick said.","url":"https://www.npr.org/2017/01/09/508990297/trump-to-reportedly-name-son-in-law-jared-kushner-as-senior-advisor"}
