{"authors":[],"date_download":"2018-10-30 01:15:41","date_modify":"2018-10-30 01:15:41","date_publish":"2017-01-23 00:05:55","description":null,"filename":"data/vaneerConsumption/TrumpShouldDemandPalestiniansChoosePeaceorTerror.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/01/1024px-US_embassy_Tel_Aviv_6924.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862141.html","title":"Trump Should Demand Palestinians Choose Peace or Terror","title_page":"Trump Should Demand Palestinians Choose Peace or TerrorThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Addressing the American Israel Public Affairs Committee (AIPAC) back in March, President Trump said he wants to “move the American embassy to the eternal capital of the Jewish people, Jerusalem” to “send a clear signal that there is no daylight between America and our most reliable ally, the state of Israel.” When asked this week whether he remembers his promise about moving the embassy, Trump remarked, “Of course I didn’t forget. And you know I’m not a person who breaks promises.”\nPredictably, the Palestinians, with their usual sturm und drang, threaten the United States with violence if Trump follows through on this commitment — a tactic they have used very successfully to intimidate the U.S.\nWe hear dire warnings from the Palestinians of cataclysmic events to come if we dare move our embassy to Jerusalem.\nWe’ve seen this movie before.\nLet’s be clear: Jerusalem is the capital of Israel, where the government resides, where its parliament legislates and where the prime minister, president, and cabinet have their offices. This is the reality. However, the U.S. and other nations, fearful of crossing the Arab red line regarding Jerusalem, have always located their embassies in Tel Aviv.\nYou can’t name another internationally recognized independent country where the United States doesn’t have its embassy in that country’s capital. Israel is the only legitimate state in the world whose capital is not recognized by the rest of the international community. This is a blatantly unfair double standard that delegitimizes the Jewish state, denying the 3,000-year-long Jewish presence in its capital — Jerusalem — a city that has never been the capital of any state other than a Jewish state.\nDetermined to rectify this injustice, Congress in 1995 passed the Jerusalem Embassy Relocation Act with huge bipartisan support, requiring that we relocate our embassy to Jerusalem. But the law allows for the move to be waived if the president deems it harmful to U.S. national security. Since its passage, each U.S. president — Bill Clinton, George W. Bush, and Barack Obama — has signed the waiver every six months. Earlier this month, Obama renewed the waiver, delaying the move for another six months.\nOver the last 21 years, Congress has proposed legislation to press the president to move the embassy. Both the 1995 law and the 2016 Democratic and Republican party platforms agree that Jerusalem is the capital of Israel. On January 3 of this year, a new bill was proposed in Congress that would eliminate the president’s waiver authority.\nPalestinians have learned that the threat of violence can browbeat the world’s only superpower. But allowing blackmailers to dictate American foreign policy only emboldens them and others. History should have taught us that cowering before Palestinian bullying doesn’t lead to peace; it leads to more intimidation and terrorism. The move may cause destabilization in the short term, but if it’s not the American embassy issue, the Palestinians will find other excuses for bloodshed — it’s their modus operandi.\nDemands for Palestinian hegemony over Israel’s capital by Abbas and his European and UN flunkies will not change the reality that Israelis will never relinquish their historical and biblical capital and allow the Western Wall, the Temple Mount and the Jewish Quarter to be ethnically cleansed of Jews. This Palestinian endgame is a delusion.\nThe simple act of moving our embassy to Jerusalem will not only recognize the sovereignty of our ally, but will also show that, unlike presidents Obama, Bush, and Clinton, Trump cannot be intimidated and will not bow to threats. The Iranians, Russians, Chinese, ISIS, Assad, and the Taliban will also get the message.\nThe recent UN Security Council Resolution 2334 and Paris Peace Conference encourage unrealistic Palestinian expectations. These should be disabused quickly if the two sides ever have any hope of reaching a lasting, implementable agreement.\nThe embassy move is an opportunity to reset the presumptions and conversation as the new administration rolls out its Middle East policy. The Palestinians need to be put on notice that they must recognize Israel’s existence as a Jewish state. They must end terrorism, incitement, and an educational system that teaches hatred of Israel and Jews. The economic incentive and reward to murder Israelis, paid for by the U.S. and European taxpayer, must be halted immediately. Only then can the Palestinians be regarded as a partner for peace.\nIn the meantime, moving the U.S. embassy to Jerusalem would give the Palestinians a needed reality check. President Trump, the time to prove you are made of more than words is now.","url":"https://spectator.org/trump-should-demand-palestinians-choose-peace-or-terror/"}
