{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:25:12","date_modify":"2018-10-30 21:25:12","date_publish":"2015-07-07 19:07:26","description":"Trump Responds: NASCAR Put Political Correctness Over 'What Is Good For Our Country'","filename":"data/vaneerConsumption/TrumpRespondsNASCARPutPoliticalCorrectnessOverWhatIsGoodForOurCountry.json","image_url":"https://media.breitbart.com/media/2015/06/GettyImages-470223874.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_07__1540934712.html","title":"Trump Responds: NASCAR Put Political Correctness Over 'What Is Good For Our Country'","title_page":"Trump Responds: NASCAR Put Political Correctness Over 'What Is Good For Our Country' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On July 3 NASCAR cut ties with after GOP presidential hopeful Donald Trump after he called for securing our southern border. On July 6 Trump responded by lamenting that NASCAR has put political correctness over “what is good for our country.”\nHe called NASCAR’s decision “weak and very sad” and went on to remind his supporters that he will not be weak when it comes to closing the southern border.\nAccording to Business Insider, these were Trump’s exact words:\nI have lost a lot during this Presidential run defending the people of the United States. I have always heard that it is very hard for a successful person to run for President. Macy’s, NBC, Serta and NASCAR have all taken the weak and very sad position of being politically correct even though they are wrong in terms of what is good for our country.\nAnd he hedged this statement in, not by back peddling on his past statements about securing the border, but by offering an even more indepth explanation for why the border must be secured.\nTrump said:\nWhat can be simpler or more accurately stated? The Mexican Government is forcing their most unwanted people into the United States. They are, in many cases, criminals, drug dealers, rapists, etc. This was evident just this week when, as an example, a young woman in San Francisco was viciously killed by a 5 time deported Mexican with a long criminal record, who was forced back into the United States because they didn’t want him in Mexico.\nHe then pointed pointed out that the July 3 murder of Kathryn Steinle–allegedly by an illegal alien in San Francisco–is only “one of thousands of similar incidents throughout the United States” that everyday Americans don’t hear about because the mainstream media doesn’t report them.\nTrump went on to say, “In other words, the worst elements in Mexico are being pushed into the United States by the Mexican government” and the Obama administration is offering no opposition.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/07/07/trump-responds-nascar-put-political-correctness-over-what-is-good-for-our-country/"}
