{"authors":[],"date_download":"2018-10-30 01:11:53","date_modify":"2018-10-30 01:11:53","date_publish":"2018-08-17 00:05:55","description":null,"filename":"data/vaneerConsumption/TrumpHitsCommunistChinaandLiberalUniversities.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Signing_ceremony_6943869420.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861913.html","title":"Trump Hits Communist China and Liberal Universities","title_page":"Trump Hits Communist China and Liberal UniversitiesThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"President Trump this week delivered a blow against the corrupt communist Chinese and our corrupt liberal universities. The double-whammy was a delicious slap that few noticed, including the president’s supporters.\nUnbeknownst to the vast majority of Americans, including conservatives, the Chinese government has been busily establishing so-called Confucius Institutes on campuses all across the country. These centers are directly funded and largely staffed by the Chinese government, where they can present a cozy Shining-City-on-a-Hill version of Beijing. Liberal universities have rolled out the red carpet for these institutes, so long as the Chinese gravy-train ladles out the cash. If there’s one thing to make an educrat salivate, it’s a cash-cow. Apparently, for many universities, it doesn’t matter much if the milk comes from Uncle Sam or Chairman Xi.\nThe progressives on the university front are happy to drink up, and their hypocrisy is quite distasteful. Liberal academics gnashing their teeth over Russian meddling in the 2016 election against their beloved Hillary allow the Chinese to meddle on their campuses.\nAnd not merely meddle. As noted by FBI Director Christopher Wray, some Confucius Institutes may be engaged in espionage, notably at universities with top-notch research and STEM programs. The FBI, says Wray, is “warily” watching these groups.\nThat’s a good thing, given that many of the universities don’t seem to be warily watching.\nHow many campuses are involved? A handful? A dozen? No, over a hundred, according to the National Association of Scholars (NAS), which has done yeoman’s work on this matter, even creating a list of the colleges. A rare organization that fights for genuine diversity in college classrooms, NAS has been on this issue, namely with a ground-breaking report in 2017, titled, Outsourced to China. Rachelle Peterson, NAS’s director of research projects, has followed the money and the chain of command for the Confucius Institutes. She details how the institutes are a project of the Chinese government run through a front-group agency called the Hanban. The Hanban funds the institutes and staffs them with “teachers” carefully vetted, screened, and trained by the Hanban.\n(A crucial sidenote beyond the higher-ed aspect: NAS states that the Hanban has some 500 “Confucius Classrooms” in K-12 schools across America, which is surely another scandal waiting to be exposed. How many of our government schools are opening their doors and wallets to the Chi-comms?)\nThe whole thing stinks of what the Kremlin used to run with its bogus KGB-controlled “cultural exchange” programs. (A hilarious case I’ve written about is Oleg Kalugin, the later KGB defector, who in 1959 was placed by Moscow in Columbia University’s School of Journalism, where he and the Kremlin duped his progressive hosts into thinking he was a happy, innocent student from Russia. The young KGB officer went into Columbia under the cover of a Fulbright study exchange program.)\nSo, what did President Trump do to change this?\nOn Monday, Trump signed the 2019 National Defense Authorization Act. The $717 billion budget features some big-ticket military items that Trump says will constitute “the most significant investment in our military and our war fighters in modern history.”\nBut equally important is what the funding does not include: The National Defense Authorization Act includes a provision to limit funding to colleges and universities with Confucius Institutes. The act was passed by both the Senate and the House. And there, mainly in the Senate, great credit goes to Trump campaign rivals Ted Cruz and Marco Rubio, who have done excellent work exposing this quiet scandal on college campuses.\n“Their goal is to exploit America’s academic freedom to instill in the minds of future leaders a pro-China viewpoint,” states Marco Rubio. Rubio urged all educational institutions hosting Confucius Institutes in his home state of Florida (there are four of them) to end the partnerships.\nTed Cruz has been especially vigilant. “Communist China is infiltrating American universities to meddle with our curricula, silence criticism of their regime, and steal intellectual property, including sensitive dual-use research,” says Cruz. He calls the Confucius Institutes “the velvet glove around the iron fist of the [Chinese government’s] campaigns on our campuses.”\nCruz put forward a crucial amendment that would prohibit funding. He introduced legislation titled the Stop Higher Education Espionage and Theft Act, which attempted to monitor Confucius Institutes and other sources of foreign interference in American higher education. Cruz’s legislation required the FBI to create a list of “foreign intelligence threats to higher education.”\nTrump’s signature on Monday responds to this. As noted by Josh Rogin of the Washington Post, who has followed this topic more consistently than probably any other columnist, and who understands the legislative language, the National Defense Authorization Act that President Trump signed technically bars “any U.S. university from using Pentagon resources for any program involving Confucius Institutes, Chinese government-funded language schools embedded inside U.S. colleges.”\nIt’s a great move by President Trump, long overdue. President Obama certainly didn’t take such action. We can firmly doubt that a President Hillary Clinton would have either.\nAnd it’s especially refreshing to see these colleges held accountable. This country’s scandalously biased, monolithic, left-wing universities, which already bilk the nation’s youth with massive amounts of unsustainable debt, as they take wads of cash from federal and state governments, happily look to Red China for more money. Liberals permit universities to get away with their financial excesses because the universities serve as the primary training ground for developing liberals. Our universities are already centers of leftist indoctrination, whether pushing toxic ideologies under the guise of critical theory or “queer theory” or gender theory or “intersectionality” or whatever other intellectual twaddle. Now they also want to become centers for communist China?\nKudos to President Trump — and the likes of Ted Cruz, Marco Rubio, and the National Association of Scholars — for responding to this with some hardball.\nPaul Kengor is professor of political science at Grove City College. His books include A Pope and a President: John Paul II, Ronald Reagan, and the Extraordinary Untold Story of the 20th Century, Dupes: How America’s Adversaries Have Manipulated Progressives for a Century, and The Politically Incorrect Guide to Communism.","url":"https://spectator.org/trump-hits-communist-china-and-liberal-universities/"}
