{"authors":["Francesca Chambers","White House Correspondent For Dailymail.Com"],"date_download":"2018-10-22 22:37:05","date_modify":"2018-10-22 22:37:05","date_publish":"2017-03-16 04:04:56","description":"Trump is releasing a budget blueprint today that make deep cuts to some spending including foreign aid and public broadcasting to fund the Mexico wall and military build-up he promised.","filename":"data/vaneerConsumption/Trumpwants15bnforthewallbutwillcutPBSfunding.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/04/3E51C90A00000578-0-image-a-9_1489637968122.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4317198_Trump-budgets-wall-military-slashes-Sesame-Street_1540247825.html","title":"Trump wants $1.5bn for the wall but will cut PBS funding","title_page":"Trump wants $1.5bn for the wall but will cut PBS funding | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"President Donald Trump has released a budget plan that makes significant cuts to spending to fund his border wall and the military build-up he's been promising - and was called 'America First' by the official who wrote it.\nCut the deepest is the State Department, which is being slapped with a 28 per cent reduction to its foreign aid division. The Environmental Protection Agency and the Housing and Urban Development Department is also expected to suffer.\nThe Corporation for Public Broadcasting, which provides support to NPR and PBS - the broadcaster of Sesame Street - will see its funding phased out if Trump's budget makes it past the House and Senate over the objection of both conservatives and liberals.\nTrump is proposing the dramatic cuts to some agencies so he can put $1.5 billion toward his wall with Mexico this year and appropriate an additional $54 billion for defense in 2018 without adding to the federal deficit.\nSCROLL DOWN FOR VIDEO\nPresident Donald Trump, pictured returning from Nashville on Wednesday night, will release a budget blueprint today that makes cuts to discretionary spending to fund his border wall and the military build-up he's been promising\nU.S. President Donald Trump speaks to reporters aboard Air Force One as they approach Joint Base Andrews, Maryland following his rally in Nashville\nWinner: Other areas of government spending will be slashed to provide more cash for the military - including combat troops now deployed to Syria\nThe Corporation for Public Broadcasting, which provides support to NPR and PBS will see its funding phased out. PBS, the Public Broadcasting Service, was a creation of the CPB. It's most successful program is Sesame Street\nLOSER: The State Department, which is being slapped with a 28 percent reduction to its foreign aid division. Former Secretary of State John Kerry is pictured above with actress Angelina Jolie at a State Department event\nThe blueprint does not deal with mandatory spending on entitlement programs such as Social Security or revenue sources nor does it try to balance the federal budget.\nCuts to discretionary spending, which came in at over $1 trillion in 2017 according to theOffice of Management and Budget, are dollar for dollar, Trump's budget director said Wednesday. It will be up to affected agencies to figure out how to implement them.\n'We've given them a tremendous amount of flexibility within their own agencies this year,' OMB Director Mick Mulvaney claimed Wednesday during a briefing for White House reporters.\nHow much money State and the Department of Energy would be losing, he could not say. It was, however, expected to be a significant amount.\nBudget Director Mick Mulvaney says the State Department will see most of its discretionary budget eliminated if Trump's has his way - but only because he wants to get rid of foreign aid\n'This is a hard power budget. This is not a soft power budget,' Mulvaney said of the appropriations. 'This is a hard-power budget. And that was done intentionally. The President very clearly wants to send a message to our allies and our potential adversaries that this is a strong power administration.'\nIn 2017, State received $37.8 billion in discretionary spending. Most of that, $22.7 billion according to The Balance, went to foreign aid. That amounts to roughly two percent of what was put aside by the government for discretionary spending.\nA 2015 review conducted by NPR of foreign aid spending found that the largest share goes to HIV/AIDS programs. Economic development such as infrastructure building and Internet access, along with humanitarian assistance, accounts for another third of the money.\nMulvaney insisted that the reduction is not meant to minimize Secretary of State Rex Tillerson or his department - the foreign aid line items 'just happen to fall within their functions.'\n'We believe that we have protected the core diplomatic function of state, and that's why I say this is not a reflection of the president's policies regarding an attitude toward State,' he said. 'The president believes very strongly in what Mr. Tillerson is doing.'\nThe slashing of the diplomatic arm's budget had Sen. Lindsey Graham preemptively declaring Trump's budget 'dead on arrival' after the administration offered a preview of the blueprint two weeks ago.\n'It's not going to happen,' the Republican senator told NBC News. 'It would be a disaster.'\nGraham said the pared-down appropriations would put State Department employees at risk.\nHis concerns about the budget slashing were echoed by Republicans and Democrats that serve on the Senate's Foreign Relations Committee.\n'Foreign Aid is not charity,' Republican Sen. Marco Rubio said in a tweet. 'We must make sure it is well spent, but it is less than 1% of budget & critical to our national security.'\nDelaware Democrat Chris Coons argued, 'The aid we provide to countries around the world directly advances U.S. national interests by fostering a safer and more stable world.'\n'DEAD ON ARRIVAL': The slashing of the diplomatic portion of the federal budget had Sen. Lindsey Graham preemptively declaring Trump's budget a non-starter\nMitch McConnell, the top dog in the Senate, is also against the steep State Department cuts.\n'The diplomatic portion of the federal budget is very important and you get results a lot cheaper frequently than you do on the defense side,' the GOP leader told reporters, according to the Associated Press. 'So speaking for myself, I’m not in favor of reducing the (foreign aid) account to that extent.'\n'This is a hard power budget. This is not a soft power budget,' says OMB Director Mick Mulvaney\nCommenting on the coming assault on the State Department budget and other rumored chops, House Appropriations Committee Chairman Rodney Frelinghuysen, a Republican, told the Associated Press, 'We’ve reduced our discretionary spending over the last seven or eight years an incredible amount. Maybe some people don’t like those agencies, but it’s been pretty difficult for them to meet their mandate.'\nDefense spending will go up substantially, although not all of the money will be appropriated to the Pentagon, which has a $521.7 billion budget this year. The Department of Energy will get some of the money, for instance, for nuclear energy programs.\nTrump is also proposing $1.5 billion for construction of his proposed border fence in fiscal year 2017 and $2.6 billion the year after that.\nOf the $1.5 billion, Mulvaney said, 'It's all that we think that we can spend this year.\n'The next question is going to be, how many miles of wall does that build, right? And we don’t know the answer to that question because we haven’t settled on construction types,' he revealed. 'We haven’t settled on where we’re going to start.\n'I think the funding provides for a couple of different pilot cases...different kinds of barriers in different kinds of places, as we try and find the most cost-efficient, the safest, and also the most effective border protections. They may be different in different areas,' he stated.\nCut the deepest is the State Department, which is being slapped with a 28 per cent reduction to its foreign aid division\nSidelined: Mulvaney said Trump's budget is not meant to minimize Secretary of State Rex Tillerson or his department - the foreign aid line items 'just happen to fall within their functions'\nMulvaney said Trump's full FY 2018 budget, slated for May, will include 10-year cost projections for the wall the president has said will be paid for one way or another by Mexico.\nFor now, the money will come out of the general Treasury.\n'We did not say, we need $1.5 billion for the wall, let’s go over and reduce this program over at education, and move that $1.5 billion over to the wall. We dealt with it more holistically,' Mulvaney explained.\n'We plussed-up the various items I've talked about, and then we went looking for the most inefficient, most wasteful, most indefensible programs in other areas. So you couldn’t follow it dollar for dollar.'\nOverall, the Department of Homeland Security is slated to get a six percent increase in federal funds over its $40.6 billion budget this year, and Trump wants the Department of Defense to receive 10 percent more than it did in the past.\nMulvaney said the document also calls for an uptick in funds for private and public school choice and veterans' benefits, but he did not provide specific details.\nHe was also vague about funding for the National Institute of Health for studies on disease prevention - an area that Democrats have laced into the administration over.\n'The same time he’s talking about medical research he’s going to slash it,' Senate Democratic leader Chuck Schumer said at the end of February. 'Education. He talked about the great issue of education. Same thing. His budget is going to slash education to smithereens.'\nOne agency Mulvaney could recall receiving a diminution was NASA. Its $18.3 billion budget will be reduced by one percent, he said.\n'But a lot of the programs within there are actually increased in order to align with the President’s priorities, and that includes some of the exploring other planets.'\nPublic broadcasting funding, he said, will eventually be brought down to zero.\nSome amount of public broadcasting money is 'necessary' for now 'for us to unwind our involvement with the CPB,' he sad.\n'So you won't see a zero next to it. But the policy is that we're ending federal involvement with the Corporation for Public Broadcasting.'\nBy next year the line item might be zero, he added. 'But it may take a while to unwind that relationship. It's just the nature of contracts and so forth.'\nThe CPB's funding is relatively minuscule compared to how much Trump is proposing to spend annually on other programs.\nAt $445.5 million, it's a fraction of discretionary spending and will barely help Trump achieve his wish list.\nHUD is slated for reductions, as well, although Mulvaney did not say by how much. It received $38 billion in 2017.\nAt the briefing Mulvaney contended that 'a lot' of the 'wasteful programs, duplicative programs, programs that simply don’t work' fall under that department's purview.\n'We've spent a lot of money on Housing and Urban Development over the last decades without a lot to show for it,' the Cabinet official stated. 'Certainly there are some successes, but there's a lot of programs that simply cannot justify their existence, and that's where we zeroed in.'\nMulvaney said the Department of Transportation and its $12 billion discretionary spending budget is being reduced for the same reason.\nAmong the things funded by the Department of Transportation are Amtrak, the national passenger railroad, and subsidies for airports and interstates.\nAlso on Thursday, Mulvaney said the administration will be putting out a document that asks for revisions to the 2017 budget and a supplemental request of $30 billion for defense for the current fiscal year.","url":"https://www.dailymail.co.uk/news/article-4317198/Trump-budgets-wall-military-slashes-Sesame-Street.html"}
