{"authors":["John Hayward"],"date_download":"2018-10-30 19:09:32","date_modify":"2018-10-30 19:09:32","date_publish":"2016-11-23 22:31:35","description":"CNN Money made no bones about crediting the incredible post-election surge in the stock market to a \"Trump rally,\" as Wall Street hit the rare \"superfecta\": all four major indexes closing at record highs on the same day. | National Security","filename":"data/vaneerConsumption/TrumpRallyTakesWallStreettoHistoricSuperfectaHigh.json","image_url":"https://media.breitbart.com/media/2016/11/GettyImages-624633596.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_11_23__1540926572.html","title":"Trump Rally Takes Wall Street to Historic 'Superfecta' High","title_page":"Trump Rally Takes Wall Street to Historic 'Superfecta' High | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"CNN Money made no bones about crediting the incredible post-election surge in the stock market to a “Trump rally,” as Wall Street hit the rare “superfecta”: all four major indexes closing at record highs on the same day.\nMany predicted stocks would plunge, or even crash, should Trump upset Hillary Clinton. Initially that did happen, with overnight markets plummeting the night of the election. Yet that freakout proved short-lived, with stocks racing higher on Election Day. Instead of focusing on fears that Trump could start a trade war, investors are hoping the president-elect will unleash the U.S. economy by cutting taxes, rolling back regulation and ramping up infrastructure spending. “The basis for the rally is optimism about reversing Obama-nomics — raising taxes and increasing regulation,” said Peter Boockvar, chief market analyst at The Lindsey Group.\nUSA Today notes that Monday brought the first superfecta in 17 years, a rally fueled by “hopes that the president-elect’s growth-friendly policies will finally jolt the U.S. economy out of its multi-year doldrums:”\nAll-time highs were in abundance to start the week: Blue chips in the Dow Jones industrial average closed up 89 points to a record 18,956.69, extending its 2016 gain to nearly 9%. The benchmark Standard & Poor’s 500 finished 0.8% higher at 2198.18, its highest close ever. The tech-packed Nasdaq composite rallied 0.9% to a record 5368.86. And the Russell 2000, a stock index filled with the market’s smallest companies, extended its winning streak to 12 sessions on its way to an all time record close of 1322.23 and a 16.4% gain for the year. That is the Russell 2000’s longest winning streak since June 2003. “It is the first time the S&P 500, Dow, Russell 2000, and Nasdaq all closed at a new high on the same day since Dec 31, 1999,” says Ryan Detrick, senior market strategist at LPL Financial.\nBaird chief investment strategist Bruce Bittles told USA Today the market is “viewing the new administration as friendly toward business,” which is “180 degrees from what markets have experienced the past eight years.”\nThat is not what the mainstream media told us for the past eight years. They told us President Obama was super-duper business-friendly, and investors understood his limp economy was the best America could possibly hope for. The media sneered at the idea regulations impose tremendous costs on the private sector, or that individual investors could spend money more wisely than Obama’s central planners. They told us Hillary Clinton was an even bigger technocratic genius than Obama.\nAnd yet, with the defeat of Hillary Clinton, investors are acting as if the tower of Sauron just collapsed, freeing the land from a terrible shadow. USA Today points out that not even rumors of a Federal Reserve rate hike are dampening the euphoria – outside of bond traders, of course.\nReuters reported on Tuesday that even European stocks are rising, drawn upward by the U.S. market surge: “The Dow topped 19,000 points and the S&P 500 moved past 2,200 points for the first time ever, while the pan-European STOXX 600 index and the FTSEurofirst 300 of top regional shares climbed to their highest levels since Nov. 10.”\nIn an interesting aside, Reuters attributes some of the market’s optimism to hopes that OPEC will finally “overcome internal disputes and strike a deal to reduce crude output,” addressing a crash in oil prices that has been dragging the global economy down for years.\nThere have been many stories about OPEC teetering on the verge of a deal in the past, all of them ending the same way Charlie Brown’s efforts to punt invariably end when Lucy holds the ball, but maybe this time it will happen.\nOr maybe not, since just a few hours after publishing its Trump rally story, Reuters ran another piece entitled “Oil prices turn negative on worries over OPEC output cut,” with Iran, Iraq, Nigeria, and Libya described as the intransigent parties.\nCNBC lists three reasons to think the Trump rally won’t last:\n1. These are merely proposals – nothing has been implemented yet.There will be pushback from some in the legislative bodies that the proposals suggested are not neutral taxation balanced. In other words, the proposed policies will likely increase deficits and that is not a popular course of action especially among Tea Party legislators 2. Stronger economic growth through reduced tax rates could trigger inflation. Higher inflation increases financing costs for companies and individuals and is a headwind for economic growth 3. The strength of the dollar could negatively impact U.S. corporate profits. Already, companies are beginning to warn about the earnings impact from the strength of the dollar. When the dollar strengthens, goods and services become more expensive to buyers from outside of the United States and this is a negative to corporate profits.\nBut even this dose of pessimism is softened with speculation that market euphoria will keep bubbling until “sober reality sets in,” sometime during the second quarter of 2017, as “legislative agendas are proposed and potentially implemented,” and the strong dollar starts cutting into corporate earnings.","url":"https://www.breitbart.com/national-security/2016/11/23/trump-rally-takes-wall-street-historic-superfecta-high/"}
