{"authors":["Matthew Debord"],"date_download":"2018-10-30 23:24:25","date_modify":"2018-10-30 23:24:25","date_publish":"2016-12-07 00:00:00","description":"His administration might make the auto industry in the US very happy.","filename":"data/vaneerConsumption/TrumpcouldgivetheUSautoindustryexactlywhatitwants.json","image_url":"https://amp.businessinsider.com/images/58485772e02ba7c45e8b6ee1-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trump-could-give-the-us-auto-industry-exactly-what-it-wants-2016-12_1540941865.html","title":"Trump could give the US auto industry exactly what it wants","title_page":"    Trump could give the US auto industry exactly what it wants - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Good for cars? Sara D. Davis/Getty Images Donald Trump tangled with the auto industry during the presidential campaign, decrying in particular Ford's plan to relocate small-car production to Mexico.\nUltimately, Trump's tweetshaming was sound and fury, signifying nothing. US automakers have been building cars in Mexico and Canada for decades, long before borderless free-trade and NAFTA became major campaign issues.\nUBS auto analyst Colin Langan published a research note this week in which he assessed the impact of Congress' corporate tax reform plan — primarily a tax cut and a deal to repatriate offshore cash — and a \"border adjustment\" proposal that would tax imports to the US, but exclude exports.\n\"The ... rules would have a large impact on the automakers as imports would face significantly larger taxes than domestic production,\" Langan wrote. \"However, GM and Ford are far better positioned than their competitors. Over 95% of F & GM US sales are from N American plants. Within N America, only 21% and 37% of Ford and GM production is in Mexico or Canada.\"\nTogether, Ford and GM control over a third of total market share in the US.\nThe real benefit\nFor much of the US auto industry, then, protectionist border tariffs wouldn't affect business all that much, although the effect on the cross-border supply chain could be significant.\nMeanwhile, a reduction in corporate taxes will be welcomed by automakers. In Langan's view, the upshot won't be that these company's are suddenly awash in cash, but he predicts a modest balance-sheet improvement on tax savings.\nGood for car dealers? Joe Raedle / Getty Images\nOn another front, under Trump, the Environmental Protection Agency could roll back higher fuel-economy standards. This is a big one.\n\"Trump's senior policy advisor said the Trump administration would review all federal regulation including fuel-economy and emissions standards, which could ease pressure from costly fuel economy targets,\" Langan wrote in an earlier note.\nRegardless of how you feel about Trump in the White House, the combination of empty bluster about NAFTA and the auto industry, a corporate tax cut, and a break on rising Corporate Average Fuel Economy (CAFE) standards — which the car companies have been lobbying for anyway — is going to make the auto industry in the US very happy.","url":"https://www.businessinsider.com/trump-could-give-the-us-auto-industry-exactly-what-it-wants-2016-12"}
