{"authors":[],"date_download":"2018-10-22 22:29:24","date_modify":"2018-10-22 22:29:24","date_publish":"2017-04-26 04:51:22","description":"After moving to unstitch climate change rules, US President Donald Trump is turning his sights on America's vast nature preserves, with a view to possibly...","filename":"data/vaneerConsumption/TrumplookstoliftprotectionsonAmericasvastnaturepreserves.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/04/wire-463155-1493178684-211_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446268_Trump-looks-lift-protections-Americas-vast-nature-preserves_1540247364.html","title":"Trump looks to lift protections on America's vast nature preserves","title_page":"Trump looks to lift protections on America's vast nature preserves | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Carrizo Plain was declared a national monument in 2001 under the Antiquities Act, a decision now under review by the Trump administration\nAfter moving to unstitch climate change rules, US President Donald Trump is turning his sights on America's vast nature preserves, with a view to possibly lifting federal protections brought in over the past two decades.\nOn Wednesday, he is to sign an executive order reviewing decisions by predecessors Barack Obama, George W. Bush and Bill Clinton to designate public land a \"national monument\" under a 1906 law known as the Antiquities Act.\nThe aim is to \"give states and local communities a meaningful voice in the process,\" said Interior Secretary Ryan Zinke, whose department oversees federal land use under the motto \"Protecting America's Great Outdoors and Powering Our Future.\"\nThe Grand Staircase-Escalante is a key national monument to face review, having been desginated by Bill Clinton in 1996\nZinke said the outcome of the review was not pre-ordained. His department is to provide an interim report in 45 days then a fuller one in 120 days.\nBut it conceivably could roll back protections fixed under the Antiquities Act -- brought in under president Theodore Roosevelt, keen on conserving America's natural heritage -- and set the scene for fierce legal challenges.\n\"National monument\" land has come to be synonomous over the years with a bar to drilling for fossil fuels on public land, or other commercial activities.\nWhile Republicans in Utah and other states are keen to lift protections they see as too expansive and undermining economic opportunities, environmental groups and Native Americans are deeply opposed.\nIn the past, areas presidents have tagged as \"national monuments\" were later transformed by Congress into full-fledged National Parks -- the Grand Canyon and Death Valley among them.\nSince the Act came into force more than a century ago, only three presidents -- all Republicans -- did not use its powers: Richard Nixon, Ronald Reagan, and George H. W. Bush.\nThe San Gabriel Mountains were declared a national monument in 2014, one of many sites classified by Barack Obama\nObama had millions of hectares (acres) classified under the Act during his presidency, including maritime zones, especially in the Pacific.\nUnder Trump's review, only \"monuments\" of 40,000 hectares (100,000 acres) or more will be examined.\nA key area will be the Bears Ears National Monument, a 530,000-hectare (1.3-million-acre) zone in Utah Obama proclaimed in 2016.\nAnother will be the Grand Staircase-Escalante National Monument also in Utah -- a spectacular tract of canyons, ridges and a river -- designated by Clinton in 1996.\nBarack Obama used the Antiquities Act to classify millions of acres as national monuments, a status often synonomous with a bar to drilling for fossil fuels on public land\nThe Republican senator for Utah, Orrin Hatch, has railed against the national monument decisions made in Washington, saying his state should have more say over how the land is protected.\nIn a Washington Post opinion piece, Hatch said Obama \"ignored the best interests of Utah and cast aside the will of the people - all in favor of a unilateral approach meant to satisfy the demands of far-left interest groups.\"\nOther presidents, too, went too far Hatch said, adding that Trump \"stands ready to undo the harm brought about by their overreach.\"","url":"https://www.dailymail.co.uk/wires/afp/article-4446268/Trump-looks-lift-protections-Americas-vast-nature-preserves.html"}
