{"authors":[],"date_download":"2018-10-30 14:07:39","date_modify":"2018-10-30 14:07:39","date_publish":"2018-10-30 11:48:00","description":"President Donald Trump is considering trying to end birthright citizenship through an executive orde...","filename":"data/vaneerConsumption/Trumpmullstryingtoendbirthrightcitizenshipwithexecutiveorder.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/06/20/Videos/4420587-U58856033230Wcz-680x383%40CmgSharedContent.com.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_trump-mulls-e_10386884e27d3cc9826cdc1ea8e2df65__1540908459.html","title":"Trump mulls trying to end birthright citizenship with executive order,","title_page":"Trump mulls trying to end birthright citizenship with executive order,","title_rss":"NULL","source_domain":"ajc.com","text":"President Donald Trump is considering trying to end birthright citizenship through an executive order, Axios reported early Tuesday. But critics say he doesn’t have the authority to make the move, which would face numerous hurdles.\n>> Watch a video of Trump’s remarks here\nExclusive: Trump plans to sign an executive order terminating birthright citizenship, he said yesterday in an exclusive interview for \"Axios on HBO.\" pic.twitter.com/D2RE4N4OrJ — Axios (@axios) October 30, 2018\n>> Jamie Dupree: Trump immigration birthright plan would face certain legal challenge\nAccording to the 14th Amendment of the Constitution, “all persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and the State wherein they reside.”\n>> Jamie Dupree: With caravan 1,000 miles away, Pentagon moving troops to southern border\nIn a Monday interview with Axios, Trump said that practice “has to end,” adding that he has spoken to his counsel about a possible executive order.\n“It was always told to me that you needed a constitutional amendment. Guess what? You don't,” he claimed, saying the plan is “in the process.”\nHe added: “We’re the only country in the world where a person comes in and has a baby, and the baby is essentially a citizen of the United States ... with all of those benefits.”\n>> Read more trending news\nCox Media Group Washington correspondent Jamie Dupree said the executive order “would be immediately challenged in the courts.”\n“You can’t change the Constitution with an executive order,” Dupree said.\nAxios released a video clip Tuesday from Trump’s interview, which was filmed as part of a documentary series called “Axios on HBO.” The series premieres at 6:30 p.m. EST/PST Sunday on HBO.\nRead more here.","url":"https://www.ajc.com/news/national/trump-mulls-executive-order-ending-birthright-citizenship-report-says/7YwbjiTjJPb3gBIdsZm4NN/"}
