{"authors":["Associated Press"],"date_download":"2018-10-22 22:30:26","date_modify":"2018-10-22 22:30:26","date_publish":"2017-03-16 04:04:15","description":"WASHINGTON (AP) - President Donald Trump is unveiling a $1.15 trillion budget, a far-reaching overhaul of federal government spending that slashes a dozen...","filename":"data/vaneerConsumption/Trumpbudgetslashesagencymoneytoboostdefensespending.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/04/wire-226207-1489637064-629_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318814_Trump-budget-slashes-agency-money-boost-defense-spending_1540247426.html","title":"Trump budget slashes agency money to boost defense spending","title_page":"Trump budget slashes agency money to boost defense spending | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - President Donald Trump is unveiling a $1.15 trillion budget, a far-reaching overhaul of federal government spending that slashes a dozen departments to finance a significant increase in the military and make a down payment on a U.S.-Mexico border wall.\nThursday's scheduled budget release will upend Washington with cuts to long-promised campaign targets like foreign aid and the Environmental Protection Agency as well as strong congressional favorites such as medical research, help for homeless veterans and community development grants.\n\"A budget that puts America first must make the safety of our people its number one priority - because without safety, there can be no prosperity,\" Trump said in a message accompanying his proposed budget that was titled \"America First: A Budget Blueprint to Make America Great Again.\"\nA portion of President Donald Trump's first proposed budget, focusing on the Department of Defense, and released by the Office of Management and Budget, is photographed in Washington, Wednesday, March 15, 2017. President Donald Trump is unveiling a $1.15 trillion budget, a far-reaching overhaul of federal government spending that slashes a dozen departments to finance a significant increase in the military and make a down payment on a U.S.-Mexico border wall. (AP Photo/Jon Elswick)\nThe $54 billion boost for the military is the largest since President Ronald Reagan's Pentagon buildup in the 1980s, promising immediate money for troop readiness, the fight against Islamic State militants and procurement of new ships, fighter jets and other weapons. The 10 percent Pentagon boost is financed by $54 billion in cuts to foreign aid and domestic agencies that had been protected by former President Barack Obama.\nThe budget goes after the frequent targets of the party's staunchest conservatives, eliminating the National Endowment for the Arts, legal aid for the poor, low-income heating assistance and the AmeriCorps national service program established by former President Bill Clinton.\nSuch programs were the focus of lengthy battles dating to the GOP takeover of Congress in 1995 and have survived prior attempts to eliminate them. Lawmakers will have the final say on Trump's proposal in the arduous budget process.\nThe budget is set for official release Thursday morning, but The Associated Press and other news outlets obtained the document in advance.\nLaw enforcement agencies like the FBI would be spared, while the border wall would receive an immediate $1.5 billion infusion in the ongoing fiscal year, with another $2.6 billion planned for the 2018 budget year starting Oct. 1.\nTrump repeatedly claimed during the campaign that Mexico would pay for the wall when, in fact, U.S. taxpayers will foot the bill.\nTwelve of the government's 15 Cabinet agencies would absorb cuts under the president's proposal. The biggest losers are Agriculture, Labor, State and the Cabinet-level EPA. Defense, Homeland Security and Veterans Affairs are the winners.\nMore than 3,000 EPA workers would lose their jobs and programs such as Obama's Clean Power Plan, which would tighten regulations on emissions from power plants seen as contributing to global warming, would be eliminated. Popular EPA grants for state and local drinking and wastewater projects would be preserved, however.\nTrump's proposal only covers roughly one-fourth of the approximately $4 trillion federal budget, the discretionary portion that Congress passes each year. It doesn't address taxes, Social Security, Medicare and Medicaid, or make predictions about deficits and the economy. Those big-picture details are due in mid-May, and are sure to show large - probably permanent - budget deficits. Trump has vowed not to cut Social Security and Medicare and is dead set against raising taxes.\n\"The president's going to keep his promises\" to leave Social Security and Medicare alone, said White House Budget Director Mick Mulvaney.\nTrump's proposal is sure to land with a thud on Capitol Hill, and not just with opposition Democrats outraged over cuts to pet programs such as renewable energy, climate change research and rehabilitation of housing projects.\nRepublicans like Sen. Rob Portman of Ohio are irate over planned elimination of a program to restore the Great Lakes. Top Republicans like Majority Leader Mitch McConnell of Kentucky and Senate Foreign Relations Committee Chairman Bob Corker of Tennessee are opposed to drastic cuts to foreign aid. And even GOP defense hawks like Armed Services Committee Chairman Mac Thornberry of Texas aren't satisfied with the $54 billion increase for the military.\nBefore the two sides go to war over Trump's 2018 plan, they need to clean up more than $1.1 trillion in unfinished agency budgets for the current year. A temporary catchall spending bill expires April 28; negotiations have barely started and could get hung up over Trump's request for the wall and additional border patrol and immigration enforcement agents, just for starters.\nSome of the most politically sensitive domestic programs would be spared, including food aid for pregnant women and their children, housing vouchers for the poor, aid for special education and school districts for the poor, and federal aid to historically black colleges and universities.\nBut the National Institutes of Health would absorb a $5.8 billion cut despite Trump's talk in a recent address to Congress of finding \"cures to the illnesses that have always plagued us.\" Subsidies for airlines serving rural airports in Trump strongholds would be eliminated. Also zeroed out would be funding for subsidies of Amtrak's money-losing long-distance routes, and a $500 million per-year \"TIGER Grant\" program for highway projects created by Obama.\nIn a blow to endangered GOP Sen. Dean Heller of Nevada, Trump's budget seeks $120 million to revive the mothballed Yucca Mountain nuclear waste repository, which is hugely unpopular in his state and was largely killed by the efforts of Democratic former Sen. Harry Reid. Heller is up for re-election next year in a state that backed Democrat Hillary Clinton.","url":"https://www.dailymail.co.uk/wires/ap/article-4318814/Trump-budget-slashes-agency-money-boost-defense-spending.html"}
