{"authors":["Akin Oyedele"],"date_download":"2018-10-30 22:52:35","date_modify":"2018-10-30 22:52:35","date_publish":"2018-07-28 00:00:00","description":"President Donald Trump said Friday he expected the US economy to grow even faster in the second half the year. Second-quarter GDP increased at an annual pace of 4.1%, the highest since 2014.","filename":"data/vaneerConsumption/TrumpsaysUSGDPisgoingtogoalothigherafterstrongreport.json","image_url":"https://amp.businessinsider.com/images/5b5b26463beb6e28008b478e-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trump-gdp-economy-press-conference-comments-2018-7_1540939955.html","title":"Trump says US GDP is 'going to go a lot higher' after strong report","title_page":"    Trump says US GDP is 'going to go a lot higher' after strong report - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"President Donald Trump said Friday that the next GDP report will \"do extraordinarily well.\" Andrew Harnik/AP\nPresident Donald Trump said Friday that the US economy is likely to accelerate even faster later this year, following a report that showed the strongest growth in nearly four years.\nThe Commerce Department had earlier reported that gross domestic product (GDP), the total value of goods and services produced in the US, increased at an annual pace of 4.1%, the highest since 2014.\n\"As trade deals come in one by one, we're going to go a lot higher than these numbers — and these are great numbers,\" Trump said at a news conference after the report.\nHe added, \"I happen to think we're going to do extraordinarily well in our next report.\"\nTrump said growth during each of the two previous administrations, a period that coincided with the 2008 recession, averaged just over 1.8%.\n\"By contrast, we are now on track to hit an average GDP annual growth of over 3% and it could be substantially over 3%,\" Trump said. \"Each point, by the way, means approximately $3 trillion and 10 million jobs. Think of that.\"\nFriday's report showed that the US became a $20 trillion economy — the first time any country has hit that milestone.\nTrump cast doubt on the chorus of economists who have said that growth at a 3%+ rate is not sustainable. Worker productivity has slowed in recent years, and growth in Q2 was partly boosted by a surge in soybean exports ahead of China's retaliatory 25% tariff on the crop.\n\"I think the most important thing — and Larry Kudlow just confirmed to me along with Kevin Hassett — is that these numbers are very, very sustainable,\" Trump said. \"This isn't a one-time shot.\"\nA rebound in consumer spending from the first quarter served the biggest contribution to growth in Q2. The April-June period was the first full quarter after the Trump administration's tax cuts were signed into law.\nPersonal consumption increased by 4% in the first full quarter after President Donald Trump signed tax cuts into law. Business investment and government spending also increased.\nThe Commerce Department's report was based on preliminary data, and revisions with more complete data will be released in August and September.\nSee also:","url":"https://www.businessinsider.com/trump-gdp-economy-press-conference-comments-2018-7"}
