{"authors":["Associated Press"],"date_download":"2018-10-22 23:36:15","date_modify":"2018-10-22 23:36:15","date_publish":"2017-04-26 08:13:21","description":"NEW YORK (AP) - You'd think Twitter would be able to milk its status as President Donald Trump's megaphone. But the company still faces stagnant user growth,...","filename":"data/vaneerConsumption/Trumptweetsdonthelp1stTwitterrevenuedropsinceIPO.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/17/wire-466709-1493225755-629_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446554_Trumps-constant-tweeting-isnt-lifting-Twitters-profit_1540251375.html","title":"Trump tweets don't help: 1st Twitter revenue drop since IPO","title_page":"Trump tweets don't help: 1st Twitter revenue drop since IPO | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW YORK (AP) - You'd think Twitter would be able to milk its status as President Donald Trump's megaphone. But the company still faces stagnant user growth, has never made a profit and even reported a quarterly revenue decline Wednesday, a first since going public.\nTrump's frequent tweets ricochet well beyond his 28 million Twitter followers. Anything he tweets can serve as fodder for social media, TV news shows and, often, late-night comedy. Analysts say Twitter's user engagement - how often people respond, retweet or \"like,\" for instance - likely benefited from \"political discourse\" in the first quarter.\nThe problem: The people already on Twitter may well be using it more, but America's first true \"Twitter President\" hasn't inspired others to sign up for Twitter en masse. This could well be because they don't have to. Thanks to Twitter's public nature, anyone can read Trump's posts (or any other posts as long as they are shared publicly, they don't need an account to do so).\nFILE - In this Thursday, Oct. 27, 2016, file photo, the Twitter logo appears on a phone post on the floor of the New York Stock Exchange. Twitter's frequent presence in the news, as the preferred megaphone for President Donald Trump, has not translated into profit or meaningful user growth for the company. Twitter, Inc. reports earnings on Wednesday, April 26, 2017. (AP Photo/Richard Drew, File)\nThat said, Twitter's quarterly results surpassed Wall Street's modest expectations and, combined with an increase in both overall users daily usage, boosted the company's beleaguered stock price.\nBY THE NUMBERS\nTwitter said Wednesday it had an average of 328 million monthly users during the first quarter, a 3 percent increase from 319 million during the previous quarter. By contrast, Facebook has 1.89 billion and Facebook-owned Instagram has 600 million monthly users as of December, the latest available. More users, of course, mean more advertising revenue for the companies, since businesses try to reach as many eyeballs as possible.\nTwitter has never turned a profit, and for the first time since going public in 2013, it reported a decline in revenue from the previous year. Its revenue was $548.3 million, down 8 percent.\nNet loss was $61.6 million, or 9 cents per share, compared with a loss of $79.7 million, or 12 cents per share, a year earlier. Excluding stock compensation expenses and other one-time items, the company earned 11 cents per share in the latest quarter, down from 15 cents a year earlier.\nTwitter beat Wall Street expectations for adjusted income of 2 cents on revenue of $517.3 million, according to FactSet. Twitter's shares jumped $1.46, or 10 percent, to $16.13 in midday trading. The stock is still down 1 percent year-to-date, compared with a nearly 7 percent increase for the Standard & Poor's 500 index.\nJOIN THE CONVERSATION\nWith its slogan \"it's what's happening,\" Twitter has been trying to corner the market for real-time information, to be a place where people can go to find out what's going on in the world and talk about it with friends and strangers.\nAnd it's not just politics, but also sports events like the March Madness college basketball tournament or World Cup soccer, not to mention the stuff seemingly made for Twitter, such as the outrage over the dragging of a paying United passenger off a full flight to make room for crew. Video was shared widely on Twitter, as were jokes and anger toward the airline.\nAs with Facebook, Twitter also has been pushing live video - whether on its main service or through its Periscope app - to keep users interested and engaged. This includes both user-generated content and live-streaming deals. Sports events are especially lucrative.\nTHE COMPETITION\nThat's why the recent loss of an NFL deal to Amazon was an especially hard blow to Twitter. Twitter streamed 10 Thursday Night Football games last year and had counted on them to lure in users and keep existing ones entertained. In its quarterly letter to investors in February, the company called the games \"the major highlight of the fourth quarter\" when it comes to live sports.\nAmazon appears to have simply outbid Twitter. The Associated Press and other news outlets reported that Amazon's one-year deal for the 2017 season is worth close to $50 million, about five times what Twitter paid for the right to stream the games last year. Stifel analyst Scott Devitt said that while the NFL deal likely contributed about 1 percent of Twitter's 2016 revenue, it \"seemed to be an important pillar of Twitter's Live strategy.\"\nAnd in the wake of such setbacks, competition is growing. Besides Facebook and Instagram, Twitter is also vying for advertising revenue from Snap Inc., the owner of Snapchat. Snap recently had completed its initial public offering and will report earnings in May.\nOne closely watched metric that did improve for Twitter - its daily active usage increased by 14 percent from a year ago. That's compares with an 11 percent increase in the previous quarter and a 7 percent the quarter before that. Twitter didn't report the actual usage, just the percentage growth. Still, it's a further sign that those already on Twitter are using it more.","url":"https://www.dailymail.co.uk/wires/ap/article-4446554/Trumps-constant-tweeting-isnt-lifting-Twitters-profit.html"}
