{"authors":["Lauren Holter"],"date_download":"2018-10-31 01:46:16","date_modify":"2018-10-31 01:46:16","date_publish":"2018-09-11 16:58:45","description":"The president and vice president commemorated the 17th anniversary of the Sept. 11 attacks in separate ceremonies on Tuesday, but both Donald Trump and Mike Pence referenced \"radical Islamic terrorism.\" Trump has used the phrase often since…","filename":"data/vaneerConsumption/TrumpMikePences911SpeechesBothReferencedRadicalIslamicTerrorism.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/11/35eb6492-5261-4e75-ab44-93dc9f5cd052-getty-1031309028.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_trump-mike-pences-911-speeches-both-referenced-radical-islamic-terrorism-11871839_1540950376.html","title":"Trump & Mike Pence's 9/11 Speeches Both Referenced \"Radical Islamic Terrorism\"","title_page":"Trump & Mike Pence's 9/11 Speeches Both Referenced \"Radical Islamic Terrorism\"","title_rss":"NULL","source_domain":"bustle.com","text":"The president and vice president commemorated the 17th anniversary of the Sept. 11 attacks in separate ceremonies on Tuesday, but both Donald Trump and Mike Pence referenced \"radical Islamic terrorism.\" Trump has used the phrase often since launching his 2016 campaign, but notably left it out of his remarks marking the anniversary of 9/11 last year, as CNBC notes.\n\"America will never, ever submit to tyranny,\" Trump said while addressing victims' families in Shanksville, Pennsylvania on Tuesday. \"Since Sept. 11, nearly 5.5 million young Americans have enlisted in the United States armed forces. Nearly 7,000 service members have died facing down the menace of radical Islamic terrorism.\"\nThe president's rhetoric was mimicked by his second-in-command, who remained in the D.C. area to address Pentagon staffers with Secretary of Defense James Mattis. Pence referenced \"radical Islamic terrorism\" twice throughout his speech, once saying that America will honor 9/11 victims “by doing everything in our power as a nation to prevent the evil of radical Islamic terrorism\" from ever reaching the United States again.\n“Seventeen years ago today America fell under attack. Nineteen radical Islamic terrorists seized control of four commercial airlines to strike the centers of our economy our military and our national government,” Pence also said at the Pentagon, the third site attacked 17 years ago, according to Politico.\nPresident Trump used this same language on the campaign trail to portray himself as the candidate who would take the toughest actions to eradicate terrorism. As he put it during one 2016 speech:\nToday we begin a conversation about how to Make America Safe Again. In the 20th Century, the United States defeated Fascism, Nazism, and Communism. Now, a different threat challenges our world: radical Islamic terrorism.\nBut some of his top aides have tried to talk Trump into altering his language to prevent insinuating that all Muslims are terrorists. Last year, Trump National Security Adviser H.R. McMaster (who's since left the White House) told National Security Council staff that the label “radical Islamic terrorism” was not helpful because terrorists are “un-Islamic,” The New York Times reported. McMaster also reportedly spoke to Trump about his views on dealing terrorism.\nWin McNamee/Getty Images News/Getty Images\nMcMaster wasn't on great terms with the president, as Politico reported earlier this year — and his advice didn't seem to stick. Politico also noted in March that John Bolton, McMaster's successor, has ties to anti-Muslim activists, and Secretary of State Mike Pompeo has accused Muslim leaders in the United States of being “potentially complicit” in terrorist attacks. Both men's positions make them poised to help shape the Trump administration's rhetoric and actions surrounding terrorism.\nThe president's use of \"radical Islamic terrorism\" after not referencing it on Sept. 11 last year proves that his views on the subject weren't altered by McMaster or others who have criticized his use of the phrase for the past two years. It also signals that he's ramping up for the 2020 election, especially considering the Trump campaign's chief operating officer issued a statement with the same language.\n\"This day reminds us of the need for America's vigilance against radical Islamic terrorism and its ongoing threat to our freedoms, as President Trump has done so honorably as our Commander-in-Chief,\" Michael Glassner said in a statement obtained by CNBC.","url":"https://www.bustle.com/p/trump-mike-pences-911-speeches-both-referenced-radical-islamic-terrorism-11871839"}
