{"authors":["Morgan Brinlee"],"date_download":"2018-10-31 00:02:18","date_modify":"2018-10-31 00:02:18","date_publish":"2018-10-28 17:01:09","description":"On the day 11 people were killed and six others were wounded in a hate-fueled attack on a synagogue in Pittsburgh, Pennsylvania, President Donald Trump ended his night by tweeting about baseball. But Trump's World Series tweet drew both criticism…","filename":"data/vaneerConsumption/TrumpsWorldSeriesTweetAfterThePittsburghSynagogueShootingDrawsMixedReactions.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/28/3579d513-b4ff-45d5-9c77-30e8b87bcb54-getty-816509360.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_trumps-world-series-tweet-after-the-pittsburgh-synagogue-shooting-draws-mixed-reactions-13010016_1540944138.html","title":"Trump's World Series Tweet After The Pittsburgh Synagogue Shooting Draws Mixed Reactions","title_page":"Trump's World Series Tweet After The Pittsburgh Synagogue Shooting Draws Mixed Reactions","title_rss":"NULL","source_domain":"bustle.com","text":"On the day 11 people were killed and six others were wounded in a hate-fueled attack on a synagogue in Pittsburgh, Pennsylvania, President Donald Trump ended his night by tweeting about baseball. But Trump's World Series tweet drew both criticism and support as social media users reacted to the president's World Series weigh in.\n\"Watching the Dodgers/Red Sox final innings,\" Trump tweeted just hours after a gunman opened fire on congregants gathered for worship services at the Tree of Life Synagogue in Pittsburgh's Squirrel Hill. \"It is amazing how a manager takes out a pitcher who is loose & dominating through almost 7 innings, Rich Hill of Dodgers, and brings in nervous reliever(s) who get shellacked. 4 run lead gone. Managers do it all the time, big mistake!\"\nWhile Los Angeles Dodgers manager Dave Roberts dismissed the president's comment as \"one man's opinion\" in a post-game press conference, others were bothered by its timing.\n\"Is this even real?\" CNN political contributor Joan Walsh asked in a tweet retweeting the president. \"[Eleven] Americans were murdered in a hate crime today.\"\n\"What is wrong with you?\" journalist and writer Wajahat Ali tweeted to the president. \"There was a shooting at a synagogue today. 11 people were killed. Earlier this week, there was mass assassination attempt by a proud MAGA supporter. Also, a man shot and killed two black people in Kentucky and said, 'whites don't shoot whites.'\"\nOne Twitter user, who identified himself as a Pittsburgh resident, questioned the sensitivity of the president's timing. \"As a guy living in Pittsburgh, let me just ask: is watching the World Series really the best use of your time this evening?\" he asked. \"Even if it's what you care most about, do you think it's any solace to the families of those killed today to know that THIS is what’s on your mind?\"\nEven California Rep. Ted Lieu publicly criticized the president for his World Series tweet, asking, \"Is tonight when @ realDonaldTrump became our President?\" in a retweet. \"Or was it when he said 'there are some very fine people on both sides' at the white nationalist mob event in Charlottesville? Or when he tweeted CNN getting body slammed? Or when he sabotaged healthcare?\"\nBut not everyone felt it was insensitive for the president to tweet about a major sporting event given the day's events. \"Why are people going ape sh*t over @realDonaldTrump tweeting about the #WorldSeries?\" sports blogger Dan Clark asked. \"Surely the President of the United States has the right to relax on a Saturday night and watch America's favorite pastime like any other citizen. Regardless of his baseball opinions, fair's fair.\"\nOthers mused if this was how Trump planned to unite the country in the face of such divisive politics. \"Dave Roberts is making terrible decisions in the #WorldSeries and it might be the first time Democrats in LA agree with President Trump,\" music video director Robby Starbuck tweeted. \"Who would’ve thought Dave Roberts could unite Hollywood and Trump?\"\nTrump also spent much of Saturday discussing the synagogue shooting in Pittsburgh. Shortly after police reported taking the suspected gunman into custody, Trump told reporters the shooting had little to do with gun laws and suggested the attack might not have been as deadly had the synagogue had armed guards inside. In a tweet posted prior to his World Series criticism, Trump called the shooting an \"evil anti-Semitic attack\" and \"an assault on humanity,\" noting \"we must unite to conquer hate.\"","url":"https://www.bustle.com/p/trumps-world-series-tweet-after-the-pittsburgh-synagogue-shooting-draws-mixed-reactions-13010016"}
