{"authors":["Caroline Burke"],"date_download":"2018-10-31 01:42:06","date_modify":"2018-10-31 01:42:06","date_publish":"2018-08-28 05:59:00","description":"In the wake of the Jacksonville shooting that left at least two people dead and 10 others injured at an e-gaming tournament, Donald Trump was surprisingly quiet about the incident throughout the entire first day. On Monday, over a full 24 hours…","filename":"data/vaneerConsumption/TrumpsBelatedJacksonvilleShootingResponseWillLeaveYouScratchingYourHead.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/b4fa5808-0243-444f-88c8-ec4b84959836-getty-1024689188.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_trumps-belated-jacksonville-shooting-response-will-leave-you-scratching-your-head-10258795_1540950126.html","title":"Trump's Belated Jacksonville Shooting Response Will Leave You Scratching Your Head","title_page":"Trump's Belated Jacksonville Shooting Response Will Leave You Scratching Your Head","title_rss":"NULL","source_domain":"bustle.com","text":"In the wake of the Jacksonville shooting that left at least two people dead and 10 others injured at an e-gaming tournament, Donald Trump was surprisingly quiet about the incident throughout the entire first day. On Monday, over a full 24 hours after it occurred, Trump responded to the Jacksonville shooting at a White House dinner with evangelical leaders, according to a report by Fox News. The president's words for the shooting were sparse, and the largest takeaway was that he claimed \"nobody really knows\" how or why shootings happen.\nTrump said, \"Before going any further, I want to extend our prayers and condolences to the victims of the tragic shooting in Jacksonville, Florida. That was a terrible thing, indeed, and how it happens, nobody really knows. But they've done an incredible job down in Jacksonville as they always do in Florida, and throughout the country, but — condolences.\"\nTrump also took this moment to make his first non-tweeted statement about Senator John McCain's passing, saying, \"Also, our hearts and prayers are going to the family of Senator John McCain ... we very much appreciate everything that Senator McCain has done for our country, so thank you very much.\"\nFox News on YouTube\nThough Trump didn't even tweet about the shooting leading up to his statement, he did make a point to tweet about his own supposed approval rating.\nOn Sunday evening, hours after the shooting occurred, Trump tweeted, \"Over 90% approval rating for your all time favorite (I hope) President within the Republican Party and 52% overall. This despite all of the made up stories by the Fake News Media trying endlessly to make me look as bad and evil as possible. Look at the real villains please!\"\nIvanka Trump, on the other hand, did tweet about the shooting on Sunday, writing, \"As we await further details, our hearts are with Jacksonville and all those affected by today’s tragic mass shooting.\"\nEven so, Ivanka faced serious blowback for her tweet from other users on social media, with over 4,000 users replying to her tweet. One user replied, \"If only there was something you could do in your position of *checks notes* Senior Advisor to the President\"\nNBC News on YouTube\nAnother user tweeted, \"Did Daddy ask you to write this because he was too busy tweeting lies about himself to care?\"\nStill another capitalized on the word that's been tied to Ivanka over and over again, tweeting, \"ComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicitComplicit\"\nTrump's recent record on gun control has been confusing, to say the least. After the Parkland high school shooting that left 17 people dead last February, Trump held several \"listening sessions\" and appeared amenable to new pieces of legislation increasing gun control via background checks and even raising the age of purchase to 21. But almost immediately after, Trump allegedly had private meetings with NRA members where he confirmed that he didn't want to increase gun control.\nWhat is perhaps most alarming about Trump's response to this recent tragedy is his affirmation of belief that \"nobody knows\" why shootings happen, which doesn't exactly imply much of an intention to try to solve the problem of mass shootings in America.","url":"https://www.bustle.com/p/trumps-belated-jacksonville-shooting-response-will-leave-you-scratching-your-head-10258795"}
