{"authors":["David Martosko","Us Political Editor For Dailymail.Com In Nashville"],"date_download":"2018-10-22 21:14:09","date_modify":"2018-10-22 21:14:09","date_publish":"2017-03-16 00:59:03","description":"President Donald Trump said a decision by a US federal judge in Hawaii to issue an emergency halt on Wednesday to his revised travel ban was an example of 'unprecedented overreach'","filename":"data/vaneerConsumption/TrumpslamsHawaiijudgewhoblockedlatesttravelban.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E50057C00000578-0-image-a-30_1489626653480.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318516_Trump-slams-judge-blocked-latest-travel-ban_1540242849.html","title":"Trump slams Hawaii judge who blocked latest travel ban","title_page":"Trump slams Hawaii judge who blocked latest travel ban | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lee Greenwood sang 'God Bless the U.S.A' – in person, not on tape – and Donald Trump delivered a campaign-style speech Wednesday to a Nashville, Tennessee crowd that came hungry for red meat.\nThe leader of the free world did not disappoint, pledging to beat back a torrent of attacks on his travel ban executive order coming from federal judges in the liberal Ninth Circuit.\nThe day's news cycle got quickly away from the White House when a federal judge in Hawaii put a halt to the Trump administration's second attempt to curb incoming travel from a half-dozen of the world's 50 Muslim-majority countries.\nTrump had words for U.S. District Judge Derrick Watson, calling his action 'in the opinion of many, an unprecedented judicial overreach.'\n'We're going to fight this terrible ruling. We're going to take this case as far as it needs to go, including all the way up to the Supreme Court,' he vowed.\n'We're going to win and we're going to keep our citizens safe. Believe me.'\nScroll down for video\nFury: President Trump told the rally in Nashville, Tennessee that he would not accept the 'unprecedented overreach' of US District Jude Derrick K. Watson in Hawaii\nTrump told supporters Wednesday at a campaign-style rally in Nashville, Tennessee, that he learned that a district judge in Hawaii had halted his order, which temporarily suspends the U.S. refugee program and bars the entry of people from certain Muslim-majority countries\nThe order Watson put on pause, he recalled, 'was a watered-down version of the first order, that was also blocked by another judge and should have never been blocked to start with.'\n'I think we ought to go back to the first one and go all the way,' the president said, going off script.\n'The law is clear. The need for my executive order is clear. We're never quitting, we're never going away, we're never, ever giving up.'\nThe president's rally was to be a defense of the Republican congressional blueprint for replacing the Obamacare medical insurance overhaul law.\nHe will hold another rally Monday night in nearby Kentucky, the home state of Sen. Rand Paul – who has emerged as one of the GOP's fiercest opponents to 'Trumpcare,' saying that it falls short of a complete legislative repeal.\nLike the good-old-days: Trump led the excitable rally through a round-up of his first 50 days in office and told them he was going to fight the latest order blocking his controversial travel ban\nSeal of approval: President Donald Trump stands on stage with singer Lee Greenwood as Greenwood sings 'God Bless the USA' at a rally on Wednesday\nBut Watson's ruling, which is binding on the administration, threw a monkey wrench in the works by declaring that Trump was discriminating on the basis of a religious test.\nThe executive order stalled the president's second attempt to suspend admission of nearly all refugees for 120 days, and to restrict visas for nationals from Iran, Libya, Somalia, Sudan, Syria and Yemen for 90 days.\nShot down: US District Jude Derrick K. Watson has ruled that Trump's latest ban is unconstitutional\nAfter Hawaii's ruling on Wednesday, a judge in Maryland followed suit.\nEarly on Thursday, US District Judge Theodore Chuang issued a nationwide preliminary injunction in a similar case in Maryland brought by refugee resettlement agencies represented by the American Civil Liberties Union and the National Immigration Law Center.\nChuang ruled that the agencies were likely to succeed in proving that the travel ban portion of the executive order was intended to be a ban on Muslims and, as a result, violates the U.S. Constitution's religious freedom protection.\nTrump began his windup in Nashville with the first of many attacks on reporters, whom he continued to call 'the most dishonest people.'\n'I would much rather spend time with you than any of the pundits, consultants or special interests, certainly or reporters from Washington, D.C.,' he said.\nTrump later bashed the 'bad, fake media' for what he anticipated would be negative reporting on his speech.\nA single protester disrupted the event with a sign calling him a 'liar.'\n'One person!' Trump marveled. 'And they'll be the story tomorrow.'\nHe also bristled at 'fake news' reports that he was hedging on his pledge to build a wall on the southern U.S. border.\nLet us in: Trump supporters wait to enter the rally in Nashville, Tennessee to see the president\nVictory: Hawaii Attorney General Douglas Chin, left, and Oregon Attorney General Ellen Rosenblum speak at a press conference outside the federal courthouse on Wednesday\nTHE US DISTRICT JUDGE WHO FROZE TRUMP'S TRAVEL BAN: DERRICK KAHALA WATSON US District Judge Derrick Kahala Watson, who was nominated by former President Barack Obama in 2012 and confirmed by the Senate with a 94-0 vote, is the fourth Native Hawaiian federal judge in U.S. history. Obama said of Watson and six other nominees he named at the time: ‘These individuals have demonstrated the talent, expertise, and fair-mindedness Americans expect and deserve from their judicial system.’ Honolulu lawyers refer to Watson as a 'double Harvard' for where he received his undergraduate education in 1988 and his law degree in 1991. But his roots are in Hawaii, where he attended a private school that gives admission preference to Native Hawaiians. 'I am proud to welcome this Kamehameha Schools graduate to serve in such a prestigious capacity,' US Rep. Tulsi Gabbard said when Watson was confirmed. He then went on to serve as a US Army Reserve Captain and as a partner at a San Francisco firm. While serving at a private practice, Watson spent hundreds of hours representing pro bono clients in cases dealing with human trafficking, employment wages and landlord/tenant cases. He also partnered with a civil rights group to challenge a school district’s electoral system after a Hispanic member was prevented from being elected. He later became an assistant US attorney in the District of Hawaii and Northern District of California. While at the U.S. attorney's office in Hawaii Watson was chief of the civil division. Before that he was partner at a San Francisco firm, where he focused on product liability, toxic tort, and environmental cost recovery litigation, according to his biography posted on the Honolulu federal court's website. Watson was an assistant US attorney in the Northern District of California from 1995 to 2000, including serving as deputy chief of the civil division from 1999 to 2000, the bio said. Honolulu defense attorney Michael Green has had numerous cases before Watson. 'The man is extremely strict and principled,' Green said. That strictness was evident during a sex assault trial last year, which Watson tried to keep on a tight schedule, Green said. But when Green's wife suffered a stroke during the trial, Watson showed kindness. 'He slowed the trial down so I could be there for closing argument and to finish my examination of key witnesses,' Green said. 'He can be deemed a very tough sentencer. If you look between the lines, there's compassion.'\nTo chants of 'Build that wall!' he said the government has had 'hundreds of bidders' for construction.\n'Everybody wants to build our wall. Usually that means you get a good price,' Trump exclaimed.\nTrump timed his Nashville visit to coincide with the 250th birthday of the late U.S. president Andrew Jackson, whose tomb he visited earlier in the day ofr a wreath-laying.\nTrump hung a Jackson portrait in the Oval office after his inauguration and sees similarities between the late 'Old Hickory' president's rise to power and his own.\n'He understood that real leadership means putting America first,' Trump said Wednesday night.\nBoth men harnessed the power of previously unseen voting blocks to win the presidency, upsetting America's political apple cart in the process with a populist wave that professional prognosticators never predicted.\nNot welcomed: Supporters of U.S. President Donald Trump jeer a protester who disrupted a rally with Trump at Municipal Auditorium in Nashville\nGet out: A protester is removed by a police officer during a speech by President Donald Trump\nBox office: A marquee announces U.S. President Donald Trump as he holds a rally at Municipal Auditorium in Nashville, Tennessee\nThank you: President Donald Trump waves to the crowd after speaking at his Tennessee rally\nJackson's gains came when voting rights were expanded to include white men who were not landowners.\nHe was 'the people's president,' Trump declared at the Hermitage on Wednesday, 'and his election came at a time when the vote was finally being extended to those who did not own property,' Trump said.\nTrump captured the imagination of Americans – mostly middle-class whites – whom he believed had been 'forgotten' by previous administrations led by both major U.S. political parties.\n'The forgotten men and women of our country will never be forgotten again. Believe me,' Trump said Wednesday night.\nDuring his brief afternoon remarks, Trump told a few hundred guests and a global TV audience that 'we must all remember Jackson's words that in the planter, the farmer, the mechanic and the laborer we will find muscle and bone of our country.'\nRelaxed: White House press secretary Sean Spicer poses for photographs with supporters of President Donald Trump\nWith his people: Sean Spicer takes selfies with smiling fans at the Nashville rally in Tennessee on Wednesday\nPrime time: Trump dominated television scheduling with his 9pm interview for Fox News' Tucker Carlson in which he attacked Obamacare and clarified his claims that former president Obama tried to illegally listen in to Trump Towers\nTraveling home: President Donald Trump speaks to reporters aboard Air Force One before landing at Andrews Air Force Base in Maryland before returning to the White House\nAnd he said Jackson crusaded against government corruption, broadened veterans' benefits and leveled tough trade tariffs on foreign countries as a protectionist barrier.\n'That sounds very familiar. Wait 'til you see what's going to be happening pretty soon, folks,' the president quipped. 'It's time.'\nTrump also noted that Jackson was also 'a flawed and imperfect man, a product of his time,' a seeming reference to his presiding over the 'Trail of Tears' Indian removal campaign in 1838 and 1839.\n'It is the duty of each generation to carry on the fight for justice.'\nDuring a tour of Jackson's home, the president heard a curator explain that 'Old Hickory' subscribed to 16 different newspapers and kept track of which he found disagreeable.\nOn one editorial that particularly bothered him, Jackson drew a big black 'X.'\n'We know that feeling,' Trump responded. 'We know that feeling.'","url":"https://www.dailymail.co.uk/news/article-4318516/Trump-slams-judge-blocked-latest-travel-ban.html"}
