{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:03:47","date_modify":"2018-10-30 21:03:47","date_publish":"2016-10-20 09:18:52","description":"Donald Trump and Mike Pence will deliver satellite video addresses at a major Republican Party rally to be held next week.","filename":"data/vaneerConsumption/TrumpPenceToAddressIsraelisAtGOPRallyInJerusalem.json","image_url":"https://media.breitbart.com/media/2016/10/AP_trump_pence.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_10_20__1540933427.html","title":"Trump, Pence To Address Israelis At GOP Rally In Jerusalem","title_page":"Trump, Pence To Address Israelis At GOP Rally In Jerusalem","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Donald Trump and Mike Pence will deliver satellite video addresses to a major Republican party rally to be held near the Temple Mount in Jerusalem next week, Republicans Overseas Israel announced Wednesday.\nSeveral hundred people are expected to attend the October 26 rally, which is being held under the title “strengthening Jerusalem” in defiance of a controversial UNESCO resolution that denied the Jewish historical connection to Jerusalem’s holy sites.\nAccording to organizers, the rally aims to convey the message that the GOP “is united behind the need to safeguard the unity of Jerusalem, and to prevent any political interference regarding the historic identity of the city.”\nThe UNESCO resolution, approved by the UN body on Tuesday, only refers to the Temple Mount and Western Wall by their Muslim names and to Israel as “the occupying power.”\nLeading Republican officials from both Israel and the U.S. will attend the rally.\nTrump’s campaign has opened offices in several cities in Israel.\nLast week, Trump slammed the resolution as a “one-sided attempt to ignore Israel’s 3,000-year bond to its capital city” and “further evidence of the enormous anti-Israel bias” at the United Nations.","url":"https://www.breitbart.com/middle-east/2016/10/20/trump-pence-address-israelis-via-satellite-massive-gop-rally-jerusalem/"}
