{"authors":["Joseph D. Lyons"],"date_download":"2018-10-31 01:51:24","date_modify":"2018-10-31 01:51:24","date_publish":"2018-08-27 17:07:37","description":"Reporters caught President Donald Trump trying and failing to make a phone call in the oval office on Monday morning — or so it appeared. Attempting to reach Mexican President Enrique Peña Nieto, Trump tried to use the speakerphone but seemingly…","filename":"data/vaneerConsumption/TrumpCalledMexicanPresidentEnriquePeaNietoAndHadTheUltimateSpeakerphoneFail.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/4096b059-a7be-4cb7-be53-23aa7f39aec0-screen-shot-2018-08-27-at-114622-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_trump-called-mexican-president-enrique-pena-nieto-had-the-ultimate-speakerphone-fail-10248863_1540950684.html","title":"Trump Called Mexican President Enrique Peña Nieto And Had The Ultimate Speakerphone Fail","title_page":"Trump Called Mexican President Enrique Peña Nieto And Had The Ultimate Speakerphone Fail","title_rss":"NULL","source_domain":"bustle.com","text":"Reporters caught President Donald Trump trying and failing to make a phone call in the oval office on Monday morning — or so it appeared. Attempting to reach Mexican President Enrique Peña Nieto, Trump tried to use the speakerphone but seemingly failed.\nTrump and Peña Nieto were hoping to bring attention to the NAFTA renegotiation deal that the two countries had agreed on, but the American leader was thwarted by technology.\n\"The president is on the phone,\" Trump says on camera after he touches what is likely the speakerphone button. \"Enrique?\"\nThe next few seconds Trump looks down at the phone, then briefly looks up at the journalists recording every moment. \"You know, you can hook him up,\" Trump then says to a staffer in the background. \"Tell me when.\"\n\"It's a big thing,\" Trump continues, delaying and signaling down at the paper on his desk. \"You've got a lot of people waiting.\"\nAfter a bit of sound comes through, \"You want to put that on this phone, please?\" Trump says. \"Hello?\"\nThe two finally do connect, but the awkwardness does not end there. Trump signs off by saying, \"A hug from you will be very nice.\"\nJournalists and pundits shared their favorite moments from the interaction on Twitter, with many likening the interaction to a scene from the HBO show Veep that stars Julia Louis-Dreyfus playing the inept and fictional Vice President Selina Meyer.\nThe NAFTA trade renegotiations between the U.S. and Mexico have stepped up in recent months as both Trump and Peña Nieto hope to finalize the agreement before Peña Nieto's term ends and before the midterms for Republicans.\nOn the call, Peña Nieto brought up Canada's role in the process in his call with Trump. \"It is our wish, Mr. President, that now Canada will also be able to be incorporated in all this,\" Peña Nieto said with a translator. \"I assume that they are going to carry out negotiations of the sensitive bilateral issues between Canada and the United States.\"\nPeña Nieto also tweeted that he had spoken with Canadian Prime Minister Justin Trudeau, encouraging Canada's participation. Canada was frozen out of talks over the summer, shortly after Trudeau openly stood up to attacks from Trump as he left the G-7 in Quebec in June.\nTrump didn't seem to be as worried about Canada. \"They used to call it NAFTA,” Mr. Trump said. “We’re going to call it the United States Mexico Trade Agreement,” Trump said on Monday, completely ignoring the other North American country that was a signatory to the original NAFTA. Trump added that \"we'll see\" if Canada can be included.\nMexico and Canada are both opposed to individual trade deals, as are multinational companies whose supply chains stretch across the three countries.\nOne of the biggest agreements between Mexico and the United States will also benefit Canada. The agreed rules regarding duty-free car imports would require that 75 percent of the value of vehicles be built in Canada, the United States, or Mexico. There's also a requirement that a portion of all cars be made in factories that pay $16 an hour or more, which would minimize the benefit to moving production south of the border.\nGiven NAFTA's importance to the continent's economy, the agreement is arguably no laughing matter. But the speakerphone fiasco was just that.","url":"https://www.bustle.com/p/trump-called-mexican-president-enrique-pena-nieto-had-the-ultimate-speakerphone-fail-10248863"}
