{"authors":["Deborah Danan"],"date_download":"2018-10-30 18:56:42","date_modify":"2018-10-30 18:56:42","date_publish":"2018-06-17 16:44:52","description":"Palestinian Authority President spokesperson Nabil Abu Rudeineh slammed the Trump administration's highly anticipated peace proposal.","filename":"data/vaneerConsumption/TrumpsPeacePlanAWasteofTime.json","image_url":"https://media.breitbart.com/media/2018/06/Nabil-Abu-Rudeineh.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2018_06_17__1540925802.html","title":"Trump's Peace Plan 'A Waste of Time'","title_page":"Abbas Spokesperson: Trump's Peace Plan 'A Waste of Time'","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Palestinian Authority President Mahmoud Abbas’ spokesperson Nabil Abu Rudeineh slammed the Trump administration’s highly anticipated peace proposal, declaring that the upcoming visit by the White House Middle East peace team is “a waste of time and is bound to fail,” Channel 10 reported on Saturday.\nThe Palestinian leadership, which is engaged in an ongoing boycott of the White House following the opening of the U.S. embassy in Jerusalem last month, said that the upcoming meetings between President Donald Trump’s special adviser and son-in-law Jared Kushner and peace envoy Jason Greenblatt with high-ranking officials in Jerusalem, Cairo, Amman, Doha and Riyadh are useless.\n“The round of meetings that began in New York, whose purpose is to bring a meaningless plan, won’t achieve anything,” Rudeineh said.\nHe was referring to Friday’s meeting in New York between United Nations Secretary General Antonio Guterres, U.S. Ambassador to the UN Nikki Haley, Greenblatt and Kushner, during which the White House said they discussed peace efforts and the humanitarian crisis in the Gaza Strip.\nRudeineh also claimed the White House is attempting to “divide the Gaza Strip from the West Bank.”\nThe two American officials will not travel to Ramallah and have no meetings scheduled with Palestinian Authority leaders.\n“Without the agreement of the Palestinian people, the fate of the series of meetings will be a total failure,” said Abu Rudeineh.\n“It is a waste of time and destined to fail as long as the attempt to circumvent the legitimate Palestinian institutions continues,” he added.\nAccording to the Wafa news agency, Rudeineh also said that any proposal that does not include a Palestinian capital in eastern Jerusalem or a solution for Palestinian refugees will fail.\nIsrael holds that the so-called Palestinian “right of return,” in which refugees would return to the ancestral homes they fled with the establishment of the state in 1948, would spell the end of the Jewish state.\n“If the United States continues to act to change the rules regarding relations with the Palestinian leadership and our Palestinian people then the stagnation and political paralysis will continue,” Rudeineh said.","url":"https://www.breitbart.com/middle-east/2018/06/17/trumps-peace-plan-a-waste-of-time-pa-spokesperson-says/"}
