{"authors":["Virginia Hale"],"date_download":"2018-10-30 20:52:00","date_modify":"2018-10-30 20:52:00","date_publish":"2018-07-13 17:57:46","description":"Donald J Trump’s explosive UK tabloid interview has “hit the establishment like a bombshell”, Nigel Farage has said.","filename":"data/vaneerConsumption/TrumpTruthsHaveHitEstablishmentLikeaBombshell.json","image_url":"https://media.breitbart.com/media/2017/01/Farage-Trump-2.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_13__1540932720.html","title":"Trump Truths 'Have Hit Establishment Like a Bombshell'","title_page":"Farage: Trump Truths 'Have Hit Establishment Like a Bombshell'","title_rss":"NULL","source_domain":"breitbart.com","text":"Donald J Trump’s explosive UK tabloid interview has “hit the establishment like a bombshell”, Nigel Farage has said, remarking that the U.S. President ‘gets’ the public’s concern over mass migration.\nSpeaking on Breitbart News Daily on SiriusXM on Friday, after a tabloid interview with President Trump sent shockwaves across the globalist media, Farage asserted the President “recognises and understands” why immigration has become “the number one issue across all of European politics”.\nPresident Trump’s remarks to The Sun provoked fury from leftist British lawmakers, who branded his distress at seeing millions of third world migrants pour into Europe “racist”, and said the President’s criticism of London Mayor Sadiq Khan’s stance on terror was “Islamophobic”.\n“Whichever way you cut it, it’s a pretty dramatic Friday 13th,” Farage said, commenting on some of the frantic reactions seen in Britain since the U.S. leader’s arrival to the island nation.\n‘Very Sad’: Trump Warns Mass Migration Means Britain, Europe ‘Losing Its Culture’ https://t.co/YllTdlyOu3 — Breitbart London (@BreitbartLondon) July 13, 2018\nThe former UKIP leader blasted London Mayor Sadiq Khan as “a disgrace” and “childish” after the Labour figure gave permission to a collective of self-declared “anti-fascist art activists” to fly a 20-foot blimp depicting an intentionally “grotesque” caricature of Trump above Parliament during the President’s visit.\n“It would be better if [the London Mayor] stopped engaging in this war against Donald Trump and got on with … dealing with the crisis in crime,” Farage said, pointing to the vicious attack on former British ambassador to the U.S. Sir Christopher Meyer Wednesday, which took place at one of the capital’s major railway stations in broad daylight.\nTurning to talk about the white paper recently unveiled by the government, Farage said Trump was “justified” in attacking Theresa May’s plans for a super-soft Brexit which — by chaining Britain to the EU Single Market — “has effectively torpedoed the prospect” of a UK/U.S. trade deal.\n“An important part of Trump’s foreign policy has been that he wanted to execute a free trade deal with the United Kingdom,” he said, explaining: “This mattered a lot to the President because he wanted to show the world that he isn’t against free trade but wants it to be fair and reciprocal.”\n‘Grotesque’ Trump Baby Flies in London During Presidential Visit https://t.co/kFGQLJ0iHn — Breitbart London (@BreitbartLondon) July 13, 2018\nPresident Trump had told The Sun that the Conservative Prime Minister Theresa May’s Brexit blueprint “will probably kill” the chance for a bilateral trade deal between the two nations, pointing out that America “would be dealing with the European Union instead of dealing with the UK” under the plans.\nAsked whether May’s increasingly shaky leadership means the Labour Party could seize power in the near future, and what that would mean for Britain’s withdrawal process from the EU, Farage argued divorcing Europe is “about something bigger” than who is living in Downing Street.\n“Brexit is about whether, for centuries to come, we are to be an independent, sovereign, democratic nation that stands on its own two feet, makes its own laws, controls its own borders, and does its own bilateral deals around the world,” the veteran MEP told Breitbart News Network Editor-in-Chief Alex Marlow.","url":"https://www.breitbart.com/europe/2018/07/13/farage-trump-truths-have-hit-establishment-bombshell/"}
