{"authors":["Scott Detrow"],"date_download":"2018-10-22 21:33:05","date_modify":"2018-10-22 21:33:05","date_publish":"2016-11-30 00:00:00","description":"In a series of tweets, President-elect Donald Trump tried to tamp down growing concerns that he will not separate his vast global business interests from his role as head of the U.S. government.","filename":"data/vaneerConsumption/TrumpSaysHeWillPullBackFromBusinessesButOffersNoDetailsYet.json","image_url":"https://media.npr.org/assets/img/2016/11/30/ap_16299527284723_wide-d692f146d2e2b84b09983610adbe89989b341b0f.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_11_30_503842627_trump-says-he-will-pull-back-from-businesses-but-offers-no-details-yet_1540243985.html","title":"Trump Says He Will Pull Back From Businesses But Offers No Details Yet","title_page":"Trump Says He Will Pull Back From Businesses But Offers No Details Yet : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Trump Says He Will Pull Back From Businesses But Offers No Details Yet\nEnlarge this image toggle caption Evan Vucci/AP Evan Vucci/AP\nIn a series of tweets Wednesday morning, President-elect Donald Trump tried to tamp down growing concerns that he will not separate his vast global business interests from his role as head of the U.S. government.\nTrump is promising to hold a \"major news conference\" in two weeks to talk about how he's turning his empire over to his children.\n\"While I am not mandated to do this under the law, I feel it is visually important, as President, to in no way have a conflict of interest with my various businesses,\" Trump wrote in a series of posts, promising that \"legal documents are being crafted which take me completely out of business operations.\"\nTrump's transition team has provided no further details about what these legal arrangements will look like.\nThroughout his presidential campaign, Trump promised to turn the Trump Organization over to three of his children. But Don Jr., Eric and Ivanka Trump all remain close political advisers and members of his transition team, so it's hard to see how the Trump Organization and the Trump administration would remain separate, if that remains the case.\nWhile Trump tweeted about the \"visual importance\" of separating official duties from business interests, he has repeatedly brought up business-related concerns during phone calls with world leaders, according to multiple reports.\nThat included asking the president of Argentina about permitting problems with a Trump Buenos Aires project and raising concerns about offshore wind farms with a prominent British politician. (Trump has tried for years to block turbines from being built near one of his Scottish golf courses.)\nDuring a recent interview with The New York Times, Trump spoke at length about how he views his presidential obligations on the matter. \"The law is totally on my side, meaning, the president can't have a conflict of interest,\" he told the paper. He's right — strict conflict-of-interest requirements for federal employees do not apply to the president.\nMany leaders in similar situations have turned their assets over to a blind trust. Typically, that means companies and other holdings are liquidated, and then the assets are managed by an outside party so that the executive doesn't know how his or her official actions will impact personal holdings.\nAs Trump pointed out, that's much trickier to do when his entire organization revolves around the Trump name and brand. \"Selling real estate isn't like selling stock,\" he told the Times. \"Selling real estate is much different, it's in a much different world.\"\nOne area where this all will likely come to a head very quickly: Trump's new luxury hotel in Washington, D.C., which is operating on leased federal land. As NPR recently reported:\nIn 2013, he signed a 60-year lease for the building with the General Services Administration, which helps manage and support federal agencies. The Trump Organization spent upwards of $200 million on renovations and reopened it as a hotel about a month before the Nov. 8 presidential election. But there's a hitch, according to Steven Schooner, a government procurement expert who is also a law professor at the George Washington University School of Law. Schooner has studied the 100-plus-page contract and says there's a clause that clearly states elected officials should have no role in the lease. \"The contract between GSA and the Trump Organization specifically says that no elected official of the United States government shall be party to, share in, or benefit from the contract,\" he says, citing clause 37.19 of the contract.\n\"The presidency is a far more important task!\" Trump tweeted Wednesday. Still, the businessman is conscious of how his White House win is affecting his bottom line. As he told The New York Times, \"the brand is certainly a hotter brand than it was before.\"","url":"https://www.npr.org/2016/11/30/503842627/trump-says-he-will-pull-back-from-businesses-but-offers-no-details-yet"}
