{"authors":["Compiled Democrat-Gazette Staff Wire Reports"],"date_download":"2018-10-30 18:04:05","date_modify":"2018-10-30 18:04:05","date_publish":"2018-06-19 00:00:00","description":"The White House continued to insist Monday that Democrats are to blame for the administration's forced separation of migrant children from their families at the southern U.S. border, as opposition to the policy continued to build, including among some Republicans.","filename":"data/vaneerConsumption/TrumpagainpinsimmigrationpolicyonDemocrats.json","image_url":"https://media.arkansasonline.com/img/photos/2018/06/19/186967590_immig-e6340966-4956-11e8-9072-f6d4bc32f223_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_jun_19_trump-again-pins-immigration-policy-on--1__page=4_1540922645.html","title":"Trump again pins immigration policy on Democrats","title_page":"Trump again pins immigration policy on Democrats","title_rss":"NULL","source_domain":"arkansasonline.com","text":"President Donald Trump speaks during an event on tax policy in the Rose Garden of the White House in Washington, D.C., on April 12, 2018.\nWASHINGTON -- The White House continued to insist Monday that Democrats are to blame for the administration's forced separation of migrant children from their families at the southern U.S. border, as opposition to the policy continued to build, including among some Republicans.\nTough action is needed to fight illegal immigration, President Donald Trump declared, and the U.S. \"will not be a migrant camp\" on his watch.\nTrump's comments came as images of children held in fenced cages fueled a growing chorus of condemnation from both political parties, four former first ladies and national evangelical leaders. The children are being held separately from parents who have been arrested under the administration's \"zero-tolerance\" policy for illegal border crossings.\nTrump and others in the administration have blamed the separations on a law the president claims was written by Democrats. But the separations instead largely stem from a policy announced with fanfare last month by Attorney General Jeff Sessions.\nOn Twitter over the weekend and again Monday, Trump blamed Democrats for the current state of affairs and urged them to agree to broader legislation on immigration that includes border-wall funding and other White House priorities.\n\"It is the Democrats' fault for being weak and ineffective with Boarder [sic] Security and Crime,\" Trump wrote in one of a series of tweets Monday. \"Tell them to start thinking about the people devastated by Crime coming from illegal immigration. Change the laws!\"\n\"I say it's very strongly the Democrats' fault,\" Trump said Monday, citing more lenient policies that had not charged all people who had crossed illegally. Republican lawmakers are growing ever more concerned about negative effects on their re-election campaigns this fall, and Trump was to travel to Capitol Hill today for a strategy session on possible legislation.\nGOP senators, including Lindsey Graham of South Carolina, Jeff Flake of Arizona and Susan Collins of Maine, said they were considering legislation that would keep families together; provide additional judges so detained families would face shorter waiting periods; and provide facilities for the families to stay.\nGraham said he talked Monday to about 40 senators, including Democrats, but not Senate Majority Leader Mitch McConnell. \"It's a concept it seems everybody is jumping on board,\" he said.\nSen. Dianne Feinstein of California said she had the backing of the Democratic caucus for a bill would that prohibit the separation of the children from their parents, with exceptions for findings of child abuse or trafficking.\nBut the White House signaled it would oppose any narrow fix. Press secretary Sarah Huckabee Sanders said Trump's priorities, like funding a border wall and tightening immigration laws, must also be fulfilled as part of any legislation.\n\"We want to fix the whole thing,\" she said. \"We don't want to tinker with just part of it.\"\nDemocrats argue that Trump is trying to use a manufactured crisis to gain leverage in ongoing deliberations in Congress over immigration to secure funding for a U.S.-Mexico border wall that was a campaign promise.\n\"He's playing a game,\" Sen. Chris Van Hollen, D-Md., said during an appearance on CNN on Monday morning. \"He knows this family separation policy is very unpopular.\"\nThe White House's hard-line posture comes as a growing number of Republicans are joining Democrats to urge the administration to change its policy on family separations.\n\"The President should immediately end this family separation policy,\" Sen. Ben Sasse, R-Neb., said in a lengthy Facebook post Monday. He said Trump doesn't need Congress to change course on \"the horrors of family separation.\"\n\"The administration's decision to separate families is a new, discretionary choice,\" Sasse wrote.\nRep. Fred Upton, R-Mich., called for an immediate end to this \"ugly and inhumane practice,\" adding, \"It's never acceptable to use kids as bargaining chips in political process.\" Sen. Pat Roberts, R-Kan., said he is \"against using parental separation as a deterrent to illegal immigration.\" And GOP Rep. Mike Coffman warned, \"History won't remember well those who support the continuation of this policy.\"\nHomeland Security Secretary Kirstjen Nielsen rejected criticism accusing her department of inhuman and immoral actions.\n\"We will not apologize for the job we do or for the job law enforcement does for doing the job that the American people expect us to do,\" she said in an appearance before the National Sheriffs' Association in New Orleans. \"Illegal actions have and must have consequences. No more free passes, no more get out of jail free cards.\"\nSessions on Monday echoed the administration's defense of the policy and called on Congress to act.\n\"We do not want to separate parents from their children,\" he said. \"If we build the wall, if we pass legislation to end the lawlessness, we won't face these terrible choices.\"\nTrump's commitment to the current policy showed no sign of faltering as voices of condemnation grew louder and more diverse.\nThe Rev. Franklin Graham, a longtime Trump ally, called the policy \"disgraceful.\" Several religious groups, including some conservative ones, have pushed to stop the practice of separating the children from their parents, and former first lady Laura Bush called it \"cruel\" and \"immoral\" in a guest column for The Washington Post.\n\"And it breaks my heart,\" she added.\nFormer first ladies Rosalynn Carter, Michelle Obama and Hillary Clinton also commented on the policy, meaning all four living ex-first ladies have publicly condemned it, along with first lady Melania Trump.\nThe United Nations' top human-rights official also entered the mounting furor on Monday, calling for an immediate halt to a practice he condemned as abuse.\nDetaining the children may cause them irreparable harm with lifelong consequences, said Zeid Ra'ad al-Hussein, the United Nations high commissioner for human rights.\nHe cited an observation by the president of the American Association of Pediatrics that locking the children up separately from their parents constituted \"government-sanctioned child abuse.\"\n[U.S. immigration: Data visualization of selected immigration statistics, U.S. border map]\n\"The thought that any state would seek to deter parents by inflicting such abuse on children is unconscionable,\" al-Hussein said.\nInformation for this article was contributed by John Wagner and Seung Min Kim of The Washington Post; by Zeke Miller, Alan Fram, Ken Thomas, Jill Colvin, Catherine Lucey, Nomaan Merchant, Deepti Hajela, Kevin McGill and staff members of The Associated Press; and by Nick Cumming-Bruce of The New York Times.\nA Section on 06/19/2018","url":"https://www.arkansasonline.com/news/2018/jun/19/trump-again-pins-immigration-policy-on--1/?page=4"}
