{"authors":["Charlie Spiering"],"date_download":"2018-10-30 19:13:56","date_modify":"2018-10-30 19:13:56","date_publish":"2017-01-04 14:10:27","description":"Donald Trump suggested the intelligence community has delayed a briefing with him connecting Russia to the DNC emails that WikiLeaks leaked.","filename":"data/vaneerConsumption/TrumpSideswithJulianAssangeQuestionsUpcomingIntelligenceBriefing.json","image_url":"https://media.breitbart.com/media/2017/01/Julian-Assange-Sean-Hannity-London-1-2-17-twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_01_04__1540926836.html","title":"Trump Sides with Julian Assange; Questions Upcoming Intelligence Briefing","title_page":"Trump Sides with Julian Assange; Questions Upcoming Intelligence Briefing","title_rss":"NULL","source_domain":"breitbart.com","text":"President-elect Donald Trump questioned the intelligence community, suggesting they have delayed a briefing with him connecting Russian hackers and the Russian government to the DNC emails that WikiLeaks leaked.\n“The ‘Intelligence’ briefing on so-called ‘Russian hacking’ was delayed until Friday,” Trump wrote on Twitter on Tuesday evening. “Perhaps more time needed to build a case. Very strange!”\nOn Wednesday, Trump reminded his followers that in an interview, Julian Assange claimed that the Russians did not give him the emails.\n“Julian Assange said ‘a 14 year old could have hacked Podesta,’” he wrote. “Why was DNC so careless? Also said Russians did not give him the info!”\nDuring an interview with Sean Hannity, Assange insisted again that he did not get the emails from the Russian government:\nHANNITY: Can you say to the American people, unequivocally, that you did not get this information about the DNC, John Podesta’s emails, can you tell the American people 1,000 percent that you did not get it from Russia or anybody associated with Russia? ASSANGE: Yes. We can say, we have said, repeatedly that over the last two months that our source is not the Russian government and it is not a state party.\nOn Wednesday morning, Trump further questioned the Democratic National Committee for failing to answer tough questions about their failure to protect their networks, or to answer questions raised by the revealed emails. He tweeted, “Somebody hacked the DNC but why did they not have ‘hacking defense’ like the RNC has and why have they not responded to the terrible things they did and said (like giving the questions to the debate to H),” adding, “A total double standard! Media, as usual, gave them a pass.”","url":"https://www.breitbart.com/politics/2017/01/04/trump-sides-julian-assange-questions-upcoming-intelligence-briefing/"}
