{"authors":["Alex Swoyer"],"date_download":"2018-10-30 20:13:17","date_modify":"2018-10-30 20:13:17","date_publish":"2015-07-21 19:36:06","description":"Trump Rallies Supporters in South Carolina, Takes Jabs at Politicians","filename":"data/vaneerConsumption/TrumpRalliesSupportersinSouthCarolinaJabsatPoliticians.json","image_url":"https://media.breitbart.com/media/2015/07/Trump-holds-Grahams-Number-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_21__1540930397.html","title":"Trump Rallies Supporters in South Carolina, Jabs at Politicians","title_page":"Trump Rallies Supporters in South Carolina, Jabs at Politicians","title_rss":"NULL","source_domain":"breitbart.com","text":"GOP presidential candidate Donald Trump delivered a speech at a rally with supporters in South Carolina on Tuesday, removing himself from the politicians as a friend of the private sector and U.S. economy.\nHe began by joking that presidential candidates shouldn’t be able to use a teleprompter in announcement speeches, so the American public can know whom they really are getting when the public goes to vote.\nTrump referred to his comments on illegal immigration, which were made during his presidential announcement, saying the recent killing of a young woman by an illegal immigrant in San Francisco and the crime statistics have demonstrated there is a problem with illegal immigration.\nTrump argued that the mainstream media largely ignored the facts, which supported his illegal immigration statements.\n“I was actually going to bring the press — have them sit over here, so they’ll see,” he joked to the crowd. “The press is dishonest.”\nTrump took swipes at his competition, including fellow GOP presidential candidate Gov. Jeb Bush and Democratic frontrunner Hillary Clinton, mocking them about not liking the “tone” of his statements on illegal immigration. Trump said Americans need a leader with tone these days.\nHe also took a swipe at fellow GOP candidate Sen. Lindsey Graham (R-SC) saying, “What a stiff.” Trump also gave out what might be Graham’s office phone number — as Trump mentioned it could be an old one — for people to call and complain about the job Graham has done.\nGOP presidential candidate Rick Perry wasn’t safe either from criticism. “He put glasses on so people will think he’s smart – it just doesn’t work, you know, people can see through the glasses,” Trump said about Perry.\nTrump also mentioned Saudi Arabia, saying that country gets a billion dollars a day and the American military always takes care of it, but America gets nothing in return.\nA supporter in the crowd said “crazy” in response to Trump’s statement. Trump agreed that it is crazy – and pointed to the man in the crowd and had him stand up.\nTrump also addressed veterans – which has been in the news since he took a jab at Sen. John McCain (R-AZ) on Saturday in Iowa.\n“Our vets have been treated worse than they’ve ever been,” Trump stated. He followed it up by saying he is angry with McCain for calling Trump supporters “crazies” and also because McCain is “totally about open borders.”\n“I will take care of our vets… our vets are treated like third class citizens,” Trump pledged. “I will build a military that is so strong that we will never have to use it because they’ll say we aren’t messing with that guy and we’re not messing with that country.”\nEarlier in the day, the Trump campaign announced they will start a hotline for veterans to call or email suggestions on how to fix the Veterans Administration.\nTrump said a businessman will help fix the situation with the veterans healthcare better than politicians have done.\n“I am so tired of politicians… no one knows them better than me,” he said, adding he deals with them every day. “If you can’t get rich dealing with politicians – there’s something wrong with you.”\n“The problem is with politicians is perseverance. They work. They try, but they only want to keep their job – it’s 99 percent of what they want.”","url":"https://www.breitbart.com/politics/2015/07/21/trump-rallies-supporters-in-south-carolina-takes-jabs-at-politicians/"}
