{"authors":["Ailsa Chang"],"date_download":"2018-10-22 21:30:47","date_modify":"2018-10-22 21:30:47","date_publish":"2016-11-22 00:00:00","description":"A legal debate is heating up around a provision called the Emoluments Clause. Experts are examining whether Trump can legally continue dealing with companies controlled by foreign governments.","filename":"data/vaneerConsumption/TrumpsInternationalBusinessDealingsCouldViolateTheConstitution.json","image_url":"https://media.npr.org/assets/img/2016/11/22/ap_227016163412_wide-f25e0a40da54ed4616f2c545ce79612097fda6b0.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_11_22_503091109_can-trumps-international-business-dealings-violate-the-constitution_1540243847.html","title":"Trump's International Business Dealings Could Violate The Constitution","title_page":"Trump's International Business Dealings Could Violate The Constitution : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Trump's International Business Dealings Could Violate The Constitution\nEnlarge this image toggle caption Alex Brandon/AP Alex Brandon/AP\nDonald Trump's extensive business dealings around the globe have focused attention on an obscure provision of the Constitution most law professors barely look at — the Emoluments Clause. Now, one of the hottest legal debates around is whether the president-elect is going to violate the Constitution if he continues doing business with companies controlled by foreign governments.\nWho even used the word \"emolument\" in an actual sentence before November 2016?\nEmolument is defined by Merriam-Webster as \"the returns arising from office or employment usually in the form of compensation or perquisites.\"\nThe Foreign Emoluments Clause can be found in Article I, Section 9 of the Constitution. It provides that \"no Person holding any Office of Profit or Trust under [the United States] shall, without Consent of Congress, accept ... any present, Emolument, Office, or Title, of any kind whatever, from any King, Prince, or foreign State.\"\nThe clause has been interpreted as an anti-bribery provision by constitutional scholars.\n\"The underlying concern of the clause is divided loyalties,\" said Erik Jensen, a law professor at Case Western Reserve University. \"The founders wanted U.S. officials not to have any arrangements under which there could be questions about whether they were acting in the best interests of the United States, or in the interests of a foreign state.\"\nTrump's companies do deal with businesses that are controlled or influenced by foreign government officials. Legal experts say the potential for constitutional violations is high.\nTake the Bank of China, for example. It's a lender for one of Trump's buildings in Midtown Manhattan. If the Bank of China were to offer Trump a lower interest rate on that loan after he takes office, it might raise an Emoluments Clause issue. Some legal scholars say it could be perceived as an attempt to curry favor with the president or influence policy.\nSo what is a violation of the Emoluments Clause?\nProblem is, what constitutes a violation of the Emoluments Clause is a tangled conversation that very quickly involves lots of hypotheticals — because there is virtually no case law on the subject.\nNot only have prior presidents been careful to steer clear of any perceived violations of the clause, there's never been a president like Trump, whose companies have such vast global reach. And Trump hasn't fully disclosed the full extent of his global business dealings.\nSo all legal experts can do now is pose possible scenarios.\nObjects Versus Services\nRichard Painter, who was chief White House ethics lawyer under President George W. Bush from 2005 to 2007, likes to use this example: Imagine the president sells a car to the Queen of England. If the Queen pays the president fair market value for the car, it's not a violation of the Emoluments Clause. If the payment the president receives exceeds the fair market value of the car, there could be a violation. The amount of over-payment could be seen as a gift, or \"present,\" under the clause.\nBut let's say we're not talking about an object, like a car. What if the president renders services for a foreign government and receives compensation for those services? That would fall under the definition of \"emolument.\" And in that case, Painter says, it doesn't matter if the compensation amounts to fair market value. It's straight-up compensation for services rendered, so it's banned as an emolument under the clause.\nHere's how a President Trump might one day render services for foreign government officials. Say a bunch of diplomats from a foreign country stay at Trump International Hotel in Washington, D.C. Painter says you could interpret that as services rendered by Trump — and under the Emoluments Clause, he can't enrich himself from those rendered services.\n\"The services theory would be along the lines of, 'Well, if Donald Trump himself as president could not perform services for the foreign government, he can't have his hired help — people who work for him in that hotel — provide those services, and then he receives the payment.' That would be an end-run around the prohibition on any type of emolument,\" said Painter.\nThe issue of whether a U.S. government official is violating the Emoluments Clause for services rendered actually does comes up in real life, says Ken Gross, a government ethics lawyer in Washington, D.C. Sometimes government officials go on a foreign detail or sabbatical and want to earn compensation for teaching at a government-funded university in that foreign country. In those cases, Gross said, U.S. government officials have had to forego pay to avoid violations of the clause.\nThe role of Congress\nUnder the clause, Congress has the power to consent to any business dealings that raise questions. But if even legal experts are scratching their heads about what constitutes a violation of the Emoluments Clause, imagine how lawmakers would feel entering this legal morass.\n\"What this does is put Congress in an almost impossible situation of judging the fair market value of financial transactions between state-run entities and the Trump Organization,\" said Zephyr Teachout, a law professor at Fordham University. She was a Democratic candidate for Congress in New York this year.\nAnd if Congress dodges its duty under this clause — and refrains from ever voting to approve or reject possible Emolument Clause violations — Teachout says Congress will be acting unconstitutionally.\n\"This is an active obligation on the part of Congress,\" said Teachout. \"So if Trump goes forward with his plan to maintain a Trump Organization with relationships to state-controlled companies, it's not just Trump, but it's Congress that is in violation.\"\nWho can bring a legal claim against Trump for a violation?\nBecause there's been no real litigation of the Emoluments Clause, legal experts say it's hard to define who has legal standing — meaning who has been injured by the possible violation — to bring a claim.\nLegal standing depends on how you articulate the injury. Here's one theory of injury: Trump is enriching himself at the expense of companies that can't compete for business the way the president of the United States can. So maybe a company that's lost business because of some financial transaction between Trump Organization and a foreign government could articulate a legal claim.\nOr, the perceived harm could be more nebulous. Here's another theory: Trump is opening himself up to attempts by foreign governments that want to influence U.S. policy. But who would have standing to bring a legal claim in that case? Legal experts say it's not clear.\nSo how does Trump avoid any violations of the Emoluments Clause?\nPainter says the best option for Trump is to simply liquidate his stake in his company — that is, take the company public, sell off all his shares and put the cash proceeds in a blind trust. That way, if there are any entanglements between the Trump Organization and foreign countries — he'll be cleared of any conflicts.\nBut nobody's holding their breath for that to happen anytime soon.\nJensen says he can already hear Trump's counterargument. \"He's going to make at least two points. One, 'You force somebody like me to do that, and you're providing a tremendous disincentive for people who have been successful in business to enter the public sphere,' \" said Jensen. \"He also might say, 'If I have to sell everything very quickly, in effect a fire sale ... I will end up getting a lot less than the real value.' \"","url":"https://www.npr.org/2016/11/22/503091109/can-trumps-international-business-dealings-violate-the-constitution"}
