{"authors":["Monica Hunter-Hart"],"date_download":"2018-10-31 01:40:16","date_modify":"2018-10-31 01:40:16","date_publish":"2018-09-06 17:44:44","description":"The first scandal of Donald Trump's presidency was more frivolous than many later incidents have been, but it's kept following him. A new report from The Guardian claims that Trump ordered his inauguration photos to be edited last year so that his…","filename":"data/vaneerConsumption/TrumpsInaugurationCrowdPhotosWereReportedlyEditedAtHisRequest.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/def6fc76-663e-4ec3-97a3-318da853ddfc-getty-632184754.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_trumps-inauguration-crowd-photos-were-reportedly-edited-at-his-request-11772759_1540950016.html","title":"Trump’s Inauguration Crowd Photos Were Reportedly Edited At His Request","title_page":"Trump’s Inauguration Crowd Photos Were Reportedly Edited At His Request","title_rss":"NULL","source_domain":"bustle.com","text":"The first scandal of Donald Trump's presidency was more frivolous than many later incidents have been, but it's kept following him. A new report from The Guardian claims that Trump ordered his inauguration photos to be edited last year so that his crowds looked bigger. One photographer, operating under what he believed to be government orders, reportedly cropped out empty space in the photo (it's unclear whether the doctored image was ever released). Bustle has reached out to the White House for comment.\nAfter Trump's inauguration, people quickly noted that his audience hadn't filled up the National Mall and looked smaller than the one at President Barack Obama's inauguration in a side-by-side photo comparison. While the National Park Service (NPS) does not officially estimate crowd sizes, CNN noted that around 300,000 more people seem to have been riding the D.C. Metro on the morning of Obama's inauguration as opposed to Trump's, so it does seem likely that the former's crowd was larger.\nBut the photo comparison that went viral was really the sticking point for Trump. Evidently responding to his boss' concerns, White House Press Secretary Sean Spicer told reporters after the event that \"this was the largest audience ever to witness an inauguration, period.\" That apparently wasn't the end of it, according to The Guardian's new report.\nAccording to documents obtained by The Guardian under the Freedom of Information Act, Trump called Michael Reynolds, the acting director of NPS, early in the morning the day after his inauguration to talk about his inauguration photos. An agency official described the conversation between Reynolds and Trump in a report. She claimed that the president \"wanted to see pictures that appeared to depict more spectators in the crowd\" because the images already circulating showed \"a lot of empty areas.\" She \"assumed\" that meant that the photos \"needed to be cropped.\"\nThe documents reportedly show that Spicer also called the NPS several times that day to follow up about editing the images. According to The Guardian, another agency official said Spicer asked for photos that \"accurately represented the inauguration crowd size.\" The official said she interpreted that as \"a request for NPS to provide photographs in which it appeared the inauguration crowd filled the majority of the space in the photograph.\"\nPool/Getty Images News/Getty Images\nNPS reached out to the photographer who had documented the inauguration. He'd already submitted a round of images of the event the day before, but he was asked to go back and \"edit a few more.\"\nPer The Guardian, investigators noted in the documents that the photographer edited the pictures \"to make them look more symmetrical by cropping out the sky and cropping out the bottom where the crowd ended\" and \"did so to show that there had been more of a crowd.\" The result was a series of images \"that concentrated on the area of the national mall where most of the crowd was standing.\"\nInvestigators also noted that the photographer hadn't explicitly been told to crop images so that the audience looked bigger. But he was under the impression that that's what the official who contacted him \"had wanted him to do.\"\nTrump has continued to be preoccupied with crowd sizes since the inauguration. In May, he lambasted The New York Times — and the paper issued a correction — after it mistakenly reported the wrong number of people who'd attended his rally in Nashville.","url":"https://www.bustle.com/p/trumps-inauguration-crowd-photos-were-reportedly-edited-at-his-request-11772759"}
