{"authors":["Associated Press","David Martosko","Us Political Editor For Dailymail.Com"],"date_download":"2018-10-22 23:10:08","date_modify":"2018-10-22 23:10:08","date_publish":"2016-01-11 05:04:53","description":"RENO, Nev. (AP) — Republican presidential hopeful Donald Trump said Sunday he doesn't watch professional football much anymore because the NFL has gone \"soft...","filename":"data/vaneerConsumption/Trumptells3000inRenoNFLhasgonesoftliketheUS.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:34ffe84d174843bbb35bd68f452f6d95-48qEJGFphM8d437f0aaf92091658-391_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393390_Trump-tells-3-000-Reno-NFL-gone-soft-like-US_1540249808.html","title":"Trump tells 3,000 in Reno NFL has gone 'soft' like the US","title_page":"Trump tells 3,000 in Reno NFL has gone 'soft' like the US | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Republican presidential hopeful Donald Trump said Sunday he doesn't watch professional football much anymore because the NFL has gone 'soft' like the United States, leaving the game 'screwed up.'\nThe billionaire also told about 3,000 people during a Reno rally he believes he's leading in Iowa, New Hampshire and Nevada, and if he wins Iowa's first-in-the nation caucuses next month 'we're going to run the table.'\nTrump drew the football analogy during a campaign speech in a downtown ballroom while casino sportsbooks were jammed with fans across the street watching the NFL playoffs.\n'Football has become soft like our country has become soft,' he said. 'It's true. It's true.'\nIn recent years, the NFL has implemented various rules aimed at curtailing concussions among players amid rising concern over football safety, such as 15-yard penalties in many cases for helmet-to-helmet collisions and head-to-head blows.\nPeople greet Republican presidential candidate Donald Trump, left, after he spoke at a rally in Reno, Nev., Sunday, Jan. 10, 2016. (AP Photo/Lance Iversen)\n'So I'm watching a game yesterday,' Trump said. 'What used to be considered a great tackle, a violent head-on [tackle], a violent – if that was done by Dick Butkus, they'd say he's the greatest player. If that were done by Lawrence Taylor – it was done by Lawrence Taylor and Dick Butkus and Ray Nitschke, right? Ray Nitschke? You used to see these tackles and it was incredible to watch, right?'\n'Now they tackle. \"Oh, head-on-head collision, 15 yards.\" The whole game is all screwed up.'\nTrump said he's seen the same thing happen to superpowers around the world throughout history.\n'They become soft, they became weak and they disappeared,' he said. 'If I become president of the United States, we are going to be so strong.'\nHis attacks on the NFL came as the second day of the league's Wild Card playoff weekend unfolded in Minneapolis and Washington, where the home teams in both games lost.\n'It's a Sunday – who the hell wants to watch these crummy games?' he asked. 'I just want to watch the end.'\n'You say, \"Wow, what a tackle.\" Bing! Flag!'\nTrump took a direct shot at referees who he said throw penalty flags in order to have a greater influence on the outcome of games – and to get their faces on television.\n'The referees, they want to all throw flags so their wives see them at home. \"Oh, there's my husband.\" It's true.'\nTrump didn't mention the armed men who have taken over a national wildlife refuge in Oregon to protest U.S. land use restrictions.\nBut he said unfounded concerns about environmental impacts are among the reasons no one has ever built the sort of wall he proposes along the U.S. border with Mexico.\n'They couldn't get an environmental impact study approved to build the wall ... because of a snail, or a turtle or a snake was in the way,' he said.\nTrump said the only way he could lose Nevada's GOP caucuses Feb. 23 is if his supporters don't vote.\n'In this state, we are way ahead but you have to register or you can't vote. If you don't vote, this country is going to go to hell,' he said.\n'In New Hampshire, we are through the roof. People are already saying, 'Who's going to be second in New Hampshire?\" I love hearing that,' he said. 'If we win Iowa, I think we're going to run the table.'\nA Donald Trump supporter sports a sign on his cowboy hat before the Republican presidential candidate spoke at a rally Sunday, Jan. 10, 2016, in Reno, Nev. (AP Photo/Lance Iversen)","url":"https://www.dailymail.co.uk/news/article-3393390/Trump-tells-3-000-Reno-NFL-gone-soft-like-US.html"}
