{"authors":[],"date_download":"2018-10-30 01:16:20","date_modify":"2018-10-30 01:16:20","date_publish":"2018-07-20 00:05:26","description":null,"filename":"data/vaneerConsumption/TrumpKeepsonTicking.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/1024px-Vladimir_Putin__Donald_Trump_in_Helsinki_16_July_2018_3.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862180.html","title":"Trump Keeps on Ticking","title_page":"Trump Keeps on TickingThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Pearl Harbor. Kristallnacht. Treason. High crimes and misdemeanors. These are some of the hyperventilating left’s overheated and ludicrous characterizations of President Trump’s remarks at his Helsinki press conference with Vladimir Putin.\nListening to the Democrats and their wholly owned media subsidiary, you would have thought that Trump had (a) smilingly handed Putin a large red “reset” button or (b) had been caught on a hot mic during a global nuclear security summit murmuring to Putin’s representative that, after the midterm elections, he would have more flexibility in his dealings with Russia or (c) had signed off on a deal to give the Russians control of 20% of America’s uranium reserves in return for a $140,000,000 donation by Russian interests to his family’s foundation and a $500,000 fee paid to Melania for giving a speech in Moscow or (d) endangered national security by transmitting classified government documents over an unsecure private email server or (e) paid Russians for salacious, unverified slime to discredit Hillary Clinton or (f) during a presidential debate casually dismissed the Russian threat by joking that “The 1980s called; they want their foreign policy back.”\nOf course, he did none of the above. So, what did Trump do that for the thousandth time has summoned the furies of Le Résistance de la Gauche?\nHe — gasp — declined to publicly scold and insult Putin to his face and questioned the probity of our intelligence community, i.e., the deep state cabal who have been trying for the past three years to frame him for colluding with the Russians. In doing so, he pointed out the obvious fact that these ongoing efforts to destroy him have complicated and impeded his ability to conduct foreign policy especially in regard to this nation’s fraught relations with Russia, the world’s second largest nuclear power.\nHe was even so unpatriotic as to question the basis for Special Counsel Robert Mueller’s latest pretend indictment of 12 Russian intelligence officers which — to put it kindly — appears to be the product of questionable investigative work. Most tellingly, he asked how Team Mueller had determined that the Russians had hacked the Democratic National Committee’s computer when the DNC has forbidden law enforcement access to its server. This is a not inconsiderable question. (See “Mr. Mueller: Was the DNC Server Actually Hacked by the Russians?” in The American Spectator, March 29, 2018.)\nSo, has Trump sold out to the Russians? To anyone but the deranged left, his prior actions conclusively demonstrate that he has not. In August 2017, he approved sanctions against Russia for its meddling in the 2016 election, human rights violations, annexation of Crimea and military operations against Ukraine. In marked contrast to Barack Obama who had refused to sell arms to Ukraine, President Trump backed up these sanctions by authorizing weapons sales to the Ukrainians as well as the Republic of Georgia to aid their struggle against Russian aggression.\nIn March 2018, Trump ordered the expulsion of 60 Russians from the U.S. in response to allegations that Russian operatives had poisoned a former Russian spy in Great Britain. Twelve of these individuals were identified as Russian intelligence officers who worked out of the United Nations in New York. Trump also closed the Russian consulate in Seattle.\nIn April 2018, Trump imposed further sanctions on more than two dozen Russian oligarchs, 12 companies that they control, 17 senior government officials, and a state-owned arms dealer. The sanctions consisted of freezing all assets under U.S. jurisdiction belonging to these targets and forbidding U.S. citizens from transacting business with them.\n“The Russian government operates for the disproportionate benefit of oligarchs and government elites,” Treasury Secretary Steven Mnuchin said in the statement announcing the sanctions. “The Russian government engages in a range of malign activity around the globe, including continuing to occupy Crimea and instigate violence in eastern Ukraine, supplying the Assad regime with material and weaponry as they bomb their own civilians, attempting to subvert Western democracies, and malicious cyber activities. Russian oligarchs and elites who profit from this corrupt system will no longer be insulated from the consequences of their government’s destabilizing activities.”\nIn April 2018, Trump tweeted a warning to Russia that it should “get ready” for missiles to be fired at Syria. He added that Russia should not “be partners with a Gas Killing Animal,” i.e. Syrian President Assad. And then the United States fired missiles that killed an estimated 200 Russian “mercenaries” fighting for the Assad government.\nFinally, in the lead up to the Helsinki meeting, Trump chastised Germany for entering into a self-defeating gas pipeline deal whereby it would make itself energy dependent on Russia while the United States simultaneously funded NATO to protect Germany from Russian aggression.\nIt was against this record of concrete and consistent action against Russian interests that Trump met with Putin and sought to turn the page on the last 20 years of increasingly bitter and deteriorating relations with Russia. Because Trump did not engage in an imbecilic public denunciation of Putin and actually noted the harm caused to his presidency by the deep state’s efforts to frame him, he has been denounced as the new Benedict Arnold.\nIn response to this nonsense, President Trump tweeted, “I would rather take a political risk in pursuit of peace, than to risk peace in pursuit of politics.” To this he added, “Some people HATE the fact that I got along well with President Putin of Russia. They would rather go to war than see this. It’s called Trump Derangement Syndrome!”\nBut these sentiments, clearly calculated to make liberal heads explode, are nothing compared to his most recent declaration. He just announced plans for a second meeting with Putin. Wow!\nJust like those Timex watches of yesteryear, the man takes a licking but keeps on ticking!\nGeorge Parry is a former federal and state prosecutor who practices law in Philadelphia and blogs at knowledgeisgood.net. He may be reached by email at kignet1@gmail.com.","url":"https://spectator.org/trump-keeps-on-ticking/"}
