{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 21:21:39","date_modify":"2018-10-30 21:21:39","date_publish":"2016-02-03 19:13:14","description":"Throughout his campaign for the White House, Republican presidential candidate Donald Trump has remained unshakably friendly to Russian dictator Vladimir Putin, a journalist-assassin and country-invader, who has praised the business mogul as “brilliant and talented.” |","filename":"data/vaneerConsumption/TrumpSaysHeCantBeSeducedByPutinButRemainsOpentoRussiaAlliance.json","image_url":"https://media.breitbart.com/media/2016/02/trump-debate-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_03__1540934499.html","title":"Trump Says He Can’t Be ‘Seduced’ By Putin, But Remains Open to Russia Alliance","title_page":"Trump Says He Can’t Be ‘Seduced’ By Putin, But Remains Open to Russia Alliance | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Throughout his campaign for the White House, Republican presidential candidate Donald Trump has remained unshakably friendly to Russian dictator Vladimir Putin, a journalist-assassin and country-invader, who has praised the business mogul as “brilliant and talented.”\nIn a speech to supporters in New Hampshire Tuesday night, Trump said he was going to “beat the shit out of” the Islamic State terror group.\n“You know, interestingly, speaking of potential because he hates Obama so much. Putin. He said Donald Trump is a genius and he’s the real leader over in that country,” Trump told the crowd in Milford, New Hampshire.\nHe continued, “And these people that I’m negotiating with all the time. These people in the states with me. They said, ‘you should disavow what Putin of Russia said.’”\n“Don’t worry, I can’t be seduced,” Trump promised, “but wouldn’t it be nice if you think about it. Wouldn’t it be nice if we actually got along with Russia?”\n“And we can use them to knock out ISIS with us,” he added. “Let them beat the shit out of ISIS also.”\nTrump espoused comparable sentiments at a recent Republican debate.\n“As far as Syria, I like if Putin wants to go in,” he said in support of the Russian president. “I got to know him very well because we were both on 60 Minutes, we were stable mates, we did well that night … You know that, if Putin wants to knock the hell out of ISIS, I’m all for it 100 percent and I can’t understand how anybody would be against that.”\nThough study after study has shown Russia has not shown much interest or devoted many resources towards targeting the Islamic State, Trump has not stopped praising Russia as a potential partner.\nRussia and its state-controlled propaganda outlets, such as RT, claim they are targeting the terror group, but research has shown they are instead honing in on the immediate opponents of the dictatorial Assad regime in Syria.\nAt the beginning of Russia’s air campaign in Syria, the Pentagon found that over 90 percent of Russian strikes in Syria did not target the Islamic State or Al Qaeda-linked groups.\nAdditionally, the Institute for the Study of War has done comprehensive mapping of the region to prove that Russian air strikes continue to target areas where Islamic State has little or no presence.\nAnd when Moscow does decide to target ISIS-held territory, they show little regard for civilian lives, citizen journalists from the anti-ISIS, anti-Assad group Raqqa is Being Slaughtered Silently told Breitbart News.\nThe New York Times reported that when Russia entered into its air campaign in support of Bashar al-Assad’s regime, Moscow did not strike targets held by the group.\nThe Assad regime, backed by Iran, the terror group Hezbollah, and Russia, has instead focused its fire on rebel groups that have not displayed the fighting power comparable to the Islamic State. Taking advantage of this reality, Assad tasked the Russians to help with his extermination campaign against the Syrian opposition.\nThe Kremlin has helped turn the tide of the Syrian Civil War in favor of the brutal Assad regime. The Assad regime’s continuing offensives have crippled international talks tasked to bring parties together for a long-term peace agreement. For every Syrian killed by the Islamic State, seven are murdered by forces loyal to Bashar Assad, according to studies.\nGeorge W. Bush “looked the man in the eye” and saw someone other than a KGB goon. A Trump Administration should not make the same mistake, and wholeheartedly reject an alliance with Vladimir Putin, who has sparked the murder of thousands of innocents in Europe and the Middle East.","url":"https://www.breitbart.com/politics/2016/02/03/trump-says-he-cant-be-seduced-by-putin-but-continues-pushing-false-kremlin-talking-points/"}
