{"authors":[],"date_download":"2018-10-30 14:24:43","date_modify":"2018-10-30 14:24:43","date_publish":"2018-07-20 00:00:00","description":null,"filename":"data/vaneerConsumption/TrumpChurchillsChairandBarackObama.json","image_url":"https://www.americanthinker.com/images/bucket/2018-07/207657.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2018_07_trump_churchills_chair_and_barack_obama_1540909483.html","title":"Trump, Churchill’s Chair, and Barack Obama","title_page":"Trump, Churchill’s Chair, and Barack Obama","title_rss":"NULL","source_domain":"americanthinker.com","text":"Despite Charles, William, and newlywed Harry’s absence , Mr. and Mrs. Trump arrived at Windsor Castle where they were greeted by the 92-year-old Queen who didn’t invite them to a sleepover like she did the Obamas, but did serve tea .\nRecently, on Donald Trump’s “ working visit ” to the UK, environmentalist royal princes Charles and William refused to meet the President. Based on their boorish behavior, the population control liberals may be emulating Barack Obama, who exhibited hostility toward world leaders when he refused to attend Bibi Netanyahu’s address to a joint session of Congress.\nAfter the visit, no one reported whether or not Melania “charmed” the aging monarch by trapping her in a Michelle Obama-style death grip. However, the press did allege that in place of DVDs and recordings of Trump rallies, the first couple broke with Southside of Chicago protocol and showed up instead with a historical artifact as a gift.\nPetty British tabloids, behaving like a future mother-in-law sizing up her only son’s girlfriend, criticized the President for arriving late to meet Her Majesty (which he did not), strolling nonchalantly in front of the Queen (he’s a relaxed guy), and for shaking the Queen’s hand when he also bowed. Stopping just short of accusing Donald Trump of exhaling when he should inhale, the British press must have forgotten that Obama, who bowed for Saudi kings, didn’t bow for the Queen.\nThe resentment comes from British colonialists who cooed over anti-colonialist Obama even after he thought “God Save the Queen,” was the musical accompaniment to his Shakespearian-themed toast at the Queen’s State Dinner, and who, behind closed doors, allegedly mocked America’s so-called “special relationship” with Britain.\nAnd while the Queen of England was courteous, amongst the commoners, Arab Spring-like, Soros-funded, pink pussy hat gatherings and street-level protests greeted America’s president with loud and boisterous animosity.\nThankfully for the protesters, Trump had rolled back the offshore safety rules that crashed British pensions when Obama trash-talked British Petroleum after the Gulf oil spills. With rebounding annuities, demonstrators must have had extra cash to buy Dump Trump posters. Thus, central London overflowed with Trump-bashers dressed in red, white and blue bikinis being shielded from the hot sun by a mini-blimp featuring Baby Trump in a nappy.\nDuring the POTUS’s time at Prime Minister Theresa May’s residence at Chequers in Buckinghamshire, many were aghast when Trump sat in Winston Churchill’s chair. Remembering back, these same Brits were only mildly offended when Kenyan Son, Barack ‘Neville Chamberlain’ Obama wrapped Winston Churchill’s bust in bubble wrap, evicted it from the Oval Office, and banished it back to Britain.\nNonetheless, the outrage from Winston-defenders was so hateful toward Trump, one would think the POTUS had turned London into Little Mecca or dared sit in Rosa Park’s seat on the bus or rested his big feet on the Resolute Desk in the Oval Office.\nResponding to Trump’s bold armchair move, the British Daily Mirror ran a cover story featuring the words “How dare you?” The headline broadcasted an image of Donald sitting in Old Lion’s leather worn armchair.\nThe front-page story read:\nYou insult our country, attack our [National Health Service], embarrass our Queen, undermine our ‘special relationship,’ humiliate our [prime minister]… and then smugly pose in Winston Churchill’s armchair.\nWhen compared to Barack meekly siding with Argentina over a war in the Falkland Islands, or the former president unpretentiously downgrading Great Britain and calling France America’s closest ally, in British circles, sitting in Churchill’s chair is considered “smug.”\nSpeaking of Churchill, the press observed that for a lavish dinner at Blenheim Palace in Oxford, Melania, resplendent in a luscious yellow couture gown, was reminiscent of Princess Belle in Beauty and the Beast dancing with her “bestial-looking prince.” Meanwhile, when a grim-faced Michelle Obama showed up at a State Dinner at Buckingham Palace wrapped in gauze, not one publication compared the former first lady to a Q-Tip aiming for Obama’s ear.\nAfter that sleepover, Michelle and Barry repaid the Queen’s hospitality by complaining about the lousy food at Buckingham Palace and publicly discussing the rodents. Then, on a later trip, nary a British protester took to London’s streets to object when Obama threatened that if the British dared vote to leave the European Union, future trade agreements with the U.S. would place them at “the back of the queue.”\nBased on the absence of a big black Baby Barack Balloon greeting Obama, President Trump sitting with his legs crossed at the knee in Churchill’s leather chair must far exceed the former president coaxing Moscow to sign the START Treaty by sharing sensitive information on Britain’s nuclear deterrents.\nIn the end, after unfair British indictments, street-level protests, and rude treatment by left-leaning royals, it was the guy who owned the chair whose words should be President Trump’s take away from this UK visit: “You have enemies? Good. That means you’ve stood up for something, sometime in your life.”\nJeannie hosts a blog at www.jeannie-ology.com","url":"https://www.americanthinker.com/articles/2018/07/trump_churchills_chair_and_barack_obama.html"}
