{"authors":["Dave Burke For Mailonline"],"date_download":"2018-10-23 01:44:06","date_modify":"2018-10-23 01:44:06","date_publish":"2017-03-10 10:08:33","description":"Ethics lawyers were in a state of panic after President Donald Trump and Kellyanne Conway responded to Ivanka's clothing like being dropped by Nordstrom.","filename":"data/vaneerConsumption/TrumpsethicslawyerspanickedoverIvankaandNordstrom.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/153546D800000514-0-image-a-28_1489140497328.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300492_Trump-s-ethics-lawyers-panicked-Ivanka-Nordstrom_1540259046.html","title":"Trump's ethics lawyers panicked over Ivanka and Nordstrom","title_page":"Trump's ethics lawyers panicked over Ivanka and Nordstrom | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"White House ethics lawyers were in a state of panic after President Donald Trump and Kellyanne Conway responded to Ivanka's clothing line being dropped by Nordstrom, newly-released emails have revealed.\nWithin hours of Trump posting an indignant tweet on February 8 claiming his daughter had been treated unfairly, the top lawyer at the Office of Government Ethics, David Apol, asked Trump's White House ethics lawyers for a phone call.\nThe following day they had another problem, after Trump adviser Kellyanne Conway plugged Ivanka's clothing line on live TV from the White House.\nScroll down for video\nOn February 8 Trump tweeted his indignation after department store Nordstrom dropped his daughter Ivanka's clothing line\nIn his controversial tweet, Trump described Ivanka as 'a great person'\nAn email exchange between David Apol, from the Office of Government Ethics, and Trump lawyers has been obtained by NBC after a Freedom of Information request.\nApol contacted the White House legal team asking for a phone call about 'an issue that has come up' hours after Trump's tweet.\nThe President wrote on Twitter: 'My daughter Ivanka has been treated so unfairly by Nordstrom. She is a great person -- always pushing me to do the right thing! Terrible!'\nWithin five minutes, NBC reveals, Trump lawyer Stefan Passantino had got in touch, with Apol stating the call discussed 'the President's tweet concerning the decision of Nordstrom to stop carrying his daughter's line of products'.\nKellyanne Conway gave Ivanka's clothing line a free plug live on Fox News, prompting a panicked response from ethics lawyers\nThe President came under fire after tweeting his support for his daughter after Nordstrom dropped Ivanka's clothing line\nThe following morning, the two lawyers held another discussion following Kellyanne Conway's comments about the President's daughter's clothing line.\nConway, on Fox News, said: 'I'm going to give a free commercial here. Go buy it today, everybody.'\nPassantino contacted Apol to 'reassure' the ethics office that he would take 'appropriate action'.\nFollowing Conway's plug, the ethics office's website crash amid a surge of web traffic. But it has yet to make a public comment on the controversy.\nThe emails, NBC reports, reveal an 'extraordinary level of public interest and concern', but also showed staffers believe their office is underfunded.\nYesterday the director of the Office of Government Ethics penned a letter to the White House scolding the administration for not punishing Kellyanne Conway for plugging Ivanka Trump's clothing line on live TV.\nOGE head Walter Shaub suggested the administration's reasoning for not slapping Conway on the wrist could undermine the 'integrity of government.'\n'Not taking disciplinary action against a senior official under such circumstances risks undermining the ethics program,' wrote Shaub, in a letter addressed to White House Deputy Counsel Stefan Passantino.","url":"https://www.dailymail.co.uk/news/article-4300492/Trump-s-ethics-lawyers-panicked-Ivanka-Nordstrom.html"}
