{"authors":["John Nolte"],"date_download":"2018-10-30 17:58:07","date_modify":"2018-10-30 17:58:07","date_publish":"2015-12-28 13:53:09","description":"Oddly enough, even after the tongue bath Andrea Mitchell gave DNC Chair Debbie Wasserman-Schultz on Sunday's \"Meet the Press\" (Just how big of a sexist |","filename":"data/vaneerConsumption/TrumpWarnsHillaryClintonAboutSexistCardBillsTerribleRecordofWomenAbuse.json","image_url":"https://media.breitbart.com/media/2015/12/Trump-Hillary-Clinton-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_28__1540922287.html","title":"Trump Warns Hillary Clinton About Sexist Card: Bill's 'Terrible Record of Women Abuse'","title_page":"Trump Warns Hillary Clinton About Sexist Card: Bill's 'Terrible Record of Women Abuse' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Oddly enough, even after the tongue bath Andrea Mitchell gave DNC Chair Debbie Wasserman-Schultz on Sunday’s “Meet the Press” (Just how big of a sexist pig is Trump, Debbie?), Republican frontrunner Donald Trump doesn’t seem at all intimidated by the DNC Chair’s warning about how those who criticize Bill Clinton do so at “their own peril.” Less than 24 hours later, the billionaire businessman went there:\n—\nIf Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women’s card on me, she’s wrong! — Donald J. Trump (@realDonaldTrump) December 28, 2015\n—\nThe Establishment Republican Party, which has lost the popular vote in 5 of the last 6 elections, has signaled that they are ready to roll over and die under a new wave of War on Women attacks. Although Bill Clinton still stands under the shadow of a rape accusation and numerous harassment complaints (including one he settled), fearing the DC Media and their own incompetence, the GOP Establishment serial-losers have already raised the white flag of surrender on this issue.\nTrump, however, has not. In fact, he has spent months laying the groundwork to blunt these phony attacks.\nHillary Clinton’s DC Media allies believe they already have the 2016 election won. It is a two-part plan, and part one is scratched off the list.\nEven though new documents proved she lied to America and the families, declare Hillary Clinton the comeback winner of the Benghazi hearing. Todd Akin the GOP to death.\nIt all appeared so easy and simple, and will be if an Establishment candidate wins the GOP primary.\nTrump, who has an actual real-world record of hiring, promoting, and supporting hundreds, perhaps thousands of women, will not roll over and die. He’s signaling all over the place that he intends to take the War on Women fight right to her — to her and her sleazy husband and their media allies, by finally exposing the truth about the half-dozen or so women who claim they were victims, not only of Bill’s predations, but Hillary’s campaign to personally destroy and silence them.\nSmarter still, Trump is positioning this battle as the fault of Hillary Clinton. During a Sunday appearance, Trump told Fox News:\nI think [Bill Clinton is] fair game because his presidency was considered to be troubled, to put it mildly, Because of all the things she’s mentioning to me. She actually said sexism, I don’t know if you saw the following tweet, but I turned her words against her from that standpoint. She’s got to be careful and fair. We all have to fight fairly and we have to fight for the good of the country, for the good of the people, for the good of everybody. But we have to fight fairly. And she’s playing the woman’s card. It’s like, give me a break. I have had so many women come up to me, saying, ‘you have to keep her out.’ She’s just terrible. She’s playing the woman’s card left and right. And women are more upset about it than anybody else, including most men.\nTrump, who is always playing chess with the corrupt DC Media, is already a step ahead of them. “She started it,” he is saying, which checkmates that part of the media’s playbook where they blow these attacks back on the GOP with accusations of “gutter politics.” That’s awfully hard to do when Trump is correctly pointing out that he’s merely bringing the issue up on defense.\nTrump is outright warning Hillary and her lapdog media that he is fully prepared to weaponize her primary liability, fully prepared and eager to make this every bit as ugly as necessary, but how ugly it gets is up to her.\nThis paints Hillary and her media into a corner. The last thing the DC Media wants is to litigate Hillary’s treatment of these half-dozen or so women, who claim to be victims of both Hillary and Bill. The media’s done everything in its evil power to bury this story and airing it now would only reveal to the public another one of the media’s many cover-ups.\nHillary sure as hell doesn’t want to have this fight.\nBut how else can she win the presidency? Without the phony War on Women Card, Hillary will have to run on a record where her only accomplishments are lies and failure and death.\nAs far as the GOP primary goes, this is genius politics of Trump’s part. Republican base voters have been waiting eight years for a candidate willing to fight like the Clintons and Obama, which is all Trump is really doing. Fearing the corrupt DC Media, we left Obama’s racist preacher and mentor, his terrorist pal Bill Ayers, and Benghazi on the table.\nWe either fight like Democrats, or we lose. We either violate the parameters of the debate as defined by the rotting and corrupt DC Media, or we lose.\nAnd the Base is tired of losing.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/politics/2015/12/28/trump-warns-hillary-clinton-about-sexist-card-bills-terrible-record-of-women-abuse/"}
