{"authors":["Dennis Green"],"date_download":"2018-10-30 23:10:58","date_modify":"2018-10-30 23:10:58","date_publish":"2016-12-08 00:00:00","description":"A small watch workshop has given a Vulcain Cricket to nearly every US president since Harry Truman, but its future is in doubt.","filename":"data/vaneerConsumption/TrumpwillreceiveVulcainCricketwatch.json","image_url":"https://amp.businessinsider.com/images/584984ddba6eb69a018b81a2-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trump-will-receive-vulcain-cricket-watch-2016-12_1540941058.html","title":"Trump will receive Vulcain Cricket watch","title_page":"    Trump will receive Vulcain Cricket watch - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The Vulcain Cricket. Facebook/Vulcain A little-known American tradition could be in danger.\nEver since former President Harry Truman wore a Vulcain Cricket watch while in the White House, it's been a tradition to celebrate a new Commander-in-Chief's inauguration with a gift of the same model, the watchmaker told Bloomberg.\nThe watch in question is the Vulcain Cricket, a mechanical watch dating back to 1947. It has an alarm function that supposedly sounds like a cricket, which the Secret Service has mistaken for a bomb in the past, according to the company.\nSome models, like the chronograph, retail in the $20,000 dollar range, though a typical model sells for one-third of that. It's unclear exactly which model will be sent to President-elect Donald Trump.\nThough Trump will receive his watch, the future of the tradition is in question, as a steep downturn in the Swiss watch industry has forced Vulcain to cut its staff from 12 to just five employees.\n\"We're small and we're struggling as we also compete with the big players who have more brand recognition,\" Daniel Wechsler, Vulcain's VP of sales and marketing, told Bloomberg.\nThe Swiss watch industry at large is in some trouble thanks to weak worldwide demand and changing consumer tastes.\n\"Swiss watch industry exports fell faster than at any other time in the first half\" of the year, said a report that was recently released by Federation of the Swiss Watch Industry FH. Compagnie Financière Richemont SA — parent of A. Lange & Söhne, IWC Schaffhausen, Jaeger-LeCoultre, and Cartier — erased 350 jobs this year, while Swatch Group — the biggest Swiss watchmaker, which makes cheap plastic models as well as luxury brands like Omega — saw profits fall 53.6% year over year.\nIt's not yet clear whether the Vulcain watch Trump receives at inauguration will mark the end of the the six-decade tradition. The small workshop, which dates back to 1858, may even be for sale. It has been owned by the Saudi Arabian Al-Rayes family since 2009.","url":"https://www.businessinsider.com/trump-will-receive-vulcain-cricket-watch-2016-12"}
