{"authors":["Abc News","More Matthew"],"date_download":"2018-10-30 00:54:17","date_modify":"2018-10-30 00:54:17","date_publish":"2018-10-28 22:13:21","description":"If Democrats win back the House, Trump's tax returns could be exposed.","filename":"data/vaneerConsumption/TrumptaxreturnsDemocratssayelectionwinwouldfinallybringanswers.json","image_url":"https://s.abcnews.com/images/Politics/trump-nc-rally-02-ap-jef-181026_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Politics_democrats-plot-pro_f4019669d3b34d6df3133e7c47a282fc_story_id=58816284_1540860857.html","title":"Trump tax returns: Democrats say election win would finally bring answers","title_page":"Trump tax returns: Democrats say election win would finally bring answers - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Since the launch of his presidential bid, Donald Trump's political opponents have tried -- and failed -- to obtain his tax returns.\nThat could change in November.\nIf Democrats take control of the House of Representatives in the midterm elections, and with it the House Ways and Means Committee, they will have the explicit authority to compel the Internal Revenue Service to produce the tax return of any U.S. citizen -- including the president.\nRep. Bill Pascrell, a New Jersey Democrat, is one of several committee members who told ABC News the committee plans to launch a review of Trump's tax filings if and when Democrats take the reins.\n\"We will recommend a thorough review on a non-partisan basis, something I began asking for 18 months ago,\" Pascrell said. \"We are allowed to investigate this. Nothing should step in our way.\"\nExcept, perhaps, Trump himself.\nIf Democrats gain control of the House, Republicans may have little leverage, but one senior Democratic staff member said members are girding for a fight should the Trump administration refuse to turn over the records.\nNicholas Kamm/AFP/Getty Images\nTrump's legal team declined to comment on the subject when reached by ABC News. Former Republican Speaker of the House and Trump ally Newt Gingrich, however, predicted during a live event at The Washington Post this week that Trump and his advisers could mount a legal battle over the tax returns that would test the newly conservative balance of the U.S. Supreme Court.\n\"We'll see,\" he said, referring to recently sworn-in Justice Brett Kavanaugh, \"whether or not the Kavanaugh fight was worth it.\"\nExperts told ABC News that Trump's tax returns could help the committee determine if the president has properly paid his taxes -- of particular interest in the wake of a lengthy investigation by The New York Times revealed an apparent tax-avoidance scheme that helped Trump build his early fortune -- and reveal any undisclosed conflicts of interest.\nCharles Harder, Trump's attorney, vehemently denied the allegations reported by the Times.\nBut, according to one leading expert, it will not be a simple undertaking.\n\"It's going to be a long slog,\" said Mark E. Matthews, an attorney in private practice at the Washington firm Caplin and Drysdale who once served as the head of the IRS Criminal Investigation Division, \"to get to the meat of this.\"\nHouse Democrats said they've not yet determined what documents they intend to review, but if the IRS does eventually turn them over to the committee, the process currently allows only the chairman to view the documents initially, until he or she designates another member to be his \"agent.\" The committee would then have to vote behind closed doors to release them to the full House before they would become public.\nRepublicans on the committee, who for months have thwarted repeated efforts by Democrats to review Trump's tax filings, appear poised to at least put up a fight. Earlier this month, Ways and Means Chairman Kevin Brady, a Texas Republican, responded on Twitter to statements from Democrats suggesting they would pursue copies of the returns.\nJ. Scott Applewhite/AP\n\"This is dangerous,\" Brady wrote. \"Once Democrats abuse this law to make public @realDonaldTrump tax returns, what stops them from prying/making public YOUR tax returns for political reasons? Who is next? #AbuseOfPower #EnemiesList\"\nPascrell said a review would be conducted by both by tax analysts on the committee staff as well as outside auditors, and the probe could eventually include interviews with senior Trump Organization officials.\nThere are likely to be separate filings from The Trump Organization, the privately held global firm the president oversaw before taking office, which still provides him financial benefits even though it's now officially run by his sons, Don Jr. and Eric.\nMartin Sheil, a retired IRS criminal investigator, said the tax filings could provide details about the president's family business dealings around the globe that may not have appeared in Trump's financial disclosure reports, such as the lenders who backed various Trump ventures, the identities of those he's still repaying and the potential that he could have engaged in financial activity with foreign entities.\nSheil said he expects lawmakers would want to know if his disclosures masked anything included in his tax returns.\n\"They would want to know, did he file any foreign bank account records?\" Sheil said. \"Does he have any overseas bank accounts? And has he reported them? Has he checked off those boxes?\"\nUntangling and understanding the complex finances behind the Trump empire will not be easy, the experts said, and Trump's tax return alone will not answer every question.\nMark Reinstein/Corbis via Getty Images\nThere are likely separate filings dealing with any foreign holdings and gifts he gave and received, Matthews said. The nature of Trump's business suggests there will be filings related to licensing income, intellectual property issues and, of course, he said, Trump's vast real estate holdings.\n\"They're going to really need someone who knows the real estate world,\" Matthews said. \"That is a quagmire. It's always a nest of partnerships and limited liability corporations. ... They will need to bring in experts.\"\nOne of them could come from within the Trump Organization.\nAccording to Beth Shapiro Kaufman, who once served in the Treasury Department's Office of Tax Policy but is now in private practice at Caplin and Drysdale, no one could explain Trump's tax filings better than Allen Weisselberg, the Trump Organization's longtime chief financial officer.\n\"If there is anybody who could suddenly bring this alive, that's the person you are looking for,\" she said. \"The trusted insider, who knows the methodology and was in the room.\"\nWeisselberg has already struck a deal to provide testimony to federal officials in New York in the case against longtime Trump personal attorney Michael Cohen, according to sources involved in the matter, but whether he would willingly help lawmakers understand the tax returns of the family that employed him for the better part of a lifetime is unclear.\nCraig Ruttle/AP, FILE\nA Trump Organization spokesman declined to comment when asked whether Weisselberg or the president's family business would resist efforts by Congress to review its financial filings.\nBut it's clear there were few Trump insiders who've been more trusted that Weisselberg.\n\"Allen has been with me for 30 years and knows how to get things done,\" Trump wrote in his 2004 book, \"Think Like a Millionaire.\" \"He did whatever was necessary to protect the bottom line.\"\nABC News' John Santucci and Ben Siegel contributed to this report.","url":"https://abcnews.go.com/Politics/democrats-plot-probe-trumps-tax-returns-republicans-prepare/story?id=58816284"}
