{"authors":["Associated Press"],"date_download":"2018-10-22 22:37:27","date_modify":"2018-10-22 22:37:27","date_publish":"2017-03-16 04:09:31","description":"WASHINGTON (AP) - President Donald Trump is calling for privatizing the nation's air traffic control operations in his budget proposal, a top priority of the...","filename":"data/vaneerConsumption/Trumpcallsforprivatizingairtrafficcontroloperations.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/22/wire-230933-1489701619-676_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318782_Trump-calls-privatizing-air-traffic-control-operations_1540247847.html","title":"Trump calls for privatizing air traffic control operations","title_page":"Trump calls for privatizing air traffic control operations | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - President Donald Trump is calling for privatizing the nation's air traffic control operations in his budget proposal, a top priority of the airline industry.\nThe proposal says spinning off air traffic operations from the Federal Aviation Administration and placing them under an \"independent, non-governmental organization\" would make the system \"more efficient and innovative while maintaining safety.\"\nThere are about 50,000 airline and other aircraft flights a day in the United States. Both sides of the privatization debate say the system is one of the most complex and safest in the world. The FAA would continue to provide safety oversight of the system under a congressional privatization plan.\nAir traffic controllers work in the tower at John F. Kennedy International Airport in New York, Thursday, March 16, 2017. President Donald Trump is calling for privatizing the nation's air traffic control operations in his budget proposal, a top priority of the airline industry. (AP Photo/Seth Wenig)\nAirlines have been lobbying vigorously for the change, saying the FAA's NextGen program to modernize the air traffic system is taking too long and has produced too few benefits. Industry officials say that privatization would remove air traffic operations from the uncertainties of the annual congressional budget process, which have hindered the FAA's ability to make long-term procurement commitments.\nThe National Air Traffic Controllers Association, the union that represents the FAA's 14,000 controllers, backed an unsuccessful congressional attempt at privatization last year. The union said it will evaluate Trump's plan. Union officials have complained that the FAA has been unable to resolve chronic controller understaffing at some of the nation's busiest facilities, and they say they've become discouraged by the modernization effort's slow progress.\nBut FAA Administrator Michael Huerta told an aviation industry conference earlier this month that the agency has made \"tremendous progress\" over the past decade in updating its computers and other equipment in order to move from a radar-based to a satellite-based control system. The modernization program has already delivered $2.7 billion in benefits to airlines and other users of the system, and the FAA expects to produce another $13 billion in benefits by 2020, he said.\nAirlines have an important ally in Rep. Bill Shuster, R-Pa., the House transportation committee chairman. The committee approved an aviation bill sponsored by Shuster last year that would have removed air traffic operations from the FAA and placed them under the control of a private, nonprofit corporation. The bill would also have protected the controllers' wages and benefits and continued their union representation.\nOpposition to the bill from other powerful House committee chairmen who oppose ceding Congress' oversight of the air traffic system to a private entity prevented Shuster from bringing the bill before the entire House for a vote. Lobbying groups representing business aircraft operators, private pilots and small and medium-sized airports also oppose privatization. They say they fear airlines will dominate the corporation's board and that they'll be asked to pay more to support the system while facing reduced services.\nShuster received $148,499 in airline industry campaign contributions in the 2016 election, making him the industry's top recipient in the House, according to the political money tracking site Opensecrets.org. Shuster was also an early House backer of Trump's presidential campaign, and campaigned with him in Pennsylvania three times. Since the election, he has pressed Trump and White House officials to back privatization.\nIn 1981, President Ronald Reagan fired the nation's air traffic controllers after they went on strike. The current privatization debate is unrelated to that labor dispute.\n___\nFollow Joan Lowy at http://twitter.com/AP_Joan_Lowy. Her work can be found at http://bigstory.ap.org/content/joan-lowy","url":"https://www.dailymail.co.uk/wires/ap/article-4318782/Trump-calls-privatizing-air-traffic-control-operations.html"}
