{"authors":["Ian Mason"],"date_download":"2018-10-30 21:44:11","date_modify":"2018-10-30 21:44:11","date_publish":"2018-07-10 01:00:55","description":"Shortly after 9 p.m. Eastern Trump, emerged to announce Judge Kavanaugh, 53, as the winner of the last week's closely watched horse race.","filename":"data/vaneerConsumption/TrumpAnnouncesBrettKavanaughasSupremeCourtNominee.json","image_url":"https://media.breitbart.com/media/2018/07/AP_18191040951371.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_09__1540935851.html","title":"Trump Announces Brett Kavanaugh as Supreme Court Nominee","title_page":"Trump Announces Brett Kavanaugh as Supreme Court Nominee","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump stood in the East Room of the White House Monday night with his eagerly anticipated pick to replace retiring Supreme Court Justice Anthony Kennedy: Judge Brett Kavanaugh of the U.S. Court of Appeals for the District of Columbia Circuit.\nShortly after 9 p.m. Eastern, Trump emerged to announce Judge Kavanaugh, 53, as the winner of the last week’s closely watched horse race. That race began with a shortlist of 25 winnowing down to four, then saw Judges Raymond Kethledge and Amy Barrett fall out of contention in the late running, and ended with a photo finish as Kavanaugh pulled ahead of Judge Thomas Hardiman.\n“For more than four decades, Justice Kennedy served our country with incredible passion and devotion,” Trump said, thanking the retiring Justice for his service. He then introduced Maureen Scalia, the late Justice Antonin Scalia’s widow, and Edwin Meese, Ronald Reagan’s attorney general who played a major role in shaping President Reagan’s judicial nominations.\n“In keeping with President Reagan’s legacy, I do not ask about a nominee’s personal opinions, what matters is not a judge’s political views, but whether they can set aside those views to do what the law and the constitution require. I am pleased to say that I have found, without doubt, such a person,” the president said before he announced Kavanaugh’s entrance from stage right. “Tonight it is my honor and privilege to announce that I will nominate Judge Brett Kavanaugh to the United States Supreme Court.”\n“Judge Kavanaugh has impeccable credentials, unsurpassed qualifications, and a proven commitment to equal justice under the law,” Trump said before handing the podium over to his nominee.\nKavanaugh gave a brief speech introducing himself, his family, and describing his approach to his upcoming role on the nation’s highest court. “My judicial philosophy is straightforward—a judge must be independent and must interpret the law, not make the law,” he said. “A judg emust interpret statutes as written, and a judge must interpret the Constitution as written–informed by history and tradition and precedent.”\nKavanaugh will now face Senate confirmation for a lifetime appointment to the nation’s highest court. With Sen. John McCain (R-AZ) not in Washington this session due to illness, all 50 remaining Republican votes, or some number of Democrats will be needed to confirm Kavanaugh.\n“President Trump has made a bold move by tapping Judge Kavanaugh to serve on our nation’s highest court,” said Trump Presidential Transition Team senior adviser Ken Blackwell, who sits on the National Rifle Association’s board of directors and and is in leadership at the Family Research Council, in an exclusive statement to Breitbart News. “Constitutional conservatives have been hoping and praying for this day for more than 30 years.”\nJudge Kavanaugh, who once clerked for Justice Kennedy, the man Trump tapped him to replace, has sat on the D.C. Circuit, which plays a pivotal role in the litigation affecting the workings of the federal government, for more than 12 years. In that time, he racked up an impressive record of staunchly conservative, original meaning-driven interpretations of the U.S. Constitution and federal law.\nKavanaugh’s dissent in the first major Second Amendment case to follow the landmark District of Columbia v. Heller decision is a classic example of judicial originalism and a favorite of gun rights advocates. For more than 50 pages, he invokes a historically driven understanding of the meaning of the constitutional right to keep and bear arms to explain why he would have overturned Washington, D.C.’s government gun registry and near-complete ban on semi-automatic firearms. He voted to protect religious freedom of employers who did not comply with Obamacare’s contraception mandate, and he vigorously applied the Constitution to rein in the regulatory state, supplying the reasoning the Supreme Court eventually used in several landmark conservative administrative law decisions.\nBut it is Kavanaugh’s consistent rulings on immigration, the central issue of Donald Trump’s “America First” agenda, that set him apart from the other top candidates for the Supreme Court. Always referring to illegal immigrants as such, he explicitly sided with American workers in his major immigration opinions. “[A]n illegal immigrant worker is not a lawful ’employee’ in the United States,” Kavanaugh wrote in a dissent in which he would have excluded illegally employed aliens from American union elections.\nIn 2014, another Kavanaugh dissent, Fogo de Chao v. Department of Homeland Security, expounded an understanding that American immigration laws exist to protect American workers and rejecting the “jobs Americans won’t do” ideology of open-border groups and the pro-cheap-labor business lobby:\nBut the “Americans can’t learn to cook” proposition is a factually unsupported stereotype that finds no home in the specialized knowledge visa program. And the “Americans won’t cook” proposition in the end is just an economic argument. Like other restaurants, Fogo de Chao must compete in the chef market by offering better wages or benefits to attract quality chefs. Fogo de Chao undoubtedly would save money if it could simply import experienced Brazilian chefs rather than hiring and training only American chefs to cook at its steakhouses here in the United States.\nThese attitudes helped Kavanaugh rack up the support of advocates for America’s “forgotten men and women” like Hillbilly Elegy author J.D. Vance and conservative author and columnist Ann Coulter. White House Counsel Don McGhan, the president’s most senior lawyer, also reportedly pushed Kavanaugh as his favorite among the president’s shortlist.\nAs Loyola University Maryland political science professor Jesse Merriam put it Friday in a Real Clear Politics op-ed, “Judge Kavanaugh is the only candidate with a demonstrated legal understanding of the political issues that inspired millions of forgotten Americans to come out to the polls and vote for Donald Trump. Judge Kavanaugh is the America First choice.”\nKavanaugh is also notable, even among his highly accomplished fellow-shortlisters, for his impeccable academic and lawyerly credentials. After earning both his undergraduate and law degrees from Yale University, where he served on masthead of the Yale Law Journal, Kavanaugh secured two federal appellate clerkships, including one with famed libertarian Judge Alex Kozinski on the U.S. Court of Appeals for the Ninth Circuit, served as a fellow under then-Solicitor General Ken Starr, and finally clerked for Justice Kennedy on the Supreme Court.\nLater in the 1990s, Kavanaugh rejoined Starr for his historic stint as independent counsel, working on the string of investigations of the Clinton family and White House that would lead from the Whitewater scandal all the way to only the second presidential impeachment in American history. When a Republican returned to the White House in 2001, Kavanaugh served in President George W. Bush’s White House Counsel’s office until 2003, then as White House staff secretary which, as the gatekeeper who must clear every piece of paper going into the Oval Office for a presidential signature, is one of the most powerful positions in the White House, until 2006. President Bush appointed him to the D.C. Circuit that year.\nConservatives who expressed concerns over a potential Kavanaugh nomination often pointed to these connections to Bush 43 as the source of their concerns. Another source of controversy was his dissenting opinion in a 2011 Obamacare decision, Seven-Sky v. Holder. While Kavanaugh voted to rule certain parts of the Affordable Care Act (ACA) unconstitutional, his reasoning that the law’s “individual mandate” triggered the federal Anti-Injunction Act and therefore deprived all federal courts (including his) of jurisdiction to rule upon the individual mandate until it went into effect. Chief Justice John Roberts later borrowed some of Kavanaugh’s legal reasoning and flipped it on its head to rule that the Supreme Court had jurisdiction over the case, but should uphold the individual mandate as a tax.\nBut conservatives continue to be fans of many of Kavanaugh’s decisions and writings. He is a critic of Chevron deference, under which federal courts defer to government agencies’ interpretations of the statutes they administer. He has also authored opinions supporting religious liberty, including public prayer and a religious-liberty exception to Obamacare’s abortion-pill mandate.\nHe also recently wrote that the Consumer Financial Protection Bureau is unconstitutional, in a major decision headed to the Supreme Court that he would likely now recuse from.\nAs with all of Trump’s potential Supreme Court nominees, Kavanaugh also faces the potential hurdle of moderate Republican Sens. Susan Collins (R-ME) and Lisa Murkowski (R-AK), who have threatened to vote against any nominee who does not consider the Supreme Court’s Roe v. Wade decision that mandated nationwide abortion-on-demand in 1973 to be “settled law.” In 2006, as Kavanaugh was being confirmed to the D.C. Circuit, Sen. Chuck Schumer grilled him on this very issue. Kavanaugh stated merely that, “If confirmed to the D.C. Circuit, I would follow Roe v. Wade faithfully and fully… It’s been decided by the Supreme Court.”\nKavanaugh is a Roman Catholic and a graduate of Georgetown Preparatory School, the Washington, D.C. area’s storied all-boys Catholic high school, from which Trump’s first Supreme Court pick, Justice Neil Gorsuch, graduated two years later. Kavanaugh and his wife Ashley married in 2004 and have two daughters.\nBreitbart News Senior Legal Editor Ken Klukowski contributed to this report.","url":"https://www.breitbart.com/politics/2018/07/09/trump-brett-kavanaugh-supreme-court-nominee/"}
