{"authors":["Associated Press"],"date_download":"2018-10-22 21:28:01","date_modify":"2018-10-22 21:28:01","date_publish":"2017-03-16 01:14:16","description":"KUALA LUMPUR, Malaysia (AP) - Tin, her husband and five children have cleared years of refugee hurdles to come to the U.S.: blood tests, interviews, DNA and...","filename":"data/vaneerConsumption/TrumpsplannedreductioninrefugeesmayhitMyanmarworst.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/11/wire-227885-1489662264-593_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318546_Myanmar-refugees-hurt-Trump-resettlement-cuts_1540243681.html","title":"Trump's planned reduction in refugees may hit Myanmar worst","title_page":"Trump's planned reduction in refugees may hit Myanmar worst | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"KUALA LUMPUR, Malaysia (AP) - Tin, her husband and five children have cleared years of refugee hurdles to come to the U.S.: blood tests, interviews, DNA and fingerprints, background checks. She has her one must-bring possession within reach, a well-worn Bible, and keeps their phone charged for the U.S. Embassy to call.\nBut the odds of that happening dropped precipitously.\nPresident Donald Trump's 16-page redone travel ban \"to keep the bad dudes out\" aims to stop people from six Muslim countries from entering the U.S. this year and suspends refugees from arriving for 120 days. But the order also includes a sweeping 55 percent reduction in refugee visas overall, from a planned 110,000 to 50,000 this year. Trump's executive order had been set to take effect Thursday, but a federal judge put it on hold hours before it was to take effect.\nIn this March 11, 2017 photo, Tin, a Christian Burmese refugee, leaves a school after dropping off her children in Kuala Lumpur, Malaysia. Tin is a Christian Burmese who fled Myanmar and is hoping to resettle in the United States. An Associated Press analysis suggests that the people hurt most by President Donald Trump's planned deep cuts in refugee visas are from not any of the six Muslim countries listed in his travel ban, but Myanmar. (AP Photo/Joshua Paul)\nWho are the 60,000 people who may have lost their chance to resettle in the U.S. by September? An Associated Press analysis of 10 years of refugee data suggests that their most common country of origin is not any of the six nations in the travel ban, but Myanmar, also known as Burma. Thousands, like Tin and her family, are Christians who were persecuted in their native country.\nThese are people who can't imagine living anywhere but the U.S.\n\"America is really our fatherland in terms of religion,\" said Tin. \"They sent their missionaries to our country and taught us to be Christians. And now we had to escape. All we want is to be safe.\"\nChristians face religious and political discrimination in predominantly Buddhist Myanmar. Its nascent democracy is heavily influenced by a military that ruled for half a century and remains at war with several ethnic groups, some of which are majority Christian.\nTin and her community fled Chin state, where Human Rights Watch says more than 90 percent of the residents were adhering to the tenets the American Baptist Church by 2009, pitting them against a military campaign to elevate Buddhism over all other religions.\nTin and others said that when they gathered for family prayers, people threw rocks at them. Soldiers busted into church services. They hid their precious Bibles for fear of attack.\nTin is one of more than 100,000 Christian Burmese refugees who fled the country of 51 million in recent years because of their beliefs. The family has been living out of suitcases in abject poverty in Malaysia ever since.\nAP is only using single names of some individuals in this story out of concern for their security.\nMore than 160,000 Burmese, mostly Christian, have resettled in the U.S. in the past decade, more than any other nationality. They account for nearly 25 percent of new U.S. refugees since 2007.\nIn addition, hundreds of thousands of Rohingya Muslims await resettlement after being forced to flee Myanmar or be killed. Rights groups say that soldiers have killed Rohingya, raped women and torched homes in waves of violence against them that began in 2012.\nTrump's original order, and now his revamped \"Executive Order Protecting The Nation From Foreign Terrorist Entry Into The United States,\" both say that allowing more than 50,000 refugees into the U.S. this year \"would be detrimental to the interests of the United States.\"\nThere have been isolated incidents of refugees later accused in terror-related plots. An Iraqi refugee who entered the U.S. in 2009, for instance, pleaded guilty in Houston in October to attempting to provide material support to the Islamic State group. Two Iraqi refugees who lived in Kentucky are now in prison after having been convicted in a plot to send sniper rifles, Stinger missiles and money to al-Qaida operatives waging an insurgency back home. And the man accused in the November car-and-knife incident that injured 11 people at Ohio State University was a refugee originally from Somalia who, as an adolescent, moved with his family to the United States in 2014 after living in Pakistan.\nThere have been no terror attacks by Burmese in the U.S.\nThe reduction interrupted work that had been underway by federal law enforcement agencies and nonprofits around the world to issue 110,000 refugee visas to the U.S. in 2017. That would have been the highest number in decades. It was an attempt to put a small dent in the record 65 million refugees, asylum seekers and internally displaced persons worldwide.\nNearly 38,000 have been admitted so far. Another 72,000 were preparing to arrive, hopefully before the fiscal year ends in September. Under the executive order, just 12,000 more would be allowed in, and only after a four-month suspension on all refugee arrivals.\nThe U.S. defines refugees as people of \"special humanitarian concern to the United States\" who have been persecuted because of their race, religion, nationality, political opinion or membership in a particular social group.\nAn AP analysis found that nearly half the refugees who have arrived so far in fiscal year 2017 came from the seven majority Muslim countries named in the original executive order. Refugees from Syria, in particular, have arrived in greater numbers in the past twelve months. As they've taken up a greater number of resettlement visas, Burma's share has dropped from 26 percent of all spots in 2015 to just 8 percent of the refugee caseload so far this fiscal year.\nFor the Burmese to make up the same proportion of refugees as they did last year, they'd have to receive roughly one-third - more than 4,000 - of the remaining refugee visas. In the first five months of fiscal year 2017, 3,000 Burmese resettled in the U.S.\nThe AP also found that Burmese refugees may not be the only ones shut out by the visa change. Data from the State Department show that refugees from Bhutan and Afghanistan have made up a far smaller proportion of people admitted to the U.S. in 2017 than in previous years, and would need to secure thousands of the remaining visas to match last year's numbers.\n\"What we will see is that more and more people will be stuck in situations for even longer and literally be stranded,\" said Julia Mayerhofer, acting secretary general of the Asia Pacific Refugee Rights Network. \"The human suffering of this will be tremendous.\"\nExceptions can be made on a case-by-case basis if the secretaries of State and Homeland Security agree.\n\"The United States is committed to assisting people of all ethnicities, religions and nationalities who are fleeing persecution, violence, and other drivers of displacement,\" said a State Department official in a statement issued on the condition of anonymity because he wasn't authorized to speak publicly.\nThe official said the fact that Trump didn't just set the limit at the number already admitted implies an openness to allow refugees into the U.S.\n\"The safety and security of the American people is our highest priority,\" he said.\nCritics are concerned the policy may backfire.\n\"Barring these or other refugees into the U.S. will not make us safer, but it will make us less credible as a leading democracy and will fuel recruitment by terrorist organizations,\" said political sociologist David Cook-Martín, a Grinnell College professor who studies migration and citizenship policy.\nU.S. policy toward refugees has been historically inconsistent. But Becca Heller, who directs a refugee assistance project at the New York-based Urban Justice Center, says recent acceptances have allowed America to lead by example in matters of global humanitarian concern.\n\"Restricting refugee resettlement sends an alarming message to our nation's international allies,\" she said.\nAbout 210,000 refugees, largely Vietnamese and Cambodians, came to the U.S. in 1980, the most in any year. Refugee arrivals dropped to less than 30,000 for a few years after 9/11 prompted strict new immigration rules. But they have increased fairly steadily since 2004, when President George W. Bush began admitting thousands of Somalis who lost homes to war or tsunami.\nRefugee admissions rose to 85,000 last year; 45 percent were Muslim, 40 percent Christian. Since Trump took office in January, more than 7,700 have been admitted, and the religious breakdown has remained the same.\nMajor Burmese resettlement in the U.S. began in Bush's last year, as they didn't have ties to anti-American terrorism, were easy to vet, and were subject to brutal military rule in their Texas-sized Southeast Asian country wedged between Thailand and Bangladesh.\nThe journeys of these refugees begin in some of the poorest places on earth: remote villages and towns in strife-ridden regions of Myanmar. Some pay human smugglers upwards of $500 each for the two-week harrowing journey out.\nSang, 29, who learned English while studying for a theology degree, was put on a boat on the Myanmar coast with 18 people when he left seven years ago. The engine stopped mid-journey, he said, and they began taking on water in an area where refugee-laden vessels have capsized before.\n\"I thought, if we go down, no one in the world will ever know we existed,\" he said.\nReaching Thailand's shore, they hid in the jungle for days without food. Then, he said, they were squeezed into a car - he and another man shoved into the trunk - and driven for hours, starved for oxygen and terrified, to Malaysia. There, they were unceremoniously told to walk away.\nHis U.N. High Commissioner for Refugees card, he said, is his safety. It's his key to resettling in the United States, and he doesn't let it out of his sight.\nAt a cluttered desk in the cramped room that serves as a classroom by day and his home at night, Sang carefully read a copy of the executive order and then looked up, nodding slowly.\nHe said that while he agreed with the need to keep terrorists out of the U.S., \"We are not terrorists, we are Christians. We will never be a problem in the United States. We will get educations, we will work hard. We only seek safety.\"\nIn Thailand, an estimated 100,000 Burmese live in refugee camps near the border the countries share. The Thai government refused The Associated Press' request to visit what they call \"temporary shelters,\" saying they are a restricted area.\nIn Malaysia there are about 130,000 Burmese refugees awaiting resettlement, about half Christian, half Muslim. They mostly live in the poorest neighborhoods of Kuala Lumpur, where makeshift plywood walls divide an ordinary two-bedroom apartment into a half dozen tiny, stifling family units, a stark contrast to city's glimmering skyscrapers and posh shopping malls. They stay in the city for years, their meager belongings still in their baggage so they can be near U.N. offices and the U.S. Embassy if called in to get stamps on documents or meet with officials.\nThe fear and anxiety are constant, says Lidia, a 30-year-old single mother, holding back tears. She lives in a tiny, third-floor room with her 10-year-old daughter, Sarah, whose own suitcase pops open to reveal four teddy bears and a baby doll. These are Sarah's daily companions, as her mother works 60 hours a week washing dishes in a restaurant.\nThey had hoped to go to the U.S. this year. Relief comes Saturday night at worship services, when they sing and pray with their pastor, also a refugee, in a nearby church that loans out the space.\nMalaysia hasn't signed the U.N. Convention on Refugees, so these people are living in the country illegally. Few are allowed to have jobs, though most work in a sub-official capacity. Their children cannot go to public schools, so volunteers, including refugees also waiting for visas, run their own education centers.\nEarlier this week, Tin - the mother waiting for the embassy to call - dropped off her youngest son for a Saturday tutorial. A teacher wrote several words on the board, and asked students to come up with three descriptive phrases for each one.\nBauri Ram, 11, stared at his word, President.\n\"Donald Trump,\" someone had written. \"Help other people.\"\nHis teacher nodded. A fan blew warm air around the room. Torn curtains fluttered. His classmates, on the floor, watched.\nBauri Ram picked up the blue marker. It squeaked as he formed his careful letters: \"They help refugees.\"\n___\nHoyer reported from Washington. Associated Press journalist Maureen Linke in Washington contributed to this report.\nIn this March 11, 2017, photo, Christian Burmese refugees study during an English lesson in Kuala Lumpur, Malaysia. An Associated Press analysis suggests that the people hurt most by President Donald Trump's planned deep cuts in refugee visas are from not any of the six Muslim countries listed in his travel ban, but Myanmar. (AP Photo/Joshua Paul)\nIn this March 11, 2017, photo, Christian Burmese refugees sit in a classroom in Kuala Lumpur, Malaysia. An Associated Press analysis suggests that the people hurt most by President Donald Trump's planned deep cuts in refugee visas are from not any of the six Muslim countries listed in his travel ban, but Myanmar. (AP Photo/Joshua Paul)\nIn this March 11, 2017, photo, a Christian Burmese refugee walks between two classrooms during lessons in Kuala Lumpur, Malaysia. An Associated Press analysis suggests that the people hurt most by President Donald Trump's planned deep cuts in refugee visas are from not any of the six Muslim countries listed in his travel ban, but Myanmar. (AP Photo/Joshua Paul)\nIn this March 11, 2017, photo, Christian Burmese refugees play music in a classroom in Kuala Lumpur, Malaysia. An Associated Press analysis suggests that the people hurt most by President Donald Trump's planned deep cuts in refugee visas are from not any of the six Muslim countries listed in his travel ban, but Myanmar. (AP Photo/Joshua Paul)\nIn this March 11, 2017, photo, Christian Burmese refugees play before the start of their lessons in Kuala Lumpur, Malaysia. An Associated Press analysis suggests that the people hurt most by President Donald Trump's planned deep cuts in refugee visas are from not any of the six Muslim countries listed in his travel ban, but Myanmar. (AP Photo/Joshua Paul)\nIn this March 11, 2017, photo, Christian Burmese refugees play before the start of their lessons in Kuala Lumpur, Malaysia. An Associated Press analysis suggests that the people hurt most by President Donald Trump's planned deep cuts in refugee visas are from not any of the six Muslim countries listed in his travel ban, but Myanmar. (AP Photo/Joshua Paul)\nIn this March 11, 2017, photo, Christian Burmese refugees play before the start of their lessons in Kuala Lumpur, Malaysia. An Associated Press analysis suggests that the people hurt most by President Donald Trump's planned deep cuts in refugee visas are from not any of the six Muslim countries listed in his travel ban, but Myanmar. (AP Photo/Joshua Paul)\nIn this March 11, 2017, photo, Christian Burmese refugees fix the linoleum floor of their classroom in Kuala Lumpur, Malaysia. An Associated Press analysis suggests that the people hurt most by President Donald Trump's planned deep cuts in refugee visas are from not any of the six Muslim countries listed in his travel ban, but Myanmar. (AP Photo/Joshua Paul)\nIn this March 11, 2017, photo, Christian Burmese refugee students listen to a volunteer teacher during an English lesson in Kuala Lumpur, Malaysia. An Associated Press analysis suggests that the people hurt most by President Donald Trump's planned deep cuts in refugee visas are from not any of the six Muslim countries listed in his travel ban, but Myanmar. (AP Photo/Joshua Paul)\nIn this March 11, 2017, photo, a Christian Burmese refugee writes during an English lesson in Kuala Lumpur, Malaysia. An Associated Press analysis suggests that the people hurt most by President Donald Trump's planned deep cuts in refugee visas are from not any of the six Muslim countries listed in his travel ban, but Myanmar. (AP Photo/Joshua Paul)","url":"https://www.dailymail.co.uk/wires/ap/article-4318546/Myanmar-refugees-hurt-Trump-resettlement-cuts.html"}
