{"authors":["Pedro Nicolaci Da Costa"],"date_download":"2018-10-30 23:05:22","date_modify":"2018-10-30 23:05:22","date_publish":"2018-07-23 00:00:00","description":"ANALYSIS: President Donald Trump's unusual public criticism of the Federal Reserve could have unintended consequences.","filename":"data/vaneerConsumption/TrumpsattacksontheFedcouldbackfirewithhigherrates.json","image_url":"https://amp.businessinsider.com/images/5b55cea5a4852b20008b4598-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trumps-attacks-on-the-fed-could-backfire-with-higher-rates-2018-7_1540940722.html","title":"Trump's attacks on the Fed could backfire with higher rates","title_page":"    Trump's attacks on the Fed could backfire with higher rates - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"President Donald Trump stands behind President Donald Trump Carlos Barria/Reuters\nPresident Donald Trump has found another institution to go after.\nBut his critique of the Federal Reserve, a dangerous break with historical precedent that could shake investor confidence in the Fed's valued political independence, could actually have the opposite effect that Trump intends.\nTrump complained last week that he's \"not thrilled\" about the Fed's effort to raise interest rates gradually. \"We go up and every time you go up they want to raise rates again. I don't really — I am not happy about it.\"\nThe problem for Trump, beyond the alarming break with precedent, is two-fold. On the one hand, his intrusive comments, alongside those of economic adviser Larry Kudlow, could actually force the Fed to tighten monetary policy more quickly in order to prove to financial markets and the public that it is, in fact, independent.\n\"If anything, the incentive will be to tighten more, not less, because of this political pressure,\" wrote Roberto Perli, partner at Cornerstone Macro and a former Fed economist, in a research note. \"In a situation where the Fed would be indifferent between raising rates or staying on hold, it would probably err on the side of raising rates in order not to appear to cave under pressure. In practical terms, the odds of four rate hikes this year, at the margin, have just gone up a bit.\"\nPresident Trump named Jerome Powell to replace Janet Yellen at the Fed's helm, and has appointed two other Fed board governors during his term. The Fed has raised interest rates gradually starting in December 2015 to the current range of 1.75% to 2%.\nThe Trump administration, which campaigned on promises of economic growth rates as high as 3% to 4%, is clearly counting on continued low interest rates to supercharge growth alongside a massive tax cut package tilted towards corporations and the wealthy.\nThe second possible pitfall of Trump's verbal jabs at the Fed may be a bit further into the future — the next time the US economy hits a recession.\n\"Political independence allowed the Fed to respond aggressively to the deteriorating economic conditions of the last crisis, and act swiftly to alleviate the collapse of financial intermediation,\" said Gregory Dacca, chief economist for Oxford Economics.\nThe Fed reacted to the financial crisis and deep recession of 2007-2009 by not only slashing official borrowing costs to zero but also embarking on several rounds of bond purchases aimed at keeping long-term rates low and stimulating investment.\n\"Without this instrument independence, the Federal Reserve would likely have been too slow and too bureaucratic to implement counter-cyclical policies, and the recession would most likely have been deeper and longer than it was.\"","url":"https://www.businessinsider.com/trumps-attacks-on-the-fed-could-backfire-with-higher-rates-2018-7"}
