{"authors":[],"date_download":"2018-10-30 01:11:22","date_modify":"2018-10-30 01:11:22","date_publish":"2016-08-26 00:25:21","description":null,"filename":"data/vaneerConsumption/TrumpWillLiberateAmericasWorldLeadingEnergyProducers.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/08/Mr_Donald_Trump_New_Hampshire_Town_Hall_on_August_19th_2015_at_Pinkerton_Academy_Derry_NH_by_Michael_Vadon_06.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861882.html","title":"Trump Will Liberate America’s World Leading Energy Producers","title_page":"Trump Will Liberate America’s World Leading Energy ProducersThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Donald Trump can become one of the greatest Presidents in American history, if he can lead adoption of just a few desperately needed changes in federal policies and law. Trump has already pledged to adopt these changes, while Hillary has pledged to oppose them. This is the fourth in a multi-part series on those desperately needed changes, this one focusing on deregulation to liberate America’s energy producers to lead the world in production of oil, natural gas, and coal.\nRecent technological breakthroughs in oil and gas drilling, combined with modernization of the decades old technology of “fracking,” have unlocked vast oil and natural gas deposits previously inaccessible in vast American mountain ranges. Consequently, America now has the proven reserves right here at home to be the world’s number 1 producer of oil, number 1 producer of natural gas, and number 1 producer of coal. Stephen Moore and Kathleen Hartnett White write in their new book, Fueling Freedom: Exposing the Mad War on Energy, “We have more oil and natural gas than Saudi Arabia, Iran, Russia, China, and all other OPEC nations combined.”\nThe authors estimate the value of America’s proven reserves at current prices – beneath federal lands and waters alone – as $50 trillion, which they rightly call, “the greatest storehouse of treasure in history.” That is close to three times what our entire national economy produces in a year! And more than twice our national debt.\nImagine America’s own economy leading the world in production of all three of these crucial energy sources. America would enjoy tidal waves of new, high paying jobs and growth. Plentiful, low cost, reliable energy is the avenue for rebuilding manufacturing, which is inherently energy intensive. Millions high paying, blue collar, American manufacturing would be the prize.\nDemocrats used to be the party of blue collar working people. But no more. Elitist Democrats are increasingly rallying around the left wing slogan “Leave it in the ground.” The Obama administration, from the president on down, including his former Secretary of State, have embraced precisely this extremist policy with religious fervor.\nWhen Obama spoke to environmentalist radicals in 2008 regarding his plans to address “climate change,” he candidly revealed, “Under my plan, electricity costs will necessarily skyrocket.” Obama’s White House Science Advisor John Holdren elaborated, “We need to de-develop the United States to bring our economic system into line with the realities of ecology and the global resource situation.”\nThe so-called “Clean Power Plan” proposed by Obama’s EPA is well-designed to do precisely that. A new study from the National Black Chamber of Commerce estimates that energy regulation will cause job losses reaching 7 million for blacks and 12 million for Hispanics, with the poverty rate increasing by more than 23% for blacks and 26% for Hispanics. Blacks and Hispanics would be threatened with a new energy poverty.\nEPA’s Plan will ultimately more than double the cost of natural gas and electricity, adding over $1 trillion to family and business energy bills, as Obama promised. That will drain funds that end up destroying millions of jobs in companies and businesses that can no longer compete under the higher costs. Such rules will reduce U.S. economic growth every year, causing $2.3 trillion in losses over the next two decades alone.\nDe-develop the United States? Does that sound like it is in the interests of working people, the middle class, or the poor, blacks, and Hispanics? Yet, long-time radical, extremist, Professor John Holdren has been drawing a paycheck from the taxpayers as Obama’s White House Science Advisor for years.\nNo wonder Obama’s economy continues to sputter at subnormal economic growth, only one-third the rate of President Reagan’s record setting economic recovery. Obama’s subpar recovery has already cost the American people $2 to $3 trillion, and American families and working people $17,000 to $25,000 in lost annual income, falling farther and farther behind every year!\nClearly, Obama and Hillary have a very different vision than Trump for the future of America’s working people and families. Trump says, “President Obama’s stated intent is to eliminate oil and natural gas production in America.” Hillary says if she is elected, she will end any oil and gas production on federal lands and waters.\nIn his “America First” Energy Plan speech, Trump framed the issue as: “It’s a choice between sharing in this great energy wealth, or sharing in the poverty promised by Hillary Clinton…. Just listen to Hillary Clinton’s own words. She has declared war on the American worker…. ‘We are going to put a lot of coal miners and coal companies out of work.’ She wants to shut down the coal mines.” And that will all mean lots of other blue collar manufacturing workers out of work as well.\nTrump adds, “President Obama has aggressively blocked the production of oil and natural gas. He has taken a huge percentage of the Alaskan National Petroleum Reserve off the table. Oil and gas production on federal lands is down 10%. 87% of available land on the Outer Continental Shelf has been put off limits…. These actions denied millions of Americans access to the energy wealth sitting under our feet. This is your treasure, and you – the American People – are entitled to share in the riches.”\nDuring Obama’s Presidency, 332 coal mines have been closed in West Virginia alone, eliminating 35% of coal industry employment in a state that now has the highest unemployment rate in the country. According to the Energy Information Administration, over the next 5 to 7 years, a third of America’s coal-fired generation capacity will be eliminated. But China and India are building hundreds of new coal plants, more than replacing what America is tearing down under Obama.\nTrump continued, “As bad as President Obama is, Hillary Clinton will be worse. She will escalate the war against American energy…. She declared that, ‘we’ve got to move away from coal and all other fossil fuels,’ locking away trillions in American wealth. In March, Hillary Clinton said, ‘by the time we get through all of my conditions, I do not think there will be many places in America where fracking will continue to take place.’”\nContrary to that, Trump proclaimed that under his energy plan all regulatory obstacles to any form of energy production, including “renewables,” would be removed. But so would all subsidies. He would ask Trans Canada to renew their application for the Keystone Pipeline, and cancel the Paris Climate Agreement. His environmental priorities would be real environmental problems, like clean and safe drinking water. “Political activists with extremist agendas would no longer write the rules.” Instead, he would work with conservationists whose agenda truly is protecting nature, clean air and clean water, not de-developing America.\nThousands of pages of objective, double peer-reviewed science in the Heartland Institute’s Climate Change Reconsidered II, drawing on the work of the best climate scientists in the world, demonstrate that voters have no reason to impoverish America out of fear of “Climate Change”.\nThat publication documents that the cyclical ups and downs of global temperatures and climate are predominantly due to natural causes, with no realistic risk of man-made catastrophic results. This is the comprehensive, first rate science to counter the scare tactics of the “progressives” on this issue.\nCarbon Dioxide (CO2), emitted by burning fossil fuels, is not pollution, but a natural trace gas (0.04 percent of the atmosphere) essential to the survival of all life on the planet. Without sufficient CO2, plants would die as would all animal life, including humans. So CO2 cannot conceivably in any sense be called “pollution.”\nIncreased atmospheric concentrations of CO2 intensifies photosynthesis, which makes plants grow faster. That is why the only documented effect of increased CO2 since the industrial revolution, which has made mankind so much richer, is increased agricultural output, a veritable greening of the planet.\nGlobal temperatures do not follow the pattern of increased atmospheric concentrations of CO2, but, rather, the cyclical ups and downs of natural causes, as they have for millions of years. U.S. satellites measuring global temperatures 24/7 show no increase in global temperatures for nearly 20 years. During that time, mankind produced one-third of all CO2 emissions since the start of the industrial revolution in 1750.\nSoon that period of no global warming will be longer than the period of actual global warming, which lasted only 20 years, from the late 1970s to the late 1990s. Preceding that was 30 years of global cooling, which the current cycle now seems to be repeating.\nEPA’s own analysis concludes that its fully implemented Clean Power Plan would reduce average global temperatures by only 0.05 degrees F by the year 2100. That cannot possibly pass any reasonable cost-benefit analysis.\nReal world leading scientists at the forefront of catastrophic global climate change skepticism include Richard Lindzen, atmospheric physicist, formerly Alfred P. Sloan Professor of Meteorology at the Massachusetts Institute of Technology, former IPCC author and contributor, with over 220 scientific, peer reviewed, published papers and books; William Happer, Cyrus Fogg Brackett Professor of Physics at Princeton; Roy Spencer, Principal Research Scientist at the University of Alabama in Huntsville, U.S. Science Team leader for NASA’s Aqua satellite measuring global temperatures 24/7, former Senior Scientist for Climate Studies at NASA’s Marshall Space Flight Center; Fred Singer, emeritus Professor of Environmental Science at the University of Virginia, founder and first director of the U.S. National Weather Satellite Service; Patrick Michaels, formerly Research Professor of Environmental Sciences at the University of Virginia, past President of the American Association of State Climatologists; Willie Soon, Solar Physicist, Harvard-Smithsonian Center for Astrophysics; and Judith Curry, Professor and former Chair of the School of Earth and Atmospheric Sciences at the Georgia Institute of Technology, among many others.\nWe must put behind us bogus “climate change” claims that would mislead us to strangle development of our energy resources. Rather, we must unleash our energy industries to produce massive job creation and rapid national economic growth, returning America to the road of National Independence and World Leadership.\nPart V of this series will discuss how Trump’s reforms together will provide the foundation for restoring booming economic recovery and prosperity.","url":"https://spectator.org/trump-will-liberate-americas-world-leading-energy-producers/"}
