{"authors":["John Hayward"],"date_download":"2018-10-30 21:45:32","date_modify":"2018-10-30 21:45:32","date_publish":"2016-10-07 11:27:46","description":"\"The more that comes out, the clearer it is that the Clinton State Department was for all intents and purposes an arm of the Clinton Foundation,\" declared Donald Trump's senior communications adviser, Jason Miller, in a statement on Thursday. | Politics","filename":"data/vaneerConsumption/TrumpCampaignClintonStateDeptWasAnArmoftheClintonFoundation.json","image_url":"https://media.breitbart.com/media/2016/09/clinton-foundation-John-Moore-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_07__1540935932.html","title":"Trump Campaign: ‘Clinton State Dept. Was … An Arm of the Clinton Foundation’","title_page":"Trump Campaign: 'Clinton State Dept. Was ... An Arm of the Clinton Foundation' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"“The more that comes out, the clearer it is that the Clinton State Department was for all intents and purposes an arm of the Clinton Foundation,” declares Donald Trump’s senior communications adviser, Jason Miller.\n“The fact that Hillary Clinton was handing out government contracts to family friends, siding with Clinton Foundation donors over human rights activists in Burma and having her aides coordinate activity between the State Department and her foundation is deeply troubling,” Miller continued.\n“A Clinton White House would be more of the same but worse: the highest office in the land would be brimming with corruption and compromised by undue foreign influence.”\nMiller was responding to an article by Betsy Woodruff published at the Daily Beast on Thursday afternoon, in which it was revealed that Clinton Foundation donors wanted Hillary Clinton’s State Department to open Burma to U.S. business interests, and “they got what they wanted.”\nThe opening to Burma was a matter of public record, announced by Secretary of State Clinton in May 2012. It was ostensibly justified by the once-isolated state’s movement toward democracy, particularly the election of formerly persecuted dissident and Nobel Peace Prize winner Aung San Suu Kyi to the presidency.\nHowever, human-rights activists worried that opening Burma up to U.S. investment would set back their cause by empowering the military faction, known as the Tatmadaw, and making the wealth gap between average Burmese and their corrupt oligarchs even worse. Also, activists did not want to relieve the economic pressure on the Burmese government until vital reforms were made.\nSuu Kyi herself “supported a partial easing of the U.S. investment ban, but didn’t want American companies to be able to invest in the country’s energy sector.”\nBut U.S. investment in the energy sector was authorized by Clinton – just like “energy conglomerate Chevron and other generous donors to the Clinton Foundation wanted.” Burma was one of Chevron’s top lobbyist concerns at the time.\nThose other generous Clinton Foundation donors, according to the Daily Beast’s research, included “Calvin Klein, General Motors, Boeing, ConocoPhillips, PriceWaterhouseCoopers, Gap, General Electric, Microsoft, PepsiCo, Coca-Cola and Procter & Gamble.”\nMany of those entities are also members of the National Foreign Trade Council and US-ASEAN Business Council, two groups very eager for sanctions on Burma to be rolled back.\nAs an extra little bonus, Clinton singled out three Clinton Foundation donors – Boeing, Chevron, and General Motors – for praise during a November 2012 trade mission to Burma.\nAccording to human rights activists quoted by the Daily Beast, the fears of those opposed to lifting Burma sanctions have come to pass, as the Clinton Foundation donors made a bundle, the Burmese people got very little, and the persecuted Rohingya, a Muslim minority group, have it worse than ever.\nThe Tatmadaw is still using rape and ethnic cleansing as weapons, and its critics worry that the deals facilitated by Clinton will continue providing it with much-desired hard currency.\nThe Daily Beast cites an October 2015 paper by the International Trade Union Confederation that noted “underage labor is still common in the country, including in the oil and mining industries——industries which have attracted Western investment.” Foreign investment is also said to be making land confiscation and violence against minority groups worse.\nMiller’s charge that SecState Clinton was “handing out government contracts to family friends” refers to the Washington Free Beacon’s Thursday expose on Jacqueline Newmyer Deal, who has a defense consulting firm called the Long Term Strategy Group, and just happens to be a close friend of Chelsea Clinton.\nAmong the vast trove of emails Hillary Clinton hid from the American people were conversations that showed Clinton arranging meetings between Deal’s consulting firm and Pentagon officials involved in handing out contracts. Clinton specifically tried to help Deal “win a contract for consulting work with the State Department’s director of policy planning,” in Free Beacon writer Bill Gertz’s reading of the newly uncovered emails.\n“Government cronyism, or the use of senior positions to help family friends, is not illegal. However, the practice appears to violate federal ethics rules that prohibit partiality, or creating the appearance of conflicts of interest,” Gertz pointed out.\n“By now there is a strong pattern of Hillary Clinton showing bias in the dispensing of government funds and favors to a long list of friends, political supporters, and Clinton Foundation donors,” Ken Boehm of the National Legal and Policy Center told the Free Beacon. “It looks like she was single-handedly trying to revive the corrupt spoils system. As the old saying goes, sometimes things are what they look like.”\nThe Trump campaign also spotlighted a Washington Examiner article on the “intersection” of the Clinton Foundation, the State Department, and those unbelievably expensive speeches Bill Clinton was fond of giving.\nThe thrust of this article is that Hillary Clinton’s State Department staff spent a great deal of their time working with the Clinton Foundation to “perform donor maintenance, craft messaging on key policies and put together guest lists for both diplomatic and philanthropic events,” as well as helping Mr. Clinton with advice on “how to handle politically-fraught speaking engagements or foundation events.”\nOne such event involved bringing the new president of Libya to a Clinton Global Initiative meeting less than two weeks after the Benghazi atrocity. Things don’t get much more “fraught” than that.\nThe Examiner notes that Clinton’s ability to hide her emails, and turn them over to courts, Congress, and watchdog groups very slowly, have unquestionably helped her minimize the political damage from these revelations.\nFor example, we’re only just seeing information highly relevant to the outrageous abuse of power that allowed Clinton aide Huma Abedin to work lucrative side jobs for Clinton cronies at the same time she was drawing a paycheck from the U.S. taxpayer as a State Department employee, even though her work arrangement has been a topic of controversy, and congressional interest, for years.\nSome of Hillary Clinton’s secrets will be kept until after Election Day, as the Examiner notes “at least a half-dozen Freedom of Information Act lawsuits for documents ranging from Bill Clinton’s speech schedules to internal discussions of the Keystone Pipeline” have been delayed until after November.","url":"https://www.breitbart.com/politics/2016/10/07/clinton-foundation-arm-state-department-trump/"}
