{"authors":["Peter Over"],"date_download":"2018-10-22 21:38:13","date_modify":"2018-10-22 21:38:13","date_publish":"2016-07-16 00:00:00","description":"It's a big increase in Trump's fundraising but because of how the fundraising committees were set up, Trump's campaign only gets to keep a fraction of the money.","filename":"data/vaneerConsumption/TrumpAndRNCRaise32MillionWhileClintonAndDNCBringIn81Million.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_07_16_486307390_trump-and-rnc-raise-32-million-while-clinton-and-dnc-bring-in-81-million_1540244293.html","title":"Trump And RNC Raise $32 Million While Clinton And DNC Bring In $81 Million","title_page":"Trump Raises $32 Million With RNC But Only Gets To Keep $2.2 Million : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Trump And RNC Raise $32 Million While Clinton And DNC Bring In $81 Million\nDonald Trump predicted his June fundraising would look good – especially compared to an anemic May, which he finished with just $1.3 million on hand. And June is looking better, bolstered by the first disclosure filings Friday night from two new joint fundraising committees.\nTrump Victory reported raising $25.7 million between late May and June 30, but it transferred just $2.2 million to Trump's campaign committee and about $10 million to the RNC.\nWhile the report from Trump Victory shows a fundraising operation that is beginning to step up, it continues to be vastly outpaced by his Democratic rivals. The Hillary Victory Fund, a joint fundraising committee with the Democratic National Committee, raised $81.6 million and transferred $20.7 million to Clinton's campaign account.\nMore than 62 percent of Trump Victory funds came from a group of 64 individuals and organizations that gave at least $100,000 each. High-end donors included investor and early Trump endorser Carl Icahn and his wife, venture capitalist Stephen Feinberg and Texas investor Darwin Deason, who earlier had been a big contributor to a superPAC backing Ted Cruz.\nThe second JFC, Trump Make America Great Again, brought in $6.7 million. The committee didn't take advantage of what a joint fundraising committee is designed to do: collect contributions far beyond the legal limit for the candidate's own campaign committee. Four donors to TMAGA gave $5,400 each, the maximum that anyone could give directly to the Trump campaign. The other 5,849 contributions were all for smaller amounts.\nTMAGA made no transfers to the Trump campaign or the RNC.\nThe Trump campaign committee, like Clinton's campaign committee, files its June monthly report next Wednesday – in the middle of the Republican convention in Cleveland.","url":"https://www.npr.org/2016/07/16/486307390/trump-and-rnc-raise-32-million-while-clinton-and-dnc-bring-in-81-million"}
