{"authors":["John Binder"],"date_download":"2018-10-30 19:10:48","date_modify":"2018-10-30 19:10:48","date_publish":"2018-07-18 01:20:17","description":"Older Americans retired from the U.S. workforce are now getting a chance to work again in Trump's tightened labor market and economy.","filename":"data/vaneerConsumption/TrumpsTightenedLaborMarketSecuresHighPayingJobsforAmericanRetirees.json","image_url":"https://media.breitbart.com/media/2018/07/senior_man_business_desk.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_17__1540926648.html","title":"Trump's Tightened Labor Market Secures High-Paying Jobs for American Retirees","title_page":"Trump's Tightened Labor Market Secures High-Paying Jobs for American Retirees","title_rss":"NULL","source_domain":"breitbart.com","text":"Older Americans who had retired from the U.S. workforce are now getting a chance to work again in President Trump’s “Buy American, Hire American” tightened labor market and economy.\nThe latest report by the New York Times revealed how retirees are securing high-paying jobs, chronicling the story of 62-year-old retiree Ilana Benet who had left her job as a nurse at Montefiore Health System in the Bronx, New York City.\nBenet, who has ten grandchildren, has gone back to her job at the hospital since retiring, earning $60 an hour. That’s money that is added on top of her pension. Benet works two 12-hour days a week, a role that she says is enough for her because she wants to spend time with her grandchildren as well.\nThe New York Times Claudia Dreifus notes:\n“In a tight labor market, firms find recent retirees increasingly attractive,” said Kathleen Christensen, who funds research on aging and the American labor market at the Alfred P. Sloan Foundation. “Their skills are up-to-date, they possess critical institutional knowledge, and they can mentor younger workers. “Hiring back recent retirees appears more common than at any other time since the Great Recession,” she added.\n… “There’s a labor shortage in many sectors, like construction and transportation,” [chief economist for North America at the Conference Board Gad Levanon] said. “The attitude toward employing older workers is changing because of shortages.”\nBig businesses, unable to rely on massive inflows of foreign workers in Trump’s “America First” economy, have had to turn to reintegrating disenfranchised Americans back into the workforce.\nIn Trump’s tightened labor market, there has been history-making wage growth for American workers in the construction industry, the garment industry, for workers employed at small businesses, black Americans, and restaurant workers.\nThe tight labor market has also secured higher wages for overtime workers and high-paying, coveted white-collar jobs for American teenagers. Most recently, Breitbart News reported that the construction industry has had to recruit women to take jobs at higher wages rather than hiring illegal aliens. A Chick-Fil-A in California has even raised wages to $18 an hour to retain workers.\nJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.","url":"https://www.breitbart.com/politics/2018/07/17/trumps-tightened-labor-market-secures-high-paying-jobs-for-american-retirees/"}
