{"authors":["Will Martin"],"date_download":"2018-10-30 22:52:59","date_modify":"2018-10-30 22:52:59","date_publish":"2018-07-26 00:00:00","description":"BI Prime: \"With the market broadly between these two extremes and the uncertainty over trade likely to linger for now, how can investors make money in this environment without taking an explicitly positive or negative view on trade?\"","filename":"data/vaneerConsumption/TrumpstradewarUBSonhowtoprofitinitsphoneywarphase.json","image_url":"https://amp.businessinsider.com/images/5b59de475c5e5224008b4678-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trumps-trade-war-ubs-on-how-to-profit-in-its-phoney-war-phase-2018-7_1540939979.html","title":"Trump's trade war: UBS on how to profit in its 'phoney war phase'","title_page":"    Trump's trade war: UBS on how to profit in its 'phoney war phase' - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters\nWednesday's summit between President Donald Trump and European Commission head Jean-Claude Juncker gave investors, analysts, and politicians hope that the trade war may not escalate further, and could even start to moderate going forward.\nThat, however, is by no means a certainty, and things could well escalate once again given the noted volatility of Trump's personality.\nUncertainty may remain, but according to a group of strategists at UBS, there's money to be made until everything gets figured out. The team — comprising of Niall MacLeod, Matthew Gilman, and Jiamin Shen — argues that we're in what can be called a \"phoney war phase\" — where everyone is sizing each other up, but no real action has been taken yet.\n\"In real economic terms, it seems that we are still in the 'phoney war' stage,\" the UBS team wrote in a note to clients on Wednesday.\n\"Global activity is holding up, exports are slowing for base effect reasons, new export orders are softening, but not at recessionary levels. Earnings are beginning to weaken.\"\nInvestments in Asia during this period could be hugely lucrative, the team said, adding that the market is stuck between \"two extremes.\"\nFirst up, there's the possibility that tensions over trade ease. In that scenario, MacLeod and his team say, there is \"a lot of upside for Asian equities (we see 18% upside in this scenario).\" If tensions re-escalate, however, there's a big downside possible. In the event that a full-scale trade war develops, the downside could be as much as 23% for Asian equities, UBS said.\n\"With the market broadly between these two extremes and the uncertainty over trade likely to linger for now, how can investors make money in this environment without taking an explicitly positive or negative view on trade?\"\nThe answer: \"Hedge by identifying stocks/sectors that are already pricing in either an extreme slowdown in growth or a much tighter liquidity environment.\"\nExamples cited by the UBS team in Asia include the Indonesian banking sector, and the Korean petrochemical sector.\nIndonesian banks, they said, are \"already pricing in much tighter liquidity if growth globally accelerates.\" They are also pricing policy tightening, UBS said, making them \"likely beneficiaries of easier liquidity in a trade war.\" In a separate note, released earlier in July, UBS put a \"buy\" rating on Bank Rakyat Indonesia\nIn South Korea, petrochemical company valuations \"suggest a greater degree of fears around a trade war and could therefore underperform less in such an outcome, but offer considerable upside if growth is okay.\" LG Chemicals is among the companies UBS recommends looking at.\nAnother area to explore, MacLeod and team said, are renminbi denominated Chinese stocks. Here's the key extract from the note:\n\"We also think China A shares look interesting. Here, the underperformance both against the region and H shares has been stark this year, as domestic liquidity tightens alongside rising trade fears. As Tao Wang has pointed out, it is highly likely that liquidity will in some sense ease if trade worries increase. This now appears to be happening.\"","url":"https://www.businessinsider.com/trumps-trade-war-ubs-on-how-to-profit-in-its-phoney-war-phase-2018-7"}
