{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:49:15","date_modify":"2018-10-30 21:49:15","date_publish":"2015-11-25 17:59:08","description":"Rosie O'Donnell took a shot at Donald Trump's campaign on Monday, in continuation of the nearly decade-long public feud between the two.","filename":"data/vaneerConsumption/TrumpsCampaignANightmare.json","image_url":"https://media.breitbart.com/media/2015/11/Rosie-Trump-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_11_25__1540936155.html","title":"Trump's Campaign 'A Nightmare'","title_page":"Rosie O'Donnell: Trump's Campaign 'A Nightmare'","title_rss":"NULL","source_domain":"breitbart.com","text":"Rosie O’Donnell took a quick shot at Republican presidential frontrunner Donald Trump’s campaign on Monday, in a continuation of the public feud between the pair that has lasted nearly a decade.\n“It’s a nightmare,” the actress-comedian told the Associated Press of Trump’s campaign. “That’s my quote.”\nO’Donnell made the comments while discussing her guest spot on Wednesday’s episode of the hit Fox television drama Empire.\nThe Trump-O’Donnell spat dates back to at least 2006, when Trump declined to fire Miss USA Tara Conner after it was revealed that she allegedly used drugs and engaged in underage drinking.\nThe following day, O’Donnell, then a co-host of The View, lit into Trump, sarcastically questioning how the businessman could be the “moral compass for 20-year-olds in America” and calling him a “snake-oil salesman on Little House on the Prairie.”\nTrump fired back in an interview with People magazine, calling O’Donnell “a woman out of control” and a “real loser.”\nThe back-and-forth continued for years before culminating in a memorable exchange at the first Republican presidential debate earlier this year. Fox News host and debate moderator Megyn Kelly asked Trump to clarify seemingly derogatory comments he has made in the past about women, including calling them “fat pigs” and “slobs.” To which Trump replied: “Only Rosie O’Donnell.”\nWatch the debate exchange below:","url":"https://www.breitbart.com/entertainment/2015/11/25/rosie-odonnell-trumps-campaign-nightmare/"}
