{"authors":["Penny Starr"],"date_download":"2018-10-30 19:30:23","date_modify":"2018-10-30 19:30:23","date_publish":"2017-03-15 21:11:15","description":"Farmers in Michigan are expressing relief that President Donald J. Trump has, through an executive order, started the process of reviewing, revising, or rescinding the Waters of the U.S. portion of the Clean Water Act that threatened to put huge swaths of land under federal control. | Politics","filename":"data/vaneerConsumption/TrumpRelaxingEPAWaterRegulationHeartlandFarmersApplaud.json","image_url":"https://media.breitbart.com/media/2017/03/Heartland-Farmer-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_03_15__1540927823.html","title":"Trump Relaxing EPA Water Regulation; Heartland Farmers Applaud","title_page":"Trump Relaxing EPA Water Regulation; Heartland Farmers Applaud | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Farmers in Michigan are expressing relief that President Donald J. Trump has, through an executive order, started the process of reviewing, revising, or rescinding the Waters of the U.S. portion of the Clean Water Act that threatened to put huge swaths of land under federal control.\nOn Feb. 28 the president issued the executive order on the rule — which he called a “power grab” that would regulate “nearly every puddle or every ditch on a farmer’s land” — and farmers are happy, the Lansing State Journal reported on Monday.\n“Basically, wherever it was flooded for the most part, the government would have control,” said farmer Eric Voisinet. “It’s not just a pocket here or there, it’s acres across the entire farm.”\n“Since its introduction in 2015, the rule has been greeted with frustration and litigation from many farming groups, including the Michigan Farm Bureau, which called the rule ‘a regulatory land grab of Biblical proportions,’ the Journal reported.\n“This rule has never been about clean water; it’s always been about control,” said Laura Campbell, manager of the agricultural ecology department at the Michigan Farm Bureau.\nThe farm bureau said the federal rule would put almost any standing water at risk for regulation.\n“Current state law regulates rivers, streams and lakes and wetlands over five acres, as well as water within 500 feet of a regulated lake or stream, according to the farm bureau.\nBut the WOTUS rule would expand those regulated areas to include “tributaries” and any “adjacent waters” within 1,500 feet or, in some cases, up to 4,000 feet from a lake, stream or tributary,” the Journal reported.\nTrump’s order means the Obama era-regulation never will be put into effect because of an injunction to stop the WOTUS rule was granted.\nIn August, a federal district court in North Dakota granted a preliminary injunction blocking implementation of a new Environmental Protection Agency rule defining “waters of the United States” under the Clean Water Act, the Washington Post reported.\nThe lawsuit was filed by 13 states (Alaska, Arizona, Arkansas, Colorado, Idaho, Missouri, Montana, Nebraska, Nevada, New Mexico, North Dakota, South Dakota, and Wyoming).\n“In Michigan, we’ve got so much water, we really had a large number that would be impacted by this,” Campbell said. “The lower peninsula was going to get really hard.”\n“Any time I would have needed to spray a herbicide or pesticide when I was adjacent to a waterway — which is pretty much every field I farm — I would be subject to permitting,” said Caleb Stewart, a farmer who raises swine and farms land near the border of Gratiot and Clinton counties in the state.\n“We’re not talking about big waterways or streams,” Stewart said. “We’re talking about low-lying areas that may be dry 80% of the year.”\nAnd, Stewart added, farmers don’t need federal regulations to make them value clean water.\n“I’m for clean water too,” he said. “I live here. I drink the water here. My kids drink the water here.”\nTrump’s executive order said, in part, “It is in the national interest to ensure that the nation’s navigable waters are kept free from pollution, while at the same time promoting economic growth, minimizing regulatory uncertainty, and showing due regard for the roles of the Congress and the States under the Constitution.”\nTrump’s order also called for notifying Attorney General Jeff Sessions so that he could “take such measures as he deems appropriate concerning any such litigation pending the completion of further administrative proceedings related to the rule.”\nEPA Administrator Scott Pruitt joined the President for the announcement of the executive order and issued this statement, “EPA intends to immediately implement the Executive Order and submit a Notice to the Office of the Federal Register announcing our intent to review the 2015 Rule, and then to propose a new rule that will rescind or revise that rule. The President’s action today preserves a federal role in protecting water, but it also restores the states’ important role in the regulation of water.”","url":"https://www.breitbart.com/politics/2017/03/15/trump-relaxing-epa-water-regulation-heartland-farmers-applaud/"}
