{"authors":[],"date_download":"2018-10-30 20:52:59","date_modify":"2018-10-30 20:52:59","date_publish":"2018-07-18 00:00:00","description":"President Donald Trump gave Secretary of State Brian Kemp his “full and total endorsement&rdqu...","filename":"data/vaneerConsumption/TrumpendorsesBrianKempinGeorgiaGOPgovrace.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/18/Videos/4442196.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_762768f76652646223850433ea8129df__1540932779.html","title":"Trump endorses Brian Kemp in Georgia GOP gov race","title_page":"President Trump endorses Brian Kemp in Ga GOP runoff race","title_rss":"NULL","source_domain":"ajc.com","text":"President Donald Trump gave Secretary of State Brian Kemp his “full and total endorsement” Wednesday in Georgia’s Republican race for governor, dealing Lt. Gov. Casey Cagle a devastating blow in a bitter runoff.\nIn an afternoon tweet, Trump said Kemp was “tough on crime, strong on the border and illegal immigration,” and the president urged his supporters to cast ballots for Kemp in the July 24 race.\n“He loves our Military and our Vets and protects our Second Amendment,” Trump wrote. “I give him my full and total endorsement.”\nIt was a stinging setback for Cagle, who had jockeyed to win over the deeply conservative runoff electorate by saying he was the bigger supporter of Trump. The president won Georgia by 5 percentage points in 2016 and remains wildly popular with the GOP base.\nCagle said in a tweet that he had \"no hard feelings\" about Trump's endorsement and that he looked forward to receiving his endorsement in November \"as I did for you.\" He added that he wished Kemp \"could say he did the same.\"\nKemp, meanwhile, will look to leverage Trump’s support with a bus tour that launches later this week. At stops across the state, his campaign will aim to drive home the message that he’s the White House’s pick for Georgia’s top job.\nRelated: In Georgia GOP governor’s race, a fight over who’s most loyal to Trump\nRelated: Where the candidates for governor stand on the issues\nRelated: Georgia GOP governor’s race: What you need to know\nRelated: Poll of Georgia Republican voters\n“It’s huge for us, to have his endorsement,” Kemp said in an interview. “I appreciate the president standing with me – and I’ll be standing with him in 2020.”\nThe winner of the race faces Democrat Stacey Abrams, a former Georgia House minority leader who is competing to be the nation’s first black female governor.\n‘Gratifying’\nCagle has prepared for this run for governor for more than a decade and entered the race as a front-runner. He built an enormous fundraising advantage, raising more than $10.5 million thanks partly to donations from well-connected Capitol interests who saw him as the heir apparent to Gov. Nathan Deal.\nBut he’s been hobbled by a secretly made recording, taped by former rival Clay Tippins, in which he revealed he supported what he described as “bad public policy” to undercut a rival and talked of the GOP race for governor as a contest over “who could be the craziest.”\nThe revelations were taking a toll on Cagle long before Trump’s endorsement. An Atlanta Journal-Constitution/Channel 2 Action News poll released Friday showed him trailing Kemp by 3 percentage points, and Kemp has invoked the tape at campaign stops, debates and TV ads.\nKemp said he was unclear what role Trump will play in his campaign but did not rule out a rally in the final days of the race to mobilize Republicans, who gave Trump an 80 percent approval rating in an AJC poll released in April. The White House said it has no plans for Trump to travel to Georgia to campaign anytime in the near future.\n“I also think it cuts through the clutter that the other side is pushing. That makes it even more gratifying to have this endorsement,” Kemp said.\nCagle earlier this week tried to counter with signs of momentum of his own, including the endorsement Monday from Deal, who like Trump is one of the most popular Republicans in Georgia. He’s also touted his support from the National Rifle Association, whose president-elect, Oliver North, headlined rallies for Cagle over the weekend.\nAbrams, meanwhile, sent out a fundraising email highlighting that Trump is “fully and totally” in the race now. Her allies predicted the president’s endorsement would help energize Democrats.\n“This is a dream come true for Stacey Abrams,” said U.S. Rep. Hank Johnson, a DeKalb County Democrat.\n‘Game changer’\nNeither Cagle nor Kemp was an early Trump backer, and neither one was particularly aggressive in his support of him during the 2016 nomination battle. Both were framed by rivals in the GOP primary as squishy Trump supporters.\nBut they both inextricably tied their campaigns for governor to Trump. Both have defended his controversial immigration policy, pledged to \"unapologetically\" back him in the Governor's Mansion and vowed to heed his call to send National Guard troops to the Mexican border.\nAnd both praised Trump’s performance at this week’s summit with Vladimir Putin, where he stunned leaders of both parties by refusing to criticize the Russian leader for Moscow’s role in seeking to undermine the 2016 election.\nThe AJC poll released last week showed why both are eager to tout their support of Trump: About one-fifth of likely Republican runoff voters said their main reason for casting a ballot was to support the stronger ally to Trump.\nIt’s unclear how Kemp won over the president, who has prominent backers in both campaigns.\nU.S. Sen. David Perdue and U.S. Agriculture Secretary Sonny Perdue – who tapped Kemp for the secretary of state job in 2010 - are both neutral in the race, and several Perdue allies said they had no part in the endorsement.\nAsked how he landed Trump’s support, Kemp said: “Who knows? We’ve just been down here working hard, trying to keep the momentum going on.”\nSome veteran Republicans predicted Trump could be the difference maker in the race, which has already attracted 103,000 GOP ballots during the early-voting period.\n“That’s huge for Brian. Runoff elections are about getting the vote out, and there’s no one in this country who can stimulate voter turnout like Donald J. Trump,” said U.S. Rep. Barry Loudermilk, R-Cassville, who is neutral in the race.\n“Most have thought that this is going to be a toss-up,” Loudermilk said. “This could be a game changer.”\nThe president has a mixed record with political endorsements in recent races. He supported Roy Moore’s failed bid last year for an open U.S. Senate seat in Alabama, as well as Rick Saccone in his losing contest for a U.S. House seat from Pennsylvania.\nBut Trump’s late endorsement of a first-term state legislator helped her steamroll U.S. Rep. Mark Sanford, who had never lost a South Carolina election. And South Carolina Gov. Henry McMaster won a June runoff with Trump’s full-throated support.\nThe president’s support for Kemp is the toughest test yet of his political clout in Georgia. Although he backed Republican Karen Handel’s campaign last year for Georgia’s 6th Congressional District after she won the Republican nomination, he hasn’t waded into a contested GOP race in Georgia until now.\nSome of his most fervent supporters quickly signaled they would follow his lead. Bruce Levell, a Dunwoody jeweler who was chairman of Trump’s diversity coalition, had a quick answer when asked whom he would vote for next week.\n“I support President Trump’s decision 100 percent unconditionally.”\nStaff writers Tamar Hallerman and Maya Prabhu contributed to this article.","url":"https://www.ajc.com/news/state--regional-govt--politics/trump-endorses-brian-kemp-georgia-gop-gov-race/tetDfwPkq5Re7FDO4WqOwL/"}
