{"authors":[],"date_download":"2018-10-30 01:22:25","date_modify":"2018-10-30 01:22:25","date_publish":"2015-10-20 00:00:00","description":null,"filename":"data/vaneerConsumption/TrumpblowsitblamesBush.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_10_trump_blows_it_blames_bush_comments_1540862545.html","title":"Trump blows it, blames Bush","title_page":"Articles: Trump blows it, blames Bush","title_rss":"NULL","source_domain":"americanthinker.com","text":"So far Donald Trump has used his brash celebrity style to drive out GOP competitors, without spending serious money -- but taking the risk of being perceived as a lightweight. But now he has to deal with charge of being \"Trump the Clown,\" and he's been slowly drifting towards a more serious persona, with decent policy positions, acting more responsible. But last week he blew it but good. In Obama-esque fashion Trump's ugly shadow side popped out, when he blamed George W. Bush for 9/11. Talk about dumb -- factually, morally, and politically. Let's talk about the facts first. George W. Bush was inaugurated January 20, 2001. The Towers exploded nine months later. You don't plan and implement a four-pronged airplane hijack-bombing on New York City and the Pentagon, in only nine months. The planning, recruitment, training, and smuggling of your assault teams into the United States takes time and professional controllers. We know for a fact that... (Read Full Article)","url":"https://www.americanthinker.com/articles/2015/10/trump_blows_it_blames_bush_comments.html"}
ore 9/11/01 -- long before W. was elected. That was a truck bombing at the concrete base of the Twin Towers, for which National Review's Andy McCarthy served as Federal prosecutor. (See McCarthy's extensive coverage of the facts.)\nBill Clinton's CIA identified the jihadist network responsible for the 1994 bombing, and Clinton was offered Bin Laden's head on a platter by the Sudan, among other Arab horror shows.\nBill Clinton refused to take Bin Laden four times because he was risk-averse -- and if you believe Admiral James Lyons, because our intelligence apparatus has been penetrated by Iran and the Muslim Brotherhood.\nMaybe it was those dollar signs in Bill and Hillary's eyes that kept them from nailing Bin Laden?\nWe don't know, not yet.\nMichael Scheuer, the man in charge of the Bin Laden desk at CIA in the Clinton years, was and is an enthusiastic Bin Laden fan -- to the point where he wrote pro-jihad books after 9/11 . Imagine a US official going on national book tours to glorify Emperor Hirohito after People Harbor. It's the same thing.\nAre we dumb or what?\nNaturally the Left loved Michael Scheuer after 9/11. And until today the New York Times has forgotten to tell us that a big Bin Laden sympathizer ran the Al Qaeda desk in the years before 9/11/01.\nAfter all, the Twin Towers were miles away from Times Square. The NYT Editorial Board hardly noticed that big explosion downtown. And they've been working to distract us from it ever since.\nWho in the Clinton years made sure that Michael Scheuer was in charge? We don't know -- yet. But that question should be haunting us.\nIt must be answered.\nAs Vladimir Putin just said, some American politicians have mush for brains. Either that, or they're enemy assets. (If they are, the rest of us have mush for brains.)\nWe know that Hillary has a literal fellow-traveler in Huma Abedin, her \"personal aide,\" who was raised as an MB sympathizer from childhood. Huma is Hillary's Val Jarrett -- except that Jarrett was raised in a Communist-Khomeinist family.\nObama put ValJar in charge of \"negotiating\" with the mullahs at the very start of his regime, ending in abject nuclear surrender.\nIran isn't even bothering to sign it now. They got everything they wanted, and took the opportunity to stick a couple of fingers in the President’s eyes, like Mo and Curly in the Three Stooges.\nSo much for the facts. Bin Laden planned the Manhattan mass murder during the Clinton years, and Bill passed up at least four chances to stop him.\nWhen Donald Trump accused George W. Bush of being president during 9/11 he was technically correct -- but he must have known that he was committing a huge, Obama-esque lie. An evil, slanderous, malignant lie. A dirty lie against a patriotic ex-president, at a time when the Democrats are up to their gills in corruption and worse. Trump’s accusation is equivalent to accusing FDR for being in office during Pearl Harbor.\nOn the facts alone, Donald Trump dove into the gutter. Too bad.\nNow consider the morality of Trump's lie. A lot of politicians and their advisors seem to despise simple decency; it's for suckers. But I will never vote for a malignant sociopath. Sociopaths may win elections, but they lose what this country is about.\nIf our politics go to hell, morally speaking, who will care enough to defend her?\nIn spite of Chicago rules, decency still matters to most of us. The Trump dump puts the Donald in very dubious company.\nSo he blew it on the facts and on the morality of saying what he did.\nWhat about the politics?\nTrump has been a shrewd operator -- until now. This gaffe will come back to hurt him. For one thing, you can be sure that Hillary will pull the \"Bush did it\" lie, come election time. Trump will get the blame, and rightly so.\nThis is a perfect Bill and Hill ploy -- first you fail to protect the United States from a predictable enemy attack, the worst in modern history. Then you blame the good guys for your malfeasance in time of war. The Clintons belong with Bonnie and Clyde in Public Enemy Number One gallery.\nAs far as I can tell, there are no patriots left at the top of the Democratic Party. The Dems will need a long, long time in the wilderness before they can be trusted with national security ever again. If Hillary ever gets in, run for the hills.\nIn the meantime, pencil in the Clintons as hostile assets. The Democrats might start to rebuild their credibility by firing Iranian and Muslim Brotherhood plants. But basically they are repeating the Stalin period. The voters turned against the Democrats when the Soviets exploded their first nuclear weapons. It could happen again.\nBy attacking George W for being in office on 9/11, Trump has abetted the worst political machine since the Democrats supported slavery in the Civil War.\nAnd you know who is going to use that Big Lie against this country -- ISIS, Iran, and the Moobers.\nQuite an achievement.\nTrumps' blooper has brought yet another backlash. It finally brought out the passion in the Jeb campaign.\nIn the Bush world you don't attack the family.\nLet's pretend that Trump or some adviser will read this. I think Trump can recover, but he has to show an ability to fix and learn from his mistakes.\nUnlike a certain Democrat politician.\nHere are some lessons:\n1. Trump has run a brilliant campaign by playing Bombastic Bushkin, at a time when the voters hate Washington.\nIt worked. Now it is time to adjust course.\n2. Trump seems like a decent guy, as long as he can control his over-the-top competitive impulses. If he can’t, he doesn’t deserve to win.\nUltimately every candidate should prove that this is not just an ego game. The United States is in danger. If somebody fails to get that, they should drop out now. There’s a war on. Even the Left has to pretend to care about the country when they run for office.\n3. Trump needs to understand that linking George W. to 9/11 was an epic fail, factually, morally, and politically. Yes, everybody makes mistakes, but you have to fix them and do better. Sane voters don't gamble the country on people who can't control their words.\nTrump could begin by giving a sincere public apology to George W. And setting the record straight, because we know how many lo-fo voters there are in the land.\nAs an entertainer, Trump always manages to mix provocative words with a Dutch Uncle personality. That's the story he keeps acting out on TV. That is also why people like him, in spite of his death-defying verbal gaffes. The fans ignore Trump's words because that's just Uncle Don mouthing off. They've seen him do it every show, and by the end he comes out looking like a good guy anyway. It works on TV.\nBut not when you’re running for president, and especially not in a time of national danger.\nWhen Jeb Bush finally seemed to wake up last week, he found the perfect counter-thrust: Do you really want Trump the wild man in charge of the nuclear trigger?\nA lot of people had to stop and think.\nThis is how elections are supposed to work, to bring out the real people behind the smiling masks.\nIf the Donald is as shrewd and effective in business as he seems to be, he's faced this kind of thing before. He was on a big roll, and then his luck ran out. Time to kick the tires and think.\nFirst thing, Don, go buy a suit that makes you look presidential. And take off that cornpone hat. Get a haircut, or whatever.\nSecond, don't get into ego games with the Bushes. The presidency isn't for kids, as we've seen too often with the Current Occupant.\nIf you really want to win this thing, get ready to face Putin and the Global Jihad.\nFind the very best people in the country to help you, without having to flatter your ego to get your ear. Think Harry Truman, not BHO.\n(And kindly get rid of ENEMYSYMPS.)\nJeb Bush made his first big score by asking about Trump and the nuclear button.\nI wouldn't trust any Democrat with that button today. Not a single one. As for GOP runners, the voters have to take on the job of vetting them since the media will never do it. The New Media are a lot better than the corrupt old establishment. But every single “news” source has to prove itself these days, over and over again.\nThe US political establishment is stuck beyond belief. They have outlived their usefulness.\nBy comparison, Ben Carson and Ted Cruz are serious people, who have made serious decisions in their lives.\nDr. Carson has forty years of making life-or-death medical decisions, always in consultation with other medical people, patients, family members, ethics committees, and medical scientists. Carson has had a lifetime of being vetted on life-or-death questions. He's won and lost patients who placed their hopes in him and his team.\nIt’s not just having skilled hands, but doing first-rate work in saving lives whenever possible, and taking responsibility when you (inevitably) fail sometimes. This is what presidents need to do, too.\nIn that respect Carson has faced similar choices as a military officer in combat. That will knock the overconfidence out of you, if anything does. In surgery, as in combat, you can never lose the trust of your own team. You have to talk to the families afterwards, win or lose. You have administrators and nurses to deal with, all ready to fault you if they see a mistake.\nI think Ted Cruz is morally serious, too, for somewhat similar reasons.\nSeen it, done it, taken the heat.\nHow about The Donald?\nI don’t know. But we will find out.","url":"https://www.americanthinker.com/articles/2015/10/trump_blows_it_blames_bush.html"}
