{"authors":["Associated Press"],"date_download":"2018-10-22 21:25:32","date_modify":"2018-10-22 21:25:32","date_publish":"2016-01-29 06:44:56","description":"DES MOINES, Iowa (AP) — As his rivals made their final case to voters ahead of Iowa's kickoff caucuses, Donald Trump was headlining a show of his own. Just t...","filename":"data/vaneerConsumption/Trumpholdshisowneventasrivalsdebate.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:8ab402cb501241b2abfb301a02e348b0-4PuZeKVXE7cd9005b2c8765e3560-392_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421855_Skipping-GOP-debate-Trump-headlines-event-veterans_1540243532.html","title":"Trump holds his own event as rivals debate","title_page":"Trump holds his own event as rivals debate | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Trump holds his own event as rivals debate\nDES MOINES, Iowa (AP) — As his rivals made their final case to voters ahead of Iowa's kickoff caucuses, Donald Trump was headlining a show of his own.\nJust three miles from the site of the final GOP presidential debate before voting begins, Republican front-runner Donald Trump held what amounted to a cross between his typical rally and a fundraising telethon to benefit veterans.\nBetween his usual talking points about issues like the country's trade imbalance and media camera angles, Trump read out the names of wealthy friends who'd offered major contributions to veterans' cause. Later he announced the event had just cracked raising $6 million. When he announced he'd pledged $1 million himself, the crowd erupted into cheers.\nRepublican presidential candidate Donald Trump speaks at a event at Drake University in Des Moines, Iowa, Thursday, Jan. 28, 2016. (AP Photo/Andrew Harnik)\nThe event — which featured Trump's moneyed friends making $1 million pledges and the online variety act Diamond and Silk on the same stage as wounded veterans and political rivals — was the latest example of how the billionaire businessman and former reality television star, has rewritten the rules of campaigning and turned protocol on its head. Trump decided to boycott the debate due to a feud with debate host Fox News and organized a competing event instead.\nTrump opened by telling the students and veterans packed into a 775-seat auditorium at Drake University that he would have preferred to be at the debate, but felt he had little choice.\n\"You have to stick up for your rights. When you're treated badly, you have to stick up for your rights,\" he said.\nIn an interview with several reporters aboard his plane at the Des Moines airport before the event, Trump said he'd been in touch with Fox throughout the day.\n\"The time to change my mind was two days ago,\" he said. \"It's too late. When you look at the lines, what am I going to do? Tell thousands of people that, by the way folks, I'm going to go do the debate? I think it would look bad.\"\nFox News Channel issued a statement saying Trump had offered to appear at the debate on the condition that Fox contribute $5 million to his charities, which the network said was not possible. Trump's campaign responded with a counter-statement saying that, if \"FOX wanted to join in that effort and make a contribution Mr. Trump would have welcomed that.\"\nTrump's decision posed potential risks with just days to go before Iowa's caucuses. While recent polls show him pulling ahead, he remains locked in a close race with Texas Sen. Ted Cruz in Iowa. And his decision was seen by some voters and local party leaders as a slight to those still making up their minds.\nBut Trump said he wasn't concerned. While some might take issue, he said: \"You're going to have a lot of voters that like that we didn't get pushed around.\"\nAbout halfway through the event, Trump yielded the stage for Staff Sgt. John Wayne Walding, an Afghanistan war veteran who lost his leg to sniper fire, and who spoke powerfully about his experience overseas and about coping with the aftermath of war at home. Trump was later presented with a ring from a veterans group representing the number of veterans who commit suicide after returning home.\nTrump was joined at his event by two of his presidential race rivals — Mike Huckabee and Rick Santorum — who briefly spoke. Huckabee praised Trump for bringing them together, saying the three may be competing against each other, \"but tonight we are colleagues in unison\" for the cause.\nSantorum spoke standing slightly to the side of Trump's podium, joking he didn't want his picture taken with the Trump campaign sign.\nBut in many ways the event was typical Trump. Moments after saying he would skip his usual campaign mainstay of reading off his poll numbers, Trump pivoted to a summary, bragging about his \"amazing polls\" and leading \"by substantial margins in Iowa and every single state.\"\nLater, as he introduced Walding, Trump offered the following: \"He should be much more famous than me, 'cause he's a lot much more courageous than I am.\"\n\"I'm financially courageous,\" Trump added, but not so good at the other stuff.\nTrump's campaign did not disclose Thursday which groups would receive money raised from the event, but representatives had spent the day reaching out to various groups, in some cases inquiring about their programs and finances. Among those contacted were the Green Beret Foundation, which provides care to veterans, and Fisher House, which provides free or low cost housing to veterans and military families receiving treatment at military medical centers.\nTrump launched a website earlier Thursday to collect donations. Contributions collected there were funneled to The Donald J. Trump Foundation, Trump's nonprofit charitable organization. The page says: \"100 percent of your donations will go directly to Veterans needs.\"\nAs for the debate, Trump predicted it would have far fewer viewers without him on the stage.\nAnd his event offered some similar trappings. Reporters covering his event were ushered to a filing room with five long rows of tables, where they watched via closed circuit television.\nWhen it ended, Huckabee sauntered into the filing room to answer reporters' questions, giving it the distinct feel of the post-debate spin room just down the road.\nRepublican presidential candidates Rick Santorum, left, and Donald Trump, center, laugh as they listen to Mike Huckabee during a campaign event on the campus of Drake University Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Jae C. Hong)\nA trailer with a sign supporting Republican presidential candidate Donald Trump, and satellite trucks, are parked on the campus of Drake University in Des Moines, Iowa,Thursday, Jan. 28, 2016, where Trump is scheduled to hold a campaign event. (AP Photo/Jae C. Hong)\nRepublican presidential candidate Donald Trump, center, holds up his photo while greeting supporters after a campaign event on the campus of Drake University Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Jae C. Hong)\nRepublican presidential candidates Rick Santorum, left, and Donald Trump, center, laugh as they listen to Mike Huckabee during a campaign event on the campus of Drake University Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Jae C. Hong)","url":"https://www.dailymail.co.uk/wires/ap/article-3421855/Skipping-GOP-debate-Trump-headlines-event-veterans.html"}
