{"authors":[],"date_download":"2018-10-30 01:20:56","date_modify":"2018-10-30 01:20:56","date_publish":"2018-07-17 00:20:03","description":null,"filename":"data/vaneerConsumption/TrumpBacksDemocratsIntoaFarLeftCorner.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/Trump_accepts_nomination.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862456.html","title":"Trump Backs Democrats Into a Far Left Corner","title_page":"Trump Backs Democrats Into a Far Left CornerThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"President Trump is pushing Democrats further left and greatly enhancing his reelection chances. The Democratic Party’s leftward momentum was already there — Sanders did well in 2016, even before Trump was Republicans’ nominee. However, Trump’s presidency has accelerated the slide and threatens to turn 2020 into a contest of ideology, rather than just on his incumbency.\nTwo years ahead of 2020’s presidential election, the two nominees are already set. For Republicans, it will be President Trump, because incumbents seeking renomination get it — neither party has denied it in the last 100 years. For Democrats, it will be someone outside the establishment and to the left — while not as defined as the Republican prediction, the reasons are almost as definitive.\nHistorically, it is an easy prediction that Democrats will not nominate an establishment candidate, because their establishment candidates have done abysmally in general elections. Hillary’s defeat as the establishment standard-bearer repeated every establishment Democrat nominee’s result since Johnson in 1964.\nRecent history is equally persuasive in predicting this non-establishment Democrat will be from the left. Sanders was only stopped in 2016 by Democratic establishment super delegates — absent them, the nomination is undecided going into the convention. Even with his liabilities — running against the consensus nominee, being from a small state, and 74 years old — Sanders still consistently won 40 percent or more of 2016 primary votes. In November, liberals made up 45 percent of those voting Democrat.\nThe left has only grown stronger. Unquestionably, this cohort is the most exercised over the Trump presidency and generating the most energy among Democrats.\nAt the same time, the Democratic establishment has grown weaker. Discredited by unabashed support for Clinton, and then by her stunning defeat, its members have neither a clear frontrunner around whom to unite, nor a cogent argument why the Party should coalesce behind one. And the super delegate firewall they used — among other things, fair and foul — to thwart their leftist insurgents last time will be diminished in 2020.\nThe establishment’s treatment of Clinton since her defeat has only played into the leftist insurgency’s hands. Its narrative now is that Trump did not so much win the election as Hillary lost it: Her baggage negated his, allowing him to avoid what would have been a fatal comparison with any other nominee.\nHowever, this after-the-fact assessment implicates the establishment all the more. None of Clinton’s problems were unknown going into the race, yet establishment Democrats backed her to the hilt. While their condemnation of Clinton is designed to absolve the Democratic brand from her defeat, it indicts the Democratic establishment who insisted on her nomination. And it further vindicates the left who insisted on content over form two years ago. Little wonder liberals now demand it all the louder.\nThe result of this Democratic split is a 2020 anti-establishment nominee from the left, who will play even more into Trump’s hands than Clinton did in 2016. While Hillary’s personal issues largely insulated Trump from his own, an anti-establishment nominee turns the race from 2016’s one of personalities to 2020’s one of ideologies.\nWaging a campaign of stark ideological contrasts would be Trump’s ideal scenario. In 2016, liberals made up just 26 percent of America’s electorate. That means three-quarters of voters are not liberal, so this automatically tilts the field to Trump’s advantage.\nFurther, being run at from the left will help consolidate Trump’s support on the right. Forgotten in his 2016 win was his failure to win 19 percent of conservatives (35 percent of all voters). Facing the prospect of their ideological opposite winning, Trump can expect greater conservative support.\nFurthermore, such a left versus right contrast will muddy the water for moderates. Much the way 2016’s clash of political baggage implicitly aided Trump, a contest between the ends of America’s political spectrum would benefit him in 2020. Because Trump won just 40 percent of moderates (39 percent of voters) in 2016, even a split helps him enormously in 2020.\nAs President Trump seeks reelection, he will already have great advantages. In 2016, he was a political neophyte; in 2020, he will be a four-year incumbent. Elected incumbents rarely lose reelection — only three in the last 100 years. The economy, America’s most important political variable, is strong — far stronger than during his predecessor’s eight years. And he has put together a conservative record in office that should attract back many conservatives who did not support him in 2016.\nYet none of these advantages may match the one Democrats are likely to give him by nominating an anti-establishment liberal. In 2016, Trump won what was essentially a campaign of personalities with Clinton. In 2020, the race is likely to be one of ideologies. If during the first election Trump backed into his seemingly perfect opponent, this time he is effectively backing Democrats into nominating an even more favorable one for him.","url":"https://spectator.org/trump-backs-democrats-into-a-far-left-corner/"}
