{"authors":["Chriss W. Street"],"date_download":"2018-10-30 22:13:40","date_modify":"2018-10-30 22:13:40","date_publish":"2017-04-06 12:07:28","description":"The Cadiz Water Project will soon produce enough Mojave Desert groundwater to serve the needs of 400,000 people in Southern California.","filename":"data/vaneerConsumption/TrumpAdminOKsCadizProjectforWaterto400000inSoCal.json","image_url":"https://media.breitbart.com/media/2017/04/Mojave-Desert-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_04_06__1540937620.html","title":"Trump Admin OKs Cadiz Project for Water to 400,000 in SoCal","title_page":"Trump Admin OKs Cadiz Project for Water to 400,000 in SoCal | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Cadiz Water Project will soon produce enough Mojave Desert groundwater to serve the needs of 400,000 people in Southern California, thanks to President Donald Trump’s Department of Interior reversing his predecessor’s stall tactics.\nThe move marks the department’s first high-visibility action since former Montana Republican congressman Ryan Zinke’s confirmation.\nTimothy Spisak, Acting Assistant Director for the Bureau of Land Management’s Division of Energy, Minerals, and Realty Management, signed a March 29 memorandum reversing an Obama administration 2015 stall tactic requiring Cadiz Water Project to spend another five to seven years producing a federal Environmental Impact Report, despite the project being exclusively on California land.\nCadiz Inc. (Cadiz) is a private corporation that owns approximately 34,000 acres in the Mojave Desert’s Cadiz and Fenner Valleys. The company, and Orange County’s Santa Margarita Water District (SMWD), entered into an agreement 15 years ago to form the Cadiz Valley Water Conservation, Recovery, and Storage Project to sell SMWD and other Southern California water providers some of the estimated 17 to 34 million acre-feet of groundwater sitting in an aquifer under Cadiz land.\nIn the midst of the state’s horrendous drought, which began in 2011, the project achieved rare bipartisan support and approval of its California Environmental Impact Report. That effort demonstrated Cadiz Water could safely and sustainably supply enough water each year to serve the needs of 400,000 Californians, generate 5,900 new local jobs, and generate $1 billion in economic growth.\nThe City of Mojave, with a population of 4,300 is one of the poorest communities in the state. Mojave’s income per capita is $15,847, its median household income is $34,500, and its unemployment rate is almost twice the state average, at 10.8 percent. The project therefore made economic sense.\nBut it ran into opposition from senior U.S. Senator Dianne Feinstein (D-CA) and her Democrat allies in Congress, who had convinced President Clinton in 1994 to sign a bill expanding the Death Valley National Monument to cover 1,419,800 acres under the California Desert Protection Act.\nAlthough the 43-mile Cadiz Water pipeline was planned to run along a 100-year old railroad right-of-way still used by trains, Feinstein and her allies claimed that removing groundwater under private property would lead deaths of Bighorn Sheep and humans from more dust storms.\nOpponents of the project also claimed that bringing water to the surface would threaten endangered species and result in the sale of overpriced water.\nAn angry Senator Feinstein complained to the Fresno Bee: “The Trump administration has once again put corporate profits ahead of the public’s interest.”","url":"https://www.breitbart.com/local/2017/04/06/trump-interior-dept-oks-cadiz-project-to-supply-water-to-400000-in-socal/"}
