{"authors":["Abc News"],"date_download":"2018-10-30 00:52:42","date_modify":"2018-10-30 00:52:42","date_publish":"2018-10-28 13:16:03","description":"Trump proposed having Medicare base what it pays for some expensive drugs on average prices in other industrialized countries, such as France and Germany.","filename":"data/vaneerConsumption/TrumpwantstolowerprescriptiondrugpricesbybasingsomeonwhatothercountriespayCoulditwork.json","image_url":"https://s.abcnews.com/images/Health/trump-2-gty-er-181028_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Health_trump-lower-prescrip_5636dbf3f72e4788aa2827472f226106_story_id=58808578_1540860762.html","title":"Trump wants to lower prescription drug prices by basing some on what other countries pay: Could it work?","title_page":"Trump wants to lower prescription drug prices by basing some on what other countries pay: Could it work? - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"This is a Kaiser Health News story.\nInterested in Donald Trump? Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News. Add Interest\nPresident Donald Trump’s new pledge to crack down on “the global freeloading” in prescription drugs had a sense of déjà vu.\nFive months ago, Trump unveiled a blueprint to address prohibitive drug prices, and his administration has been feverishly rolling out ideas ranging from posting drug prices on television ads to changing the rebates that flow between drugmakers and industry middlemen.\nThursday, Trump proposed having Medicare base what it pays for some expensive drugs on the average prices in other industrialized countries, such as France and Germany, where prices are much lower. The proposal is in the early stages of rule-making and awaiting public comments.\nThe U.S., Trump said, will “confront one of the most unfair practices, almost unimaginable that it hasn’t been taken care of long before this.”\nThe proposal was met with hope and skepticism, with several experts saying they were happy the administration was taking on Medicare Part B’s rising drug prices but questioning its approach.\nWalid Gellad, director of the Center for Pharmaceutical Policy and Prescribing at the University of Pittsburgh, said in an online post that the administration’s proposed solutions were unclear. And, he said, they would “face insurmountable challenges.”\nWhile some industry watchers pointed to the announcement as a political move, Wells Fargo pharmaceutical analyst David Maris said that this is a broader effort by the president and his administration to attack the root causes of high drug prices.\nNicholas Kamm/AFP/Getty Images\n“The reality is he could very easily not take this on and do what other administrations have done and let the prices keep rising.”\nTrump, too, promised more to come and said he will soon announce “some things that will really be tremendous.” On Friday, Health and Human Services Secretary Alex Azar said that, as promised in the blueprint, there would be more changes to Medicare Part D, which covers most prescriptions. Ian Spatz, a public policy expert and senior adviser at Manatt Health, said the overall blueprint was “unprecedented in terms of how many different ideas and areas of ideas that it contained.”\nNothing would happen overnight. The proposal to require drug prices in TV ads could be delayed by litigation and notably, if implemented, does not include any penalties for companies who fail to post their prices.\nThe proposed rebate rule was delivered to the Office of Management and Budget in July. Matt Brow, president of industry consulting firm Avalere Health, said he expects the administration to publish the rule for comment by year’s end.\nTrump’s international pricing plan is not as far along as the rebate proposal. Rather, it is an “advanced notice of proposed rule-making.” The proposed rule could come in spring 2019, and Azar said the new model could begin in late 2019 or early 2020.\nYet, on Friday, Azar signaled the proposal could change, telling an audience at the Brookings Institution that the administration is “open to any number of alternative ideas.”\nAvalere’s Brow said there is a good chance the proposal will change significantly.\n“The sweeping nature of the proposal makes the stakes higher and makes it harder to implement,” Brow said.\nIf the administration moves forward, it would bypass Congress and implement a pilot under the Center for Medicare & Medicaid Innovation’s purview. The pilot would phase in over five years and apply to 50 percent of the country. Azar said there would be no changes to Medicare benefits and no restrictions on patient access.\nThe proposal focuses on drugs covered under Medicare Part B, which are administered in hospitals, clinics and doctors’ offices. It also would alter the reimbursement formula for doctors and providers and would allow private-sector vendors to purchase drugs and then sell them to doctors and hospitals. Medicare would reimburse those vendors at the international pricing level.\nCurrently, doctors and hospitals administering Part B drugs are reimbursed the average price of a drug plus 6 percent. President Barack Obama’s administration attempted to alter Part B as well but drew intense lobbying opposition and eventually withdrew a proposed pilot project.\nAllan Coukell, senior director for health programs at Pew Charitable Trusts, said removing incentives that reward doctors for purchasing costlier drugs and bringing in a new way to control prices “makes a lot of sense.” Drug spending within Medicare Part B reached $22 billion in 2015, and drug costs have increased by an average of 8.6 percent annually since 2007.\nStephen Ubl, president of the industry trade group Pharmaceutical Research and Manufacturers of America, or PhRMA, said imposing foreign price controls from countries with socialized health care systems would harm patients and hinder drug discovery and development.\nAzar, a former executive at pharmaceutical manufacturer Eli Lilly, told reporters Thursday that “you may hear the tired talking points” that this will affect innovation. He disputed that idea, concluding that “less than 1 percent of pharma [research and development] could potentially be impacted by this change.”\nKHN’s coverage of prescription drug development, costs and pricing is supported in part by the Laura and John Arnold Foundation.\nKaiser Health News (KHN) is a national health policy news service. It is an editorially independent program of the Henry J. Kaiser Family Foundation which is not affiliated with Kaiser Permanente.","url":"https://abcnews.go.com/Health/trump-lower-prescription-drug-prices-basing-countries-pay/story?id=58808578"}
