{"authors":["Joe Ciolli"],"date_download":"2018-10-30 23:11:11","date_modify":"2018-10-30 23:11:11","date_publish":"2018-07-23 00:00:00","description":"BI PRIME: As President Donald Trump's trade war rages on, recent comments from him and his administration have stoked fears of another global conflict that could have a negative impact on markets worldwide.","filename":"data/vaneerConsumption/Trumptradewarovershadowingotherpotentiallyharmfulglobalbattle.json","image_url":"https://amp.businessinsider.com/images/5b55f03888be2329008b45a7-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trump-trade-war-overshadowing-another-global-battle-market-impact-2018-7_1540941071.html","title":"Trump trade war overshadowing other potentially harmful global battle","title_page":"    Trump trade war overshadowing other potentially harmful global battle - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty Images / Thomas Peter-Pool\nAs investors worldwide grapple with the latest twists and turns relating to President Donald Trump's trade war, experts are starting to cry foul on another battle brewing under the surface.\nLabeled a \"currency war,\" the escalating situation has market pundits fearing the worst as global superpowers try to push their currencies lower at the expense of their opponents — or the countries they're supposed to work with to achieve a balanced economy.\nThe rationale is as follows: A weaker currency makes exports more profitable. For countries like the US and China — not-so-coincidentally the two principal combatants here — it's a crucial variable for gaining the upper hand in the broader trade conflict that has raged for months.\nThe problem with such a conflict is that it represents a breakdown in the type of cooperation that keeps global markets operating in harmony. As tension builds and combative measures compound, it can have a broad negative effect on everything from stocks to commodities to currencies.\nSo how did we arrive at this crucial market crossroads in the first place? For one, the recent precipitous decline in the Chinese yuan has drawn scrutiny. The currency, fresh off its biggest monthly decline on record versus the US dollar, last week hit its lowest level relative to the greenback in more than a year.\nAnd, as with many of the ongoing global conflicts, Trump has played a major role. In a pair of tweets last Friday, the president accused China and the European Union of \"manipulating\" their currencies, something he says has eroded America's \"competitive edge.\"\nHis comments were echoed by Treasury Secretary Steve Mnuchin last Friday. In an interview with Reuters, Mnuchin said \"there's no question that the weakening of the currency creates an unfair advantage for them.\" He added that his colleagues would \"carefully review\" the implied manipulation.\nWith the battle lines drawn, a newfound currency war was born.\n\"It has now been virtually defined as a currency war by the US president, given that he explicitly suggested foreign countries are manipulating exchange rates for competitive purposes,\" Shahab Jalinoos, Credit Suisse's global head of foreign-exchange trading strategy, told Bloomberg last week.\nCraig Nicol, a macro strategist at Deutsche Bank, agrees.\n\"What started as a war on trade now appears to have grown a new set of roots with the seeds of a potential currency war now seemingly sown and threatening to break out,\" he said on Monday. \"It may well be that we look back at last week as a bit of a turning point for markets.\"\nThe Chinese yuan has fallen 8.5% versus the US dollar since mid-April. Markets Insider\nPrecedent suggests a rough road may lie ahead\nPerhaps the closest precedent for a yuan decline of the magnitude we've seen recently is China's shock devaluation in 2015. While China doesn't appear to be directly meddling in its currency this time around, that past instance provides a valuable template for the kind of widespread market damage that could be inflicted if the nation does get more pointed in its efforts.\nIn short, it won't be pretty. The surprising devaluation sparked worldwide market contagion, including a correction in the benchmark S&P 500— defined as a decline of 10% or more.\nFortunately for holders of risk assets, experts across Wall Street don't see it getting to that point, at least yet. To Richard Turnill, the global chief investment strategist at BlackRock, China is likely to rely largely on fiscal and monetary tools to spur growth this time around, rather than further debase its currency.\n\"Today, China has stricter capital controls in place — and improved coordination between policymakers,\" he said on Monday.\nPaul Kitney, chief Asia Pacific equity strategist at Daiwa Capital Markets, is similarly skeptical that China will weaponize its currency amid mounting trade-war tensions.\n\"We find no evidence that the Chinese are using the RMB as a policy tool,\" he said in a note to clients.\nIn the end, it's possible that Trump himself is using inflammatory currency rhetoric in an attempt to talk down the dollar — something that would improve the prospects of US exports and aid his efforts in the trade war.\nWhile this interpretation was staunchly denied by Mnuchin in his interview with Reuters on Friday, there's no denying that the currency war, as it stands presently, appears to be one-sided — at least in terms of public commentary.\nBut that doesn't mean it can't be damaging to global markets, which is why investors would be wise to view the situation with caution.","url":"https://www.businessinsider.com/trump-trade-war-overshadowing-another-global-battle-market-impact-2018-7"}
