{"authors":[],"date_download":"2018-10-23 03:29:26","date_modify":"2018-10-23 03:29:26","date_publish":"2017-03-16 14:23:21","description":"A top adviser to US President Donald Trump met Israeli settler leaders Thursday in an unusual move likely to raise fresh concerns over future prospects for a...","filename":"data/vaneerConsumption/TrumpadvisermeetsIsraelisettlerleadersinunusualmove.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/14/wire-228865-1489674203-309_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4320472_Trump-adviser-meets-Israeli-settler-leaders-unusual-move_1540265366.html","title":"Trump adviser meets Israeli settler leaders in unusual move","title_page":"Trump adviser meets Israeli settler leaders in unusual move | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A view of the Israeli settlement of Maaon, on March 4, 2017\nA top adviser to US President Donald Trump met Israeli settler leaders Thursday in an unusual move likely to raise fresh concerns over future prospects for a two-state solution to the Israeli-Palestinian conflict.\nThe US embassy confirmed the talks between Jason Greenblatt and leaders of the Israeli settler movement took place in Jerusalem as part of the White House official's wide-ranging meetings this week.\nThe Yesha Council, the main Israeli settler organisation, said it was believed to be its highest level official meeting ever with a US administration.\nThe meeting was attended by Yesha leaders Oded Revivi and Yossi Dagan, the group said.\n\"Representatives from Yesha have met with John Kerry and others on the sidelines of events, but we have not had official meetings like this,\" a spokesman said.\n\"The previous administration never met like this.\"\nIsraeli settlements in the occupied West Bank are considered illegal under international law and major obstacles to peace as they are built on land the Palestinians see as part of their future state.\nIsraeli settlement expansion has been the subject of harsh international criticism, with many warning that it is gradually eating away at prospects for a two-state solution, the basis of years of negotiations.\nGreenblatt, Trump's special representative for international negotiations, has met a range of people on both the Palestinian and Israeli side during his visit this week, including Israeli Prime Minister Benjamin Netanyahu and Palestinian president Mahmud Abbas.\nHe was due to meet Netanyahu again on Thursday.","url":"https://www.dailymail.co.uk/wires/afp/article-4320472/Trump-adviser-meets-Israeli-settler-leaders-unusual-move.html"}
