{"authors":["Pedro Nicolaci Da Costa"],"date_download":"2018-10-30 22:59:14","date_modify":"2018-10-30 22:59:14","date_publish":"2018-07-25 00:00:00","description":"ANALYSIS: President Donald Trump shows no sign of pulling back from his trade war, and the auto sector appears a dangerous next candidate on the administration's list of goods that should face tariffs.","filename":"data/vaneerConsumption/Trumpsproposedautotariffswillleadtosharprisesincarprices.json","image_url":"https://amp.businessinsider.com/images/5b58a1341dcdd529008b4732-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trumps-proposed-auto-tariffs-will-lead-to-sharp-rises-in-car-prices-2018-7_1540940354.html","title":"Trump’s proposed auto tariffs will lead to sharp rises in car prices","title_page":"    Trump’s proposed auto tariffs will lead to sharp rises in car prices - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A customer shakes hands with a sales representative at a Chevrolet dealership in Dallas December 3, 2008. Reuters/Jessica Rinaldi\nTalk about hitting American consumers where it hurts. President Donald Trump's proposed tariffs on imported cars could sharply raise auto prices for a public-transport deficient, car-dependent nation.\nA new study from the Peterson Institute of International Economics (where I used to work) shows just how much of a sticker shock Americans should be prepared for.\nTrump has proposed charging tariffs of 25% on imported cars, SUVs, vans, trucks and even auto parts. If implemented, the plan would \"raise car prices significantly, suppressing sales and pushing some buyers with modest incomes out of the new car market entirely,\" write Peterson Institute scholars Mary Lovely, Jérémie Cohen-Setton, and Euijin Jung in their policy brief.\nThe authors use industry and consumer data to estimate that:\nThe average price of an entry-level compact car will increase between $1,408 and $2,057.\nThe price of a new compact SUV/crossover, the most popular vehicle in the country, will rise by $2,093 to $3,066.\nMore upscale versions of the compact SUV/crossover will rise by significantly more, $4,708 to $6,972.\nPeterson Institute for International Economics\nThe auto sector has been a key component of the US economic recovery as sales benefited from the Federal Reserve's low interest rate policy and discounts from car dealers. The chart below shows disproportionate job growth in the auto industry and related sectors.\nThe expected price spikes would add to pressures already being felt from a rising interest rate environment as the US central bank looks set to keep tightening monetary policy.","url":"https://www.businessinsider.com/trumps-proposed-auto-tariffs-will-lead-to-sharp-rises-in-car-prices-2018-7"}
