{"authors":["Jim Zarroli"],"date_download":"2018-10-22 21:34:36","date_modify":"2018-10-22 21:34:36","date_publish":"2017-04-11 00:00:00","description":"While Trump Model Management \"enjoyed many years of success,\" the Trump Organization said in a statement that it was choosing to focus on its core businesses of real estate, golf and hospitality.","filename":"data/vaneerConsumption/TrumpOrganizationSaysItIsClosingItsModelingAgency.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2017_04_11_523422686_trump-organization-says-its-closing-its-modeling-agency_1540244076.html","title":"Trump Organization Says It Is Closing Its Modeling Agency","title_page":"Trump Organization Says It Is Closing Its Modeling Agency : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Trump Organization Says It Is Closing Its Modeling Agency\nThe Trump Organization is shutting down its New York-based modeling agency.\nA statement released by the company said it was \"choosing to exit the modeling industry.\"\n\"While we enjoyed many years of success, we are focussed on our core business in the real estate and golf industries and the rapid expansion of our hospitality division,\" the statement said.\nStarted in 1999, Trump Model Management was part of Trump's eclectic array of businesses, though it was never as visible as some of the others and didn't play a major role in the fashion business.\nBut like other Trump businesses, it has found itself under special scrutiny as a result of Trump's decision to run for president.\nDespite Trump's ongoing focus on illegal immigration, several of the foreign-born models hired by the agency told reporters they had been hired despite having no work visas.\n\"There was about six, seven or eight of us, at least in this models' apartment. There might have been about three Americans, but the rest of us had no visa,\"\nCanadian-born Rachel Blais told PRI's The World.\nAn article in Mother Jones quoted two other former models as saying the Trump agency \"never obtained work visas on their behalf, even as they performed modeling assignments in the United States.\"\nTrump Model Management denied using illegal labor practices.\nThe agency also became the target of a boycott by some fashion-industry directors, makeup artists and stylists, the website Refinery29 reported in February.\nOne of the agency's models, Maggie Rizer, said in an Instagram post the day after the election that she could no longer be associated with the Trump brand.\n\"I owe it to myself and to my children to proudly stand up for what I believe in and that is a world where Donald Trump has no voice for the future of our country,\" she said.\nLast week, The Washington Post reported that one of the agency's managers, Gabriel Ruas Santos-Rocha, had left to start his own firm called Anti Management, taking some of the models with him.\nHe said the new agency's title was not an allusion to Trump, telling the Post, \"I did not start an agency with the intent of taking someone out of business. Outside of that I have no comments.\"","url":"https://www.npr.org/sections/thetwo-way/2017/04/11/523422686/trump-organization-says-its-closing-its-modeling-agency"}
