{"authors":[],"date_download":"2018-10-30 00:57:12","date_modify":"2018-10-30 00:57:12","date_publish":"2016-04-22 00:00:00","description":null,"filename":"data/vaneerConsumption/TrumpvsConmanReagan.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_04_trump_vs_conman_reagan_1540861032.html","title":"Trump vs. 'Conman' Reagan","title_page":"Trump vs. 'Conman' Reagan","title_rss":"NULL","source_domain":"americanthinker.com","text":"Yes, Ronald Reagan migrated from being a liberal Democrat to the gold standard for conservative Republicans. But Reagan’s views evolved over four decades’ worth of life experience, a philosophical journey that took place gradually. His conservative credentials didn’t emanate overnight to match the political season. His was a slow and thoughtful transformation from the 1930s to the 1960s. Trump’s appears to be a midnight conversion just in time for the Iowa caucuses.\nWhen Donald Trump’s political credentials as a Republican and/or conservative are challenged, he likes to remind people that Ronald Reagan was a Democrat once and managed to evolve over time. Except that Reagan’s conversion was real and he had two terms as governor of California to prove his bona fides before he ran for president as a conservative Republican. As Reagan campaign manager Stu Spencer and speechwriter Ken Khachiagin note in a Real Clear Politics piece :\nIndeed, Donald Trump by contrast is a political chameleon, who has as much admitted he supported this or that candidate for office based on whether it was good for business – his business. The evidence is accumulating that he is a political opportunist, and that apart from appropriating “make America great again”, Trump in fact has more in common with Elmer Gantry than Ronald Reagan\nTrump liked Reagan’s slogan, which he featured on his campaign materials so much that he moved to trademark it. He forgets the part about contributing to the campaign of Reagan’s opponent, Jimmy Carter, who later expressed favor with Trump’s “malleability” and not sticking to deeply held principles. During a recent appearance at Britain’s House of Lords, Carter responded to a question of who he would pick for the GOP nomination, responding that he would pick Trump over Cruz:\nI think I would choose Trump, which may surprise some of you,” the former Democratic president said during an appearance at Britain’s House of Lords on Wednesday afternoon. He was asked who he would pick for the GOP nomination. “The reason is, Trump has proven already he’s completely malleable,” Carter explained. “I don’t think he has any fixed [positions] he’d go the White House and fight for. On the other hand, Ted Cruz is not malleable. He has far-right wing policies he’d pursue if he became president.”\nTrump likes Reagan’s slogan, but not the policies which made it actually happen – “far right wing policies” like Reagan’s tax cuts, no doubt. Certainly Trump is no principled fiscal conservative as evidenced by his trashing of the 1986 Tax Reform Act as a Democratic “expert” witness before Congress.\nIn a demonstration of the Trump campaign’s arrogance and incompetence, it tried to tout Trump’s expertise in all things economic when Dan Scavino, Trump’s social media director, tweeted out a video of Trump testifying as an “expert” witness in 1991 before New Jersey Democrat Frank Guarini’s House Budget Committee. As Guy Benson notes at TownHall.com, the transcript obtained from Twitchy shows Trump trashing Reagan’s tax policies and comparing the Reagan economy to that of the Soviet Union:\nSo this tax act was just an absolute catastrophe for the country, for the real estate industry, and I really hope that something can be done -- as Congressman Thomas recently said, that something can be done to change at least parts of it, because it has taken all incentive away from investing in real estate, and real estate really means so many jobs... by having cut the high income tax rates to 25 percent, as an example, people don’t have the incentive any more to invest. They’re saying, “Why should I take a chance on investing in low or moderate-income housing? I might as well just pay the tax.” But the fact is, that 25 percent for high-income people -- for high-income people -- it should be raised substantially with the understanding that if you invest, you can get it down and down substantially below that number... I was asked to come by the Chairman, and I make this plea that, if something isn’t done to put the incentive back -- I mean, we’re no different right now than the Soviet Union. They have no incentive, and we have no incentive. And if something isn’t done to quickly put the incentive back, this country is going to be in very deep problems.\nThis attack on Reagan is not surprising. It reprises what Trump wrote in his 1987 book, The Art of the Deal, where on page 60 he described Ronald Reagan as a “con man” who couldn’t deliver the goods. As Judd Legum at ThinkProgress noted in 2011, Trump’s professed admiration for Reagan was merely a head fake:\nToday, real estate mogul Donald Trump proudly declares that Ronald Reagan is the President he admires most. Here’s Trump on the April 14 edition of Hannity: HANNITY: Who are our past presidents that you admire most? TRUMP: Well, I really like and knew a little bit Ronald Reagan, and I really liked him. You know, not only his policies, smart guy and so much smarter, you know, I always sort of have to laugh to myself when people try and criticize that level of intelligence. And I loved his style. I loved what he represented … I thought he represented something very special for this country. But in his bestselling book, Art of the Deal, published at the conclusion of the Reagan presidency, Trump cited Reagan as an example of someone who could “con people” but couldn’t “deliver the goods.” Trump said Reagan was “so smooth” that he “won over the American people.” But at the conclusion of his presidency, “people are beginning to question whether there is anything beneath that smile,” Trump writes.\nIt is Donald Trump who is the con man, who claims the mantle of Reagan despite trashing Reaganomics, which revived America with unprecedented growth that doubled tax revenues and made victory in the Cold War possible.\nReagan, despite Trump’s all too typical character assassination, did deliver the goods and did it while not belittling his opponents as “little” and “lyin’” or calling reporters “crazy”. Reagan was a conservative or of principle, not one of convenience. Every time Trump speaks, we should remember the Reagan putdown that destroyed Jimmy Carter’s reelection chances: “There you go again.”\nDaniel John Sobieski is a freelance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/articles/2016/04/trump_vs_conman_reagan.html"}
