{"authors":["Mehreen Kasana"],"date_download":"2018-10-31 01:39:25","date_modify":"2018-10-31 01:39:25","date_publish":"2018-08-30 19:47:55","description":"If you follow American politics closely, you've probably already known about the tension between President Donald Trump and Jeff Sessions. And the attorney general's accent is also reportedly a source of displeasure for the president, according to…","filename":"data/vaneerConsumption/TrumpReportedlyHatesJeffSessionsBecauseHesNotAnIvyLeagueGradHasASouthernAccent.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/30/83e8b6bb-fa34-4ca0-beb6-cd138c6090dd-getty-634395562.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_trump-reportedly-hates-jeff-sessions-because-hes-not-ivy-league-grad-has-a-southern-accent-11462319_1540949965.html","title":"Trump Reportedly Hates Jeff Sessions Because He's Not An Ivy League Grad & Has A Southern Accent","title_page":"Trump Reportedly Hates Jeff Sessions Because He's Not An Ivy League Grad & Has A Southern Accent","title_rss":"NULL","source_domain":"bustle.com","text":"If you follow American politics closely, you've probably already known about the tension between President Donald Trump and Jeff Sessions. And the attorney general's accent is also reportedly a source of displeasure for the president, according to Politico. The media outlet reported on Wednesday that White House aides said that Trump is no fan of Sessions' unmistakable Alabama drawl.\nAccording anonymous White House aides that spoke to Politico, Trump has come to dislike Sessions' Southern accent; he reportedly complained that the attorney general \"talks like he has marbles in his mouth.\" Politico also reported that the president did not like that Sessions did not come from an Ivy League background. For reference, the attorney general attended Huntingdon College in Montgomery in 1969, and then University of Alabama School of Law in the autumn of 1970. (Trump attended the University of Pennsylvania.)\nBut it isn't just Sessions' Southern accent or his state school education that has reportedly displeased Trump. Trump also reportedly views Sessions as an ineffective defender of the president in front of the press. According to Politico's Eliana Johnson and Elana Schor, Trump had \"come to resent\" Sessions for these reasons. Bustle has reached out to the White House for comment and will update accordingly.\nPool/Getty Images News/Getty Images\nSpeculation surrounding the possibility of Sessions being fired by Trump is abundant, according to Politico. The media outlet reported that if Sessions is ultimately ousted by the president, it could \"feed special counsel Robert Mueller's investigation of Trump's potential obstruction of justice\" based on the analyses of unnamed White House officials. Bloomberg, too, reported that Sessions' presence in the White House could come to an end by the November elections.\nOne of the White House aides told Johnson and Schor, \"There’s the belief that if the president taking action with respect to Sessions is going to be an important part of the Mueller obstruction case, most of that case has already been made. Things that the president has already done privately that have been reported, but also things that the president has done publicly that could be characterized as bullying or intimidating, all of that case is already there ready to be made, such that firing him is almost like an afterthought.\"\nThese details may not surprise those who have kept an eye on Trump's apparent disdain for Sessions. For instance, in July 2017, Trump bashed Sessions in a tweet saying, \"So, why aren't the committees and investigators, and of course, our beleaguered attorney general looking into Crooked Hillary's crimes and Russia relations?\"\nIn another more recent tweet in August, Trump publicly questioned Sessions' role attorney general on Twitter. On Aug. 25, the president tweeted, \"Jeff Sessions said he wouldn’t allow politics to influence him only because he doesn’t understand what is happening underneath his command position. Highly conflicted Bob Mueller and his gang of 17 Angry Dems are having a field day as real corruption goes untouched. No Collusion!\"\nPool/Getty Images News/Getty Images\nThe president's reported disapproval for Sessions' state school upbringing and Southern drawl could carry some consequences. Some observers have cautioned the president about the potential backlash for such dislike — mainly losing ground with his fans in the South.\nAmong those to chide Trump was Fox News' Laura Ingraham. The conservative television anchor tweeted that it would be \"very unwise if @realDonaldTrump is criticizing Sessions' accent and legal pedigree — unless POTUS wants to offend his most ardent [Alabama] supporters.\"","url":"https://www.bustle.com/p/trump-reportedly-hates-jeff-sessions-because-hes-not-ivy-league-grad-has-a-southern-accent-11462319"}
