{"authors":["Deborah Danan"],"date_download":"2018-10-30 18:58:16","date_modify":"2018-10-30 18:58:16","date_publish":"2018-08-30 15:32:57","description":"U.S. Mideast Envoy Jason Greenblatt slammed the Palestinian Authority for \"criticizing from the sidelines\" attempts to forge a ceasefire.","filename":"data/vaneerConsumption/TrumpEnvoytoPalestinianAuthorityProvideLeadershiporOthersWillFillVoid.json","image_url":"https://media.breitbart.com/media/2018/06/jason-greenblatt.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2018_08_30__1540925896.html","title":"Trump Envoy to Palestinian Authority: Provide Leadership or Others Will Fill Void","title_page":"Trump Envoy to Palestinian Authority: Provide Leadership or Others Will Fill Void","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – U.S. Mideast Envoy Jason Greenblatt on Wednesday slammed the Palestinian Authority for “criticizing from the sidelines” attempts to forge a ceasefire agreement between Israel and Hamas, and warned the PA to show signs of leadership or “others will fill the void.”\n“The Trump Administration strongly supports the efforts of President Al Sisi and the Egyptian government ‎to help facilitate an agreement to restore calm in Gaza and bring about the conditions for the Palestinian Authority to fully assume its responsibilities in Gaza,” Greenblatt said.\nHamas and Israel are said to be engaged in Egyptian-brokered talks for a long-term ceasefire. Israel has reportedly agreed to a partial lift of its blockade of the coastal enclave.\n“The Palestinian Authority cannot criticize from the sidelines. The Palestinian Authority should be part of the solution for the Palestinians of Gaza and Palestinians as a whole,” he said. “If not, others will fill that void.”\nPalestinian Authority President Mahmoud Abbas reportedly slammed the Egypt-brokered moves, saying such a ceasefire deal would only be reached “over my dead body.”\n“Leadership is about making hard choices,” Greenblatt said, but refrained from naming Abbas.\n“The people of Gaza, and Israelis in the area around Gaza, have suffered for far too long,” Greenblatt said. “It is time for the Palestinian Authority to lead the Palestinian people — all Palestinians — to a better future.”\nThe PA severed ties with Greenblatt and the rest of President Donald Trump’s peace team after Trump recognized Jerusalem as Israel’s capital and ordered the U.S. embassy to be moved there.\nIn a private conversation, Abbas was quoted by senior Fatah official Hussein al-Sheikh as saying a ceasefire deal constitutes “treason.”\n“If the agreement is signed without the PA’s permission, it is illegal and constitutes treason,” Abbas said.\n“Over my dead body will there be a ceasefire and calm between both sides,” he added, according to al-Sheikh.\nHamas in response retorted that the terror group was not selling out the Palestinian cause like Abbas did.","url":"https://www.breitbart.com/middle-east/2018/08/30/trump-envoy-to-palestinian-authority-provide-leadership-or-others-will-fill-void/"}
