{"authors":["John Nolte"],"date_download":"2018-10-30 20:21:34","date_modify":"2018-10-30 20:21:34","date_publish":"2015-09-17 15:28:05","description":"Regardless of how well you think Republican frontrunner Donald Trump performed at Wednesday night's CNN debate, there is no question he is generating |","filename":"data/vaneerConsumption/TrumpManiaGOPDebateSetsCNNRatingsRecord.json","image_url":"https://media.breitbart.com/media/2015/09/ap_ap-photo1068-wi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_09_17__1540930894.html","title":"TrumpMania: GOP Debate Sets CNN Ratings Record","title_page":"TrumpMania: GOP Debate Sets CNN Ratings Record | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Regardless of how well you think Republican frontrunner Donald Trump performed at Wednesday night’s CNN debate, there is no question he is generating unprecedented interest and excitement. Last night CNN earned its highest ratings ever. I could make a joke here about that not being a high bar but the network wasn’t always a ratings failure and that makes this record rather remarkable.\nPreliminary estimates show that the debate averaged a 14.7 rating over those three punishing hours. That is 1-in-7 households and should add up to more than 20 million viewers. Chances are CNN won’t beat the 25 million who tuned into the first debate that aired on Fox News a few weeks ago. Nevertheless, a drop from a 16.0 rating to a 14.7 rating is pretty phenomenal, especially when you consider this was a three hour debate.\nThis kind of sustained interest and excitement is good for the overall Party. Now that the RNC has taken some control over these debates, the process is not the horror show it was last time. By September of 2012, there had already been around a dozen debates and 200 questions that were designed only to keep Obama in the White House.\nWe have an impressive field and record numbers of Americans are seeing that.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/the-media/2015/09/17/trumpmania-gop-debate-sets-cnn-ratings-record/"}
