{"authors":[],"date_download":"2018-10-30 01:05:13","date_modify":"2018-10-30 01:05:13","date_publish":"2018-09-02 00:01:18","description":"Former President Jimmy Carter lives in a two-bedroom ranch house in Plains, Georgia, assessed at $167,000, the Washington Post recently reported. And unlike former Presidents Bill Clinton and Barack Obama, he chose not to join corporate boards or deliver six-figure speeches because he didn’t want to “capitalize financially on being in the White House.”","filename":"data/vaneerConsumption/TrumpProofVotersCareMoreAboutPoliciesThanCharacter.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/1024px-Jimmy_Carter_at_the_LBJ_Library02-2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861513.html","title":"Trump Proof Voters Care More About Policies Than Character","title_page":"Trump Proof Voters Care More About Policies Than CharacterThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Washington\nFormer President Jimmy Carter lives in a two-bedroom ranch house in Plains, Georgia, assessed at $167,000, the Washington Post recently reported. And unlike former Presidents Bill Clinton and Barack Obama, he chose not to join corporate boards or deliver six-figure speeches because he didn’t want to “capitalize financially on being in the White House.”\nCarter is such a saint that he has devoted his post-White House years to building 4,300 homes for Habitat for Humanity. In office, he showed himself to be a man of the people when he urged Americans to turn down their thermostats to 65 degrees on winter days — and ordered that the White House adhere to that standard.\nStill, Americans voted to send Carter back to Plains after one term in office. American voters rejected a man whom they believed brought them an energy crisis and dismal economy.\nPresident Donald Trump is not likely to spend his years after the Oval Office sawing lumber for modest homes in Third World countries. But he has overseen a vibrant economy and brought about a strut in the step of blue-collar Trump voters. And that’s what matters most to voters.\nAll of which raises the question: Is it better to have an SOB in the White House who gets things done or a saintly incumbent whose policies don’t work?\n“I’d go with the SOB every time,” Jeffrey Lord, a tireless Trump surrogate during the 2016 campaign, told the Las Vegas Review-Journal. “To me this job is about being effective and getting it done.”\nWhen critics take Trump to task for his lack of decorum on social media, his base responds that the president’s willingness to flout convention makes him more effective.\n“He is doing things that nobody else would dare do. That’s why they’re happy with him. Finally, there’s somebody who doesn’t care about being politically correct,” said Bob Stern, the former president of the Center for Governmental Studies.\nLord doesn’t think Trump’s confrontational posture is his key to success.\n“You can be nice. Ronald Reagan was nice,” Lord recalled. “You can be a total SOB and be totally effective. And you can be a nice guy and be effective.\n“I just think he’s effective and there may be other people who are offended, but he’s getting things done,” Lord said.\nStern looks back at Clinton’s presidency as an example of Democrats accepting behavior they now find unacceptable in Trump. “It’s so ironic that Gloria Steinem would be defending Clinton for what he did,” Stern observed. “We’re all hypocrites in a sense.”\nIn 2016, Stern led a course at UCLA Extension on the 2016 election that was attended almost exclusively by Los Angeles liberals. To their question, “How could anyone vote for Trump?” Stern devised an unusual exercise.\nWhat if Trump was a Democrat, Stern asked, who embraced the Democratic platform, said his first appointment to the Supreme Court would be Merrick Garland (the Obama pick for the top court who never got a Senate hearing), and his second nomination would go to Obama himself?\nAt least two-thirds of his class of progressives said they’d vote for Trump.\nParty matters and character issues are a luxury in politics.\nRepublicans in Rep. Duncan Hunter’s San Diego district are likely to re-elect Hunter despite his indictment for using campaign money to subsidize his family’s lifestyle.\nNew Jersey Democrats probably will vote for Sen. Bob Menendez as well. A federal trial of Menendez on corruption charges ended with a mistrial after a jury deadlocked. Even so, Stern said, “clearly there were major ethical problems there.”\n“People tend to vote their political philosophies first,” Stern said, and it’s “a percentage of independent voters who make a difference.”\nThis is not to say that criticism of Trump is pointless. Many Trump voters are appalled at the president’s tweets, the way he treats his staff, and the puerile name-calling that has led to further deterioration of public discourse.\nAlso, Trump’s antics could enable an impeachment effort if Republicans lose the House in November, or turn off his independent voters in 2020 — as the public wearies of the drama.\nOver time, Lord argued, what will matter is if Trump leaves a solid legacy.\nFor the moment, nice guys finish last, or in Carter’s case, first place in the greatest ex-president category.\nContact Debra J. Saunders at dsaunders@reviewjournal.com or 202-662-7391. Follow @DebraJSaunders on Twitter.\nCOPYRIGHT 2018 CREATORS.COM","url":"https://spectator.org/trump-proof-voters-care-more-about-policies-than-character/"}
