{"authors":["Associated Press","David Martosko","Us Political Editor For Dailymail.Com"],"date_download":"2018-10-23 03:50:46","date_modify":"2018-10-23 03:50:46","date_publish":"2017-03-10 13:34:21","description":"The U.S. labor force participation rate rose to 63 percent, a high water mark since 2014. That jump is an indication that people who have been on the sidelines are rejoining the labor market.","filename":"data/vaneerConsumption/Trumpsfirstmonthseesunemploymentdownandwagesup.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E237CAD00000578-0-image-a-11_1489157706677.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301298_US-adds-235K-jobs-unemployment-rate-falls-4-7-pct_1540266646.html","title":"Trump's first month sees unemployment down and wages up","title_page":"Trump's first month sees unemployment down and wages up | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"U.S. employers added a robust 235,000 jobs in February and wages rose at a healthy clip, a sign the economy remains on solid footing after nearly eight years of recovery.\nThe Labor Department says the unemployment rate fell to a low 4.7 percent from 4.8 percent.\nMore Americans launched job searches, lifting the proportion of Americans working or looking for work to the highest level in nearly a year.\nAnd the labor force participation rate rose to 63 percent, a high water mark since ten months ago. That jump is an indication that people who have been on the sidelines are rejoining the labor market.\nGood news: Trump, who held a National Economic Council 'listening session' in the White House on Thursday, is celebrating jobs and wages data on Friday\nThe White House press secretary crowed, adding: 'Not a bad way to start day 50 of this Administration'\nFriday's announcement on employment gains in the U.S. was boosted by data showing 58,000 new construction jobs\nBig picture: America's unemployment rate has been declining steadily since the end of the 2008-2009 recession\nThe healthy job growth, decent pay gains and falling unemployment rate will make the Federal Reserve even more likely to raise short-term rates when it meets next week.\nFed Chair Janet Yellen said last week that it would be 'appropriate to gradually increase the federal funds rate if the economic data continue to come in about as we expect.'\nThe job gains were boosted by 58,000 new construction jobs, the most in nearly a decade. That figure was likely boosted by unseasonably warm weather in much of the nation.\nWage gains were also recorded in February; average hourly earnings rose six cents, or 0.2 percent, to $26.09.\nAnd in the manufacturing sector, payrolls rose by 95,000 new positions, the highest such one-month increase since March of 2000.\nTrump himself said repeatedly during his presidential campaign that some Bureau of Labor Statistics numbers are not trustworthy.\nTrump himself has claimed repeatedly that some Bureau of Labor Statistics numbers are not trustworthy.\nThe largest net change in jobs last month actually came in the health & education sector\nGood news for the markets: The markets went up on the strong economic performance - although traders expected the gains to fall back slightly overall\nHe claimed at one point that the 'real' unemployment rate may be as high as 42 per cent, lumping together job-seekers with children and the elderly and infirm.\nStill, the president will likely take credit for the second sign of positive job growth in a week.\nHe retweeted a two-word message from the influential Drudge Report website – 'GREAT AGAIN' – as he began the day's victory lap.\nWhite House press secretary Sean Spicer boasted on Twitter that it's 'great news for American workers,' and '[n]ot a bad way to start day 50 of this Administration.'\nThe markets broadly welcomed the news and opened significantly higher than Thursday's closing on the results.\nTraders expected some of the gains to be lost.","url":"https://www.dailymail.co.uk/news/article-4301298/US-adds-235K-jobs-unemployment-rate-falls-4-7-pct.html"}
