{"authors":["Jim Zarroli"],"date_download":"2018-10-23 00:47:34","date_modify":"2018-10-23 00:47:34","date_publish":"2017-01-05 00:00:00","description":"Donald Trump has suggested he may give his daughter and son-in-law a role in his administration. A law bars presidents from hiring family, but a court ruled it doesn't apply to White House staff jobs.","filename":"data/vaneerConsumption/TrumpRelativesPotentialWhiteHouseRolesCouldTestAntiNepotismLaw.json","image_url":"https://media.npr.org/assets/img/2017/01/05/ap_16323755495272_wide-da4e11d00594b3ea8e575c32380f13656b2be7a9.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2017_01_05_508382236_trump-relatives-potential-white-house-roles-could-test-anti-nepotism-law_1540255654.html","title":"Trump Relatives' Potential White House Roles Could Test Anti-Nepotism Law","title_page":"Trump Relatives' Potential White House Roles Could Test Anti-Nepotism Law : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Trump Relatives' Potential White House Roles Could Test Anti-Nepotism Law\nEnlarge this image toggle caption Richard Drew/AP Richard Drew/AP\nPresident-elect Donald Trump has suggested he may give his daughter and son-in-law some roles in his new administration, but a 1967 anti-nepotism law makes doing so a lot more complicated.\nThe law bars presidents from hiring relatives to Cabinet or agency jobs, although a federal judge has ruled that it doesn't apply to White House staff jobs.\nIvanka Trump and her husband, Jared Kushner, have played key roles in Trump's campaign and his transition team and reportedly are preparing to move to a house in the Kalorama section of Washington, D.C.\nEither or both of them are also said to be considering some sort of White House job, perhaps in an informal or unpaid role.\nThe anti-nepotism law was passed by Congress in response to President John F. Kennedy's decision to appoint his brother Robert as attorney general, says Darrell West, vice president and director of governance studies at the Brookings Institution.\n\"It was very controversial at the time. Lyndon Johnson in particular did not like that, and when he became president he helped shepherd this anti-nepotism law through the U.S. Congress,\" West says.\nNot many presidents have sought to hire relatives since then, so the law hasn't often been tested. But when President Bill Clinton appointed his wife, first lady Hillary Clinton, to head his health care task force, the move was challenged in court.\nA federal judge ruled that the law didn't apply to White House staff jobs, making the appointment legal.\nThe Trump transition team did not respond to a request for comment from NPR, but spokeswoman Kellyanne Conway cited that ruling when she was asked whether Trump would hire his children during an appearance on MSNBC's Morning Joe last month.\n\"The anti-nepotism law apparently has an exception if you want to work in the West Wing, because the president is able to appoint his own staff,\" Conway said. \"The president does have discretion to choose a staff of his liking.\"\nBut just because it might be legal for Trump to hire his own children doesn't mean it's good politics, West says. West warned that it could spark a public backlash, much as Kennedy's appointment of his brother did.\n\"People might accept the fact that it was legal, but they would not necessarily view it as ethical or wise,\" West says.\nJulian Zelizer, professor of history and public affairs at Princeton University, notes that the anti-nepotism statute was one of a series of laws passed in the 1960s and '70s, at a time of growing mistrust of the presidency.\n\"We shouldn't forget why we have these [laws]. It was to try to purify the presidency to a certain respect, or to create more accountability in the people that they appoint,\" he says.\nAmericans need to know that presidents are not listening to people just because they're related to them but because they're the best people they can find, Zelizer says.\nMoreover, it can be hard for other staff members to say no to a president's relatives, Zelizer says.\n\"And so you create an environment where people might be less willing to take on and challenge someone because they're related to the president,\" he says.\nHiring the Trump children would also be complicated because they have played big roles in the Trump family businesses, he adds.\n\"If you load up the White House with family members, all of whom are working for this business, that problem will certainly not look good to many Americans. And the politics are as important as the law in this issue. How things look, how things appear matter very much,\" Zelizer says.\nFor Ivanka Trump and her husband, taking jobs in the White House would also come at some financial cost.\nUnlike Trump himself, they would almost certainly be subject to federal conflict-of-interest laws, which would bar them from participating in decisions that would affect their financial interests. That could force them to divest themselves of some of their assets.","url":"https://www.npr.org/2017/01/05/508382236/trump-relatives-potential-white-house-roles-could-test-anti-nepotism-law"}
