{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:32:00","date_modify":"2018-10-30 21:32:00","date_publish":"2018-07-14 13:51:34","description":"President Donald Trump rebuked a reporter who asked if he is giving Russian President Vladimir Putin an upper hand for their summit.","filename":"data/vaneerConsumption/TrumpinUKSaysNoUpperHandforPutinNATOStrongandPowerful.json","image_url":"https://media.breitbart.com/media/2018/07/Trump-Theresa-May-press-conference-Chequers-UK-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_14__1540935121.html","title":"Trump in U.K. Says No 'Upper Hand’ for Putin; NATO ‘Strong and Powerful’","title_page":"Trump in U.K. Says No 'Upper Hand’ for Putin; NATO ‘Strong and Powerful’","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald Trump rebuked a reporter who asked if he is giving Russian President Vladimir Putin an “upper hand” ahead of their meetings on Monday, telling the reporter during a Friday press conference in the U.K. how strong NATO is after this week’s summit.\nPresident Trump and Prime Minister Theresa May held a joint press conference after a private meeting Friday morning at Chequers in Buckinghamshire. An MSNBC reporter asked Trump, “I wonder if — are you giving Russian President Vladimir Putin the upper hand heading into your talks, given that you are challenging these alliances that he seeks to break up and destroy?”\nTrump called the idea “dishonest reporting” and criticized both NBC and CNN. “Let me explain something,” he continued. “We have left NATO with more money, with more unity, with more spirit than NATO probably has ever had. We have a strong and powerful NATO.”\nThe U.S. President suggested his administration has been “far tougher on Russia than anybody” in a very long time. Trump brought up the chemical nerve agent attack in the United Kingdom that led to Prime Minister Theresa May’s asking Trump to respond. He brought up the U.S. expulsion of 60 Russians from the U.S. and coordinated expulsions of Russian operatives in other countries.\n“If we could develop a relationship, which is good for Russia, good for us, good for everybody — that would be great,” Trump said of a U.S. relationship with Russia. He also mentioned the U.S. relationship with China and the massive trade deficit with them.\nThe MSNBC reporter replied, “I take your point…these headlines about the fighting. I take your point about what happened at the end of NATO.”\nTrump said there was fighting because of his push for NATO allies to increase their defense spending. He further suggested that Putin sees the result of the summit, NATO allies coming “together as one, where they’re putting up billions of dollars more.”\nTrump stated that he has confirmed that NATO allies have increased their defense spending by $34 billion since he became president. “That means that the other 28 countries have put in $34 billion more into NATO. Do you think Putin is happy about that? I don’t think so,” said Trump.\nPresident Trump is scheduled to meet with President Putin in Helsinki, Finland, on Monday, July 16.\nMichelle Moons is a White House Correspondent for Breitbart News — follow on Twitter @MichelleDiana and Facebook","url":"https://www.breitbart.com/europe/2018/07/14/trump-u-k-no-upper-hand-putin-nato-strong-powerful/"}
