{"authors":["The Associated Press"],"date_download":"2018-10-30 17:52:09","date_modify":"2018-10-30 17:52:09","date_publish":"2018-10-30 00:00:00","description":"WASHINGTON — President Donald Trump is making another hardline immigration play in the final days before midterm elections, declaring that he wants to order an end to the constitutional right to citizenship for babies born in the United States to non-citizens.","filename":"data/vaneerConsumption/TrumpEndbirthrightcitizenshipforsomeUSbornbabies.json","image_url":"https://media.arkansasonline.com/img/photos/2018/10/30/AP18303411409002_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30_trump-end-_1622258f91d5ab4912c1984a166f726a__page=2_1540921929.html","title":"Trump: End birthright citizenship for some U.S.-born babies","title_page":"Trump: End birthright citizenship for some U.S.-born babies","title_rss":"NULL","source_domain":"arkansasonline.com","text":"FILE - In this Oct. 27, 2018, file photo, President Donald Trump pauses while speaking at a rally at Southern Illinois Airport in Murphysboro, Ill. Trump says he wants to order the end of the constitutional right to citizenship for babies of non-citizens and unauthorized immigrants born in the United States. The president's comments to \"Axios on HBO\" come amid a renewed push for hardline immigration policies in the lead-up to the midterm elections. (AP Photo/Andrew Harnik, File)\nWASHINGTON — President Donald Trump is declaring that he wants to order an end to the constitutional right to citizenship for babies born in the United States to non-citizens.\nTrump made the comments to Axios on HBO.\nThe president has long called for an end to birthright citizenship, as have many conservatives. An executive order to revoke the right would spark a court fight over whether the president has the unilateral ability to change an amendment to the Constitution. The 14th Amendment guarantees that right for all children born in the U.S.\nAsked about the legality of such an executive order, Trump said, \"they're saying I can do it just with an executive order.\" He added that \"we're the only country in the world where a person comes in and has a baby, and the baby is essentially a citizen of the United States,\" though a 2010 study from the Center for Immigration Studies showed that 30 countries offered birthright citizenship.\nAn excerpt of the interview was posted on Axios' website on Tuesday.\nThe president said White House lawyers are reviewing his proposal. It's unclear how quickly he would act and the White House did not provide further details.\nA person familiar with the internal White House debate said the topic of birthright citizenship had come up inside the West Wing at various times over at least the last year, but has some internal detractors. White House lawyers have debated the topic, and expect to work with the Justice Department's Office of Legal Counsel to develop a legal justification for the action. It is one of many immigration changes being discussed including asylum law changes, and barring the migrant caravan from entering the country.\nBut administration officials said there would likely be no decisions until after the midterms, due in part to the president's trip to Pittsburgh.","url":"https://www.arkansasonline.com/news/2018/oct/30/trump-end-birthright-citizenship-some-us-born-babi/?page=2"}
