{"authors":["Abc News","More Ali"],"date_download":"2018-10-30 00:56:27","date_modify":"2018-10-30 00:56:27","date_publish":"2018-10-29 11:39:32","description":"President Donald Trump stoked tensions Monday morning by sending a tweet critical of the media, whose members were among those targeted in the bomb package scare.","filename":"data/vaneerConsumption/Trumpkicksoffweekwithtweetcallingmediathetrueenemyofthepeople.json","image_url":"https://s.abcnews.com/images/US/donald-trump-gty-jt-181026_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Politics_trump-kicks-off-week-tweet-calling-media-true_story_id=58827743_1540860987.html","title":"Trump kicks off week with tweet calling media 'the true enemy of the people'","title_page":"Trump kicks off week with tweet calling media 'the true enemy of the people' - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"With the nation still on edge after a spate of bomb threats and a mass shooting last week, President Donald Trump stoked tensions Monday morning by sending a tweet critical of the media, whose members were among those targeted in the bomb package scare.\nInterested in Donald Trump? Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News. Add Interest\nThere is great anger in our Country caused in part by inaccurate, and even fraudulent, reporting of the news. The Fake News Media, the true Enemy of the People, must stop the open & obvious hostility & report the news accurately & fairly. That will do much to put out the flame... — Donald J. Trump (@realDonaldTrump) October 29, 2018\nThe president tweeted more subdued messages over the weekend, including a pair of tweets mourning the loss of the eleven Jewish Americans.\nAll of America is in mourning over the mass murder of Jewish Americans at the Tree of Life Synagogue in Pittsburgh. We pray for those who perished and their loved ones, and our hearts go out to the brave police officers who sustained serious injuries... — Donald J. Trump (@realDonaldTrump) October 27, 2018\nEight men and three women were slain in the shooting, and one police officer was in critical condition. The shooter was identified as Robert Bowers, who had shared anti-Semitic messages on social media.\nEarlier in the week, authorities arrested Cesar Sayoc, charged with sending thirteen mail bombs to CNN, former public officials like Bill and Hillary Clinton and actor Robert DeNiro, all entities that have been critical of President Trump.\nThe president received a briefing about the shooting on board Air Force One Saturday on his way to campaign events and said over the weekend that he would travel to Pittsburgh to meet with the Tree of Life community this week.\nMeanwhile, members of Congress mourned the loss of the people in the shooting and sought to take action to respond to it.\nHouse Judiciary Committee ranking member Jerry Nadler, D-N.Y., plus several other Democrats on the committee, called on Judiciary chairman Bob Goodlatte, R-Va., to hold emergency hearings on hate crimes and domestic terrorism after not just the synagogue attack and bomb threats but also the murder of two African-Americans in a racially-charged supermarket attack in Kentucky.\n“Each of these acts was carried out by an individual understood to espouse white supremacist views,” the House Democrats said. “Whether it manifests itself as racism or anti-Semitism or xenophobia, white supremacy is white supremacy. In its modern form, it motivates a fluid and particularly virulent form of domestic terrorism. It must be stopped.”\nPennsylvania congresspeople, including the synagogue's representative, also expressed their mourning.\nRep. Mike Doyle, D-Penn., whose district includes the Tree of Life synagogue, said in a statement, “We know at this point, that the shooter was motivated by hate and anti-Semitism. We’ve got to find a way to prevent such hate from festering in our society. While that is a tall order, there are steps Congress can and should take to reduce gun violence and make this hate less deadly. Today is a time for mourning and praying as a city and community, and soon we will need to come together to heal and ensure this doesn’t happen again.”\nRep. Conor Lamb, who represents a separate portion of Pittsburgh, said in part, “The shooting this morning at Tree of Life Synagogue was a hate crime. Pittsburgh Police officers ran without hesitation straight into the fire, risking their lives and saving others. These men and women are heroes every day, today they proved it once again.”\nSen. Bob Casey, a Democrat running for re-election to the Senate, canceled his bus tour events for Saturday in light of the shooting.\nRep. Lou Barletta, R-Penn., running to unseat Casey, said in a statement, “To target the Jewish Community in any way disregards each and every value we hold dear as Americans, and to do so with such a cowardly and heinous attack is pure evil. There is no place for anti-Semitism or any similar hatred in our society.”\nOther members of Congress from all over the country followed suit, mourning the deaths and condemning the anti-Semitism that appeared to fuel the attack.\n“The hatred in this man’s heart has no place in a society founded on the idea of religious freedom,” Sen. Orrin Hatch, R-Utah, who his office noted was born and raised in Pittsburgh, said in a statement.\nRep. Maxine Waters, D-Calif., one of the package bomb intended targets, remarked on the number of high-profile attacks just last week alone, including another race-fueled murder in Kentucky and the bomb attempts.\n“This horrific shooting was one of three hate crimes and violent attacks over the past week – including the murder of two African Americans in Jeffersontown, Kentucky by a man who first attempted to enter a predominantly black church, and assassination attempts on two former presidents, sitting members of Congress, public servants, and private citizens – all of which point to a disturbing rise in extremism, hate, and violence in our country,” Waters said.\nThis is a developing story. Please refresh for details.","url":"https://abcnews.go.com/Politics/trump-kicks-off-week-tweet-calling-media-true/story?id=58827743"}
