{"authors":["Abc News","More Stephanie"],"date_download":"2018-10-30 00:57:58","date_modify":"2018-10-30 00:57:58","date_publish":"2018-10-29 13:58:52","description":"The Trump administration has been working to recognize historic sites related to the civil rights movement around the country.","filename":"data/vaneerConsumption/TrumpadministrationrecognizingcivilrightssitesaroundtheUS.json","image_url":"https://s.abcnews.com/images/Politics/camp-nelson-monument-ht-jc-181029_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Politics_trump-administrati_b07c1becacb2e1f470c204f23f78f7ed_story_id=58831919_1540861078.html","title":"Trump administration recognizing civil rights sites around the US","title_page":"Trump administration recognizing civil rights sites around the US - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"As Americans engage in a national conversation about divisions in the U.S., amplified after the weekend synagogue shooting in Pittsburgh, the Trump administration has been carrying out a bipartisan effort to celebrate sites that mark the history of civil rights and African-Americans in the United States.\nInterested in Trump Administration? Add Trump Administration as an interest to stay up to date on the latest Trump Administration news, video, and analysis from ABC News. Add Interest\nIn recent weeks, the National Park Service has been announcing additions to a network of historic sites related to the civil rights movement.\nAnd on Friday, President Trump designated the Union Army recruitment center at Camp Nelson in Kentucky a national monument. Thousands of enslaved African-Americans escaped to Camp Nelson and ended up enlisting in the Union Army or living in refugee settlements at the camp, according to the White House statement. The area is considered one of the best preserved sites related to the experience of escaped and emancipated slaves who fought in the Civil War.\nInterior Secretary Ryan Zinke visited Camp Nelson on Saturday for the announcement.\nTami A. Heilemann/DOI\n\"Camp Nelson was instrumental as a refuge for escaped and emancipated slaves. The Camp tells the story about Americans who risked absolutely everything they have and everyone they love to fight for their freedom, the cause of liberty and to preserve the Union,\" Zinke said in a statement last week.\n\"I thank the President for using the Antiquities Act as it was truly intended and I can think of no better place for his use of the Act than to recognize African Americans for the sacrifices they made for this country and for the contributions they made for all Americans freedom than by elevating Camp Nelson to National Monument status. I look forward to future generations visiting this site and learning about our nation’s history,” Zinke said.\nToday Camp Nelson becomes our newest national monument, helping tell the story of African-American soldiers during the #CivilWar & more: https://t.co/SOEbhY5yPC pic.twitter.com/MpBxp9XDdd — US Department of the Interior (@Interior) October 27, 2018\nThe Camp Nelson National Cemetery, where many wounded soldiers are buried, is adjacent to what is now the Camp Nelson National Monument. The camp influenced Congress to free the wives and children of African-American men who fought in the Union Army after 102 women and children died during a forced expulsion from the camp in the winter of 1864. The camp and refugee camps were closed in 1866 but about 250 stayed in the area and established the community now known as Hall, Kentucky.\nOn Monday, Zinke was in New Orleans to add the home of NAACP attorney A.P. Tureaud to the African American Civil Rights Network. The network was established through a bipartisan bill last year that directs the National Park Service to recognize and connect historic sites that honor people who fought against discrimination and segregation.\nWe are celebrating the life and legacy of a giant in the civil rights movement. Attorney AP Tureaud was a major force in desegregation, equality in education, and voting rights. His home is being added to the African American Civil Rights Network today. pic.twitter.com/GZ0ruFB6Bc — Secretary Ryan Zinke (@SecretaryZinke) October 29, 2018\nIn August, the home of Medgar and Myrlie Evers in Mississippi was added to the list. Medgar Evers was the first field secretary for the NAACP. He was assassinated at his home in Jackson, Mississippi, in 1963.\nThe administration also started the process of designating the Evers home a national monument.\nRogelio V. Solis/AP, FILE\nThe Lorraine Motel in Tennessee, where Martin Luther King Jr. was assassinated in 1968, is also part of the network, as well as the park in Indianapolis where Sen. Robert F. Kennedy delivered a speech the day King was killed.\nThe first site added to the network was a mural in Interior headquarters in Washington, D.C., depicting singer Marian Anderson's concert at the Lincoln Memorial in 1939. Anderson was barred from performing at the Daughters of the American Revolution Constitution Hall at the time because she was black, even though it was the only venue large enough for her audience.\nIn addition to adding sites to the civil rights network, the Interior Department has announced $12.6 million in grants to preserve civil rights sites around the country. Zinke has also been working to get bipartisan support for a bill to provide more funding for upkeep at national parks, which have a maintenance backlog of about $11.6 billion.","url":"https://abcnews.go.com/Politics/trump-administration-recognizing-civil-rights-sites-us/story?id=58831919"}
