{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:02:33","date_modify":"2018-10-30 21:02:33","date_publish":"2016-03-09 17:56:09","description":"Tuesday night Donald Trump scored wins in primary states Michigan and Mississippi and as results came in, the hashtag #IfTrumpWins began trending on Twitter across the United States, putting on display ugly anti-Trump hate with unimaginative Hitler and KKK comparisons. |","filename":"data/vaneerConsumption/TrumpTuesdayWinsSparkIfTrumpWinsTwitterBacklash.json","image_url":"https://media.breitbart.com/media/2016/03/Chris-Hardwick-Tag-the-Bird-ifTrumpWins.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_09__1540933353.html","title":"Trump Tuesday Wins Spark #IfTrumpWins Twitter Backlash","title_page":"Trump Tuesday Wins Spark #IfTrumpWins Twitter Backlash | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tuesday night Donald Trump scored wins in primary states Michigan and Mississippi and as results came in, the hashtag #IfTrumpWins began trending on Twitter across the United States, putting on display ugly anti-Trump hate with unimaginative Hitler and KKK comparisons.\nThe #IfTrumpWins scenario hashtag seemed to take off from the account for a late night game show on Comedy Central that revived the previously used hashtag:\nTime for your fave apocalypse scenario, let's play #IfTrumpWins! Let these examples inspire you to play!https://t.co/qYGtnOlwV3 — @midnight (@midnight) March 9, 2016\nThe ugliness of Twitter hate then spawned the unimaginative Hitler comparison:\n#IfTrumpWins We'll have a first lady who sounds like Hitler, and a president that thinks like Hitler — Neko White (@Neko_white93) March 9, 2016\nAfter someone responded “what” to that tweet, this:\n@DePretador15 just making a comparison between trump and hitler — Neko White (@Neko_white93) March 9, 2016\nHere was another comparison to the Nazi leader:\n#IfTrumpWins Hitler no longer the biggest dictator with the smallest dick@midnight — Tyler Morrison (@tylermorrison1) March 9, 2016\nAnd yet another:\nAnd then there was a reference to North Korean dictator Kim Jong-un:\n#IfTrumpWins I'm guessing Seth Rogen will start immediately working on his sequel to 'The Interview' @midnight — Jeff Dwoskin (@bigmacher) March 9, 2016\nAnd then then came the KKK references:\nThe Arabs for Bernie Sanders Twitter account tweeted:\nIf we nominate @BernieSanders we don't have to worry #IfTrumpWins cause we know we destroy @realDonaldTrump pic.twitter.com/yjYEedwu7I — Arabs For Bernie (@ArabsForBernie) March 9, 2016\nSeveral tweets also hit on Trump’s border wall and suggested Canada would build a wall on the U.S. northern border.\n#IfTrumpWins Canada chips in for a border wall further North. @midnight — Nug Nahrgang (@Nug13) March 9, 2016\nThen came a reference to Trump’s suggestion to temporarily ban Muslims from entering the United States:\nPeople are seriously uneducated, people think 99.99% of Muslims are bad but that's def not true, stop hating on Muslims #IfTrumpWins — krystina loves niall (@njhhoodie) March 9, 2016\nSome chose to tweet about anatomy size and others made disparaging comments about Trump’s wife Melania.\nSome Trump supporters jumped on the hashtag with comments supportive of the GOP frontrunner:\n#IfTrumpWins, Liberals promising to leave the USA.\nSo no more riots, no more commie flag burning, lower crime,\nHmmm, will help you pack. — NetAdvisor™ (@NetAdvisor) March 9, 2016\nAll you people on the #IfTrumpWins HT saying you'll move to Canada are hysterical. Why don't you move to Mexico? Are you racist? topkek. — DT's White House™ (@TrumpIssues) March 9, 2016\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2016/03/09/trump-tuesday-wins-spark-iftrumpwins-twitter-backlash/"}
