{"authors":[],"date_download":"2018-10-30 01:23:25","date_modify":"2018-10-30 01:23:25","date_publish":"2016-10-13 17:46:30","description":"Republican presidential nominee Donald Trump on Thursday slammed recent reports that he sexually assaulted multiple women over the years, telling a crowd gathered in Florida that the allegations are false and questioning the timing of the reports.","filename":"data/vaneerConsumption/Trumpslamsgropingallegationsasfalsepoliticallymotivated.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/CmgSharedContent/2016/10/13/Images/photos.medleyphoto.11743400.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national-govt--politic_195447ff7a86cb0261c9d47314da3198__1540862605.html","title":"Trump slams groping allegations as false, politically motivated","title_page":"Trump slams groping allegations as false, politically motivated","title_rss":"NULL","source_domain":"ajc.com","text":"Republican presidential nominee Donald Trump on Thursday slammed recent reports that he sexually assaulted multiple women over the years, telling a crowd gathered in Florida that the allegations are false and questioning the timing of the reports.\n>> Read more trending stories\nHe blamed the allegations on rival Hillary Clinton and the agendas of The New York Times and other news outlets. The Times on Thursday published a report on a pair of women, one who said Trump groped her on an airplane in the 1980s and another who said Trump kissed her inappropriately in 2005.\n\"These attacks are orchestrated by the Clintons and their media allies,\" Trump said. \"The only thing Hillary Clinton has going for herself is the press. Without the press she is absolutely zero.\"\n>> Related: Donald Trump sexual assault allegations: 5 things to know\nHe slammed another report published by People Magazine in which writer Natasha Stoynoff claimed she was pushed against a wall and forcibly kissed by Trump while interviewing him and his wife, Melania, for a story in 2005 on the couple's first wedding anniversary.\nTrump questioned the timing of her report, reminding the crowd that he was popular through his show \"The Apprentice\" at the time the alleged attack happened.\n>> Related: Multiple women make sexual assault accusations against Donald Trump\n\"I was one of the biggest stars on television, on 'The Apprentice,' and it would have been one of the biggest stories of the year,\" he said. \"You take a look, look at her, look at her words – you tell me what you think. I don't think so.\"\nHe promised to unveil evidence proving the allegations false \"at the appropriate time.\" He did not elaborate on the evidence or when the appropriate time to release it would be.\nTrump has faced heavy criticism over his alleged treatment of women since video and audio captured on a hot microphone in 2005 was obtained by The Washington Post and published on Friday.\n>> Related: Does Trump's 'locker room banter' describe sexual assault?\nIn the video, Trump and \"Access Hollywood\" host Billy Bush can be heard ogling actress Arianne Zucker's legs and talking about how the GOP presidential nominee's celebrity status allowed him to make sexual advances toward women.\n\"I better use some Tic Tacs just in case I start kissing her,\" Trump says in the video while watching Zucker walk up to an \"Access Hollywood\" bus. \"You know, I'm automatically attracted to beautiful women — I just start kissing them. It's like a magnet. Just kiss. I don't even wait. And when you're a star, they let you do it. You can do anything. … Grab them by the (expletive). You can do anything.\"\n>> Related: 'Days of Our Lives' star Arianne Zucker on lewd Donald Trump tape: 'I choose to stand tall'\nThe comments have been widely criticized as describing sexual assault.\nTrump has dismissed the recording and said his comments were little more than \"locker room banter.\"","url":"https://www.ajc.com/news/national-govt--politics/trump-slams-groping-allegations-false-politically-motivated/DjC4p9sYPUaPL1GxJIQDpJ/"}
