{"authors":["Kelly Mclaughlin For Mailonline"],"date_download":"2018-10-23 04:22:47","date_modify":"2018-10-23 04:22:47","date_publish":"2017-03-16 15:41:12","description":"Donald Trump made the dig at his former presidential campaign rival while standing his ground on his immigration ban at a rally in Nashville, Tennessee, on Wednesday night.","filename":"data/vaneerConsumption/TrumpsdigatClintonsendsthecrowdwildinNashville.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E4FE15600000578-0-image-a-61_1489678560552.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320678_Trump-s-dig-Clinton-sends-crowd-wild-Nashville_1540268567.html","title":"Trump's dig at Clinton sends the crowd wild in Nashville","title_page":"Trump's dig at Clinton sends the crowd wild in Nashville | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Donald Trump sent a Tennessee crowd into 'Lock her up' chants when he said that Hillary Clinton 'fortunately' would not be making presidential decisions during a rally on Wednesday.\nTrump made the dig at his former presidential campaign rival while standing his ground on his immigration ban at a rally in Nashville on Wednesday night.\nThe speech came after US District Court Judge Derrick K. Watson put an immediate halt on Trump's revised travel ban.\nDonald Trump made the dig at his former presidential campaign rival while standing his ground on his immigration ban at a rally in Nashville, Tennessee, on Wednesday night\n'The order he blocked was a watered-down version of the first order that was also blocked by another judge and should have never been blocked to start with,' Trump said, referring to the decision by the federal judge from Hawaii.\n'This new order was tailored to the dictates of the 9th Circuit's, in my opinion, flawed ruling. This was, in the opinion of many, an unprecedented judicial overreach.'\n'The law and constitution give the president the power to suspend immigration when he deems - or she, or she, fortunately not \"Hillary she\" - when he or she deems it to be in the national interest of our country.'\nThe crowd broke out in raucous cheers when Trump said 'fortunately not Hillary', and the President took a pause from his speech.\nAs he stepped away from the microphone, the crowd started chanting, 'Lock her up'.\nIn granting the temporary restraining order in response to a lawsuit by the state of Hawaii, Judge Watson found on Wednesday that 'a reasonable, objective observer ... would conclude that the executive order was issued with a purpose to disfavor a particular religion.'\nTrump said that his former campaign rival Clinton 'fortunately' would not be making presidential decisions\nEarly on Thursday, US District Judge Theodore Chuang issued a nationwide preliminary injunction in a similar case in Maryland brought by refugee resettlement agencies represented by the American Civil Liberties Union and the National Immigration Law Center.\nChuang ruled that the agencies were likely to succeed in proving that the travel ban portion of the executive order was intended to be a ban on Muslims and, as a result, violates the US Constitution's religious freedom protection.\n'To avoid sowing seeds of division in our nation, upholding this fundamental constitutional principle at the core of our nation's identity plainly serves a significant public interest,' Chuang wrote in his ruling.\nThe actions were the latest legal blow to the administration's efforts to temporarily ban refugees as well as travelers from six predominantly Muslim countries. The president has said the ban is needed for national security.\nHowever, the orders, while a victory for the plaintiffs, are only a first step and the government could ultimately win its underlying case. Watson and Chuang were appointed to the bench by former Democratic President Barack Obama.\nTrump, speaking after the Hawaii ruling at a rally in Nashville, called his revised executive order a 'watered-down version' of his first.\nThe speech in Nashville came after US District Court Judge Derrick K Watson put an immediate halt on Trump's revised travel ban\nThe President said he would take the case 'as far as it needs to go,' including to the Supreme Court, in order to get a ruling that the ban is legal.\nThe likely next stop if the administration decides to contest the Hawaii judge´s ruling would be the United States Court of Appeals for the Ninth Circuit.\nThree judges on the Ninth Circuit upheld a restraining order on the first travel ban issued by a Washington state judge.\nAt that point, the government's legal options were to ask for a hearing by a larger panel of judges or petition the Supreme Court to hear the case. Instead, the administration withdrew the ban, promising to retool it in ways that would address the legal issues.\nIf the Ninth Circuit were to uphold the Hawaii court's ruling, an appeal to the Supreme Court would be complicated by its current makeup of four conservative and four liberal judges, with no ninth justice since the death of Antonin Scalia more than a year ago.\nThe travel ban has deeply divided the country on liberal and conservative lines, and it is unlikely that a ninth Supreme Court justice would be seated in time to hear an appeal in this case.\nTrump signed the new ban on March 6 in a bid to overcome legal problems with his January executive order, which caused chaos at airports and sparked mass protests before a Washington judge stopped its enforcement in February.","url":"https://www.dailymail.co.uk/news/article-4320678/Trump-s-dig-Clinton-sends-crowd-wild-Nashville.html"}
