{"authors":[],"date_download":"2018-10-23 00:46:58","date_modify":"2018-10-23 00:46:58","date_publish":"2017-03-16 10:18:20","description":"US President Donald Trump may not be popular in much of the Muslim world but he has been embraced by Saudi Arabia and, in turn, has reached out to the...","filename":"data/vaneerConsumption/TrumpSaudiArabiainmutualembrace.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/10/wire-227667-1489659502-192_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319564_Trump-Saudi-Arabia-mutual-embrace_1540255618.html","title":"Trump, Saudi Arabia in mutual embrace","title_page":"Trump, Saudi Arabia in mutual embrace | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US President Donald Trump and Saudi Deputy Crown Prince Mohammed bin Salman shake hands at the White House on March 14, 2017\nUS President Donald Trump may not be popular in much of the Muslim world but he has been embraced by Saudi Arabia and, in turn, has reached out to the oil-rich kingdom.\nA meeting Tuesday in Washington between Trump and the powerful Saudi Deputy Crown Prince, Mohammed bin Salman, confirmed that the new government in Washington sees Riyadh as a critical partner for both security and investment, analysts say.\nPrince Mohammed, 31, whose country is the birthplace of Islam, was one of the first foreign leaders to visit Trump, who has vowed to fight \"radical Islamic terrorism\".\nHis trip followed a series of laudatory comments towards the new administration from Saudi Arabia, whose relations were increasingly frayed under former president Barack Obama.\nTrump \"recognises the Saudi leadership as the primary conduit to the Muslim world,\" said Salman al-Ansari, president of the Saudi American Public Relation Affairs Committee (SAPRAC).\nThe Washington meeting was an affirmation by Trump's team that the main source \"for Middle Eastern stability, security and untapped mutual economic prosperity is Saudi Arabia,\" Ansari told AFP from Washington.\nHis committee is a private initiative to strengthen Saudi-US ties.\nAnwar Eshki, a retired Saudi general and founder of the independent Middle East Centre for Strategic and Legal Studies in Jeddah, said Trump invited Prince Mohammed \"to make the plan for the Middle East\" together.\nHe said they want to counter both Shiite Iran and the Islamic State group of Sunni extremists who control territory in Syria and Iraq and have claimed attacks in other countries.\nLeaders in Sunni-dominated Saudi Arabia have welcomed the Trump administration's views toward their regional rival Iran.\nUS Defence Secretary Jim Mattis has described Iran as \"the biggest destabilising force in the Middle East\".\nTrump has opposed the July 2015 nuclear deal between world powers and Iran that saw international sanctions lifted in exchange for guarantees that Tehran will not pursue a nuclear weapons capability.\nRiyadh regularly accuses Tehran of interference throughout the region, including in Syria where it backs the regime of President Bashar al-Assad, and in Yemen.\nSaudi Arabia has for two years led an Arab military coalition assisting the Yemeni government against Iran-backed insurgents.\nWashington gives intelligence, aerial refuelling and weapons to the Saudi alliance, although Obama in December blocked the transfer of precision-guided bomb kits to Saudi Arabia because of concerns over civilian casualties.\n- 'Critical strategic partner' -\nEshki said Trump's administration could step up military assistance for the Saudi coalition to help pressure the rebels into returning to peace talks.\nAnthony Cordesman, of the Center for Strategic and International Studies in Washington, said it remains unclear \"whether there will be practical plans\" to better contain Iran and improve counter-terrorism.\nBut Washington clearly sees Riyadh as \"a critical strategic partner,\" Cordesman said.\nThe United States is not the only target of the Saudi charm offensive.\nSaudi King Salman reviews an honour guard with Chinese President Xi Jinping at the Great Hall of the People in Beijing on March 16, 2017\nWhile his son was in Washington, King Salman was in Asia on a month-long tour that has included stops in China, Japan, Malaysia and Indonesia to strengthen alliances in the region.\nSecond in line to the throne, Prince Mohammed holds the post of defence minister, although much of his focus is on efforts to diversify the economy.\nA White House statement said Trump and Prince Mohammed seek \"to further strengthen and elevate the United States-Saudi strategic relationship\" in security, economic and other areas.\nThey \"noted the importance of confronting Iran's destabilising regional activities while continuing to evaluate and strictly enforce\" the nuclear deal with Tehran, it added.\nMuch of the statement focused on potential economic ties, which it said could create jobs in both countries.\nPrince Mohammed was joined in the US by his ministers of energy, commerce and information, a foreign diplomat told AFP.\nThe US and Saudi Arabia have a decades-old relationship based on the exchange of American security for Saudi oil.\nWhile Trump's proposed 90-day ban on the entry of nationals from Iran, Libya, Somalia, Sudan, Syria and Yemen has prompted criticism in much of the Muslim world, there has been no outcry from Riyadh.\n\"Each country has the right to secure its borders,\" Arab News chief editor Faisal Abbas wrote on Thursday.\nCordesman said dialogue such as that between Trump and Prince Mohammed is critical \"to make the president and the people around him aware of the fact that extremism is not Islam, that you can work with trusted partners\" in the region.","url":"https://www.dailymail.co.uk/wires/afp/article-4319564/Trump-Saudi-Arabia-mutual-embrace.html"}
