{"authors":["Associated Press"],"date_download":"2018-10-22 23:42:07","date_modify":"2018-10-22 23:42:07","date_publish":"2017-03-16 07:34:18","description":"WASHINGTON (AP) - President Donald Trump's new $1.15 trillion budget would reshape America's government with the broad, conservative strokes he promised as a...","filename":"data/vaneerConsumption/TrumpsbudgetboostsmilitarybutcutsGOPDemfavorites.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/23/wire-231209-1489705777-978_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319114_Trump-budget-Defense-spending-priority-agency-money_1540251727.html","title":"Trump's budget boosts military but cuts GOP, Dem favorites","title_page":"Trump's budget boosts military but cuts GOP, Dem favorites | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - President Donald Trump's new $1.15 trillion budget would reshape America's government with the broad, conservative strokes he promised as a candidate, ordering generous increases for the military, slashing domestic programs and riling both fellow Republicans and Democrats by going after favored programs.\nThe president's initial budget proposal, submitted to Congress on Thursday, would boost defense spending by $54 billion, the largest increase since Ronald Reagan's military buildup of the 1980s. That means deep cuts elsewhere - the environment, agriculture, the arts - but Trump said that's imperative to take on the Islamic State group and others in a dangerous world.\n\"To keep Americans safe, we have made the tough choices that have been put off for too long,\" he declared in a statement titled \"America First\" that accompanied the budget.\nBudget Director Mick Mulvaney, joined by White House press secretary Sean Spicer, left, speaks about President Donald Trump's budget proposal for the coming fiscal year during daily press briefing at the White House, in Washington, Thursday, March 16, 2017. (AP Photo/Andrew Harnik)\nOr, as Budget Director Mick Mulvaney said, \"This is a hard power budget, not a soft power budget.\"\nIt's not entirely in line with Trump's campaign pledges.\nIt would make a big down payment on the U.S.-Mexico border wall, which Trump repeatedly promised the Mexicans would pay for. American taxpayers will, at least for now. Thursday's proposal calls for an immediate $1.4 billion infusion with an additional $2.6 billion planned for the 2018 budget year starting Oct. 1.\nParts of Trump's spending plan for the next fiscal year angered both congressional Democrats and Republicans who will have the final say on it.\nWhile it targets Democratic priorities like housing, community development and the environment, it also would slash GOP sacred cows like aid to rural schools and subsidized airline service to Trump strongholds, and it would raise fees on participants in the federal flood insurance program.\nThe budget pursues frequent targets of the GOP's staunchest conservatives, eliminating the National Endowment for the Arts, legal aid for the poor, low-income heating assistance and the AmeriCorps national service program established by President Bill Clinton.\nBut Midwestern Republicans including Sen. Rob Portman of Ohio were upset by cuts to the Great Lakes Restoration Initiative. Southern Republicans like Rep. Hal Rogers of Kentucky lashed out at cuts he called \"draconian, careless and counterproductive.\"\nOne target of the budget is the Appalachian Regional Commission, which helps communities in the region.\nTrump's proposal covers only roughly one-fourth of the approximately $4 trillion total federal budget. This is the discretionary portion that Congress passes each year, not addressing taxes, Social Security, Medicare and Medicaid.\nNor does it make predictions about deficits and the economy. Those big-picture details are due in May, and are sure to show large - probably permanent - budget deficits. Trump has vowed not to cut Social Security and Medicare and is dead set against raising taxes.\nAs for Thursday's proposal, Republicans praised the president for beefing up the Pentagon, but they were far less enthusiastic about accepting Trump's recipe for doing so without adding to the nation's $20 trillion debt.\n\"While we support more funding for our military and defense, we must maintain support for our farmers and ranchers,\" said North Dakota Republican John Hoeven, blasting a 21 percent cut to the Agriculture Department's budget.\nThe proposed budget would close numerous county offices that help farmers and rural residents navigate farm subsidy and rural development programs. Rural development and water projects would also bear cuts.\n\"I just want to make sure that rural America, who was very supportive to Trump, doesn't have to take a disproportionately high cut,\" said Rep. Robert Aderholt, R-Ala.\nBudget Director Mulvaney acknowledged that passing the cuts could be an uphill struggle and said the administration would negotiate.\n\"This is not a take-it-or-leave-it budget,\" he acknowledged.\nMany of Trump's GOP allies on Capitol Hill gave it only grudging praise, if any.\n\"Congress has the power of the purse,\" reminded House Appropriations Committee Chairman Rodney Frelinghuysen of New Jersey. \"I look forward to reviewing this,\" said House Speaker Paul Ryan of Wisconsin.\n\"Many of the reductions and eliminations proposed in the President's 'skinny budget' are draconian, careless and counterproductive,\" said Rep. Harold Rogers, R-Ky.\nLaw enforcement agencies like the FBI would be spared. In addition to the billions for the border wall, there is a request for $1.2 billion for the current budget year for additional border patrol and immigration control agents.\nMore than 3,000 EPA workers would lose their jobs and programs such as Barack Obama's Clean Power Plan, which would tighten regulations on emissions from power plants seen as contributing to global warming, would be eliminated. Popular EPA grants for state and local drinking and wastewater projects would be preserved, however, even as research into climate change would be eliminated.\nBefore the two sides go to war over Trump's 2018 plan, they need to deal with more than $1.1 trillion in unfinished agency budgets for the current year. A temporary catchall spending bill expires April 28; negotiations have barely started and could get hung up over Trump's request for the wall and additional border patrol and immigration enforcement agents, just for starters.\nSome of the most politically sensitive domestic programs would be spared in the new proposal, including food aid for pregnant women and their children, housing vouchers for the poor, aid for special education and school districts for the poor, and federal aid to historically black colleges and universities.\nCritics seized on difficult-to-defend cuts to programs such as Meals on Wheels, which delivers food to elderly shut-ins.\nBut the National Institutes of Health would absorb a $5.8 billion cut despite Trump's talk in a recent address to Congress of finding \"cures to the illnesses that have always plagued us.\" Subsidies for airlines serving rural airports in Trump strongholds would be eliminated. The plan It would also shut down some money-losing long-distance Amtrak routes and kill off a popular $500 million per-year \"TIGER Grant\" program for highway projects created by Obama.\nBudget Director Mick Mulvaney speaks about the Trump Administration's budget proposal during daily press briefing at the White House in Washington, Thursday, March 16, 2017. (AP Photo/Andrew Harnik)\nHouse Budget Committee Chair Rep. Diane Black, R-Tenn., joined by Rep. Todd Rokita, R-Ind., prepares to gavel a hearing on the Republican health care bill, Thursday, March, 16, 2017, on Capitol Hill in Washington. (AP Photo/J. Scott Applewhite)\nBudget Director Mick Mulvaney speaks about President Donald Trump's budget proposal for the coming fiscal year during daily press briefing at the White House, in Washington, Thursday, March 16, 2017. (AP Photo/Andrew Harnik)","url":"https://www.dailymail.co.uk/wires/ap/article-4319114/Trump-budget-Defense-spending-priority-agency-money.html"}
