{"authors":["Dan Dicker"],"date_download":"2018-10-30 23:05:30","date_modify":"2018-10-30 23:05:30","date_publish":"2018-07-23 00:00:00","description":"Oil prices lost nearly $7 a barrel recently, before bouncing back late last week, and analysts have struggled to point to what exactly caused the drop. Trump's trade war could be the main factor that's jerking investor sentiment in the oil market.","filename":"data/vaneerConsumption/Trumpstradewarisputtingtheoilmarketinpanicmode.json","image_url":"https://amp.businessinsider.com/images/5b48fcfc4b625630008b4a3f-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trumps-trade-war-is-putting-the-oil-market-in-panic-mode-2018-7_1540940730.html","title":"Trump's trade war is putting the oil market in panic mode","title_page":"    Trump's trade war is putting the oil market in panic mode - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"President Donald Trump speaks in the Roosevelt Room of the White House in Washington, Friday, April 28, 2017, before signing an Executive Order directing the Interior Department to begin review of restrictive drilling policies for the outer-continental shelf. From left are, Vice President Mike Pence, Rep. Don Young, R-Alaska, the president, Sen. Bill Cassidy, R-La., and Commerce Secretary Wilbur Ross. AP Photo/Pablo Martinez Monsivais\nOil markets have shown tremendous weakness in recent days, losing nearly seven dollars before rallying back a bit on Thursday.\nWhat's causing it? Market analysts have been struggling to find a single reason for it, preferring to cite a cocktail of negative news and rumor to explain the downdraft.\nThere have been reports of increased Saudi production to Asian customers, which many cite as a breaking of the dam of OPEC production guidelines - a break that would have many in the oil world in full panic mode.\nBut I don't see these promises as a collapse inside the cartel. The Asian contracts are merely adding stability to the oil markets in front of the threats of renewed U.S. sanctions on Iran. It's been made clear that the Iranians won't stand for any production increases that are over and above the agreed upon increases at their Vienna meeting last month - and equally clear that the Saudis don't want to put that production agreement in jeopardy either.\nMany analysts are pointing to the reopening of Libyan oil ports to explain the quick drop in oil prices.\nBut I also don't find this explanation very compelling either: Even with these newly cleared impasses, Libyan exports are only marginally increasing, and most experts believe that Libyan production will continue to slide downwards through the rest of 2018. Others have cited the threat of slowing oil demand from China, but these predictions of slowing Chinese growth are as frequent, and usually as wrong, as dandelions growing in an open field.\nI am a student of the financial players and their influence into oil prices, and generally look at the movement of speculative money in and out of the futures markets. But even here there hasn't been a discernible reason for oil's latest drop. According to the COT reports, long positions have actually held fairly steadily through this latest 7 dollar downdraft in oil.\nSo - WHAT IS IT? Despite the varied answers that are appearing in the media for oil's recent drop, I can find only one convincing reason that oil is recently acting poorly despite being one of the most fundamentally bullish oil markets I have seen in my 35 years trading it.","url":"https://www.businessinsider.com/trumps-trade-war-is-putting-the-oil-market-in-panic-mode-2018-7"}
