{"authors":["John J. Xenakis"],"date_download":"2018-10-30 19:44:48","date_modify":"2018-10-30 19:44:48","date_publish":"2018-07-19 13:47:39","description":"Contents: Trump administration signals that trade war with China will escalate sharply; The growing conflict with China | National Security","filename":"data/vaneerConsumption/TrumpAdministrationSignalsTradeWarwithChinaWillEscalateSharply.json","image_url":"https://media.breitbart.com/media/2018/06/china-xi-jinping-us-donald-trump-11-17-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_07_19__1540928688.html","title":"Trump Administration Signals Trade War with China Will Escalate Sharply","title_page":"Trump Administration Signals Trade War with China Will Escalate Sharply","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nTrump administration signals that trade war with China will escalate sharply\nThe growing conflict with China\nTrump administration signals that trade war with China will escalate sharply\nLarry Kudlow, during Wednesday morning interview (CNBC)\nMany people see the imposition of tariffs as temporary, and likely to end before any serious problems arise. However, Larry Kudlow, Trump’s chief economic adviser, was interviewed on CNBC for half an hour on Wednesday morning, and made it clear that the trade war with China is likely to become a lot more serious.\nKudlow said that deals with Germany and Mexico are coming. He said, “I can report without specifics that we’re making good progress [with trade negotiations] in Mexico.” However, negotiations with China are not progressing at all.\nKudlow listed the problems in trade with China (my transcription):\nA. The world trading system is broken. The World Trade Organization [WTO] is broken. We just had this discussion at the G7. B. The biggest culprit is China. And particularly since it entered the WTO, which was about the year 2000 as I recall. China has – they’re still labeled an undeveloped third world country – but at WTO that’s nonsense. Therefore they’re trying to use Most Favored Nation status to have high tariffs, high non-tariff barriers. … They do in fact steal our intellectual property left and right. They do in fact have a forced transfer of technology, from the American companies that operate there. It comes from the joint ventures. They do not allow full American ownership. You open a company on a joint venture basis, in a Chinese province. And because you only own 49%, they own 51% or more, the local party leaders, these are like Mafioso Dons, I’m told — you have to lay your entire blueprint on the table, including the technology, and they will have their experts take it over. That’s wrong.\nIn the past few weeks, I have seen several businessmen interviewed about opening up a business office in China, being forced to give copies of all their software and intellectual property to the Chinese government, and then having to go out of business because a Chinese business opened up right an office right across the street using the same intellectual property. The American company was simply swindled. And this happens all the time to American countries, as well as European and Canadian countries.\nKudlow said that the situation with China is so bad that he has been forced to change his own position on trade. He was in government as far back as the Reagan administration, and he has always been on record as opposing tariffs, but “I’ve come to this position, because the problem [with China] is getting worse.”\nThe shocking part of the interview is the description of how intransigent the Chinese are during the negotiations that have been going on for months. The interviewer (Jim Kramer) said that he had been assuming all along that there had been progress in the negotiations with China, with give and take on both sides, but Kudlow referred to the “so-called talks” as if they had been nothing more than a charade to the Chinese:\nI went to Beijing with our team, and then when China came to the US, I was involved in those discussions and a dinner, I sat next to Liu He [Xi Jinping’s top economic adviser], and his young assistants, And I think they’re sincere, so there’s hope. On the other hand, I do not think president Xi [Jinping] at the moment has any intention of following through on the discussions we’ve made, and I think the president [Trump] is so dissatisfied with China on these so-called talks, that he is keeping the pressure on, and I support that. … That stuff has to be fixed. We can’t let China steal our technology. Those are our family jewels. What is it that makes America the greatest economy in the world? It is our innovative and inventive use of technology advances. This is Schumpeter’s idea of creative destruction writ large. We can’t let them do that. They haven’t responded at all. Not one basis point to our request to do something about the theft of intellectual property, and the forced divestiture of our intellectual property.\nKudlow said, “By the way, the whole world agrees with us. I mean Europe agrees with us, Canada, everyone knows this is true.” He added that he has many sources in China, and even they agree.\nKudlow concluded by saying that Trump will not back down on this issue:\nNow, for POTUS – I’m going to defend him here, lock, stock and barrel. We’ve had Republican and Democratic presidents in the past, make these complaints to China, even take these complaints to the World Trade Organization. But they never follow through. They say it, nothing happens, life goes on, the situation gets worse. This guy, President Trump, has the biggest backbone – and this something I’ve admired for him in other places – he will not let go of this point. Nor, should he, in my opinion.\nAfter the interview, the interviewer Jim Kramer said that he found the interview shocking because the Chinese are refusing to make any compromises at all. He pointed to the recent case of the Chinese company ZTE where President Trump had gone to a great deal of trouble to keep the company from going bankrupt, based on a personal request by President Xi. Kramer said that Trump must be really furious to have gone to great lengths to do that, and got nothing in return from Xi. CNBC and Reuters\nThe growing conflict with China\nLarry Kudlow’s interview on Wednesday was well-planned and well thought out and laid out major policy objectives of the Trump administration. During the interview, there were often long pauses between sentences as he chose his words carefully. Kudlow could have simply made a general statement that the negotiations with China were on track and “we hope something will come out of them soon.”\nInstead, in coordination with the White House, he made a careful condemnation of China’s trade practices and negotiating attitudes. This was done on purpose, and it is a shot across the bow by the Trump administration at Xi Jinping and the Chinese Communist Party.\nWe live at a time in history where there has never been more hysterical nonsense in the media, and there has never been more total, abject ignorance about what is going on in the world.\nOne comment I have heard probably hundreds of times is: “How could Trump give Kim Jong-un prestige by meeting with him in Singapore, without getting a firm commitment in advance to denuclearize?” The question does not make sense. Demanding denuclearization in advance would have been refused. Trump is a master negotiator and deal-maker, and his assessment was that the only way to convince Kim to denuclearize in the future is to build up his prestige in the present and convince him that the U.S. is not an enemy.\nIt is worth noting here that, as I have been saying for many, many months, there is no possibility whatsoever that North Korea will denuclearize, now or in the future. But I am not going to criticize Trump for taking steps to try to prevent World War III, even if preventing World War III is impossible.\nA web site reader recently asked me:\nI have to wonder whether you’re serious or just pulling my leg. What possible benefit is the ad hoc Trumpist foreign policy to the U.S. or the world at large? We need leverage with the DPRK [North Korea], and the only leverage available is China. Trump’s solution: start at a trade war with them, and make it bitter.\nOnce again, this question makes no sense. The leverage we have against North Korea is the very harsh sanctions that Trump imposed on North Korea, with China’s cooperation. China’s cooperation was a huge foreign policy decision by China, requiring buy-in from many agencies in the Chinese Communist Party (CCP), based on deeply entrenched objectives that will not change because of this trade dispute. In addition, master negotiator Trump gained leverage over Xi by agreeing to his request to save ZTE.\nWhat I have seen repeatedly since Trump has been in office is that his foreign policy is completely consistent with the Generational Dynamics analyses that I have been posting for years – that we are headed for a world war with China, and Russia will be our ally and China’s enemy. Trump understands these analyses through Steve Bannon, who is an expert on both military history and Generational Dynamics. People who become hysterical because of a tweet or a press conference really have no clue what is going on in the world, but what I have seen is that Trump does – based on actions, not words.\nAs I said above, Trump is well aware that we are headed for a world war with China, and he is trying to prevent it. Preventing it is impossible, but I am not going to criticize Trump for trying.\nIn writing this article, I have described many bottom lines and many red lines. North Korea will not denuclearize. China will not back down from stealing America’s intellectual property. And Trump will not back down from the trade dispute. From the point of view of Generational Dynamics, we are in a typical tit for tat escalation sequence that leads to a generational crisis war. The only other choice is appeasement, and that will lead to war as well, possibly even more quickly. Trump is aware of all this, and he is trying to prevent it, but it is the world that is upside down and out of control. Bloomberg\nRelated Articles:\nKEYS: Generational Dynamics, Donald Trump, Larry Kudlow, China, Xi Jinping, World Trade Organization, WTO, Jim Kramer, North Korea, Kim Jong-un\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2018/07/19/world-view-trump-administration-signals-trade-war-with-china-will-escalate-sharply/"}
