{"authors":["Polina Ivanova","Andrey Kuzmin"],"date_download":"2018-10-30 22:46:34","date_modify":"2018-10-30 22:46:34","date_publish":"2018-07-30 00:00:00","description":"MMK, one of Russia's largest steel producers, has postponed the launch of a lucrative project in Turkey due to uncertainty created by global trade wars, Andrey Eremin, the company's director for economics, told Reuters in an interview.","filename":"data/vaneerConsumption/Trumpstradewarsinks2billioninvestmentforaRussiasMMK.json","image_url":"https://amp.businessinsider.com/images/5909dc61fcd8eb1b008b4831-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trumps-trade-war-sinks-2-billion-investment-for-a-russias-mmk-2018-7_1540939594.html","title":"Trump's trade war sinks $2 billion investment for a Russia's MMK","title_page":"    Trump's trade war sinks $2 billion investment for a Russia's MMK - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"China Photos/Getty Images\nMOSCOW (Reuters) - MMK, one of Russia's largest steel producers, has postponed the launch of a lucrative project in Turkey due to uncertainty created by global trade wars, Andrey Eremin, the company's director for economics, told Reuters in an interview.\nThe project - the re-launch of hot-rolled steel production at its Turkish site - was expected to add between $90 million and $100 million to MMK's core earnings, Eremin said, but a sudden surge in global trade barriers caught the company off guard, forcing it to delay.\n\"We had completely restored equipment at the plant to working condition, had figured out all the contracts for supplying energy and raw materials,\" Eremin said.\n\"Unfortunately, we made this decision before the U.S. introduced tariffs against metallurgical companies. We did not know that this would happen.\"\nThe MMK Metalurji complex, located near Iskanderun on Turkey's Mediterranean coast and in Istanbul, was built by MMK between 2007 and 2010, at a cost of over $2 billion.\nHot-rolled steel production at the site was put on hold in 2012 amid a global slump in steel prices, but was due to restart this summer as the market recovered.\nNow MMK has put the re-launch on hold, and plans to decide its fate in November, when the dust has settled on a wave of protectionist measures introduced by the United States and Europe in recent months.\n\"We hope that by that point, the transformation on global markets will have ended and there will be clarity,\" Eremin said.\nU.S. President Donald Trump imposed tariffs of 25 percent on steel and 10 percent on aluminum in March in a move mainly aimed at curbing imports from China.\nLast week, the European Union introduced a quota and tariff policy in response, fearing the impact on its own producers of a surge of steel imports following Trump's decision. [nL8N1UE1VF]\nMMK is not affected directly by these measures as it does not export steel to the U.S. and EU markets, but 30 percent of production at its Turkish plant was intended for the European market and neighboring countries.\nIran sanctions also bite\nPresident Donald Trump holds up a memorandum that reinstates sanctions on Iran after he announced his decision to withdraw the United States from the 2015 Iran nuclear deal. Chip Somodevilla/Getty\nTariffs are not the only Trump policy to affect MMK's strategy. The steelmaker has also stopped deliveries to Iran, Eremin said, against the backdrop of new sanctions Washington has promised to impose on Tehran.\nThe U.S. measures, announced soon after Trump pulled out of an international nuclear deal negotiated by his predecessor Barack Obama, are due to kick in next month and include a ban on the sale, supply and transfer to or from Iran of raw or semi-finished metals.\nAlthough the Kremlin opposes the move and says that unilateral U.S. actions against a third country should not affect how Russia does business, steel traders told Reuters earlier this month that Russian metals firms were cutting back on sales to Iran for fear, at least in part, of falling foul of the sanctions. [nL8N1UD343]\nMMK, which previously shipped hot-rolled steel coils to Iran along with its Russian competitor Severstal, was not affected by the move, Eremin said, as it had already redirected deliveries to other markets.\nThis was the result of Iran's growing domestic production and consequent reduction in the volume of its imports.\n\"Even before the introduction of sanctions, deliveries were insignificant,\" Eremin said. \"We even cleared out the port warehouses where stocks were intended for delivery in that direction, and sold off supplies,\" he said.\nDowngrading demand\nFILE PHOTO: Steel bars for sale are displayed at a shop in the Mullae-dong steel product district in Seoul Thomson Reuters\nIn terms of the Russian domestic steel market, MMK has halved its forecast of growth in demand this year, from 4 to 2 percent, Eremin said.\n\"Last year, demand for steel products in our range grew around 6.5 percent in Russia,\" he said.\n\"This year, the pace has slowed, and we assess it to be around 2 percent this year, despite the fact that just recently we expected growth to be at 4 percent,\" Eremin said.\nMMK changed its forecast following the government's proposal to raise value-added tax (VAT), from 18 percent to 20 percent. [nL8N1TG2JU]\n\"In essence, VAT may increase. We believe that this could slow down the pace of growth in demand for steel in Russia,\" Eremin said.","url":"https://www.businessinsider.com/trumps-trade-war-sinks-2-billion-investment-for-a-russias-mmk-2018-7"}
