{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:31:49","date_modify":"2018-10-30 19:31:49","date_publish":"2018-07-11 15:43:55","description":"President Trump thanked a reporter for asking French President Emmanuel Macron about Russian influence on Germany through a gas pipeline.","filename":"data/vaneerConsumption/TrumpGladforQuestiontoMacrononMerkelandRussiaatNATO.json","image_url":"https://media.breitbart.com/media/2018/07/Macron-Trump.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_11__1540927909.html","title":"Trump ‘Glad’ for Question to Macron on Merkel and Russia at NATO","title_page":"Trump ‘Glad’ for Question to Macron on Merkel and Russia at NATO","title_rss":"NULL","source_domain":"breitbart.com","text":"President Donald J. Trump thanked a reporter for asking French President Emmanuel Macron following a Trump-Macron meeting at the NATO summit about Russian influence on Germany through a gas pipeline.\nTrump and Macron sat next to each other for a press availability just after the two held a pull-aside meeting at the NATO summit in Brussels, Belgium, on Wednesday.\nPresident Trump lauded his “friend” President Macron in his remarks to the press, touting Macron for doing a “terrific job” as President “changing a lot of things around, and I guess that had to happen.”\n“I think it’s going to be very successful,” said Trump who heralded a “tremendous relationship” between himself and Macron. Macron and his wife visited the White House recently for the first state visit of the Trump administration. President Trump and First Lady Melania Trump had previously been hosted by the Macrons in France.\nTrump said his meeting with Macron involved discussion of trade, NATO, and “a lot of different things, and hopefully, in the end, it’ll all work out.”\nThe two had a firm handshake and then Macron gave remarks on the meeting in French. Trump said the remarks in French sounded beautiful, then joked, “I have no idea.”\nMacron seemed amused then gave his remarks in English, “I just reminded everybody that almost one year ago you were present with your wife in Paris for Bastille Day.”\n“We have worked together for 12 months now. And took some great decisions … and we will continue to work together,” said Macron as he gave a belly laugh.\nOne reporter asked Macron if he believed German Chancellor “Angela Merkel is beholden to the Russians?” Trump said he was “glad” the reporter asked Macron the question. Macron laughed in response to the question and seemed to sidestep it by saying, “No, I think we just discuss a little…we work together,” as he gestured toward President Trump.\nThe reporter’s question came in light of comments Trump made to NATO Secretary General Jens Stoltenberg in a breakfast meeting that morning, strongly criticizing Germany for sending money to Russia for a gas pipeline to Germany, the Nord Stream 2 gas pipeline from Russia to Europe. Trump called it inappropriate given, “we’re supposed to be guarding against Russia.”\nTrump had referred to former German Chancellor Gerhard Schröder, who now sits on the board of Nord Stream 2, in his meeting with Stoltenberg, “The former Chancellor of Germany is the head of the pipeline company that’s supplying the gas… Germany is totally controlled by Russia — they will be getting 60-70 per cent of their energy and a new pipeline… I think it’s not [appropriate] and it’s a very bad thing for NATO…. I think we have to talk to Germany about that. And by the way, Germany is just paying a bit over one per cent, whereas the United States is paying in actual numbers 4.2 per cent of actual GDP [towards defence].”\nPresident Trump had met with German Chancellor Merkel just before the meeting with Macron and told reporters that he did discuss the pipeline with Merkel.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/europe/2018/07/11/trump-glad-reporter-question-macron-on-merkel-russia-nato-meeting/"}
