{"authors":["Nikki Schwab","U.S. Political Reporter For Dailymail.Com"],"date_download":"2018-10-23 05:51:02","date_modify":"2018-10-23 05:51:02","date_publish":"2017-04-26 17:07:23","description":"President Trump traveled to the Department of the Interior to sign an executive order jump-starting a review of national monuments designated by presidents using the Antiquities Act.","filename":"data/vaneerConsumption/Trumpopensupwayformonumentstoloseprotections.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/02/3F9BAC1100000578-0-image-a-31_1493170732605.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448224_Trump-opens-way-monuments-lose-protections_1540273862.html","title":"Trump opens up way for monuments to lose protections","title_page":"Trump opens up way for monuments to lose protections | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"On Wednesday, President Trump traveled to the Department of the Interior to sign an executive order jump-starting a review of national monuments designated by presidents using the Antiquities Act over the past 20 years.\n'The Antiquities Act does not give the federal government unlimited power to lock up millions of acres of land and water and it's time we ended this abusive practice,' Trump said, calling them a 'massive federal land grab.'\nThe president took particular aim at his predecessor, President Obama, who he said 'bypassed the states' to put 265 million acres of land under federal control 'through the abuse of the monuments designation.'\n'That's larger than the entire state of Texas,' Trump pointed out to make his point.\nTrump and other proponents of the order argue that today's monuments take up too much acreage, and their single purpose, unilaterally decided on by the president, bans drilling, farming and other money-making opportunities and thus stymies local jobs.\nPresident Trump appeared at the Department of the Interior to sign an executive order that jump-starts a review of national monuments designations over the last 20 years\nOn Wednesday, President Trump (center) came to the Interior Department to sign an executive order that instructs Secretary Ryan Zinke (left) to review national monument designations\nOH DEER: Environmentalists are concerned that President Trump's (pictured) order could open the lands back up to industry - and pollution\nPresident Trump signed the executive order surrounded by a number of lawmakers and governors who want to see the land under more local control\nPresident Trump (center) acknowledged Utah Sen. Orrin Hatch (right, with white hair) as Secretary Zinke will look into President Obama's designation of Bears Ears in Utah, which was controversial in the state\nInterior Secretary Ryan Zinke (left) appeared at the White House Tuesday to give specifics on an executive order President Trump (right) will sign Wednesday initiating a review of national monuments\nThe oldest national monument that the review will focus on is the 1996 designation of Grand Staircase-Escalante in Utah\nThe most recent national monument that Interior Secretary Ryan Zinke will look at is Bears Ears in Utah, designated a national monument by President Obama in 2016\nThe executive order instructs the secretary of the interior to look at national monuments larger than 100,00 acres, which have been designated over the past 20 years\n'I can tell you from a kid who grew up in Montana, who grew up in the West where much of these monuments have taken place, today's executive order and the review of the Antiquities Act over the past few decades is long overdue,' Interior Secretary Ryan Zinke told reporters Tuesday at the White House.\nEnvironmentalists, on the other hand, see the executive order as a slippery slope, which could open public lands up to industry – and pollution.\n'America's parks and public lands are not in need of corporate restructuring,' Sierra Club's executive director Michael Brune said in a statement.\nBrune argued that 'protected outdoor spaces drive the outdoor recreation economy which supports 7.6 million jobs and generates $887 billion in consumer spending each year.'\n'It appears this executive order is the start of an all-out assault on America's national monuments and Teddy Roosevelt's conservation legacy,' Aaron Weiss, Media Director at the Center for Western Priorities, said in an email to ThinkProgress.\nRoosevelt was the president behind the Antiquities Act and named Devils Tower, of Close Encounters of the Third Kind fame, the country's first national monument in 1906.\nDifferent from national parks, national monuments can be created from any federal land at the president's discretion.\nThe review green-lit by the executive order will go back to President Clinton naming Utah's Grand Staircase-Escalante a national monument in 1996, to President Obama doing the same for Bears Ears in Utah last year.\nZinke will have 120 days to let Trump know 'if a monument should be rescinded, resized [or] modified in order to better manage our federal land,' the interior secretary explained.\nA preliminary review will be due after the first 45 days.\nThe Interior Secretary will only be looking at monuments bigger than 100,000 acres with the White House releasing a list of 24 that will be studied.\nThe executive order's existence was first reported by Axios on Monday as Trump signs a slew of orders as his administration marks 100 days, which will happen on Saturday.\nAt the White House Tuesday, Zinke was already pushing back against liberal detractors, arguing that the executive order had a very limited scope.\n'Here's what the executive order does not do,' he told reporters in the briefing room Tuesday. 'Executive order does not strip any monument of a designation. The executive order does not loosen any environmental or conservation regulation on any land or marine areas.'\nZinke also tried to assuage environmentalists' fears by saying things like 'I'm a Teddy Roosevelt guy' and 'no one loves our public lands more than I.'\n'You can love them as much, but you can't love them more than I do and that's one of the reasons why I love my job,' Zinke said.\nBut he noted that the Antiquities Act even said that the monument should be the 'smallest area compatible' with what the government was trying to preserve, noting that the recent trend has been for monuments to be larger and larger.\nNATIONAL MONUMENTS INCLUDED IN THE REVIEW Grand Staircase-Escalante, Utah Grand Canyon-Parashant, Arizona Giant Sequoia, California Hanford Reach, Washington Canyons of the Ancients, Colorado Ironwood Forest, Arizona Vermilion Cliffs, Arizona Carrizo Plain, California Papahanaumokuakea Marine, Hawaii\nSonoran Desert, Arizona Upper Missouri River Breaks, Montana World War II Valor in the Pacific, California, Hawaii, Alaska Marianas Trench, Northern Mariana Islands, Guam Pacific Remote Islands, Pacific Ocean Rose Atoll, American Samoa Rio Grande del Norte, New Mexico Organ Mountains-Desert Peaks, New Mexico Basin and Range, Nevada Berryessa Snow Mountain, California Mojave Trails, California Sand to Snow, California Northeast Canyons & Seamounts, Massachusetts Gold Butte, Nevada Bears Ears, Utah\nAs a White House fact sheet put it, 'the average size of monuments has exploded in recent decades.'\nTrump made the same point during his presentation at the Department of the Interior.\n'And it's gotten worse and worse and worse and we're going to free it up,' the president boasted.\nZinke also pointed out that before lands were designated as national monuments, they were still public lands, and thus could serve more purposes, including farming, ranching, timber harvest, mining, oil and gas exploration, fishing and motorized sports.\n'I am opposed to transfer or sale of public lands,' he stated, though added, 'We can do a lot better as a government managing our land and to a degree we have drifted too far away from multiple use to single use.'\nBeing a 'national monument' was the single use Zinke was referring to.\n'The administration, as ya'll know, has heard from members of Congress and states, and in some cases the designation of the monument has resulted in loss of jobs, reduced wages and reduced public access,' Zinke also argued.\nThe monument considered to be most at risk was one Obama designated in 2016, Bears Ears national monument in Utah, which includes 1.35 million acres and many sacred Native American sites.\nDespite years of communication between the administration, elected officials and local stakeholders, including a coalition of 30 Native American tribes, some Utah politicians are still grumbling about it.\n'In December of last year alone the federal government asserted this power over 1.35 million acres of land in Utah known as Bears Ears,' Trump said.\n'I've heard a lot about Bears Ears. And I hear it's beautiful,' the president continued, though argued it became a national monument 'over the profound objections of the citizens of Utah.'\nBoth the president and Zinke argued that the signing of this executive order fulfilled a Trump campaign promise, as it would give locals more control.\n'We're putting the states back in charge,' Trump said Wednesday.\nZinke laid it out more eloquently.\n'I think the concern I have and the president has is when you designate a monument, the local community that's affected should have a voice and he said that in the campaign,' the interior secretary said.\nZinke followed up by saying the executive order doesn't 'predispose any action.'\n'I'm going to review them in a transparent manner, I'm going to make sure we have a voice,' Zinke said.","url":"https://www.dailymail.co.uk/news/article-4448224/Trump-opens-way-monuments-lose-protections.html"}
