{"authors":["Akin Oyedele"],"date_download":"2018-10-30 23:12:01","date_modify":"2018-10-30 23:12:01","date_publish":"2018-07-20 00:00:00","description":"President Donald Trump tweeted about the Federal Reserve a day after CNBC first reported that he was \"not thrilled\" the Fed was raising borrowing costs as the economy improved.","filename":"data/vaneerConsumption/TrumpsaysFedtighteninghurtsaccusesChinaofcurrencymanipulation.json","image_url":"https://amp.businessinsider.com/images/5b4f826ec1ab53e8018b46d2-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trump-tweets-fed-tightening-hurts-china-eu-currency-manipulation-2018-7_1540941121.html","title":"Trump says Fed tightening hurts, accuses China of currency manipulation","title_page":"    Trump says Fed tightening hurts, accuses China of currency manipulation - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"President Donald Trump. Olivier Douliery-Pool/Getty Images\nPresident Donald Trump on Friday said monetary-policy tightening \"hurts all that we have done,\" suggesting a belief that higher borrowing costs undermine the economy's gains.\nHis tweet came a day after he told CNBC that he was \"not thrilled\" the Federal Reserve was raising borrowing costs as the economy improved.\nThe Fed has raised interest rates seven times since December 2015 and has penciled in two more rate hikes for this year. Fed officials have stressed that they will continue to raise borrowing costs only if the economy keeps improving.\n\"The United States should not be penalized because we are doing so well,\" Trump tweeted. \"Tightening now hurts all that we have done. The U.S. should be allowed to recapture what was lost due to illegal currency manipulation and BAD Trade Deals. Debt coming due & we are raising rates - Really?\"\nTrump has previously described himself as a \"low-interest-rate person,\" and so his comments are not new. Still, they break with the long-standing tradition of US presidents withholding comments on Fed policy to preserve the central bank's independence from political pressure.\nIn a Marketplace interview earlier in July, Fed Chairman Jerome Powell said the Trump administration's tax cuts and fiscal-policy stimulus were likely to improve the economy for several years. The Fed, however, could raise interest rates if it finds the economy to be overheating.\nTrump also tweeted that the European Union and China were manipulating their currencies lower, creating an uneven playing field with the US.\n\"China, the European Union and others have been manipulating their currencies and interest rates lower, while the U.S. is raising rates while the dollars gets stronger and stronger with each passing day - taking away our big competitive edge,\" Trump said. \"As usual, not a level playing field...\"\nUnlike most other currencies that float freely, China's central bank intervenes to keep the currency in a trading range.\nThe Chinese yuan hit its lowest level in over a year on Friday, as its central bank indicated it was willing to tolerate a weaker currency. A weaker currency would make it cheaper for the country to sell its products to buyers with US dollars, which would be handy as the two nations impose tariffs on each other's goods.\nThe US dollar index, which measures the greenback against a basket of other developed-nation currencies, fell after Trump tweeted, by as much as 0.6% to 94.59.","url":"https://www.businessinsider.com/trump-tweets-fed-tightening-hurts-china-eu-currency-manipulation-2018-7"}
