{"authors":["Morgan Brinlee"],"date_download":"2018-10-31 01:39:45","date_modify":"2018-10-31 01:39:45","date_publish":"2018-08-31 12:47:02","description":"Amid reports he was struggling to share the spotlight with Sen. John McCain, whose body will be laid to rest Sunday following four days of memorial services, President Donald Trump dismissed claims he hadn't properly honored McCain following the…","filename":"data/vaneerConsumption/TrumpsResponseToMcCainsDeathIncludedEverythingThatTheyRequestedHeSays.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/31/a31e0488-d3f1-4776-a41e-bcaabd103649-getty-1025079996.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_trumps-response-to-mccains-death-included-everything-that-they-requested-he-says-11467607_1540949985.html","title":"Trump's Response To McCain's Death Included \"Everything That They Requested,\" He Says","title_page":"Trump's Response To McCain's Death Included \"Everything That They Requested,\" He Says","title_rss":"NULL","source_domain":"bustle.com","text":"Amid reports he was struggling to share the spotlight with Sen. John McCain, whose body will be laid to rest Sunday following four days of memorial services, President Donald Trump dismissed claims he hadn't properly honored McCain following the late Arizona senator's death. Trump's initial response to McCain's death included tweeted condolences to the late senator's family but failed to touch on his military career or long history of public service.\n\"No, I don't think I did at all,\" Trump recently told Bloomberg News when asked if he'd missed an opportunity to use McCain's death to unite the country. \"I've done everything that they requested and no, I don't think I have at all.\"\nMcCain died Saturday at the age of 81 following a nearly year-long battle with brain cancer. According to The Washington Post, Trump refused to release a proposed White House statement praising McCain's life and service, choosing instead to tweet condolences to the Arizona senator's family. The president was also heavily criticized for ordering White House flags to be returned to full staff the day after McCain died, despite previous administrations keeping flags lowered from the day of the death to the day of the burial for other senators who died in office.\nWhile Trump pushed back on claims he'd not properly honored McCain in a recent interview with Bloomberg News, the president didn't shy away from admitting he'd clashed with the lawmaker. \"We had our disagreements and they were very strong disagreements,\" Trump said of McCain. \"I disagreed with many of the things that I assume he believed in.\"\nTrump and McCain were known to have a strained and sometimes combative relationship, often disagreeing on policy issues. In 2015, Trump publicly disparaged McCain's military service after the senator criticized his immigration rhetoric. The two would continue to clash throughout the 2016 presidential campaign and well into Trump's presidency, with the president often responding to the Arizona senator's criticisms by attacking the senator over Twitter. In 2017, McCain further frustrated Trump when he cast the vote that officially killed his efforts to repeal Obamacare.\nAccording to Bloomberg, Trump was asked to reflect on McCain's life and legacy of public service at least four times in the days immediately following the senator's death. Each time he refused. In his interview with Bloomberg News on Thursday, Trump also refused to comment on whether he thought McCain, who ran against President Barack Obama in the 2008 presidential election, would have made a better commander in chief.\n\"I don't want to comment on it,\" he said. \"I have a very strong opinion, all right.\"\nAlthough heavy public criticism and requests from veterans groups spurred Trump to order flags at the White House be returned to half staff in honor of McCain on Monday, many of the late senator's friends have expressed frustration with the president's initial response. \"The way he's handled the passing of John was disturbing,\" Sen. Lindsey Graham, one of McCain's closest friends in Congress, told CBS News' This Morning on Thursday.\nGraham, however, acknowledged the president's attempts to honor McCain via a statement released Monday in which Trump expressed \"respect\" for McCain's service, telling This Morning the president \"finally got it right.\"","url":"https://www.bustle.com/p/trumps-response-to-mccains-death-included-everything-that-they-requested-he-says-11467607"}
