{"authors":["Linette Lopez"],"date_download":"2018-10-30 23:52:36","date_modify":"2018-10-30 23:52:36","date_publish":"2016-12-05 00:00:00","description":"China hasn't been purposely devaluing its currency; the market has been doing it for them. The Chinese economy has been slowing down since 2014.","filename":"data/vaneerConsumption/TrumpsChinaranthadonetruthand2lies.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trumps-china-rant-had-1-truth-and-2-lies-2016-12_1540943556.html","title":"Trump's China rant had one truth and 2 lies","title_page":"    Trump's China rant correct on South China Sea, false on trade - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"AP Photo/Mark J. Terrill On Sunday night, President-elect Donald Trump went on a mini-rant about China and its relationship with the US.\nIn it, he made three statements. One of them was true. Two of them were not.\nI'm calling them lies, but I'll admit that it's never never clear whether Trump knows he's not telling the truth or just doesn't have his facts straight. So you can call them whatever you want.\nHere's what he said on Twitter:\n\"Did China ask us if it was OK to devalue their currency (making it hard for our companies to compete), heavily tax our products going into their country (the U.S. doesn't tax them) or to build a massive military complex in the middle of the South China Sea? I don't think so!\"\nSo he's accusing China of purposely depressing the value of its currency, the yuan — which has fallen by a whopping 5% in the past six months — and putting heavy taxes on US goods entering the country while the US does not tax its imports from China.\nPretty much all of that is untrue.\nThe bit about the South China Sea buildup, though, is very real. And it's a reason the Obama administration started its \"pivot to Asia\" policy to build a bigger US presence in the region. It's also part of the reason officials argued for the all-but-dead Trans-Pacific Partnership trade deal.\nThey saw it as a way of cementing US soft power with China's neighbors.\nFalling yuan\nLet's break down Trump's untruths first. China hasn't been purposely devaluing its currency: The market has been doing that all by itself.\nThe Chinese economy has been slowing down at a very steady clip since 2014. That is because the government is trying to guide the economy through a difficult transition from one based on manufacturing and exports to one based on the service sector and domestic consumption. To do that, though, a country needs a strong currency.\nSo right now, it's not in China's best interest to watch its currency fall. When it does, people take their money out of the country, making the situation worse. The government has been spending capital trying to slow the yuan's decline. And it has responded to outflows by tightening capital controls. Doing so has prevented China from selling down foreign-exchange reserves at a rate of $100 billion a month, according to analysis by Societe Generale.\nAgain, not an ideal situation, especially for a country that is struggling with trillions in debt in its banking in corporate sectors.\nThese outflows are a scary situation for China — one a stronger yuan would help to mitigate. Societe Generale\nTrump's assertion that the US doesn't slap tariffs on Chinese goods is also incorrect. According to CBS News, Chinese products entering the US are subject to tariffs of 2.5% to 2.9% — but that's not even the whole story. The US has retaliated against China on numerous fronts in terms of trade. I'll give you one example.\nFor years the US steel industry has been concerned over Chinese steel flooding the market, depressing prices around the world. The US, in turn, slapped tariffs of 500% on Chinese steel. It has also filed 11 suits against China with the World Trade Organization since President Barack Obama took office.\nThe results of this policy have been mixed. Manufacturers who buy US steel now worry that prices are getting too high too fast.\nAnd then there's the truth\nIt is true that China has been building out islands in the South China Sea and placing military structures on them.\nFrom Business Insider senior correspondent Amanda Macias:\n\"In August, the Asia Maritime Transparency Initiative (AMTI), a unit of the Center for Strategic and International Studies, published satellite imagery of several unidentified hexagonal structures on Fiery Cross, Subi, and Mischief reefs.\n\"'I'm afraid we still don't know for sure what the structures are, beyond saying that they appear defensive in nature,' Gregory Poling, director of AMTI, told Business Insider about the hexagonal designs.\"\nChina has claimed veritable dominion over the waters in the South China Sea, one of the world's busiest waterways for trade. A few months ago the Permanent Court of Arbitration invalidated Beijing's vast territorial claims over the water after the Philippines filed a suit against the country.\nSo Trump was one-for-three — not exactly the best score for the future US president. And again, it's unclear whether Trump knows the Chinese economy has changed recently or if he's trying to distract from his breach of protocol.\nOn Friday, Trump took a 10-minute telephone call with Taiwanese President Tsai Ing-wen— a violation of a multidecade silence between the US and Taiwan.\nChina considers Taiwan a part of its country under what is known as the One China Policy. As such, Chinese diplomats have filed a formal complaint over Trump's phone call.\nFor more on Trump, China, and trade wars, listen to Business Insider's Linette Lopez and Josh Barro on their podcast, \"Hard Pass\":","url":"https://www.businessinsider.com/trumps-china-rant-had-1-truth-and-2-lies-2016-12"}
