{"authors":[],"date_download":"2018-10-30 01:15:30","date_modify":"2018-10-30 01:15:30","date_publish":"2016-08-10 01:00:22","description":null,"filename":"data/vaneerConsumption/TruthIstheBestPropaganda.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/08/Reservists-on-Duty-YT-Screen.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862130.html","title":"Truth Is the Best Propaganda","title_page":"Truth Is the Best PropagandaThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"“Outrage is the power that motivated me,” declared Israeli Major Amit Deri, in a recent conversation with the Haym Salomon Center. Deri is founder of Reservists on Duty (RoD), an Israeli, non-governmental grassroots organization of over 700 reserve officers and soldiers including 150 company commanders, many of whom led Lebanon and Gaza military operations.\nCommitted to defeating the propaganda war against Israel, Reservists on Duty began as a response to Breaking the Silence (BtS), which smears the Israel Defense Forces with specious accusations of “war crimes.” BtS is a fringe Israeli NGO masquerading as a watchdog group, claiming to monitor the IDF for “human rights abuses,” but manipulating the facts to fit its predetermined conclusions and political positions.\nBtS bases its sweeping accusations on anonymous, anecdotal, and unverifiable information elicited from young soldiers discharged from active duty after their mandatory tour of service in the IDF.\nBtS activists (former soldiers) approach these 19 to 20 year-olds, urging them to share the traumatic experiences of war. “It’s a cynical way to ‘use’ the young soldiers, manipulating them into believing that talking with BtS is the same as talking with your military buddies, sharing mutual experiences.” When a soldier, after repeated harassment, finally agrees to chat with them, BtS brings recording equipment.\nBtS uses only snippets of extensive conversations woven together in videos or reports as “testimonies” for distribution in Israel and around the world. The group adds inflammatory and misleading headlines describing violence against Palestinians by soldiers as “official IDF operational policy.” A recent review by Israel Channel 10 reveals that BtS claims are largely baseless or invented.\nOver the past three years, BtS has disseminated its lies worldwide in more than 80 lectures, exhibitions and other events to audiences in churches, parliaments, and universities. On American college campuses, they spread disinformation to impressionable, ill-informed students, many of whom have been propagandized by faculty and organizations like Students for Justice in Palestine (SJP) into thinking that Israel is the world’s worst human rights violator.\nBtS’s allegations seem persuasive simply because they come from Israelis who served in the military. Audiences don’t know that BtS receives funding from organizations and government agencies that pay for incriminating statements regarding Israel. BtS receives over $1 million annually — provided by almost every western European government, the EU and private donors, all of whom support the Palestinian narrative against the Jewish State. Money allows BtS to buy influence completely disproportionate to its size. In contrast, Deri says, Reservists on Duty doesn’t seek financial support from any government to avoid becoming a political tool.\n“It’s easy to spread lies if you have money,” explained Deri. He calls BtS’s effort to smear the IDF by accusing it of indiscriminate killing of civilians “the most sophisticated blood libel of the 21st century.” RoD counters the distortions and lies with first-hand knowledge of the circumstances. BtS’s most galling lie, says Deri, is its indictment of soldiers who fought and died in Gaza protecting innocent civilians.\nThe Reservists’ Israeli “awareness” campaign has proved successful. In 2014, notes Deri, BtS taped over 100 conversations with soldiers. That dropped to 30 in 2015 and 0 in the first 6 months of 2016. “Today most combat soldiers understand BtS intentions and motivations. The Israeli public has now woken up to what is happening.”\nBtS defamation against Israel is not limited to the IDF. In June, on a tour BtS conducts for foreigners in Judea/Samaria, its founder was caught on video falsely accusing Israelis of poisoning Palestinian wells. This version of a 14th century blood libel was echoed by PA president Mahmoud Abbas before the European Parliament, but subsequently retracted. BtS never retracted its accusation.\nBreaking the Silence focuses much of its attention abroad in tandem with the worldwide BDS (boycott, divestment, sanctions) campaign whose mission is to manipulate public opinion with the goal, according to Omar Barghouti, a founder of BDS, of eliminating the Jewish state.\nReservists on Duty is going on the offensive on U.S. college campuses to expose the anti-Semitic nature of the BDS movement. “We want to talk about the bad guys,” explains Deri, to unmask the human rights violations perpetrated by the Palestinian Authority and Hamas and expose the fabrications of BtS and the efforts of BDS and SJP to promote Israel’s destruction. Deri says they will not hesitate to discuss the killing of gays by Hamas, the Palestinian subjugation of women, or the racism and anti-Semitism inherent within Palestinian society. Deri hopes college students will realize that Israel is the only genuinely moral actor in a tough neighborhood.\nColonel Richard Kemp, a former commander of the British Army in Afghanistan, says, “The IDF did more to safeguard the rights of civilians in a combat zone than any other army in the history of warfare.… No army in the world acts with as much discretion and great care as the IDF in order to minimize (civilian) damage.”\nReservists on Duty knows Col. Kemp is right when he says that Israeli soldiers risk their own lives to protect civilian populations. They’ve lived by this axiom and friends have died committed to it. They can tell the story of the IDF and of Israel in a unique and powerful way. And the truth is the best propaganda.","url":"https://spectator.org/truth-is-the-best-propaganda-against-israels-enemies/"}
