{"authors":[],"date_download":"2018-10-30 20:31:12","date_modify":"2018-10-30 20:31:12","date_publish":"2015-03-16 19:08:05","description":"The once hated I-85 toll lane is quickly becoming a victim of its own success. So many people are riding in it nowadays that state officials had to think creatively about how free up the flow or else risk raising the toll to ever higher amounts to keep traffic moving.","filename":"data/vaneerConsumption/TrytransitandearntollcreditsonI85.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/03/02/Images/photos.medleyphoto.6854069.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_transportation_try-transit-and-earn-toll-credits__1540931472.html","title":"Try transit and earn toll credits on I-85","title_page":"Try transit and earn toll credits on I-85","title_rss":"NULL","source_domain":"ajc.com","text":"The once hated I-85 toll lane is quickly becoming a victim of its own success.\nSo many people are riding in it nowadays that state officials had to think creatively about how free up the flow or else risk raising the toll to ever higher amounts to keep traffic moving. Now, I-85 Express Lanes drivers who are willing to try transit could earn up to $60 in toll credits.\nThe pilot program allows commuters in northeast metro Atlanta to earn $2 in toll credits per transit trip, up to $10 a month or a maximum of $60 over a six-month period.\n“With more commuters using the I-85 Express Lanes every day, we are providing even more reasons for our customers to give transit a try and reduce the number of cars on I-85 during peak rush hour periods,” said Christopher Tomlinson, executive director of the State Road and Tollway Authority (SRTA), in a press release Monday. “By letting someone else do the driving, commuters can save money, put less wear-and-tear on their personal vehicles and relax, study or get some work done ahead of schedule.”\nThe Express Lanes were so rarely used when they opened in October 2011 that the state had to drastically cut the rate during off-peak times from a dime to a penny a mile. But usage of the lanes has more than tripled since that first month of operation. There are now more than 23,000 trips on average per day.\nState transportation officials want to keep traffic in the lanes flowing at 45 mph or greater so that it remains a predictable alternative to the usual rush hour snarl. To that end, toll rates rise and fall in connection with the amount of traffic in the Express Lanes.\nThe toll credits are one of three new programs being introduced to offset the higher costs of tolls driven by continued high usage of the I-85 Express Lanes.\nSRTA has also reached out to hundreds of drivers who use the I-85 Express Lanes frequently during rush hour and offered them toll credits for shifting their commute earlier or later. This spring, SRTA will announce additional incentives for new carpoolers in the I-85 corridor.\nEight express commuter transit routes travel the I-85 Express Lanes and are eligible for the toll credit program. An Xpress pass or Breeze card must be used to pay the fare on these routes:\n410 Sugarloaf Mills to Lindbergh MARTA Station\n411 Hamilton Mill/Mall of Georgia to Midtown\n412 Sugarloaf Mills to Midtown\n413 Hamilton Mill to downtown Atlanta\n416 Dacula to downtown Atlanta\nGCT 101 I-985/Ga. 20 Park and Ride to downtown Atlanta\nGCT 102 I-85 Indian Trial Park and Ride to downtown Atlanta\nGCT 103 I-85/Sugarloaf Mills Park and Ride to downtown Atlanta (Zone 2)\nTo participate in the program, commuters must have a Peach Pass tied to a personal toll account and an Xpress Pass or a MARTA Breeze card. Visit the Peach Pass website to sign up.\nCustomers with a Pay n GO! Peach Pass must convert to a personal toll account to be eligible to participate.","url":"https://www.ajc.com/news/transportation/try-transit-and-earn-toll-credits/jDjlW92182xk0dnImfxyRI/"}
