{"authors":[],"date_download":"2018-10-30 01:22:34","date_modify":"2018-10-30 01:22:34","date_publish":"2016-06-27 02:00:52","description":null,"filename":"data/vaneerConsumption/TsComplaintBureau.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/06/1024px-Manhattan_view_from_Empire_State_Building.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862554.html","title":"T’s Complaint Bureau","title_page":"T’s Complaint BureauThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Our so-called independent, so-called press is reporting that T had a bad week. If they only knew the half of it. We have no money, our polls are slipping in 39 states, and we’re locked in serial pissing matches with rinky-dink GOP officials from the last century. Sad.\nI drew the short straw and had weekend duty at the Sob Desk. If we had an org chart — we don’t need one because, T tells us, he keeps it in his head — it would be called the Office of Intergovernmental Affairs or something higherfalutin’ than the Sob Desk. We use it for GOP pantywaists just big enough that we can’t tell them to bug off but not big enough to grant them an audience with T himself. Basically, these guys come in and bitch — T is dragging them down in the polls, T is drying up their money, T is setting their supporters at one another’s throats. The full whine-o-rama.\nWe’ve got our act polished by now. An assistant greets the whiner — an assistant built to T’s specs, of course, with the long legs and the boobs high and tight — and seats him in the conference room facing the window. It’s a ten-billion-dollar view of midtown Manhattan, the kind of old-movie scene where the older guy says to the younger guy, “Someday, Chuck, this could all be yours.” T says that a lot, but he doesn’t need another guy. He talks to himself.\nWe give the whiner thirty seconds to take in the view and the appointments around the room. It’s like the Cabinet Room, only upscale. T doesn’t believe in subliminal. He wants the room to scream, “Hey, Tiny, big people have been here before you — honestly, people much bigger than you. And they don’t come here bringing piss-ant complaints, either. They bring gold, frankincense, myrrh, huge amounts of myrrh.” The room is so loud you can hardly hear yourself think.\nAt the thirty-second mark, a second assistant enters from a side door, another high-fartin’ filly. She asks the whiner if he’d prefer Sumatran or Colombian. I’ve heard grown men — governors, famous guys — respond, “C-C-Colombian, please.” As T would say, we’ve now conditioned the prospect.\nThe first guy up this morning is Senator No Account, a first-termer from the third-largest city in a state with a handful of, I mean, single-digit electoral votes. He gives me the full whine. I nod agreeably, frown where indicated, take notes on what I’m pretending is the most incisive political analysis since Mark Hanna. Okay, I’m filling out a lunch order for the intern, but, trust me, I’m giving good empathy.\nFinally, with his outrage tank running on fumes, No Account pops the question: can T make a joint hometown appearance with him over the July 4th weekend? Right. An appearance in the third-largest city of a state we’re going to win in a landslide. I’ll make sure we ink that in — right after we schedule that rally in downtown Kabul. What I say to No Account is, “I’ll take this up with Mister T as soon as he finishes with the prime minister and be back to you no later than tomorrow afternoon.” No Account nods with satisfaction, having just shown me who’s boss.\nT will never learn of this conversation, of course. If he heard even a whisper, he’d be tweeting that No Account is a dickhead before those sensible senatorial shoes, now floating on the magic escalator, hit the lobby floor.\nBut I did have one question for the Senator myself, left, with uncharacteristic restraint, unasked. How could he have spent six years — with a good salary, a bottomless expense account, and a large personal staff — and not made enough of an impression on his small state to peek out from the shadow of T? More to the point, why did he welsh on every promise he made to the people who voted for him the first time? What a dickhead.","url":"https://spectator.org/ts-complaint-bureau/"}
