{"authors":["Sophie Williams For Mailonline"],"date_download":"2018-10-23 03:16:48","date_modify":"2018-10-23 03:16:48","date_publish":"2017-03-10 12:46:14","description":"A clothing website has been criticised after it was found selling T-shirts with offensive slogans such as 'Save a dog, eat a Chinese'. Many people have written their complaints on the website.","filename":"data/vaneerConsumption/Tshirtssoldbyonlineretailersparkracismconcerns.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22B28100000578-0-image-a-2_1489149886920.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300680_T-shirts-sold-online-retailer-spark-racism-concerns_1540264608.html","title":"T-shirts sold by online retailer spark racism concerns","title_page":"T-shirts sold by online retailer spark racism concerns | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"There has been backlash online after a clothing website sold T-shirts with slogans that internet users say are offensive to Chinese people.\nPeople have criticised the T-shirts on Spreadshirt's website for being racist. It seems the goods have been taken down from the German, Australian and American sites but are still onsale in the UK.\nSlogans such as 'Save a dog, Eat a Chinese' and 'Save a shark, Eat a Chinese' are for sale on T-shirts on the site.\nUnhappy customers: Slogans such as 'Save a dog, Eat a Chinese' are for sale on the website\nThe clothing is for sale on Spreadshirt, a site where you can custom make tshirts\nPrices of the clothing on the company's UK site range from £16 for a T-shirt to £34 for a hoodie.\nThe T-shirts were brought into the spotlight by website yomyomf.com. The site aims to explore issues surrounding Asian communities.\nThey called for people to contact the website and take to social media to complain about the offensive slogans.\nAccording to Spreadshirt, the website is a 'creative platform for custom T-shirts and custom clothing. It allows people to design their own images and words and put them onto various products.\nMany people offended by the T-shirts have taken to social media to explain why the T-shirts are inappropriate.\nThe slogans on several T-shirts have caused outrage online for their stereotypical elements\nOffensive slogan: Many people have gone to the company's Facebook page to complain\nSam Liu wrote on the company's Facebook page:' I respect your concept of business however I have to express my regret and anger after seeing designs with the phrase 'Save a Shark, Eat a Chinese'. To me it is not funny. I feel being stereotyped and offended.'\nWhile Rik Teng commented: 'In this day and age when you can make money AND provide positive messages for young and old people worldwide, you'd rather resort to sleazy, racist jokes to attract the attention of slap-happy biggots.'\nViki Yamashita also said: 'Hi Spreadshirt. I just saw an incredibly racist shirt, two actually, that you made targeting Chinese. Shame on you. The images are being shared on social media. I hope you realize what a big mistake that was to make such tacky racist jokes.'\nAccording to CRI, shark fin consumption has decreased in China by around 70 percent. Imports of shark fin dropped from 4,774 tonnes to less than 20 tonnes per year between 2004 and 2014.\nEating dog meat is an occurance in China with festivals such as the Yulin Dog Meat festival held every year. Photos of the festival have been shared around the world with big charities working to stop these types of events happening.\nHowever 2016 research by the Humane Society International shows that around 70 percent of people in China have never tried dog meat.\nPhilip Rooke, CEO of Spreadshirt told MailOnline: 'Two community-submitted designs on the Spreadshirt platform, ‘Save a shark Eat a Chinese’ and ‘Save a dog Eat a Chinese’, have been discussed.\n'After close examination and careful consideration, we have decided to keep these designs on our platform.\nSpreadshirt’s role is to enable our community’s ideas to get to market and to fulfill them with print-on-demand. We do not judge or censor designs based on their phrasing, social, or political leanings.\nThis open platform principle will mean that, in a few cases, some people may find a design controversial while others do not.\nWe have no intention of causing anyone offense, and I apologize to anyone who takes any offense from the two designs in question.'\nBizarre slogan: The clothing items are for sale on the company's English website","url":"https://www.dailymail.co.uk/news/article-4300680/T-shirts-sold-online-retailer-spark-racism-concerns.html"}
