{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:07:29","date_modify":"2018-10-22 23:07:29","date_publish":"2017-04-26 06:49:23","description":"Tucker Carlson has come close to matching Bill O'Reilly's ratings on his first night replacing the Fox News host - while also managing to beat him in a key demographic.","filename":"data/vaneerConsumption/TuckerCarlsonalmostmatchesOReillysratingsondebut.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F9C6FC100000578-0-image-a-88_1493185413529.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446414_Tucker-Carlson-matches-O-Reilly-s-ratings-debut_1540249649.html","title":"Tucker Carlson almost matches O'Reilly's ratings on debut","title_page":"Tucker Carlson almost matches O'Reilly's ratings on debut | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tucker Carlson has fitted right into his new role on Fox News, almost matching Bill O'Reilly's rating with his first 8pm show.\nCarlson, who took over from the long-time host who was ousted last week amid a sexual harassment scandal, pulled in an average of 3.2million viewers across the hour on Monday night.\nVariety provided further detail on the 47-year-old's opening outing at his new timeslot, stating more than 630,000 of his audience was in the 25 to 54 age bracket - a key demographic for the program.\nThe breakdown showed Carlson was about 10 per cent off O'Reilly's final average of 3.6million on April 11, but his increased pull over O'Reilly in the aforementioned demographic would be music to 21 Century Fox executives.\nTucker Carlson has fitted right into his new role on Fox News, almost matching Bill O'Reilly's rating with his first 8pm show\nAnd while he couldn't surpass the ghost of O'Reilly and his ratings, Carlson proved to be significantly more popular than those he was competing with in the time-slot on Monday night.\nAccording to Variety, the Fox show was the top program across cable news, with CNN's Anderson Cooper 360 and MSNBC's All In With Chris Hayes 1million and 1.5million, respectively.\nThe ratings reveal came after Carlson paid tribute to O'Reilly in his opening segment on Monday night.\nHe told the audience he had watched 'The O'Reilly Factor' for years, before saying: 'For those of you tuning in expecting to see someone different in this anchor chair I know the feeling well.'\nO'Reilly's final show on April 11 out-rated Carlson overall, but he was beaten in the crucial 25 to 54 demographic by his replacement\nCarlson's 8pm debut on Monday night featured a lengthy interview with Caitlyn Jenner, who appeared on the show to promote her new memoir\nCarlson then described the controversial ex-anchor as prepared and tough, saying that he 'crisply and directly expressed his views'.\n'What O'Reilly did was not easy. He set a high bar, and I'm going to do my best to meet it. Thanks for sticking with us,' he finished before launching into his show for the night.\nMeanwhile, O'Reilly was returning to the airwaves for the first to since he was given the flick from Fox.\nThe veteran television personality took to his podcast to address his high profile departure.\nA woman is seen walking past signs showing Bill O'Reilly and Tucker Carlson outside News Corp's headquarters in New York City on April 19. O'Reilly's poster has since been taken down\nA protestor from the National Organization for Women of New York is seen holding a sign during a demonstration outside the News Corporation Headquarters in New York on April 20\n'I am sad that I'm not on television anymore. I was very surprised how it all turned out. I can’t say a lot, because there’s much stuff going on right now,' he said in the podcast.\n'But I can tell you that I'm very confident the truth will come out, and when it does, I don’t know if you're going to be surprised - but I think you're going to be shaken, as I am. There’s a lot of stuff involved here.'\nO'Reilly continued: 'Now, I can’t say anymore because I just don’t want to influence the flow of the information.\n'I don’t want the media to take what I say and misconstrue it.\n'However you, as a loyal O’Reilly listener, have a right to know, I think, down the lane what exactly happened. And we are working in that direction, okay?'\nO'Reilly, who had worked at Fox News since 1996 and enjoyed enormous success as the hot-tempered anchor of commentary show The O'Reilly Factor, was given a $25 million golden parachute when he was let go.\nHis departure came little more than two weeks after the New York Times revealed he and Fox News had paid out around $13 million to quash a series of sexual harassment suits.","url":"https://www.dailymail.co.uk/news/article-4446414/Tucker-Carlson-matches-O-Reilly-s-ratings-debut.html"}
