{"authors":[],"date_download":"2018-10-22 23:04:15","date_modify":"2018-10-22 23:04:15","date_publish":"2014-05-13 14:56:58","description":"Tumblr founder David Karp isn't impressed with how Apple and Facebook push an \"engineer's mentality\" that he says restricts users' creativity.","filename":"data/vaneerConsumption/TumblrFounderCallsOutFacebookAppleforCrushingCreativity.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/438961/140513-bizcom-david-karp-jsw-1101a_6a50955e9df60f3d2c6a5ffa559b5d55.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_social-media_tumblr-founder-calls-out-facebook-apple-crushing-creativity-n104186_1540249455.html","title":"Tumblr Founder Calls Out Facebook, Apple for Crushing Creativity","title_page":"Tumblr Founder Calls Out Facebook, Apple for Crushing Creativity","title_rss":"NULL","source_domain":"nbcnews.com","text":"Tumblr focuses on \"empowering creators,\" Karp said; that is, the company \"puts the tools out into the world ... but we don't really prescribe how to use them.\" (Tumblr lets bloggers post video, photo, gifs and other forms of content.)\nBigger tech companies have lost that spirit, he said.\n\"Even Apple today isn't obsessed with the creative community,\" Karp said.\nBut his sharpest words went to Facebook, after Levy asked Karp if he thinks \"Facebook's spirit constrains\" users. He lamented Facebook's stark white update pages and Facebook-owned Instagram's square photo setup, as well as Vine's six-second videos.\nThose constraints are part of an \"engineer's mentality\" in Silicon Valley that makes lovely clean websites, but restricts users' ability to create, he said.\nKarp discussed the fall of MySpace, which offered an overwhelming number of customization options for its users' pages.\n\"A lot of the industry went the other way .. they said, 'let's abolish everything, let's give everyone the same beige page,'\" Karp said.\nKarp reserved kinder words for his new overlord: Yahoo, which acquired Tumblr last year for $1.1 billion.\nKarp stressed that Tumblr's operations remain independent from Yahoo -- \"we have our own team and our own office\" -- and that Yahoo hasn't censored what his team is able to do. After all, he said, Yahoo CEO Marissa Mayer and the other company honchos have a lot to do at Yahoo itself.\n\"Tumblr is a small, small part of what the leadership team at Yahoo is focusing on today,\" he said.","url":"https://www.nbcnews.com/tech/social-media/tumblr-founder-calls-out-facebook-apple-crushing-creativity-n104186"}
