{"authors":["Mary Chastain"],"date_download":"2018-10-30 17:55:59","date_modify":"2018-10-30 17:55:59","date_publish":"2015-03-26 16:42:19","description":"Despite ISIS's takeover of Tataouine, the Star Wars movie sets are safe, says Tunisia.","filename":"data/vaneerConsumption/TunisiaDespiteISISTakeoverofStarWarsInspiredTownMovieSetsSafe.json","image_url":"https://media.breitbart.com/media/2015/03/isis-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_26__1540922159.html","title":"Tunisia: Despite ISIS Takeover of Star Wars-Inspired Town, Movie Sets Safe","title_page":"Tunisia: Despite ISIS Takeover of Star Wars-Inspired Town, Movie Sets Safe | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Islamic State (ISIS/IS) has taken over at least parts of the Tunisian town of Tataouine, with over 4,000 jihadists currently housed there. The government of Tunisia insists, however, that the town’s most recognizable pop culture institution remains safe from jihadist destruction.\nDoes the name Tataouine sound familiar? It inspired the name of Luke Skywalker’s home planet of Tatooine in Star Wars. Luke’s mentor Obi-Wan Kenobi was apparently correct when he said that Luke “will never find a more wretched hive of scum and villainy,” as the Islamic State uses the town as a stop for terrorists entering and exiting Libya.\nHowever, the Tunisian government reminded fans the actual Star Wars sets are in Tozeur, which is 204 miles west of Tataouine. The sets are safe from terrorism and radical Islamic groups. Tozeur’s tourism ministry claims terrorists are not near the set, and National Guard Colonel Mokhtar Hammami told the Associated Press “he had 1,500 men patrolling the area.”\nISIS houses over 4,000 militants in Tataouine. Authorities discovered “two arms caches” in the area, “one of which included rocket-propelled grenade launchers and more than 20,000 rounds of ammunition.” They believe the weapons came from former dictator Ghadafi’s armory.\nEven though Star Wars took place on the other side of the country, Tataouine is very similar to how Tatooine is portrayed in the movies. Officials know people use the area to smuggle contraband into the country from Libya, which is only 60 miles from Tataouine.\nAfter ISIS killed 23 tourists in Tunis, the government issued warnings over travel and tourism. Tunisia relies on tourism to thrive. Over 400,000 Brits visit the country, mainly “in the sea-side resorts” along the Mediterranean Sea and the island of Djerba. It took many years for the country to grab those numbers following “a terror attack on a synagogue on the island in 2002 in which 21 people were killed.”","url":"https://www.breitbart.com/national-security/2015/03/26/tunisia-despite-isis-takeover-of-star-wars-inspired-town-movie-sets-safe/"}
