{"authors":["John Hayward"],"date_download":"2018-10-30 17:55:52","date_modify":"2018-10-30 17:55:52","date_publish":"2015-03-23 02:12:30","description":"Tunisia has arrested over 20 suspected militants in the wake of the deadly Bardo Museum attack, about half of them directly involved.","filename":"data/vaneerConsumption/TunisiaArrestsover20SuspectedMilitantsFollowingMuseumAttack.json","image_url":"https://media.breitbart.com/media/2015/03/police-Tunisia-museum-attack-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_22__1540922152.html","title":"Tunisia Arrests over 20 Suspected Militants Following Museum Attack","title_page":"Tunisia Arrests over 20 Suspected Militants Following Museum Attack | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Reuters reports that the Tunisian government has arrested over 20 suspected militants in the wake of the deadly Bardo Museum attack, about half of them directly involved in planning and executing the massacre, which killed twenty foreign tourists and three Tunisians.\nThe other arrests are part of a general crackdown against extremists following the deadliest incident of terrorism in that nation in over a decade, directly targeting the tourist industry upon which Tunisia’s economy relies.\nBoth ISIS and al-Qaeda groups have claimed responsibility for the attack.\n“Whoever was responsible, the Bardo attack illustrates how Islamist militants are turning their attention to North Africa, especially in neighbouring Libya where two rival governments battle for control allowing Islamic State to gain a foothold,” writes Reuters. “The United States is increasingly worried about the growing presence of Islamic State militants in Libya.”\nThe Tunisian government also released closed-circuit TV footage of the attack over the weekend, in an effort to help identify a third suspect who helped slain terrorists Yassine Laabidi and Hatem Khachnaoui perpetrate the attack.\n“The minute-long video shows the men, holding machine guns, moving around the marble halls, showing no sign of tension, minutes after they opened fire on tourist buses outside the museum entrance,” writes the UK Guardian. “The men, one in a red hat and tracksuit bottoms, the other with a baseball cap and jacket, are seen bumping into a third man with a backpack walking down the stairs. After acknowledging him, the gunmen allow him to walk free. It is unclear if this is a lucky escape, or evidence of the third suspect that police are hunting.”\nA candlelight mass attended by hundreds of Tunisians was held for the victims of the museum rampage at the cathedral in Tunis on Saturday, and the government has announced plans for a march next Sunday patterned after the Charlie Hebdo march in Paris, with leaders from around the world invited to attend. “It is likely the invites will be directed primarily at leaders of states whose citizens were killed or injured in the attack,” reports the Guardian.","url":"https://www.breitbart.com/national-security/2015/03/22/tunisia-arrests-over-20-suspected-militants-following-museum-attack/"}
