{"authors":[],"date_download":"2018-10-30 20:06:58","date_modify":"2018-10-30 20:06:58","date_publish":"2016-05-03 12:03:26","description":"Afeni Shakur-Davis, the mother of legendary rapper Tupac Shakur and a part-time Atlantan, died Monday night in California.","filename":"data/vaneerConsumption/TupacShakursmotheraparttimeAtlantandeadat69.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/05/03/Images/photos.medleyphoto.9618080.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_tupac-shakur-mother-part-time-atlantan-dead__1540930018.html","title":"Tupac Shakur’s mother, a part-time Atlantan, dead at 69","title_page":"Mom of rapper Tupac Shakur has died; was part-time Atlantan","title_rss":"NULL","source_domain":"ajc.com","text":"Afeni Shakur-Davis, the mother of legendary rapper Tupac Shakur and a part-time Atlantan, died Monday night in California.\nShe was 69, according to the Marin County Sheriff’s Office, the agency that confirmed Shakur-Davis’ death.\nAbout 9:34 p.m., deputies responded to a report of possible cardiac arrest at Shakur-Davis’ home in Sausalito, the sheriff’s office said. She was taken to a local hospital, where she died at 10:28 p.m.\nThe sheriff’s coroner’s office will lead the investigation to determine the exact cause and manner of Shakur-Davis’ death.\nShakur-Davis, who was the subject of one of Tupac’s biggest songs, 1995’s “Dear Mama,” vowed to keep her son’s memory alive after his death. On Sept. 7, 1996, Tupac was leaving a boxing event in Las Vegas when he was shot multiple times. He died six days later. He was 25.\nHis killing remains unsolved.\nBefore his death, Tupac found success not just as a rapper, but also in film. He starred in “Poetic Justice,” the John Singleton-directed movie co-starring Janet Jackson. He also made appearances on television shows like “A Different World,” “The Cosby Show” spinoff that influenced untold numbers of students who later attended and graduated from historically black colleges and universities.\nIn 2005, Shakur-Davis opened the Tupac Amaru Shakur Foundation Center for the Arts on Memorial Drive in DeKalb County, an institution she hoped would include a performing arts theater, museum, art gallery, community meeting space and classrooms.\nShe decided to open the arts center in DeKalb because Tupac bought his first home in the metro area, The Atlanta Journal-Constitution reported in 2005.\nIn 2014, Shakur-Davis co-produced “Holler If Ya Hear Me,” a Broadway musical named after one of the rapper’s 1993 hits. Tony Award winner and Clark Atlanta University graduate Kenny Leon directed the production, which was based on Tupac’s work.\nA movie about Tupac’s life, “All Eyez on Me,” is set for release in November. Shakur-Davis served as an executive producer for the movie, which was filmed in Atlanta.\nSign the online guestbook for Afeni Shakur-Davis\n— Information from The Atlanta Journal-Constitution’s archives was used in this article.","url":"https://www.ajc.com/news/local/tupac-shakur-mother-part-time-atlantan-dead/1SpBz0IJvpNiFZMpaOgXxO/"}
