{"authors":[],"date_download":"2018-10-30 20:08:36","date_modify":"2018-10-30 20:08:36","date_publish":"2016-05-03 12:49:52","description":"Afeni Shakur-Davis opened the Tupac Amaru Shakur Foundation Center for the Arts in DeKalb County","filename":"data/vaneerConsumption/TupacShakursmomdiesEstablishedpeacegardenartgallery.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_atlanta-remember_9de99a5bc55409752db99912fde7d8dd__1540930116.html","title":"Tupac Shakur's mom dies; Established peace garden, art gallery","title_page":"Tupac Shakur's mom dies; Established peace garden, art gallery","title_rss":"NULL","source_domain":"ajc.com","text":"Atlantans are remembering the mother of late rapper Tupac Shakur, after news that the part-time Atlanta resident Afeni Shakur has died.\nRELATED: Afeni Shakur wanted Tupac's collection to stay in Atlanta\nIn 2005, Shakur opened the Tupac Amaru Shakur Foundation Center for the Arts on Memorial Drive in DeKalb County, an institution she hoped would include a performing arts theater, museum, art gallery, community meeting space and classrooms. The center has since closed and is not open to the public\nShakur said at the time she wanted an arts center in DeKalb County because her son bought his first home here, The Atlanta Journal-Constitution reported in 2005.\nThe center originally included lifesize bronze statue of Tupac Shakur, a garden called the Tranquility Path, lined with tulips, pansies, crocus and other flowers. Commemorative bricks, including those bought by the Marshall Mathers Foundation and Clark Atlanta University, were paved into the peace garden. The center also included a bronze plaque of words written by Tupac Shakur. The plaque is called \"Untitled\" and says:\nPlease wake me when I'm free\nI cannot bear captivity\nwhere my culture I'm told holds no significance\nI'll wither and die in ignorance.\nBut my inner eye can c a race\nwho reigned as kings in another place\nthe green trees were rich and full\nand every man spoke of beautiful\nmen and women together as equals.\nWar was gone because all was peaceful\nBut now like a nightmare I wake 2 c\nThat I live like a prisoner of poverty\nPlease wake me when I'm free\nI cannot bear captivity\n4 I would rather be stricken blind\nthan 2 live without expression of mind.\nShare your memories and condolences with friends and family of Afeni Shakur in our online guestbook\nThis article has been udpated to correct the current status of the art center.\nRELATED\nKenny Leon reflects on working with Tupac's mom on Broadway\nKenny Leon prepares to 'Holler' with Tupac Shakur on Broadway\nTupac Shakur papers go to Emory University in Atlanta\nAUC makes Tupac papers available online","url":"https://www.ajc.com/news/local/atlanta-remembers-art-center-peace-garden-established-tupac-shakur-mom/XLo24jsD41dM0QtVvnmYQN/"}
