{"authors":[],"date_download":"2018-10-30 20:10:10","date_modify":"2018-10-30 20:10:10","date_publish":"2016-05-03 00:00:00","description":"Tupac Shakur's lasting legacy","filename":"data/vaneerConsumption/TupacShakurslastinglegacy.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/05/03/Images/photos.medleyphoto.9618595.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_music_tupac-shakur-lasting-legacy__1540930210.html","title":"Tupac Shakur's lasting legacy","title_page":"Tupac Shakur's lasting legacy","title_rss":"NULL","source_domain":"ajc.com","text":"1 / 16\nBlair Griffiths from Toronto Canada is looking at a picture and records of Tupac Shakur's at the Tupac Shakur Center for the Arts. He came with his wife to volunteer for the grand opening. June 17, 2005 (Renee' Hannans Henry/Staff).\n2 / 16\nSTONE MOUNTAIN, GA - A bronze plaque of words written by Tupac at the Tupac Amaru Shakur Center for the Arts in Stone Mountain. (RICHARD HALICKS / AJC staff)\n3 / 16\nCommemorative bricks, including those bought by the Marshall Mathers Foundation and Clark Atlanta University, are paved into the \"Peace Garden\" at the Tupac Amaru Shakur Center for the Arts in Stone Mountain. (RICHARD HALICKS / AJC staff)\n4 / 16\nRichard Halicks / rhalicks@ajc.com The Tranquility Path, lined with tulips, pansies, crocus and other flowers, in the \"Peace Garden\" at the Tupac Amaru Shakur Center for the Arts in Stone Mountain. (RICHARD HALICKS / AJC staff)\n5 / 16\nRichard Halicks / rhalicks@ajc.com Lifesize bronze statue of Tupac Shakur presides over the \"Peace Garden\" at the Tupac Amaru Shakur Center for the Arts in Stone Mountain. (RICHARD HALICKS / AJC staff)\n6 / 16\nEli Reed Shakur starred as a postal worker in \"Poetic Justice\" with Janet Jackson in 1993. He received positive reviews for the role.\n7 / 16\nDanny Clinch In his 25 years, Tupac Shakur became a voice for the inner city -- and also stirred up controversy over his lyrics and some of his actions. By the time of his shooting on Sept. 13, 1996, he had created a legacy that remains strong 15 years later.\n8 / 16\nAP In 1993, Shakur was charged with sexually assaulting a woman in a hotel room. He denied the charges. He was sentenced in November 2004 to 1 1/2 to 4 1/2 years in prison, of which he served 11 months.\n9 / 16\nRichard Halicks / rhalicks@ajc.com The Tranquility Path, lined with tulips, pansies, crocus and other flowers, in the \"Peace Garden\" at the Tupac Amaru Shakur Center for the Arts in Stone Mountain. (RICHARD HALICKS / AJC staff)\n10 / 16\nAP The day before his verdict in the sexual assault case was supposed to be read in November 1994, Shakur was shot five times and robbed. He reportedly left the hospital that day after surgery.\n11 / 16\nAP Shakur got in hot water over the years for his lyrics, which some said were profane and offensive to women. Here, C. DeLores Tucker of the National Political Congress of Black Women holds a copy of the cover of \"Makaveli\" during a Washington news conference Tuesday, Dec. 10, 1996, to discuss gangsta rap music.\n12 / 16\nAP Shakur spoke at a voter registration rally with fellow rapper Snoop Dogg in South Central Los Angeles on August 15, 1996. Less than a month later, he was shot and killed while he was in Las Vegas with Death Row Records chairman Marion \"Suge\" Knight.\n13 / 16\nNicola Goode Shakur starred with Tim Roth in 1997's \"Gridlock'd,\" a film about drug addicts.\n14 / 16\nGlenn Watson In his last film role, Shakur played a detective caught covering up a killing with James Belushi in 1997's \"Gang Related.\"\n15 / 16\nAJC Shakur's mother Afeni helped dedicate the Tupac Amaru Shakur Center for the Arts in Stone Mountain in 1997. The center provides arts training for young people.\n16 / 16","url":"https://www.ajc.com/entertainment/music/tupac-shakur-lasting-legacy/gWIB2UyqfE7YBZjqh3mW3K/"}
