{"authors":["Colin Dwyer"],"date_download":"2018-10-22 21:42:41","date_modify":"2018-10-22 21:42:41","date_publish":"2018-09-05 00:00:00","description":"India's currency hit an all-time low, not long after currencies in Turkey and Argentina slid to their own record lows. But one major reason why is not to be found in emerging markets at all.","filename":"data/vaneerConsumption/TurbulenceRoilsEmergingMarketsInTheShadowOfAStrengthenedUSDollar.json","image_url":"https://media.npr.org/assets/img/2018/09/05/gettyimages-1026776374_wide-25279787f2de996702219344917bdf629e29fb85.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_09_05_644973465_turbulence-roils-emerging-markets-in-the-shadow-of-a-strengthened-u-s-dollar_1540244561.html","title":"Turbulence Roils Emerging Markets In The Shadow Of A Strengthened U.S. Dollar","title_page":"Turbulence Roils Emerging Markets In The Shadow Of A Strengthened U.S. Dollar : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Turbulence Roils Emerging Markets In The Shadow Of A Strengthened U.S. Dollar\nEnlarge this image toggle caption Amir Makar/AFP/Getty Images Amir Makar/AFP/Getty Images\nIf you've checked any economic news lately, there's a decent chance you've heard a pretty scary word, and there's a decent chance you've heard it a lot: contagion.\nTo be clear, economists have not been discussing an epidemic the past few weeks — at least, not the kind that directly concerns physical health. They're talking about the economic health of emerging markets around the world. And the diagnosis doesn't look great.\nMany of those countries' currencies have nosedived, but the blame isn't entirely local — many of them have been weakened by rising U.S. interest rates.\nThe value of India's currency, the rupee, plunged to an all-time low against the U.S. dollar Wednesday. By the end of the day, a single dollar could buy more than 71 rupees, capping what has been a months-long slide for Asia's third-largest economy.\nBut India can take small solace in the fact it's far from alone in its currency woes. Turkey's lira, Argentina's peso and Indonesia's rupiah have all slid to historic depths in the past month, while South Africa's rand has taken a steep dive of its own.\nGlobal economist Eswar Prasad puts it bluntly.\n\"Emerging market currencies are taking a beating across the board,\" says Prasad, who teaches at Cornell University and serves as a senior fellow at the Brookings Institution. \"There are some particularly vulnerable emerging market economies, such as Argentina and Turkey, that seem to have caused international investors to look at all emerging markets. And when they've looked, they've seen some fragilities.\"\nThose perceived weak points can be as various as the countries that bear them.\nIn Turkey, for instance, strongman President Recep Tayyip Erdogan has incurred market-watchers' doubts by vowing not to raise interest rates — the widely accepted remedy for the high inflation rate the country's grappling with now. It doesn't help that Turkey is also embroiled in a diplomatic spat with the U.S. involving tariff hikes and sanctions.\nAnd Argentina, to take another example, inadvertently prompted investors' panic last week by requesting the early release of a $50 billion loan from the International Monetary Fund, citing — apparently unironically — the desire to \"eliminate any uncertainty.\"\nBut one major source of their recent currency troubles has come not from these countries at all. It rests in Washington, D.C.\nThe Federal Reserve has raised its key interest rate twice already this year on the strength of a steady economy. And those rate increases have helped cause \"investors around the world to rethink the proposition of taking risks by investing in emerging markets in order to get higher yield,\" Prasad says.\nThose higher rates have also simultaneously helped bolster the value of the U.S. dollar and make loan repayment pricier for any country that has borrowed in dollars. That's really bad news for countries such as Turkey and Argentina, which have taken on lots of such debt in recent years.\n\"You've got a whammy: higher interest rates and a higher dollar making it harder to pay back,\" says Joseph Gagnon, a senior fellow at the Peterson Institute for International Economics. And that scares investors, he says, \"because they look at these countries and say, 'Oh, now the burden of the debt they had borrowed is higher. That raises the risk of default. That makes me worry that maybe I should get out now.' \"\nGagnon, who has served as a senior official at the Fed and in the Treasury Department, points out the value of a country's central bank getting to set its own monetary policies — and the dangers when it can't.\n\"When Argentina borrows in dollars, they have no control over those interest rates,\" he explains. \"They aren't set by the Argentine central bank for the Argentine economy; they're set by the U.S. central bank for the U.S. economy. So it may not be appropriate for Argentina.\"\nSo Argentina's central bank may find that even drastic measures — such as the one it undertook by raising its own benchmark lending rate to 60 percent last week — have less effect than it might prefer.\nBut even if a country did not do much of its borrowing in dollars, it still risks getting stained with the same brush.\nAsk India or South Africa: Both countries have stumbled into some of the same economic troubles as their emerging market peers, despite largely avoiding similar missteps in borrowing.\n\"The fact that a couple of emerging markets are beginning to face significant trouble has caused investors to look at emerging markets across the board, and they are seeing vulnerabilities in many of them,\" Prasad says. \"The sense of concern about the rest of the world is beginning to spread.\"\nSpread — in other words, much like a contagion. Sensing weakness in some economies, investors may flee others or simply sell their investments in mutual funds that contain both.\nBut unlike some contagions, Gagnon does not expect this one to spread too far into other emerging markets.\n\"So many emerging markets are in better shape than they were 20 years ago. It's got to make a difference, I have to believe it,\" he says. \"You know, maybe I'll be wrong — but I don't think so.\"","url":"https://www.npr.org/2018/09/05/644973465/turbulence-roils-emerging-markets-in-the-shadow-of-a-strengthened-u-s-dollar"}
