{"authors":[],"date_download":"2018-10-22 22:17:25","date_modify":"2018-10-22 22:17:25","date_publish":"2014-06-08 21:36:01","description":"A computer program tricked 33 percent of people into thinking it was a 13-year-old boy — making it the first to pass the Turing Test.","filename":"data/vaneerConsumption/TuringTestComputerProgramConvincesJudgesItsHuman.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/82716/131223-alan-turing-vmed-908p_36a4fa8cadd9af757ebabb88189cfc85.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_tech-news_turing-test-computer-program-convinces-judges-its-human-n125786_1540246645.html","title":"Turing Test: Computer Program Convinces Judges It's Human","title_page":"Turing Test: Computer Program Convinces Judges It's Human","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nJudges in England were fooled into thinking the computer program they were conversing with was a human on Saturday — making it the first to pass the 65-year-old Turing Test.\n\"Eugene Goostman\" is not a 13-year-old boy, but 33 percent of the people who partook in five minute keyboard conversations with the computer program at the Royal Society in London thought it was, according to The University of Reading, which organized the test.\nThe Turing Test is based on “the father of modern computer science” Alan Turing’s question, “Can Machines Think?”\nIf a computer is mistaken for a human by more than 30 percent of judges, it passes the test, but no computer has accomplished the feat — until now.\n“We didn't expect to break the barrier of the 30 percent, let alone the 33,” John Denning, the project’s director, told NBC News. “We came close before but we didn't really expect it to happen.”\n“Eugene” was created in Saint Petersburg, Russia, by software development engineer Vladimir Veselov and software engineer Eugene Demchenko, according to the University of Reading. The computer program was tested along with four others during Saturday night’s event, but was the only one to thoroughly imitate a person.\n“Our whole team is very excited with this result,” Veselov said. “Going forward we plan to make Eugene smarter and continue working on improving what we refer to as 'conversation logic.’”\nDenning said part of “Eugene’s” success was that, although the test was done in English, the program’s conversation-style was written by non-native English speakers, who were forced to analyze the language and recognize its nuances.\nMachines that can become as smart — or smarter — than humans raise concerns of dire economic consequences and diabolical robotic plots fit for science fiction movies.\nBut Kevin Warwick, a visiting professor at the University of Reading, says a computer that can think and act like a person will be an asset to battling cyber-crime. “Online, real-time communication of this type can influence an individual human in such a way that they are fooled into believing something is true ... when in fact it is not,\" he said.\nWarwick pointed out that this weekend's test is also controversial because some claim it has been passed before, but the test did not pre-specify the topics of conversations and was independently verified. “We are therefore proud to declare that Alan Turing's test was passed for the first time on Saturday,” Warwick said.\n“The event is particularly poignant as it took place on the 60th anniversary of Turing's death, nearly six months after he was given a posthumous royal pardon,” the university’s statement said.\nTuring was instrumental in cracking Germany's Enigma code during World War II and came up with the concept of a “universal machine” that could act and think like a human.","url":"https://www.nbcnews.com/tech/tech-news/turing-test-computer-program-convinces-judges-its-human-n125786"}
