{"authors":["Frances Martel"],"date_download":"2018-10-30 20:32:55","date_modify":"2018-10-30 20:32:55","date_publish":"2015-12-08 03:21:24","description":"A Russian soldier crossed Istanbul's Bosporus aboard a warship waving around a surface-to-air missile launcher.","filename":"data/vaneerConsumption/TurkeySummonsEnvoyoverRussianRocketLauncherStunt.json","image_url":"https://media.breitbart.com/media/2015/12/russia-guided-missile-ship-in-bosporus-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_12_07__1540931575.html","title":"Turkey Summons Envoy over Russian Rocket Launcher Stunt","title_page":"Turkey Summons Envoy over Russian Rocket Launcher Stunt","title_rss":"NULL","source_domain":"breitbart.com","text":"A Russian soldier crossed Istanbul’s Bosporus aboard a warship, waving around a surface-to-air missile launcher, an action the Turkish government condemned and has branded “provocative.”\nThe open wielding of a weapon in civilian Turkish territory by a Russian soldier is being interpreted by Turkey as an escalation in tensions that erupted when the Turkish government shot down a Russian warship, which had entered Turkish airspace and had ignored ten messages calling for it to identify itself and turn away.\nThe Turkish government summoned the Russian ambassador to express its discontent with the action. “For a Russian soldier to display a rocket launcher or something similar while passing on a Russian warship is a provocation,” Foreign Minister Mevlut Cavusoglu said of the incident, warning that Turkey is committed to issuing “the necessary response” to any perceived Russian threat.\nThe ship in question, the Caesar Kunikov, was passing through the Bosporus, the only channel available to ships coming from the Black Sea. Images published through various media outlets showed the soldier in question clearly wielding the rocket launcher, though the Russian government has provided no explanation for why such behavior would be necessary.\nIt is believed the ship was traveling to reinforce the Russian military presence in Syria. President Vladimir Putin ordered the beginning of an airstrike campaign in Syria in September, allegedly to diminish the strength of the Islamic State terrorist group. Subsequent analysis of the airstrikes has found that up to 80 percent of these strikes occur far from ISIS-held areas, targeting Syrian Kurdish and Arab rebels opposed to President Bashar al-Assad instead.\nIn addition to the Caesar Kunikov, the Turkish government has held for inspection another Russian ship at the port of Samsun. It is not clear what the ship’s violations are that has prevented it from leaving port, though Hurriyet notes the Russian government did the same to a Turkish ship at Novorossiysk last week.\nThe downing of a Russian jet by the Turkish government occurred a month after the Turkish government warned that Russian jets had, on multiple occasions, violated their airspace. “Even if it’s a flying bird, whoever violates Turkish airspace will be subject to the necessary actions,” Turkish Prime Minister Ahmet Davutoğlu said on October 6, warning that the government was willing to shoot down planes in violation of their sovereignty.\nThe Russian government has responded with a number of economic sanctions against the Turkish government, as well as the repeated accusation that the government of President Recep Tayyip Erdogan is buying oil from the Islamic State terrorist group.\nRussian officials and state media have published images they claim show oil trucks traveling out of ISIS territory and being accepted in Turkey, though the government of the Kurdistan Regional Government (KRG) of Iraq has identified the trucks as its own. While the Turkish government is currently engaging in an armed struggle against the Kurdistan Workers’ Party (PKK) and some elements of Syrian Kurdistan, it maintains friendly relations with Iraqi Kurdistan.\nErdogan has also personally counter-accused the Russian government of buying oil from the Islamic State.\nIt is believed that both Russia and Turkey are set to lose millions of dollars in trade due to sanctions against Turkey and any subsequent economic action against each other.","url":"https://www.breitbart.com/national-security/2015/12/07/turkey-summons-envoy-russian-soldier-wields-rocket-launcher-bosporus/"}
