{"authors":[],"date_download":"2018-10-23 03:14:17","date_modify":"2018-10-23 03:14:17","date_publish":"2017-04-26 14:41:32","description":"Turkey insisted Wednesday that it had informed the United States and Russia before launching strikes against Kurdish forces in Syria and Iraq, as Moscow...","filename":"data/vaneerConsumption/TurkeysaysUSRussiainformedofstrikesonKurdmilitia.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/21/wire-467743-1493237194-122_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4447858_Turkey-says-US-Russia-informed-strikes-Kurd-militia_1540264457.html","title":"Turkey says US, Russia informed of strikes on Kurd militia","title_page":"Turkey says US, Russia informed of strikes on Kurd militia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A medical helicopter, from the US-led coalition, flies over the site of Turkish airstrikes near northeastern Syrian Kurdish town of Derik on April 25, 2017\nTurkey insisted Wednesday that it had informed the United States and Russia before launching strikes against Kurdish forces in Syria and Iraq, as Moscow blasted the bombing raids as \"unacceptable\" and new border clashes erupted.\nWashington angrily accused Turkey of lacklustre coordination after Turkish war planes carried out strikes on Kurdish militia forces in Syria on Tuesday, and also hit Kurdish forces in neighbouring Iraq in what Ankara described as \"terrorist havens\".\nAnkara has vowed to combat groups inside Syria that it links to the outlawed Kurdistan Workers' Party (PKK), which has waged an insurgency inside Turkey for over three decades.\nBut both the US and Russia -- despite backing opposite sides in the brutal Syrian civil war -- regard the Kurdish People's Protection Units (YPG) operating in Syria as essential in the fight against the Islamic State (IS) group.\nThe Turkish strikes killed 28 Kurdish fighters in northeastern Syria, according to the Syrian Observatory for Human Rights monitoring group, while the Turkish army claimed 70 militants were killed.\nThe US State Department said it was \"deeply concerned\" that the strikes were conducted \"without proper coordination either with the United States or the broader global coalition\" against IS.\nRegime ally Russia said the Kurdish fighters targeted were forces \"that truly oppose terrorist groups on the ground, first and foremost ISIL,\" or IS.\nFighters from the Kurdish People's Protection Units (YPG) visit the site of Turkish airstrikes near northeastern Syrian Kurdish town of Derik, known as al-Malikiyah in Arabic, on April 25, 2017\n\"We consider such actions unacceptable and going against the founding principles of international relations,\" the Russian foreign ministry said, calling for \"all sides to show restraint\" and focus on fighting terrorism.\nThe YPG, which has fiercely condemned the strikes, called for a no-fly zone over northern Syria.\nTurkish Foreign Minister Mevlut Cavusoglu said the Russians and Americans had been given two hours' warning that the strikes were about to take place, and that Washington had further been warned in the \"last few weeks\" that military operations were coming.\n\"Turkey acts transparently on all issues. We have no secret agenda,\" Cavusoglu told reporters in Uzbekistan.\n- 'Legitimate right' -\nA US officer, from the US-led coalition, speaks with a fighter from the Kurdish People's Protection Units (YPG) at the site of Turkish airstrikes near northeastern Syrian Kurdish town of Derik, known as al-Malikiyah in Arabic, on April 25, 2017\nCavusoglu said Ankara had \"a legitimate right\" to carry out such strikes because of threats against Turkey, urging its allies to support the efforts.\nBut State Department spokesman Mark Toner said \"these kinds of actions frankly harm the coalition's efforts\" against IS.\nThe YPG has captured chunks of territory in northern Syria but Ankara has repeatedly said it will not allow a \"terror corridor\" to form on its southern border.\nTuesday's raids were Turkey's latest after its Euphrates Shield offensive aimed at ousting Kurdish militias and IS fighters from the border area.\nTurkey's army said Wednesday that the YPG had launched fresh mortar attacks from Afrin, northern Syria, on a border security post in Hatay, southern Turkey, which it responded to \"in legitimate defence\". There were no casualties.\nFurther exchanges of fire took place later Wednesday between YPG and Turkish troops in the southeastern Turkish province of Mardin, leaving at least two Turkish soldiers injured, local sources and state media said.\nThe PKK is listed as a \"terrorist group\" by the US, the European Union and Turkey, but only Turkey sees the YPG as a terror outfit.\nWashington is hoping the SDF, a Syrian Arab-Kurdish alliance dominated by the YPG, will push into the IS bastion of Raqa in Syria, but is wary of upsetting Turkey, a key NATO ally.\nAlong with the 28 believed to have been killed in the Syrian strikes -- most of them YPG fighters -- six pro-Ankara Kurdish peshmerga fighters were also killed in northern Iraq on Tuesday, in what was apparently an accident.\nTurkish Prime Minister Binali Yildirim called the head of Iraq's Kurdish region Massud Barzani to express his condolences and sadness over the deaths, the Anadolu news agency said.\nBoth sides however vowed to keep up cooperation in the \"fight against terror\" in the future, it added.","url":"https://www.dailymail.co.uk/wires/afp/article-4447858/Turkey-says-US-Russia-informed-strikes-Kurd-militia.html"}
