{"authors":["John Hayward"],"date_download":"2018-10-30 21:07:08","date_modify":"2018-10-30 21:07:08","date_publish":"2015-08-05 20:01:32","description":"U.S. Treasury's Office of Foreign Assets Control has leveled sanctions against a dozen Turkish companies for doing Syrian business.","filename":"data/vaneerConsumption/TurkishCompaniesAddedtoUSSanctionsListDuetoSyrianInvolvement.json","image_url":"https://media.breitbart.com/media/2015/08/turkey-flag-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_08_05__1540933628.html","title":"Turkish Companies Added to U.S. Sanctions List Due to Syrian Involvement","title_page":"Turkish Companies Added to U.S. Sanctions List Due to Syrian Involvement","title_rss":"NULL","source_domain":"breitbart.com","text":"Sanctions against Iran are understandably getting most of the attention these days, but the United States also maintains sanctions against Iran’s client in Syria, the dictatorship of Bashar Assad. Reuters reports the U.S. Treasury’s Office of Foreign Assets Control has leveled sanctions against a dozen Turkish shipping and energy companies for doing business with Syria, along with four individuals connected with one of the sanctioned corporations, Milenyum Energy.\nThe Associated Press broadly describes the targeted entities as “front companies the Syrian government has used to evade U.S. and European Union sanctions,” and says Treasury’s action will freeze assets from these entities under U.S. jurisdiction, as well as prohibiting Americans from doing business with them.\nHurriyet Daily News elaborates on the allegations against Milenyum:\nMilenyum Energy, a company registered in Panama and operating in Turkey, was designated (pursuant to E.O. 13582) for having materially assisted, sponsored, or provided financial, material, or technological support for, or goods or services in support of, and having acted or purported to act for or on behalf of, the U.S.- and E.U.-designated Abdulkarim Group and Wael Abdulkarim, said the statement. “Milenyum was also designated for having materially assisted, sponsored, or provided financial, material, or technological support for, or goods or services in support of, the government of Syria. In recent years, Milenyum has responded to the Syrian regime’s energy needs by regularly arranging for the shipment of products such as liquefied petroleum gas [LPG] and gasoil to the Syrian Government-controlled port of Banias, likely for SYTROL or other Syrian government entities,” it added. “[The] Treasury will continue to employ its robust financial tools to weaken [Syrian President Bashar al-]Assad’s support network,” said Acting Under Secretary for Terrorism and Financial Intelligence Adam J. Szubin. “These targeted sanctions intensify the economic and financial pressure on the Syrian government to cease its campaign of violence against its people,” he said.\nSeveral of the other sanctioned companies are connected with Milenyum Energy in some way: an entity called The Eagles LLC was involved in shipping Milenyum gas and oil to Syria, while Green Shipping Ltd. and Aqua Shipping Ltd. were owned and controlled by Milenyum, which used them to register the ownership of ocean vessels.\nThe owner of Eagles LLC, Wael Abdulkarim, is also the managing director of a Dubai company called Morgan Additives Manufacturing that was also hit with sanctions this week, according to the Wall Street Journal.\n“Treasury will continue to employ its robust financial tools to weaken Assad’s support network,” declared Acting Under Secretary for Terrorism and Financial Intelligence Adam J. Szubin in the department’s official statement. “These targeted sanctions intensify the economic and financial pressure on the Syrian government to cease its campaign of violence against its people.”\nThis is, perhaps, a curious turn of events when viewed against the big picture of Iranian sanctions relief, since the Assad regime is likely to be a primary beneficiary of Iran’s financial windfall; we’ll be maintaining sanctions to choke out Assad while simultaneously lifting much larger sanctions against his patrons in Tehran.","url":"https://www.breitbart.com/national-security/2015/08/05/turkish-companies-added-to-u-s-sanctions-list-due-to-syrian-involvement/"}
