{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:34:12","date_modify":"2018-10-30 20:34:12","date_publish":"2016-09-10 15:39:22","description":"Contents: Turkey presses to establish a 'no-fly zone' in northern Syria; Turkey's forces and Kurdish forces set to clash in Manbij; US and Russia once again announced a peace deal in Syria | National Security","filename":"data/vaneerConsumption/TurkeyPlansAssaultonSyriasKurds.json","image_url":"https://media.breitbart.com/media/2016/08/Screen-Shot-2016-08-19-at-16.41.15.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_09_10__1540931652.html","title":"Turkey Plans Assault on Syria's Kurds","title_page":"Turkey Plans Assault on Syria's Kurds","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nTurkey presses to establish a ‘no-fly zone’ in northern Syria\nTurkey’s forces and Kurdish forces set to clash in Manbij\nUS and Russia once again announced a peace deal in Syria\nTurkey presses to establish a ‘no-fly zone’ in northern Syria\nHadiya Yousef, Kurdish official leading the effort to create Rojava, a new Kurdish ‘federal system’ in Syria. (Reuters)\nTurkey is continuing with its invasion of Syria, known as Operation Euphrates Shield, now in its third week. On Thursday, the 15th day of the operation, Turkey announced that the operation had killed 110 of the enemy, where the enemy included both fighters from the so-called Islamic State (IS or ISIS or ISIL or Daesh) and also fighters from the Kurdish People’s Protection Units (YPG).\nThe Turks did not announce how many of the 110 killed were from ISIS and how many from the YPG, but Turkish officials have said that a major objective of the invasion was to drive the Kurdish forces back east, to the other side of the Euphrates River.\nTurkey’s tanks, planes and special forces crossed the border into Syria on August 24, backed up by around 1,500 anti-Assad Syrian rebels called the Free Syrian Army (FSA). Turkey’s forces were rushed into action to drive ISIS out of Syria’s border city of Jarablus before the Kurdish YPG beat them to it.\nNow that Turkey’s army and the FSA are in control of a large section of northern Syria, Turkey wants them to stay there by forming a “safe zone” for refugees. At last week’s G20 summit meeting, Turkey’s president Recep Tayyip Erdogan restated this objective, and also criticized Syria’s president Bashar al-Assad:\nAt the leaders’ summit in Antalya, we said that the Syrian crisis could be solved by creating a safe zone for the refugees, and we reiterated this. Not a single country took a solid step; the Syrian subject continues to be a bleeding wound… Right now, in Syria, 600,000 civilians lost their lives. To still say ‘let Assad stay’ seems to me like an embarrassment to humanity.\nErdogan also wants the safe zone to be a “no-fly zone,” enforced by the US coalition of warplanes fighting ISIS. However, the Obama administration opposes a no-fly zone, according to national security advisor Ben Rhodes:\nWe do not think a no-fly zone would resolve the fundamental issues on the ground because there continues to be fighting on the ground. A no-fly zone would necessarily only be contained to one specific area, and we have problems and violence across the country.\nHowever, Rhodes also congratulated Turkey on the operation in Jarablus:\nIt has been a key priority for a long time. If we can seal that border using Turkish forces, opposition forces, with our logistical and air support, I think that would help us make a substantial gain against ISIS.\nSo if I understand Rhodes correctly, the intention is to for Turkish and FSA forces to remain in place in northern Syria, protected by coalition warplanes. What’s the difference between that and a safe zone / no-fly zone? I can’t tell the difference.\nIf it isn’t a safe zone, then ISIS and the Kurds will attack Jarablus again. If it isn’t protected by coalition air power, then it will be attacked by Syrian regime warplanes. So we’ll have to wait and see what’s going on. Reuters and Middle East Monitor and Hurriyet (Ankara)\nRelated Articles\nTurkey’s forces and Kurdish forces set to clash in Manbij\nIn January 2014, ISIS captured the city of Manbij, with over 100,000 people, south of Jarablus, west of the Euphrates River.\nEarly in August, the Kurds had scored a major victory by defeating ISIS in the city of Manbij. In capturing Manbij, The Kurds’ objective was to continue westward and to control a long strip of land in northern Syria, and declare an independent state called Rojava, something that’s strongly opposed by Turkey.\nNow Turkey’s president Recep Tayyip Erdogan has stated that Turkey’s military operation will continue southward, first to expel ISIS from the city of Al-Bab, and then to expel the Kurds from the city of Manbij.\nUS officials have asked their allies, the YPG Kurds, to retreat from Manbij and move back to the eastern side of the Euphrates River, but Hadiya Yousef, a Syrian Kurd politician, says that the Kurds have no intention of retreating:\nWe have decided to convene a meeting of the founding assembly of the federal system at the start of October, and we will declare our system in northern Syrian. We will not retreat from this project. On the contrary, we will work to implement it. The Turkish intervention will not obstruct us.\nYousef is co-chair of a 151-member council including Kurds, Arabs, Turkmen, Assyrians and other groups that will approve a new constitution known as a “social contract” that plans to form Rojava, which they describe as a new “federal system” in Syria.\nAccording to Erdogan, both ISIS and the YPG Kurds are terrorists. However, the Turks and the Kurds are both allies of the United States, and it looks like they’ll be fighting each other. Reuters and Yeni Safak (Ankara) and Reuters (12-April)\nRelated Articles\nUS and Russia once again announced a peace deal in Syria\nAfter what has been described as over ten hours of arguing, US Secretary of State John Kerry and Russia’s Foreign Minister Sergei Lavrov announced a new “cessation of hostilities,” to begin on Monday, September 12, and last seven days.\nThe “bedrock of the agreement,” according to Kerry, will be to prevent the air forces of Syria’s president Bashar al-Assad from flying combat missions that target the “moderate rebels,” which would exclude the al-Nusra Front and ISIS. In particular, the agreement would prevent al-Assad’s warplanes from dropping barrel bombs on civilian neighborhoods, marketplaces, hospitals and schools.\nAfter the cessation of hostilities has been in place for seven days, then the peace agreement will be extended to include al-Nusra Front, which in July announced that it had split with al-Qaeda, and renamed itself Jabhat Fateh al-Sham.\nWe’ve now had several years of peace agreements, peace envoys, cessations of hostilities, but the core problem has always been the psychopathic Bashar al-Assad, who considers all Sunnis to be like cockroaches to be exterminated.\nIn this new peace deal, the Russians have committed to keeping al-Assad from bombing civilians with barrel bombs. I don’t expect anything to be different this time, but we’ll have to wait and see. BBC and CNN and Russia Today\nRelated Articles\nKEYS: Generational Dynamics, Turkey, Syria, Operation Euphrates Shield, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh, Bashar al-Assad, Kurdish People’s Protection Units, YPG, Rojava, Jarablus, Manbij, Recep Tayyip Erdogan, Free Syrian Army, FSA, Ben Rhodes, al-Bab, Hadiya Yousef, John Kerry, Russia, Sergei Lavrov, Jabhat al-Nusra, al-Nusra Front, Jabhat Fateh al-Sham, JFS, Front for the Conquest of Syria\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2016/09/10/10-sep-16-world-view-turkey-plans-assault-syrias-kurds-us-russia-announce-another-peace-deal/"}
