{"authors":["Frances Martel"],"date_download":"2018-10-30 18:30:48","date_modify":"2018-10-30 18:30:48","date_publish":"2015-05-26 14:28:05","description":"Turkish President Erdogan attacked The New York Times in Istanbul Monday for sounding the alarm on freedom of the press in Turkey,","filename":"data/vaneerConsumption/TurkishPresidentLashesOutatShamelessNYToverFreePressEditorialKnowYourPlace.json","image_url":"https://media.breitbart.com/media/2015/01/erdogan-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_26__1540924248.html","title":"Turkish President Lashes Out at 'Shameless' NYT over Free Press Editorial: 'Know Your Place'","title_page":"Turkish President Lashes Out at 'Shameless' NYT over Free Press Editorial: 'Know Your Place' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Turkish President Recep Tayyip Erdogan used the opportunity of speaking to a think tank in Istanbul on Monday to attack The New York Times for sounding the alarm on freedom of the press in Turkey. He suggested that its criticisms of Erdogan’s use of the legal system to intimidate news outlets was “overstepping the limits of freedom,” and told the New York outlet, “Know your place.”\nIn an editorial, The New York Times criticized attacks on the part of Erdogan’s administration against Hurriyet Daily News and its parent company, the Dogan Media Group, for a headline Erdogan’s AK Party suggested incited Turks to violence. The headline–“The world is shocked! Death sentence for president who received 52 percent of the vote”–referenced the sentencing of former Egyptian President Mohamed Morsi. As Erdogan had also received 52 percent of the vote in his last election, AKP prosecutors alleged the headline was encouraging Turks to sentence him to death, as well.\nThe Times editors wrote that Erdogan “has a long history of intimidating and co-opting the Turkish media” and described the upcoming parliamentary election as “especially vicious,” adding that “the mood seems unusually dark and fearful.” Of Erdogan himself, the editors wrote that he “appears increasingly hostile to truth-telling,” and that “the United States and Turkey’s other NATO allies should be urging him to turn away from this destructive path.”\n“Who are you? Can you write such a thing against the U.S. administration?” Erdogan asked the Times on Monday. Erdogan alleged that the Obama administration “would immediately do what is necessary” if the Times wrote a similarly scathing editorial about him. He called the Times “shameless” and accused the paper of “overstepping the limits of freedom.”\nHurriyet has maintained that they have done nothing wrong by publishing the headline, despite facing calls for prosecutors to bring the leadership of the newspaper to court. Pro-AKP attorney Rahmi Kurt called upon government prosecutors to launch a full investigation into the newspaper for a number of charges, including “inciting hatred and enmity,” “inciting people to armed rebellion against the government,” “praising the crime and the criminal,” and “spreading propaganda for a terrorist organization.”\nHurriyet has responded to the accusations by noting that President Erdogan himself had noted that Morsi was popularly elected, and calling the claim that they were inciting violence “an unfair and baseless accusation.” The editors in an open letter published after the accusations were first leveled wrote, “What evidence do you have, Mr. President? The fact that we used a title with the words that you, yourself, uttered?”\nIn addition to The New York Times, Hurriyet has received the support of the International Press Institute, whose board issued a declaration supporting the newspaper and noting that they were “very concerned for our members in Turkey and for all those journalists, editors and publishers there who for many years have continued to strive for independent and critical journalism in spite of a climate of fear that led many of their colleagues to choose silence.”\nErdogan has previously referred to Turkey as having the world’s freest press: “Nowhere in the world is the press freer than it is in Turkey. I’m very sure of myself when I say this. The press is so free in Turkey that one can make insults, slanders, defamation, racism and commit hate crimes that are not tolerated even in democratic countries,” he stated in December, in response to similar concerns that the Turkish government had begun intimidating opposition outlets in non-democratic ways.\nIn addition to targeting large newspapers, Erdogan’s government has intimidated individuals on social media. One former Miss Turkey was arrested in January for sharing a poem mocking Erdogan on social media, and two cartoonists were arrested in March for drawing a cartoon that implied that Erdogan was gay.","url":"https://www.breitbart.com/national-security/2015/05/26/turkish-president-lashes-out-at-shameless-nyt-over-free-press-editorial-know-your-place/"}
