{"authors":["Associated Press"],"date_download":"2018-10-23 04:35:49","date_modify":"2018-10-23 04:35:49","date_publish":"2016-01-11 17:46:35","description":"CAIRO (AP) — Turkish authorities have arrested an Egyptian family of 12 that was trying to cross into Syria to join the Islamic State group, Egypt's Foreign ...","filename":"data/vaneerConsumption/TurkeyarrestsEgyptfamilyof12onwaytojoinISinSyria.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394261_Turkey-arrests-Egypt-family-12-way-join-IS-Syria_1540269349.html","title":"Turkey arrests Egypt family of 12 on way to join IS in Syria","title_page":"Turkey arrests Egypt family of 12 on way to join IS in Syria | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Turkey arrests Egypt family of 12 on way to join IS in Syria\nCAIRO (AP) — Turkish authorities have arrested an Egyptian family of 12 that was trying to cross into Syria to join the Islamic State group, Egypt's Foreign Ministry said on Monday.\nThe family, which includes three children, was arrested in the southern Turkish city of Adana, near the country's border with war-devastated Syria, according to the ministry's statement.\nExploiting the civil unrest in Syria and Iraq, the Islamic State group seized large swaths of land in both countries and declared a \"caliphate\" in summer 2014. The group has attracted followers and fighters from all over the world.\nEgypt said it demanded to know the details of the case and the nature of the charges pressed against the family. The statement did not say how Turkey knew the 12 wanted to join IS.\nTurkish Foreign Ministry officials said they had no information on the arrests.\nHowever, Turkey's state-run Anadolu news agency said 16 Egyptians including seven children were detained in Adana on Sunday by anti-terrorism police, suspected of trying to join IS.\nThe Egyptians were detained together with a Russian national and seven Turks suspected of recruiting militants for IS, according to Anadolu. Police seized two pump-action guns and numerous pro-IS \"digital material\" during the raids, the agency said.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3394261/Turkey-arrests-Egypt-family-12-way-join-IS-Syria.html"}
