{"authors":["Mailonline Reporter"],"date_download":"2018-10-23 00:27:35","date_modify":"2018-10-23 00:27:35","date_publish":"2017-04-26 10:04:30","description":"President Recep Tayyip Erdogan praised Britain's 'peace of mind' after Brexit and said Turkey could hold a similar vote on its negotiations to join the EU if the country is kept waiting much longer.","filename":"data/vaneerConsumption/TurkeythreatenstoholditsownBrexitreferendumvote.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/29895CDE00000578-0-image-a-24_1493197035531.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446756_Now-s-TUREXIT-Turkey-threatens-Brexit-style-vote_1540254455.html","title":"Turkey threatens to hold its own Brexit referendum vote","title_page":"Turkey threatens to hold its own Brexit referendum vote | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Turkish president Recep Tayyip Erdogan has revealed he could hold a referendum on his country's negotiations to join the EU after seeing Britain gain 'peace of mind' with Brexit.\nSpeaking less than two weeks after winning a vote that gave him sweeping new powers, President Erdogan said Britain was 'walking towards a new future' after opting to ditch the union.\nHe also said Islamophobia had become 'very serious' in Europe and that the EU is on the verge of 'breaking up'.\nScroll down for video\nPresident Erdogan, pictured, said Britain was now 'walking towards a new future' after opting to leave the EU - and threatened that Turkey might hold a Brexit-style referendum of its own if the bloc stretches out negotiations any longer\nThe country will not wait at Europe's door forever, he added, stressing he is ready to walk away from accession talks if hostility from certain members states persists.\nHis comments came after the Council of Europe put Turkey on a watch list because of a crackdown on dissent after last year's coup attempt, rights violations and concerns about Erdogan's increased grip on power.\nBut President Erdogan, who accused Germany and the Netherlands of acting like Nazis by banning rallies of his supporters, said the move was 'entirely political'.\n'In Europe, things have become very serious in terms of the extent of Islamophobia. The EU is closing its doors on Turkey and Turkey isn't closing its doors on anybody,' Erdogan said, showing photos of vandalised mosques and supporters of outlawed Kurdish militants rallying against him in Europe.\nThe Turkish president stressed his country had not been fully appreciated for its work to stem the number of refugees heading to Europe from the Middle East\n'If they're not acting sincerely we have to find a way out. Why should we wait any longer? We're talking about 54 years,' he said, referring to the 1963 Ankara Agreement which acknowledged the long-term goal of Turkish membership of a united Europe.\nErdogan pointed to the French presidential election, in which far-right leader Marine Le Pen has threatened to take France out of the European Union, and said the bloc was 'on the verge of dissolution, of breaking up'.\n'One or two countries cannot keep the EU alive. You need a country like Turkey, a different country symbolising a different faith ... But EU member states don't seem to realise this fact.\n'They are finding it very difficult to absorb a Muslim country like Turkey,' he said.\nErdogan said the popularity of far-right French presidential candidate Marine Le Pen showed the EU was 'on the verge of dissolution, of breaking up' and that it needed a 'different country symbolising a different faith' to keep it alive\nOn Syria, Erdogan said it was impossible to find a peaceful solution to the war - which has so far lasted six years - with Bashar al-Assad as president. Above, Syrian government forces are shown taking control of Aleppo in December last year\nEurope, Erdogan said, had failed to appreciate Turkey's role in stemming the flow of migrants from neighbouring Syria and Iraq across it borders, and said the burden had fallen on Turkey and other countries in the region including Lebanon and Jordan.\nIt is a critical week for Turkish-EU relations. EU lawmakers will debate ties today, while the bloc's foreign ministers will discuss the issue on Friday.\nErdogan said he would be closely watching.\n'I'm very curious as to how the EU is going to act,' he said, criticising EU states that have called for an end to accession talks.\nTurkey, he said, was still committed to negotiations.\n'There is not a single thing that we are not ready to do, the minute they ask for it. Whatever they wish, we do. But still they are keeping us at the door,' he said.","url":"https://www.dailymail.co.uk/news/article-4446756/Now-s-TUREXIT-Turkey-threatens-Brexit-style-vote.html"}
