{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 20:16:44","date_modify":"2018-10-30 20:16:44","date_publish":"2016-11-07 10:04:22","description":"Turkey put 36 suspects on trial over a double suicide bombing last year blamed on Islamic State jihadists that killed over 100 people.","filename":"data/vaneerConsumption/TurkeyPuts36JihadistSuspectsonTrialOver2015Bombing.json","image_url":"https://media.breitbart.com/media/2016/03/suic.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_11_07__1540930604.html","title":"Turkey Puts 36 Jihadist Suspects on Trial Over 2015 Bombing","title_page":"Turkey Puts 36 Jihadist Suspects on Trial Over 2015 Bombing","title_rss":"NULL","source_domain":"breitbart.com","text":"ANKARA (AFP) – Turkey on Monday put 36 suspects on trial over a double suicide bombing last year blamed on Islamic State jihadists that killed over 100 people in the country’s deadliest attack.\nThe bombing on October 10, 2015 outside Ankara’s main train station targeted mainly young people attending a peace rally of pro-Kurdish activists that was to start later that day.\nSupporters of the victims have until now bitterly criticised the slowness of the investigation into the attack, which further raised tensions between the authorities and the Kurdish minority.\nThe trial got underway at the Ankara criminal court in the presence of opposition MPs and families of the victims, several of whom shouted “murderers” at the suspects, reports said.\nThirty-five of the suspects are Turkish while one — named as Valentina Slobodjanjuk — is a Kazakh citizen, the state-run Anadolu news agency said.\nSeveral of the suspects face multiple sentences of up to 11,750 years in prison each on charges of murder and seeking to change the constitutional order.\nOthers have lesser charges of being a member of IS and face up to 22.5 years in prison, Anadolu said.\nThe hearing was taking place under the highest security, with security forces in body armour and helmets standing guard inside the courtroom, images showed.\nThe authorities have identified one of the suicide bombers as Turkish citizen Yunus Emre Alagoz. The other was a Syrian citizen who has yet to be identified, Anadolu said.\nTurkey has in the last year been hit by a string of major suicide bombings blamed on IS including a triple attack at Istanbul’s main airport in June that left 47 dead and an August blast at a Kurdish wedding in the southeastern city of Gaziantep that killed 57 people, 34 of them children.\nIS, which is believed to operate sleeper cells in major Turkish cities, never claimed these attacks.\nA news agency affiliated to IS jihadists said they staged a bombing on the southeastern city of Diyarbakir last week that killed 11. If confirmed, it would be the first claim by IS for an attack in Turkey.\nBut on Sunday, the Kurdistan Freedom Falcons (TAK), seen as a splinter group of the better-known Kurdistan Workers Party (PKK), said it had carried out the attack.","url":"https://www.breitbart.com/middle-east/2016/11/07/turkey-puts-36-jihadist-suspects-trial-2015-ankara-bombing/"}
