{"authors":["Zeynep Bilginsoy The Associated Press"],"date_download":"2018-10-30 00:51:01","date_modify":"2018-10-30 00:51:01","date_publish":"2018-10-29 03:25:00","description":"The Turkish army on Sunday shelled positions held by the U.S.-backed Kurdish fighters in northeastern Syria, east of the Euphrates River, in a new spike in tension along the borders.","filename":"data/vaneerConsumption/TurkishforcesshellKurdfightersinSyria.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_29__1540860661.html","title":"Turkish forces shell Kurd fighters in Syria","title_page":"Turkish forces shell Kurd fighters in Syria","title_rss":"NULL","source_domain":"arkansasonline.com","text":"ISTANBUL -- The Turkish army on Sunday shelled positions held by the U.S.-backed Kurdish fighters in northeastern Syria, east of the Euphrates River, in a new spike in tension along the borders.\nAnkara considers the U.S.-backed Kurdish militia an extension of its own insurgent groups, which it refers to as \"terrorists and separatists,\" and sent its military into Syria two years ago to drive the group and Islamic State militants away from its borders in northwestern Syria.\nRecently, Turkey's President Recep Tayyip Erdogan vowed to expand the military operations to clear the borders from \"terror.\"\nThe Syrian militias, known as the Kurdish People's Protection Units, are the backbone of the U.S.-backed force that is fighting against militants of the Islamic State extremist group. The alliance between the Kurdish fighters and Washington soured relations between the U.S. and Turkey, a fellow NATO member.\nThe rare Turkish shelling east of the Euphrates comes a day after an international summit on Syria hosted by Turkey, which called for an inclusive political process and for creating conditions to allow the return of millions of refugees.\nSpeaking at the summit, Erdogan said Turkey has been among those most harmed by \"terror organizations\" in neighboring Syria.\n\"We will continue eliminating threats against our national security at its root in the Euphrates' east as we have done so in its west,\" Erdogan said.\nTurkey's official Anadolu news agency said Turkish artillery strikes Sunday hit trenches and positions built by the Kurdish People's Protection Units on a hill in the village of Zor Moghar, in rural northern Aleppo.\nThe village is across the Euphrates River that separates Turkey-backed Syrian opposition forces and the Kurdish People's Protection Units.\nThe Syrian militias said in a statement that the shelling killed a Kurdish fighter from the Self Defense Forces.\nThe newly formed forces are affiliated with the U.S.-backed Syrian Democratic Forces, leading the fight against the Islamic State in eastern Syria.\nThe Kurdish People's Protection Units said the Turkish shelling was \"unprovoked\" and is a distraction from the fight against the Islamic State in eastern Syria.\n\"Any illegitimate attack against northern Syria will not go unanswered,\" the Syrian militias said in a statement.\nThe Britain-based Syrian Observatory for Human Rights and the Kurdish Hawar news agency also reported the shelling, saying Turkish artillery targeted other villages east of the Euphrates as well.\nHawar said there were no reports of casualties.\nThe Observatory said the shelling in the villages west of Kobani, a stronghold of the Kurdish fighters, came while Kurdish fighters were on high alert after Turkish threats.\nThe U.S.-backed Kurdish-led forces are fighting Islamic State militants in their last pocket in southeastern Syria.\nThe militant group has carried out a major attack on the Kurdish-led forces in some of the most intense fighting in the past few days, regaining ground and killing scores of fighters.\nThe U.S.-led coalition vowed Sunday to regain territory lost by its Syrian allies, describing the fighting as \"difficult.\"\n\"It is very difficult because we are in the last stages, where almost every [Islamic State] fighter is in a suicide belt,\" said Brett McGurk, the special presidential envoy for the coalition.\nInformation for this article was contributed by Sarah El Deeb of The Associated Press.\nA Section on 10/29/2018","url":"https://www.arkansasonline.com/news/2018/oct/29/turkish-forces-shell-kurd-fighters-in-s/"}
