{"authors":["Associated Press"],"date_download":"2018-10-23 03:01:38","date_modify":"2018-10-23 03:01:38","date_publish":"2017-03-10 12:29:12","description":"ANKARA, Turkey (AP) - Turkey's foreign minister says he will go to the Netherlands to address Turkish citizens despite Dutch authorities' demands that he not...","filename":"data/vaneerConsumption/TurkishministertodefyDutchrequestnottocomeforrally.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/15/wire-196621-1489158577-356_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301120_Turkish-minister-defy-Dutch-request-not-come-rally_1540263698.html","title":"Turkish minister to defy Dutch request not to come for rally","title_page":"Turkish minister to defy Dutch request not to come for rally | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ANKARA, Turkey (AP) - Turkey's foreign minister says he will go to the Netherlands to address Turkish citizens despite Dutch authorities' demands that he not show up for a rally there on the upcoming Turkish referendum.\nMevlut Cavusoglu said he would travel to Rotterdam on Saturday despite \"all obstacles and despite all the racist speeches.\" His comments, made late Thursday following a telephone call with his Dutch counterpart, were reported in the Turkish media on Friday.\nCavusoglu's statement came after Dutch Prime Minister Mark Rutte said his government had given the strongest possible hints to Turkey not to send representatives for rallies, short of arresting a Turkish minister on arrival. He added Cavusoglu's visit would stir trouble between the two NATO allies.\nThe Foreign Minister of Turkey Mevlut Cavusoglu speaks during a visit of the booth of Turkey at the tourism fair ITB in Berlin, Germany, Wednesday, March 8, 2017. (AP Photo/Michael Sohn)\nTurkish ministers' plans for campaign rallies have also caused friction with Germany.\nBut the visit to the Netherlands is particularly sensitive, coming just days before elections for the lower house of Parliament.\nAnti-Islam populist Geert Wilders, who is polling strongly ahead of the March 15 election, has called on the Dutch government to declare Turkish ministers persona non grata and bar them from the Netherlands until after the election.\nHowever, government ministers say they can do little to prevent Cavusoglu making a private visit.\nInstead, they have repeatedly tried to talk him out of coming.\n\"My message was clear: That his visit to the Netherlands is undesirable,\" Foreign Affairs Minister Bert Koenders told reporters Friday after what he called a \"tough\" phone call with his Turkish counterpart.\n___\nMike Corder in The Hague, Netherlands, contributed to this story.","url":"https://www.dailymail.co.uk/wires/ap/article-4301120/Turkish-minister-defy-Dutch-request-not-come-rally.html"}
