{"authors":["Ekin Karasin For Mailonline"],"date_download":"2018-10-23 00:34:24","date_modify":"2018-10-23 00:34:24","date_publish":"2017-03-16 10:02:54","description":"Turkish minister Mevlut Cavusoglu claimed Wilders and social democrats in the Netherlands share the same mindset - to 'take Europe to the cliff' - while speaking at a rally in Antalya on Thursday.","filename":"data/vaneerConsumption/TurkeysaysEuropeheadedforreligionofwars.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E2AA20100000578-0-image-a-103_1489669905327.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319522_Europe-headed-religion-wars-despite-Wilders-stumble-Turkish-minister-says_1540254864.html","title":"Turkey says Europe headed for 'religion of wars'","title_page":"Turkey says Europe headed for 'religion of wars' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Turkey's foreign minister has said that Dutch anti-Islam politician Geert Wilders' views were shared by all rival parties and were pushing Europe towards 'wars of religion'.\nDutch Prime Minister Mark Rutte fended off the challenge of Wilders to score an election victory hailed across Europe by governments facing a rising wave of nationalism.\nBut Turkish minister Mevlut Cavusoglu claimed Wilders and social democrats in the Netherlands share the same mindset - to 'take Europe to the cliff'.\nTurkey's foreign minister Mevlut Cavusoglu (left) has said that Dutch anti-Islam politician Geert Wilders' views (right) were shared by all rival parties and were pushing Europe towards 'wars of religion'\nIt comes amid deepening tensions between Turkey and the Netherlands after the Dutch barred Turkish ministers from speaking to rallies of overseas Turks.\n'Many parties have received a similar share of votes,' Cavusoglu said at a rally in the southern city of Antalya.\n'17 per cent, 20 per cent, there are lots of parties like this, but they are all the same.\n'There is no difference between the mindsets of Geert Wilders and social democrats in the Netherlands.\n'They all have the same mindset. That mindset is taking Europe to the cliff. Soon wars of religion may and will start in Europe.'\nDutch Prime Minister Mark Rutte fended off the challenge of Wilders to score an election victory hailed across Europe by governments facing a rising wave of nationalism\nDutch Prime Minister Mark Rutte shakes hands of children after casting his vote\nTurkey on Monday suspended high-level relations with the Netherlands after it cited public safety in banning ministers from addressing expatriate Turks in a campaign for a referendum that would give President Tayyip Erdogan sweeping new powers.\nErdogan, who is counting on the backing of overseas Turks in the April 16 vote, accused the Dutch government of acting like 'Nazi remnants'.\nDutch Prime Minister Mark Rutte's right-wing VVD party has easily won national elections, defying polls that suggested a close race with anti-Islam populist Geert Wilders.\nPolitical parties were on Thursday preparing to start what is likely be a long process of coalition talks.\nWith most votes counted for the 150-seat legislature, Mr Rutte's VVD had 33 seats, eight fewer than in 2012.\nMr Wilders, meanwhile, had lost none of his trademark defiance, though a tweet about his party's progress failed to hide his disappointment that he fell short of becoming number one in Wednesday's vote\nThe far-right populist Party for Freedom of Mr Wilders was second with 20 seats, five more than the last time but still a stinging setback after polls in recent months had suggested his party could become the largest in Dutch politics.\nWe lost eight seats, but we're very happy to be the biggest party again,' Mr Rutte told NPO Radio 1.\nMr Wilders, meanwhile, had lost none of his trademark defiance, though a tweet about his party's progress failed to hide his disappointment that he fell short of becoming number one in Wednesday's vote.\nThe Christian Democrats and centrist D66 parties, probable future coalition partners for Mr Rutte, won 19 seats each.\nParty leaders were expected to meet on Thursday to discuss first steps in the coalition formation process.\nScreaming men face off with Dutch riot police outside the Turkish consulate in Rotterdam\nA Dutch riot policeman tries to get his dog to let go of a man after riots broke out during a pro Erdogan demonstration at the Turkish consulate in Rotterdam, Netherlands\nMr Rutte warned that it could take a while.\nHe said: 'We have had a tough campaign, with reproaches back and forth. We need time for everybody to get back into the mood for co-operation, and that doesn't happen in a few hours.'\nIt comes as Turkey threatened to cancel an EU refugee deal over a continuing row with other European countries.\nThe country's first minister Mevlut Cavusoglu made the announcement during a televised interview on Wednesday evening.\nHis remarks come amid strained relations between the EU and Turkey following the continent's refugee crisis.\nTurkish President Tayyip Erdogan previously labelled Holland a fascist nation and said the country will pay for blocking rallies in Rotterdam and the ensuing riots.\nUgly scenes erupted in the city as dogs were unleashed on Turkish nationals amid protests over two ministers being blocked from entering the Netherlands.\nErdogan repeated hugely controversial accusations that the Netherlands - occupied by Germany in the Second World War - was behaving like a fascist Nazi state and in its treatment of his officials.\nThe comments have provoked anger from Dutch politicians, and leader of the Freedom Party Geert Wilders demanded 400,000 Turkish nationals be stripped of their citizenship in Holland.","url":"https://www.dailymail.co.uk/news/article-4319522/Europe-headed-religion-wars-despite-Wilders-stumble-Turkish-minister-says.html"}
