{"authors":["Associated Press"],"date_download":"2018-10-23 02:33:44","date_modify":"2018-10-23 02:33:44","date_publish":"2017-04-26 13:40:57","description":"ANKARA, Turkey (AP) - Turkey's main opposition party said Wednesday it would challenge the outcome of the country's April 16 referendum on expanding the...","filename":"data/vaneerConsumption/TurkishoppositiontochallengereferendumatEuropeancourt.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/18/wire-466779-1493226375-563_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447650_Turkish-opposition-challenge-referendum-European-court_1540262024.html","title":"Turkish opposition to challenge referendum at European court","title_page":"Turkish opposition to challenge referendum at European court | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ANKARA, Turkey (AP) - Turkey's main opposition party said Wednesday it would challenge the outcome of the country's April 16 referendum on expanding the president's powers at the European Court of Human Rights a day after a high court rejected its appeal.\nThe pro-secular Republican People's Party, or CHP, is disputing the referendum, which gave President Recep Tayyip Erdogan's \"yes\" side a narrow victory. Critics say there have been a number of irregularities, including an electoral board decision to count ballot papers that lacked official stamps. International monitors also noted irregularities in the voting process and said the decision to validate the unstamped ballots removed an important safeguard against fraud and was in violation of Turkey's laws.\nCHP spokeswoman Selin Sayek Boke announced the party's decision to take the appeal to the Strasbourg, France-based court after the country's high administrative court rejected its bid to have the electoral authority's decision on the unstamped ballot papers overturned. The Supreme Electoral Board also rejected an appeal by the opposition last week.\nTurkey's President Recep Tayyip Erdogan, 4th left, accompanied by, from left to right, Kemal Kilicdaroglu, leader of the Republican People's Party (CHP), Prime Minister Binali Yildirim, Ismail Kahraman, Speaker of the Grand National Assembly of Turkey, Turkish Constitutional Court Chairman Zuhtu Arslan and Chief of the General Staff of the Turkish Armed Forces, Hulusi Akar, attend a ceremony as part of the 55th anniversary of the founding of Turkey's Constitutional Court, in Ankara, Turkey, on Tuesday, April 25, 2017. Legislators representing Europe's top human rights body, the Strasbourg-France-based Parliamentary Assembly of the Council of Europe, on Tuesday voted in favour of re-opening monitoring procedures in Turkey in a move that reflects its strong concern over the functioning of democratic institutions in the country.(Press Presidency Press Service Pool Photo via AP)\n\"It is our duty to protect the votes of every citizen that went to the polls,\" Boke said. \"We will be applying to the ECHR in the period ahead. We are confident that we will meet again in more enlightened times.\"\nErdogan and other government officials have said the electoral authority's decision is final, and that efforts to challenge it in courts - including the European court - would be futile. The electoral board has published past rulings on the validity of unstamped ballots.\nThe electoral authority is expected to confirm the official results of the vote later this week. Unofficial results show that the \"yes\" camp garnered 51.4 percent of the votes.\nThe vote switches Turkey's system from a parliamentary one to a presidential system, abolishing the office of the prime minister while greatly increasing the powers of the president.\nThe \"no\" camp fears the changes will lead to a one-man authoritarian rule with too few checks and balances. Erdogan has argued that a strong presidency will lead to greater stability and prosperity.\nIn Brussels, a senior European Union official said the referendum has raised \"serious concerns\" within the bloc on the democratic standards in Ankara and added that it was up to Erdogan to clarify whether Turkey still wants to become an EU member.\nEU Commission Vice President Valdis Dombrovskis said that despite the rift between the two, cooperation on issues like refugees and migrants remained necessary.\n\"We have serious concerns but at the same time there are a number of areas where we must work together,\" Dombrovskis said. \"It is up for Turkey to clarify its intentions toward EU and as regards the accession process.\"\nEU Commissioner Johannes Hahn said however, that it was \"crucial\" that the allegations of irregularities are addressed through transparent investigations.\nAddressing the European Parliament in Brussels, Hahn added that \"the close referendum result makes the need to seek a broad consensus all the more important\" in Turkey.\nHungarian Prime Minister Viktor Orban, meanwhile, confirmed that he had congratulated Erdogan on his victory in the referendum.\nOrban said that while the quality of democracy was important, the priority for Europe in Turkey was its stability.\n\"We have to support those who can provide clear-cut stability in Turkey. If there is no stability in Turkey, we all will be in trouble soon,\" Orban said in Brussels. \"The wider European interest about Turkey is to stabilize the country, otherwise the whole region will be on fire and the pressure on the European continent will be unbearable.\"\nOrban has named Turkey as a model for his plans to turn Hungary into an \"illiberal state\"\n__\nAssociated Press writer Pablo Gorondi in Budapest, Hungary and Geir Moulson in Berlin, contributed to this report.","url":"https://www.dailymail.co.uk/wires/ap/article-4447650/Turkish-opposition-challenge-referendum-European-court.html"}
