{"authors":["Frances Martel"],"date_download":"2018-10-30 20:11:31","date_modify":"2018-10-30 20:11:31","date_publish":"2018-07-25 14:56:08","description":"Turkish authorities announced on Wednesday that American Pastor Andrew Brunson has been moved to house arrest to address health concerns.","filename":"data/vaneerConsumption/TurkeyMovesDetainedUSPastorAndrewBrunsontoHouseArrest.json","image_url":"https://media.breitbart.com/media/2017/09/andrewbrunson2.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_07_25__1540930291.html","title":"Turkey Moves Detained U.S. Pastor Andrew Brunson to House Arrest","title_page":"Turkey Moves Detained U.S. Pastor Andrew Brunson to House Arrest","title_rss":"NULL","source_domain":"breitbart.com","text":"Turkish authorities announced on Wednesday that American Pastor Andrew Brunson, detained in 2016 for alleged ties to Islamist and Marxist terrorist groups, has been moved to house arrest to address health concerns.\nBrunson, a native of North Carolina who has preached Christianity in Turkey for decades, was arrested as part of a purge under President Recep Tayyip Erdoğan following a failed coup attempt against him in July 2016. Erdoğan blames Turkish Islamic cleric Fethullah Gulen for organizing the coup and has demanded that the United States extradite Gulen, who resides in Pennsylvania. Erdoğan has openly stated that Brunson’s arrest is an attempt to get the United States to “give us this pastor [Gulen]” in exchange for Brunson.\nBrunson is facing 35 years in prison for alleged involvement with Gulen and the Kurdistan Workers’ Party (PKK), a Marxist, U.S.-designated terrorist organization. Brunson denies the charges, noting that, as a Christian, he has never had any interest in joining an Islamic or Marxist atheist association. American officials have repeatedly condemned his arrest and noted the lack of evidence against him.\nTurkey’s state-run Anadolu news agency reported on Wednesday that a Turkish court in Izmir ruled to move Brunson into house arrest, citing “health problems.” His new detention conditions do not allow him to leave his home in Izmir or, much less, the country, and do not negate the prosecution’s efforts to imprison him for 35 years.\nFollowing a recent visit to Brunson’s cell in April, Sen. Thom Tillis (R-NC) found Brunson in a worrisome state of health.\n“Pastor Brunson is strengthened by his love for his family and his faith in God, but his health has deteriorated,” Tillis said in a statement. “He has lost 50 pounds and spends 24 hours a day in a cell with limited human contact.”\nThe move comes barely a week after, for the third time, the Izmir court decided against releasing Brunson. It also followed significant international attention to his case due to the efforts of the U.S. State Department, which is currently holding its first-ever ministerial on global religious freedom. Brunson’s case was prominently featured, and his daughter, Jaqueline Funari, was invited to speak to a congregation of world religious leaders.\n“Every single thing in his life centers around his faith, which is why seeing these absurd charges brought against him has been extremely painful for my family to witness,” Funari told the assembled. “I’m still waiting for my father to walk me down my aisle. I’m still waiting for my father-daughter dance.”\nSpeaking last week, Secretary of State Mike Pompeo insisted that many people within the Trump administration were “working diligently” to secure Brunson’s return home. “There’s been enormous work done by this administration to try and gain the release of Pastor Brunson,” he said. “We’re working diligently on that case and, frankly, every place an American is held.”\nThe pro-Erdoğan Turkish newspaper Sabah reported that Brunson was arrested “after a secret witness in a criminal probe” identified him as a member of Gulen’s organization, Hizmet, which Ankara refers to as the Fethullahist Terrorist Organization (FETO). He was officially arrested on charges of threatening national security.\nYet Erdoğan has stated a willingness to let him go, even as his prosecutors claim Brunson is so dangerous he deserves to be imprisoned for 35 years.\n“We have given you all the documents necessary [for the extradition of Gülen],” Erdoğan said in September, referring to talks with the United States. “But they say, ‘give us the pastor.’ You have another pastor in your hands. Give us that pastor and we will do what we can in the judiciary to give you this one.”\nFollow Frances Martel on Facebook and Twitter.","url":"https://www.breitbart.com/national-security/2018/07/25/turkey-moves-detained-u-s-pastor-andrew-brunson-house-arrest/"}
