{"authors":["Gareth Davies For Mailonline"],"date_download":"2018-10-23 00:33:14","date_modify":"2018-10-23 00:33:14","date_publish":"2017-04-26 10:19:20","description":"Police launched simultaneous raids across Turkey on Wednesday, detaining hundreds of people with suspected links to exiled preacher Gulen, who denies involvement in the coup.","filename":"data/vaneerConsumption/Turkeyarrestsover1000peopleinnewErdogancrackdown.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9EF74500000578-0-image-a-18_1493202338831.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446850_Turkey-arrests-1-000-people-new-Erdogan-crackdown_1540254794.html","title":"Turkey arrests over 1,000 people in new Erdogan crackdown","title_page":"Turkey arrests over 1,000 people in new Erdogan crackdown | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"More than 1,000 suspects have been detained in a huge new crackdown on alleged supporters of a US-based Muslim cleric blamed for the failed coup.\nThe move comes a week after President Recep Tayyip Erdogan won a referendum on ramping up his powers and his first post-vote target appears to be Fethullah Gulen, the Islamic preacher seen as the mastermind of the attempted government takeover 10 months ago.\nA total of 1,009 suspects - which Turkey's interior minister is labelling secret imams' - have so far been detained in raids in 72 provinces across the country.\nPolice officers escort people, arrested because of suspected links to US-based cleric Fethullah Gulen, in Kayseri, Turkey, Wednesday, April 26, 2017\nTurkish President Recep Tayyip Erdogan made the move a week after he won a referendum to ramp up his powers\nThose arrested are said to have links to exiled Turkish Muslim preacher Fethullah Gulen who has been blamed for masterminding last year's failed coup\nPeople stand on a Turkish army tank at Ataturk airport in Istanbul, Turkey July 16, 2016, during the failed coup\nSoliders involved in the coup attempt surrender on Bosphorus bridge on July 16, 2016 in Istanbul, Turkey\nPolice launched simultaneous operations across Turkey on Wednesday, detaining hundreds of people with suspected links to the American-based cleric Gulen, who denies involvement in the July 15 failed coup.\nInterior Minister Suleyman Soylu described it as an 'important step' towards the government's aim of 'bringing down' the Gulen movement.\nHe said the overnight crackdown targeted a Gulen network 'that infiltrated our police force, called secret imams'.\n'One thousand and nine secret imams have been detained so far in 72 provinces, and the operation is ongoing,' he told reporters in Ankara.\nThe suspects are allegedly Gulen operatives who directed followers within the police force.\nMr Soylu said the individuals 'infiltrated the police, tried to lead it from the outside by forming an alternative police structure, by ignoring the state'.\nDemonstrators wave Turkish flags at Taksim square in Istanbul on July 17, 2016 during a rally in support to the Turkish government following a failed coup attempt\nA man lies in front of a Turkish army tank during a military coup at Ataturk airport in Istanbul, Turkey July 16, 2016\nSome 8,500 police officers participated in the operation, the state-run Anadolu Agency reported.\nThe detentions are part of a widespread crackdown following last summer's failed coup attempt, which Turkey says was orchestrated by Gulen's movement.\nMore than 47,000 people have been arrested since the coup, Mr Soylu has said, including some 10,700 police officers and 7,400 military personnel.\nGulen has denied orchestrating the coup, but Turkey is pressing the United States to extradite him.","url":"https://www.dailymail.co.uk/news/article-4446850/Turkey-arrests-1-000-people-new-Erdogan-crackdown.html"}
