{"authors":["Breitbart London"],"date_download":"2018-10-30 18:37:33","date_modify":"2018-10-30 18:37:33","date_publish":"2017-03-27 08:47:28","description":"ISTANBUL (AFP) - Turkey summoned the Swiss ambassador on Sunday to protest at a Kurdish rally in Bern which Ankara dubbed a \"terrorist gathering\", a diplomatic source said.","filename":"data/vaneerConsumption/TurkeySummonsSwissEnvoyOverKurdishTerroristGatheringRally.json","image_url":"https://media.breitbart.com/media/2016/12/erdogan-1.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_03_27__1540924653.html","title":"Turkey Summons Swiss Envoy Over Kurdish 'Terrorist Gathering' Rally","title_page":"Turkey Summons Swiss Envoy Over Kurdish 'Terrorist Gathering' Rally","title_rss":"NULL","source_domain":"breitbart.com","text":"ISTANBUL (AFP) – Turkey summoned the Swiss ambassador on Sunday to protest at a Kurdish rally in Bern which Ankara dubbed a “terrorist gathering”, a diplomatic source said.\n“Walter Haffner has been summoned to our (foreign) ministry where he has been made aware of our displeasure… The ambassador has been told those responsable must face justice,” the source said.\nSeveral thousand people attended Saturday’s rally called by Kurdish associations and Swiss political parties in Bern.\nAnkara believes the Kurdistan Workers? Party (PKK), which Turkey dubs a terrorist group, was behind the rally where some people brandished a banner showing a gun pointing at President Recep Tayyip Erdogan’s head alongside the words “Kill Erdogan”.\nErdogan criticised the Swiss for hosting the event, warning that “you will reap what you have sown”.\nThe Turkish leader has been angered by the refusal of several European states to allow Turkish ministers to campaign on the continent for a ‘yes’ vote in next month’s referendum on expanding his powers.\nTurkish Foreign Minister Mevlut Cavusoglu had on Saturday informed Swiss counterpart Didier Burkhalter of his country’s anger over the march.\nOn Friday, Swiss prosecutors said they had opened an investigation into alleged spying on Turks living in Switzerland by an unspecified intelligence service after the attorney general’s office cited “concrete suspicions” of espionage.\nBurkhalter has previously voiced concerns about a crackdown in Turkey following a failed July coup against Erdogan that Ankara has blamed on US-based Islamic preacher Fethullah Gulen.","url":"https://www.breitbart.com/europe/2017/03/27/turkey-summons-swiss-envoy-kurdish-terrorist-gathering-rally/"}
