{"authors":["Associated Press"],"date_download":"2018-10-22 23:30:49","date_modify":"2018-10-22 23:30:49","date_publish":"2017-04-26 08:00:31","description":"ANKARA, Turkey (AP) - Turkey on Wednesday detained more than 1,000 people with suspected links to U.S.-based cleric Fethullah Gulen and later temporarily...","filename":"data/vaneerConsumption/Turkey1000detainedoversuspectedlinkstoGulen.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/21/wire-467779-1493237845-143_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446564_Turkey-hundreds-detained-suspected-links-Gulen_1540251049.html","title":"Turkey: 1,000 detained over suspected links to Gulen","title_page":"Turkey: 1,000 detained over suspected links to Gulen | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ANKARA, Turkey (AP) - Turkey on Wednesday detained more than 1,000 people with suspected links to U.S.-based cleric Fethullah Gulen and later temporarily suspended some 9,000 personnel from its police force in one of the largest operations in recent months against the movement that is blamed for last summer's failed military coup.\nPolice launched simultaneous operations in all of Turkey's 81 provinces detaining a total of 1,120 people connected to the police force, the state-run Anadolu Agency reported. Warrants were issued for the detention of 3,224 people, the agency said. It wasn't immediately clear how many of those detained were police officers.\nAbout 8,500 police officers participated in Wednesday's operation, Anadolu reported.\nPolice officers escort people, arrested because of suspected links to U.S.-based cleric Fethullah Gulen, in Kayseri, Turkey, Wednesday, April 26, 2017. Police launched simultaneous operations across the country on Wednesday, detaining hundreds of people with suspected links to U.S.-based cleric Fethullah Gulen. The suspects are allegedly Gulen operatives who directed followers within the police force. (Olay Duzgun/DHA-Depo Photos via AP)\nHours later, more than 9,000 personnel were temporarily removed from the country's police force while they were being investigated for possible ties to Gulen's movement, the agency reported.\nInterior Minister Suleyman Soylu described the nationwide operations as an important step toward the government's aim of \"bringing down\" the Gulen movement.\nThe suspects are allegedly Gulen operatives called \"secret imams\" who are accused of directing followers within the police force.\nSoylu said the individuals allegedly \"infiltrated the police, tried to lead it from the outside by forming an alternative (police) structure, (by) ignoring the state.\"\nThe detentions are part of a widespread crackdown that followed the July 15 failed coup. More than 47,000 people have been arrested since the coup, Soylu has said, including about 10,700 police officers and 7,400 military personnel. More than 100,000 people have been purged from government jobs, including police and teachers.\nTurkey's massive crackdown has soured ties with several European nations and the German government on Wednesday criticized the detention of more than 1,000 people.\nForeign Ministry Spokesman Sebastian Fischer told reporters in Berlin that Germany believes the failed coup needs to be fully investigated \"but the measures must adhere to the rule of law.\"\nFischer said: \"We don't believe arresting 1,000 people so long after the putsch is really proportionate.\"\nGulen has denied orchestrating the coup. Turkey is pressing the United States to extradite him.","url":"https://www.dailymail.co.uk/wires/ap/article-4446564/Turkey-hundreds-detained-suspected-links-Gulen.html"}
