{"authors":["Mary Chastain"],"date_download":"2018-10-30 17:58:59","date_modify":"2018-10-30 17:58:59","date_publish":"2014-12-23 18:57:26","description":"Turkish Pres. Recep Tayyip Erdogan told newlyweds that using birth control is treason against Turkey and will \"dry up\" younger generations.","filename":"data/vaneerConsumption/TurkishPresidentErdoganBirthControlUseIsTreasonAgainstTurkey.json","image_url":"https://media.breitbart.com/media/2014/12/President-of-Turkey-Recep-Tayyip-Erdogan-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2014_12_23__1540922339.html","title":"Turkish President Erdogan: Birth Control Use Is 'Treason' Against Turkey","title_page":"Turkish President Erdogan: Birth Control Use Is 'Treason' Against Turkey | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Turkish President Recep Tayyip Erdogan told a newlywed couple that using birth control is treason against the country, since it will “dry up” the younger generations. The groom is the son of Mustafa Kefeli, one of Erdogan’s allies.\n“One or two (children) is not enough,” he said, and added:\nTo make our nation stronger, we need a more dynamic and younger population. We need this to take Turkey above the level of modern civilisations. In this country, they (opponents) have been engaged in the treason of birth control for years and sought to dry up our generation. Lineage is very important both economically and spiritually. I have faith in you.\nTurkey’s birth rate began to fall in the 1990s, when women chose to pursue higher education, instead of starting a large family. A growing number of women use birth control and choose to start a family in their early thirties. In 2012, then-Prime Minister Erdogan pressed Turkey to outlaw abortion, since Turkey’s birth rate fell to 0.12%, or an average of about two children per woman. In 1978, the average was 4.33 children.\nHe still faces criticisms for his ideas, with some critics stating he wants to implement strict Islamic laws in Turkey. Lawmaker Aylin Nazliaka said Erdogan views women as mere “incubators.”\n“Erdogan has become the president but he continues to act like a guardian,” she said. “Would he talk so blatantly about the female body if he was capable of giving birth to a child?”\nIn November, Erdogan caused more controversy when he stated women are not equal to men and slammed feminists. “You cannot put women and men on an equal footing,” he said. “It is against nature. They were created differently. Their nature is different. Their constitution is different. Motherhood is the highest position. … You cannot explain this to feminists. They don’t accept motherhood. They have no such concern.”","url":"https://www.breitbart.com/national-security/2014/12/23/turkish-president-erdogan-birth-control-use-is-treason-against-turkey/"}
