{"authors":["Associated Press"],"date_download":"2018-10-23 01:49:03","date_modify":"2018-10-23 01:49:03","date_publish":"2017-03-16 11:59:34","description":"ISTANBUL (AP) - A Turkish fashion designer appeared in court on Thursday accused of \"inciting hatred and enmity\" for two social media postings about a deadly...","filename":"data/vaneerConsumption/Turkishdesignerontrialincitedhatredovertweets.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/20/wire-230543-1489694966-809_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319916_Turkish-fashion-designer-trial-offensive-video_1540259343.html","title":"Turkish designer on trial incited 'hatred' over tweets","title_page":"Turkish designer on trial incited 'hatred' over tweets | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ISTANBUL (AP) - A Turkish fashion designer appeared in court on Thursday accused of \"inciting hatred and enmity\" for two social media postings about a deadly New Year's attack at an Istanbul nightclub.\nBarbaros Sansal told The Associated Press after the opening hearing in his trial that he acknowledged having posted one of the tweets, but rejected accusations that it incited hatred. He denied having sent a second tweet that was attributed to him.\nIn a tweet about the nightclub attack that killed 30 people, Sansal made references to the alleged religious affiliations of the club's owner, manager and workers, which prosecutors said was divisive and incited hatred. The tweet he denied composing made similar references.\nFILE - In this Feb. 22, 2017 file photo, Turkish fashion designer Barbaros Sansal poses for a photo in Istanbul, Turkey. A Turkish fashion designer appeared in court on Thursday, March 16, 2017 accused of \"inciting hatred and enmity\" for a video he posted on social media and requested his acquittal of the charges. Barbaros Sansal, who faces a maximum of three years in prison if convicted, rejected the accusations, the private Dogan news agency reported. His lawyer told court that the content of his postings had no discriminatory or violent messages, the agency reported. (AP Photo/File)\nSansal initially faced up to three years in prison, if convicted. However, prosecutors on Thursday reduced the maximum term he faces to six months in prison.\nThe designer separately faces investigation and possible charges for a video he tweeted on New Year's Eve that used the vulgar language and also criticized celebrations \"while there is so much filth, vileness and poverty.\" The video drew criticism from social media users who considered it offensive.\nSansal was expelled on Jan. 2 from Turkish-controlled northern Cyprus, where he was vacationing, and then attacked by unknown assailants on the tarmac at Istanbul's main airport upon his arrival there.\nHe was released from custody earlier this month, but has been barred from leaving Turkey pending the outcome of the trial.\nThe court on Thursday refused to grant Sansal permission to leave Turkey and adjourned the trial until June.\n\"I could not deliver all my orders, I have to cancel my fashion shows and international meetings because I have a travel ban,\" Sansal told the AP.","url":"https://www.dailymail.co.uk/wires/ap/article-4319916/Turkish-fashion-designer-trial-offensive-video.html"}
