{"authors":["The Associated Press"],"date_download":"2018-10-23 05:16:50","date_modify":"2018-10-23 05:16:50","date_publish":"2015-11-24 00:00:00","description":"Turkey claims the plane violated Turkish airspace and ignored repeated warnings. Russia denies that the plane crossed the Syrian border into Turkish skies.","filename":"data/vaneerConsumption/TurkeyConfirmsItShotDownARussianWarPlane.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_11_24_457202554_turkey-confirms-it-shot-down-a-russian-war-plane_1540271810.html","title":"Turkey Confirms It Shot Down A Russian War Plane","title_page":"Turkey Confirms It Shot Down A Russian War Plane : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Turkey Confirms It Shot Down A Russian War Plane\nTurkey shot down a Russian warplane Tuesday, claiming it had violated Turkish airspace and ignored repeated warnings. Russia denied that the plane crossed the Syrian border into Turkish skies.\n\"We are looking into the circumstances of the crash of the Russian jet,\" Russia's Defense Ministry said. \"The Ministry of Defense would like to stress that the plane was over the Syrian territory throughout the flight.\"\nRussia said the Su-24 was downed by artillery fire, but Turkey claimed that its F-16s fired on the Russian plane after it ignored several warnings. The ministry said the pilots parachuted but added that Moscow had no further contact with them.\nVideo footage of the incident showed a warplane on fire before crashing on a hill and two crew members apparently parachuting safely.\nTurkey's private Dogan news agency said two Russian helicopters, flying low over the Turkmen Bayirbucak region, searched for the two pilots.\nA Turkish military statement said the plane entered Turkish airspace over the town of Yayladagi, in Hatay province.\n\"On Nov. 24, 2015 at around 09.20 a.m, a plane whose nationality is not known violated the Turkish airspace despite several warnings (10 times within five minutes) in the area of Yayladagi, Hatary,\" the military said before the plane's nationality was confirmed.\n\"Two F-16 planes on aerial patrol duty in the area intervened against the plane in question in accordance with the rules of engagement at 09.24 a.m.\"\nIt said the plane was warned 10 times within the space of 5 minutes.\nOn Friday, Turkey's Foreign Ministry summoned the Russian ambassador demanding that Russia cease operations in Syria targeting Turkmen villages, saying the Russian actions did not \"constitute a fight against terrorism\" but the bombing of civilians. Ambassador Andrey Karlov was warned during the meeting that the Russian operations could lead to serious consequences, the ministry said.\nSyrian troops have been on the offensive in the area that is controlled by several insurgent groups including al-Qaida's branch in Syria, the Nusra Front, and the 2nd Coastal Division that consists of local Turkmen fighters.\nRami Abdurrahman, who heads the Britain-based Syrian Observatory for Human Rights, said the warplane crashed in the Turkmen Mountains region in the coastal province of Latakia.\nThe Turkomen Mountains region has been subjected to a government offensive in recent days under the cover of Russian airstrikes.\nLast month, Turkish jets shot down an unidentified drone that it said had violated Turkey's airspace.\nTurkey changed its rules of engagement a few years ago after Syria shot down a Turkish plane. According to the new rules, Turkey said it would consider all \"elements\" approaching from Syria an ennemy threat and would act accordingly.\nFollowing earlier accusations of Russian intrusion into Turkish airspace, the U.S. European Command on Nov. 6 deployed six U.S. Air Force F-15 fighters from their base in Britain to Incirlik Air Base in Turkey to help the NATO-member country secure its skies.\nThe European Command said the deployment was \"in response to the government of Turkey's request for support in securing the sovereignty of Turkish airspace.\"\nIn October, NATO's governing body, the North Atlantic Council, had warned Moscow it was courting \"extreme danger\" by sending planes into Turkish air space.","url":"https://www.npr.org/2015/11/24/457202554/turkey-confirms-it-shot-down-a-russian-war-plane"}
