{"authors":["John Hayward"],"date_download":"2018-10-30 20:11:42","date_modify":"2018-10-30 20:11:42","date_publish":"2016-08-15 00:00:36","description":"Turkey, long firmly opposed to the Assad regime in Syria, has accepted a role for the \"existing political leadership\" in peace talks.","filename":"data/vaneerConsumption/TurkeyNotOpposedtoAssadRoleinSyriaPeaceTalks.json","image_url":"https://media.breitbart.com/media/2016/08/2010-photo-turkey-erdogan-syria-assad-shaking-hands-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_08_14__1540930302.html","title":"Turkey 'Not Opposed' to Assad Role in Syria Peace Talks","title_page":"Turkey 'Not Opposed' to Assad Role in Syria Peace Talks","title_rss":"NULL","source_domain":"breitbart.com","text":"The Turkish government, a longtime firm opponent to the Assad regime in Syria, has accepted a role for the “existing political leadership” in peace talks.\nThe concession came, rather significantly, from Turkey’s ambassador to Russia, Umit Yardim. According to Hurriyet Daily News, Yardim also said his government was “not opposed to the current Syrian leadership playing some kind of a role in a possible political transition.”\nHowever, Hurriyet also quotes Turkish Foreign Minister Mevlut Cavusoglu stating that a “political transition” involving current Syrian dictator Bashar Assad was not possible.\nThe Russians, meanwhile, made it clear they would be a big part of the “political transition” by announcing they would expand their Hmeimim airbase in Syria into a permanent Russian military base.\n“The appropriate infrastructure will be built and our servicemen will live in worthy conditions,” declared Frants Klintsevich, deputy head of the Russian senate’s committee for defense.\nNot only will the servicemen have plenty of elbow room, but the number of warplanes based at the facility could increase, although Klintsevich said there would be no nuclear weapons or heavy bombers at Hmeimim.\nAl-Jazeera reported on Thursday that Turkey has called upon Russia to carry out joint military operations against the Islamic State, with Cavusoglu calling ISIS the “common enemy” of the two nations.\n“Let’s fight against the terrorist group together, so that we can clear it out as soon as possible,” Cavusoglu urged, adding that close cooperation would help avoid “mistakes” as numerous countries work to eliminate the Islamic State. Although he did not specifically refer to it, one such “mistake” has been weighing heavily on the Russian mind: the Turkish downing of a Russian warplane along the Syrian border in November.\nAs Al-Jazeera points out, not long ago Turkey was accusing Russia of ignoring ISIS to carry out massacres of civilians hostile to the Assad regime, so it seems clear that at least Turkey’s rhetoric has softened as ties with Russia were restored.\nSoftening its stance toward Assad to curry favor with Russian President Vladimir Putin is not easy for Turkey. The Syrian government has loudly blamed Turkey for driving the civil war against Assad’s rule; when word reached Syria that Turkish President Recep Tayyip Erdogan might have been overthrown in a coup, celebratory gunfire rang through the streets.\nThe wild card in the Syrian political equation is that rebel forces thought to be on their last legs, after an Assad offensive backed by Russian air power, seem to have pulled off a startling comeback in the besieged city of Aleppo, with ethnic Turkish fighters described as a “decisive factor in the battle.”\n“We don’t want Syria’s disintegration, but the departure of Bashar Assad,” Erdogan insisted to Russia’s Tass news agency. The chances of overthrowing Assad with military force seem remote, and Assad will never agree to a “political solution” that makes it apparent he was kicked out of Damascus to satisfy groups he has excoriated as “terrorists.” Turkey obviously wants a seat at the table as the military conflict transitions to a high-stakes political game.","url":"https://www.breitbart.com/national-security/2016/08/14/turkey-fine-whatever-assad-can-part-peace-talks/"}
