{"authors":["Aaron Klein","Ali Waked"],"date_download":"2018-10-30 21:06:16","date_modify":"2018-10-30 21:06:16","date_publish":"2016-07-17 16:40:19","description":"Turkey is convinced Arab countries were involved in Friday night's failed coup attempt against President Recep Tayyip Erdogan.","filename":"data/vaneerConsumption/TurkeyConvincedEgyptUAEBehindCoupAttempt.json","image_url":"https://media.breitbart.com/media/2016/07/turkey-coup-attempt.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_07_17__1540933576.html","title":"Turkey Convinced Egypt, UAE Behind Coup Attempt","title_page":"Arab Intel Source: Turkey Convinced Egypt, UAE Behind Coup Attempt","title_rss":"NULL","source_domain":"breitbart.com","text":"Turkey is convinced Arab countries were involved in Friday night’s failed coup attempt against President Recep Tayyip Erdogan, an Arab intelligence source told Breitbart Jerusalem.\nThe source said that Ankara believes the UAE and Egypt, two of the bitterest enemies of the Muslim Brotherhood in the Arab world, sought to undermine Erdogan’s regime, one of the movement’s staunchest allies and sponsors.\nTurkish embassies and intelligence agents across the Middle East have been trying to accumulate damning evidence of the involvement of these countries’ espionage agencies in the failed coup, he added.\nTurkey has also inquired whether the Turkish cleric Fethullah Gulan, Erdogan’s US-based arch-nemesis, visited the UAE last week to finalize plans for the coup attempt.\n“Since Friday, Turkey has reviewed every possible piece of evidence supposedly linking the UAE and Egypt to the attempted coup,” he said.\nIf Gulan indeed visited the UAE, the Turks will have their smoking gun. They are also looking into the role played by Mohammed Dahlan, formerly a top Palestinian Authority official, who is currently a close adviser to Prince Muhammad Bin Zayed, the heir to the UAE throne, and their ally President Abdel Fatah Sisi of Egypt. Turkey sees Dahlan as the centerpiece of an international anti-Muslim Brotherhood network.\nThe source said the allegations have yet to be substantiated, “but Turkey will not sit back if it turns out the UAE or Egypt were involved in plotting the coup in any way, shape, or form.”\nAccording to reports , Egypt blocked a United Nations Security Council resolution that would have condemned the coup attempt in Turkey, with Cairo reportedly objecting to a statement that called on all parties to “respect the democratically elected government of Turkey.”\nEgypt later denied blocking the pro-Erdogan text.\nOn Saturday, Erdogan blamed Gulen, who lives in self-imposed exile in Pennsylvania, for involvement in the coup attempt and called on the Obama administration to extradite the cleric.\n“Today, after this coup attempt, I’m once again calling on you, I’m saying: Extradite this man in Pennsylvania to Turkey now,” Erdogan said in televised remarks appealing directly to Obama.\nGulen in turn threw an accusation back at Turkey’s president. “There is a slight chance, there is a possibility that it could be a staged coup,” Gulen told reporters, speaking through a translator at his Pennsylvania compound. “It could be meant for court accusations and associations.”\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.","url":"https://www.breitbart.com/middle-east/2016/07/17/arab-intel-source-turkey-convinced-egypt-uae-behind-coup-attempt/"}
