{"authors":[],"date_download":"2018-10-30 18:50:00","date_modify":"2018-10-30 18:50:00","date_publish":"2015-07-22 15:10:36","description":"A hospital-management firm that specializes in rescuing financially-ailing hospitals intends to buy Southern Regional Medical Center, The Atlanta Journal-Constitution has learned.","filename":"data/vaneerConsumption/TurnaroundspecialisttobuySouthernRegionalMedicalCenter.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/07/22/Images/photos.medleyphoto.7730217.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_t_1c0af337392f493842d23dd97cecb2cc__1540925400.html","title":"Turnaround specialist to buy Southern Regional Medical Center","title_page":"Turnaround specialist to buy Southern Regional Medical Center","title_rss":"NULL","source_domain":"ajc.com","text":"A hospital-management firm that specializes in rescuing financially-ailing hospitals intends to buy Southern Regional Medical Center, The Atlanta Journal-Constitution has learned.\nPrime Healthcare Services has sent a letter of intent to hospital board as well as the Clayton County Board of Commissioners to acquire the assets of the 331-bed Riverdale hospital, which has posted financial losses since 2007, due in large part, to an influx of uninsured patients.\nTuesday night, commissioners signed a letter of intent turning the hospital’s county-owned property over to the hospital authority, which will sell the hospital and grounds to Prime Healthcare, Chairman Jeff Turner told The Atlanta Journal-Constitution Wednesday.\n“I’m glad Prime Health Care intends to buy,” Turner said. “They felt the community needed a hospital and they were in a position to help.”\nCounty voters last year agreed to a $50 million bailout as part of a Special Local Option Sales Tax package and this year the county has given money to help the hospital, which was weeks away from closing had it not gotten a buyer.\nPrime Healthcare has saved 34 hospitals and 35,000 jobs in 10 states, according to its website. It is the largest “minority-owned” hospital system in America, the website also noted.","url":"https://www.ajc.com/news/local-govt--politics/turnaround-specialist-buy-southern-regional-medical-center/dkK7MBfh8ob9kEnwMzWuYK/"}
