{"authors":["Rodney Ho"],"date_download":"2018-10-30 21:05:57","date_modify":"2018-10-30 21:05:57","date_publish":"2016-12-25 07:00:59","description":"This was posted on Sunday, December 25, 2016 by Rodney Ho on his AJC Radio & TV Talk blog...","filename":"data/vaneerConsumption/TVbestbetswithNewYearsspecialsTheMickTheRansomSher.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/23/Images/WPIMAGE_cmgajcradiotvtalk_43332.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_radiotvtalk_best-bets-_67a48fde16b42690c83befc6c33a201e__1540933557.html","title":"TV best bets with New Year's specials, 'The Mick,' 'The Ransom,' 'Sher","title_page":"TV best bets with New Year's specials, 'The Mick,' 'The Ransom,' 'Sher","title_rss":"NULL","source_domain":"ajc.com","text":"This was posted on Sunday, December 25, 2016 by Rodney Ho on his AJC Radio & TV Talk blog\nRyan Seacrest on ABC faces the usual competitors Saturday on New Year's Eve: Pitbull on Fox, Carson Daly on NBC and Anderson Cooper and Kathy Griffin on CNN. Fox brings in a couple of its \"Five\" hosts for that network's celebration. MTV is skipping the festivities this year.\nOtherwise, the week leading up to that day is pretty much repeat city for broadcast networks while a handful of cable networks bravely cart out original programming: History, A&E and Food Network among them.\nOn Sunday night, the first of 2017, most original programming is back, including a new season of \"Sherlock\" and three new shows: Fox's comedy \"The Mick,\" CBS's \"The Ransom\" and Freeform's \"Beyond.\"\nThis covers Monday, December 26 through Sunday, January 1, 2017.\nMONDAY\n“Every Brilliant Thing” 8 p.m. HBO — Jonny Donahoe performs in a one-person play about a man who came of age with a suicidal mother.\n“Cake Wars” 9 p.m. Food — The Rose Bowl game is celebrated by four bakers trying to score a win with their college football-theme cakes.\n“Street Outlaws” 9 p.m. Discovery— The 405 racers head to Memphis to compete against JJ \"Da Boss.\"\n“America's Next Top Model” 10 p.m. VH1 — The judges choose signature looks for each model.\n“Booze Traveler” 9 p.m. Travel — Jack Maxwell is inspired by a Russian man's story about the \"greatest drink ever,\" so much so that he travels across Siberia on a quest for this special libation.\nTUESDAY\n“Chopped Junior” 8 p.m. Food — Ground beef and chocolate present a dilemma for the competitors in Round 1.\n“Bizarre Foods America” 9 p.m. Travel — Andrew Zimmern travels to some of the coldest, most inhospitable places on Earth in search of bizarre foods eaten by those who live below freezing.\n“The 39th Annual Kennedy Center Honors” 9 p.m. CBS — Stephen Colbert hosts the 39th annual celebration in Washington, D.C., honoring Argentine pianist Martha Argerich, rock band the Eagles, actor Al Pacino, gospel and blues singer Mavis Staples and musician James Taylor.\n“No Tomorrow” 9 p.m. the CW — Xavier confronts his father and Evie brings up their past.\n“Good Behavior” 9 p.m. TNT — Letty reverses roles with her mother to help bail her out of jail.\n“Leah Renini, Scientology and the Aftermath” 10 p.m. USA — Fundraisers are examined as Leah sits down with a former organizer who planned events for the church through the Golden Era production company.\n“Shooter” 10 p.m. USA — Bob Lee travels across the country in order to find the shooter. The drama was just given a second season.\nWEDNESDAY\n“Undercover Boss” 8 p.m. CBS — New York & Company CEO Greg Scott finds one of his stores in disarray.\n“Duck Dynasty” 9 p.m. A&E — Willie faces the challenge of coming up with a romantic gesture for Korie without spending any money.\n“Vikings” 9 p.m. History — Ragnar and Ivar plot against the Saxons and reach a new level of understanding.\n“Incorporated” 10 p.m. USA — Ben improvises when Roger closes in on the truth about Elena.\n“My Kid's Obsession” 10 p.m. TLC — Five kids show off their unique and unusual collections that they've spent years gathering, including the world's largest collection of fishing lures, an unusual set of vacuums and one kid's fascination with fans.\nTHURSDAY\n“Project Runway” 9 p.m. Lifetime — The season 15 reunion.\n“Chopped” 9 p.m. Food (31st season finale) — The network runs three seasons per year. It debuted in 2007.\n“Alone ” 9 p.m. History — The remaining participants are forced to get creative due to a lack of food.\n“The Selection” 10 p.m. History — In a stealth and concealment exercise, the participants go out on the ultimate game of hide and seek.\n“Night Watch” 10 p.m. A&E — The men and women who serve New Orleans reflect on the risks they take.\n“Top Chef” 10 p.m. Bravo — The chefs face a mountain of baking ingredients pointing to a biscuit challenge.\nFRIDAY\n“Caught on Camera With Nick Cannon” 8 p.m. NBC (third season finale) — Thrilling and chilling videos are presented. Included: the people behind the stories.\n“Married to Medicine” 8 p.m. Bravo — Toya and Eugene face the issue of moving into a smaller home.\n“Doomsday: 10 Ways the World Will End” 9 p.m. History — Rogue aliens launch a surprise attack on Earth, destroying cities, obliterating world governments and unleashing a deadly virus.\n“Alaskan Bush People” 9 p.m. Discovery — The Brown family reaches the end of one of the toughest years in the wilderness of Alaska.\nWEEKEND\n“Pitbull's New Year's Revolution” 11 p..m. to 12:30 a.m. Saturday Fox — Pitbull is joined by Queen Latifah and Snoop Dogg in the countdown to 2017 at Miami's Bayfront Park; scheduled performers include Biz Markie, Coolio, Naughty by Nature, Rob Base, Salt-N-Pepa, Tone Loc and Young MC.\n“New Year's Eve Live With Anderson Cooper and Kathy Griffin” 8 p.m. to 12:30 a.m. Saturday CNN — Prediction: Kathy Griffin will say numerous inappropriate things that will embarrass Anderson Cooper.\n“NBC's New Year's Eve With Carson Daly” 8 p.m.-11 p.m., 11:30 p.m.-12:30 a.m. Saturday TNT — Performers include Alicia Keys, Pentatonix, Blake Shelton and Jennifer Lopez.\n“Dick Clark's Primetime New Years Eve With Ryan Seacrest 2017” 8 p.m.-11 p.m., 11:30 a.m.-2 a.m. Saturday ABC — Mariah Carey and Lionel Richie are among the performers.\n“All-American New Year” 11 p.m. Saturday Fox News — Eric Bolling and Kimberly Guilfoyle host.\n“The Librarians” 8 p.m. Sunday TNT— Cindy Kroger suddenly becomes popular thanks to a magical love potion.\n“The Mick” 8 p.m. Sunday Fox (new series) — A boldly immoral woman moves to an affluent area to raise her spoiled niece and nephews after their parents flee the country to avoid prosecution.\n“The Ransom” 8:30 p.m. Sunday CBS (new series) — Hostage negotiator Eric Beaumont and his team save lives using insight into criminal behavior; Maxine is eager to prove herself but harbors a dangerous secret from her past.\n“Beyond” 9 p.m. Sunday Freeform (new series) — Holden Matthews wakes up from a 12-year coma with strange abilities and memories he cannot explain.\n“Sherlock” 9 p.m. Sunday GPB (fourth season debut) — Sherlock Holmes returns to Britain as Watson and his wife prepare for their first child.\n“To Tell the Truth” 8:30 p.m. Sunday ABC (second season debut) — Celebrity panelists Jalen Rose, Ashley Graham, Angela Kinsey and Donald Faison.\n“Conviction” 10 p.m. Sunday ABC — Hayes urges the CIU team to pursue the case of a woman serving a life sentence for murdering a popular college basketball player whom she accused of raping her.\n“The Royals” 10 p.m. Sunday E! — Jasper and Eleanor immerse themselves in their relationship while Liam must reappraise his latest tryst","url":"https://www.ajc.com/blog/radiotvtalk/best-bets-with-new-year-specials-the-mick-the-ransom-sherlock/lUDzp3lsC6nKLGLsNVCNLL/"}
