{"authors":["Nicole Pomarico"],"date_download":"2018-10-31 01:42:52","date_modify":"2018-10-31 01:42:52","date_publish":"2018-08-28 00:41:39","description":"Knowing who Chris and Krystal are from their respective seasons of The Bachelorette and The Bachelor, it pretty much goes without saying that the relationship they had was going to be intense. But on Monday night's episode of Bachelor in Paradise,…","filename":"data/vaneerConsumption/TweetsAboutKrystalChrisBachelorInParadiseLoveTriangleWithConnorAreSoBrutalItHurts.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/0db8f842-3b0e-4086-9fa5-b16647bbd58b-149577_3080.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_tweets-about-krystal-chris-bachelor-in-paradise-love-triangle-with-connor-are-so-brutal-it-hurts-10258033_1540950172.html","title":"Tweets About Krystal & Chris 'Bachelor In Paradise' Love Triangle With Connor Are So Brutal, It Hurts","title_page":"Tweets About Krystal & Chris 'Bachelor In Paradise' Love Triangle With Connor Are So Brutal, It Hurts","title_rss":"NULL","source_domain":"bustle.com","text":"Knowing who Chris and Krystal are from their respective seasons of The Bachelorette and The Bachelor, it pretty much goes without saying that the relationship they had was going to be intense. But on Monday night's episode of Bachelor in Paradise, they faced their first real drama as a couple, and Twitter is loving it. So far, the tweets about Krystal and Chris on BiP and the love triangle that has now formed between them and Connor have turned out to be so brutal, and even though this is clearly an entertaining plot twist, it definitely doesn't seem like it's going to end well.\nTo be fair, their relationship clearly wasn't on too steady of a ground if Krystal was talking to Chris about whether or not he was ready for marriage about five minutes before she did a total 180 when Connor walked in, claiming that she's just been wasting time until he showed up because he was who she was there for. Of course, when he offered her his date card, he said yes... and as a courtesy, Krystal reluctantly pulled Chris aside to deliver the bad news.\nAs you can expect, he did not take it well. Chris is known for his temper, after all, and Krystal wasn't really affected by his disappointment, because she let out the most epic \"byeeee\" as she flitted off for her date, and fans can't get enough.\nA lot of people are tweeting about how brutal that moment was for Chris, although, Krystal was totally within her rights.\nOthers were simply content to bask in Chris' misfortune, being that he's never exactly been a fan favorite. (Come on, who could defend his meltdown on Becca's season of The Bachelorette?) Despite his gospel choir apology, it doesn't seem like he's changed that much in his attitudes towards women since then, so maybe Krystal is right to try and protect her heart, and her BiP options.\nAnd for the record, this first tweet is correct. He did, in fact, have a meltdown, as expected.\nOne person even attempted to defend Chris, saying that he's not as bad as people make him out to be... but considering the toxic masculinity he's displayed (remember when he showed up unannounced where Becca was staying after displaying some seriously erratic behavior?), it's hard to give him a break here. He might be trying to avoid making the same mistakes with Krystal that he did while dating Becca in his last reality TV relationship, but so far, he hasn't earned the benefit of the doubt from viewers.\nAs much as Chris seems like he wants Krystal to pick him, obviously, this decision is up to her only. And if she wants to take the opportunity to run far, far away from the man who suddenly calls himself Goose, who would really blame her?\nBiP is about playing the field, so maybe this will be a good lesson for everyone involved... or maybe it'll just create more drama. Yeah, it's probably the second one.","url":"https://www.bustle.com/p/tweets-about-krystal-chris-bachelor-in-paradise-love-triangle-with-connor-are-so-brutal-it-hurts-10258033"}
