{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 18:20:30","date_modify":"2018-10-30 18:20:30","date_publish":"2016-06-17 15:46:28","description":"Louisiana now has the dubious distinction as the state with the highest reported number of recently resettled refugees with active TB —at least among the five states that have confirmed to Breitbart that refugees resettled in their state have either arrived with active TB, or developed it within the first year of their arrival. | Politics","filename":"data/vaneerConsumption/TwentyOneRefugeeswithActiveTBSenttoLouisianaSince2011.json","image_url":"https://media.breitbart.com/media/2016/06/GettyImages-467407934.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_17__1540923630.html","title":"Twenty-One Refugees with Active TB Sent to Louisiana Since 2011","title_page":"Twenty-One Refugees with Active TB Sent to Louisiana Since 2011 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Twenty-one of the 1,579 refugees sent by the federal government to Louisiana between 2011 and 2015 developed active tuberculosis (TB) within one year of their arrival, the Louisiana Department of Health and Hospitals tells Breitbart News.\nLouisiana now has the dubious distinction as the state with the highest reported number of recently resettled refugees with active TB —at least among the five states that have confirmed to Breitbart that refugees resettled in their state have either arrived with active TB, or developed it within the first year of their arrival.\nAs Breitbart News reported previously, eleven refugees with active TB were sent to Florida since 2013, four refugees with active TB were sent to Indiana in 2015, ten refugees with active TB were sent to Colorado since 2011, and nine refugees with active TB were sent to one county (Fayette) in Kentucky since 2013.\nFour percent of the general population in the United States has LTBI, while approximately 33 percent of the rest of the world has it.\nA person with LTBI does not have active TB, but is in danger of developing it at some point in their life. Ten percent of those with LTBI develop active TB. Scientists and doctors are not sure why one person with LTBI develops active TB while another does not, but it is known that if a person with LTBI experiences a reduction in their immunity system, the risk that the latent tuberculosis bacteria already inside them will become activated increases.\nNumerous medical studies, including a 2013 study from UC San Diego, have concluded that high rates of LTBI among resettled refugees presents a public health risk to the community. This arises in part due to the higher tendency of refugees with LTBI to develop active TB.\n258 of Louisiana’s total of 1,579 refugees who arrived between 2011 and 2015, or 16 percent, came from Myanmar, a country with one of the highest rates of active TB and latent TB infection (LTBI) in the world. 236, or 15 percent, came from Cuba, 235, another 15 percent, came from Iraq, and 137, or 8 percent, came from the Philippines.\nLTBI rates among resettled refugees in the nine states for which Breitbart News has been able to obtain this important public health data range from 35 percent in Vermont to 27 percent in Tennessee to 15 percent in Texas to 12 percent in California.\nLouisiana, like Tennessee and Kentucky, is one of fourteen states that have withdrawn from the federal refugee resettlement program where the Office of Refugee Resettlement (ORR) has hired a local voluntary agency (VOLAG) to resettle refugees under the statutorily questionable Wilson Fish alternative program.\nIn Louisiana, Catholic Charities of Baton Rouge has been selected by ORR to operate the program.\nIn April, the Tennessee General Assembly declared its intention to file a Tenth Amendment lawsuit against the federal government. One argument advanced by proponents of the lawsuit is that requiring Tennessee taxpayers to pay for the medical expenses, welfare expenses, food and lodging expenses, and English Language Learning expenses of refugees forced upon it by a federal program from which the state has withdrawn amounts to an unfunded mandate.\nOnly states that have withdrawn from the program can make such an argument.\nOn Wednesday, a federal court dismissed a lawsuit filed by the state of Texas, which has not withdrawn from the federal program, on behalf of the state’s Health and Human Services Commission, to end the resettlement of Syrian refugees in the state on the grounds that Texas not have a cause of action, even though Texas argued refugees are resettled in the Lone Star State by resettlement agencies without the “consultation” required by the enabling Refugee Act of 1980.\nBreitbart News reported previously that the Texas lawsuit had little chance of success, since the “consultation” requirement of the Refugee Act of 1980 could be made by the federal government by simply pointing out the federal agencies involved informed Texas of their actions in a simple phone call after the fact.\n“We are currently evaluating all options and working with the [Texas] Health and Human Services Commission to plan a course of action,” was all a spokesperson for Texas Attorney General Ken Paxton told Breitbart News when asked if Gov. Greg Abbot would withdraw Texas from the federal refugee resettlement program, and then sue the feds on Tenth Amendment grounds, as Tennessee is doing.\nThe volume of refugees arriving annually in Texas is far greater than in Louisiana. In 2014 alone, for instance, 13,785 refugees were sent to Texas by the federal government, “an increase from the 10,729 arrivals in … 2013.”\nOnly 66 percent of the 1,579 refugees sent to Louisiana during this five year period, or 1,043, completed domestic medical screenings within 90 days of their arrival. The Louisiana Department of Health did not have information on the number of this group who tested positive for LTBI.\nHowever, the 21 cases of active TB were diagnosed from among this group.\nIt is not known how many of the 536 refugees, or 34 percent of the total, sent to Louisiana during this five year period who did not participate in the domestic medical screening, may have gone on to develop active TB.\n273 of the 1,579 refugees who arrived between 2011 and 2015 were already flagged in their overseas medical screening as having been diagnosed with “TB, clinically active, not infectious” (Risk Class B1), latent TB infection (LTBI) (Risk Class B2), or had recent contact with someone who had active TB (Risk Class B3).\nSubsequent medical information was tracked only for 107 in this group who arrived in 2014 and 2015.\nOf those, only 68, or 64 percent, completed their domestic medical screening within 90 days of arriving in Louisiana.\nThese 68 had an extraordinarily high rate of LTBI. 86 percent of them, or 57, tested positive for LTBI. Of those who tested positive, only 79 percent, or 45, successfully completed LTBI treatment within one year.\nThe Louisiana Department of Health and Hospitals did not provide data on the LTBI rates for the entire population of 1,579 refugees who arrived in Louisiana between 2011 and 2015.","url":"https://www.breitbart.com/politics/2016/06/17/twenty-one-refugees-active-tb-sent-louisiana-since-2011/"}
