{"authors":["Christine Distasio"],"date_download":"2018-10-30 23:04:58","date_modify":"2018-10-30 23:04:58","date_publish":"2014-08-14 02:33:31","description":"Sigh, true romance really might last forever. Just because it's been two years since the final Twilight Saga film premiered in 2012, doesn't mean we should forget about the great romance Stephanie Meyer's franchise brought us. And the semi-great…","filename":"data/vaneerConsumption/TwilightsEdwardCullenBellaSwanHaveBeenMarriedFor8YearsSoCelebrateWithThese8Gifs.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/9048af06-b9ae-4ab5-a900-e1b91886557d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35709-twilights-edward-cullen-bella-swan-have-been-married-for-8-years-so-celebrate-with-these_1540940698.html","title":"'Twilight's Edward Cullen & Bella Swan Have Been Married For 8 Years So Celebrate With These 8 Gifs","title_page":"'Twilight's Edward Cullen & Bella Swan Have Been Married For 8 Years So Celebrate With These 8 Gifs","title_rss":"NULL","source_domain":"bustle.com","text":"Sigh, true romance really might last forever. Just because it's been two years since the final Twilight Saga film premiered in 2012, doesn't mean we should forget about the great romance Stephanie Meyer's franchise brought us. And the semi-great romance she brought to K-Stew and R-Patz. Not that we could ever forget Kristen Stewart walking down the aisle in that beautiful Carolina Herrera wedding gown or Edward and Bella's vows of undying love. Right, guys? Twilight's Edward Cullen and Bella Swan are celebrating their eighth anniversary today (or third, if we're counting in movie years), Aug. 13 — so hopefully the Volturi don't gate-crash whatever party the Cullens are throwing for them.\nRaise your glasses, Twihards. According to this Twilight timeline, Edward and Bella were married on Aug. 13, 2006 in Meyer's book series. And even though eight years is probably nothing to them, considering they're immortal and essentially have endless anniversary's ahead, there's still cause for super-fans to celebrate. Because we loved them, even when their love got a little creepy at times (what with Edward watching Bella sleep and whatnot).\nMr. and Mrs. Cullen are probably spending their anniversary ripping the heads off of some Volturi members or completely demolishing the Cullen family's vacation house. So, naturally, we're celebrating with these romantic GIFs:\nSigh.\nSwoon.\n#Passion\nAdorable.\nHe wrote this song for her.\nSo much kissing.\nThe truest sign of love.\nAnd last but not least — the best.\nImages: Summit, Fanpop, Teen, Wifflegif (4), Giphy","url":"https://www.bustle.com/articles/35709-twilights-edward-cullen-bella-swan-have-been-married-for-8-years-so-celebrate-with-these"}
