{"authors":[],"date_download":"2018-10-22 21:45:09","date_modify":"2018-10-22 21:45:09","date_publish":"2014-06-06 10:10:07","description":"It was the first such attack during the election campaign, which has entered a runoff between Abdullah and ex-Finance Minister Ashraf Ghani Ahmadzai.","filename":"data/vaneerConsumption/TwinBlastsHitAfghanPresidentialFrontrunnerAbdullahsConvoy.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/491496/140606-kabul-bomb_2_ac92ea7e76db5c5bd1abb8422fbb3542.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_afghanistan-election_twin-blasts-hit-afghan-presidential-frontrunner-abdullahs-convoy-n124286_1540244709.html","title":"Twin Blasts Hit Afghan Presidential Frontrunner Abdullah's Convoy","title_page":"Twin Blasts Hit Afghan Presidential Frontrunner Abdullah's Convoy","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nKABUL, Afghanistan — Two suicide car bombs targeted the convoy Afghan presidential front runner Abdullah Abdullah on Friday, killing six people but leaving the former foreign minister unhurt.\nAt least 23 people were injured when the explosions struck the vehicles traveling through western Kabul, according to Ministry of the Interior spokesman Sediq Sediqqi.\nWhile the SUV carrying Abdullah was destroyed after a vehicle — which a police source told NBC News was placed in a Toyota Corolla — slammed into it, the candidate appeared at a campaign rally within a half hour and assured the audience that he was unscathed.\nWithin seconds of the first blast, a second car bomb hit the car Abdullah's running-mate, Mohammad Khan. While his vehicle was destroyed, Kahn was unhurt, according to Abdullah's spokesperson Fazel Sancharaki.","url":"https://www.nbcnews.com/storyline/afghanistan-election/twin-blasts-hit-afghan-presidential-frontrunner-abdullahs-convoy-n124286"}
