{"authors":["Abigail Miller For Dailymail.Com"],"date_download":"2018-10-22 22:21:21","date_modify":"2018-10-22 22:21:21","date_publish":"2017-04-26 04:22:48","description":"Twin girls, Kalani and Jarani Dean, from Illinois shocked the world a year ago when they were born with different skin colors. They celebrated their first birthday on Sunday, April 23.","filename":"data/vaneerConsumption/Twingirlswithdifferentskincolorscelebratebirthday.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/03/3F9BDABC00000578-0-image-a-39_1493175021584.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446154_Twin-girls-different-skin-colors-celebrate-turning-1_1540246881.html","title":"Twin girls with different skin colors celebrate birthday","title_page":"Twin girls with different skin colors celebrate birthday | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Twin girls from Illinois shocked the world a year ago when they were born with different skin colors.\nKalani and Jarani Dean celebrated their first birthdays' on Sunday, a year after their birth received widespread media attention.\nDespite being twins, Kalani has light skin and blue eyes, while Jarani has dark skin and brown eyes.\nKalani (right in each photo) and Jarani (left) Dean each turned one-year-old on Sunday, a year after their birth received widespread media attention\nThe twins' parents are Whitney Meyer and Tomas Dean, from Quincy, Illinois, and have been posting pictures of their adorably-unique pair since they were born in April 2016.\nThe girls have become very popular on social media, despite being unable to control their own accounts.\nThey are fraternal twins, and in that situation, the children inherit different combinations of genes from each parent.\nDespite being twins, Kalani has light skin and blue eyes, while Jarani has dark skin and brown eyes\nMeyer is white, and Dean is black,so each of the girls inherited slightly different genes determining their skin colors.\nMeyer said she was immediately surprised when she saw her daughters, born in April 2016, for the first time.\nThe twins' parents are Whitney Meyer and Tomas Dean, from Quincy, Illinois, and have been posting pictures of their adorably-unique pair since they were born in April 2016. The family is pictured at the girls' first birthday celebration\n'I asked the doctor why Kalani's skin was so white!' Meyer told US Weekly.\n'I couldn't figure out why she looked so different her sister.'\nThere is a 1 in 500 chance that interracial couples expecting twins will have children with different skin colors, according to the BBC.","url":"https://www.dailymail.co.uk/news/article-4446154/Twin-girls-different-skin-colors-celebrate-turning-1.html"}
