{"authors":[],"date_download":"2018-10-22 20:46:02","date_modify":"2018-10-22 20:46:02","date_publish":"2014-05-03 18:27:09","description":"Three people were killed by blasts in Kenya's port city, Mombasa, on Saturday. No one immediately claimed responsibility.","filename":"data/vaneerConsumption/TwinBombBlastsatKenyaBusTerminalKill3.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_twin-bomb-blasts-kenya-bus-terminal-kill-3-n96361_1540241162.html","title":"Twin Bomb Blasts at Kenya Bus Terminal Kill 3","title_page":"Twin Bomb Blasts at Kenya Bus Terminal Kill 3","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMOMBASA — At least three people were killed in two explosions in Kenya's port city of Mombasa on Saturday, witnesses and local media said.\nOne of the blasts occurred at a busy bus transport terminal, known as Mwembe Tayari, where a device inside a minibus exploded killing three people, according to witnesses and media.\nA second blast was heard at the Reef Hotel, which lies along the Indian Ocean coastline but no casualties were reported in that explosion. Mombasa police were not immediately available to comment.\nThere was no immediate claim of responsibility but Kenya has been hit in the recent past by gun and grenade attacks in Mombasa and in the capital Nairobi, which the government has blamed on the al Qaeda-linked Somali group al Shabaab.\nThe Kenyan coast's large Muslim minority, many of whom feel marginalized by the predominantly Christian government, have been a fertile recruitment ground for Islamist militant networks.\nGunmen shouting in a foreign language killed six worshipers in a church near the coastal city of Mombasa on March 23, an attack of the kind that Islamist militants have been carrying out in retaliation for Kenya's intervention in neighboring Somalia.\n— Reuters","url":"https://www.nbcnews.com/news/world/twin-bomb-blasts-kenya-bus-terminal-kill-3-n96361"}
