{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 23:13:10","date_modify":"2018-10-30 23:13:10","date_publish":"2014-08-13 22:11:38","description":"I hate to be the bearer of bad news, but unfortunately, today I have to be, my dear Twisted fans: According to The Wrap, ABC Family has opted to cancel Twisted after one season, despite the fact that it was awesome. This news isn't particularly…","filename":"data/vaneerConsumption/TwistedCancelledAfterSeason1ABCFamilysReasoningWasPainfullyBrief.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/915b95b1-b683-4491-8a34-82a7034d6f38.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35694-twisted-cancelled-after-season-1-abc-familys-reasoning-was-painfully-brief_1540941190.html","title":"'Twisted' Cancelled After Season 1 & ABC Family's Reasoning Was Painfully Brief","title_page":"'Twisted' Cancelled After Season 1 & ABC Family's Reasoning Was Painfully Brief","title_rss":"NULL","source_domain":"bustle.com","text":"I hate to be the bearer of bad news, but unfortunately, today I have to be, my dear Twisted fans: According to The Wrap, ABC Family has opted to cancel Twisted after one season, despite the fact that it was awesome. This news isn't particularly surprising, since the network had been strangely mum on the fate of the series, but it's still tragic — there were so many plot lines left to wrap up! The show was just getting good!\nNo specific reason was given for the network's decision, but a spokesperson for the network reportedly told The Wrap, \"we are not moving forward with additional episodes.\" In a way, that just makes this worse, because there was no official reason, just action. I assume it to be ratings, though: Despite the fact that the show received a ton of attention on social media, it was never a ratings powerhouse — and networks are still, above all, a business.\nThere is good news, though, if you're a fan of other ABC Family shows: Switched at Birth was renewed for season 4. Small consolation, yes, but it's all we've got at the moment. And, y'know, Veronica Mars (another show cancelled before its time) ended up coming back! Twice! Keep hope alive, guys — there's already a fan campaign for another network to pick up the show.\nImage: ABC Family","url":"https://www.bustle.com/articles/35694-twisted-cancelled-after-season-1-abc-familys-reasoning-was-painfully-brief"}
