{"authors":["Carly Stern For Dailymail.Com"],"date_download":"2018-10-23 05:01:59","date_modify":"2018-10-23 05:01:59","date_publish":"2016-01-29 20:50:16","description":"The Today show asked viewers to tweet the 'oldest, most out-of-date' things still in their closets. Some seem to think their awful '60s, '70s, '80s, and '90s pieces will soon be trendy again.","filename":"data/vaneerConsumption/Twitteruserssharethemostembarrassingfashionitemsintheirclosets.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/20/30B4DDA700000578-0-image-a-115_1454100665316.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3423133_Are-worst-fashion-faux-pas-Twitter-users-share-embarrassing-items-closets-shiny-silver-suits-puffy-80s-prom-dresses_1540270919.html","title":"Twitter users share the most embarrassing fashion items in their closets","title_page":"Twitter users share the most embarrassing fashion items in their closets | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Only a few shared pictures of items that are actually back in style, like denim jackets, crop tops, and short faux-fur jackets\nWe all have a few things hiding in the backs of our closets that never see the light of day, be it chunky flatforms from the 90s, shoulder-pad jackets from the 80s, or patchwork bell-bottoms from the 70s.\nBut a few brave souls are now taking to Twitter to reveal the least fashionable items they've held onto for way too long, all in hopes of winning a prize.\nAfter the Today show charges viewers to tweet a photo 'of the oldest, most out-of-date thing' in their closets, fans have been sharing their cringe-worthy outfits with the hashtag #StartTODAYContest - and making us all feel a bit better about the shameful pieces we've saved over the years.\nContest: The Today show asked viewers to share pictures of 'the oldest, most out-of-date thing' in their closets, and got results like this shiny suit\nOutdated: The woman who shared it joked that the blue satin power suit from '83 was 'for those office meetings when you really want to impress'\nProm disasters: One woman shared a snap of a tafetta winged dress she wore to her 1986 prom, which she still owns\nFar out - of style: Several posted pictures of dowdy floral frocks from the 70s, with long sleeves and ruffles\nSome things that people have kept were clearly held onto for sentimental reasons, like class T-shirts, Letterman jackets, generations-old cheerleading uniforms, and prom dresses that practically have the decade they were made stamped on them.\nBut for other pieces, it's less clear why they're still taking up closet space.\nQuite a few items were obviously trend once upon a time, but have shown no sign of coming back in style - no matter how much their owners might secretly be hoping that they do.\nUnflattering mules, sparkly platforms, colorful powersuits, and bold shoulder pads have turned up under the hashtag, with Twitter users sheepishly explaining that they weren't always so awful.\n'I think it was cool back then,' wrote person, while another added: 'This was popular in the '80s.'\nNot coming back: This woman shared a picture of her patchwork jacket and matching giant bow\nFlashback: Another woman who wouldn't share a year said she wore this dress to her ninth grade dance\nSentimental: A few were nostalgic about pieces they'd save, like this Letterman jacket from the 80s\nTotally 80s: Many of the 'outdated' pieces were from the 80s, featuring shoulder pads and loud floral prints\nMaybe for Halloween? A kid might get a kick out of playing dress-up in these mules from the 60s\nSo bad: Plenty of 80s prom dresses have popped up, featuring ruffles, embellishments, and sequins\nThere are plenty of people who have no excuse, though, sharing photos of clothes in their closets that would have been questionable even in the year they were bought.\nDowdy frocks not dissimilar to those worn by women on polygamist Warren Jeffs' compound abound, as do over-the-top floral dresses with so many embellishments that even 80s girls would gasp.\nUgly jeans with patchwork decorations, tie-dye jumpsuits, Crocs, and terry-cloth shirts have popped up, too.\n'I can't believe this is still in my closet or that I actually wore it,' wrote one women, captioning a picture of an embellished Christmas vest layered over a white turtleneck.\nOff angles: This woman has held onto a jacket with shoulder pads from the 80s\nJust toss 'em! A few people made excuses for why they still had terrible items like these patchwork jeans int their wardrobes\nNot happening: Some seemed to think their pieces would get trendy again, with this woman saying: 'Waiting for the 80's to come back! Soooo comfortable and they are not pajamas!'\nUgly Christmas sweater party-ready: 'I can't believe this is still in my closet or that I actually wore it,' wrote the owner of this vest\nCompeting for worst dressed: Twitter users have been willing to reveal the terrible things in their closets in hopes of winning a prize\nThere are a few items, however, that aren't quite as out-of-style as their owners seem to believe they are.\nIn fact, they might want to consider passing them on to their fashion-forward daughters and granddaughters, who might be excited to score their vintage finds.\nWomen have save boho leather bags from the 60s. shiny crop tops and high-waisted pants from the 70s, and sequined dresses fromt he 80s that would look perfectly trendy if styled well.\nAfter one women shared a snapshot of her acid wash denim jacket from the 80s, a Today show style editor even tweeted back that it was too cool, adding: 'I would totally take this off your hands!'\nAnother young woman shared a picture of a cozy off-white sweater, writing: 'Mom wore this in the 70s. My sis & I now fight over it.'\nCyclical fashion: A dew of the items have actually become trendy again, and could probably be worn by the owners' daughter or granddaughter with some hemming","url":"https://www.dailymail.co.uk/femail/article-3423133/Are-worst-fashion-faux-pas-Twitter-users-share-embarrassing-items-closets-shiny-silver-suits-puffy-80s-prom-dresses.html"}
