{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-23 02:14:25","date_modify":"2018-10-23 02:14:25","date_publish":"2016-01-11 14:04:51","description":"Twitter user Jwzayn pranked a man who asked her for naked pictures on Twitter, by sending him an image of a blank loading screen. But he failed to spot the joke and thought his phone was broken.","filename":"data/vaneerConsumption/Twitterusersrequestfornakedselfiesbackfireswhenwomansendsblankscreen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3007753100000578-0-image-a-2_1452512685037.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393863_Man-s-Twitter-request-naked-selfies-backfires-woman-sends-blank-loading-screen_1540260865.html","title":"Twitter user's request for naked selfies backfires when woman sends blank screen","title_page":"Twitter user's request for naked selfies backfires when woman sends blank screen | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Twitter user who asked a woman to send him naked pictures got his comeuppance when she thought of an ingenious response to his cheeky request.\nJwzayn sent the eager suitor an image of the loading screen - a circle of strands that whirls around when an image is downloading.\nBut he didn't seem to get the joke and instead concluded that his phone must be broken, amusing Twitter users who favourited the exchange more than 7000 times.\nScroll down for video\nJwzayn came up with an ingenious response to an admirer who asked her to send him naked pictures on Twitter. 'I've been sending him a picture of the loading sign and he still hasn't realised,' she explained\nIt's not clear how long Jwzayn and the unnamed man had been chatting for when he made his request for a naked picture.\n'I want to see you without all that necessary clothing on,' he told her.\nShe replied, saying: 'OK, hang on a sec.'\nBut instead of the naked selfie he was hoping for, she sent him an image of the 'loading' icon on a plain grey background.\nA man wanted to see Jwzayn without 'all that necessary clothing', but instead of giving him a short shrift, she decided to play a practical joke on him instead\nThe man failed to realise he'd deliberately been sent an image of a blank screen and requested her to send the picture again\nHe then decided that his phone must be broken, as he couldn't think of any other reason for the naked picture not coming through\nHowever, her clearly confused admirer failed to spot the joke.\n'It's not loading,' he replied. 'Send it again.'\nShe obliged by sending a message with the exact same image, and asked: 'Did you get it?'\nBut still the penny failed to drop.\n'No, I think I need to get a new phone, lol,' the man replied, before asking her if she had a different app they could use to chat.\nAfter multiple requests from her Twitter followers, Jwzayn posted an image of the loading icon she'd use so that others could respond in the same way to requests for naked pictures\nJwzayn's followers were impressed by her handling of the situation, and people were clearly eager to use the same tactic for overzealous admirers, as she received multiple pleas for the loading screen image.\nOne request came from NitsujBob who said: 'Let me get that picture so I can use it for future purposes.'\nWillie was also keen to get his hands on the image, saying: 'OMG send me a picture of the loading sign please.'\nIn the end, Jwzayn obliged by posting the image she'd used, saying: 'For people asking, this is the loading sign.'\nShe advised her followers to 'save it to mess with F***boys'.\nZenobia praised Jwzayn for a discovering a new 'life hack', while TonkeePonkee and N Hasan, both described her tactic as 'genius'.\nRegulatorZero called her move 'spectacular', and said: 'You win the internet today, ma'am. Bravo.'\nAJMUFC congratulated Jwzayn for her clever response, but he had some harsh words for her admirer who he joked should be 'put in jail' for failing to realise he'd been pranked\nAJMUFC also congratulated Jwzayn on her ingenuity.\nBut he had some harsh words for the man who had requested the pictures, saying he should be 'put in jail' for stupidity.\n'Everyone knows the loading sign would be moving around in a circle,' he said.","url":"https://www.dailymail.co.uk/femail/article-3393863/Man-s-Twitter-request-naked-selfies-backfires-woman-sends-blank-loading-screen.html"}
