{"authors":["Aneeta Bhole For Daily Mail Australia"],"date_download":"2018-10-22 21:17:58","date_modify":"2018-10-22 21:17:58","date_publish":"2016-01-29 06:15:01","description":"ALDI Australia's attempt at connecting with its consumers and sourcing feedback has been met with ridicule across social media with a flood of tongue-in-cheek responses across Twitter.","filename":"data/vaneerConsumption/TwitterusersrespondtoALDIssocialmediacampaign.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30B00C6800000578-0-image-a-45_1454048070746.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422192_Internet-users-respond-hilariously-retail-giant-ALDI-s-ill-advised-social-media-campaign-Twitter_1540243078.html","title":"Twitter users respond to ALDI's social media campaign","title_page":"Twitter users respond to ALDI's social media campaign | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A retail giant's attempt at connecting with its consumers and sourcing feedback has been met with ridicule across social media with a flood of tongue-in-cheek responses on Twitter.\nALDI Australia asked Twitter users to 'fill in the blank' of a social media campaign which read: 'I became and ALDI lover when I tasted **** for the first time.'\nSocial media users took the opportunity to 'teach ALDI a lesson about the internet' describing the campaign as a 'social media fail.'\nALDI Australia asked Twitter users to 'fill in the blank' of a social media campaign which read: 'I became and ALDI lover when I tasted **** for the first time'\nALDI Australia's attempt at connecting with its consumers and sourcing feedback has been met with ridicule across social media with a flood of tongue-in-cheek responses across Twitter\nTwitter users tried to share their knowledge of the 'salty lot' that lurk on the internet and one user wrote: 'Meet the Internet. What could go wrong?'\n'Not a good idea. How about: 'When I tasted social media fail for the first time,' Je Suis Geek said.\nThere was no mercy for the ill-advised campaign with one user commenting: 'The bitter tears of social media gone wrong.'\nSlippery Seal tweeted: 'defeat' while another wrote, 'unemployment.'\nClosing in on nearly 100 tweets, social media users took the opportunity to 'teach ALDI a lesson about the internet' describing the campaign as a 'social media fail'\nThere was no mercy for the ill-advised campaign with one user commenting: 'The bitter tears of social media gone wrong'\nWhile another user commented on the horsemeat scandal that dogged the United Kingdom last year expressing that he had become an ALDI lover when he tasted 'horse' for the first time.\nSome users took a more subtle jab at the discount retailer's attempt at connecting with consumers with one user, Warne Wayford, commenting: 'Cheap Beer' and another commenting 'power.'\nThe hilarious tweets kept rolling in until Friday afternoon when comments such as 'napalm in the morning,' 'your mum' and 'sweet, sweet, vengeance' were the last to hit the retailers twitter feed.\nTwitter users tried to share their knowledge of the 'salty lot' that lurk the internet and one user wrote: 'Meet the Internet. What could go wrong?'\nThe hilarious tweets kept rolling in until Friday afternoon when comments such as 'napalm in the morning,' 'your mum' and 'sweet, sweet, vengeance' were the last to hit the retailers twitter feed\nALDI took the post down in what appeared to be an attempt to salvage itself from the social media onslaught.\nUsers - who started commenting within seconds of the post being up - wrote offensive and crude posts, and some mentioned that the company should have taken a leaf out of Victoria's Taxi Associations book.\n'@ALDIAAustralia Maybe ask the guys over at #yourtaxis how this could end up,' tweeted Caroline Duncan.\nWhile another user commented on the horsemeat scandal that dogged the United Kingdom last year expressing that he had become an ALDI lover when he tasted 'horse' for the first time\nSome users took a more subtle jab at the discount stores attempt at connecting with consumers with one user, Warne Wayford, commenting: 'Cheap Beer' and another commenting 'power'\nVictoria taxi's had similarly 'failed' to connect to passengers in November last year and stories about everything from customers being forced to wait while drivers cleaned up vomit, to driving on the wrong side of the road were shared across social media in the 'Your Taxi' campaign.\nThe campaign read: 'Tell your taxi story! #YourTaxis #PeopleOfMelbourne #TaxiYourWay.'\nJordan Witte tweeted: 'I just remembered the time a cabby made us wait with the meter on while he cleaned the previous passenger's vomit out of the car.'\nALDI took the post down in what appeared to be an attempt to salvage itself from the social media onslaught\nSome posts took a more morose tone commenting 'defeat and 'unemployment'\nLeigh Stillard wrote: 'It smelled like a wookiee's armpit. I was preached at about how Somali immigrants are destroying Australia for 25 min'.\nOther upset passengers wrote about times they had left items behind in a cab, only for the driver to be unreachable so they could be retrieved.\nWhile others had taxi drivers attempt to stalk them: 'You drove to my house repeatedly to make sure I received your details left at my door to schedule a date,' Zahra Sulaeman wrote.\nFor the most part, Your Taxis replied to every message, with most saying its team was glad to hear about the issues and expressed an interest to 'follow up' on the problems.\nUsers that had commented within seconds of the post being up, wrote offensive and crude posts some mentioning that the company should have taken a leaf out of Victoria's Taxi Associations book\nThe campaign read: 'Tell your taxi story! #YourTaxis #PeopleOfMelbourne #TaxiYourWay'\nVictoria taxi's had similarly 'failed' to connect to passengers in November last year\nStories about everything from customers being forced to wait while drivers cleaned up vomit, to driving on the wrong side of the road were shared across social media in the 'Your Taxi' campaign\nJordan Witte tweeted: 'I just remembered the time a cabby made us wait with the meter on while he cleaned the previous passenger's vomit out of the car'","url":"https://www.dailymail.co.uk/news/article-3422192/Internet-users-respond-hilariously-retail-giant-ALDI-s-ill-advised-social-media-campaign-Twitter.html"}
