{"authors":["Press Association"],"date_download":"2018-10-23 01:09:46","date_modify":"2018-10-23 01:09:46","date_publish":"2017-04-26 11:19:09","description":"The Government had reportedly been using a third-party company to monitor activity on the site for terror-related chatter.","filename":"data/vaneerConsumption/TwitterpreventingGovernmentfrommonitoringterrorrelatedcontent.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/11/wire-464451-1493201952-909_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447132_Twitter-preventing-Government-monitoring-terror-related-content_1540256986.html","title":"Twitter `preventing Government from monitoring terror-related content´","title_page":"Twitter `preventing Government from monitoring terror-related content´ | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Twitter has blocked the Government from potential sources of counter-terrorism intelligence, according to reports.\nPolice and security services including MI5 are said to have been cut off from some of the vast pools of data on the site.\nAccording to the Daily Telegraph, the Government had been using a third-party company to monitor activity on Twitter for terror-related chatter, although the firm has been blocked.\n(Lauren Hurley/PA)\nThe reports come amid a debate over the role of social media in terror incidents and the handling of terror-related content online.\nIn March tech giants Facebook, Google, Twitter and Microsoft pledged to join forces to tackle extremist content on their platforms.\nHowever, Twitter has been clear in its view of governments’ access to the platform, warning that surveillance is “absolutely unacceptable and prohibited”.\nTwitter\nIn November senior Twitter executive Chris Moody said the site would take “appropriate action” – including suspension and termination of access to its data products – if companies violated the policy.\nIn March, Home Secretary Amber Rudd refused to rule out the possibility of legislating against tech companies who block access to their services, following reports that Westminster attacker Khalid Masood’s final WhatsApp message had been encrypted.\nAmber Rudd\nThe Home Office has declined to comment on the latest reports concerning Twitter and the UK Government.\nHowever Tory MP Tom Tugendhat, a former Army officer, questioned Twitter’s policy.\nHe asked The Sun: “Why is it okay to sell data to firms like Wonga and not the Home Office? It’s a disgrace that an organisation as powerful as Twitter fails to accept it has a responsibility to help keep people safe, while it is using the very same data to make huge profits from them.”","url":"https://www.dailymail.co.uk/wires/pa/article-4447132/Twitter-preventing-Government-monitoring-terror-related-content.html"}
