{"authors":[],"date_download":"2018-10-23 02:05:33","date_modify":"2018-10-23 02:05:33","date_publish":"2017-04-26 12:56:24","description":"Twitter shares shot higher Wednesday after its quarterly update showed improving growth in user numbers, offsetting concerns over a decline in revenue and...","filename":"data/vaneerConsumption/Twittergetsliftfromuptickinusernumbers.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/16/wire-466007-1493219191-888_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4447508_Twitter-upbeat-user-growth-despite-revenue-drop_1540260333.html","title":"Twitter gets lift from uptick in user numbers","title_page":"Twitter gets lift from uptick in user numbers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Twitter shares shot higher Wednesday after its quarterly update showed improving growth in user numbers, offsetting concerns over a decline in revenue and another net loss for the social network.\nThe first quarter results came in better than most forecasts for Twitter, which has struggled to keep pace in the fast-moving world of social media.\nThe closely watched metric of monthly active users grew nine percent from the same period a year ago to 328 million.\nTwitter said daily active usage rose 14 percent without offering a specific figure.\nTwitter's first quarter results came in better than most forecasts, delivering an early pre-market lift for shares in Twitter, which has struggled to keep pace in the fast-moving world of social media\nINSTAGRAM'S RISE Facebook-owned Instagram on Wednesday reported it has 700 million users, while the leading social network itself has more than 1.8 billion. The photo and video app added 100 million new users in just over four months.\nNet loss narrowed to $62 million from $80 million a year earlier for Twitter, which has never reported a profit.\nRevenues meanwhile fell eight percent to $548 million - which would normally be troubling for a social media group, but the figure was not as bad as feared.\n'This past quarter has given us a lot of confidence in our focus and execution and excitement for our path ahead,' Twitter chief executive Jack Dorsey told a conference call.\nDorsey said Twitter remains 'focused on making progress' toward achieving profitability, but offered no specific goal.\nDorsey said in the earnings release, 'We're delivering on our goal to build a service that people love to use, every day, and we're encouraged by the audience growth momentum we saw in the first quarter.'\nTwitter shares rallied 10.7 percent to $16.23 after the opening on Wall Street, suggesting an easing of fears about the path forward for the micro-blogging service.\nJan Dawson of Jackdaw Research said in a tweet: 'Much better results today from Twitter, across several categories. MAU (monthly active user) growth best for two years (though still historically low).'\nDawson added in a blog post that Twitter still faces challenges from revenue declines but that 'the improved user growth and some signs of increased advertiser investment are more reassuring for long-term growth.'\nTwitter has been seeking to broaden its appeal beyond its core user base of celebrities, politicians and journalists, ramping up efforts in video and live sports, notably.\nBut the company has failed to live up to early expectations, while Facebook and other social networks have been growing at a faster pace.\nAs a reminder of Twitter's woes, Facebook-owned Instagram on Wednesday reported it has 700 million users, while the leading social network itself has more than 1.8 billion.\nIt remains to be seen if Twitter will reap benefits from the prolific tweeting of President Donald Trump, who uses the network to connect with his base, and often to make policy announcements.\nTwitter chief operating officer Anthony Noto told analysts on the conference call there is 'some evidence that we benefitted from our new and resurrected users' who follow politics.\nHe suggested the trend was being driven both by political players' growing use of the platform, and the fact major news organizations are increasingly migrating onto Twitter.\n'As you know, we believe Twitter is the best at showing you what's happening in the world and what's being talked about,' he said.\n'Having the political leaders of the world as well as news agencies participating in driving that, is an important element to reinforcing what we're the best at.'\nAdvertising continued to make up the lion's share of Twitter revenue -- but ad revenues were down 11 percent from a year ago to $474 million.\nA tweet from Twitter's investor relations arm noted that 'we continue to expect revenue growth to meaningfully lag audience growth in 2017.'","url":"https://www.dailymail.co.uk/sciencetech/article-4447508/Twitter-upbeat-user-growth-despite-revenue-drop.html"}
