{"authors":["Carly Stern For Dailymail.Com"],"date_download":"2018-10-23 03:10:58","date_modify":"2018-10-23 03:10:58","date_publish":"2016-01-28 18:34:00","description":"Twitterer @pharmasean imagined what it would be like if men spoke to everyone the way they do to women on Tinder, acting overtly sexual and getting belligerent when things don't go their way","filename":"data/vaneerConsumption/TwitteruserimaginesmenusingTindertalkinreallife.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB5A2D00000578-0-image-a-15_1453995804094.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3421106_Twitter-user-reveals-like-abusive-men-spoke-way-women-social-media_1540264258.html","title":"Twitter user imagines men using Tinder talk in real life","title_page":"Twitter user imagines men using Tinder talk in real life | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Many women who've tried online dating - especially with apps like Tinder - will be able to share at least one horror story of a man's crude, rude, or otherwise inappropriate messages.\nClueless, offensive guys have been known to send some pretty awful things to women they want to hook up with - particularly when they get rejected. But though these men seem to find that kind of behavior appropriate online, most would never think to use it in everyday interactions.\nIf they did, though, their conversations might look something like the fictional ones dreamed up by Twitter user @pharmasean, a 34-year-old man from Boston who decided to imagine what it would be like 'if men interacted with everybody the way they interact with women on social media'.\nA Boston man wanted to draw attention to the 'creepy', 'sexual' and 'abusive' messages that men send women on social media\nChill out, bro: He imagined exchanges in which men were that offensive in real life, like this made-up guy who gets belligerent when he is politely rejected for a job\nBy now, the abundance of rude men who lurk on dating sites is no longer a sad secret known only to those who use those platforms.\nInstagram accounts, Tumblrs, and Twitter profiles have all turned up to shame these men, posting the disgusting ways they try - ineffectively - to get a date.\nTinder Nightmares and Bye Felipe are two Instagram accounts that share grabs of terribly bad pick-up lines and 'dudes who turn hostile when rejected or ignored', while Tumblr accounts Dudes of Tinder and Straight White Boys Texting also capture the vulgar, nasty things some men say to women online.\nMost of these messages see men immediately asking for nude photos or offering to show women their own genitalia, or else getting belligerent and calling women 'ugly' or 'w****s' when they get turned down.\nChange your tactics, duded: He also pointed out and some disgusting men can be quick to push sexual interactions - and then get offended when women don't recipricate\nTwitter user @pharmasean was horrified by conversations like these, and thought it would be funny to draw attention to them by dreaming up what it would be like if men talked to everyone that way.\n'The screengrabs in my tweets are all based on real interactions - I essentially transcribed the men’s parts from real conversations I’ve seen on the web, countless times,' he told BuzzFeed.\nOne sees a made-up man named Chris getting crude after notification from his local library about an overdue book - before turning nasty when he doesn't get what he wants.\nChris responds to the library by messaging back: 'ay do you wan to see a picture of my sick,' before correcting his typo to 'd*ick'.\nWhen he doesn't get a response, he adds: 'whavetevr, u know what, nvm [sic].'\nYou think that'll work? The fact that this fiction man requested a specific sex act without preamble mimics some real tactics men use on dating apps like Tinder\nAnother made-up exchange sees a man named Jackib texting to apply for a job. When he gets a response saying that position has been filled - and thanking him for his interest - his demeanor (and grammar) completely changes.\n'No worries, i dont want to work for u anyway. Youre \"business\" is a piece of s***. Your stuck up and i hope that the idiot you hired burns your multinational firm down,' he writes. 'i've got a better job anyway - it pays $3million an hour and all i do all day is wash supermodels. i'll see u n hell, retrad. [sic]'\nAnother sees a fabricated man named Guernsey Tomkins responding to a Facebook message from a housemate. The original message politely asks all housemates to be 'more careful when parking' because people are getting blocked in and made late to work\nGuernsey responds: 'That sucks, but I just wanted to let you know that not all housemates are like this. I just wanted to mention it because it seems like your painting us all with a pretty broad brush.'\nNo big deal: This made-up man didn't get nasty, but he was incredibly whiny about a perceived slight\nIn yet another fake exchange, a man names 'Scort Warlikins' gets a message from is local pizza place that his order is on the way.\nScort replies: 'Sweet!' before asking in another message 'Anal?'\nThe creator of the made-up messages said that real-life men can be 'subtly sexual', 'creepy', and even 'abusive and criminal' when talked to women online, and it needs to stop.\n'There’s been a long ongoing conversation on the web about how we treat each other, how we treat people who are different than us, and how we treat women in particular on social media,' he told BuzzFeed.","url":"https://www.dailymail.co.uk/femail/article-3421106/Twitter-user-reveals-like-abusive-men-spoke-way-women-social-media.html"}
