{"authors":["Tim Collins For Mailonline"],"date_download":"2018-10-23 01:55:42","date_modify":"2018-10-23 01:55:42","date_publish":"2017-03-16 12:12:50","description":"San Francisco based social network Twitter has created a new piece of software, to be launched next week, which will allow professional broadcasters to stream instantly to the site.","filename":"data/vaneerConsumption/Twittertoexpandlivestreamingservices.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53453500000578-0-image-a-11_1489663231328.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4319506_Twitter-expand-live-streaming-services-media_1540259742.html","title":"Twitter to expand live streaming services","title_page":"Twitter to expand live streaming services | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The race to conquer the world of online live broadcasting is heating up, if rumours of a new service being launched by Twitter are to be believed.\nIn a move designed to challenge the success of Facebook Live, new software will allow professional broadcasters to stream instantly to Twitter.\nAn announcement is expected from the San Francisco firm next week, when the feature is believed to be launching.\nScroll down for video\nNew piece of coding known as an API is expected to be launched next week, which will allow professional broadcasters to stream instantly to Twitter (Stock Image)\nWHAT IS AN API An application program interface (API) is a piece of code that allows two software programs to communicate with each other. The API defines the correct way for a developer to write a program that requests services from an operating system or other application. Typically, APIs are released for third-party development as part of a software development kit or as open source published on the Internet.\nThe new live streaming application program interface (API) will allow media companies to upload video directly to the micro-blogging platform.\nTwitter already allows this is some instances, but this is on an ad hoc basis and requires advanced planning with the site.\nThe API is aimed at media using professional camera equipment, rather than the average smartphone user.\nIt will allow news organisations to go live on Twitter almost instantly, according to reports in 9to5Mac.\nPeriscope - Twitter's existing streaming app which predates Facebook Live - already includes a feature which allows live streaming of high-quality broadcasts, called Periscope Producer.\nBut the API will allow producers to bypass Periscope completely, should they wish to do so.\nThe new API will run in conjunction with continuing expansions planned for Periscope, leaving a slightly confusing state of affairs for consumers.\nTwitter is hoping to build a following beyond people who rely on the service to tweet their thoughts and keep tabs on what's happening around the world.\nCEO Jack Dorsey sees the social media site evolving into the go-to place for watching live video, where people can share their opinions with each other.\nIn a bid to keep with its rivals, the site launched a function that allows users to broadcast live videos directly from its app back in December 2016.\nThe videos are powered by Periscope, which has been running since 2015.\nSpeaking at the launch of the new feature, Periscope CEO Kayvon Beykpour said: 'We started Periscope because we wanted to give people the superpower to share live video with an audience.\nTwitter is hoping to build a following beyond people who rely on the service to tweet their thoughts and keep tabs on what's happening around the world (Stock Image)\n'Bringing this capability directly into the Twitter app is an important step because it brings that superpower to the hundreds of millions of people who use Twitter.\n'Twitter's already the place where people go to see what's happening. With this update, anyone can now broadcast what's happening live.'\nThe update came shortly after Instagram and Facebook – two of Twitter's main rivals – introduced their own live video features.","url":"https://www.dailymail.co.uk/sciencetech/article-4319506/Twitter-expand-live-streaming-services-media.html"}
