{"authors":["Chriss W. Street"],"date_download":"2018-10-30 18:15:57","date_modify":"2018-10-30 18:15:57","date_publish":"2016-07-27 04:12:08","description":"Twitter announced that its user growth is dead, and that its cash flow estimate was cut by $80 million for the latest quarter.","filename":"data/vaneerConsumption/TwitterStockCrashes16BAfterCashFlowPlunges.json","image_url":"https://media.breitbart.com/media/2015/06/Screen-Shot-2015-06-12-at-10.48.50-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_07_26__1540923357.html","title":"Twitter Stock Crashes $1.6B After Cash Flow Plunges","title_page":"Twitter Stock Crashes $1.6B After Cash Flow Plunges | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"After booting Breitbart Tech editor Milo Yiannopoulos — possibly the worst blunder in social media history — and alienating his 400,000 followers, Twitter announced that its user growth is dead, and that its cash flow estimate was cut by $80 million for the latest quarter.\nTwitter’s stock market valuation [TWTR:NYSE] tanked by $1.6 billion in after-hour trading immediately after the company told Wall Street analysts that, despite “monthly-active-user” (MAU) numbers up by 1 million to 312 million, the company cut its third-quarter cash flow estimate from $681.4 million to between $590 and $610 million.\nUntil June 2015, Twitter was the Internet’s third-largest social media site. Twitter’s CEO Dick Costolo was deeply loved by company employees, and highly respected by the social media community for not muzzling free speech.\nCostolo’s “Abusive Behavior Policy” was the fairness-in-social-media gold standard:\nUsers are allowed to post content, including potentially inflammatory content, provided they do not violate the Twitter Rules and Terms of Service. Twitter does not screen content and does not remove potentially offensive content unless such content is in violation of the Twitter Rules and Terms of Service.\nDespite being headquartered in the People’s Republic of San Francisco, Costolo won high praise for not knuckling under to Leftists’ “thought police,” and for building the company’s monthly-active-user (MAU) base to 316 million.\nBut Obama campaign cash bundler Chris Sacca led a Board of Directors coup to fire Costolo. Sacca’s whatisleft.org biography stated that he “proudly worked on President Barack Obama’s campaign as a Telecommunications, Media, and Technology advisor, a speaking surrogate, a field office volunteer, and as Co-Chair of Finance and a Trustee of the Presidential Inaugural Committee.”\nSacca also raised at least $500,000 as a top 2012 Obama campaign bundler. He also co-chaired and gave $50,000 for the Obama January 2013 Inauguration Ball, and chipped in $30,000 to other Democrats, according to Open Secrets.\nConservatives started noticing almost immediately that they were suffering biased treatment. But then Twitter took a huge user dive in January when it suspended for “recent violations of the Twitter Rules” the “verified account” status for Yiannopoulos, who had 140,000 Twitter followers at the time.\nThe vitriolic anger in the blogosphere over “spiking Milo,” who was listed as a top writer on the Drudge Report’s front page, became Twitter’s #1 top topic in the U.K., U.S., and Canada under the hashtag “#JeSuisMilo.”\nEven after reinstating Yiannopoulos, Twitter suffered an existential crisis that inflicted permanent damage to its brand. But “Twittergate” has been a home run for Milo, who became such a worldwide sensation that his Twitter followers popped to 400,000.\nDespite getting a lift from Republican Donald Trump, who has been using the social media platform as his political firehouse, Twitter MAUs have gone nowhere over the last six months, and Twitter’s social media user rank dropped to number nine.\nUnsatisfied with just having its stock price cut in half and losing $15 billion in market value, Twitter permanently banned “Milo” again in mid-July for writing a hilarious review of a remake of the Ghostbusters movie.\nThe $250 million all-female and very politically correct remake only scored a 58 percent rating on Rotten Tomatoes, and 2.5 out of 5 stars on IMDb, is running number four at the box office. Hollywood expects Sony to lose at least $100 million on the flick.\nTwitter continues to be virally humiliated by global “chalking” of the #FreeMilo slogan, which has been appearing outside many of the company’s worldwide offices and at numerous locations around the four miles of high fencing at the Democratic National Convention in Philadelphia.","url":"https://www.breitbart.com/local/2016/07/26/twitter-stock-crashes-1-6b-cash-flow-plunges/"}
