{"authors":[],"date_download":"2018-10-22 23:01:46","date_modify":"2018-10-22 23:01:46","date_publish":"2014-06-11 18:17:27","description":"A cross-site scripting vulnerability allowed hackers to inject script into webpages and cause general havoc across the Twitter-owned application.","filename":"data/vaneerConsumption/TwittersTweetDeckDashboardBackOnlineFollowingSecurityProblems.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_security_twitters-tweetdeck-dashboard-back-online-following-security-problems-n128651_1540249306.html","title":"Twitter's TweetDeck Dashboard Back Online Following Security Problems","title_page":"Twitter's TweetDeck Dashboard Back Online Following Security Problems","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nUpdated at 3:28 p.m. ET: A 19-year-old named Florian says he was the unintentional source of the Tweetdeck outage and that it was all an accident, The Verge reports.\nFlorian told The Verge he was tweeting out some test code that exposed a Tweetdeck vulnerability, and the bug quickly spiraled out of control. \"This was an accident,\" he said. \"I didn't want to make this public. I didn't want to do anything bad.\"\nOriginal story: TweetDeck, a Twitter-owned dashboard which allows users to view multiple accounts, was briefly offline Wednesday afternoon after hackers took advantage of a security hole to access user accounts.\nA cross-site scripting (XSS) vulnerability allowed hackers to inject script into webpages and cause general havoc across the application. In one case of hacker shenanigans, a tweet from the account @derGeruhn,featuring nothing more than a heart-shaped image, was retweeted nearly 40,000 times before TweetDeck went offline.\nPrior to the shutdown, TweetDeck advised that a security issue had been fixed, and advised users to log out and log back on to their accounts. Tweetdeck was again accessible at approximately 2:15 p.m. Wednesday afternoon.\nTwitter has not yet commented publicly on the problem. NBC News will update this story as it unfolds.\n-- NBC News staff","url":"https://www.nbcnews.com/tech/security/twitters-tweetdeck-dashboard-back-online-following-security-problems-n128651"}
