{"authors":["Eleanor Hayward For The Daily Mail"],"date_download":"2018-10-22 21:26:27","date_modify":"2018-10-22 21:26:27","date_publish":"2017-04-26 01:48:17","description":"Twitter has cancelled a deal which allowed the Home Office to track terror related posts, under plans to prevent its users’ data being used for what it describes as government ‘surveillance’.","filename":"data/vaneerConsumption/TwitterblocksMI5saccesstoterrortweets.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/1B25CFE1000005DC-0-image-a-31_1493167782224.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4445992_Twitter-blocks-MI5-s-access-terror-tweets_1540243587.html","title":"Twitter blocks MI5’s access to terror tweets","title_page":"Twitter blocks MI5’s access to terror tweets | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Twitter has blocked the police and MI5 from accessing data which helps them to identify terrorists.\nThe Home Office was previously able to track terror-related posts made on Twitter through a deal with a third-party company.\nBut Twitter has now cancelled the deal under plans to prevent its users’ data being used for what it describes as government ‘surveillance’.\nTwitter has blocked the police and MI5 from accessing data which helps them to identify terrorists\nThe decision has alarmed counter-terror bosses and sparked outrage among ministers, who fear it will make the country less safe.\nIt is the latest in a series of rows between social media giants and the Government after ministers called on them to do more to prevent extremist material being spread online.\nWhile Twitter are refusing to share the data with police and MI5 to help them identify jihadi plots, the tech giant will continue to sell data access to corporate firms.\nThe service enables corporations to have keyword search-style access to its 300 million users’ tweets and public profiles and is normally used by companies to monitor sentiment about their products.\nThe Government also used the service to monitor propaganda pumped out by terror movements such as ISIS and to search terms related to potential terror attacks.\nConservative MP Tom Tugendhat last night branded Twitter ‘a disgrace’, and criticised the firm for dealing with companies such as Wonga who target on the indebted but not for working with Governments tracking down jihadis plotting violence.\nConservative MP Tom Tugendhat has branded Twitter ‘a disgrace’ over their decision\nEx-Army officer Mr Tugendhat told The Sun: ‘It is a disgrace that an organisation as powerful as Twitter fails to accept it has a responsibility to help keep people safe, while it is using the very same data to make huge profit from them.\n‘Why is ok to sell data to companies like Wonga while not to the Home Office?’\nFurious ministers have reportedly attempted to overturn the decision but have been unsuccessful, it is understood.\nTwitter has recently said that third-party companies would be blocked from offering data to paying government clients if it was used for surveillance\nIn a recent blog post, its vice-president of data and solutions Chris Moody said: ‘Recent reports about Twitter data being used for surveillance have caused us great concern.\n‘As a company, our commitment to social justice is core to our mission and well established. And our policies in this area are long-standing.\n‘Using Twitter’s Public APIs or data products to track or profile protesters and activists is absolutely unacceptable and prohibited.’\nThe company has previously come under fire from ministers for its failure to stop terrorist propaganda videos from spreading online.\nLast month Home Secretary Amber Rudd warned internet giants they must do more to crack down on hate speech and extremist material online and hinted at possible legislation if they fail to do more.","url":"https://www.dailymail.co.uk/news/article-4445992/Twitter-blocks-MI5-s-access-terror-tweets.html"}
