{"authors":[],"date_download":"2018-10-22 20:49:09","date_modify":"2018-10-22 20:49:09","date_publish":"2014-05-04 09:25:51","description":"Two adults and three children were found dead inside a small cabin in north-central Pennsylvania with \"toxic levels\" of carbon monoxide.","filename":"data/vaneerConsumption/TwoAdults3KidsFoundDeadinPennsylvaniaCabin.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_18/418866/140504-pa-family-co2-cabin-850a_aa8b7e205129ddfa73a92dee5227fdbf.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_two-adults-3-kids-found-dead-pennsylvania-cabin-n96571_1540241349.html","title":"Two Adults, 3 Kids Found Dead in Pennsylvania Cabin","title_page":"Two Adults, 3 Kids Found Dead in Pennsylvania Cabin","title_rss":"NULL","source_domain":"nbcnews.com","text":"Young said the preliminary investigation showed no signs of foul play and the cause of the deaths was not considered suspicious.\nThe two adults were identified as 23-year-old Jacqueline R. Stackhouse, of New Columbia, and 30-year-old Nathan L. Reece, of Muncy. Authorities did not release the names of the children — a 9-year-old girl, a 4-year-old girl, and Stackhouse's 3-year-old son. Aside from the mother and son, police did not know how the victims were related.\nAuthorities say the property owner, whose name was not released, hosted a friendly get-together Friday night and slept in his truck outside the cabin before awaking Saturday and later finding the bodies.\nCounty Coroner Charles Kiessling pronounced all five dead at the scene.\nSome relatives of the victims watched near the cabin, as authorities investigated.\n\"It was a hysterical scene, especially for the parents of some of the victims,\" Young told the newspaper in describing the reaction from family and friends when told of the deaths.\nThe Associated Press","url":"https://www.nbcnews.com/news/us-news/two-adults-3-kids-found-dead-pennsylvania-cabin-n96571"}
