{"authors":[],"date_download":"2018-10-30 21:29:41","date_modify":"2018-10-30 21:29:41","date_publish":"2016-01-29 13:17:36","description":"As global health experts scramble to understand the Zika virus, two cases suggest it may be transmitted through sex, not just mosquitoes.","filename":"data/vaneerConsumption/TwoCasesHintatPossibleSexualTransmissionofZika.json","image_url":"https://media.breitbart.com/media/2016/01/Revelers-wearing-Greek-style-costumes-raise-awareness-of-the-need-to-prevent-the-spread-of-the-Zika-virus-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_01_29__1540934981.html","title":"Two Cases Hint at Possible Sexual Transmission of Zika","title_page":"Two Cases Hint at Possible Sexual Transmission of Zika","title_rss":"NULL","source_domain":"breitbart.com","text":"As global health experts scramble to understand how the Zika virus spreads and may lead to birth defects, two cases suggest it may be transmitted through sex, not just mosquitoes.\nIn a conference call with reporters Thursday, US Centers for Disease Control and Prevention principal deputy director Anne Schuchat was asked about a recent New York Times report on the subject.\n“There is one reported case of Zika virus through possible sexual transmission,” she said.\n“In another case, Zika virus was found in semen about two weeks after a man had symptoms with Zika virus infection, so that sort of gives you the biologic plausibility of spread.”\nHowever, Schuchat added that “the science is very clear to date that Zika virus is primarily transmitted to people through the bite of an infected mosquito. So that is really where we are putting the emphasis right now.”\nThe World Health Organization has warned that the virus is “spreading explosively” and may cause up to four million cases in the Americas.\nMeanwhile, Brazil is struggling to cope with a surge in microcephaly cases — in which babies are born with unusually small heads — with nearly 4,000 suspected cases since the outbreak began last year.\nIn a handful of cases, the Zika virus has been identified in fetuses and babies with birth defects, but health authorities say more work is needed to confirm cause and effect.\nResearchers believe that if a pregnant women is bitten by an infected mosquito, particularly in the first trimester, she faces a higher risk of having a child with birth defects.\nOn Monday, the Times reported that the only known case of the Zika virus in semen involved a 44-year-old Tahitian man who was exposed during an outbreak of the Zika virus in French Polynesia in 2013.\nThe virus was detected in his semen after it was no longer found in his blood. Still, it remains unclear how long the virus may have persisted after his initial infection.\nThe newspaper also mentioned a second case from 2008, in which a US biologist was infected with Zika while in Senegal collecting mosquitoes for a malaria study.\nThe man developed a rash, fatigue and headache a week after his return to the US. His wife also developed similar symptoms a few days after his return, and after the two had sex.\nTheir blood was drawn and tested negative for malaria, dengue and yellow fever.\nAfter some time had passed, a colleague suggested their illness could have been Zika.\nThe blood samples, which had been frozen, were re-tested and came back positive for Zika, suggesting that the wife was infected by her husband since none of the mosquitoes that carry Zika were present in Colorado.","url":"https://www.breitbart.com/national-security/2016/01/29/two-cases-hint-at-possible-sexual-transmission-of-zika/"}
