{"authors":[],"date_download":"2018-10-22 22:35:19","date_modify":"2018-10-22 22:35:19","date_publish":"2014-06-08 20:49:06","description":"An apparent ambush in a Las Vegas pizzeria that carried over to a nearby Walmart left five people dead on Sunday, including two police officers.","filename":"data/vaneerConsumption/TwoCopsThreeOthersKilledinLasVegasShootingSpree.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/497651/140609-vegas-shoters-jhc-1519_cc0a009f363d94a5d277a9a01659dfde.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_vegas-cop-killers_two-cops-three-others-killed-las-vegas-shooting-spree-n125766_1540247719.html","title":"Two Cops, Three Others Killed in Las Vegas Shooting Spree","title_page":"Two Cops, Three Others Killed in Las Vegas Shooting Spree","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Las Vegas couple who shot to death two police officers, a civilian and themselves delivered an ominous message before they left home with a shopping cart of weapons to carry out the anti-government ambush, a neighbor said.\n\"We gotta do what we gotta do,\" Jerad Miller told Kelly Fielder, adding that he and his wife, Amanda, were departing for an \"underground world.\"\nAmanda Miller then embraced the neighbor and said, \"I am so sorry.\"\nAuthorities said they believe the Millers were acting alone but they espoused an \"anti-government, anti-police\" ideology with militia and white supremacist overtones.\nInvestigators were looking into possible links between the couple and some of the groups that converged on rancher Cliven Bundy's property during his armed standoff with federal rangers over land rights.\nFielder said she had heard Jerad Miller make anti-government statements in the past — including a desire to overthrow the government and President Obama and kill police officers — but was not alarmed by them. The couple also liked to dress up like the Batman character, The Joker, and his sidekick Harley Quinn.\n\"I thought he was just all talk,\" Fielder, who described herself as Amanda's \"best friend,\" told NBC Los Angeles.\nIn retrospect, Fielder said, she wishes she had alerted the authorities when the couple took off on foot from their Spruce St. home early Sunday with an arsenal in their red cart.\n\"I should have called the cops right then. I thought he was talking outside of his neck.\"\nJerad Miller had two guns and \"all kinds of ammunition,\" Fielder said. His wife carried a .38 caliber handgun in her purse and also had an AR-1 rifle, she said.\n\"They said they were going to go to an underground world and they needed protection,\" she said.\n\"I should have called the cops right then. I thought he was talking outside of his neck.\"\nLess than six hours later, the couple barged into CiCi's Pizza a few miles away, yelled “This is the start of a revolution!” and started firing, witnesses told police.\nThe officers, Alyn Beck, 42, and Igor Soldo, 32, were inside having lunch, and both were mortally wounded, Sheriff Doug Gillespie said.\nAuthorities said the suspects stripped the dead officers of their weapons and ammunition.\nThey covered one with a swastika and the Revolutionary War-era Gadsden flag, which depicts a coiled snake and the words “Don’t Tread On Me.” On the other officer was a note that said, \"The revolution is beginning.\"\nThe shooters then headed to a Walmart, where Jerad Miller yelled, \"Everyone get out!\"\n“They just said, ‘The revolution’s begun,’ they said that they shot some officers, and basically get out of the store if you don’t want to get hurt,” said Tyrone Ellis, who works at the store.\nA shopper, Joseph Robert Wilcox, 31, of Las Vegas had a concealed weapon and decided to confront Jerad Miller, police said. As he walked toward the suspect, Amanda Miller came up behind him and shot him several times in the ribs, police said.\nWhen cops arrived at the store, they found Wilcox at the front entrance and the suspects fleeing toward the rear of the store.\nThe officers split into two five-man teams, one at the front and one at the rear. The team in the back got into a gunfight with the Millers, both of whom were shot.\nThey got on the floor and used items from Walmart to build a sort of fort around them. Then Amanda Miller shot her husband several times before putting the gun to her head and firing.\nThe motive for the entire episode was unclear.\nFielder portrayed Jerad Miller as the dominant partner in the relationship — \"He was a very controlling person\" — and suggested his wife was not happy about his anti-government rhetoric.\nShe said that he had boasted about killing police officers and putting swastikas on their body. The couple had traveled with her to the ranch where Cliven Bundy led an armed standoff with federal rangers, but Fielder said she didn't stay.","url":"https://www.nbcnews.com/storyline/vegas-cop-killers/two-cops-three-others-killed-las-vegas-shooting-spree-n125766"}
