{"authors":[],"date_download":"2018-10-30 20:20:06","date_modify":"2018-10-30 20:20:06","date_publish":"2015-11-30 17:42:59","description":"With the stop arms down and red lights flashing at a Henry County rail crossing, a van driver attempted to cross the train tracks, according to video released Monday.","filename":"data/vaneerConsumption/Twochildren15and12killedwhentrainhitscarinHenry.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/01/Videos/4638490522001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_two-children-and_1bc200b293f21ee13914dd116a0721d9__1540930806.html","title":"Two children, 15 and 12, killed when train hits car in Henry...","title_page":"Two children, 15 and 12, killed when train hits car in Henry...","title_rss":"NULL","source_domain":"ajc.com","text":"With the stop arms down and red lights flashing at a Henry County rail crossing, a van driver attempted to cross the train tracks, according to video released Monday. Seconds later, the van carrying four was hit by a freight train, killing a 15-year-old and her 12-year-old brother.\nThe train hit the van around 7:30 p.m. Sunday at the Valley Hill Road crossing, Richard Harris, a spokesman for Norfolk Southern Railroad, told The Atlanta Journal-Constitution. Harris said the train was northbound with 23 freight cars and one locomotive.\nThe crossing was equipped with warning lights, bells and gates, and the train’s horn was blowing, Harris said.\nTwo siblings died in the crash, and another 9-year-old child remains hospitalized, a relative told Channel 2 Action News. The children’s father, who was driving, suffered minor injuries. The names of the family members were not released.\nJames Brooks, whose home is nearby, told Channel 2 he heard the collision and knew something bad had happened.\n“It was a black car, and it was just crushed into a ball,” Brooks said.\n— Staff writer Alexis Stevens contributed to this report.","url":"https://www.ajc.com/news/local/two-children-and-killed-when-train-hits-car-henry-county/xQGAKaXdZ6WuLNWgoB65KM/"}
