{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 20:43:06","date_modify":"2018-10-30 20:43:06","date_publish":"2015-04-13 02:40:57","description":"Two towns west of Chicago are recovering from a series of deadly tornados that killed 2, injured 20, and left dozens of families homeless.","filename":"data/vaneerConsumption/TwoDead20InjuredinDevastatingIllinoisTornados.json","image_url":"https://media.breitbart.com/media/2015/04/tornado-illinois-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_12__1540932186.html","title":"Two Dead, 20 Injured in Devastating Illinois Tornados","title_page":"Two Dead, 20 Injured in Devastating Illinois Tornados","title_rss":"NULL","source_domain":"breitbart.com","text":"Two towns some 80 miles west of Chicago are struggling to recover from a series of deadly tornados that careened through the area killing two, injuring 20, and leaving dozens of families homeless.\nOn Thursday, the towns of Fairdale and Rochelle were devastated by tornados—one of which may have measured a half-mile wide with 200-miles-per-hour winds. Many homes and businesses were leveled to the ground, and in the small town of Fairdale, nearly every building in the town was either destroyed or damaged.\nFairdale suffered the worst of the casualties. Two elderly women, Jacklyn Klosa, 69, and Geraldine Schultz, 67, were killed as the storm ripped through the town. It was also reported that at least 20 people were sent to area hospitals. But the twisters were so devastating that, over the last few days, many have expressed shock that these were the only deaths. In fact, Illinois Governor Republican Bruce Rauner remarked on how lucky the area was.\n“Frankly, we’re very blessed that more people were not hurt. This was a devastating storm,” Rauner said as he visited the disaster area.\nIt definitely could have been worse. The tornados just missed two much more populated areas. The path of the storm steered itself right between Rockford, the state’s third largest city, and nearby Belvidere. The storms could have caused much more damage and loss of life should they have hit either or both of these more densely populated areas.\nThe U.S. weather service eventually verified that, along with the major EF4 tornado that struck Fairdale, two smaller tornado systems, one ranked EF1 and the other EF0, also touched down in the Belvidere and Cherry Valley—areas to the south and east of Rockford.\nOn Friday and Saturday, thousands of illinois residents had made their way to the stricken area to bring water, food, blankets, donations, and their own two hands to help their fellow citizens dig out of the debris.\nAlong with a series of other relief efforts, a donation fund has been set up by the Alpine Bank of Rockford, Illinois.\nBy Friday, Governor Rauner had also pledged $100,000 of his own, personal money to help tornado victims.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2015/04/12/two-dead-20-injured-in-devastating-illinois-tornados/"}
