{"authors":[],"date_download":"2018-10-23 05:37:18","date_modify":"2018-10-23 05:37:18","date_publish":"2017-03-16 16:28:14","description":"The International Organization for Migration said Thursday that two people were killed when gunmen attacked an aid convoy in South Sudan, where chronic...","filename":"data/vaneerConsumption/TwokilledinattackonSouthSudanaidconvoyIOM.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/16/wire-229525-1489682302-425_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4320948_Two-killed-attack-South-Sudan-aid-convoy-IOM_1540273038.html","title":"Two killed in attack on South Sudan aid convoy: IOM","title_page":"Two killed in attack on South Sudan aid convoy: IOM | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Seen March 10, 2017, a woman and girl carry food from a distribution centre in Unity State, South Sudan, a country where some 100,000 people are suffering from a man-made famine as a three-year conflict has made it difficult for aid workers to help\nThe International Organization for Migration said Thursday that two people were killed when gunmen attacked an aid convoy in South Sudan, where chronic violence has led to famine.\nThe aid organisation said the convoy was attacked on Tuesday as it was returning from the central town of Yirol where staff and health workers had been assisting communities affected by a deadly outbreak of cholera.\nOne of the vehicles was ambushed by gunmen who shot dead two people -- a civilian and a person \"involved in the health response\", according to the IOM.\nThree others were injured, including an IOM health officer, the organisation said in a statement.\n\"This tragic attack on aid workers and civilians is appalling,\" said IOM director general William Lacy Swing.\n\"In a country overwhelmed by the huge lack of basic necessities due to conflict, famine and health epidemics, these types of attacks undoubtedly harm the ability of humanitarian partners to provide assistance to millions in need of lifesaving aid.\"\nSome 100,000 people are suffering from a man-made famine in South Sudan, where a three-year conflict has made it difficult for aid workers to reach the needy.\nAnother one million people could tip into famine if there is insufficient rain in the coming months and a total of nearly five million are going hungry.\nA biting drought has forced many to turn to unsafe water sources, resulting in diseases such as cholera which has affected 300 and left 10 dead in Yirol.\n\"Amid an already difficult operating environment, insecurity and access constraints continually hinder the ability of IOM and other aid agencies to reach the most vulnerable in many parts of the country,\" said the IOM statement.\nInternational aid agencies have criticised South Sudan for raising foreign worker visa fees to as much as $10,000 (9,300 euros) just days after famine was declared, accusing them of seeking to profit from the crisis.\nIn an unprecedented global food crisis more than 20 million people are facing starvation, with Yemen, Nigeria and Somalia also on the verge of famine.","url":"https://www.dailymail.co.uk/wires/afp/article-4320948/Two-killed-attack-South-Sudan-aid-convoy-IOM.html"}
