{"authors":["Jessica Chia For Dailymail.Com"],"date_download":"2018-10-23 05:23:41","date_modify":"2018-10-23 05:23:41","date_publish":"2017-04-26 16:54:58","description":"US Citizen Ariel Garcia, along with Elvin Montilla-Sosa of the Domincan Republic, were arrested in New York on Wednesday with cocaine worth a street value of $380,000.","filename":"data/vaneerConsumption/Twomenfoundwith23poundsofcocaineatNewYorksJFK.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA06D6A00000578-0-image-a-10_1493222080084.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448270_Two-men-23-pounds-cocaine-JFK_1540272221.html","title":"Two men found with 23 pounds of cocaine at New York's JFK","title_page":"Two men found with 23 pounds of cocaine at New York's JFK | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two men were found with a total of 23 pounds of cocaine taped around their bodies at John F Kennedy International Airport last week.\nUS Citizen Ariel Garcia, along with Elvin Montilla-Sosa of the Domincan Republic, were arrested in New York on Wednesday with cocaine worth a street value of $380,000, according to Customs and Border Protection.\nThe CBP released photographs of the two men, who now face federal drug smuggling charges, with bulky packages wrapped around their bodies.\nUS Citizen Ariel Garcia, along with Elvin Montilla-Sosa of the Domincan Republic were found with a total of 23 pounds of cocaine taped around their bodies at JFK last week\nThe two men arrived in the US on the same flight from Santo Domingo, Dominican Republic last week, the CBP said.\nThey were taken to a private search room, where officers found about 11 pounds of cocaine - worth about $180,000 - taped to Garcia's legs.\nMontilla-Sosa was found with 12 pounds of cocaine, with an estimated street value of $200,000, taped in bulky packages to his legs and back.\nBoth men were arrested and turned over to Homeland Security Investigations.\n'This latest seizure demonstrates our CBP officers being ever vigilant in protecting the United States from the distribution of these illicit drugs,' said Leon Hayward, Acting Director of CBP’s New York Field Operations.\nThe drug bust came after two other men from Santo Domingo were found with drugs taped to their bodies in two separate incidents in March.\nThe drug bust came after two other men from Santo Domingo were found with drugs taped to their bodies in two separate incidents in March (pictured, Mayobanex Ruiz Gomez)\nOn March 16, Mayobanex Ruiz Gomez, was taken in for a search at JFK after he appeared nervous. He was found with about five pounds of cocaine taped to his legs.\nThe CPD called it a case of ‘deja vu all over again’ after Juan Carlos Galan Luperon, a US citizen flying from the Caribbean country was 'bursting out of his pants' on March 4.\nHe was found with 10 pounds of cocaine worth $164,000.","url":"https://www.dailymail.co.uk/news/article-4448270/Two-men-23-pounds-cocaine-JFK.html"}
