{"authors":["Dave Burke For Mailonline"],"date_download":"2018-10-23 03:08:47","date_modify":"2018-10-23 03:08:47","date_publish":"2017-03-10 12:37:09","description":"Timothy Batz, 21, and his 24-year-old sibling Noah Batz face a string of charges after the nude rampage in Indianapolis, during which one of the brothers is alleged to have threatened to kill a woman.","filename":"data/vaneerConsumption/Twonakedbrothersarrestedonchargesincludingincest.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22D59800000578-0-image-a-28_1489149390420.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301080_Two-naked-brothers-arrested-charges-including-incest_1540264127.html","title":"Two naked brothers arrested on charges including incest","title_page":"Two naked brothers arrested on charges including incest | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two brothers have been arrested after allegedly getting naked, making out with each other, punching a woman in the head and jumping on cars belonging to strangers.\nTimothy Batz, 21, and his 24-year-old sibling Noah Batz face a string of charges after the nude rampage, during which one of the brothers is alleged to have threatened to kill a woman.\nThey reportedly told Indianapolis police they were under the influence of mushrooms and marijuana when it happened on Sunday afternoon.\nScroll down for video\nTimothy Batz (left) and brother Noah Batz (right) told police they were under the influence of mushrooms and marijuana when it happened\nA woman was left with a 'large knot' on her forehead.\nThe pair were spotted 'passionately making out' by a staff member at an apartment complex outside which the drama took place.\nWitness Aimee Payton told Fox59: 'We knew it was something beyond just being drunk or high... it was something heavy duty. Not a good batch of whatever he got.'\nShe said of Noah Batz: 'He was extremely aggressive and then to hear later he punched somebody, it wasn't surprising with how agitated he was and he continued to get more and more agitated.'\nA member of staff at the nearby apartment complex told police the two men had threatened to kill her, and that she had seen the brothers 'passionately making out with one another in front of the dumpster'.\nNoah Batz was originally arrested, WISH-TV reports, on suspicion of battery resulting in injury, disorderly conduct, resisting law enforcement, intimidation, public indecency, criminal mischief, obscene performance, incest, attempted auto theft and unlawful entry of a motor vehicle.\nTimothy Batz was arrested for public intoxication, incest, intimidation, obscene performance, disorderly conduct, public indecency, possession of marijuana, resisting law enforcement, attempting auto theft, unlawful entry of a motor vehicle and criminal mischief.","url":"https://www.dailymail.co.uk/news/article-4301080/Two-naked-brothers-arrested-charges-including-incest.html"}
