{"authors":[],"date_download":"2018-10-22 22:55:45","date_modify":"2018-10-22 22:55:45","date_publish":"2014-05-13 11:33:14","description":"A whistleblower at a VA hospital in Phoenix came forward this month and claimed that as many as 40 patients may have died because of delays.","filename":"data/vaneerConsumption/TwoonLeaveinNorthCarolinaVAChecksInappropriateScheduling.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_va-hospital-scandal_two-leave-north-carolina-va-checks-inappropriate-scheduling-n103951_1540248945.html","title":"Two on Leave in North Carolina, VA Checks 'Inappropriate Scheduling'","title_page":"Two on Leave in North Carolina, VA Checks 'Inappropriate Scheduling'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Veterans Administration, engulfed in a scandal over delays in patient care, says it has put two North Carolina employees on leave because they may have taken part in “inappropriate scheduling practices.”\nPreparations for a national audit ordered by Eric Shinseki, the VA secretary, found that the two employees may have engaged in the inappropriate scheduling at a VA hospital in Durham between 2009 and 2012, NBC affiliate WNCN reported.\nA team from the Veterans Health Administration, a division of the VA, will visit the hospital this week to investigate, the VA said in a statement Monday. The nature of the questionable scheduling was not clear.\nA whistleblower at a VA hospital in Phoenix came forward earlier this month and claimed that as many as 40 patients there may have died because of delayed appointments.\nThe whistleblower, Dr. Samuel Foote, said that the facility had a secret wait list so it could hide the time that some patients waited to be seen. The VA is also looking into scheduling delays at VA hospitals in Texas.\n— Erin McClam","url":"https://www.nbcnews.com/storyline/va-hospital-scandal/two-leave-north-carolina-va-checks-inappropriate-scheduling-n103951"}
