{"authors":[],"date_download":"2018-10-30 20:24:58","date_modify":"2018-10-30 20:24:58","date_publish":"2015-11-10 11:18:59","description":"Homicide and arson investigators are looking into a suspicious overnight house fire in northwest Atlanta left two people dead.","filename":"data/vaneerConsumption/TwopeopledeadinsuspiciousNWAtlantahousefire.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/10/Videos/4604266486001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_two-people-dead-suspicious-atlanta-house-fire__1540931098.html","title":"Two people dead in ‘suspicious’ NW Atlanta house fire","title_page":"Two people dead in ‘suspicious’ NW Atlanta house fire","title_rss":"NULL","source_domain":"ajc.com","text":"Homicide and arson investigators are looking into a suspicious overnight house fire in northwest Atlanta left two people dead.\nAgents with the federal Bureau of Alcohol, Tobacco and Firearms also remained at the burned out house on Jett Street in the Vine City community early Tuesday afternoon, nearly 12 hours after the home went up in flames.\nFive people were inside the home when it caught fire, and a man and woman were unable to escape.\nArriving fire crews found the house fully involved in flames.\n“Most of the fire was on the front side of the house, which prevented [firefighters] from going in the front door,” Atlanta fire spokesman Cortez Stafford told The Atlanta Journal-Constitution. “Also, they had a vehicle burning in the driveway and they had a house next door that was starting to light up, too.”\nOne of the three people who escaped the fire told Channel 2 Action News that his uncle and the woman killed were in an argument with someone at the front door just before the fire broke out.\n“This fire is being reported as suspicious due to some of the statements of people that were here,” Stafford said. “Any time you have two deaths in a fire, it’s going to be investigated thoroughly, to figure out why these two people lost their lives tonight.”\nThe names of the man and woman killed had not been released Tuesday night pending notification of next of kin.","url":"https://www.ajc.com/news/local/two-people-dead-suspicious-atlanta-house-fire/fA4XpKJbT56kuSjofVLwEN/"}
