{"authors":["Rachael Burford For Mailonline"],"date_download":"2018-10-23 03:56:29","date_modify":"2018-10-23 03:56:29","date_publish":"2017-04-26 15:35:45","description":"Claire Gordon (pictured), who at the height of her fame was a rival to Diana Dors, starred in a series of saucy 1960s comedies and was once billed as ‘Britain’s answer to Brigitte Bardot’.","filename":"data/vaneerConsumption/TwopropertyconsultantsconnedactressClaireGordon.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA0556400000578-0-image-a-67_1493218618986.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448098_Two-property-consultants-conned-actress-Claire-Gordon_1540266989.html","title":"Two property consultants ‘conned actress Claire Gordon'","title_page":"Two property consultants ‘conned actress Claire Gordon' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two property consultants conned dying 1960s actress into leaving them her entire estate in her will, a court heard.\nClaire Gordon, who at the height of her fame was a rival to Diana Dors, starred in a series of saucy 1960s comedies and was once billed as ‘Britain’s answer to Brigitte Bardot’.\nShe altered her will when she was allegedly ‘not in a fit and proper state’ to leave her estate to Iain Macmaster, 69, and Morris Benhamu, 41, before she died aged 74 in April 2015.\nClaire Gordon, who at the height of her fame a rival to Diana Dors, altered her will before she died aged 74 in April 2015\nMorris Benahmu (right) and Iain Macmaster (left) are accused of falsely representing that Mrs Gordon was in 'a fit and proper state to sign a will in her name’. Both men worked for property businesses during the alleged conspiracy, but have since resigned\nMrs Gordon, aged 62. She altered her will before her death in 2015 and left everything to Macmaster and Benhamu\nThe pair are now accused of falsely representing that Mrs Gordon was in 'a fit and proper state to sign a will in her name’ between January 2014 and September 2015.\nMrs Gordon appeared alongside British comedy legends including Bob Monkhouse and ‘Some Mothers Do ‘Ave ‘Em’ star Michael Crawford in a series of West End plays during the 1960s.\nThe actress also starred in cult films including the 1958 farce I Only Arsked! and 1970 caper ‘The Dirtiest Girl I Ever Met’ after she was spotted by a photographer and signed to an acting contract aged 16.\nMacmaster and Benhamu appeared at Westminster Magistrates’ Court today charged with one count of conspiracy to defraud and one count of fraud by false representation.\nBoth men worked for property businesses during the alleged conspiracy, but have since resigned.\nThey spoke only to identify themselves during the short hearing.\nThe actress (pictured left in 1965) appeared in cult films including the 1958 farce I Only Arsked! and 1970 caper ‘The Dirtiest Girl I Ever Met’. On the right, in 2015\nShe appeared alongside British comedy legends including Bob Monkhouse and ‘Some Mothers Do ‘Ave ‘Em’ star Michael Crawford in a series of West End plays\nMagistrate Grant McCrostie said: ‘Your pre-trial hearing will take place at Southwark Crown Court on the 24 May and until that time you are going to be on conditional bail.’\nMacmaster, of Carburton Street, Westminster, and Benhamu, from Middlesex, have indicated not guilty pleas to the charges.\nThey were released on conditional bail until a preliminary hearing at Southwark Crown Court on 24 May.","url":"https://www.dailymail.co.uk/news/article-4448098/Two-property-consultants-conned-actress-Claire-Gordon.html"}
