{"authors":["Nate Church"],"date_download":"2018-10-30 20:01:34","date_modify":"2018-10-30 20:01:34","date_publish":"2018-08-21 03:08:10","description":"Nashville authorities have two suspects in custody who are wanted in connection to a series of attempted robberies and multiple homicides.","filename":"data/vaneerConsumption/TwoSuspectsinCustodyAfterColdBloodedMurdersinNashville.json","image_url":"https://media.breitbart.com/media/2018/08/Lacory-Lytle-Demontrey-Logsdon-Nashville-PD.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_20__1540929694.html","title":"Two Suspects in Custody After 'Cold-Blooded' Murders in Nashville","title_page":"Two Suspects in Custody After 'Cold-Blooded' Murders in Nashville | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Nashville, TN, authorities have two suspects in custody who are wanted in connection to a series of attempted robberies and multiple homicides.\nNashville Police asked the community Monday for help locating the suspects and cautioned residents to be extra careful. Monday evening, police arrested Demontrey M. Logsdon, 20, while Lacory C. Lytle, 24, turned himself in shortly afterward.\nBREAKING: Community's help needed in locating Lacory Lytle, 24, & Demontrey Logsdon, 20, who are wanted for questioning in the murders of 2 persons outside the Cobra bar last Friday and the murder of a man last Tue on Alta Loma Rd. See Lytle or Logsdon? Pls call 615-742-7463 pic.twitter.com/X58DUZKSFM — Metro Nashville PD (@MNPDNashville) August 20, 2018\n“It’s definitely scary,” local resident Hannah Thompson told NBC while the alleged killers were still at large. “It struck a lot of fear in me and makes me nervous to get home at night.”\nThe suspects allegedly murdered 31-year-old Kendall Rice on his way to the bus stop for work. They are further suspected in the killing of Bartley Teal, 33, and Jaime Sarrantonio, 30, who were fatally shot outside of the Cobra bar while celebrating Teal’s 33 birthday.\nBREAKING: The two murderers who killed a man and woman outside Cobra Nashville bar, 2511 Gallatin Ave, at 3:26 a.m. today during a robbery fled in this small Chevy car. Any information? Please call Crime Stoppers at 615-742-7463 pic.twitter.com/rXKtzd0FG1 — Metro Nashville PD (@MNPDNashville) August 17, 2018\n“These are just two senseless cold-blooded homicides,” said police spokesman Don Aaron. Nashville Metro Police Department Commander David Imhof told reporters for the Tennessean that they believe the robberies and murders are connected. But Nashville police spokeswoman Kristin Mumford told NBC that while “there are similarities,” the crimes “have not been definitively connected.”\n“The men have not been charged with any of the killings, which police say are still under investigation,” CNN reports.","url":"https://www.breitbart.com/politics/2018/08/20/nashville-cold-blooded-murder-suspects/"}
