{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:54:50","date_modify":"2018-10-30 20:54:50","date_publish":"2016-09-28 19:45:03","description":"Two students and a teacher have been shot and wounded Wednesday at Townville Elementary School in Anderson County, South Carolina, according to local authorities.","filename":"data/vaneerConsumption/TwoStudentsTeacherShotWoundedatSCElementarySchool.json","image_url":"https://media.breitbart.com/media/2016/09/Screen-Shot-2016-09-28-at-2.43.39-PM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/2nd-amendment_2016_09_28__1540932890.html","title":"Two Students, Teacher Shot, Wounded at SC Elementary School","title_page":"Two Students, Teacher Shot, Wounded at SC Elementary School | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Two students and a teacher have been shot and wounded Wednesday at Townville Elementary School in Anderson County, South Carolina, according to local authorities.\nWSPA reports that a teenage suspect is in custody “and there is no longer an active threat.”\nAccording to WYFF, Anderson County Sheriff’s Office Lt. Sheila Cole reports the shooting occurred “shortly after 1 pm.” Armed officers reached the school before 2 pm. FOX Carolina reports that Anderson County deputies said “the [wounded] students were airlifted to the Greenville Hospital System pediatric trauma unit and the teacher was taken to AnMed Health System.”\nThe Anderson County Coroner’s Office also reports a death at a separate location, roughly three miles from the school. The death is being investigated as “connected with the shooting at the school.”\n***UPDATE *** 10:13 pm:\nThe two students wounded in the Townville Elementary attack were both boys, both 6-years-old. One was critically wounded and one was treated and released. USA Today reports that the wounded teacher–Meghan Hollingsworth–was also treated and released. The single fatality reported at a secondary location was the 14-year-old gunman’s father.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/2nd-amendment/2016/09/28/two-students-teacher-shot-wounded-sc-elementary-school/"}
