{"authors":["Valerie Edwards For Dailymail.Com"],"date_download":"2018-10-23 00:44:52","date_modify":"2018-10-23 00:44:52","date_publish":"2016-01-29 14:03:40","description":"Rene Perez, 20, and Oscar Perez Jr, 21, were arrested in Texas after attempting to stuff a safe in a car. The homeowner called 911 after receiving a motion-activated alarm on his cell phone.","filename":"data/vaneerConsumption/TwoTexasmenarearrestedafterhomeownerwatchedthemstuffasafeinacar.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B2CBAE00000578-0-image-a-13_1454075946976.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422826_Burglary-suspects-caught-homeowner-watched-attempt-stuff-large-safe-seat-car_1540255492.html","title":"Two Texas men are arrested after homeowner watched them stuff a safe in a car","title_page":"Two Texas men are arrested after homeowner watched them stuff a safe in a car | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two men have been arrested after trying to stuff a huge safe into the back of a car.\nRene Perez, 20, and Oscar Perez Jr, 21, fled on foot, but were apprehended after a short pursuit.\nAuthorities responded to a report of a burglary Thursday afternoon when the home owner called 911 around 2pm after he received a motion-activated alarm on his cell phone.\nThe homeowner was able to provide a physical description of the suspects when he called 911 after observing them on his cell phone surveillance camera\nOscar Perez Jr (left) and Rene Perez (right) fled on foot, but were apprehended after a short pursuit on foot\nThe homeowner observed three suspects on his cell phone via surveillance camera and provided descriptions of the men to the 911 operator.\nAccording to the Hays County Sheriff’s Office, law enforcement was on scene within one minute of the call and the officer saw the men trying to load a large safe into a car.\nIt's unclear if the two are related, but both are Hays County residents from the Kyle and San Marcos areas.\nRene Perez, who has prior arrest records, was arrested in 2013 for failure to appear in court as promised and was ordered to pay a $360 fine.\nDeputies said a third person was also arrested, but was not involved in the burglary and has been cleared.\nThe sheriff's office said the two will be charged with felony burglary of a habitation.\nThe suspects attempted to load a large safe in the back of a car. They are Hays County residents from the Kyle and San Marcos areas\nAuthorities responded to the burglary Thursday afternoon when the homeowner called 911 around 2pm","url":"https://www.dailymail.co.uk/news/article-3422826/Burglary-suspects-caught-homeowner-watched-attempt-stuff-large-safe-seat-car.html"}
