{"authors":["Jenny Awford For Daily Mail Australia"],"date_download":"2018-10-23 00:56:01","date_modify":"2018-10-23 00:56:01","date_publish":"2016-01-28 15:05:26","description":"Camera phone footage shows the Australian father lying down with his eyes closed while his two young daughters start brushing his teeth with their pet dog's brush.","filename":"data/vaneerConsumption/Twoyounggirlsseenbrushingfathersteethwithdogstoothbrush.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AADC3000000578-0-image-a-30_1453990909256.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421096_Two-young-girls-seen-brushing-father-s-teeth-dog-s-toothbrush_1540256161.html","title":"Two young girls seen brushing father's teeth with dog's toothbrush","title_page":"Two young girls seen brushing father's teeth with dog's toothbrush | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the disgusting moment a father let his two young daughters brush his teeth before realising they were using the dog's toothbrush.\nThe man can be seen lying on an ottoman with his eyes closed before his two young children start playing with his mouth in the camera phone footage.\nOne of the girls can be heard ordering her father to 'open your mouth' before her younger sister is seen starting to brush with the dark brown toothbrush.\nVideo shows moment a father let his two young daughters brush his teeth before realising they were using the dog's toothbrush\nWhen another family member started laughing and saying 'ah no, where did they get that toothbrush from', the father suddenly sat up with a horrified look on his face\nBut when another family member started laughing and saying 'ah no, where did they get that toothbrush from?' the father suddenly sat up with a horrified look on his face.\n'What’s wrong with the toothbrush?' the father said in the footage that was uploaded onto the Straya Facebook page.\nThe woman filming the video can then be heard saying: 'It’s the dog's' while trying to suppress hysterical laughter.\n'Ah, it’s the dog’s toothbrush,' the woman repeated.\nThe man can be seen lying on an ottoman with his eyes closed in the camera phone footage before his two young children start playing with his mouth\nHis older daughter can be heard ordering her father to 'open your mouth' before the younger is seen starting to brush with the dark brown toothbrush\nThe father can then be seen sprinting into another room, followed by one of his daughters.\nThe video, which was called You Might Not Wanna Use That Toothbrush, has attracted more than 12,000 views and 130 comments.\nMelisa Stevens commented: 'This still cracks me up.'\nAdrienne Jackson said: 'Hahahahaha, like the time I woke up to M trying to feed me toilet water from her Tea pot.'\nThe woman filming the video can then be heard saying: 'It’s the dogs' while trying to suppress hysterical laughter","url":"https://www.dailymail.co.uk/news/article-3421096/Two-young-girls-seen-brushing-father-s-teeth-dog-s-toothbrush.html"}
