{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-23 02:22:33","date_modify":"2018-10-23 02:22:33","date_publish":"2017-04-26 13:25:29","description":"Stelio Stefanou, 63, objected to his neighbours' plans for a three-storey super-basement underneath a listed building in Charles Street, Mayfair.","filename":"data/vaneerConsumption/Tycoonblocksneighboursthreestoreyicebergbasement.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F50DC00000578-0-image-a-29_1493209173050.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447490_Tycoon-blocks-neighbour-s-three-storey-iceberg-basement_1540261353.html","title":"Tycoon blocks neighbour's three storey iceberg basement","title_page":"Tycoon blocks neighbour's three storey iceberg basement | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A millionaire tycoon has today overturned neighbours' plans for an iceberg basement under his £50million Mayfair mansion.\nStelio Stefanou, 63, objected to his neighbours' plans for a three-storey super-basement underneath a listed building in Charles Street.\nThe 'very substantial' extension was to include a kitchen, laundry, cinema and gym, together with a two-storey subterranean swimming pool.\nMr Stefanou's £50million home was the Duke of Clarence's house before he was crowned King William IV in 1830.\nBig win: Stelio Stefanou, 63, objected to his neighbours' plans for a three-storey super-basement underneath a listed building in Charles Street (pictured) - and overturned it at the High Court today\nPlanners gave the go-ahead to Cunningham Management Ltd for the work in August last year, but today a High Court judge overturned the decision.\nSpeaking afterwards Mr Stefanou told the Evening Standard: 'It's a massive relief, we're pleased the judge has seen sense.\n'These historical buildings need to be protected. We've no idea how this development was even allowed in the first place. It would have been so disruptive.\nMr Stefanou's home was the Duke of Clarence's house before he was crowned King William IV in 1830 - but he said the basement planned next door was bad for the whole area\n'Going to judicial review was a big risk but there was no other option, I will not stop fighting to save my house'.\nHe added: 'This was a lovely little community, but things like this break it up. You don't need to dig three floors underground to use a house. It is an enormous worry for us.'\nMr Justice Gilbart said Westminster City Council's planners had not taken sufficient account of its own policy on super-basements.\nThe judge said the house, only a few yards from the Saudi Arabian embassy, is in need of some repair and been the subject of works plans for years.\nHowever, the huge underground development would cause a 'great deal of upheaval', with 'lengthy building and excavation works', he added.\nLawyers for businessman and philanthropist Mr Stefanou argued that the council was wrong to grant listed building consent and planning permission.\nIt had failed to have regard to a new policy, which allows for excavation of more than one floor only in 'exceptional circumstances'.\n'Patently, this development fell to be considered against that policy,' said the judge.\n'It proposed a very substantial basement extension, with the creation of two new basement floors.'\nIn smart Charles Street, pictured, which is close to Grosvenor Square, homes comfirtably sell for more than £50million\nThe judge said the council had gone wrong in the way it had considered the proposals before granting permission.\nAs permission was already in place for a basement extension in 2011, the council thought it only had to consider work which was additional to that already allowed.\nThat was a 'very straightforward error of law', as the 'whole scheme' had to be considered in the light of the policy on basements.\n'There can be no doubt that this proposal involved the provision of basements and that it was caught by the new policy,' he said. 'The council was bound to have regard to it.'\nHe quashed the planning permission and the listed building consent.\nEgypt-born Mr Stefanou is a regular on the Sunday Times Rich List. He sold his building maintenance company, Accord Plc, for about £150m in 2007.","url":"https://www.dailymail.co.uk/news/article-4447490/Tycoon-blocks-neighbour-s-three-storey-iceberg-basement.html"}
