{"authors":["Mailonline Reporter"],"date_download":"2018-10-23 01:30:01","date_modify":"2018-10-23 01:30:01","date_publish":"2016-01-29 15:24:42","description":"He has a rather complicated personal life.\nBut Tyga was keen to brush that aside when he stepped out in LA on Thursday afternoon - complete with a wad of cash in his pocket.","filename":"data/vaneerConsumption/Tygaflauntsa3000wadofcashashevaultsoverarailinginLA.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B309C200000578-0-image-a-121_1454080109195.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422862_Tyga-flaunts-3-000-wad-cash-vaults-railing-LA_1540258201.html","title":"Tyga flaunts a $3,000 wad of cash as he vaults over a railing in LA","title_page":"Tyga flaunts a $3,000 wad of cash as he vaults over a railing in LA | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He currently has a rather complicated personal life.\nBut Tyga was clearly keen to brush that aside when he stepped out in Los Angeles on Thursday afternoon - complete with a wad of cash in his pocket.\nThe 26 year-old rapper was spotted leaving a friend's house in West Hollywood while carrying around $3,000 in $100 bills.\nScroll down for video\nMoney talks: Tyga left a friend's house in West Hollywood on Thursday while carrying circa $3,000 in $100 bills\nThe critically-acclaimed performer cut a casual figure as he emerged from the Calabasas property, wearing a typically urban ensemble.\nTogether, that consisted of low-slung jeans in jet black, a white T-shirt, indigo denim overshirt and a chunky gold chain for added emphasis.\nHe capped the look with a beanie hat, a gold watch and a pair of pristine white trainers.\nThat's more than a little loose change! The 26 year-old rapper was certainly looking flush with the cash\nLooking good: The critically-acclaimed performer cut a casual figure as he emerged from the Calabasas property, wearing a typically urban ensemble\nDisplaying a clear spring in his step, he could then be seen vaulting over a pedestrian barrier - a feat which saw him brandish the cold, hard cash in his front pocket.\nTied by a yellow bank grip, the notes looked fresh and deliciously crease-free.\nEvidently happy to be in possession of the cash, he had a definite smile on his face and seemed to be carefree, despite his recent personal drama, which has seen ex-girlfriend Blac Chyna get close to Rob Kardashian.\nStill smiling: Tyga didn't seem too perturbed by news of Blac Chyna and Rob Kardashian's romance as he put on an energetic display while leaving a friend's house on Thursday night\nAnd it seems to be working. Despite rumours that he has split from girlfriend Kylie Jenner, he appeared to be on good form.\nAnd, although his ex is now causing shockwaves, he's remaining dignified.\nWhen asked about Blac Chyna's new relationship with Rob Kardashian, Tyga recently told E! News that: 'Everybody deserves to be happy.'\nJump to it: Displaying a clear spring in his step, he could then be seen vaulting over a pedestrian barrier - a feat which saw him brandish the cold, hard cash in his front pocket","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422862/Tyga-flaunts-3-000-wad-cash-vaults-railing-LA.html"}
