{"authors":["Mailonline Reporter"],"date_download":"2018-10-22 22:34:46","date_modify":"2018-10-22 22:34:46","date_publish":"2016-01-29 09:37:46","description":"The Rack City hitmaker is now shelling out $35,000 a month on renting a new pad just off Sunset Plaza, above The Sunset strip, which happens to be an hour away from Kylie's house.","filename":"data/vaneerConsumption/TygasetssightsonanewhomefarawayfromKylieJenner.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/09/30B0F7A700000578-0-image-a-11_1454060388406.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422409_Tyga-ignites-split-rumours-sets-sights-new-home-far-away-Kylie-Jenner-declares-wants-single_1540247686.html","title":"Tyga sets sights on a new home 'far away from Kylie Jenner'","title_page":"Tyga sets sights on a new home 'far away from Kylie Jenner' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tyga is said to have set his sights on a new home 'far, far away' from girlfriend Kylie Jenner.\nThe rapper, 26, was previously looking for a property in Calabasas, California, so he could be near his reality star lover, 18.\nBut TMZ reports the Rack City hitmaker is now shelling out $35,000 a month on renting a new pad just off Sunset Plaza, above The Sunset strip, which happens to be an hour away from Kylie's house.\nScroll down for video\nTrouble in paradise? Tyga is said to have set his sights on a new home 'far, far away' from girlfriend Kylie Jenner... just hours after the reality star, 18, declared she wanted to be single\nBoasting 'jet-liner views of the city', the lavish property features four bedrooms and an infinity pool and is said to have been marketed as a 'sexy bachelor pad'.\nThis comes after Kylie declared she would like to be single after having a significant other in her life since the tender age of 14.\nIn the wake of revelations her brother Rob is dating her current squeeze Tyga's ex fiancée Blac Chyna, it seems Kylie has had enough of relationships.\nPosting a chat with friend Jordyn Wood on her website on Thursday, star got philosophical about dating and having a man.\nSee more Kylie Jenner updates as as she declares she wants to be single\n'Far, far away': The Rack City hitmaker is now shelling out $35,000 a month on renting a new pad just off Sunset Plaza, above The Sunset strip, which happens to be an hour away from Kylie's house\nMoving on? Kylie appears to be reconsidering her romantic status with boyfriend Tyga in the wake of revelations his ex Blac Chyna is now dating her brother Rob\nShe said: 'I feel like I have been in a relationship for six years.\n'I have just gone from one person to the next. I was dating someone for like, three years, 14. 15, 16, and a little bit of 17.'\nIt is thought she was referring to her ex boyfriend Jaden Smith. She was romantically linked with Will and Jada's son.\nSee more of the latest news on Kylie Jenner as she says she wants to be single\nMoving on? The rapper, 26, was previously looking for a property in Calabasas, California, so he could be near his reality star lover, 18\nStill smiling: Tyga didn't seem too perturbed by news of Blac Chyna and Rob Kardashian's romance as he put on an energetic display while leaving a friend's house on Thursday night\nIn a revealing chat on her website she said: 'I have just gone from one person to the next. I was dating someone for like, three years, 14. 15, 16, and a little bit of 17'\nKylie told her friend Jordyn Wood: 'I feel like I really need to find myself. And have like a relationship with myself'\nNot enough: It seems a giant rock for her finger wasn't enough to stop the seeds of doubt being sown\nCash money: Tyga had a wad of cash in his pocket as he headed out on Thursday\nKylie then continued: 'I went into another relationship, 17, 18', which was of course in reference to Tyga - the pair got together aorund October 2014, in the wake of his split with Blac Chyna.\nThe reality star added: 'I feel like I really need to find myself. And have like a relationship with myself.\n'Because I don't know what it feels like to be by myself.\n'I feel like you have to love yourself before you can love anybody else.\nIt is no surprise Kylie is questioning her romantic status at the moment after all the drama the family has endured this week.\nIt was revealed on Sunday her brother Rob was dating Blac Chyna, and the pair have moved in together.\nDifficult: She has no doubt had a trying week with the revelations her current squeezes ex is now living with her brother Rob - Tyga and Blac Chyna are seen here before they split in 2014\nStirring up drama: The 28-year-old, seen in July 2014 has been taking to Instagram to stir up the situation\nKylie herself took to Instagram with a few choice posts, which appeared to indicate her dismay, including one, which she took down, which appeared to show Rob as a devil.\nMeanwhile her mother Kris, 60, said she had endured a difficult day on Monday, saying she was grateful to received some flowers.\nThen it was revealed Khloe wasn't best pleased about the situation either - according to TMZ, the reality star, 31 'hit the roof' when she returned to her property early to find Tyga's ex-girlfriend standing in her kitchen with her brother, 28.\nNew love: He shared this close up photo of the model on his Instagram on Wednesday morning as if in celebration of their relationship\n'#babykardashian': He seems to be dining out on the situation - he broke his social media silence to joke about his new reported girlfriend Blac Chyna having his baby on Tuesday\nShe ordered Blac Chyna to 'get the hell out' of her home after she found Rob and his new flame surrounded by 'liquor and trash'.\nKhloe is said to have thrown her sibling - who has been living at her house for many years - out when she discovered the pair, pushing him to move in with the new lady in his life in spite of her somewhat controversial relationship with his family.\nIt's claimed that the new couple were surrounded by liquor bottles and trash that was dotted around the room, seemingly because the two had been there for days.\nNot talking: Meanwhile Mum Kris has remained tight lipped: she wasn't drawn on how she felt about her son's new lady when she appeared on Hollywood Today LIVE on Tuesday\nShe needed this: She may have been cool and calm on TV but on Monday she seemed to be struggling, saying on Instagram, 'Had a challenging Monday and just walked in the door to this gorgeousness that put the biggest smile on my face and in my heart. How lucky am I? Your friendship means the world'\nA source told the website Khloe boiled over and asked Chyna: 'What the f**k are you doing in my house?'\nBlac Chyna - who shares a son, King Cairo, with rapper Tyga is then believed to have bolted for Rob's bedroom.\nMeanwhile, putting her thoughts on her relationship aside, Kylie also discussed rumours of sibling rivalry between herself and sister Kim.\n'Get the hell out!' It's been reported that Khloe Kardashian booted her brother Rob out of her home after catching him in her kitchen with his new girlfriend\nSlammed: Khloe, 31, sent a strong message to her brother during a visit to Kanye West's recording studio with her sisters Kim and Kourtney on Tuesday. 'Never go against THE family,' she wrote next to this snap\nIn another video on TheKylieJenner.com, she talked to Jordyn about a message she had received which said: 'Watch out Kylie Jenner, Kim Kardashian could steal your Snapchat crown.'\nThe brunette scoffed: ' No one is going to steal my Snapchat crown, then added, 'But I don't know she might get a lot of views.'\nQualifying how she felt about Kim she revealed: 'People are always trying to put me and my sister Kim in a competition, or like I'm trying to be Kim or I am trying to steal Kim's throne.\nAs well as discussing relationships, Kylie also talked about sibling rivalry with sister Kim\nSetting the record straight: She said of the pair who are often seen in similar outfits, that she was inspired by her older sister\n'I think people forget that me and Kim are sisters, that we are not in a competition, we are completely different people.'\nSaying she was setting the 'record straight once and for all' she said her sister was one of her 'biggest inspirations.'\nKylie continued: 'That’s not a secret. I look up to my sister. I don’t think that’s a weird thing.'\nShe then added after saying she looked up to her sibling: 'Yeah it's cute, I do wanna be Kim'\nJordyn then chimed in:' My little sister looks up to me and it's like, little sisters look up to their older sisters, it's human nature I think.'\nAfter pondering for a moment Kylie added: 'Yeah it's cute, I do wanna be Kim.'\nHowever, whether she would have changed her stance after seeing Tyga on Khloe's chat show on Wednesday is anyone's guess.\nIn a dangerous game of F**k, Marry, Kill, Tyga revealed he would like to get frisky with Kim.\nBold move! Tyga admitted that he would 'f**k' Kim Kardashian during his appearance on Kocktails With Khloe on Wednesday night\nWhen asked to choose between sisters Khloe, Kim and Kourtney during the raunchy game, Tyga remarked: 'I'll probably marry Khloe, probably f**k Kim and probably kill Kourtney.'\nThe 26-year-old was then asked to clarify that by Khloe's best friend Malika Haqq, who was also a guest on the show.\n'Yeah for sure. Yeah, y'all know that, y'all know what it is, you know what it is,' Tyga told them seriously.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422409/Tyga-ignites-split-rumours-sets-sights-new-home-far-away-Kylie-Jenner-declares-wants-single.html"}
