{"authors":["Ben Wilkinson For The Daily Mail","Nick Enoch For Mailonline"],"date_download":"2018-10-23 02:06:46","date_modify":"2018-10-23 02:06:46","date_publish":"2017-03-16 12:23:31","description":"Police were called to a property in Faringdon, Oxfordshire, at around 1.20pm on Tuesday and discovered the body of the child - named locally as Tyler Warmington - who was of primary school age.","filename":"data/vaneerConsumption/TylerWarmington5stabbedtodeathinhishome.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/02/3E506A4500000578-0-image-a-4_1489631497270.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319720_Boy-five-stabbed-death-home_1540260406.html","title":"Tyler Warmington, 5, 'stabbed to death in his home'","title_page":"Tyler Warmington, 5, 'stabbed to death in his home' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The body of the boy, named locally as Tyler Warmington, was discovered by police at his home. He had suffered stab wounds to his chest\nA five-year-old boy found dead at his home had suffered stab wounds to his chest, it was revealed today.\nPolice were called to a property in Faringdon, Oxfordshire, at around 1.20pm on Tuesday and discovered the body of the child - named locally as Tyler Warmington - who was of primary school age.\nA 40-year-old woman, from Faringdon - understood to be his mother, Emma - was arrested on suspicion of murder and later freed on police bail until April 12, Thames Valley Police said.\nPolice revealed the boy had died of stab wounds to his chest following a post-mortem examination carried out on Wednesday.\nDetective Chief Inspector Ailsa Kent, of Thames Valley Police's Major Crime Unit, said: 'We continue to investigate the circumstances surrounding the child's death.\n'At this time, no formal identification has taken place, so I am not able to name the child. You will appreciate that this is a difficult time for his family and we continue to work with them and offer support as the investigation continues.'\nCrime scene: This is the Oxfordshire home where a child was found dead. A woman, 40, was arrested on suspicion of murder and later freed on police bail until April 12, Thames Valley Police said\nThe alarm was raised by a member of the public who was believed to have gone to the family home at lunchtime on Tuesday.\nThe suspect was arrested at the house and taken to cells at the nearby Abingdon police station where she was freed on bail today.\nDetectives from the Thames Valley major crime team continued to investigate the horrific stabbing of Tyler as arrangements were made with the Oxfordshire Coroner Darren Salter to open an inquest into the death.\nThe police spokesman said: 'A post-mortem carried out yesterday has revealed the cause of death to be stab wounds to the chest.\n'A 40-year-old woman arrested on suspicion of murder has been released on bail until April 12.'\nFloral tributes and cuddly toys were laid in front of a police cordon at the youngster's home, where he attended the local infant school.\nNeighbour Paul Fothergill, 60, said Tyler used to attend a private prep school run by his parents in Faringdon, but it closed amid financial problems last year\nNeighbour Paul Fothergill, 60, said Tyler used to attend a private prep school run by his parents in Faringdon, but it closed amid financial problems last year.\nMr Fothergill said police had told neighbours that the boy's 40-year-old mother had been arrested on suspicion of murder.\nHe added: 'It blows you away. There might have been something that has triggered it. She doted on that little lad. I can say nothing bad about her, she was nice.'\nAnother neighbour said: 'I think she had a job but was not working at the moment. They moved there a couple of years ago and were quiet. The lad was shy.'\nVillager Candice McArthur, 44, said: 'Everyone is absolutely shocked and horrified. It's a terrible tragedy, not just for the little man but for the whole wide family.\n'These things can happen anywhere, but you never expect it on your doorstep in a little market town like this. Everybody feels shock and disbelief, with a huge sense of sadness.'\nRay Saunders, the uncle of the boy's mother, said yesterday at his home in London: 'It's a terrible time – it's been very emotional.'\nA card left outside Tyler's home read: 'Rest in peace little man! Taken far too soon, thoughts and prayers are with your family at such an awful time. Fly high angel!'\nSuperintendent Rory Freeman, of Thames Valley Police, said: 'This is a very shocking discovery.'","url":"https://www.dailymail.co.uk/news/article-4319720/Boy-five-stabbed-death-home.html"}
