{"authors":["Fiza Pirani"],"date_download":"2018-10-30 17:50:01","date_modify":"2018-10-30 17:50:01","date_publish":"2018-10-30 14:37:18","description":"Actor, filmmaker, comedian and playwright Tyler Perry is officially calling it quits on his “Madea” franchise, he announced during a SiriusXM interview on Monday.","filename":"data/vaneerConsumption/TylerPerrytoendMadeafranchise.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/DaytonDailyNews/2018/10/29/Videos/4518784.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_tyler-perry-end-madea-franchise__1540921801.html","title":"Tyler Perry to end Madea franchise","title_page":"Tyler Perry to end Madea franchise","title_rss":"NULL","source_domain":"ajc.com","text":"Actor, filmmaker, comedian and playwright Tyler Perry is officially calling it quits on his “Madea” franchise, he announced during a SiriusXM interview Monday.\n“I just don’t want to be her age [still] playing her,” he joked.\n» RELATED: Tiffany Haddish said she bonded with Tyler Perry over living in their cars\nThe character Mabel Earlene “Madea” Simmons, played by Perry himself, first appeared as a 68-year-old in the 1999 stage play “I Can Do Bad All by Myself,” followed by the play and film, “Diary of a Mad Black Woman.”\nAccording to Vanity Fair, Madea has appeared in dozens of productions since — and her films alone have grossed upwards of $500 million globally.\n» RELATED: How to get a job at the Tyler Perry Studios\nPerry wrapped up on the last series film, “Madea Family Funeral,” two years ago. The movie, set to premiere in March 2019, tells the story of a Georgia family reunion gone bad.\n“Perhaps uncoincidentally, the forthcoming film will also mark the last collaboration between Perry and Lionsgate,” Vanity Fair reported. “The filmmaker has signed a deal with Viacom that will have him producing content across television, film, and short-form video platforms.”\n» RELATED: Tyler Perry’s next film is a thriller, reports say\nYou can watch the full SiriusXM interview below:\nPerry is also behind the soon-to-be-released Atlanta-filmed “Nobody’s Fool” featuring stars Tiffany Haddish and Tika Sumpter.","url":"https://www.ajc.com/blog/buzz/tyler-perry-end-madea-franchise/XKQUEALCfgIJ1HK51I0MFN/"}
