{"authors":["Rodney Ho"],"date_download":"2018-10-30 17:51:29","date_modify":"2018-10-30 17:51:29","date_publish":"2018-07-01 14:54:00","description":"Originally posted on Sunday, July 1, 2018 by RODNEY HO/rho@ajc.","filename":"data/vaneerConsumption/TylerPerrysformerBuckheadmansionbackupforsalefor25m.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/01/Videos/4428542.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_radiotvtalk_tyler-perr_7505430ed02c700bc4449d004b02f0be__1540921889.html","title":"Tyler Perry’s former Buckhead mansion back up for sale for $25 m","title_page":"Tyler Perry’s former Buckhead mansion back up for sale for $25 m","title_rss":"NULL","source_domain":"ajc.com","text":"Originally posted on Sunday, July 1, 2018 by RODNEY HO/rho@ajc.com on his AJC Radio & TV Talk blog\nEntrepreneur and evangelist David Turner has placed his opulent Buckhead mansion up for sale $25 million just two years after purchasing it from film and TV mogul Tyler Perry.\nTurner bought the home from Perry for $17.5 million in 2016, according to Buckhead.com, who exclusively interviewed him about the purchase\nAccording to a press release from Chase Mizell, a realtor for\nAtlanta Fine Homes Sotheby's International Realty handling the property:\nTurner’s ministry is taking him and his family out of the state of Georgia. “This is the most beautiful property I have ever laid eyes on” says Turner. “We have thoroughly enjoyed living here and will be very sad when the day comes to leave. However, we must follow our faith and our faith is leading us elsewhere.”\nThe French Provincial mansion, at 4110 Paces Ferry Road, sits on 17 acres and is nearly 35,000 square feet. Its sale in 2016 was believed to be the priciest purchase of an individual home in Atlanta history.\nTurner is pricing the property at the same original dollar amount that Perry attempted in 2015. Perry ultimately had to shave off $7.5 million to get the sale done.\nThe property was once occupied by a long-time segregationist Moreton Rollston who owned an Atlanta motel that refused to integrate. Perry gets great satisfaction out of this. “To have this property was such poetic justice,\" Perry told New York magazine in 2016.\nThis mansion has seven bedrooms, an underground ballroom, a parking deck, a separate “hobby house,” an infinity edge swimming pool with bar, a lighted tennis court and a remote control airplane runway.\nPerry purchased the property in 2007 for $9 million and spent millions more building out the current mansion. At that home, he has hosted major stars from Oprah Winfrey to Barack Obama. Jennifer Brett, my colleague, attended a party there in 2013 and described it here.\nPerry now lives in Douglasville, where he owns more than 1,000 acres, while also owning homes in other cities including Los Angeles and New York.\nAt the time Turner purchased the home, he explained why to Buckhead.com’s Ben Hirsh: “God literally told me to come here. I went online and I saw this house, and that’s when I felt like God told me, ‘This is your house.’”\nYou can read more details and see more photos of the 4110 Paces Ferry home at Atlanta Fine Homes.","url":"https://www.ajc.com/blog/radiotvtalk/tyler-perry-former-buckhead-mansion-back-for-sale-for-million/NyzP03RYd5QtJXrtoikRDI/"}
