{"authors":["Philip Duncan","Press Association"],"date_download":"2018-10-22 20:11:42","date_modify":"2018-10-22 20:11:42","date_publish":"2016-01-29 00:39:12","description":"Pirelli is to hold a crunch meeting with Formula One's key stakeholders over the sport's future tyre plans. Formula One's regulations are set to change for the 2017 campaign.","filename":"data/vaneerConsumption/TyresuppliersPirellisetforcrunchtalkswithF1chiefsoverplansforfastercars.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/30990D2300000578-0-image-a-19_1454026639339.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_formulaone_article-3421967_Tyre-suppliers-Pirelli-set-crunch-talks-F1-chiefs-plans-faster-cars_1540239102.html","title":"Tyre suppliers Pirelli set for crunch talks with F1 chiefs over plans for faster cars","title_page":"Tyre suppliers Pirelli set for crunch talks with F1 chiefs over plans for faster cars  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pirelli is to hold a crunch meeting with Formula One's key stakeholders over the sport's future tyre plans.\nFormula One's regulations are set to change for the 2017 campaign with the introduction of faster, more aggressive-looking cars in a bid to spice up the show.\nBut Pirelli, the sport's sole tyre supplier, has expressed fears that its product will not be able to cope with the proposal.\nPirelli has expressed fears that it will not be able to cope with the proposed changes for 2017 season\nAnd the Italian manufacturer, which has called for greater on-track testing, will now meet with leading figures at its Milan headquarters on February 2 to discuss 'target tyre performance'.\n'Pirelli sees this meeting as being of vital importance in order to further consolidate the close collaboration that got under way last year with the FIA, FOM, and the drivers,' Pirelli said in a statement released on Thursday night.\n'Of the more than 250 championships in which Pirelli takes part worldwide, Formula One is the biggest challenge.\n'In 2017 the technical aspects will become even more complex, so Pirelli is even more convinced of the need to carry out more on-track testing. This is a factor that has been extremely limited in recent years, despite the important evolution of the cars and subsequent increase in performance.\n'All these are vital steps towards tyre development that takes into account the future evolution of the cars and added performance, which will be particularly notable in 2017.'\nPirelli came under fire at last year's Belgian Grand Prix after Nico Rosberg and Sebastian Vettel suffered high-speed blow-outs. Vettel claimed the tyre failure, which happened on the penultimate lap of the race, could have killed him.\nRed Bull driver Daniil Kvyat takes aprt in wet tyre testing at the Paul Ricard circuit in France this week\nPirelli has been Formula One's only tyre supplier since it replaced Japanese manufacturer Bridgestone in 2011.\nBut its remit to produce a fragile tyre which leaves drivers unable to push to the limit during races has attracted widespread criticism.\nBernie Ecclestone, Formula One's chief executive, is keen for that to change, and has urged as many of the sport's leading figures to attend the summit in Milan next week.\nSpeaking to the BBC, the 85-year-old said: 'Whatever drivers want to turn up can turn up. Whatever teams want to turn up can turn up. It will be the president of Pirelli who is there, not a messenger.'","url":"https://www.dailymail.co.uk/sport/formulaone/article-3421967/Tyre-suppliers-Pirelli-set-crunch-talks-F1-chiefs-plans-faster-cars.html"}
