{"authors":["Kipp Jones"],"date_download":"2018-10-30 18:45:00","date_modify":"2018-10-30 18:45:00","date_publish":"2016-01-20 20:15:27","description":"Actor-singer Tyrese Gibson wants Chris Rock to step down as host of the 88th Academy Awards amid accusations the Academy intentionally snubbed black actors for the second year in a row.","filename":"data/vaneerConsumption/TyreseGibsonAsksChrisRocktoStepDownasHostofWhiteOscars.json","image_url":"https://media.breitbart.com/media/2016/01/Tyrese-Gibson-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_01_20__1540925100.html","title":"Tyrese Gibson Asks Chris Rock to Step Down as Host of 'White Oscars'","title_page":"Tyrese Gibson Asks Chris Rock to Step Down as Host of 'White Oscars' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Actor-singer Tyrese Gibson wants Chris Rock to step down as host of the 88th Academy Awards amid accusations the Academy intentionally snubbed black actors for the second year in a row.\n“There is no joke that he can crack,” Gibson said of Rock in an interview with PEOPLE magazine on Wednesday. “There is no way for him to seize the moment and come into this thing and say, ‘I’m going to say this and say that I’m going to address the issue but then I’m still going to keep my gig as the host.’ The statement that you make is that you step down.”\nGibson then argued that if Rock was involved in a similar situation as a member of the gay community, he would have already walked away from the gig.\n“If they purposefully left out all homosexuals and gays from being nominated for an Oscar, if the host Chris Rock was a homosexual, he would have stepped down already,” he said.\nGibson also urged Rock to step down on Instagram on Tuesday.\nChris Rock do the right thing make a statement – were relying on you to DO the right thing….. There is NO JOKE YOU CAN CRACK TO EVER CHANGE THE WAY WE ALL FEEL!!!!!!!!!!!!!!!!!!!!! A photo posted by TYRESE (@tyrese) on Jan 19, 2016 at 11:12am PST\n“Chris Rock do the right thing make a statement – were relying on you to DO the right thing,” he wrote. “There is NO JOKE YOU CAN CRACK TO EVER CHANGE THE WAY WE ALL FEEL!!!!!!!!!!!!!!!!!!!!!”\nThe #OscarsSoWhite controversy was renewed last week, when the Academy of Motion Picture Arts and Sciences (AMPAS) announced that for the second year in a row all 20 Oscar nominations in the four main acting categories had gone exclusively to white actors.\nMany prominent industry figures, including Spike Lee, Jada Pinkett Smith, George Clooney, Michael Moore and Snoop Dogg, have pledged to boycott the Feb. 28 telecast.\nOther prominent stars, including Selma actor David Oyelowo, George Clooney, and Idris Elba, have also weighed in.\nPraising Lee and Pinkett Smith in particular, Gibson told PEOPLE, “If you have a problem with feeling like you’re being excluded, all across the board, you don’t just sit on your hands and complain… You fix it.”\nHe concluded, “This is not us saying we’re against the Oscars because we’re gonna combat racism… We’re just saying, ‘Yo, this is not cool.’ You can’t be doing this in 2016 and act as if no one is gonna notice.”\nThe Furious 7 actor also told the publication he is worried the controversy might overshadow the work of fellow actor Leonardo DiCaprio, who has been nominated for Best Actor for his role in the critically acclaimed film The Revenant.\n“I feel bad on behalf of Leo that I believe this is going to be the year that he finally wins an Oscar for best actor and this is all going down,” he said.\nWhile Rock has not directly commented on the controversy, he did joke about it on his Twitter page last week in a promo, in which he described the Oscars as the “White BET Awards.”","url":"https://www.breitbart.com/entertainment/2016/01/20/tyrese-gibson-asks-chris-rock-step-oscars-host-amid-race-controversy/"}
