{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 21:53:20","date_modify":"2018-10-22 21:53:20","date_publish":"2017-03-10 00:02:43","description":"It seems he's a very generous man. Tyrese Gibson has finally explained why he built a hibachi-style restaurant, a nightclub and a coffee shop in his backyard, and","filename":"data/vaneerConsumption/TyreseGibsonrevealswhyhebuilthibachirestaurant.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1ECEC100000578-0-image-a-26_1489102161154.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299278_Tyrese-Gibson-reveals-built-hibachi-restaurant_1540245200.html","title":"Tyrese Gibson reveals why he built hibachi restaurant","title_page":"Tyrese Gibson reveals why he built hibachi restaurant | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tyrese Gibson is a very generous man.\nThe actor has finally explained why he built a hibachi-style restaurant, a nightclub and a coffee shop in his backyard, and it seems his motivations were completely selfless.\nThe 38-year-old Fate of the Furious star told People on Thursday that he simply wanted a place for his famous friends to hang out.\nInnovative? Tyrese Gibson has finally explained why he built a hibachi-style restaurant, a nightclub and a coffee shop in his backyard\n'With this level of people, they can't necessarily go to public restaurants in L.A.,' he said, before naming Will Smith, Vin Diesel, Michael Bay and David O. Russell specifically as examples.\n'You can't eat a piece of salmon with mashed potatoes in a restaurant without feeling like somebody's filming. So that became the motivation to create this world in my backyard where people could finally feel like they could be around girls and vibe and music and energy.'\nIn addition to the entertainment venues, he also dished that he built a salon as well, where 'you can get your feet and hands done.'\nWhile the attractions are definitely an adult paradise, the newly-married Tyrese has been very careful to ensure it doesn't devolve into a destination for debauchery.\nHaving fun! The 38-year-old Fate of the Furious star said that he simply wanted a place for his famous friends to hang out (pictured here with comic Aziz Ansari)\n'Girls aren't running around with their boobs and butt out,' he claims.\n'This is a fly and sophisticated place where any man that's married can bring his wife, and any man that's single can come and catch a vibe.'\nAnd it seems it's a good thing he kept his attraction quite classy and upscale, as the multi-talented Tyrese only recently confirm that he did in fact get married on Valentines day.\nCatch! The private hibachi-style restaurant is reminiscent of Benihana (Aziz Ansari catching food in his mouth)\nThe former model - who has nine-year-old daughter Shayla with ex-wife Norma - secretly tied the knot on Valentine's Day to a woman whose identity remained a mystery to the public until he confirmed her identity on Instagram.\nSamantha - whose age remains unknown - is accomplished and well paid in her profession, according to TMZ.\nSources close to the pair say they met after Tyrese posted an open letter to his 'wife of the future' in 2015, and were put in touch through mutual friends.\nSurprise! The former model - who has nine-year-old daughter Shayla with ex-wife Norma - secretly tied the knot on Valentine's Day to a woman whose identity remained a mystery to the public until he confirmed her identity on Instagram\nThe hunky star's original lengthy post revealed that he had hoped to keep the big news a secret, but he was still thankful for the kind messages and prayers from his followers.\nHe wrote: 'We're humbled by the outpouring of love! We appreciate all of the prayers and well wishes. Sometimes when you pray you get exactly what your heart desires. I got #MyBlackQueen I didn't just marry her I married my daughters new example.'\n'We are all flawed, sinners and have made mistakes but I hope you decide to keep loving, keep the faith and God will to send you what's yours.... #Amen.'\nHappy couple: The hunky star's original lengthy post revealed that he had hoped to keep the big news a secret, but he was still thankful for the kind messages and prayers from his followers","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299278/Tyrese-Gibson-reveals-built-hibachi-restaurant.html"}
