{"authors":["Matt Jones"],"date_download":"2018-10-30 18:41:38","date_modify":"2018-10-30 18:41:38","date_publish":"2017-01-30 00:00:00","description":"The University of Arkansas has hired two search firms to assist in the hiring process for the Razorbacks' football coach and athletics director.","filename":"data/vaneerConsumption/UAhiresfirmsforADfootballcoachsearches.json","image_url":"https://media.arkansasonline.com/img/photos/2017/01/30/Chancellor_Steinmetz_005_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_nov_28_ua-hires-s_dc67151f9bf8940f3ad48cdab2d35629__page=2_1540924898.html","title":"UA hires firms for AD, football coach searches","title_page":"UA hires firms for AD, football coach searches","title_rss":"NULL","source_domain":"arkansasonline.com","text":"University of Arkansas Chancellor Joseph E. Steinmetz in his office on the campus in Fayetteville. - Photo by David Gottschalk\n The University of Arkansas has hired two search firms to assist in the hiring process for the Razorbacks' football coach and athletics director.\nLos Angeles-based Korn Ferry will vet athletics director candidates, and DHR International will assist the university's search for a football coach, according to a release. Arkansas fired Athletics Director Jeff Long on Nov. 15 and fired football coach Bret Bielema on Friday.\nUA Chancellor Joseph Steinmetz assembled a seven-member advisory committee last week. The news of using simultaneous search firms came shortly after the advisory committee met Tuesday.\n“The search for an athletics director is progressing quickly and there are a number of talented individuals we are considering,” Steinmetz said in a statement. “We understand speed is of the essence and are working to name a new leader as quickly as possible.”\n[DOCUMENT: Read the UA's agreement with Korn Ferry]\nInterim Athletics Director Julie Cromer Peoples said DHR International was brought on to help with the football coaching search last weekend. Cromer Peoples delivered a termination letter to Bielema following the Razorbacks' 48-45 loss to Missouri last Friday night and met with assistant coaches the following morning.\nOn the night of Bielema's firing, Cromer Peoples said there would not \"be a formal search committee for the process.\"\nIt is believed to be the first time a search firm has been used to hire an Arkansas football coach.\n\"With the number of vacant coaching positions in our league and around the nation, it is important that we move forward expeditiously and efficiently in finding the next head football coach for the Arkansas Razorbacks,\" Cromer Peoples said in a statement.\nAccording to the university, private funds are being used to pay for both search firms. The UA will pay Korn Ferry $75,000 to conduct the vetting process, but the cost paid by the Razorback Foundation to DHR International is not yet known.\nOregon State is paying DHR International up to $200,000 to help fill its vacant head coaching position, according to The Oregonian.\nAccording to its website, DHR International is one of the world's five largest search firms. The company's sports division includes former Wisconsin Athletics Director Pat Richter and Glenn Sugiyama, a former board of directors member of the Chicago Bulls and former assistant basketball coach at Eastern Michigan who Forbes magazine called \"one of the most influential men in college athletics\" in 2012.\nDHR International's 2016 coaching searches resulted in North Texas hiring Seth Littrell and Toledo hiring Jason Candle, according to CBS. Both coaches will coach in conference championship games this weekend.\nAccording to the Newport News, Va., Daily Press, Korn Ferry's high-profile searches in recent years have included Michigan's hiring of football coach Jim Harbaugh in 2015; the Southeastern Conference's promotion of Greg Sankey to commissioner in 2015; Texas' hiring of Athletics Director Steve Patterson in 2013, football coach Charlie Strong in 2014 and basketball coach Shaka Smart in 2015; Florida's hiring of football coach Jim McElwain in 2014; and Miami's hire of football coach Mark Richt in 2016.","url":"https://www.arkansasonline.com/news/2017/nov/28/ua-hires-search-firms-ad-football-coach-searches/?page=2"}
