{"authors":[],"date_download":"2018-10-30 20:23:32","date_modify":"2018-10-30 20:23:32","date_publish":"2015-11-24 10:54:17","description":"An Uber driver led police to three men suspected of shooting and critically injuring a man during a predawn robbery at a Gwinnett County motel, police said.","filename":"data/vaneerConsumption/UberdriverleadspolicetosuspectsinGwinnettmotelshooting.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_uber-driver_338165caca20b21f777787c8fe9d47f9__1540931012.html","title":"Uber driver leads police to suspects in Gwinnett motel shooting","title_page":"Uber driver leads police to suspects in Gwinnett motel shooting","title_rss":"NULL","source_domain":"ajc.com","text":"An Uber driver led police to three men suspected of shooting and critically injuring a man during a predawn robbery at a Gwinnett County motel, police said.\nThe shooting happened just before 4:30 a.m. Tuesday at the Days Inn in the 2000 block of Glenn Club Drive, according to Gwinnett police Cpl. Michele Pihera.\nPihera said the occupants of room No. 117 called the front desk to report a commotion, and when officers arrived, they found a man in room No. 116 with a gunshot wound to the head.\nThe victim, whose name has not been released, was taken to Gwinnett Medical Center for treatment of injuries that Pihera said were “serious and life-threatening.”\nShe said investigators believe four North Carolina men who were working locally were staying in room No. 116. They were robbed — and one of them shot — by three other men.\nAfter the shooting, the three suspects stole the victim’s 1999 Lexus.\nAbout four hours later, an Uber driver called police and told them that “he just dropped off three suspicious males at a home on Newtons Crest Circle in Snellville that may be related to the earlier shooting,” Pihera said.\nWhen Gwinnett and Snellville officers went to the home, two of the suspects ran, while the third remained at the scene and was taken into custody, according to Pihera.\nA second suspect was found about 30 minutes later in the area of Scenic Highway and Ashworth Lake Road in Snellville and taken into custody with incident, she said.\nShortly before 11 a.m., a Gwinnett police K9 unit found the third suspect hiding in a wooded area near Highpoint Road and Spruce Circle in Snellville, Pihera said.\nThat suspect was bitten by the K9 and was taken to Eastside Medical Center for treatment, she said.\nAfter an interview with the Uber driver, police learned the suspects abandoned the victim’s vehicle at a Waffle House in Conyers shortly after the shooting, Pihera said.","url":"https://www.ajc.com/news/crime--law/uber-driver-leads-police-suspects-gwinnett-motel-shooting/6dkQdeykghVecGpGvnKb5M/"}
