{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:53:29","date_modify":"2018-10-30 19:53:29","date_publish":"2016-02-22 17:13:43","description":"When 45-year-old Jason Brian Dalton allegedly carried out a Saturday night shooting spree that left six dead and numerous others wounded, he provided yet another demonstration of the impotency of gun-free zones and gun-free policies. |","filename":"data/vaneerConsumption/UbersGunFreePolicyImpotentToStopUberDriversAllegedShootingSpree.json","image_url":"https://media.breitbart.com/media/2016/02/Uber-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_22__1540929209.html","title":"Uber's Gun-Free Policy Impotent To Stop Uber Driver's Alleged Shooting Spree","title_page":"Uber's Gun-Free Policy Impotent To Stop Uber Driver's Alleged Shooting Spree | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"When 45-year-old Jason Brian Dalton allegedly carried out a Saturday night shooting spree that left six dead and numerous others wounded, he provided yet another demonstration of the impotency of gun-free zones and gun-free policies.\nAfter all, Uber cars are gun-free zones and Uber’s policy–for drivers and passengers alike–is that no guns are allowed, even if you have a concealed carry permit.\nIn fact, Breitbart News previously reported that Uber enacted their blanket ban on guns after an Uber driver with a concealed carry license stepped out of his car and used his gun to stop a mass shooting in Chicago. In other words, he legally possessed a gun and used it in a justifiable situation–saving lives along the way–yet Uber responded by going gun-free.\nOn Saturday night, Dalton rejected Uber’s gun-free policies and went on a shooting spree in between fares. The Daily Mail reports that Dalton’s neighbor saw him come home in the time that would have passed between dropping off one fare and shooting his first victim at 6 pm. Fox News reports that he came home again–at least one more time–in between fares after the shootings had already began.\nDalton’s neighbor claims that Dalton kept a pistol at this house, but it is not known if he was transporting the pistol back and forth or returning to the house for bullets or perhaps for some other unknown cause.\nBut Uber has a gun-free policy that Dalton ignored, and law-abiding Uber riders were defenseless as they climbed in and out of Dalton’s car with no gun for self-defense, just as Uber mandated.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/02/22/ubers-gun-free-policy-impotent-to-prevent-uber-driver-shooting-spree/"}
