{"authors":[],"date_download":"2018-10-30 20:20:35","date_modify":"2018-10-30 20:20:35","date_publish":"2015-12-07 14:13:58","description":"Atlanta police Monday were investigating a convoluted predawn shooting that left two men wounded and an Uber driver’s vehicle damaged by a flying bullet.","filename":"data/vaneerConsumption/UbervehiclecaughtincrossfireinNEAtlanta.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_uber-vehicle-caught-crossfire-atlanta__1540930835.html","title":"Uber vehicle caught in crossfire in NE Atlanta","title_page":"Uber vehicle caught in crossfire in NE Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta police Monday were investigating a convoluted predawn shooting that left two men wounded and an Uber driver’s vehicle damaged by a flying bullet.\nThe shooting happened shortly before 3 a.m. at the intersection of North Avenue and Boulevard in northeast Atlanta.\nAtlanta police spokeswoman Elizabeth Espy said one victim was shot three times in the abdomen and the second was shot in the heel of his right foot.\nShe said one of the victims, while not being “completely forthcoming with information,” told investigators he and his cousin were walking along Boulevard near a Pizza Hut when two men across the street began arguing.\nThe victim, who didn’t know the men, said one of them “pulled out a gun and began shooting at the other,” Espy said.\n“The male ran and while doing so, ran toward the two victims,” she said. “In doing so, it put them in the crossfire, causing them to get shot.”\nAbout the same time, an Uber passenger asked to be dropped off near the intersection of North Avenue and Boulevard.\nWhen the passenger got out of the vehicle, one of the bullets hit the Uber driver’s vehicle, Espy said. The Uber driver was not hurt.\nBoth the gunman and the man he was arguing with left the area before police arrived, Espy said.\nPolice have not located the Uber driver’s passenger, who also left the scene before officers arrived.","url":"https://www.ajc.com/news/crime--law/uber-vehicle-caught-crossfire-atlanta/AVBbN0k4r21zGWtJbJJApL/"}
