{"authors":["Wolf Richter","Wolf Street"],"date_download":"2018-10-30 22:46:27","date_modify":"2018-10-30 22:46:27","date_publish":"2018-07-30 00:00:00","description":"How consumers use company-reimbursed private transportation companies is changing, and the numbers show how rideshares like Uber and Lyft are gaining market share. They have huge competitive advantages including less regulation.","filename":"data/vaneerConsumption/UberLyftaregainingevenmoremarketshareovertaxisandrentals.json","image_url":"https://amp.businessinsider.com/images/5b5f58830ce5f51f008b489a-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_uber-lyft-are-gaining-even-more-market-share-over-taxis-and-rentals-2018-7_1540939587.html","title":"Uber, Lyft are gaining even more market share over taxis and rentals","title_page":"    Uber, Lyft are gaining even more market share over taxis and rentals - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Taxis block a main road in Budapest's city centre, Hungary, January 18, 2016. Taxi drivers were protesting against the online taxi-hailing service Uber, demanding authorities to ban the service, according to local media. REUTERS/Bernadett Szabo\nThe ugly market-share battle in reimbursed ground transportation.\nRideshare companies are shaking up the rental-car industry and the taxi industry in the US. In at least one segment that we can track - company-reimbursed ground transportation - the rental-car and taxi industries, both, are getting crushed.\nFacing these rideshare startups are, after decades of consolidation, three rental-car companies that now control 95% of the $28.6-billion-a year US rental car market, each with a number of national brands.\nHertz Global Holdings (HTZ) which owns Hertz, Thrifty, and Dollar Rent A Car\nAvis Budget Group ( CAR) which owns Avis, Budget, Payless Car Rental, and Zipcar\nEnterprise Holdings (privately held) which owns Enterprise, National Car Rental, Alamo, and Enterprise CarShare.\nThe total rental-car fleet in the US (all operators, including independents) dropped 5% year-over-year to 2.19 million vehicles in 2017, as right-sizing fleets has become a big theme. According to estimates of Auto Rental News, total revenues in 2017 were essentially flat with 2016.\nWhile there are segments within the rental-car business that are doing well, there is one segment where rideshare companies are eating their lunch: reimbursed ground transportation.\nAnd Rideshare companies are totally wiping out the market share of taxis within the reimbursed ground transportation segment.\nThese trends show up in the data from Certify, a provider of online travel and expense management for companies, based on its analysis of over 10 million business travel receipts and expenses.\nOf the three ground transportation segments for business expense reimbursement - rideshare, rental cars, and taxis - the share of Uber and Lyft combined reached 72.5% share in the second quarter, according to Certify. That's up from 0% not too long ago!\nIn Q1 2014, when Certify started tracking rideshare reimbursements, their combined share was 8% (almost all Uber).\nAt the same time, rental-car share of reimbursed ground transportation plunged from 55% in Q1 2014 to just 22% in Q2 2018. And the share of taxis plunged from 37% to just 5%:\nWolf Street\nRideshare companies have a huge competitive advantage: They're losing enormous amounts of money, and their investors like it that way and reward them - or rather themselves - with lavish valuations. In fact, investors are eager for feed them more billions to burn through, and thus they eagerly subsidize each ride.\nRideshare companies also have the advantage in many jurisdictions of not being regulated as taxi enterprises, and thus are able to dodge some expenses and rules.\nBut most importantly, rideshare companies are offering a service that riders appreciate and value. This came about as the staid taxi industry slept through the arrival of smartphones - and what an app-based system could do. While there are now apps for taxi services, it's too little too late.\nIn terms of competing with rental cars in the reimbursed ground transportation segment: it's logical. When you get off a plane in a city you don't know, nothing beats skipping the rental car counter and getting picked up by chauffeurs that are at your beck and call, day and night, for the entire five days of your stay. And the company willingly pays for it all. This is a no-brainer for many business travelers - see above chart.\nBut within the rideshare universe of reimbursed ground transportation, it's a raging battle for market share between Uber and Lyft. Uber was first and had the small pieces it was carving out from rental cars and taxis all to itself initially. Then Lyft came along and gradually started eating into Uber's market share. But both were taking share away from taxis and rental cars at an astounding pace, and Uber's loss of market share to Lyft was no big deal.\nThen in late 2016, Uber's self-inflicted series of fiascos caused a sudden shift in ridership to Lyft, with Lyft bumping up its market share from 7.7% in Q4 2016 to 21.1% in Q2 2018. Over the same period, Uber's share dropped from 92.3% to 78.9%:\nWolf Street\nWhile Uber is losing share to Lyft within the rideshare segment, business travelers are spending more money per trip with Uber than with Lyft, according to Certify. In Q2 2018, on average per ride:\nUber: $26.00\nLyft: $22.37.\nIn many industries, new entrants with a slicker product or service can gain a good portion of the market, until the incumbents get the hang of it and fight back successfully, thus halting their own market-share losses. This does not appear to be the case in the reimbursed ground transportation segment where Uber and Lyft are continuing to crush the rental-car and taxi industries which have not yet mounted any kind of visible pushback.","url":"https://www.businessinsider.com/uber-lyft-are-gaining-even-more-market-share-over-taxis-and-rentals-2018-7"}
