{"authors":["Lulu Chang"],"date_download":"2018-10-30 23:50:05","date_modify":"2018-10-30 23:50:05","date_publish":"2014-08-13 00:50:51","description":"Love may be a battlefield, but there is now love lost between Uber and Lyft, who are accusing each other of using dirty tricks to one-up each other. As originally reported by CNN Money, Lyft claims that Uber, the car service giant valued at $18…","filename":"data/vaneerConsumption/UberLyftAccuseEachOtherOfDirtyTricksInTheTransportationBattleOfTheCentury.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/30a709fd-47dc-4d62-8d9f-bba87a45eb52.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35537-uber-lyft-accuse-each-other-of-dirty-tricks-in-the-transportation-battle-of-the-century_1540943405.html","title":"Uber & Lyft Accuse Each Other Of Dirty Tricks In The Transportation Battle Of The Century","title_page":"Uber & Lyft Accuse Each Other Of Dirty Tricks In The Transportation Battle Of The Century","title_rss":"NULL","source_domain":"bustle.com","text":"Love may be a battlefield, but there is now love lost between Uber and Lyft, who are accusing each other of using dirty tricks to one-up each other. As originally reported by CNN Money, Lyft claims that Uber, the car service giant valued at $18 billion, has asked employees to call then cancel 5,560 rides since October. But Uber, who is valued at more than 25 times that of Lyft, isn't backing down anytime soon, and the transportation world is getting feisty.\nIn their attempts to bring each other down, both Lyft and Uber may very well be orchestrating their own demises. Of course, this would be great news for taxi drivers, who seem to be the biggest casualties of this all-out war. The two car service companies have singled one another out as competition, and the battles have grown increasingly nasty.\nFirst, there was the driver poaching. The two companies are located just a mile and a half from one another in San Francisco, and their proximity has only made their rivalry more bitter. Earlier this year, Uber offered Lyft drivers $500 to switch alliances, writing in a blog post,\nDrivers on Uber make more money than with any other ridesharing platform or taxi company. Period. We’re so confident in that fact, we’re giving new partners from other ridesharing platforms $500 just to try us out.\nNot to be outdone, Lyft fired back with similar offers and upped the ante just a little more by offering free lunches and other goodies at a station literally right next door to Uber's new driver center.\nJustin Sullivan/Getty Images News/Getty Images\nThen, in April, after Lyft raised another $250 million in funding, they threw their newfound money in Uber's face by eliminating their commission from the cost of a ride, which decreased fares by 10 percent. Although Lyft revived its commission policy earlier this week, the amount their drivers have to pay depends on the number of hours they work — the more they drive, the less they give back to Lyft. This means that, for the most part, Lyft is still cheaper than Uber.\nAnd now, in the nastiest move yet, Lyft is accusing Uber employees of playing ding dong ditch with Lyft drivers. And Lyft isn't even the first company to make these claims. Back in January, black car service company Gett, based in New York, blasted Uber for cancelling 100 rides over the course of a single week.\nDavid Ramos/Getty Images News/Getty Images\nAccording to Gett CEO Jing Herbert, Uber employees would call a car then wait until the last possible second to cancel, which became highly disruptive to Gett's services. Moreover, after requesting a ride, Uber employees would then have access to the drivers' phone numbers — this information would be used to try to poach Gett drivers, which also sounds somewhat familiar.\nWhile Uber has adamantly denied Lyft's claims of driver poaching they did not deny Gett's allegations earlier this year.\nIn fact, Uber issued something that resembled an apology, saying that their tactics were, admittedly, \"too ambitious\" and that they would \"tone down their sales tactics.\" But ambitious might not be the only word to describe these strategies. According to San Francisco attorney Drexel Bradshaw, they might also be illegal.\nDavid Ramos/Getty Images News/Getty Images\nSpeaking to CNN Money, Drexel said, \"If Uber employees intentionally diverted Gett drivers from legitimate business by making phony calls, that is an unfair business practice, illegal under California law.\" He also added that \"an intentional intereference with Gett's business\" would make Uber \"liable for money damages.\"\nBut Uber seems anything but worried these days, what with their recent $1.2 billion round of funding and seemingly outrageous $18 billion valuation. In a statement released on Tuesday following Lyft's accusations of car canceling, Uber said that they are \"focusing on building and maintaining the best platform for both consumers and drivers,\" not engaging in some petty finger pointing with Lyft.\nJustin Sullivan/Getty Images News/Getty Images\nWell, maybe just a little petty finger pointing.\nThe 5,560 rides Uber employees are alleged to have cancelled are nothing compared to the 12,900 trips Uber says Lyft has cancelled on their drivers. Uber goes so far as to implicate \"one of Lyft's founders\" as a culprit, while continuing to call Lyft's claims \"baseless and simply untrue.\"\nAnd that's not all. In their biggest diss yet, Uber had the following to say about Lyft's future:\nA number of Lyft investors have recently been pushing Uber to acquire Lyft. One of their largest shareholders recently warned that Lyft would \"go nuclear\" if we do not acquire them. We can only assume that the recent Lyft attacks are part of that strategy.\nGame, set, Uber. But don't worry, car service world, we're only just getting started.\nImages: Getty Images (4)","url":"https://www.bustle.com/articles/35537-uber-lyft-accuse-each-other-of-dirty-tricks-in-the-transportation-battle-of-the-century"}
