{"authors":["Will Martin"],"date_download":"2018-10-30 23:46:08","date_modify":"2018-10-30 23:46:08","date_publish":"2018-07-16 00:00:00","description":"BI Prime: In a major analysis of President Donald Trump's trade battle with China, a team from UBS led by the firm's chief global economist, Arend Kapteyn, argued last week that markets were dramatically underestimating how bad things could get if Trump were to further antagonize China.","filename":"data/vaneerConsumption/UBSInvestorsunderestimateriskmarketimpactoftradewarescalation.json","image_url":"https://amp.businessinsider.com/images/5b295a571ae6621d008b5103-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ubs-investors-underestimating-risk-of-escalating-trade-war-and-market-impact-2018-7_1540943168.html","title":"UBS: Investors underestimate risk, market impact of trade war escalation","title_page":"    UBS: Investors underestimate risk, market impact of trade war escalation - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Drew Angerer/Getty Images\nA major further escalation in President Donald Trump's trade war could see the S&P 500 drop by more than 20% in value, and markets are not ready, according to new research from strategists at the Swiss bank UBS.\nIn a major analysis of the president's trade battle with China, a team led by the bank's chief global economist, Arend Kapteyn, argued last Wednesday that markets were dramatically underestimating how bad things could get if Trump were to further antagonize China.\nTrump has already threatened to place tariffs on $200 billion worth of Chinese goods, and things could get even worse. That's when the markets would suffer, UBS said.\n\"We see a 20% plus decline driven by a combination of lower earnings and multiple contraction,\" the team wrote.\nUnder a scenario in which \"virtually all\" trade between the US and China is targeted, Kapteyn's team says, the impacts on US companies would be sufficient to trigger a market crash large enough to cause a bear market.\n\"Assuming virtually all trade between US-China is affected by tariffs and other protectionist policies, we estimate that S&P earnings would take a 14.6% hit as US and global growth would be 245 and 108.5bp lower, respectively,\" the UBS team wrote.\nHere's the chart from UBS, showing just how big a fall could be expected:\nUBS\nIndirect impacts of the trade war on stocks would exacerbate the problems, the team added, with price-to-earnings ratios also hurt.\n\"Second order effects would be larger, with US multinationals doing business in China also likely to be hurt by China retaliation,\" the team said.\n\"The S&P 500 P/E would likely fall by ~0.5x more than the escalation scenario as higher recession risks and lower long-term potential EPS growth get priced.\"\nUBS estimates that the floor for the S&P will be 21.3% lower than its level last Tuesday. That would see the S&P fall to about 2,200 points, a level not seen since late 2016, before stocks' so-called Trump bump.\nAnd while markets have not ruled out such a scenario, UBS says, they are pretty complacent about it.\n\"Markets have started to discount the risk following recent announcements,\" the team wrote.\nThings would be even worse for European stocks in the event of a larger trade conflict, with UBS' team estimating that the fall could be as large as 25% for the Stoxx 600— the broad index of major companies across more than 15 European economies.\nThat's because Europe's more open economy relies much more greatly on the flow of goods and services between nations.\nHere's the key extract from UBS' note (emphasis ours):\n\"European earnings could take a strong hit of c7% in both 2018 and 2019 EPS growth. Although there is a limited 1st order impact on European sales, the European economy is much more open than the US or even China, therefore 2nd order effects could disproportionately impact European market.\n\"In addition, given their higher beta relative to the US, European stock markets could de-rate significantly, despite the fact they already trade at depressed valuations, as investors move away from risk assets and the market loses faith on the sustainability of Europe's EPS recovery. We see potential for European markets to de-rate c2x. This scenario could lead to a drop of c25% in the Stoxx 600.\"\nUBS' belief that the trade conflict could spark a major downward move in markets is corroborated by Larry Fink, the CEO of BlackRock.\n\"The market's having a hard time digesting the whole change in globalization and trade,\" Fink told Bloomberg TV on Monday.\n\"The foundations of international trade are being raised and being questioned,\" he added, saying markets could fall as much as 15% on the back of the trade war.","url":"https://www.businessinsider.com/ubs-investors-underestimating-risk-of-escalating-trade-war-and-market-impact-2018-7"}
