{"authors":["Will Martin"],"date_download":"2018-10-30 23:04:40","date_modify":"2018-10-30 23:04:40","date_publish":"2018-07-24 00:00:00","description":"\"I'm pleased with the second quarter, which contributed to a strong first half, with particularly good capital generation,\" Sergio Ermotti, the bank's chief executive said in a statement.","filename":"data/vaneerConsumption/UBSresultsshowrisingprofitsbutbankwarnsonthreatofprotectionism.json","image_url":"https://amp.businessinsider.com/images/5add985219ee8622008b45c0-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ubs-results-show-rising-profits-stock-market-news2018-7_1540940680.html","title":"UBS results show rising profits, but bank warns on threat of protectionism","title_page":"    UBS results show rising profits, but bank warns on threat of protectionism - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"CEO Sergio Ermotti of Swiss bank UBS smiles as he speaks at the annual news conference in Zurich, Switzerland January 22, 2018. REUTERS/Arnd Wiegmann\nLONDON — Swiss banking giant UBS on Tuesday reported a strong set of results for the second quarter of the year, but warned that rising protectionism and geopolitical tensions pose a threat to the financial sector as a whole going forward.\nProfits at the lender — which is in the midst of an adjustment of its business which will see it focus more on its wealth management operations — rose by 9% in the second quarter of 2018, compared to the same period last year.\nThat meant a net profit of 1.3 billion Swiss francs ($1.31 billion), above analysts expectations. A Reuters poll of analysts before the release expected profits of 1.044 billion Swiss francs ($1.05 billion).\nPre-tax profits at the bank also outperformed expectations, climbing 12% to 1.7 billion Swiss francs ($1.71 billion), compared to analyst forecasts of 1.418 billion ($1.43 billion).\nThe solid results were largely down to the performance of its key wealth management business, the bank said. Profits before tax in that area rose 18% to 1.037 billion Swiss francs ($1.04 billion).\nThat performance, the bank said, was \"driven by double-digit PBT growth in the Americas and the ultra-high net worth segment, and ten-year records in recurring net fee, net interest income, lending and mandate penetration.\"\n\"I'm pleased with the second quarter, which contributed to a strong first half, with particularly good capital generation,\" Sergio Ermotti, the bank's chief executive said in a statement.\n\"We'll keep our focus on growth and efficiency, and continue to build on the strengths of our global franchise.\"\nHowever, while things look strong for UBS, the bank did warn about two looming global threats that could derail its progress.\n\"Global economic growth prospects continue to provide a supportive backdrop to markets, although ongoing geopolitical tensions and rising protectionism have dampened investor confidence and remain a threat,\" the bank said in a statement.\nAlthough not explicitly stated, it is likely that the \"rising protectionism\" mentioned by the bank references the escalating trade war kicked off by US President Donald Trump. Analysts at the bank earlier this month argued that investors are underestimating the potential impact of the trade war.\nRegardless of that warning, investors in UBS were buoyed by the results on Tuesday morning, with the bank's stock jumping almost 4% in early morning trading. By 8.20 a.m. BST (3.20 a.m. ET) shares were up 3.14% to trade at €15.77 ($15.86) each.","url":"https://www.businessinsider.com/ubs-results-show-rising-profits-stock-market-news2018-7"}
