{"authors":["Austin Cannon"],"date_download":"2018-10-30 19:37:42","date_modify":"2018-10-30 19:37:42","date_publish":"2016-10-30 05:24:00","description":"The Sigma Tau Gamma fraternity suspended its chapter at the University of Central Arkansas and expelled one of its members Saturday after a photo surfaced of the fraternity member in apparent blackface.","filename":"data/vaneerConsumption/UCAfratphotoofstudentinapparentblackfaceleadstosuspension.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_oct_30_uca-fraternity-pic-leads-to-suspension--1__page=2_1540928262.html","title":"UCA frat photo of student in apparent blackface leads to suspension","title_page":"UCA frat photo of student in apparent blackface leads to suspension","title_rss":"NULL","source_domain":"arkansasonline.com","text":"The Sigma Tau Gamma fraternity suspended its chapter at the University of Central Arkansas and expelled one of its members Saturday after a photo surfaced of the fraternity member in apparent blackface.\nSteve Latour, chief executive officer of the fraternity based in Warrensburg, Mo., held an emergency call with Sigma Tau Gamma's board of directors Saturday afternoon, the fraternity said in a news release. Latour asked that the member be expelled from the fraternity, and the board agreed unanimously.\nStatement from President Courtway pic.twitter.com/BkUgxEXh0H — U. Central Arkansas (@ucabears) October 29, 2016\n\"We just have zero tolerance for that type of behavior,\" Latour said before calling the board.\nLatour said he found out about the photo around 1 p.m. Saturday.\nThe photo, a a screenshot from an Instagram post, shows a man in a Bill Cosby-type sweater with what looks like black paint covering his face and neck. The Instagram location is listed as \"Sigma Tau Gamma -- UCA\" and the caption reads, \"It was a bold night.\"\nThe man with the covered face is pictured to the right of two other men who are also members of the chapter, the release said.\nIn a letter, Latour notified UCA members of the chapter's immediate and indefinite suspension. During the suspension, members cannot participate in any fraternity event or Greek life events they would \"otherwise not have access to without your Sigma Tau Gamma affiliation,\" Latour wrote.\nLatour also asked that members of the chapter not wear any Sigma Tau Gamma apparel for the duration of the suspension.\nBoth the fraternity and UCA are looking into the photo. Latour said he would send a follow-up letter to the chapter once the investigations conclude.\n\"This picture is highly offensive and repugnant, and this representation goes against all we at UCA believe in and stand for,\" UCA President Tom Courtway said in a statement.\nThe university will investigate, and the matter will be \"dealt with accordingly,\" he added.\nStudents for the Propagation of Black Culture at UCA posted the photo on Twitter and said, \"On behalf of the black student population, this is not acceptable & is highly offensive.\"\nLatour thanked the organization for bringing the photo to the fraternity's attention.\nThe photo comes two days after Sigma Tau Gamma sent an email to all the fraternity's members nationwide, reminding them not to wear offensive costumes while celebrating Halloween.\n\"What might be harmless to you, might be extremely offensive and hurtful to others,\" the email said.\n\"Ask yourself, would I want a photo of me in this costume or next to someone in this costume to end up on the Internet for my family, professors, employer and future spouse to see? Who would want to explain that photo to a prospective employer or the news media?\"\nState Desk on 10/30/2016","url":"https://www.arkansasonline.com/news/2016/oct/30/uca-fraternity-pic-leads-to-suspension--1/?page=2"}
