{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:07:20","date_modify":"2018-10-30 21:07:20","date_publish":"2016-09-14 11:48:52","description":"An anti-Zionist course titled “Palestine: A Settler Colonial Analysis” at the University of California, Berkeley, has been suspended.","filename":"data/vaneerConsumption/UCBerkeleySuspendsAntiZionistCourseFollowingUproar.json","image_url":"https://media.breitbart.com/media/2016/09/berkeley.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_14__1540933640.html","title":"UC Berkeley Suspends Anti-Zionist Course Following Uproar","title_page":"UC Berkeley Suspends Anti-Zionist Course Following Uproar","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV — An anti-Zionist course titled “Palestine: A Settler Colonial Analysis” at the University of California, Berkeley has been suspended following an outcry over its bias.\nJewish community leaders and activists slammed the course as being anti-Semitic in nature and in violation of the university’s academic standards.\nThe university axed the student-led course after discovering that its facilitator, Paul Hadweh, “did not comply with policies and procedures that govern the normal academic review and approval of proposed courses for the DeCal program” Dan Mogulof, the school’s assistant vice chancellor, said.\nMogulof added that the university is “very concerned” about offering a course “which espouses a single political viewpoint and/or appears to offer a forum for political organizing rather than an opportunity for the kind of open academic inquiry that Berkeley is known for.”\nJewish campus group Hillel had called on the university’s president, Janet Napolitano, a day earlier to condemn the course for politically indoctrinating students with lies.\n“Any perusal of the syllabus will show that this is a one-sided course which puts forth a political agenda,” Hillel International President and CEO Eric Fingerhut and Berkeley Hillel Executive Director Rabbi Adam Naftalin-Kelman said in the statement.\n“It does not tell the truth. It ignores history. It ignores facts, such as the inconvenient one that Jews have inhabited Israel for 3,000 years. This course seems to be a matter of political indoctrination in the classroom and is a violation of the newly adopted principles by the UC regents on intolerance.”\nCampus watchdog the AMCHA Initiative, which monitors anti-Semitism at American universities, raised concerns in September that the new course – which it termed a “classic example of anti-Semitic anti-Zionism” – would increase hostility toward Jewish and pro-Israel students on campus.\nOn Tuesday, AMCHA published an open letter to UC Berkeley Chancellor Nicholas Dirk, undersigned by 43 Jewish, legal rights and educational organizations, expressing grave concerns over the course.\n“A review of the syllabus … reveals that the course’s objectives, reading materials and guest speakers are politically motivated, meet our government’s criteria for anti-Semitism and are intended to indoctrinate students to hate the Jewish state and take action to eliminate it,” the letter said.\nThe letter said faculty sponsor Hatem Bazian is “a well-known anti-Zionist activist who is also the chairman of American Muslims for Palestine.” Hatem also co-founded the anti-Israel Students for Justice in Palestine (SJP) campus group.\nThe one-credit course was offered as part of the university’s DeCal program in which students propose and teach courses under the supervision of a faculty sponsor. As part of the course, students were required to attend at least one anti-Israel event. Other DeCal classes offered this year include “Cal Pokeman Academy.”","url":"https://www.breitbart.com/middle-east/2016/09/14/uc-berkeley-suspends-anti-zionist-course-following-uproar/"}
