{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:10:58","date_modify":"2018-10-30 21:10:58","date_publish":"2016-03-12 12:00:35","description":"UC Berkeley Law School Dean Sujit Choudhry resigned Thursday amidst accusations that he made sexual advances on his former assistant.","filename":"data/vaneerConsumption/UCBerkeleyLawSchoolDeanResignsinSexScandal.json","image_url":"https://media.breitbart.com/media/2015/11/UC-Berkeley-Joel-Pollak-Breitbart-News-e1467427124386.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_03_12__1540933858.html","title":"UC Berkeley Law School Dean Resigns in Sex Scandal","title_page":"UC Berkeley Law School Dean Resigns in Sex Scandal","title_rss":"NULL","source_domain":"breitbart.com","text":"UC Berkeley Law School Dean Sujit Choudhry resigned Thursday amidst accusations that he made sexual advances on his former assistant.\nUC Berkeley Law announced on Thursday that it had accepted Choudhry’s resignation from his position as dean.\nBerkeley Law published a statement from Chancellor Dirks and Provost Claude Steele that read, in part:\nWe believe the dean’s resignation is an outcome in the best interests of Berkeley Law and the university as a whole. At the same time we are under no illusion that a resignation could or even should bring this matter and broader, related issues to a close. It is clear, as we heard during our meeting with law school faculty this morning, that the initial decision not to remove the dean from his position is the subject of legitimate criticism.\nJust one day before, the law school had announced “On March 9, 2016, Dean Sujit Choudhry went on indefinite leave.” The statement further noted that an investigation into the sexual harassment allegation found that Choudhry’s behavior had “violated policy,” and that his salary as dean had been docked 10 per cent.\nBerkeley Law also published a “full report of the investigation conducted by the university’s Office for the Prevention of Harassment and Discrimination.” Choudhry’s former executive assistant alleges that the conduct occurred from July 1, 2014 to the present” according to the report dated July 7, 2015. that report also noted a six page March 9, 2015 email from the “complainant” to Choudhry that detailed Choudhry’s “rude and demeaning” conduct and sexual harassment including, according to the report, “unwelcome touching and kissing.”\nClaude Steele, UC Berkeley’s Executive Vice Chancellor and Provost stated, in part, “I required him to immediately engage in counseling at his own expense and I instructed him to make an apology to the employee.”\nChoudhry issued his own statement on the investigation and his resignation from the position of dean, in which he said:\nAs many of you know, I have been named as a defendant, along with the University of California, in a lawsuit commenced by a member of our staff. While I disagree with the plaintiff’s claims and allegations, and will defend against them, I am unfortunately unable to comment on the substance of the lawsuit. Democratic California Assembly woman Lorena Gonzalez tweeted on Thursday, as noted in a Los Angeles Times report on Choudhry’s resignation:\nToday @asmMelendez and I will send a letter asking for the termination of UC Berkeley Law Dean. #nomore — Lorena Gonzalez (@LorenaSGonzalez) March 10, 2016\nGonzalez previously supported, then called for the resignation of former San Diego Mayor Bob Filner, also a former Democratic congressman, as he faced and later admitted to several accusations of sexual harassment. The San Diego Union-Tribune reported last July that Gonzalez had been instrumental to both Filner’s rise and fall.\nChoudhry previously served as a faculty member at the New York University School of Law, where he founded the Center for Constitutional Transitions, according to NYU’s announcement that Choudhry would leave the university to become the Berkeley Law dean.\nThe NYU announcement read in part:\nAs the center’s faculty director, he advised Libyan experts and parliamentarians in Tripoli; partnered with the International Institute for Democracy and Electoral Assistance (International IDEA) on projects examining how Middle Eastern and North African (MENA) constitutions can best regulate political parties, and issues involving executive-legislative relations in the context of the Arab Spring; and held symposia on pressing topics such as the state of Arab constitutionalism and current constitutional reforms in Turkey. Within a year of its launch, the center saw its work cited in a report by the United Nations High Commissioner for Human Rights.\nThe Hindustan Times reported in July 2014 that the Delhi-born, Toronto, Canada-raised and “Rhodes Scholar, Choudhry holds law degrees from Oxford, Toronto, and Harvard.”\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2016/03/12/uc-berkeley-law-school-dean-resigns-in-sex-scandal/"}
