{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:10:54","date_modify":"2018-10-30 21:10:54","date_publish":"2015-03-11 18:22:57","description":"The undergraduate student government at the University of California Los Angeles (UCLA) voted unanimously on Tuesday to pass a resolution condemning all forms of antisemitism and hatred or hostility geared towards Jewish students on campus. |","filename":"data/vaneerConsumption/UCLAUnanimouslyPassesAntisemitismResolution.json","image_url":"https://media.breitbart.com/media/2015/02/UCLA-Rueters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_03_11__1540933854.html","title":"UCLA Unanimously Passes Antisemitism Resolution","title_page":"UCLA Unanimously Passes Antisemitism Resolution | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The undergraduate student government at the University of California Los Angeles (UCLA) voted unanimously on Tuesday to pass a resolution condemning all forms of antisemitism and hatred or hostility geared towards Jewish students on campus.\nThe resolution was presented by the board of Hillel at UCLA and passed with a 12-0 vote, notes the Los Angeles Times.\nThe five-page resolution was spurred in large part by questions directed at undergraduate student judicial panel candidate and pre-law student Rachel Beyda on February 10. Beyda was asked by fellow student Fabienne Roth if her affiliation with Judaism would pose a conflict of interest in her decision-making. Afterwards, four students voted to block Beyda from the panel before a professor told them that questioning a candidate’s religion was in direct violation of the rules.\nBeyda was ultimately confirmed with a unanimous 9-0 vote. Video of the controversial meeting is reportedly the first to have been removed from the UCLA’s student government’s YouTube channel.\nTuesday’s resolution highlighted Beyda’s incident as well as a slew of other anti-Jewish activities that have taken hold across college campuses in recent weeks.\nThe Times notes that last year the student association examined complaints from pro-Palestinian activists about whether two students violated rules by accepting free trips to Israel.\nSeveral other incidents include:\nJanuary 31: Swastikas were spray painted on the exterior of a Jewish fraternity at UC Davis, and shortly before that someone had etched “grout out the Jews” onto tile grout in the bathroom at the school’s Hillel House.\nFebruary 8: The UC Student Association voted to divest from Israel and America.\nFebruary 12: The student government at Durban University of Technology in South Africa called for the expulsion of Jewish students from the school. The Secretary of the Students Representative Council (SRC), Mqondisi Duma, said “We took the decision that Jewish students, especially those who do not support the Palestinian struggle, should deregister.”\nCritics say that the anti-Israel culture at universities throughout the UC school system–and internationally–has lent itself to the direct onslaught of antisemitism that has taken hold at these locations.\nFollow Adelle Nazarian on Twitter @AdelleNaz","url":"https://www.breitbart.com/local/2015/03/11/ucla-unanimously-passes-antisemitism-resolution/"}
