{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:07:32","date_modify":"2018-10-30 21:07:32","date_publish":"2016-09-07 14:56:01","description":"The former president of the Graduate Students Association at the University of California in Los Angeles is accusing the university of failing to back him and being intimidated by BDS.","filename":"data/vaneerConsumption/UCLAStudentLeaderForcedToLeaveLawStudiesAccusesUniversityOfBeingIntimidatedByCampusBDSTactics.json","image_url":"https://media.breitbart.com/media/2016/09/Screen-Shot-2016-09-02-at-1.04.10-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_07__1540933652.html","title":"UCLA Student Leader Forced To Leave Law Studies Accuses University Of Being 'Intimidated' By Campus BDS Tactics","title_page":"UCLA Student Leader Forced To Leave Law Studies Accuses University Of Being 'Intimidated' By Campus BDS Tactics","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – The former president of the Graduate Students Association at the University of California in Los Angeles who left the school due to a “hostile and unsafe environment” created by Boycott, Divestment and Sanctions activists is now accusing the university of failing to back him and being intimidated by BDS.\nMilan Chatterjee, who is Hindu, faced a slew of smear campaigns by UCLA’s Students for Justice in Palestine (SJP) chapter.\nIn a letter to UCLA Chancellor Gene Block, Chatterjee revealed that he was being “relentlessly attacked, bullied and harassed by BDS-affiliated organizations and students.”\nHe informed the Chancellor that he would be transferring to New York University for his final year of law school.\nChatterjee has yet to receive a reply from either the chancellor or the university.\nLast November, Chatterjee was accused of not being “viewpoint neutral” when he said that the Graduate Students Association would rescind funding for a student town hall if BDS activists promoted divestment from Israel. Chatterjee maintains that he and the GSA abstained from promoting either a pro- or anti-BDS agenda.\nPressure exerted by pro-Palestinian groups on campus led to Chatterjee being reprimanded by university officials who said he was in violation of the university’s viewpoint neutrality policy and acted outside his authority.\n“The BDS folks are very rowdy, disruptive. They are intimidating people all the time, they have lawyers who are intimidating people,” Chatterjee told The Jerusalem Post. “I think UCLA is very intimidated by that and is bending over backwards to cater to their interests.”\n“I do think that there is an element of double standards,” he added. “When BDS has an issue and files a complaint, they are very attentive and responsive. But if it’s someone who is pro-Israel or even neutral on the matter, they don’t care.”\nChatterjee claims the university vilified him in several ways, including launching a three-month investigation of him which resulted in a 27-page report scapegoating him in order to cover the fact that the university itself was not implementing policies it accused Chatterjee of violating.\n“They knew the [pro-BDS] complaint was frivolous,” he said. “This policy they say I violated, UCLA has been required to implement for the past nine years. They never did, and their administration has even gone on the record saying so. It’s really strange UCLA is accusing me of violating a policy they have not even implemented.”\nChatterjee accused Chancellor Block’s administration of being very insensitive toward the Jewish student body, the report said.\n“It’s really unfortunate that UCLA has become such a hostile school for Jewish and pro-Israel students.” he said.\n“You know, I can take on BDS activists, I did it for nine months, and I had the courage and motivation to keep at it, but when you have the university colluding with them, it’s just impossible to stay there.”\nChatterjee has already resumed his studies at NYU and says the university has been far more welcoming.\nEarlier this year, NYU’s graduate student union adopted a resolution in favor of joining the BDS movement. However, the university said the initiative was “antithetical to the free exchange of ideas” and the institution would continue working with Israeli universities.\n“I came with the intention to start on a clean slate, but some students reached out to me and said they read the stories and welcomed me to NYU with open arms.”\nIsrael advocacy group StandWithUS (SWU) supported Chatterjee from the beginning for “standing up for his beliefs in the face of intimidation.” The group added that it hopes “the attacks he has faced from anti-Israel extremists are taken as a testament to his principles, rather than a stain on his reputation.”\n“No student anywhere deserves to be harassed in this manner,” SWU said, “and especially not when striving for neutrality rather than staking out a partisan position on a controversial topic.”\nChatterjee was also awarded the American Jewish Committee’s inaugural Campus Courage Award earlier in the year.","url":"https://www.breitbart.com/middle-east/2016/09/07/ucla-student-leader-accuses-university-of-being-intimidated-by-campus-bds-tactics/"}
