{"authors":[],"date_download":"2018-10-22 22:55:32","date_modify":"2018-10-22 22:55:32","date_publish":"2014-05-13 04:03:22","description":"UConn has imposed a five-year suspension on the Sigma Alpha Epsilon fraternity for a hazing incident at a party in March.","filename":"data/vaneerConsumption/UConnBansFraternityOverHazingDaysAfterSororityBan.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_uconn-bans-fraternity-over-hazing-days-after-sorority-ban-n103826_1540248932.html","title":"UConn Bans Fraternity Over Hazing, Days After Sorority Ban","title_page":"UConn Bans Fraternity Over Hazing, Days After Sorority Ban","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBy NBCConnecticut.com\nUConn has imposed a five-year suspension on the Sigma Alpha Epsilon fraternity for a hazing incident at a party in March, days after a sorority was suspended over the same incident.\nThe university announced the sanction on Monday, the second suspension of a Greek organization on campus in less than a week.\nSigma Alpha Epsilon was put on notice last month that the school's Community Standards panel was investigating an incident that took place on March 6 at the fraternity's off-campus house on Route 195.\nThe members of the fraternity are accused of forcing students to drink alcohol, act like animals and sizzle like bacon by lying on the floor and wiggling.\nMembers of the Kappa Kappa Gamma sorority also took part in the alleged hazing at the same party, according to university officials. Last week, UConn suspended Kappa Kappa Gamma for four years.\nThe university began investigating the Greek organizations after a sophomore came forward to say she was forced into a night of heavy drinking and passed out.\nHillary Holt said she woke up in a hospital bed and was told she had a blood alcohol level of nearly three times the legal limit to drive.\nSigma Alpha Epsilon is accused of endangering the health and safety of students and distributing alcohol to individuals under the age of 21.\nUConn released a statement about its decision on Monday:\n\"Fraternities, sororities and other organizations play a vital and valuable role in the life of a great university -- by UConn will not accept hazing or harmful treatment of students by anyone, under any circumstances.\"\nA spokesperson for the national Sigma Alpha Epsilon chapter said the fraternity has a zero tolerance for hazing, but may appeal the length of the suspension.","url":"https://www.nbcnews.com/news/us-news/uconn-bans-fraternity-over-hazing-days-after-sorority-ban-n103826"}
