{"authors":["Ryan Walker For Mailonline"],"date_download":"2018-10-23 03:00:45","date_modify":"2018-10-23 03:00:45","date_publish":"2017-03-16 13:42:52","description":"The Champions League is now entering its conclusive stages after Manchester City were axed from the tournament at the last-16 stage on Wednesday night at the feet of Monaco.","filename":"data/vaneerConsumption/UEFAChampionsLeagueguideWhatareLeicesterschances.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54685800000578-0-image-a-101_1489671090399.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4320126_UEFA-Champions-League-guide-Leicester-s-chances_1540263645.html","title":"UEFA Champions League guide: What are Leicester's chances?","title_page":"UEFA Champions League guide: What are Leicester's chances? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Champions League is now entering its conclusive stages after Manchester City were axed from the tournament on Wednesday night at the feet of Monaco.\nWith the business end fast upon us, Sportsmail previews the eight teams left in the competition and gives the lowdown on their planned routes to success.\nAs current Premier League champions Leicester City became England’s last ray of hope in Europe’s leading football competition, we answer the biggest questions surrounding the elite teams heading into this year’s quarter-finals.\nLeicester will be looking to continue their remarkable Champions League adventure\nLeicester City\nHow’s their campaign gone so far?\nAfter finishing top of Group G on 13 points, and then turning around a 2-1 first leg deficit against Spanish side Sevilla, it’s more than fair to say that Leicester have once again exceeded the expectations of everyone.\nWho’s the key player?\nThe foxes present a catalogue of danger men but none more so than Jamie Vardy. Has scored only one goal in the tournament, that crucial away goal v Sevilla, but his pace and energy will cause problems for opposition’s defences.\nLeicester have exceeded the expectations of everyone so far in Europe's top competition\nReason to be cheerful?\nLeicester have every reason to be cheerful with their European campaign so far. They topped their group, overturned a one goal aggregate deficit in the last-16, and now into the quarter-finals, some fans will already be on their way to dreaming of European glory.\nReason to be fearful?\nWith each of the teams in the last-eight, bar Leicester and Monaco, having been to a European final or won the competition itself, the English club will recognise that there cup dream may be over soon.\nWhat are their chances of winning?\nNo one gave Leicester City a chance of winning the Premier League, they did. No one gave them a chance of qualifying for the last eight of the Champions League, they have. And now justifiably no one will give them a chance of securing entry into the semi-finals. Many predict the dream will end but since when have Leicester done what people expect them to do.\nJamie Vardy's pace and energy will cause problems for opposition's defences\nBarcelona\nHow’s their campaign gone so far?\nCompleted the greatest ever comeback in European history, and Barcelona will now look to build on momentum and push on in the competition.\nWho’s the key player?\nAfter recording the most assists in Champions League history, eight assists, and with four goals to his name already, Neymar is the Catalans main danger man.\nBarcelona will look to push on after completing the greatest comeback in European history\nReason to be cheerful?\nBarcelona are the highest scoring team in this year’s competition with 21 goals already, scoring an average of 3.25 goals per game.\nReason to be fearful?\nFor all the highs that the epic comeback against PSG brought with it, the fact that they lost 4-0 in the first leg shows that the Barcelona defence are susceptible to conceding.\nWhat are their chances of winning?\nBarcelona are favourites by many to once again lift the Champions League, and with that attacking trio of Neymar, Suarez, and Messi, you wouldn’t bet against them.\nNeymar has racked up eight assists and four goals in the Champions League this season\nReal Madrid\nHow’s their campaign gone so far?\nHave endured a relatively comfortable European tournament so far. Finished second behind Borussia Dortmund in Group F on 12 points, beat Napoli 6-2 on aggregate in the last-16.\nWho’s the key player?\nThe current Ballon D’or winner Cristiano Ronaldo will once again be Real Madrid’s danger man, however the Portuguese has only scored two goals in competition so far.\nReal Madrid have endured a reasonably comfortable European tournament so far\nReason to be cheerful?\nCurrent holders of the Champions League, and have won the tournament twice out of last three attempts. Have not failed to qualify for the semi-finals of the tournament since 2010.\nReason to be fearful?\nReal Madrid have conceded the most goals of any team left in the Champions League, conceding 13 in total.\nWhat are their chances of winning?\nThe current La Liga leaders will be hopeful of securing Champions League success once again having tasted European cup glory more times than any other team in history, winning the tournament 11 times in total.\nCristiano Ronaldo will once again be Real Madrid's danger man in the competition\nBayern Munich\nHow’s their campaign gone so far?\nLost twice in the Group stages to finish second on 12 points before Athletico Madrid, but were ruthless in their demolition of Arsenal in the latest stage of the tournament, winning 10-2 on aggregate.\nWho’s the key player?\nHas scored seven goals in this year’s Champions League so far, scoring on average every 101 minutes, Robert Lewandowski has undoubtedly been Bayern Munich’s star player.\nBayern Munich will be full of confidence after humiliating Arsenal 10-2 over two legs\nReason to be cheerful?\nWinning 10-2 on aggregate against Arsenal at last-16 stage of tournament, the current Bundesliga holders secured the second highest aggregate score line in Champions League history and will look to push on for the duration of the tournament.\nReason to be fearful?\nHaving exited the European competition against Spanish opposition on last three occasions, Munich will be fearful of being drawn against Spain’s elite once again.\nWhat are their chances of winning?\nScoring 20 goals in the 2016/17 Champions League already shows the attacking threat that Bayern Munich pose to opposition teams as many tip them once again for European glory.\nRobert Lewandowski has netted seven goals for the Bundesliga giants in the tournament so far\nAtletico Madrid\nHow’s their campaign gone so far?\nHave had a relatively easy route to the quarter-final stages of this year’s Champions League, topping their group with 15 points, and knocking out Bayer Leverkusen 4-2 on aggregate in last-16.\nWho’s the key player?\nWith Manchester United readying a summer bid for Atletico Madrid’s number seven, Antoine Griezmann will once again be the main threat for Diego Simeone’s team. He has scored four goals in this season’s European competition.\nAtletico Madrid have endured a pretty comfortable route to the quarter-final stages\nReason to be cheerful?\nRunners up in both the 2013/14 and 2015/16 Champions Leagues shows that the Madrid team know how to successfully navigate their way through the knockout stages and will give fans hope.\nReason to be fearful?\nHaving had a dissapointing domestic season so far, losing four matches and currently sitting in 4th position of the La Liga table, is a reason for Atletico to be fearful of an early European cup exit.\nWhat are their chances of winning?\nDue to some terrible domestic performances this season, Simeone’s Atletico Madrid look like one of the favourites to be knocked out of the competition in the next round of matches.\nAntoine Griezman, who has four goals in the competition, will be the main threat for Atletico\nJuventus\nHow’s their campaign gone so far?\nAnother Champions League equalled by another safe passage to the quarter-final knockout stages for Juventus. Currently unbeaten in Europe.\nWho’s the key player?\nScoring three goals in the Champions League for Juventus so far, summer signing Gonzalo Higuain will lead from the front and be the main point of attack for Juventus.\nJuventus have also enjoyed a safe passage to the quarter-finals of the tournament\nReason to be cheerful?\nBoasting the best defensive record in this year’s Champions League, conceding only two goals, will give the Italian hope as they look to progress into latter stages of the tournament\nReason to be fearful?\nHaving only successfully navigated themselves through the quarter-finals once since the 2008/09 competition makes for ominous viewing as Juve fans dare to dream of European glory.\nWhat are their chances of winning?\nWith teams struggling to break Juventus’s robust defence down, they will have a good chance of making the semi-finals, if they can learn to balance their defence and attack equally well.\nGonzalo Higuain will lead from the front and be the main point of attack for the Italian giants\nMonaco\nHow’s their campaign gone so far?\nMonaco have been the surprise package again in this year’s Champions League topping their group on 11 points, and knocking out Manchester City in the round of 16.\nWho’s the key player?\nKylian Mbappe looks set to be the danger man for the French team. Has only scored two goals in tournament so far, however his pace and flair is what makes him a threat to opposition defences.\nMonaco, who knocked out Manchester City, have been the surprise package so far\nReason to be cheerful?\nHave knocked three English teams out of the Champions League, Arsenal, Tottenham, Manchester City, over the last two years gives Monaco fans every right to be cheerful.\nReason to be fearful?\nWith an average team age of just 25, it may be the inexperience of Monaco that will undoubtedly see them fizzle out of the competition.\nWhat are their chances of winning?\nAlong with Leicester City, the Ligue 1 leaders are favourites to exit the Champions League at the last-eight stage having never been further than the quarter-finals in their Champions League history.\nKlyian Mbappe will be a huge threat to defences as he plays with plenty of pace and flair\nBorussia Dortmund\nHow’s their campaign gone so far?\nImpressively topped Group F finishing above current Champions League holders Real Madrid, and easily dispatched Porto from the competition winning 4-1 on aggregate.\nWho’s the key player?\nPierre-Emerick Aubameyang is Dortmund’s star player having scored seven goals in this seasons Champions League already.\nBorussia Dortmund have impressed so far and easily knocked out Portuguese side Benfica\nReason to be cheerful?\nTheir impressive high scoring displays in Europe and their ability to come from behind against top opposition such as Real Madrid will give promise of a successful cup run for Borussia Dortmund.\nReason to be fearful?\nHaving been knocked out at this stage of the competition twice in the last three attempts, manager Thomas Tuchel will be fearful of another quarter-final exit.\nWhat are their chances of winning?\nBoasting both an impressive attack and defence gives them a good chance of making it through the last-eight. However they will need to iron out their unpredictability if they are to be successful in Europe this year.","url":"https://www.dailymail.co.uk/sport/football/article-4320126/UEFA-Champions-League-guide-Leicester-s-chances.html"}
