{"authors":[],"date_download":"2018-10-23 00:02:47","date_modify":"2018-10-23 00:02:47","date_publish":"2016-01-29 12:45:26","description":"Activists in Uganda warned Friday of a crackdown on press freedom weeks before presidential elections, after a radio station was taken off air following an i...","filename":"data/vaneerConsumption/Ugandaclosesradioaheadofpollssparkingpressfreedomwarnings.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h9xh-4PuZeKVXE7cd9005b2c8769ed0d5-828_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422726_Uganda-closes-radio-ahead-polls-sparking-press-freedom-warnings_1540252967.html","title":"Uganda closes radio ahead of polls sparking press freedom warnings","title_page":"Uganda closes radio ahead of polls sparking press freedom warnings | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Uganda closes radio ahead of polls sparking press freedom warnings\nActivists in Uganda warned Friday of a crackdown on press freedom weeks before presidential elections, after a radio station was taken off air following an interview with a key opposition candidate.\nThe government however insisted there is \"no crackdown\" and said the radio station, Endigyito FM in Mbarara, about 270 kilometres (170 miles) west of the capital Kampala, was shut due to non-payment of licence fees.\nSeven opposition candidates are vying to end President Yoweri Museveni's 30-year rule in the February 18 poll and there are fears violence could mar the campaign, with all sides accusing each other of arming militias to press their claims to power.\nUgandan activists warn of a crackdown on press freedom ©Michele Siblioni (AFP/File)\nEndigyito FM was shut down on January 20, two days after it hosted Amama Mbabazi, a former prime minister and ruling party stalwart now running for the new Go-Forward party.\nTwo Uganda Communications Commission (UCC) officials reportedly stormed the privately owned station’s offices, confiscating transmitters. They claimed the broadcaster owed licence fees of nearly $11,000.\nRobert Sempala, of Uganda's Human Rights Network For Journalists (HRNJ) said he suspected the shut down was, \"a political move because it involved an opposition presidential candidate.\"\nSempala said since October, 40 journalists had been allegedly arrested or assaulted, had material or equipment confiscated, been blocked from covering events or lost employment after speaking to opposition figures or supporters. Three have allegedly been shot by police.\nHe said he feared that, \"in the lead up to the elections it will get worse.\"\n\"It is absolutely vital that Ugandan citizens can get information from a range of sources, particularly ahead of elections,\" the New York-based Committee to Protect Journalists (CPJ) said in a statement.\nEarlier this month Human Rights Watch said that government intimidation of journalists and activists was having a \"chilling effect\" on free speech.\nBut government spokesman Ofwono Opondo dismissed the concerns.\n\"The Uganda Communications Commissions, the statutory body responsible for licencing and regulation, is simply implementing its mandate enforcing the law,\" Opondo said.\n\"The radio stations that have been switched off are all due to non payment of fees as stipulated in the law and agreements.\"","url":"https://www.dailymail.co.uk/wires/afp/article-3422726/Uganda-closes-radio-ahead-polls-sparking-press-freedom-warnings.html"}
