{"authors":["Associated Press"],"date_download":"2018-10-23 00:57:08","date_modify":"2018-10-23 00:57:08","date_publish":"2016-01-29 14:38:53","description":"ZIKA FOREST, Uganda (AP) — Birds sing in the canopy and a leopard roams the thick undergrowth of this rainforest in Uganda, where the mosquito-borne Zika vir...","filename":"data/vaneerConsumption/UgandaLittleconcernimpactofZikavirusinZikaForest.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:a36d6bf206584510a9fb0bec6fd22e87-4PuZeKVXE7cd9005b2c876b1b928-55_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419109_Discovered-Uganda-Zika-not-considered-threat_1540256228.html","title":"Uganda: Little concern, impact of Zika virus in Zika Forest","title_page":"Uganda: Little concern, impact of Zika virus in Zika Forest | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Uganda: Little concern, impact of Zika virus in Zika Forest\nZIKA FOREST, Uganda (AP) — Birds sing in the canopy and a leopard roams the thick undergrowth of this rainforest in Uganda, where the mosquito-borne Zika virus was discovered almost 70 years ago. Yet while alarms are being sounded in the Americas amid serious health issues, there is little concern here.\nZika fever is suspected in a surge of birth defects in Brazil, where infections were first identified last year, but in Uganda, humans have never suffered a Zika outbreak since the virus was first found, in a monkey, in 1947.\nNow, there is sudden interest in the 25-acre (10-hectare) forest for which the virus is named, located on the edge of Lake Victoria and 23 kilometers (14 miles) from Kampala, the capital.\nIn this Thursday, Jan. 28, 2016 photo, Gerald Mukisa, a caretaker at the forest who also acts as a tour guide, poses in the Zika Forest, near Entebbe about 25 kilometers east of the Uganda capital Kampala. An Associated Press team this week visited the Zika Forest, which has 35-meter (38-yard) -tall trees and is, now fittingly, a research site for scientists with the Uganda Virus Research Institute. There¿s also a derelict observation tower. Birdwatchers come and go, and musicians have come here to shoot videos for their songs. Real estate developers threaten encroachment on the forest reserve. But until the breakout of Zika in the Western Hemisphere, not much attention was paid to the virus in the forest, according to Ugandan officials. (AP Photo/Stephen Wandera)\n\"People have been calling me and saying, 'What are you going to do with that mosquito? What are you still doing there?' And I tell them that I have lived here for seven years and nothing has ever happened to me,\" said Gerald Mukisa, a caretaker and tour guide at the forest.\nAn Associated Press team this week visited the Zika Forest, which has 35-meter (38-yard) -tall trees and is, now fittingly, a research site for scientists with the Uganda Virus Research Institute. There's also a derelict observation tower. Birdwatchers come and go, and musicians have come here to shoot videos for their songs. Real estate developers threaten encroachment on the forest reserve.\nBut until the breakout of Zika in the Western Hemisphere, not much attention was paid to the virus in the forest, according to Ugandan officials. Zika is not considered a very important disease in tropical Africa where malaria, also transmitted by mosquitoes, is a major killer.\n\"We have foxes here, rabbits, pythons, and even a leopard that lost its partner,\" Mukisa, stocky 50-year-old in jungle boots, said as he trekked through the forest, bending away undergrowth that blocked his path. \"People come here mostly as students or tourists. Now people are starting to ask about the mosquito.\"\nThe different impacts of the virus on humans in the tropics of Africa and those in Latin America and the Caribbean may be related to immunity and the fact that the mosquitoes carrying the virus here and there are different, with different habits.\nThe mosquito responsible for the virus' spread across the Atlantic belongs to a subspecies called Aedes aegypti aegypti, and that might be a crucial difference. The one found in Uganda is known as Aedes aegypti formosus, and it targets animals more than people, according to Dr. Julius Lutwama, the leading Ugandan scientist investigating viruses spread by bugs. He said there have been no reported cases here of birth defects like microcephaly — babies born with small heads — that have been linked to the virus in Latin America.\nWhile there has never been a known outbreak among people in Uganda, a few people have tested positive over the years, said Lutwama, who works with the Uganda Virus Research Institute and has investigated Zika for years. Yellow fever and dengue fever are more commonly reported in Uganda, and people infected with those diseases may also build resistance against Zika, he said.\n\"Because these diseases are closely related and they are being transmitted by the same mosquito, the likelihood of cross immunity is very high,\" he told The Associated Press.\nMatthew Aliota, a University of Wisconsin expert on the spread of mosquito-borne viruses, said scientists believe the cycles of Zika transmission are different in Uganda. While the Aedes aegypti aegypti in Latin America and the Caribbean prefers feeding on human blood, in Uganda the other type of the mosquito is spreading the virus. And that one prefers feeding on animals.\n\"Most of the transmission is in the animal cycle, with occasional spillover in humans,\" said Aliota, who recently studied the eruption of Zika cases in Colombia.\nLutwama said the last time a sample in his lab tested positive for Zika was about three years ago, when a woman in northern Uganda with suspected yellow fever was found instead to be infected with Zika.\n\"This patient had a fever, joint paints, nausea,\" he said, adding that the symptoms were mild.\nDr. Issa Makumbi, the head of epidemiology and surveillance at Uganda's Ministry of Health, told AP \"there is no threat\" of a Zika outbreak in Uganda.\n___\nAssociated Press writer Mike Stobbe contributed to this report from New York.\nIn this Thursday, Jan. 28, 2016 photo, a part of Zika forest a tropical forest is photographed, near Entebbe about 25 kilometers east of Uganda capital Kampala. An Associated Press team this week visited the Zika Forest, which has 35-meter (38-yard) -tall trees and is, now fittingly, a research site for scientists with the Uganda Virus Research Institute. There¿s also a derelict observation tower. Birdwatchers come and go, and musicians have come here to shoot videos for their songs. Real estate developers threaten encroachment on the forest reserve. But until the breakout of Zika in the Western Hemisphere, not much attention was paid to the virus in the forest, according to Ugandan officials. (AP Photo/Stephen Wandera)","url":"https://www.dailymail.co.uk/wires/ap/article-3419109/Discovered-Uganda-Zika-not-considered-threat.html"}
