{"authors":[],"date_download":"2018-10-22 23:03:22","date_modify":"2018-10-22 23:03:22","date_publish":"2016-01-11 04:41:27","description":"Government intimidation of journalists and activists in Uganda is having a \"chilling effect\" on free speech ahead of elections next month, Human Rights Watch...","filename":"data/vaneerConsumption/UgandamediaintimidatedaheadofpresidentialpollsHRW.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z5uz-56CX32zFKLb7123928b84ca5e9d6-379_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393370_Uganda-media-intimidated-ahead-presidential-polls-HRW_1540249402.html","title":"Uganda media intimidated ahead of presidential polls: HRW","title_page":"Uganda media intimidated ahead of presidential polls: HRW | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Uganda media intimidated ahead of presidential polls: HRW\nGovernment intimidation of journalists and activists in Uganda is having a \"chilling effect\" on free speech ahead of elections next month, Human Rights Watch said Monday.\nSeven opposition candidates are vying to end President Yoweri Museveni's 30-year rule in the February 18 poll and there are fears violence could mar the campaign, with all sides are accusing each other of arming militias to press their claims to power.\n\"Journalists have been suspended under government pressure, and radio stations threatened for hosting opposition members as guests or when panellists expressed views critical of the ruling party,\" the US-based rights group said in report released Monday, \"Keep the People Uninformed.\"\nSeven opposition candidates are vying to end Ugandan President Yoweri Museveni's (pictured) 30-year rule in elections next month ©Isaac Kasamani (AFP/File)\nMuseveni, in power since 1986, will face his stiffest opposition from Kizza Besigye, a three-time loser for the Forum for Democratic Change (FDC), and Amama Mbabazi, a former prime minister and ruling party stalwart now running for the new Go-Forward party.\nAll eight candidates are due to hold a live televised debate on January 15.\n\"Fair elections require a level playing field in which all candidates can freely campaign and voters can make informed decisions,\" HRW's Maria Burnett said.\n\"How can Uganda hold fair elections if the media and independent groups can't criticise the ruling party or government leaders without fear?\"\nJournalists deemed critical of the government have \"received phone calls or visits from government representatives, threatening them with firing or suspension, and closure of their media organisations,\" HRW said.\nMeanwhile, party representatives have also offered \"money, trips, and training, in exchange for favourable coverage of the ruling party,\" the report added.\n\"Organisations are in a state of self-censorship,\" one activist quoted by HRW said. \"They know things are wrong but people don't want to get onto bad terms with government...They are afraid to question things.\"\nAt the head of the ruling National Resistance Movement (NRM) party, Museveni is widely expected to win another five-year term.\n\"Freedom of expression and association are under serious threat,\" said the HRW report, based on 170 interviews across Uganda.\n\"Political tensions are running high and the government faces public discontent on a range of issues, such as government allocation for health and education services, corruption, widespread unemployment combined with a massive youth population and the rising cost of living.\"\nThe government has accused the opposition of organising militia groups and warned of possible violence in the polls.","url":"https://www.dailymail.co.uk/wires/afp/article-3393370/Uganda-media-intimidated-ahead-presidential-polls-HRW.html"}
