{"authors":[],"date_download":"2018-10-30 20:11:45","date_modify":"2018-10-30 20:11:45","date_publish":"2015-03-06 18:46:14","description":"A student group suing the University of Georgia has withdrawn its lawsuit after the university recently revised its freedom of expression policies.","filename":"data/vaneerConsumption/UGArevisesfreedomofspeechpoliciesstudentgroupdrops.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_uga-re_477b982467fdb9b3abe47a44c7379778__1540930305.html","title":"UGA revises freedom of speech policies, student group drops...","title_page":"UGA revises freedom of speech policies, student group drops...","title_rss":"NULL","source_domain":"ajc.com","text":"A student group suing the University of Georgia has withdrawn its lawsuit after the university recently revised its freedom of expression policies.\nThe Young Americans for Liberty, represented by the Alliance Defending Freedom, sued UGA last year accusing the university of hindering free speech by restricting demonstrations to just two areas, or less than one percent of its Athens campus. UGA officials disputed the claim, but did revise its policies, which were approved by university officials last month.\nThe changes address some of the concerns that came up during a hearing on the lawsuit, eliminate some provisions of the policy that were arguably ambiguous and clarify the way UGA has already been implementing its policy, said Mike Raeber, UGA’s executive director for legal affairs.\nThe new policy makes clear that UGA does not regulate speech and content of speech. The restrictions address issues including the time and manner of actions on campus, Raeber said.\nA provision of the old policy that required groups to secure a permit from the dean of students for demonstrations outside the two designated free-expression areas was replaced with a reservation system to provide notice to the university 48 hours before the scheduled event. Activities arising spontaneously, prompted by current events that couldn’t be planned in advance, are allowed anywhere on campus if less than 10 people participate. If the crowd grows, the activity can continue as long as the dean of students or campus police are notified.\nThe two free-expression areas, at the Tate Student Center and Memorial Hall plazas, are still available without a reservation.\nA release from the Young Americans for Liberty and ADF called the policy revision “a victory for everyone.”","url":"https://www.ajc.com/news/local-education/uga-revises-freedom-speech-policies-student-group-drops-lawsuit/oIN31TQkbP7owshUempMML/"}
