{"authors":[],"date_download":"2018-10-30 20:36:31","date_modify":"2018-10-30 20:36:31","date_publish":"2015-10-15 12:40:58","description":"A University of Georgia student accused of raping another student in a dorm room last month has been banned from Athens-Clarke County and must live with his parents at their Stone Mountain home while the case is pending.","filename":"data/vaneerConsumption/UGAstudentaccusedofdormrapebannedfromAthens.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/09/29/Images/photos.medleyphoto.8212648.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_uga-student_a182772c7c2fca5f688f2a67b876ba69__1540931791.html","title":"UGA student accused of dorm rape banned from Athens","title_page":"UGA student accused of dorm rape banned from Athens","title_rss":"NULL","source_domain":"ajc.com","text":"A University of Georgia student accused of raping another student in a dorm room last month has been banned from Athens-Clarke County and must live with his parents at their Stone Mountain home while the case is pending.\nThose are some of the conditions of the $25,000 bond Bamidele O. Oluwadare was granted following his Sept. 21 arrest.\nAccording to the bond order signed by Superior Court Judge H. Patrick Haggard, Oluwadare can only come to Athens-Clarke County for court or to attend UGA disciplinary hearings. He cannot stay overnight, and Oluwadare had to surrender his Nigerian passport to his attorney.\nOluwadare allegedly raped a woman on Sept. 20 in her dorm room at McWhorter Hall, according to a University of Georgia Police Department report. McWhorter is one of four apartment-style residence halls in East Campus Village.\nThe UGA report said the assault occurred between 2 a.m. and 2:30 a.m., and the victim indicated she knew the alleged assailant.\n“Subsequent investigation, including interviews with involved parties, forensic evidence and other available information, lead investigators to believe that probable cause existed for criminal charges in the case,” the university said.\nOluwadare, who was listed on the UGA website as a student assistant with Family and Graduate Housing, was previously banned from campus, the university said last month in a statement to The Atlanta Journal-Constitution.\nHe had been in the county jail from Sept. 21, the day of his arrest, until Oct. 7, the day he posted bond.","url":"https://www.ajc.com/news/crime--law/uga-student-accused-dorm-rape-banned-from-athens/MoxKSLt8L7eaQWPAniSCgL/"}
