{"authors":[],"date_download":"2018-10-30 18:57:16","date_modify":"2018-10-30 18:57:16","date_publish":"2016-06-01 19:07:00","description":"An exploration of the University of Georgia's Low-Residency Master of Fine Arts in Narrative Media Writing program.","filename":"data/vaneerConsumption/UGAsLowResidencyMFAinNarrativeMediaWriting.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_interested-writi_a1f1cdbdd2b8224473412b401de86504__1540925836.html","title":"UGA's Low-Residency MFA in Narrative Media Writing","title_page":"UGA's Low-Residency MFA in Narrative Media Writing","title_rss":"NULL","source_domain":"ajc.com","text":"Valerie Boyd is living her dream to help others attain theirs. She is an acclaimed author and an award-winning journalist. But for Boyd, those are only accolades. Her real title is teacher. \"Every journalist I know wants to write a book,\" she smiles. \"This program is for them. This program lays out a very clear path that you want to explore.\"\nThe program Boyd is referring to is the University of Georgia's Low-Residency Master of Fine Arts in Narrative Media Writing. It is the first and only low residency program based in a college of journalism; a fact Boyd is very proud of. \"I think we'll probably have many imitators, but we'll always be the first and right now we're the only.\"\nThe five-semester master's program allows experienced writers to choose one of two genres: craft a screenplay or write and publish a non-fiction book. Boyd, a co-founder of the program, works with students to develop their research, reporting and writing skills to tackle topics of national and global importance. Award-winning producer, Nate Kohn, is the program's other co-founder. He works with feature film and television writers who want to explore creative opportunities in telling stories that matter.\nStudents begin each semester by visiting the campus for an intensive eight to 10-day residency consisting of writing workshops, craft lectures, seminars and panel discussions across concentrations. They then return home to tackle a four-month series of writing assignments and book reviews. During this time, the student is paired with a faculty member. The mentor and student meet each month either on Skype or by phone for a one-on-one exchange. The monthly sessions are designed to give students a chance to request additional feedback on their assignments, ask questions and get direction. By the end of the fifth semester, the students are teaching first semester low residency classes, using their own work.\n\"The model is great,\" said Boyd. \"It offers the writer the two things they need to be successful: community and solitude. That solitude to face the blank page and not leave it blank anymore.\"\nClasses are intended to be small. Boyd said the goal is to never exceed 15 students per semester for the narrative non-fiction genre, and 15 for screenwriting. She says during the residency, students become supportive friends, which forms community. The instructors and mentors bolster that, establishing a safe environment for the creative process.\n\"You build it and you hope they will come,\" said Boyd reflecting on the program's first year. \"I always say there's drama on the stage and drama on the page. But that's it. This is not a cut-throat kind of program. We're building community. You're not competing for anything; there's plenty to go around. That's why we can afford to support each other and not compete with each other.\"\nWhile it's not the most expensive master's program of its kind, it certainly isn't cheap. In all, it's at least a $40,000 investment. Boyd said they just added a development specialist to their team to help raise funds for scholarships. They've already seen significant interest.\n\"This is an individualized program,\" Boyd explained. \"We can meet each writer where they're at and help them get better. We move the needle of their career. I don't ever want the program to get so big, I don't know each student by name and know what they're working on.\"","url":"https://www.ajc.com/lifestyles/interested-writing-for-film-and-this-uga-program-for-you/tgxGGnBYvMHA5BLPYJKPaN/"}
