{"authors":[],"date_download":"2018-10-30 20:38:04","date_modify":"2018-10-30 20:38:04","date_publish":"2015-09-28 21:14:29","description":"A University of Georgia student was being held without bond Monday in the county jail, charged with raping another student in a dorm room.","filename":"data/vaneerConsumption/UGAstudentheldindormrape.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/09/29/Images/photos.medleyphoto.8212648.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_uga-student-held-dorm-rape__1540931884.html","title":"UGA student held in dorm rape","title_page":"UGA student held in dorm rape","title_rss":"NULL","source_domain":"ajc.com","text":"A University of Georgia student was being held without bond Monday in the county jail, charged with raping another student in a dorm room.\nClarke County Sheriff’s Office records showed Bamidele O. Oluwadare remained jailed following a Sept. 21 arrest.\n“The suspect has been barred from campus, and at this time no information indicates any continued risk to the UGA community,” the university said in a statement to The Atlanta Journal-Constitution.\nOluwadare, 19, is accused of raping a coed on Sept. 20 in her dorm room at McWhorter Hall, according to a University of Georgia Police Department report. McWhorter is one of four apartment-style residence halls in East Campus Village.\nThe UGA report said the assault occurred between 2 a.m. and 2:30 a.m., and the victim indicated that she knew the alleged male assailant.\n“Subsequent investigation, including interviews with involved parties, forensic evidence and other available information, lead investigators to believe that probable cause existed for criminal charges in the case,” the university said.\nOluwadare was a student assistant with Family and Graduate Housing, according to the Athens Banner-Herald.","url":"https://www.ajc.com/news/local/uga-student-held-dorm-rape/Y8E7eS5f2zIRl5MR9vZ8qN/"}
