{"authors":["Esme Nicholson"],"date_download":"2018-10-22 23:14:08","date_modify":"2018-10-22 23:14:08","date_publish":"2018-08-14 00:00:00","description":"In Germany, beer consumption is up as temperatures remain unusually high. This is good and bad news for the beer industry.","filename":"data/vaneerConsumption/UhOhGermanyIsRapidlyRunningOutOfBeerBottles.json","image_url":"https://media.npr.org/assets/img/2018/08/10/gettyimages-905107888_wide-a4a1b495573193688dbca25507e2d4d9699e102e.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_14_637600168_uh-oh-germany-is-rapidly-running-out-of-beer-bottles_1540250048.html","title":"Uh-Oh, Germany Is Rapidly Running Out Of Beer Bottles","title_page":"Uh-Oh, Germany Is Rapidly Running Out Of Beer Bottles : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Uh-Oh, Germany Is Rapidly Running Out Of Beer Bottles\nEnlarge this image toggle caption Esme Nicholson/NPR Esme Nicholson/NPR\nIn Germany, beer consumption is up as temperatures remain unusually high. This is good and bad news for the beer industry.\nWhile the breweries have more than enough beer to go around, they're running out of bottles because customers are not returning their empties quickly enough.\nGermans care about the environment about as much as their beer; that's why the glass bottles are recycled. Customers pay a small deposit on each one, which they get back when they return it to a store.\nThere are about 4 billion beer bottles in circulation somewhere in Germany, and each bottle is refilled up to 30 times, according to Inside magazine, which caters to the drink industry. But as Germans drink more in this heat, and empty bottles pile up by the back door at home, trouble is brewing for the beer-makers.\nChristian Schuster, from the Greif brewery in Bavaria, recently appealed to customers to return their crates of empty vessels promptly or go without beer.\nEnlarge this image toggle caption Rainer Jensen/AFP/Getty Images Rainer Jensen/AFP/Getty Images\n\"We've had a beer bottle shortage since the middle of May,\" Schuster told public broadcaster Bayerische Rundfunk. \"We can't get hold of used ones fast enough, and ordering new ones takes time. I'm having to send my delivery guys out to look for old, empty bottles,\" he stressed.\nNiklas Other, editor-in-chief of Inside, says Greif is not the only brewery caught short, but adds that many are reluctant to admit they've got a problem. \"The issue is actually affecting the whole market, and some brands are unable to deliver,\" he says.\nOther says marketing departments are to blame for the, well, bottleneck. \"Every city, even every village in Germany has its own brewery,\" he says. \"They used to use and share the same bottles, just with different labels, but now many bottles and crates are different, branded to stand out from the rest. So they can't share.\"\nThe Californian craft beer company Stone Brewing has found a solution. Its Berlin plant is selling its beer in cans. That's a daring choice in Germany, where drinking beer out of a can is often considered uncouth.\nMaster brewer Thomas Tyrell says that when Stone opened its first European brewery in Berlin two years ago, they decided to ignore the German bottle trend and opt for cans instead.\n\"We think it's best for the beer,\" Tyrell says, \"because there is no light ingress and, over time, there are some oxygen permeations through the lid of a bottle, which the can doesn't have.\"\nEnlarge this image toggle caption Esme Nicholson/NPR Esme Nicholson/NPR\nTyrell says the biggest misconception about cans in Germany is that they're environmentally unfriendly. He says this is wrong, pointing out that Stone Brewing cans also carry a deposit and that 98 percent get recycled. He adds that cans are easier than bottles when it comes to logistics, hence why they aren't caught short like other breweries.\nBut recyclable cans make up only 7 percent of the German beer market, which is otherwise dominated by bottles. That's why bottle openers hang from hooks outside late-night kiosks where beer is sold in abundance.\nThirty-year-old Marcel Hillebrand has just bought a beer from a kiosk in the trendy Berlin borough of Kreuzberg. He's heading over to the bridge to watch the sunset. When asked about cans, he raises his eyebrows.\n\"I'll only drink beer out of can if there's no other alternative. A bottle is much more civilized,\" he says. \"A can is ergonomically wrong and the beer warms up too quickly. But mainly it just looks cheap. Cheap and a bit trashy.\"\nBut when it comes to real trash in the shape of empty bottles, this part of Berlin has a system in place. Georgi Valentin, 29, is an integral part of it.\nValentin sings as he picks up empty beer bottles people have left out on the street or put in trash cans, instead of returning them to be recycled. He drops them into a shopping cart full to the brim with bottles.\nIn broken German, Valentin explains that he's homeless and that collecting bottles in Berlin is better than returning to his native Romania. He picks up the deposit others pay for by returning their discarded bottles.\nThe owner of the stall nearby approaches Valentin with a smile and hands him a crate. \"This is my colleague,\" Valentin says, pointing to the kiosk owner. \"He and his employees help me. Very good guys. I do this every day. I get about 7 euros for a full shopping cart of empty bottles.\"\nThe 7-cent deposit on each beer bottle may not be motivation enough for some beer-drinkers this summer, but for people like Valentin, it's a lifeline.\nAnd thanks to him, there's no shortage of empty bottles at this kiosk.","url":"https://www.npr.org/2018/08/14/637600168/uh-oh-germany-is-rapidly-running-out-of-beer-bottles"}
