{"authors":["Press Association"],"date_download":"2018-10-22 23:52:41","date_modify":"2018-10-22 23:52:41","date_publish":"2016-01-29 12:31:43","description":"Secret documents leaked by whistle-blower Edward Snowden have revealed details of an 18-year operation by the UK and US to spy on the Israeli air force, acco...","filename":"data/vaneerConsumption/Ukandusspiedonisraeliairforcesayleakedsnowdendocuments.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-60041d42-27d0-46db-a557-34729ff775e0-4PuZeKVXE7cd9005b2c8769c02c7-856_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422567_UK-US-spied-Israeli-air-force-say-leaked-Snowden-documents_1540252361.html","title":"Uk and us 'spied on israeli air force', say leaked snowden documents","title_page":"Uk and us 'spied on israeli air force', say leaked snowden documents | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UK and US 'spied on Israeli air force', say leaked Snowden documents\nSecret documents leaked by whistle-blower Edward Snowden have revealed details of an 18-year operation by the UK and US to spy on the Israeli air force, according to reports in the Middle Eastern country's media.\nThe Foreign Office refused to comment on claims in the newspaper Yedioth Ahronoth that the Government's GCHQ eavesdropping agency has been listening in to communications from Israeli drone aircraft after breaking encryption codes.\nA senior Israeli intelligence source, speaking anonymously, described the revelation as an \"earthquake\", telling Yedioth Ahronoth it was \"the biggest breach in the history of Israeli intelligence\".\nThe Government's GCHQ agency has been listening to communications from Israeli drone aircraft, according to reports\nAccording to documents obtained by the newspaper, GCHQ worked with the US National Security Agency on the operation codenamed \"Anarchist\", which was run out of Cyprus and targeted Middle Eastern powers including Israel.\nThe hacking allowed the UK and US to monitor communications from drones on operations over Gaza and the West Bank as well as intelligence-gathering sorties over Syria and Iran since 1998, said the paper. Also contained in the documents were photographs of missiles and bombs carried by the unmanned aircraft.\nIsraeli energy minister Yuval Steinitz, a member of Prime Minister Benjamin Netanyahu's security cabinet, sought to play down the significance of the issue.\nHe told Israel's Army Radio: \"I do not think that this is the deepest kingdom of secrets, but it is certainly something that should not happen, which is unpleasant. We will now have to look and consider changing the encryption, certainly.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3422567/UK-US-spied-Israeli-air-force-say-leaked-Snowden-documents.html"}
