{"authors":[],"date_download":"2018-10-22 20:49:53","date_modify":"2018-10-22 20:49:53","date_publish":"2014-06-03 11:43:50","description":"Hussain is a dominant force in Karachi, a teeming city of some 18 million and one of the largest political constituencies of the world.","filename":"data/vaneerConsumption/UKArrestsMQMLeaderAltafHussainSparkingFearsofUnrestinPakistan.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/483311/140603-altaf-hussain-cover-7a_d54042eb13c2c3e6a36b1a64f651b085.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_u-k-arrests-mqm-leader-altaf-hussain-sparking-fears-unrest-n121031_1540241393.html","title":"U.K. Arrests MQM Leader Altaf Hussain, Sparking Fears of Unrest in Pakistan","title_page":"U.K. Arrests MQM Leader Altaf Hussain, Sparking Fears of Unrest in Pakistan","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nISLAMABAD, Pakistan - Pakistan's largest city braced for violence on Tuesday after British police arrested the \"don of Karachi\" Altaf Hussain, who has lived in the U.K. in self-imposed exile for decades.\nHussain is one of Pakistan's most powerful men and the controversial leader of the powerful Muttahida Qaumi Movement (MQM), the country's fourth-largest political party.\nA spokesman for the party told Reuters that Hussain - who runs MQM from the U.K. - was arrested in London on Tuesday.\nBritish police said that a 60-year-old man was arrested on suspicion of money-laundering during a raid on a house in northwest London but declined to confirm his name.\nThe leader of millions of Urdu-speaking immigrants descended from those who crossed into Pakistan from India after the British partitioned the region in 1947, Hussain is a dominant force in Karachi, a teeming city of some 18 million and one of the largest political constituencies of the world.\nWhile supporters praise him as a business-oriented leader of the middle class, opponents say he is a tyrant and accuse him of murder and violence.\nFaisal Sabzwari, an MQM parliamentary leader and a serving minister in the government of the Sindh province, said last week he feared the consequences of a Hussain arrest.\n\"If the Boss is arrested, expect chaos in Karachi. Only MQM can control this town. No one else,\" he said, using the moniker most party members use to refer to Hussain.\nSoon after news broke of Hussain's arrest, shop-keepers and market stall owners rushed to close their businesses for fear of violence, residents told Reuters.\n\"We deployed extra security at the British High Commission in the southern part of Karachi as soon we learnt about Altaf Hussain’s arrest in London through media,\" Deputy Inspector General Abdul Khalique Shaikh told Reuters.\n\"We have increased police patrolling and we are making further deployments at sensitive spots in the city,\" he added.\nHussain was a student-leader who rose to power in the 1980s and later founded the MQM. He has lived in the U.K. since 1992 and is now a British citizen.\nWajahat S. Khan\nReuters contributed to this report.","url":"https://www.nbcnews.com/news/world/u-k-arrests-mqm-leader-altaf-hussain-sparking-fears-unrest-n121031"}
