{"authors":["Associated Press"],"date_download":"2018-10-23 03:09:39","date_modify":"2018-10-23 03:09:39","date_publish":"2016-01-11 15:50:08","description":"All world records in track and field should be reset and lifetime bans should be imposed on serious drug cheats to clean up the sport amid its global doping ...","filename":"data/vaneerConsumption/UKAthleticsResetworldrecordsamiddopingcrisis.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393700_UK-Athletics-Reset-world-records-amid-doping-crisis_1540264179.html","title":"UK Athletics: Reset world records amid doping crisis","title_page":"UK Athletics: Reset world records amid doping crisis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UK Athletics: Reset world records amid doping crisis\nAll world records in track and field should be reset and lifetime bans should be imposed on serious drug cheats to clean up the sport amid its global doping crisis, the governing body of British athletics said Monday.\nUK Athletics published \"A Manifesto for Clean Athletes\" containing 14 proposals aimed at restoring credibility to a sport battered by allegations of widespread doping, cover-ups and corruption.\n\"The integrity of athletics was challenged as never before in 2015,\" UK Athletics chairman Ed Warner said. \"Clean athletes and sports fans the world over have been let down. Trust in the sport is at its lowest point for decades.\"\nOne of the federation's proposals is to 'investigate the implications of drawing a line under all pre-existing sport records ... and commencing a new set of records.\"\nTriple-jumper Jonathan Edwards and marathon runner Paula Radcliffe are current British world-record holders.\n\"I'll never agree with the records being wiped because I know 100 percent that at least one of those records was achieved clean and that means more were, too,\" Radcliffe told The Guardian.\nRadcliffe, who set the women's marathon record with a time of 2 hours, 15 minutes, 25 seconds at the 2003 London Marathon, was cleared by the IAAF last year of doping allegations following media reports of suspicious blood tests.\n\"Without doubt you are going to punish innocent athletes and why are you going to do it again when they have already had to compete against cheats during their career?\" Radcliffe said.\nUK Athletics also proposed a lifetime ban for British athletes guilty of a serious anti-doping violation, rather than the current standard of four-year suspensions.\nThe British Olympic Association previously had a lifetime ban for drug cheats, but the policy was struck down after the World Anti-Doping Agency found the rule non-compliant with its code.\n\"Greater transparency, tougher sanctions, longer bans — and even resetting the clock on world records for a new era — we should be open to do whatever it takes to restore credibility in the sport,\" Warner said.\nUK Athletics also proposed:\n— creation of a public register of athletes being tested.\n— sponsors should withhold support of athletes caught doping.\n— member federations should be accountable for loss of prize money to athletes of other nationalities if their own athlete's medal winning result is later annulled.\n— minimum bans for serious doping offenses should be extended to eight years to ensure cheats miss two Olympic and Paralympic cycles.\n— the supply or procurement of performance-enhancing drugs should be criminalized.\n\"UKA believes the time has come for radical reform if we are to help restore trust in the sport,\" Warner said. \"Athletics needs to act very differently if we are to move on from the crisis facing the sport.\"\nRussia is currently banned from international track and field after a report commissioned by WADA alleged widespread doping and cover-ups in the country. Last week, two Russian officials and the son of former IAAF president Lamine Diack were banned for life last week for engaging in blackmail, bribery and extortion to cover up a Russian doping case.\nLamine Diack also is under criminal investigation in France over allegations he took payments for deferring sanctions against Russian drugs cheats.\nThe IAAF said it welcomed the proposals from UK Athletics, adding: \"We look forward to reviewing the recommendations in full over the coming days.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3393700/UK-Athletics-Reset-world-records-amid-doping-crisis.html"}
