{"authors":["Associated Press"],"date_download":"2018-10-23 05:11:08","date_modify":"2018-10-23 05:11:08","date_publish":"2017-03-16 16:10:16","description":"LONDON (AP) - British officials are trying to trace the owner of a trove of gold coins worth a \"life-changing\" amount of money found stashed inside a piano.A...","filename":"data/vaneerConsumption/UKauthoritiesseekownerofgoldtrovestashedinsidepiano.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/16/wire-229413-1489680886-549_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320898_UK-authorities-seek-owner-gold-trove-stashed-inside-piano_1540271468.html","title":"UK authorities seek owner of gold trove stashed inside piano","title_page":"UK authorities seek owner of gold trove stashed inside piano | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LONDON (AP) - British officials are trying to trace the owner of a trove of gold coins worth a \"life-changing\" amount of money found stashed inside a piano.\nA coroner investigating the find on Thursday urged anyone with information to come forward.\nWhen the piano's owners took it to be tuned last year in Shropshire, central England, it was found to contain a hoard of gold sovereigns minted between the mid-19th and early 20th centuries.\nAn undated handout photograph, taken at an unknown location, shows part of a hoard of gold coins, made between 1847 and 1915, discovered hidden in an upright piano made by Broadwood & Sons of London and sold to a music establishment in Essex, England, in 1906. British officials are trying to trace the owner of a trove of gold coins worth a \"life-changing\" amount of money found stashed inside a piano. A coroner investigating the find on Thursday March 16, 2017 urged anyone with information to come forward. (Portable Antiquities Scheme/Trustees of the British Museum/Peter Reavill via AP)\nInvestigators have determined that the piano was built in London in 1906 and sold to a pair of piano teachers in Saffron Walden, eastern England. They are seeking information on its ownership before 1983.\nAnyone wanting to make a claim has until April 20, when coroner John Ellery will conclude his inquest.\nIf the gold's owner or heirs cannot be traced, it will be declared treasure, and the piano's current owners will reap the reward.\nOfficials have not disclosed how much the coins are worth. Peter Reavill, who assesses finds for the British Museum's Portable Antiquities Scheme, said \"it's a hoard of objects which is potentially life-changing for somebody to receive.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4320898/UK-authorities-seek-owner-gold-trove-stashed-inside-piano.html"}
