{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-23 00:37:22","date_modify":"2018-10-23 00:37:22","date_publish":"2016-01-28 14:41:06","description":"Police were called when trouble broke out at the notorious Grande-Synthe shanty town near Dunkirk in northern France late on Tuesday afternoon.","filename":"data/vaneerConsumption/UKboundmigrantshotatDunkirkimmigrationcamp.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/26/19/3099B31200000578-0-image-a-18_1453837722487.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421061_UK-bound-migrant-shot-Dunkirk-immigration-camp-wounded-gunfight-rival-Muslim-Christian-people-smugglers_1540255042.html","title":"UK-bound migrant shot at Dunkirk immigration camp","title_page":"UK-bound migrant shot at Dunkirk immigration camp | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Shooting took place at a notorious migrant camp near Dunkirk on Tuesday\nA UK-bound migrant shot at a notorious migrant camp near Dunkirk was hurt during a gunfight between rival Muslim and Christian people smugglers vying for trade, it has been claimed.\nPolice were called when trouble broke out at the notorious Grande-Synthe shanty town late on Tuesday afternoon.\nThree people were shot, one stabbed and another struck on the head with a stick during clashes that resulted in two arrests.\nPolice were called when trouble broke out at the notorious Grande-Synthe shanty town on Tuesday\nThe clash centred on Christian and Muslim people smugglers, the national delegate for the Unsa police union, David Michaux said, according to the Times.\nHe said 'dozens' of shots were fired during the battle.\n'The religious tensions there exacerbate the situation,' he added. 'One of the big problems in this camp is that you have Muslims on one side, and Christians on the other.'\nHowever, the Times reports that state prosecutors have yet to confirm whether there was a religious element to the clash.\nOfficers later fired at a vehicle that was believed to have been driven by a people smuggler.\nOn Tuesday, a local police source said: 'It is thought that people smugglers were involved in the violence'.\nThree people were shot, one stabbed and another struck on the head with a stick during clashes that resulted in two arrests\nThe clash centred on Christian and Muslim people smugglers, the national delegate for the Unsa police union, David Michaux said\nHe added: 'The trouble broke out at around 4pm, and it was finally broken up by police. The three injured migrants were rushed to hospital at Grande-Synthe. None of the injuries were life threatening.'\nThe source said it was common for the smugglers to hand out summary justice if people had not paid them enough money, or had annoyed them in some other way.\nDamien Careme, the mayor of Grande-Synthe, said on Tuesday that 'only one shot was heard', before firearms officers attended the scene.\nAn investigation was immediately launched, with many of the 2500 migrants in the camp questioned.\nThe camp has become notorious for the amount of people smugglers who prey on it, leading to allegations that it is 'in the hands of the Mafia'.\nEarlier this month, UKIP defence spokesman Mike Hookem MEP slammed French government plans to build an office refugee camp near the existing shanty town at Grande-Synthe.\nDamien Careme, the mayor of Grande-Synthe, said 'only one shot was heard', before firearms officers attended the scene\nAn investigation was immediately launched, with many of the 2500 migrants in the camp questioned\nHe said the French were 'kidding themselves' if they thought the new £1.1 million centre would 'defeat people traffickers and protect truck drivers in the port region'.\nMr Hookem, who was threatened with a gun in the nearby Teteghem refugee camp in August last year said; 'Congregating migrants in one massive camp is exactly the wrong thing to do and will put extra pressure on police, port security, Immigration officials and truckers in the region.\n'In fact these plans will essentially make the entire Dunkirk-Calais region an absolute no go area for British hauliers.","url":"https://www.dailymail.co.uk/news/article-3421061/UK-bound-migrant-shot-Dunkirk-immigration-camp-wounded-gunfight-rival-Muslim-Christian-people-smugglers.html"}
