{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:28:38","date_modify":"2018-10-30 22:28:38","date_publish":"2016-12-13 00:00:00","description":"'Employers are still unsure about what exactly Brexit will mean, but are not letting that uncertainty deter them from hiring,' says Manpower's Mark Cahill.","filename":"data/vaneerConsumption/UKbusinessesaregoinginto2017hungryfortoptalentdespiteBrexit.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_manpower-employment-survey-2017-q1-hungry-for-top-talent-britain-brexit-2016-12_1540938518.html","title":"UK businesses are 'going into 2017 hungry for top talent' despite Brexit","title_page":"    Manpower employment survey: Businesses 'hungry for top talent' despite Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Matt Cardy / Getty Images LONDON — Businesses are the most bullish on hiring prospects in almost three years, according to a closely watched survey of companies.\nRecruitment firm Manpower's survey of just over 2,100 UK businesses' hiring plans for the first quarter of 2017 shows a net employment outlook of +7%, up two points on the previous quarter. Manpower's survey is watched by both the Bank of England and the UK government.\nMark Cahill, ‎ManpowerGroup UK Managing Director, says in a release announcing the results: \"UK companies are going into 2017 hungry for top talent. Employers are still unsure about what exactly Brexit will mean, but are not letting that uncertainty deter them from hiring.\n\"In fact, some employers may be looking to bring in talent while they can before any curbs to freedom of movement across the European Union come into effect, as more than half of all the jobs created by UK employers this year went to EU workers.\"\nConstruction firms are set to see a boom in hiring, with an employment outlook of +9% for the first quarter. Cahill credits the government's infrastructure investment plans, saying: \"The Chancellor's commitment to invest £23 billion in innovation and infrastructure over the next five years is a huge boost to the construction industry and the £2.3 billion housing infrastructure fund is also great news for house-builders.\"\nBut the sector set for the biggest rise in hiring is utilities, with an outlook of +13% for the first quarter of 2017. Cahill says: \"In the next two years more than 26 million smart meters will need to be fitted if the government is going to meet its targets. Energy companies will need an army of up to 20,000 skilled engineers and wider support staff to meet this challenge.\"\nDespite growth in the private sector, the public sector is set to continue to contract at the start of next year with an employment reading of -3% of the second quarter in a row. Cahill says: \"Concerns over public finances are clearly having an effect on public sector hiring, but the longer-term trend towards digitisation and automation is also affecting public sector job prospects.\"\nBut while the over public is sector is shrinking, Manpower is predicting a boom in business service hiring as the government recruits essential skills to help it in Brexit negotiations. Cahill says: \"With the government facing ever-more-complex challenges, not least Brexit, central government departments are increasingly reliant on outside consultants to provide expertise.\"","url":"https://www.businessinsider.com/manpower-employment-survey-2017-q1-hungry-for-top-talent-britain-brexit-2016-12"}
