{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 20:12:55","date_modify":"2018-10-30 20:12:55","date_publish":"2018-07-04 07:38:21","description":"The High Court of England and Wales ruled Monday that a “no-prayer zone” around a London abortion clinic is legal.","filename":"data/vaneerConsumption/UKCourtUpholdsBanonPrayingOutsideAbortionClinic.json","image_url":"https://media.breitbart.com/media/2018/07/Love-them-both.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_04__1540930375.html","title":"UK Court Upholds Ban on Praying Outside Abortion Clinic","title_page":"UK Court Upholds Ban on Praying Outside Abortion Clinic","title_rss":"NULL","source_domain":"breitbart.com","text":"The High Court of England and Wales ruled Monday that a “no-prayer zone” around a London abortion clinic is legal, in a move expected to encourage the establishment of similar buffer zones in the United Kingdom.\nIn his decision, Mr. Justice Turner agreed that the ban interfered with pro-life activists’ human rights, but said it was legitimate for the council to conclude it was a “necessary step in a democratic society.”\n“There was substantial evidence that a very considerable number of users of the clinic reasonably felt that their privacy was being very seriously invaded at a time and place when they were most vulnerable and sensitive to uninvited attention,” the judge said.\nThe “public space protection order” (PSPO) that mandated the buffer zone around the clinic in the London borough of Ealing was challenged by Alina Dulgheriu, a woman who was helped by people she met at a pro-life vigil. Dulgheriu is now the mother of a six-year-old girl.\n“I am devastated for those women that since the introduction of the Ealing PSPO, have not been able to access the loving help that I did,” Dulgheriu said after the ruling. ““I am saddened and shocked that the Court has upheld a PSPO that prevents good people giving help to mothers who desperately want it.”\nMrs. Dulgheriu said she is considering other alternatives for appeal.\n“I am discussing every option available to me to be able to challenge this decision, which for the sake of vulnerable women and the future of our fundamental freedoms, should not be able to stand,” she added.\nThe PSPO passed in April created a 330-foot buffer zone around the Marie Stopes clinic, a leading abortion provider in London, effectively banning public prayer, distributing materials, and offering counsel to women seeking an abortion.\nBishop Philip Egan of Portsmouth has said he is “deeply concerned” by the imposition of such “no-prayer zones.”\nElizabeth Howard, spokeswoman for the Be Here for Me campaign, called the decision “a major blow for free speech and human rights in this country.”\n“But the struggle for human rights has never been easy,” Howard said. “And while there are women who feel they have no choice but an abortion they don’t want, we will do their best to reach them.”\n“This decision is certainly not the end of pro-life witness in this country,” she added.\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/europe/2018/07/04/uk-court-upholds-ban-praying-outside-abortion-clinic/"}
