{"authors":["Associated Press"],"date_download":"2018-10-23 01:29:57","date_modify":"2018-10-23 01:29:57","date_publish":"2016-01-29 15:28:04","description":"LONDON (AP) — A British couple who wanted their relationship recognized as a civil partnership instead of a marriage lost their case Friday at the High Court...","filename":"data/vaneerConsumption/UKcouplelosescivilpartnershipcourtchallenge.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422821_UK-couple-lose-civil-partnership-court-challenge_1540258197.html","title":"UK couple loses civil partnership court challenge","title_page":"UK couple loses civil partnership court challenge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UK couple loses civil partnership court challenge\nLONDON (AP) — A British couple who wanted their relationship recognized as a civil partnership instead of a marriage lost their case Friday at the High Court.\nRebecca Steinfeld, 34, and Charles Keidan, 39, said they objected to the history and institution of marriage and argued that they and others faced discrimination because the law says only same-sex couples are eligible for civil partnerships.\nBut the British government's lawyers said since gay marriage became legal in 2014, civil partnerships may be abolished or phased out in a few years. The government wants to wait and see the impact of gay marriage before deciding on the future of civil partnerships.\nJudge Geraldine Andrews dismissed the couple's claim for judicial review Friday, saying that opposite-sex couples are not disadvantaged compared with gay couples just because the latter have two ways to legally recognize their relationship. She said heterosexual couples can achieve exactly the same rights and protections by getting married.\nThe judge said while many people may also have \"deeply held objections\" to marriage and sympathize with Steinfeld and Keidan's view, \"unfairness does not necessarily equate to incompatibility\" with European human rights law.","url":"https://www.dailymail.co.uk/wires/ap/article-3422821/UK-couple-lose-civil-partnership-court-challenge.html"}
