{"authors":["Breitbart London"],"date_download":"2018-10-30 22:02:54","date_modify":"2018-10-30 22:02:54","date_publish":"2017-03-04 09:35:19","description":"LONDON (AFP) - Britain could legally leave the European Union without settling its accounts with the bloc, lawmakers said Saturday, while warning of the political risks of such an approach.","filename":"data/vaneerConsumption/UKCouldLegallyLeaveEUWithoutPayingaPennyLordsPanel.json","image_url":"https://media.breitbart.com/media/2016/08/brexit.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_03_04__1540936974.html","title":"UK Could Legally Leave EU Without Paying a Penny, Lords Panel","title_page":"UK Could Legally Leave EU Without Paying a Penny, Lords Panel","title_rss":"NULL","source_domain":"breitbart.com","text":"LONDON (AFP) – Britain could legally leave the European Union without settling its accounts with the bloc, lawmakers said Saturday, while warning of the political risks of such an approach.\nA House of Lords committee concluded that, unless Britain reaches a specific deal over budget contributions, it could leave behind a bill that officials have estimated at up to 60 billion euros ($64 billion).\nBritain is one of the largest net contributors to the EU budget, along with Germany, France and Italy, and the issue of outstanding payments will be a priority for Brussels in the Brexit talks.\n“The UK appears to have a strong legal position in respect of the EU budget post-Brexit,” said Kishwer Falkner, chairwoman of the EU financial affairs sub-committee.\nBut she said that if the government continued to make budget payments there could be “potential gains from other elements of the negotiations”.\nThe negotiations “will be about establishing a stable, cooperative and amicable relationship between the UK and the EU. This will not be possible without goodwill on both sides”.\nMargaritis Schinas, a spokesman for European Commission president Jean-Claude Juncker, last month compared the issue with going to the pub with friends.\n“You order a round of beer but then you cannot leave while the party continues, you still have to pay for the round you ordered,” he said.\nBritain’s former ambassador to the EU has said the bloc is set to demand up to 60 billion euros from Britain, a figure that other EU sources have confirmed to AFP.\nThe Lords committee said all the estimates were “hugely speculative”, citing one expert who put it between 20 billion and 70 billion euros.\nPrime Minister Theresa May is expected to trigger Article 50 of the EU’s Lisbon Treaty by the end of March.\nThis starts a two-year withdrawal process, after which Britain will leave the EU whether or not it has struck a deal on its future ties with the bloc.\nMay says she would rather have no deal than a bad deal.\nBut the president of the CBI business lobby, Paul Drechsler, said this would open a “Pandora’s Box” of unforseen consequences for the economy as all legal and trade deals with the EU became invalid.","url":"https://www.breitbart.com/europe/2017/03/04/uk-legally-leave-eu-without-paying-penny-lords-panel/"}
