{"authors":["Associated Press"],"date_download":"2018-10-23 03:26:18","date_modify":"2018-10-23 03:26:18","date_publish":"2016-01-29 18:20:57","description":"LONDON (AP) — A cult leader was sentenced to 23 years in prison Friday for raping and sexually assaulting his female followers and keeping his daughter impri...","filename":"data/vaneerConsumption/UKCultleadersentencedto23yearsforabuserape.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422996_UK-Cult-leader-sentenced-23-years-abuse-rape_1540265178.html","title":"UK: Cult leader sentenced to 23 years for abuse, rape","title_page":"UK: Cult leader sentenced to 23 years for abuse, rape | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UK: Cult leader sentenced to 23 years for abuse, rape\nLONDON (AP) — A cult leader was sentenced to 23 years in prison Friday for raping and sexually assaulting his female followers and keeping his daughter imprisoned in a secretive Maoist commune in London for three decades.\nProsecutors said 75-year-old Aravindan Balakrishnan, known as \"Comrade Bala,\" abused and brainwashed his followers into believing he had God-like powers, ensuring they were too scared to leave the tiny radical communist group he ran in south London.\nHis victims included two women and his daughter, 33-year-old Katy Morgan-Davies, who was born into the commune and was almost never allowed to go out in 30 years. Describing Balakrishnan as a \"narcissist and a psychopath,\" Morgan-Davies told British media he emulated people including Mao Zedong, Joseph Stalin and Saddam Hussein.\nSentencing Balakrishnan, Judge Deborah Taylor said his treatment of his daughter from her birth to the age of 26 \"was a catalog of mental and physical abuse.\"\n\"These are grave and serious crimes conducted over a long period of time and you have shown no remorse whatsoever,\" she said.\nBalakrishnan was convicted in December of rape, indecent assault, false imprisonment and cruelty to a child. He was impassive as he was sentenced Friday.","url":"https://www.dailymail.co.uk/wires/ap/article-3422996/UK-Cult-leader-sentenced-23-years-abuse-rape.html"}
