{"authors":["Associated Press"],"date_download":"2018-10-23 02:43:17","date_modify":"2018-10-23 02:43:17","date_publish":"2016-01-28 17:50:35","description":"LONDON (AP) — Britain's political opposition says the government should stop arms exports to Saudi Arabia until it investigates United Nations claims that ci...","filename":"data/vaneerConsumption/UKdefendsSaudiarmslinksamidUNallegationsoverYemen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:18d98b638d194b7f938811f84208fdcf-4vVdYopwYQ7f641721b07afe0d18-699_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421392_UK-defends-Saudi-arms-links-amid-UN-allegations-Yemen_1540262597.html","title":"UK defends Saudi arms links amid UN allegations over Yemen","title_page":"UK defends Saudi arms links amid UN allegations over Yemen | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UK defends Saudi arms links amid UN allegations over Yemen\nLONDON (AP) — Britain's political opposition says the government should stop arms exports to Saudi Arabia until it investigates United Nations claims that civilians in Yemen are being targeted by a Saudi-led coalition.\nLabour Party foreign affairs spokesman Hilary Benn said Thursday that there should be an investigation into whether Britain \"is implementing its own arms control rules.\"\nSaudi Arabia is the world's biggest buyer of British weapons, and U.K. military officials are advising Saudi forces.\nShiite fighters, known as Houthis, and other people carry the coffin of judge Yahya Rubaid, who was killed with his family by a Saudi-led airstrike in Sanaa, Yemen, Tuesday, Jan. 26, 2016. (AP Photo/Hani Mohammed)\nThis week, a U.N. report alleged \"widespread and systematic\" targeting of civilian areas in Yemen.\nMiddle East Minister Tobias Ellwood told lawmakers that the report's authors relied on satellite technology and didn't go to Yemen.","url":"https://www.dailymail.co.uk/wires/ap/article-3421392/UK-defends-Saudi-arms-links-amid-UN-allegations-Yemen.html"}
