{"authors":["Press Association"],"date_download":"2018-10-22 23:51:19","date_modify":"2018-10-22 23:51:19","date_publish":"2016-01-28 13:07:20","description":"The UK economy grew at a faster pace at the end of last year, but annual expansion slowed amid global trade woes and falling commodity prices. The first esti...","filename":"data/vaneerConsumption/Ukeconomygrewby05infourthquarterof2015.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-278f7136-c833-46b0-9adb-812cf7c65b08-4vVdYopwYQ7f641721b07ad89864-125_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420694_UK-economy-grew-0-5-fourth-quarter-2015_1540252279.html","title":"Uk economy grew by 0.5% in fourth quarter of 2015","title_page":"Uk economy grew by 0.5% in fourth quarter of 2015 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UK economy grew by 0.5% in fourth quarter of 2015\nThe UK economy grew at a faster pace at the end of last year, but annual expansion slowed amid global trade woes and falling commodity prices.\nThe first estimate from the Office for National Statistics (ONS) revealed that gross domestic product (GDP) eased to 2.2% in 2015, down from 2.9% the year before.\nIt added that expansion in the fourth quarter of the year picked up to 0.5%, up from 0.4% in the third quarter and following 0.5% in the second quarter.\nChancellor George Osborne said this month that the UK faced a \"dangerous cocktail of new threats\"\nThe UK economy has slowed since last summer and this month Chancellor George Osborne said the UK faced a \"dangerous cocktail of new threats\" such as falling commodity prices, recessions in Brazil and Russia and rising tensions in the Middle East.\nBut in a tweet on the latest GDP figures, Mr Osborne said the data showed the UK \"continues to grow steadily & despite turbulence in global economy we're pushing ahead\".\nThe Chancellor added: \"With the risks we see elsewhere in the world, there may be bumpy times ahead - so here in the UK we must stick to the plan that's cutting the deficit, attracting business investment and creating jobs.\"\nPrime Minister David Cameron tweeted: \"It's good news that the economy is growing steadily, meaning more jobs and security for people. Global risks mean we will stick to our plan.\"\nHowever, in November the Bank of England downgraded its growth outlook for the UK to around 2.7% in 2015, down from 2.8% - but the official data has fallen short of these expectations.\nThe latest independent forecasts from finances watchdog Office for Budget Responsibility (OBR), also in November, maintained UK growth in 2015 at 2.4%, which these official figures also missed.\nUK growth in 2015 was the lowest since 2013.\nThe UK has been affected by a slowing global economy, held back by weaker expansion in emerging markets.\nChina's shift to an economy less driven by exports and manufacturing has slowed expansion and led to a widespread fall in commodity prices.\nOil prices have collapsed by more than 70% since their peak of around 115 US dollars a barrel in summer 2014 to around 32 US dollars a barrel.\nThis uncertainty has led to global market volatility, which has seen the FTSE 100 Index fall by some 7% since the start of the year.\nThis means there is little pressure on the Bank of England to raise interest rates from the rock-bottom low of 0.5%, even though the US Federal Reserve raised rates in America last month for the first time in nearly a decade.\nHargreaves Landsdown senior economist Ben Bretell said: \"Your interpretation of today's gross domestic product figures will depend on whether you take a 'glass half full' or a 'glass half empty' view of the UK economy.\n\"The bigger picture is that growth remains lacklustre, but reasonably resilient.\"\nMarkit chief economist Chris Williamson said: \"Uncertainty over Brexit, weak overseas growth and financial market volatility are all creating an unsettling business environment and point to downside risks to the economy in 2016.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3420694/UK-economy-grew-0-5-fourth-quarter-2015.html"}
