{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-31 00:16:41","date_modify":"2018-10-31 00:16:41","date_publish":"2016-12-02 00:00:00","description":"Andrew Tyrie, chair of the Treasury Select Committee, wants the National Audit Office to investigate the government's deal with Nissan.","filename":"data/vaneerConsumption/UKgovernmentwontpublishBrexitlettertoNissandespiteFOIrequests.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_government-brexit-letter-nissan-greg-clark-nao-andrew-tyrie-2016-12_1540945001.html","title":"UK government won't publish Brexit letter to Nissan despite FOI requests","title_page":"    UK government won't publish Brexit letter to Nissan despite FOI requests - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Nissan introduces the 2017 Nissan Rogue Star Wars Edition at the 2016 Los Angeles Auto Show in Los Angeles, California, U.S November 16, 2016. REUTERS/Lucy Nicholson LONDON — An influential Tory MP has asked the National Audit Office (NAO) to open an investigation into the alleged \"sweetheart\" deal given to Nissan by the government.\nAndrew Tyrie, chair of the Treasury Select Committee, has written to the NAO asking it to examine whether any new \"contingent liabilities\" have arisen as a result of the government's deal with Nissan, which convinced it to commit to building its new models in the UK despite uncertainty around Brexit. In effect, the probe would try to work out just how much the government's gentleman's agreement with Nissan could end up costing.\nTyrie has called for the investigation following repeated refusals from the government to publish specific details of the arrangement and the letter given by business secretary Greg Clark to the Japanese car manufacturer.\nClark gave Nissan a letter of assurances over Brexit that led to speculation in the press that it amounted to a \"sweetheart deal.\"\nThe Times reported shortly after the deal was announced that Clark assured Nissan Britain will \"remain competitive\" after Britain leaves the EU and assured the car manufacturer that it will not lose out as a result of Brexit. The fear is that this guarantee could effectively amount to a blank cheque if Nissan does end up incurring Brexit related costs and expects Britain to pick up the tab.\nThe government has knocked back multiple Freedom of Information requests asking for details of the alleged \"sweetheart\" deal:","url":"https://www.businessinsider.com/government-brexit-letter-nissan-greg-clark-nao-andrew-tyrie-2016-12"}
