{"authors":["Lianna Brinded"],"date_download":"2018-10-30 21:44:15","date_modify":"2018-10-30 21:44:15","date_publish":"2016-12-19 00:00:00","description":"85% of European hedge fund assets are managed from the UK.","filename":"data/vaneerConsumption/UKhedgefundsBrexitdocumentEconomyjobspassporting.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_uk-hedge-funds-brexit-document-economy-jobs-passporting-2016-12_1540935855.html","title":"UK hedge funds Brexit document: Economy, jobs, passporting","title_page":"    UK hedge funds Brexit document: Economy, jobs, passporting - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BIG LONDON — Lobby groups representing Britain's hedge funds is going to outline their wish list for Brexit talks between the UK and European Union to mitigate the damage a \"hard Brexit\" could have on the City.\nThat's according to the Financial Times, which saw the draft document from the Alternative Investment Management Association, Managed Funds Association and the Alternative Credit Council.\nA \"hard Brexit\" is the UK leaving the European Union without unfettered access to the single market, in exchange for full control over immigration.\nHowever, for financial services, this is the worst possible outcome as it would mean the loss of passporting rights.\nThe loss of passporting rights following Brexit is one of the biggest fears in the City of London. If the passport is taken away, then London could cease to be the most important financial centre in Europe, costing the UK thousands of jobs and billions in revenues. Around 5,500 firms registered in the UK rely on the European Union's passporting rights for the financial services sector, and they turn over about £9 billion ($11.2 billion) in revenue.\nAccording to the FT, citing AIMA figures, 85% of European hedge fund assets are managed from the UK.\nThe hedge fund document is allegedly going to point out that the industry contributes nearly £4 billion annually in tax while also providing more than 40,000 jobs.\nOn top of that, the document will also say that if Britain does decide to opt out of the Freedom of Movement act — and therefore stop the free movement of EU citizens into the UK — this could hit the industry hard because 20% of its employees in London come from the EU.\nRead the full story here.","url":"https://www.businessinsider.com/uk-hedge-funds-brexit-document-economy-jobs-passporting-2016-12"}
