{"authors":["Will Martin"],"date_download":"2018-10-30 23:39:27","date_modify":"2018-10-30 23:39:27","date_publish":"2018-07-18 00:00:00","description":"The latest inflation data from the Office for National Statistics was released on Wednesday morning, showing inflation unchanged at 2.4% but petrol prices at a 4-year high.","filename":"data/vaneerConsumption/UKinflationJune2018Petrolat4yearhighinflationremainsat24.json","image_url":"https://amp.businessinsider.com/images/5b4efbf161f6f92b008b4634-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_uk-inflation-level-for-june-2018-2018-7_1540942767.html","title":"UK inflation June 2018: Petrol at 4 year high, inflation remains at 2.4%","title_page":"    UK inflation June 2018: Petrol at 4 year high, inflation remains at 2.4% - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Petrol prices are rising. Reuters\nLONDON — The cost of fuel rose to its highest level in almost four years last month and held up the rate of inflation in the UK, according to the Office for National Statistics.\nBritain's headline rate of consumer price inflation (CPI) was 2.4% in the month of June, unchanged from the previous month. CPIH, the ONS' favoured measure of inflation was also unchanged, steady at 2.3%.\nThat was almost entirely down to the rising price of petrol, which has been triggered by steadily rising oil prices. Oil is now at around $71 per barrel, a level not seen since around four years ago.\n\"Petrol prices rose by 2.7 pence per litre between May and June 2018 to stand at 128.0 pence per litre in June, the highest average price since September 2014,\" the ONS said in its release.\nWithout the increased price of fuel, the UK's headline rate of inflation would likely have dropped last month, the ONS said, continuing a steady decline witnessed throughout 2018.\nHere's the chart from the ONS: Office for National Statistics \"Consumers have been feeling the benefit of the summer clothing sales, and computer game prices have also fallen,\" Mike Hardie, the ONS' head of inflation said in a statement.\n\"However, gas and electricity and petrol prices all rose, with consumers seeing the highest price at the pump for nearly four years, with inflation remaining steady overall,\" he added.\nInflation in the UK had been subdued for several years prior to the vote to leave the EU in June 2016. But the vote caused a fall in the value of the pound which pushed up inflation. As the pound has recovered, inflation has started to fall, dropping from 3% in January to its current level.\nThe latest inflation figures come just 24 hours after the ONS showed UK employment hitting its highest level ever and wages continuing to rise steadily.\nAverage UK earnings increasing by 2.7% in the three months up to May, meaning that wages are still growing above inflation. It means the average Brit is a little better off each month.\nTumbling sterling\nThe pound fell sharply on the news as the steady inflation. This is because it makes it slightly less likely that the Bank of England will decide to raise interest rates at its next Monetary Policy Committee meeting on August 2.\n\"Markets had been pricing in around an 80% chance the Bank would lift borrowing costs in August, but today's inflation data combined with yesterday's lacklustre wage growth figures could force policymakers into a rethink,\" Ben Brettell, a senior economist at Hargreaves Lansdown, said in a statement.","url":"https://www.businessinsider.com/uk-inflation-level-for-june-2018-2018-7"}
