{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:01:11","date_modify":"2018-10-30 20:01:11","date_publish":"2015-08-11 10:11:46","description":"UKIP’s Mike Hookem was threatened with a gun in a migrant camp, the same camp reported to be controlled by a South London gangster.","filename":"data/vaneerConsumption/UKIPMEPThreatenedWithGunInWarZoneMigrantCamp.json","image_url":"https://media.breitbart.com/media/2015/08/GettyImages-475608284-1024x714.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_08_11__1540929671.html","title":"UKIP MEP Threatened With Gun In ‘War Zone’ Migrant Camp","title_page":"UKIP MEP Threatened With Gun In ‘War Zone’ Migrant Camp | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"UKIP’s Mike Hookem was threatened with a gun in a migrant camp in Dunkirk yesterday afternoon. The incident happened in the same camp widely reported to be controlled by a brazen South London gangster turned people smuggler.\n“Just been threatened with a gun by migrants in Dunkirk,” tweeted Hookem, who represents Yorkshire & North Lincolnshire in the European Parliament. Adding ten minuets later: “We’ve just told the police in Dunkirk we were threatened with a gun and they told us to call the police.”\nMr. Hookem’s reports have been dismissed by some people on social media as a publicity stunt and ignored by much of the left-wing press. “All those saying I made it up: unlucky. We have footage. Looking forward to the apologies,” he tweeted.\nNot especially surprised @BBCNews didn’t even mention armed migrants gangs in Calais. @BBCr4today had @Oxfam on this morning, naturally. — Mike Hookem MEP (@MikeHookemMEP) August 10, 2015\n12 hours after we saw migrants hiding in the bushes the holes still hadn’t been fixed. @ukip @nigel_farage pic.twitter.com/Wxfd1uJRsX — Mike Hookem MEP (@MikeHookemMEP) August 2, 2015\nThe migrants who threatened him purportedly shouted: “We need to get to England, this is our problem.” Hookem, who is on a fact-finding mission for UKIP, described the camp as a “war zone.”\nThe camp at Dunkirk is quickly becoming the new focus of the channel migrant crisis, as heightened security in Calais steadily shifts the problem. UKIP’s Yorkshireman on the ground spoke to lorry drivers in Calais who told him: “Just recently it’s gone through the roof… I’ve been threatened with bars, it’s a terrifying place to be.”\nThe local authority set up the Dunkirk camp, and food is provided daily by French charity workers who dare not enter after nightfall. Multiple reports have emerged of aggressive British people smugglers brazenly operating in the camp and expensive cars with British number plates are regularly seen – several have been seised by French Police.\nA number of Journalists have been threatened with violence in the Dunkirk camp. A man of Middle Eastern appearance who says he used to be a “big criminal in South London” is thought to run it. He sped off an Audi A4 Quattro with a British number plate when The Times visited shortly before Mr. Hookem yesterday.\nA migrant who is reported to have later apologised for what happened to Hookem, said the gang leader had “multiple guns and big knives”. Hookem said: “The emphasis was to get out [of] that area as quickly as possible. It’s not a nice place to be and these are people who want to get into our country.”","url":"https://www.breitbart.com/national-security/2015/08/11/ukip-mep-threatened-with-gun-in-war-zone-migrant-camp/"}
