{"authors":["Matt Hunter For Mailonline"],"date_download":"2018-10-23 01:58:11","date_modify":"2018-10-23 01:58:11","date_publish":"2016-01-28 16:31:12","description":"Cllr Denis Crawford is in constant demand as he sits on Norfolk County, Breckland District and Thetford Town councils.","filename":"data/vaneerConsumption/UkipcouncillorDenisCrawfordwassobusyattendingmeetingshewasreportedmissing.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AA505D00000578-0-image-a-19_1453997410830.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421198_Workaholic-Ukip-councillor-busy-attending-meetings-two-day-period-worried-family-reported-missing-police-committee_1540259891.html","title":"Ukip councillor Denis Crawford was so busy attending meetings he was reported missing","title_page":"Ukip councillor Denis Crawford was so busy attending meetings he was reported missing | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Officers eventually tracked him down finding him in ANOTHER meeting\nHe attended back-to-back meetings over two exhausting days\nVeteran councillor Denis Crawford (pictured) who was so busy in back-to-back meetings over two days his family reported him missing\nA workaholic councillor has been so busy attending meeting after meeting that his worried family reported him missing to police - sparking a full-scale search.\nCllr Denis Crawford is in constant demand as he sits on Norfolk County, Breckland District and Thetford Town councils.\nThe UKIP politician went to so many meetings during a non-stop two-day merry-go-round that his concerned loved ones alerted police.\nOfficers leapt into action and searched his flat where he lives alone in Thetford before finally tracking him down - at another council meeting.\nCllr Crawford, 65, had got bogged down in a series of back-to-back meetings over Monday leaving the house just after 7am and returning at 10pm.\nHe was once again up early on Tuesday and left for another exhausting schedule of meetings shortly after 7am.\nBut it was while he was behind closed doors discussing yet another item or point of order that his daughter had been trying and failing to contact her dad.\nShe raised the alarm when she got nowhere fearing the worst.\nTwo PCSOs eventually found Cllr Crawford at a meeting of Thetford Town Council on Tuesday night.\nNEVER ONE TO DUCK OUT OF A MEETING - SEE THE COUNCILLOR'S STAGGERING SCHEDULE HERE Monday, January 25: 7.10am - Sets off from Thetford for County Hall, Norwich 10am - Takes part in Adult Social Care Committee meeting 4pm - Meeting ends 5pm - Attends Breckland Council Local Plan consultation event in Thetford 7pm - Attends Redcastle Action Group meeting 10pm - Finally gets home Tuesday, January 26 7.10am - Back to County Hall 10am - Takes part in Children's Services Committee meeting 4pm - Meeting ends 6pm - Attends UKIP group meeting in Thetford 7pm - Attends Thetford Town Council full council 7.10pm - Neighbour reports him missing to police 8.05pm - Tracked down by Thetford Police at meeting\nThey interrupted proceedings as they asking for the shocked local authority stalwart to step outside with them.\nCllr Crawford returned five minutes later, explaining to his puzzled colleagues what the officers had wanted.\nSpeaking after the meeting, he said: 'My neighbour and daughter were worried I had gone missing after searching my flat, so they called the police.\n'Two officers came to my flat and searched it, and two more came to the meeting.\n'I did apologise for so much manpower being put into the search. \"It's nice that people care though\".'\nCllr Crawford's packed schedule had seen him take in two six-hour meetings at Norfolk County Council on Monday and Tuesday.\nThe conscientious councillor also attended a Local Plan consultation event for Breckland Council in Thetford and a residents' meeting on Redcastle Furze estate.\nOn Tuesday night Cllr Crawford took part in a UKIP group meeting, before heading for the town council.\n'My mobile phone was switched off during meetings and I'd had no voicemails raising any concerns,' he said.\nCllr Crawford said he may have had voicemails on his landline at his home but had not checked them.\n'It's my own fault for being on three councils,' he quipped.\nBut Cllr Crawford shows no sign of slowing down. He attended hospital on Wednesday for an out patient's operation before dashing straight to a local residents' meeting last night.","url":"https://www.dailymail.co.uk/news/article-3421198/Workaholic-Ukip-councillor-busy-attending-meetings-two-day-period-worried-family-reported-missing-police-committee.html"}
