{"authors":["Jack Montgomery"],"date_download":"2018-10-30 18:26:24","date_modify":"2018-10-30 18:26:24","date_publish":"2018-09-09 12:46:06","description":"Gerard Batten is calling for Tommy Robinson to be allowed into UKIP, citing his \"sheer guts\" on the issue of grooming gangs.","filename":"data/vaneerConsumption/UKIPChiefBacksBraveTommyRobinsonJoiningPartyCitesGutsonGroomingGangs.json","image_url":"https://media.breitbart.com/media/2018/03/Speakers-Corner.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_09_09__1540923984.html","title":"UKIP Chief Backs 'Brave' Tommy Robinson Joining Party, Cites 'Guts' on Grooming Gangs","title_page":"UKIP Chief Backs 'Brave' Tommy Robinson Joining Party, Cites 'Guts' on Grooming Gangs","title_rss":"NULL","source_domain":"breitbart.com","text":"UKIP leader Gerard Batten is calling for Tommy Robinson to be allowed into the party ahead of a crunch meeting where the issue will be discussed, citing his “sheer guts” on the issue of grooming gangs.\nUKIP introduced a blanket ban on former British National Party (BNP) and English Defence League (EDL) members during Nigel Farage’s leadership, in order to bolster its credentials as a party opposed to mass migration but still emphatically “non-racist and non-sectarian”.\nTommy Robinson founded the EDL as a street protest group against Islamist hate preachers and grooming gangs in his twenties, but walked away from it in 2013 to join Maajid Nawaz’s counter-extremism think tank, Qulliam, citing concerns about the EDL’s infiltration by neo-Nazi elements.\nWhile Robinson’s relationship with Nawaz appears to have broken down, he has since reinvented himself as an independent journalist focusing on radical Islam and Muslim-dominated child sexual exploitation rings, known colloquially as grooming gangs.\nDELINGPOLE: Tommy Robinson was Abused and Tortured with the Complicity of the British State https://t.co/WqBLwkRhoz — Breitbart London (@BreitbartLondon) August 3, 2018\n“My personal opinion is that we should find a way of allowing Tommy Robinson to become a member,” Batten told MailOnline ahead of a National Executive Committee (NEC) meeting where it will be decided if the issue can be put before members at party conference.\n“Because, for all his faults –and I’m sure he will admit he has got them — and his indiscretions, he is incredibly brave and he has stood up and defended people in the face of grave danger to himself,” he said.\n“And I am talking now about these victims of industrialised sexual abuse.\n“He has got the sheer guts to stand up and defend those people. And my view is that in his case we should make an exception — a one off.”\nUKIP under Batten has gone to great lengths to broaden its appeal beyond its Brexit-supporting base to appeal to working-class voters concerned by the cultural issues surrounding the growth of radical Islam in Great Britain, and younger voters concerned by the activities of ‘social justice warriors’ threatening free speech.\nTo that end, it has already embraced YouTube polemicists Paul Joseph Watson and Carl Benjamin — better known as Sargon of Akkad — and Scottish comic and free speech advocate Markus Meechan, aka Count Dankula.\nFollow Jack Montgomery on Twitter: @JackBMontgomery","url":"https://www.breitbart.com/europe/2018/09/09/ukip-leader-calls-brave-tommy-robinson-let-into-party/"}
