{"authors":["Victoria Friedman"],"date_download":"2018-10-30 18:42:09","date_modify":"2018-10-30 18:42:09","date_publish":"2018-08-10 16:26:34","description":"UKIP leader Gerard Batten has criticised Met Police Commissioner Dick for checking if comparing burqas to letterboxes is a 'hate crime'.","filename":"data/vaneerConsumption/UKIPCriticisesMetsChiefofThoughtPoliceforHateCrimeInvestigationIntoBoJoBurqaComments.json","image_url":"https://media.breitbart.com/media/2018/08/Cresida-Dick.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_08_10__1540924929.html","title":"UKIP Criticises Met's 'Chief of Thought Police' for 'Hate Crime' Investigation Into BoJo Burqa Comments","title_page":"UKIP Criticises Met's 'Chief of Thought Police' for 'Hate Crime' Investigation Into BoJo Burqa Comments | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"UK Independence Party (UKIP) leader Gerard Batten has criticised London Metropolitan Police Commissioner Cressida Dick for having specialist officers look into whether comparing burqas to letterboxes is a ‘hate crime’.\nThe initial probing by the Met’s specialist hate crime officers came following comments made by Boris Johnson when he compared the appearance of women wearing the burqa to letterboxes and bank robbers, sparking preliminary investigations by the Conservative Party into whether the Brexit-supporting MP should be disciplined.\nSpeaking to the BBC’s Asian Network earlier this week, Dick said that “some people have clearly found it offensive” but added that officers had deemed that the former two-time Mayor of London “did not commit a criminal offence”.\nCalling out the police’s obsession with investigating so-called ‘hate speech’, UKIP leader Gerard Batten drew similarities with the concept of ‘thought crime’ in George Orwell’s dystopian novel Nineteen Eighty-Four.\n“We are moving into an Orwellian society where the police are exercising thought-control powers. Cressida Dick should take the 900 police officers she has investigating so-called hate speech crimes and put them back to investigating real crimes against the person and property. She should be directing the Metropolitan Police to stamp out London’s epidemic of stabbings and acid attacks — these are a national scandal,” Mr Batten said in a press release.\n‘Civil War’: Tory Brexiteers Threaten Rebellion over Boris Burqa Investigation https://t.co/1kJfKyVWza — Breitbart London (@BreitbartLondon) August 10, 2018\nThe UKIP leader also took aim at Ms Dick’s attendance on a course when she was with Thames Valley Police run by Common Purpose UK, a ‘leadership training’ NGO which has been described as “the Left’s very own old boy network” and by Conservative MP Philip Davies in 2012 as “a networking organisation for the great and good to advance their pro-Europe… politically correct view of the world”.\n“This whole problem can be attributed to the Cultural Marxist, Common Purpose training given to her and others in senior positions throughout the country,” Mr Batten said.\n“We need to return to the concept of a police force whose job it is to prevent crime and enforce the law, not make up laws on the hoof to enforce a politically correct ideology,” he added.\nOthers have criticised Dick for wasting policing resources including Johnson ally Conor Burns MP who said: “With everything else going on in London to be diverting resources into an even cursory investigation into an article is bizarre.”\n“You have the head of the Met Police diverting precious resources when we are in the grip of a knife crime epidemic. It is a complete waste of police time and resources. We are in the grip of a politically correct tidal of wave of nonsense,” Mr Burns added.\nMs Dick, who led the operation in 2005 that resulted in the fatal shooting of Brazilian electrician Jean Charles de Menezes after police officers mistook him for a suicide bomber, was criticised in June after presenting statistics to a government select committee that appeared to misrepresent crime figures.\nBurqas as Security Threats: How Criminals and Terrorists Use the Islamic Face Veil https://t.co/IJF0ze7et8 — Breitbart London (@BreitbartLondon) August 10, 2018\nTwitter Follow @friedmanpress Follow Victoria Friedman on","url":"https://www.breitbart.com/europe/2018/08/10/ukip-criticises-chief-thought-police-bojo-burqa-comments-hate-crime/"}
