{"authors":["A.B. Sanderson"],"date_download":"2018-10-30 21:11:54","date_modify":"2018-10-30 21:11:54","date_publish":"2015-01-19 14:52:13","description":"Britain's former Chief Rabbi has reported that anxiety among the Jewish population is at a \"record high\" following the hostage taking and murder of |","filename":"data/vaneerConsumption/UKJewsScaredtoGotoShopsafterParisAttacksSaysFormerChiefRabbi.json","image_url":"https://media.breitbart.com/media/2015/01/British-Jews.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_19__1540933914.html","title":"UK Jews 'Scared to Go to Shops' after Paris Attacks, Says Former Chief Rabbi","title_page":"UK Jews 'Scared to Go to Shops' after Paris Attacks, Says Former Chief Rabbi | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"“And that kind of thing is absolutely inevitable, I hope it will dissipate soon but there can be no doubt that there is an anxiety now among British Jews which is pretty much at a record high within my lifetime,” he said.\nSpeaking to Sky News, Lord Sacks said people were now asking questions like: “Will I be safe going to synagogue or going to a Jewish shop? Will my children be safe in a Jewish school?\nLord Sacks said Jewish people in Britain were frightened to attend synagogue and shops in the wake of the Paris attacks even though there has been an increase in the number of police and security advisors taking proactive steps to increase security of the Jewish population in the country.\nIt follows a poll last week which found that more than 10 percent of Jews have considered leaving Britain, which rose to 17 percent among young Jewish people. A third reported they felt “much more concerned” after the massacre by Amedy Coulibaly which resulted in the loss of four lives.\nAnd in a separate poll, the scourge of anti-Semitism appeared to be rearing its ugly head as a significant minority of people admitted to holding anti-Semitic views, including the belief that Jews hold too much power in the media and are greedy and dishonest in business.\nSpeaking at a service to commemorate Jewish people murdered in the Kosher supermarket, Mrs May said she “never thought I would see the day when members of the Jewish community would say they do not feel safe in this country.”\nThe Home Secretary said she was “deeply distressed” by the polling and added that the Paris attack was “a chilling reminder of anti-Semitism, not just in France but the recent anti-Semitic prejudice that we sadly have seen in this country.\n“I know that many Jewish people in this country are feeling vulnerable and fearful and you’re saying that you’re anxious for your families, for your children and yourselves.\n“I never thought I would see the day when members of the Jewish community in the United Kingdom would say they were fearful of remaining here in the United Kingdom.\n“And that means we must all redouble our efforts to wipe out anti-Semitism here in the United Kingdom.”\nThe former Chief Rabbi defended the work of the Charlie Hebdo cartoonists and indicated he disagreed with the controversial words of Pope Francis who said that people who mocked religion could “expect to get a punch”.\nAsked if His Holiness should “turn the other cheek” as the bible teaches, he replied, “That’s a good point! The truth is I think we have to have enough confidence to say that in the long run, freedom for any of us depends on freedom for all of us. That may mean that I have to put up once in a while with something I find very offensive. But I do understand Muslim sensitivities and they are real.”\nLord Sacks added that although he thought the cartoons “profoundly offensive” he said argued, “that’s the price of a free society.”\n“We are free to say things so that my freedom let’s say to be a Jew or to be a Muslim has to be an equal freedom for all and that must mean that people are free to be critical of Jews and Muslims, I think that is the bargain that freedom for any of us means freedom for all of us.”","url":"https://www.breitbart.com/national-security/2015/01/19/uk-jews-scared-to-go-to-shops-after-paris-attacks-says-former-chief-rabbi/"}
