{"authors":["Simon Kent"],"date_download":"2018-10-30 18:56:11","date_modify":"2018-10-30 18:56:11","date_publish":"2016-05-26 12:10:46","description":"A UN resolution has singled out Israel as the world's only violator of “mental, physical and environmental health”.","filename":"data/vaneerConsumption/UKJoinsGermanyAndFranceToCondemnIsraelAsWorldsOnlyViolatorOfHealthRights.json","image_url":"https://media.breitbart.com/media/2016/05/israel-flag.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_05_26__1540925771.html","title":"UK Joins Germany And France To Condemn Israel As World's Only 'Violator Of Health Rights'","title_page":"WATCH: UK Joins Germany And France To Condemn Israel As World's Only 'Violator Of Health Rights'","title_rss":"NULL","source_domain":"breitbart.com","text":"A UN resolution has singled out Israel as the world’s only violator of “mental, physical and environmental health” and commissioned a delegation to report on “the health conditions in the occupied Palestinian territory” and in “the occupied Syrian Golan.”\nThe United Kingdom, France, and Germany were among 107 countries that voted for the proposal during this week’s gathering of the World Health Organization (WHO) in Geneva. Eight countries voted against the resolution and eight abstained, while 58 other countries taking part in the assembly were absent for the vote.\nThe entire European Union (EU) membership voted as a block to support the motion of condemnation against Israel. Watch video below of the UK casting its vote:\nOnly the United States, Canada, Australia, Paraguay, Guatemala, Micronesia and Papua New Guinea stood with Israel in opposing the motion that was co-sponsored by the Arab Group of States and the Palestinian delegation.\n“The UN reached new heights of absurdity today,” said UN Watch executive director Hillel Neuer on Tuesday immediately after the vote.\nHe then slammed the global body for “enacting a resolution which accuses Israel of violating the health rights of Syrians in the Golan, even as in reality Israeli hospitals continue their life-saving treatment for Syrians fleeing to the Golan from the Assad regime’s barbaric attacks.”\nMr Nieur added that the motion was more political and religious prosecution than considered policy. He said:\n“Shame on Britain, France and Germany for encouraging this hijacking of the annual world health assembly, and diverting precious time, money, and resources from global health priorities, in order to wage a political prosecution of Israel, especially when, in reality, anyone who has ever walked into an Israeli hospital or clinic knows that they are providing world-class health care to thousands of Palestinian Arabs, as well as to Syrians fleeing Assad.\n“At the same time UN Watch commends the principled stand taken by the U.S., Canada, Australia, Paraguay, Guatemala, Micronesia and Papua New Guinea in joining Israel to oppose perpetuating a politicized agenda item.”\nThe U.S. and Canada both took the floor to strongly object to the anti-Israel exercise, UN Watch reports.\nThe resolution calls for reports on a series of alleged Israeli violations, including on “the impact of prolonged occupation and human rights violations on mental, physical and environmental health” in “the occupied Palestinian territory.”\nThe text also adopted three reports mandated by last year’s Arab-sponsored resolution: a “field assessment” on “health conditions in the occupied Palestinian territory”, a similar report by the WHO director-general, and a related report by the WHO secretariat.\nEarlier this month the UN cultural body UNESCO also singled out Israel for condemnation, criticizing it for recent actions on the Temple Mount in Jerusalem and declining to acknowledge Jewish ties to the site.","url":"https://www.breitbart.com/middle-east/2016/05/26/watch-uk-joins-germany-and-france-to-condemn-israel-as-worlds-only-violator-of-health-rights/"}
