{"authors":[],"date_download":"2018-10-30 14:21:30","date_modify":"2018-10-30 14:21:30","date_publish":"2016-01-21 00:00:00","description":null,"filename":"data/vaneerConsumption/UKjudgePutinprobablyapprovedassassinationofexRussianspy.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_01_uk_judge_putin_probably_approved_assassination_of_exrussian_spy_1540909290.html","title":"UK judge: Putin probably approved assassination of ex-Russian spy","title_page":"UK judge: Putin probably approved assassination of ex-Russian spy","title_rss":"NULL","source_domain":"americanthinker.com","text":"Litvinenko died from drinking green tea laced with the radioactive substance. He was in the presence of two ex-KGB officers when he ingested the fatal drink.\nReuters:\nLitvinenko, 43, an outspoken critic of Putin who fled Russia, died after drinking green tea laced with the rare radioactive isotope at London's Millennium Hotel.\nAn inquiry led by British judge Robert Owen found that former KGB bodyguard Andrei Lugovoy and another Russian, Dmitry Kovtun, poisoned Litvinenko as part of an operation directed by Russia's Federal Security Service (FSB), the main heir to the Soviet-era KGB.\n\"The FSB operation to kill Mr Litvinenko was probably approved by Mr Patrushev, then head of the FSB, and also by President Putin,\" Owen said.\n\"I have concluded that there is a strong probability that when Mr Lugovoy poisoned Mr Litvinenko, he did so under the direction of the FSB. I have further concluded that Mr Kovtun was also acting under FSB direction,\" he said.\nThe judge said he was sure Lugovoy and Kovtun had placed the polonium 210 in the teapot at the Millennium Hotel's Pine Bar on November 1, 2006.\nTraces of the highly radioactive substance were found at several sites across the city.\nThe Kremlin has always denied any involvement but the claim that Putin directly ordered a killing of an opponent with a radioactive isotope in a major Western capital provoked immediate censure from Moscow.\nRichard Horwell, the lawyer acting for London police, told the inquiry the Russian state might have wanted Litvinenko dead for many reasons, including his defection to Britain, his accusations of Kremlin corruption, his sympathy for Chechen separatists and his claims about Putin's lifestyle.\nRussia's Foreign Ministry said what it called Britain's politicized, biased and opaque handling of the Litvinenko case had clouded relations.\nThe death of Litvinenko marked a post-Cold War low point in Anglo-Russian relations, and ties have never recovered, marred further by Russia's annexation of Crimea and its support for Syrian President Bashar al-Assad.\nIt also raised serious domestic security concerns, Britain now being home to a large number of Russian dissidents opposed to Putin and to exiled \"oligarchs\".","url":"https://www.americanthinker.com/blog/2016/01/uk_judge_putin_probably_approved_assassination_of_exrussian_spy.html"}
