{"authors":["Simon Kent"],"date_download":"2018-10-30 18:33:38","date_modify":"2018-10-30 18:33:38","date_publish":"2016-07-19 09:48:58","description":"Labour MP Naz Shah has agreed that comments which saw her suspended from the party in April were anti-Semitic and she apologised for online posts, including one suggesting Israel should be moved to the United States. | Israel / Middle East","filename":"data/vaneerConsumption/UKLabourMPBlamesHerOwnIgnoranceForAntiSemiticComments.json","image_url":"https://media.breitbart.com/media/2016/04/Shah-in-Commons-e1461776065626.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_07_19__1540924418.html","title":"UK Labour MP Blames Her Own 'Ignorance' For Anti-Semitic Comments","title_page":"UK Labour MP Blames Her Own 'Ignorance' For Anti-Semitic Comments","title_rss":"NULL","source_domain":"breitbart.com","text":"Labour MP Naz Shah has agreed that comments which saw her suspended from the party in April were anti-Semitic and she apologised for online posts, including one suggesting Israel should be moved to the United States.\nLabour has now reinstated the Bradford West MP, who in her first interview since the incident blamed her “ignorance”.\n“I wasn’t anti-Semitic, what I put out was anti-Semitic,” Ms Shah told BBC Radio 4’s World At One.\nAs Breitbart London reported, Ms. Shah made her comments on social media two years ago calling for the “transportation” of Israelis out of the Middle East. She also conducted an online poll asking whether Israel had committed war crimes.\nLabour first sought to defend Ms. Shah but then suspended her ahead of an internal investigation.\nNow the MP, who also resigned as PPS to shadow chancellor John McDonnell, says she wishes she had apologised sooner rather than waiting until a story about them was published.\nThe MP told the BBC that when she looked back she thought “how stupid I was and how ignorant I was”.\n“The truth is that some of the stuff I have since looked at and understood, I didn’t know at the time,” she said, before adding she now understood the connotations involved in the words she used.\n“The language I used was anti-Semitic, it was offensive,” she said. “What I did was I hurt people and the language that was the clear anti-Semitic language, which I didn’t know at the time, was when I said, ‘The Jews are rallying.'”\nMs. Shah said she had been on a learning journey in recent months and was grateful for the “amazing compassion” from the local Jewish community.\n“I didn’t get anti-Semitism as racism,” said Ms Shah. “I had never come across it. I think what I had was an ignorance.”\nIn the interview she revealed she had been party to conversations about the Israel-Gaza conflict, about unilateral British and American support for Israel, which might have influenced her.","url":"https://www.breitbart.com/middle-east/2016/07/19/uk-labour-mp-blames-ignorance-anti-semitic-comments/"}
