{"authors":["Lianna Brinded"],"date_download":"2018-10-30 20:58:26","date_modify":"2018-10-30 20:58:26","date_publish":"2016-12-22 00:00:00","description":"Professor Iain Begg says it is notable that the Prime Minister has not ruled out Britain making EU budget contributions even after Brexit.","filename":"data/vaneerConsumption/UKpayingEUcontributionswillbemosttoxicissueduringBrexittalks.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_uk-paying-eu-contributions-will-be-most-toxic-issue-during-brexit-talks-article-50-2016-12_1540933106.html","title":"UK paying EU contributions will be most 'toxic' issue during Brexit talks","title_page":"    UK paying EU contributions will be most 'toxic' issue during Brexit talks - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Theresa May. Getty LONDON — The \"toxic issue\" that will \"dog\" the government during negotiations on Britain's exit from the European Union is whether the UK will pay into the EU budget even after it leaves the 28-nation bloc, according to a leading professor.\nProfessor Iain Begg from the LSE European Institute says in a new report titled \"Brexit: Six months on,\" that it is notable Theresa May did not mention EU contributions in her Conservative Party conference speech earlier this year when she took over as leader of the Tories and prime minister of the UK.\nHere are the key excerpts from Begg's briefing in the report (emphasis ours):\n\"It was notable that in the Prime Minister's speech to the Conservative Party Conference she set out two 'red lines' — that the UK should control its own immigration policy and no longer be subject to the jurisdiction of the European Court of Justice — but did not suggest that ceasing to contribute to the EU budget was a third.\n\"... More contentious would be arrangements similar to those for Norway and Switzerland, which would mean a net flow of cash to 'Brussels' indefinitely. The possibility that the UK could, in effect, 'pay for access' to the Single Market was conceded by David Davis, one of the three 'Brexiteer' Ministers, early in December, eliciting howls of dismay from advocates of a 'harder' Brexit.\"\nOne of the biggest selling points for Britain leaving the European Union was that the UK would be able to stop £350 million a week in gross weekly contributions to the 28-nation bloc.\nHowever, over the last few months, officials have admitted that Britain could continue to make payments to the EU, even after it officially leaves the bloc. This could be for a variety of reasons, including the suggestion that the UK could try to push for \"pay-as-you-go\" access to the Single Market.\nThe EU has also said that it will hit Britain with a €50 billion bill when it triggers Article 50, a figure that includes pension contributions for British diplomats in Brussels and budget contributions for the current EU budget period up to 2020.\nProfessor Begg says in the report (emphasis ours):\n\"... While it may have been good politics for the 'Leave' campaign to promise £350 million a week, therefore, the expectations this raised were wholly unrealistic, in both the short and long term. This issue is thus likely to dog the government further, throughout the period of the Article 50 negotiations, and very possibly beyond. As so often, haggling over who pays for what could be a particularly toxic issue.\"\nMay says she will not give a \"running commentary\" on how negotiations are going but she has made it clear in various speeches that her government is prioritising immigration restrictions. This would imply a \"hard Brexit\" because the EU's official line is that it will not allow the UK to curb immigration from EU nations and keep membership of the single market at the same time.\nBritain voted for a Brexit by a slim majority on June 23 and, since then, there has been much speculation about when the new prime minister, Theresa May, will trigger Article 50. March 2017 is the current target date but a Supreme Court case will rule in January 2017 whether she will have to get permission from parliament to do this. This could slow things down.\nWhen Prime Minister Theresa May does eventually trigger Article 50, starting the two-year negotiation period for the UK's exit from the European Union, all eyes will be on negotiations to see what type of deal Britain gets and whether it involves continued payments to the EU.","url":"https://www.businessinsider.com/uk-paying-eu-contributions-will-be-most-toxic-issue-during-brexit-talks-article-50-2016-12"}
