{"authors":["Breitbart London"],"date_download":"2018-10-30 17:55:46","date_modify":"2018-10-30 17:55:46","date_publish":"2015-06-27 13:55:36","description":"Prime Minister David Cameron today confirmed that Britons would form the largest single group among the 38 fatalities from Friday's Islamist terror attack |","filename":"data/vaneerConsumption/UKPMDavidCameronTellsBritonsKeepCalmAndCarryOninTheFaceOfISTerror.json","image_url":"https://media.breitbart.com/media/2015/06/cameron-serious.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_27__1540922146.html","title":"UK PM David Cameron Tells Britons Keep Calm And 'Carry On' in The Face Of IS Terror","title_page":"UK PM David Cameron Tells Britons Keep Calm And 'Carry On' in The Face Of IS Terror | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Prime Minister David Cameron today confirmed that Britons would form the largest single group among the 38 fatalities from Friday’s Islamist terror attack in Tunisia.\nMr Cameron attended this year’s national Armed Forces Day event in Guildford, Surrey. After the official reception he urged Britons to remain “vigilant” in the threat of terror and “carry on”. He said:\n“There’s no doubt we are under severe threat of terrorism. Today is about paying tribute to our Armed Forces. There will be heightened security at those events. The most important thing is to carry on and thanking our Armed Forces for the work they do, knowing in our our country we face a severe terrorist threat.\n“But if we work together, are vigilant and back our police and anti-terrorism forces.\n“If we combat this poisonous narrative of Islamic extremism that is radicalising too many young minds in our country. If we do all of those things and show the persistence and determination I have talked about we will overcome.”\nAs Mr Cameron spoke, travel agents Thomson and First Choice cancelled all flights to Tunisia for the next week in the wake of the Sousse massacre. The companies are implementing contingency plans to fly their customers back immediately.\nTravel agents will today evacuate as many as 2,500 Britons from Tunisia and are braced for a wave of cancellations to the North African state. Ten Thomson flights are scheduled to arrive back at airports across the UK including Gatwick.\nA spokesperson for Gatwick Airport has told MailOnline that passengers arriving in from Tunisia will be shielded from the press.\n‘There will be no filming or interviews taking place in the airport today,’ said the spokesperson.\nOne thousand holidaymakers have already returned to the UK from Tunisia on special flights with 5,400 still in the country. Thomson and First Choice confirmed that ‘a number of fatalities’ and those injured are their customers and said around 2,500 people will be brought back today.\nHowever, Tui Group, which runs the companies, was unable to confirm how many of the 38 people killed or injured in the shooting were its customers.","url":"https://www.breitbart.com/national-security/2015/06/27/uk-pm-david-cameron-tells-britons-keep-calm-and-carry-on-in-the-face-of-is-terror-threats/"}
