{"authors":[],"date_download":"2018-10-22 21:57:52","date_modify":"2018-10-22 21:57:52","date_publish":"2014-06-07 10:55:33","description":"British police have released exiled Pakistani politician Altaf Hussain on bail following his arrest four days ago which sent Karachi into lockdown.","filename":"data/vaneerConsumption/UKPoliceReleaseDonofKarachiAltafHussainonBail.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/483311/140603-altaf-hussain-cover-7a_d54042eb13c2c3e6a36b1a64f651b085.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_u-k-police-release-don-karachi-altaf-hussain-bail-n125186_1540245472.html","title":"U.K. Police Release 'Don of Karachi' Altaf Hussain on Bail","title_page":"U.K. Police Release 'Don of Karachi' Altaf Hussain on Bail","title_rss":"NULL","source_domain":"nbcnews.com","text":"Police did not identify him at the time of his arrest, but the London office of his powerful Muttahida Qaumi Movement (MQM) confirmed he had been detained.\nA police statement on Saturday said the man arrested on Tuesday had been released on bail.\nThe statement said the money laundering investigation continued and the man in question was to report back to police in July.\nIt also said two men, aged 72 and 44, were arrested in December as part of the same investigation and let out on bail pending further inquiries until early September.\nHussain effectively controls the sometimes violent port city of Karachi from his headquarters in a north London suburb and is known for his fiery addresses to his supporters through a loudspeaker connected to a telephone.\nThe MQM party's support base is millions of Muslim Urdu-speaking people whose families migrated to Karachi and nearby areas at the time of the 1947 partition of India.\nWithin minutes of his arrest, panicked shopkeepers and market stall owners in Karachi closed their businesses and the city ground to a standstill due to massive traffic jams as people rushed home for fear of violence.\n- Reuters","url":"https://www.nbcnews.com/news/world/u-k-police-release-don-karachi-altaf-hussain-bail-n125186"}
