{"authors":["Liam Deacon"],"date_download":"2018-10-30 22:05:11","date_modify":"2018-10-30 22:05:11","date_publish":"2016-06-23 13:51:42","description":"The population of the UK shot up by half a million last year. Record levels of immigration were the driving factor, as birth rates fell.","filename":"data/vaneerConsumption/UKPopulationUpHalfAMillionInOneYear.json","image_url":"https://media.breitbart.com/media/2016/06/Screen-Shot-2016-06-23-at-14.25.04.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_06_23__1540937111.html","title":"UK Population Up Half A Million In One Year","title_page":"UK Population Up Half A Million In One Year","title_rss":"NULL","source_domain":"breitbart.com","text":"The population of the UK shot up by half a million – 0.8% – in the 12 months of last year. Record levels of immigration were the driving factor, as birth rates and “natural growth” fell.\nThe population of the United Kingdom on the 30th of June 2015 is estimated to be 65,110,000.\nOfficial figures from Office for National Statistics (ONS) revealed the massive 513,000 rise in the number of people living in Britain. The ONS, however, insisted the growth was quite normal and similar to the annual average increase over the last decade.\nThe half a million extra people in the UK was largely the result of a record 335,000 increase in net migration to Britain.\nAn increase in the number of people arriving (up 53,700) and a smaller decrease in those leaving the UK (down 22,300) both contributed to the steep increase in the net migration figure.\n“Natural growth” – births minus deaths – was at its lowest since 2006, falling to 171,100. The birth rate was down 1,900 and a 52,000 increase in the number of deaths has contributed to this slower “natural growth”.\nThe population is also rapidly ageing. A huge 17.8 per cent of the population is now aged 65 and over and 2.3 per cent is more than 85 years old.\nEngland’s population grew most quickly of the four UK countries over the year, while Wales had the slowest growth.\nGrowth was greatest in southern and eastern England. London had the highest population growth, increasing by 1.58 per cent.\nLondon was also the destination of 38 per cent of international migrants arriving in England and Wales, contributing to it having the highest net international migration of all regions at 133,900 – up by 26,500 from last year.\nThe lowest regional population increases in the year were seen in the north east of England and Wales, both growing by 0.23 per cent.\nNo region of England or Wales experienced a population decrease.","url":"https://www.breitbart.com/europe/2016/06/23/uk-population-half-million-one-year-immigration/"}
