{"authors":["Associated Press"],"date_download":"2018-10-23 02:25:39","date_modify":"2018-10-23 02:25:39","date_publish":"2016-01-28 17:11:00","description":"LONDON (AP) — One day last month, an elderly man took a train from London to northwestern England, trekked up an isolated hillside, and died. The man's ident...","filename":"data/vaneerConsumption/UKpoliceseekidentityofmysterymanfounddeadonmoor.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421112_UK-police-seek-identity-mystery-man-dead-moor_1540261539.html","title":"UK police seek identity of mystery man found dead on moor","title_page":"UK police seek identity of mystery man found dead on moor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UK police seek identity of mystery man found dead on moor\nLONDON (AP) — One day last month, an elderly man took a train from London to northwestern England, trekked up an isolated hillside, and died.\nThe man's identity and cause of death are a mystery that has stumped police and intrigued Britain, as detectives probe whether the man's final journey is linked to a deadly plane crash more than 60 years ago.\nThe Greater Manchester Police force says the body of a neatly dressed man of about 70 was found Dec. 12 on a path leading to a rocky outcrop called Indian's Head on wind-swept Saddleworth Moor. In his pockets were return train tickets and 130 pounds ($186) — but no ID. There were no signs of violence and an autopsy was inconclusive.\nThe day before he was found dead, the man had taken a train 200 miles (320 kilometers) from London, then traveled to the village of Greenfield, where he stopped at a pub and asked how to get to the top of Indian's Head. Then he set off on foot, never to return.\nInquiries in the London neighborhood where the man started his journey have yielded no results. Police are scouring missing person reports going back decades and have asked for DNA from relatives of Hugh Toner, a Northern Ireland man who disappeared in 1994.\nDetective Sgt. John Coleman, who is leading the investigation, said Thursday that detectives \"are keeping a completely open mind.\"\nOne line of inquiry is whether there is a link between the man and the 1949 crash near the same spot of a British European Airways DC-3 in which 24 people died. Eight people survived, including a 5-year-old boy named Stephen Evans, and police had suspected Evans might be the dead man.","url":"https://www.dailymail.co.uk/wires/ap/article-3421112/UK-police-seek-identity-mystery-man-dead-moor.html"}
