{"authors":["Frank Langfitt"],"date_download":"2018-10-23 00:54:11","date_modify":"2018-10-23 00:54:11","date_publish":"2017-03-29 00:00:00","description":"British Prime Minister Theresa May is officially triggering Article 50, the process of extricating the U.K. from the European Union.","filename":"data/vaneerConsumption/UKPrimeMinisterBeginsProcessToLeaveEuropeanUnion.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2017_03_29_521884329_u-k-prime-minister-begins-process-to-leave-european-union_1540256051.html","title":"U.K. Prime Minister Begins Process To Leave European Union","title_page":"U.K. Prime Minister Begins Process To Leave European Union : NPR","title_rss":"NULL","source_domain":"npr.org","text":"U.K. Prime Minister Begins Process To Leave European Union\nRACHEL MARTIN, HOST:\nThe United Kingdom has just triggered the process to leave the European Union. The U.K.'s ambassador delivered a letter in Brussels, beginning a two year divorce that will culminate in Britain's departure from the EU. Prime Minister Theresa May spoke earlier in Britain's House of Commons.\n(SOUNDBITE OF ARCHIVED RECORDING)\nPRIME MINISTER THERESA MAY: This is an historic moment from which there can be no turning back. Britain is leaving the European Union. We are going to make our own decisions and our rivals. We are going to take control of the things that matter most to us.\nMARTIN: So Brexit is happening. To help us put all this in perspective, we turn to NPR's Frank Langfitt in London. Hi, Frank.\nFRANK LANGFITT, BYLINE: Hi, Rachel.\nMARTIN: Remind us how this all came to be.\nLANGFITT: Well, it's been - it's already been an extraordinary journey. You've got to go back to June 23 last year. There was this surprise vote to pull out of the EU. It's a trading block of 28 nations. And it came out of - kind of built out of World War II to help keep the peace in Europe and build strong economic ties. And the world was shocked. The pound plummeted.\nAnd the reason that this vote happened is many people in England were uncomfortable with the free flow of immigrants required by the EU. They were angry with the British government. They felt ignored. And they were - a lot of them were unhappy with the effects of globalization. And also, we didn't know this at the time, but it also foreshadowed the election of Donald Trump.\nMARTIN: So the prime minister calls this a historic moment. Can you give it that lens? Give us the historical context of it.\nLANGFITT: She's not exaggerating here. It is huge. Brits are not given to hyperbole. But when I've been talking to historians and political scientists, they go back decades to find something analogous. And so one date they mention is 1956. It was the Suez Crisis. And a little bit of history, Britain and France invaded Egypt to take back the Suez Canal. The U.S. forced them to withdraw. And for Britain, this basically said to them, you know, you're not this big power anymore. You're long decline is continuing. And Brexit, I think for a lot of people in Britain, it's another big turning point.\nMARTIN: So what exactly is at stake here, besides everything? (Laughter).\nLANGFITT: Well, I mean, it really is true. It's the future of the U.K. And let me give you the positive scenario first. I'm looking at the papers this morning here in London. We've got the conservative tabloid, the Daily Mail. They've got a giant headline. It says, \"Freedom!\" with an exclamation point. So the positive view is Brexiteers would tell you Britain's going to be unshackled at being a part of this multilateral organization in Brussels, the EU. They're going to be able to cut better free trade deals with other countries. And we're going to go back to being, here in Britain, a swashbuckling capitalist island nation. That's the way also, you know, Theresa May tries to portray it.\nMARTIN: So what is the worst-case scenario then?\nLANGFITT: The worst-case scenario is really pretty bad, frankly. And let's go to The Guardian. That's a left-leaning newspaper here. They have a very interesting cover. It's a jigsaw puzzle. But the part that would be for Britain - it's a jigsaw puzzle map of Europe. The part that would be Britain is missing. It's just empty. And it says Britain steps into the unknown. And the concern here is that Britain becomes a lot poorer - and that's already kind of happened; the pound is still down more than 16 percent from last summer's vote - and that, frankly, Britain becomes a lot less relevant, which also is happening.\nThe Chinese were courting Britain for a number of years. Now they're not as interested because Britain does - not going to have the influence that it used to have in Europe. And the big thing, though, is Scotland. Yesterday, in the Scottish Parliament, they requested a second independence referendum because the Scots, as you might remember, they voted to stay in the EU. They feel they're being dragged out by England. And if Brexit leads to the disintegration of the U.K., it's hard to see that this would not be seen by historians as a disaster.\nMARTIN: So it's redefining Europe as we have known it. The prime minister says it's a historic moment. But it can seem distant for Americans.\nLANGFITT: Absolutely.\nMARTIN: So remind us why this matters, why Americans should pay attention.\nLANGFITT: Well, the parallels are fascinating. And we've been talking about them over the months. You know, if you remember during the presidential campaign, Donald Trump was for Brexit. He even called himself Mr. Brexit during the campaign, saying he was going to pull off another big upset. And he was right. He did do it.\nThe question now is - these are sort of political gambles here in the United Kingdom, also in the United States, going in a very different direction from the established Western liberal order. And the question is going to be, do they succeed? And do these countries do better, or does this actually lead to declining power for both countries? And frankly, seeing the big, big picture, does that create an even greater opening for China to play a stronger role on the world stage?\nMARTIN: NPR's Frank Langfitt, giving us the big view. Thanks so much, Frank.\nLANGFITT: Happy to do it, Rachel.\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2017/03/29/521884329/u-k-prime-minister-begins-process-to-leave-european-union"}
