{"authors":[],"date_download":"2018-10-22 21:18:11","date_modify":"2018-10-22 21:18:11","date_publish":"2015-02-09 00:00:00","description":"President Obama is expected to submit to Congress what's called an AUMF, an authorization for the use of military force against ISIS, which calls itself the Islamic State.","filename":"data/vaneerConsumption/UkraineIsJust1ForeignPolicyChallengeOnObamasAgenda.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=384875867_1540243091.html","title":"Ukraine Is Just 1 Foreign Policy Challenge On Obama's Agenda","title_page":"Ukraine Is Just 1 Foreign Policy Challenge On Obama's Agenda  : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\nAnd let's get the view from here in Washington now. Now NPR senior editor and correspondent Ron Elving is with me in the studio. Ron, good morning.\nRON ELVING, BYLINE: Good to be here with you, David.\nGREENE: So you were just listening to that. I mean, it sounds like one view in Berlin is that Angela Merkel is sort running the show in these peace negotiations to try and find peace in Ukraine and that President Obama has allowed her to play that role. Is that fair or something the White House might quibble with?\nELVING: Fair statement. Quibble or not, the White House would have to say that they believe that the front-line states of Europe, such as Germany, need to be the people who are negotiating this with Russia. They trade more with Russia. They stand to suffer if there is conflict with Russia. But in the end, anytime the United States is involved at all, we are a kind of leading player. And ultimately, the military threat that can be held over Putin's head has to come from the United States eventually. So this is a message that is perhaps more veiled in what the White House is doing.\nGREENE: But the backdrop here - I mean, there are lawmakers who are pushing the president to send more weapons to Ukraine and also be more assertive in general. I mean, at this Munich Security summit over the weekend, a number of senators were there - Republicans John McCain, Ted Cruz, Lindsey Graham - you know, with their own take on what the U.S. and the White House should be doing.\nELVING: That's right. There were a number of people there with past or current or future interest in personally being president themselves, but who are, after all, U.S. senators. They're involved in policy. They want to be part of the international discussion on issues such as security. They have a lot to learn in these kinds of discussions, and they have a lot to offer. So they have a reason to be there.\nThey also want to push a policy position. They see a time when the United States might not emphasize restraint in negotiation quite so much as it has under the Obama administration. And they prefer that as a vision and they foresee that, so they want to get that message across to some of our allies and also get that message across to Vladimir Putin. And then finally, of course, as I mentioned, some of these people are actively exploring being presidential candidates. And so they're, in a sense, contesting with each other to be the leader of the hawkish party.\nGREENE: When it comes to sort of Obama's relationship with Congress and foreign policy, let me ask you about something else that the president's expected to submit to Congress. It's called - I love Washington acronyms - an AUMF - an authorization for the use of military force against ISIS, or ISIL as the White House calls it. Why is this significant?\nELVING: The president has been, after all, pursuing quite a bit of military action against ISIS or ISIL...\nGREENE: I mean, there have been U.S. airstrikes already.\nELVING: Absolutely, and these airstrikes have been going on for many months. And the president and White House have been relying upon past authorizations for military force from the Iraq and Afghanistan and war on terror years. That may or may not be - it's a debatable point whether or not that's legally adequate, but politically the president did not want to ask for a specific authorization for these actions last year in the electoral atmosphere of 2014.\nNow going forward, it would probably suit the president's political purposes rather well to get Congress to explicitly authorize him to do some of the things that Congress has been urging him to do anyway. And there, of course, will be a great debate over whether or not this includes the use of boots on the ground - actual military force of an infantry kind, sending in armor, engaging in the way we did in Iraq in 2003 and thereafter. So the Congress will look somewhat divided when it talks about all this. And ultimately, probably because the Republicans are pushing for stronger action, the president will get that authorization, and that will work in his favor internationally and also in terms of domestic politics.\nGREENE: This seems like a really important moment. I mean, there's going to be a big debate on the Hill in Washington about sort of how the United States confronts terrorism, confronts ISIS, this incredibly awful new threat.\nELVING: Some people will remember the 1991 debate about whether or not we were going to launch that first Iraq war - Persian Gulf War, as it was called - drive them out of Kuwait. That was quite a fine moment, actually, for Congress. Congress seemed very serious. They had a reasoned debate. It went on in the House and Senate. They had votes, and the president proceeded with that authority. That was not a bad way to make policy. I think a lot of people look back on that rather nostalgically, and perhaps Congress will rise to that again.\nGREENE: That's senior editor and correspondent Ron Elving with me in the studio in Washington. Ron, thanks as always.\nELVING: Thank you, David.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=384875867"}
 and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2015/02/09/384875867/politics-in-the-news"}
