{"authors":["Darren Boyle For Mailonline"],"date_download":"2018-10-22 23:51:38","date_modify":"2018-10-22 23:51:38","date_publish":"2016-01-28 13:11:47","description":"Gerogiy Kosilov, 29, from the Ukraine, went for a ride in a friend's Smart car when he decided the vehicle's rear-engine configuration would make it ideal for a conversion into a mini 4x4 off-roader.","filename":"data/vaneerConsumption/UkrainianpetrolheadconvertshisSmartcarintoafearsomeoffroader.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30A9767D00000578-0-image-a-20_1453984597888.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420894_Is-Smart-idea-Ukrainian-petrolhead-converts-small-car-fearsome-roader_1540252298.html","title":"Ukrainian petrolhead converts his Smart car into a fearsome off-roader","title_page":"Ukrainian petrolhead converts his Smart car into a fearsome off-roader | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Ukrainian petrol head has managed to an unimpressive Smart car into a fearsome four-wheel-drive off-roader.\nGerogiy Kosilov, 29, from the Ukraine, went for a ride in a friend's Smart car when he realised the two-seater motor had the turbo-diesel engine in the back, rather than the front - similar to an off road vehicle.\nIt gave him the idea to see how far he could push the mini motor - and within days, he'd been out and bought himself a car and a set of off-road wheels - with impressive results.\nPetrol head Gerogiy Kosilov managed to turn this Smart car, pictured, from a rather sedate city runaround into a fearsome off-roader, with extra large wheels and new components harvested from other vehicles\nWhen inside a friend's Smart Car Mr Kosilov noticed that the vehicle had a small diesel engine in the rear\nAccording to Mr Kosilov, he used parts from a Volkswagen, Honda and a Mitsubishi to make his dream car\nMr Kosilov said: 'Loads of people told me they didn't believe that I could turn a Smart car into an off-roader, but that made me even mre determined.\n'They aren't big cars and they don't have a particularly mighty engine but it's as good as any 4x4 for driving through mud and snow.\n'I used parts from a Volkswagen, Honda and Mitsubishi while building it, and threw away anything in the car that wasn't essential, to make it as light as possible.\n'The wheels I put on gives it 36cm of clearance over the ground.\n'All my friends were so impressed when it was finished, and it's great fun to drive!'\nMr Kosliov said his home made machine is just as good as large 4x4s at driving through mud and snow\nThe Ukrainian petrol head said friends had told him that his plan was impossible but he decided to press on\nThe car was fitted with large wheels, giving it 36 inches of clearance over the ground... vital in an off roader\nSince completing his task, Mr Kosilov, pictured standing on his car, says his friends are very impressed\nThe car even has a powerful winch on the front in case the minture off roader gets stuck in the mud\nUnlike full sized 4x4s, this smart car can be stored in the corner of a garage without taking much space\nIn case of emergencies on the trail, the smart car has a spare tyre strapped to the roof","url":"https://www.dailymail.co.uk/news/article-3420894/Is-Smart-idea-Ukrainian-petrolhead-converts-small-car-fearsome-roader.html"}
