{"authors":[],"date_download":"2018-10-30 20:54:15","date_modify":"2018-10-30 20:54:15","date_publish":"2016-09-29 08:12:15","description":"A sombre Ukraine on Thursday marks 75 years since the World War II slaughter of some 34,000 Jews on the outskirts of Kiev.","filename":"data/vaneerConsumption/UkraineMarks75YearsSinceBabiYarMassSlaughterofJews.json","image_url":"https://media.breitbart.com/media/2016/09/Babi-Yar.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_29__1540932855.html","title":"Ukraine Marks 75 Years Since Babi Yar Mass Slaughter of Jews","title_page":"Ukraine Marks 75 Years Since Babi Yar Mass Slaughter of Jews","title_rss":"NULL","source_domain":"breitbart.com","text":"KIEV (AFP) – A sombre Ukraine on Thursday marks 75 years since the World War II slaughter of some 34,000 Jews on the outskirts of Kiev, one of the largest massacres of the Holocaust.\nThe carnage by Nazi forces at the Babi Yar ravine has caused years of soul-searching and debate in Ukraine over the participation of local collaborators in the killings and atrocities that followed.\nIsraeli President Reuven Rivlin was meant to attend a memorial ceremony led by Ukrainian leader Petro Poroshenko and the European Union’s Donald Tusk on Thursday evening.\nBut he cut short his visit to Kiev due to the death of Israeli statesman Shimon Peres — although not before drawing criticism for “undiplomatic” comments about Ukrainians’ role in the Babi Yar slaughter.\nThe anniversary comes at a sensitive time for Ukraine, as a confrontation with Russia has sparked a rising tide of nationalism that has increasingly lionised some groups accused of WWII crimes against the Jews.\nMembers of the Ukrainian Insurgent Army (UPA) collaborated with Hitler’s generals in the early years of the war, because they felt the Nazis could help them win independence from the Soviet Union’s even-more-hated Stalin.\nRivlin did not shy away from telling Ukrainian lawmakers in Kiev on Tuesday that “many of the crimes were committed by Ukrainians” during the Holocaust.\n“The fighters of UPA were especially prominent,” said Rivlin.\n“They victimised the Jews, killed them, and in many cases reported them to the Nazis.”\nRivlin’s comments led the Ukrainian parliament’s deputy speaker to condemn his remarks as “undiplomatic”.\n“Certain statements of our esteemed guest were out of place in these days of mourning, with them spoken in the parliament of a country that today is also fighting for its independence,” Iryna Gerashchenko said.\nGerashchenko was referring to a 29-month pro-Russian revolt that has claimed 9,600 lives in the east of Ukraine.\nMoscow denies sparking the war in reprisal for the 2014 ouster of Ukraine’s Russian-backed leader and its western neighbour’s decision to seek future membership in the European Union and NATO.\n– ‘Don’t look back’ –\nThe Nazis helped by local auxiliaries exterminated the Jews between September 29 and 30 of 1941 as they blitzed their way toward Moscow and captured major cities on the western flank of the former Soviet Union.\nThe last survivor of that carnage still alive in Kiev told AFP that Jews comprised about a quarter of the city’s 800,000-strong population at the time.\nAbout 100,000 live in the city today out of a population of around 2.8 million and Yiddish, once widely spoken among Ashkenazi Jews, is almost never heard on the streets.\nBabi Yar is now rarely mentioned by locals. But the horror of those dark days is still vividly etched in the memories of some.\n“We were gathered and sent along ‘the path to death’,” Raisa Maistrenko, 78, said in an interview at what today is a green ravine scattered with Soviet-era monuments and a Jewish Menorah candelabrum put up when the empire was crumbling in 1991.\nJust 29 people managed to escape execution by either falling into the mass grave before being shot in the back or wearing crosses to hide their true religion.\nMaistrenko’s 18 relatives never returned from Babi Yar.\n“All the Jews decided to go because they thought they would be evacuated by train as the railway station was nearby. Nobody could possibly assume there would be a mass execution,” she recalled in hushed tones.\n“We heard the shooting behind us, but (my) granny — she kept holding me — did not look back and kept running until she fell exhausted among the graves in a nearby cemetery.”\nMaistrenko said they were hiding there until sunset before finding their way back home under the cover of darkness.\nThere — to their relief — no one reported them to the Nazis.\n“There were two big houses in our courtyard filled with multi-national families, but all were very friendly to each other,” Maistrenko said.","url":"https://www.breitbart.com/middle-east/2016/09/29/ukraine-marks-75-years-since-babi-yar-mass-slaughter-jews/"}
