{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:16:53","date_modify":"2018-10-30 22:16:53","date_publish":"2016-12-14 00:00:00","description":"Lucky Labs is looking to spend $20 million to $30 million on at least two acquisitions across Britain, Latvia, and Germany.","filename":"data/vaneerConsumption/UkrainesLuckyLabsplansacquisitionsinBritainLatviaandGermany.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ukraines-lucky-labs-plans-acquisitions-in-britain-latvia-and-germany-2016-12_1540937813.html","title":"Ukraine's Lucky Labs plans acquisitions in Britain, Latvia, and Germany","title_page":"    Ukraine's Lucky Labs plans acquisitions in Britain, Latvia, and Germany - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Lucky Labs. Lucky Labs LONDON — A Ukrainian tech company hit by raids from security forces in recent months is planning to spend tens of millions on acquisitions across Europe.\nLucky Labs, which develops software for the gaming and gambling industries, is looking to buy up companies worth between $20 million (£15.8 million) and $30 million (£23.7 million) in Britain, Latvia, and Germany.\nA company spokesperson said the number of deals will \"likely be in the low to mid-single digits\" and will be funded from private cash reserves. Lucky Labs is targeting startups in the gaming and gambling sector.\nFounded in 2006 and headquartered in Kiev, Lucky Labs employs around 500 staff and has developed more than 100 games and products for companies like Playson and AdWise.\nRustam Gilfanov, Lucky Labs cofounder, says in a press release announcing the acquisition plans: \"We are keen to continue growth into international markets with a focus on the UK, Germany and Latvia, where we have noted particularly ambitious start-ups doing some fantastic things.\"\nA company spokesperson said Brexit has not put off Lucky Labs and said the fall in the pound since June's referendum on EU membership, in fact, made Britain more attractive to invest in.\nThe spokesperson said: \"Regardless of Brexit the UK is an attractive target market for us due to the quality of the software companies here, but, yes a cheaper pound is certainly an added incentive.'\"\nLucky Labs has been hit by Ukrainian security service raids in recent months. Authorities have accused the company of financing terrorism and the raids, in which servers were seized, appear to be part of a wider crackdown on tech businesses in Ukraine.\nA spokesperson for Lucky Labs said the accusations were unfounded and were a symptom of a business dispute. The spokesperson told Business Insider: \"There is no truth whatsoever to the allegations against the company. Mr Tokarev [Lucky Labs' cofounder] and Gilfanov are in the midst of a longstanding dispute with a former business partner who is believed to be behind this negative and libellous media campaign. Lucky Labs has full confidence that the company will be cleared of any wrongdoing.\"","url":"https://www.businessinsider.com/ukraines-lucky-labs-plans-acquisitions-in-britain-latvia-and-germany-2016-12"}
