{"authors":[],"date_download":"2018-10-22 20:39:48","date_modify":"2018-10-22 20:39:48","date_publish":"2014-05-02 19:16:29","description":"The Ukraine Interior Ministry confirms at least 31 have died in the southern city of Odessa.","filename":"data/vaneerConsumption/UkraineClashesTurnDeadlyasDozensKilledinFire.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/417026/140502-odessa-fire-tnc-1517_b4ebae0aae3e0072f21f716a38d9aba0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_ukraine-clashes-turn-deadly-dozens-killed-fire-n95916_1540240788.html","title":"Ukraine Clashes Turn Deadly as Dozens Killed in Fire","title_page":"Ukraine Clashes Turn Deadly as Dozens Killed in Fire ","title_rss":"NULL","source_domain":"nbcnews.com","text":"At least 31 people were killed in a fire that broke out amid clashes between pro-Russia demonstrators and government supporters in the southern Ukrainian city of Odessa.\nThe port city until now has not been a deadly flashpoint in the unrest that has plagued the eastern section of Ukraine during the tug-of-war between Russia and the West.\nBut violence erupted when protesters calling for a united Ukraine marched through the streets and were met by pro-Russian activists, the Kiev-based UNIAN news agency and the Ukrainian online newspaper Ukrainskaya Pravda reported.\nRiot police stepped in as the crowds threw flares and light bombs and fired stones in slingshots. Several people were reported killed, but the toll rose sharply after a trade union building was set ablaze.\nWith flames roaring out of the doors and windows, occupants perched on ledges waiting for help.\nThe flare-up came as Ukraine troops were attempting to drive pro-Russian separatists out of Slovyansk, one of several cities across the east occupied by protesters opposing the new Kiev government.\nLike Slovyansk and the Russian-annexed peninsula of Crimea, Odessa has a significant number of Russian speakers and played a prominent role in Russian history.\nAll of those regions formed the power base for former President Viktor Yanukovych, whose ouster led to the formation of the current administration in Kiev.\nVideo footage of the clashes showed riot police attempting to control the crowds, some of whom had masks, shields and clubs similar to those seen in the violent Kiev protests that led to the fall of Yanukovych in February.\n\"The violence and mayhem that led to so many senseless deaths and injuries is unacceptable,\" said Marie Harf, a spokeswoman for the U.S. State Department.\nWithout mentioning Russia by name, Harf said violence and \"efforts to destabilize the country must end.\"\n— Tracy Connor, Alexander Smith and Albina Kovalyova","url":"https://www.nbcnews.com/storyline/ukraine-crisis/ukraine-clashes-turn-deadly-dozens-killed-fire-n95916"}
