{"authors":[],"date_download":"2018-10-22 22:31:23","date_modify":"2018-10-22 22:31:23","date_publish":"2014-05-10 21:39:09","description":"Ukraine warns pro-Russian regions about voting for self-rule on Sunday.","filename":"data/vaneerConsumption/UkraineWarnsofAbyssasEastApproachesSelfRuleVote.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/434356/140510-mariupol-1745_56e059b70cff88bb781154c4129fdf5e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_ukraine-warns-abyss-east-approaches-self-rule-vote-n102271_1540247483.html","title":"Ukraine Warns of 'Abyss' as East Approaches Self-Rule Vote","title_page":"Ukraine Warns of 'Abyss' as East Approaches Self-Rule Vote","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMARIUPOL/SLAVIANSK, Ukraine — Ukrainian leader Oleksander Turchinov warned pro-Russian eastern regions they would be stepping into the abyss if they voted for self-rule on Sunday in a referendum that has raised Western fears of a slide to full civil war.\nBarricades of tires and scrap metal blocked streets in the port city of Mariupol and in Slaviansk, centers of an uprising that has unleashed the worst crisis between the West and Russia since the Cold War.\nBallot papers have been printed with no security provision and the meaning of the question — asking voters if they support state 'self-rule' for the People's Republic of Donetsk — is, perhaps deliberately, unclear.\nSome see it as an endorsement of autonomy within Ukraine, some a move to independence and others a nod to absorption by Russia in the wake of Crimea, which Moscow annexed in March.\nNone the less the vote is going ahead despite a call by Russian President Vladimir Putin on Wednesday to postpone it — a move that briefly raised hopes for an easing of tension. Western leaders have accused Putin of destabilizing Ukraine, and Washington criticized as 'provocative' a trip he made to Crimea on Friday.\nTurchinov said secession from Ukraine \"would be a step into the abyss for these regions. ... Those who stand for self-rule do not understand that it would mean complete destruction of the economy, social programs and life in general for the majority of the population.\"\nThe German Chancellor and French president have said on Saturday they would back further sanctions against Russia, if Ukraine’s presidential election on May 25 fails to go ahead because of eastern forces.\nThe eastern uprising follows the toppling in February of Ukrainian President Viktor Yanukovich.\nVoting is from 8 a.m. (0100 EST) to 10 p.m. (1400 EST). The ballots will then be counted overnight and results sent to Donetsk in the morning.\n— Reuters","url":"https://www.nbcnews.com/storyline/ukraine-crisis/ukraine-warns-abyss-east-approaches-self-rule-vote-n102271"}
