{"authors":["Associated Press"],"date_download":"2018-10-23 04:44:19","date_modify":"2018-10-23 04:44:19","date_publish":"2017-03-16 15:54:31","description":"MOSCOW (AP) - Ukrainian President Petro Poroshenko signed an order Thursday imposing sanctions on Russian-owned banks in Kiev's latest protest against...","filename":"data/vaneerConsumption/UkraineimposessanctionsonRussianbanks.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320814_Ukraine-imposes-sanctions-Russian-banks_1540269859.html","title":"Ukraine imposes sanctions on Russian banks","title_page":"Ukraine imposes sanctions on Russian banks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MOSCOW (AP) - Ukrainian President Petro Poroshenko signed an order Thursday imposing sanctions on Russian-owned banks in Kiev's latest protest against Russian support for separatists in the east of the country.\nThe move will stop Ukrainian affiliates of three Russian financial institutions from moving capital abroad, according to a statement on the Ukraine presidency website.\nPoroshenko appears in recent days to have been forced into decisions under pressure from nationalist protestors, who have increasingly shaped the country's political agenda.\nRussian-owned banks in Kiev were vandalized this week by activists.\nThe banks affected by Poroshenko's order are Russia's largest bank, state-owned Sberbank, its second largest, state-owned VTB, and Vnesheconombank, the state-owned development bank.\nVTB may incur several hundred million dollars of losses because of the restrictions, the bank's head Andrei Kostin said Thursday in Moscow, the Tass news agency reported.\nSberbank said in a statement that they were \"disappointed\" with the decision.\nEarlier this week, Ukraine imposed a road and rail blockade on rebel-held areas of the country that is likely to cause severe economic disruption to both sides.\nFighting between government forces and Russian-backed rebels in Ukraine has killed more than 9,800 people since April 2014.","url":"https://www.dailymail.co.uk/wires/ap/article-4320814/Ukraine-imposes-sanctions-Russian-banks.html"}
