{"authors":[],"date_download":"2018-10-22 22:42:27","date_modify":"2018-10-22 22:42:27","date_publish":"2014-05-12 13:49:26","description":"After a contentious referendum in eastern Ukraine this weekend, the country has moved closer to complete disintegration and civil war.","filename":"data/vaneerConsumption/UkraineMovesClosertoCivilWarAfterFlawedReferendum.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/436116/140512-ukraine_pro-russian-pmc-1004_b1f9236c94ee15b629f767a2b8715a1f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_ukraine-moves-closer-civil-war-after-flawed-referendum-n103036_1540248147.html","title":"Ukraine Moves Closer to Civil War After Flawed Referendum","title_page":"Ukraine Moves Closer to Civil War After Flawed Referendum","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nUkraine is a country fraying at the seams. With a contentious referendum in the East of the country now over, Ukraine has moved closer to complete disintegration and civil war.\nThis is a News Analysis from NBC News’ Chief Global Correspondent Bill Neely.\nCarried out amid deadly clashes, this was no ordinary referendum.\nIt was run by separatists, who decided the question on the ballot paper. They also counted the votes and announced a result –- 89 percent in favor of separating from Ukraine –- though what that means remains unclear: the ballot left open the possibilities for independence, separation or unity with Russia.\nHow the separatists arrived at that result is even less apparent: There were no valid electoral lists, many ballot papers were photocopies and there were reports of voters casting multiple ballots. There also were no international observers.\nDespite all of this the separatists claimed a 75 percent turnout –- hard to imagine given that there were so few polling stations. Mariupol, a city of half a million people, had just four voting centers.\nMany citizens of Mariupol and other cities in eastern Ukraine boycotted the vote. Others, shaken by recent spasms of violence, were too scared to cast their ballots.\nRegardless –- the referendum is now recorded as fact, drawing further lines between all sides in an already tense climate.\nUkraine’s President Oleksandr Turchynov says the vote was a farce. The problem is, neither he nor his government were voted into office – they took power by force.\nHe and the separatists in the East are taking turns calling each other illegitimate, branding each move the other takes as unlawful.\nThat tit-for-tat exchange echoes beyond the borders of Ukraine: The U.S. and European Union don’t recognize the result of the referendum. But Russia does.\nAmid the diplomatic – or undiplomatic – war of words, the two regions of Ukraine that voted are pulling away from Kiev fast. Sometime this week, one - or both - will declare themselves independent.\nWith no agreed ruler, no law and no order, eastern Ukraine is in chaos.\nDead bodies are piling up in cities and towns across the region. Separatists are facing off against government soldiers, each side buffeted by sophisticated weaponry and armored vehicles.\nThe conflict is moving into a more dangerous phase, where separatists declare Ukraine’s soldiers illegal occupiers of the land they see as their own country.\nThe war of words is increasingly reflected in deadly clashes on the ground, and the referendum risks adding fuel to the fire.\nWith the region more of a tinderbox today than it was before the weekend’s vote, all eyes are on Russian President Vladimir Putin for his next move. No-one is clear what his endgame is or knows what he is thinking.\nWill he decide the time is right to “restore order” on his border? There are some analysts who think he won’t invade the East of Ukraine, because he doesn’t need to, seeing his goal as simply to destabilize a regime in Kiev he deems to be illegal.\nBut no-one is very confident of that. After all, Putin has just returned from the new Russian territory of Crimea where he was hailed a hero and liberator.\nPower and conquest may push him further into Eastern Ukraine.","url":"https://www.nbcnews.com/storyline/ukraine-crisis/ukraine-moves-closer-civil-war-after-flawed-referendum-n103036"}
