{"authors":[],"date_download":"2018-10-22 22:58:19","date_modify":"2018-10-22 22:58:19","date_publish":"2014-05-13 11:39:08","description":"Pro-Russian separatists have slapped travel bans on the president and several European leaders.","filename":"data/vaneerConsumption/UkraineSeparatistsSlapTravelBanonPresidentBarackObama.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/438171/140513-obama-ukraine-740a_3c7a3f91804b061fa8d7ed211703f84e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_ukraine-separatists-slap-travel-ban-president-barack-obama-n103956_1540249099.html","title":"Ukraine Separatists Slap Travel Ban on President Barack Obama","title_page":"Ukraine Separatists Slap Travel Ban on President Barack Obama","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIf Barack Obama was thinking of traveling to eastern Ukraine anytime soon, he may want to take another look at his plans.\nThe president was on Tuesday slapped with sanctions banning him from traveling to the region by Ukrainian separatists who want to come under Russia's rule.\nThe separatist splinter state, which calls itself the Donetsk People's Republic, also declared sanctions against German Chancellor Angela Merkel, European Union Foreign Policy Chief Catherine Ashton, and British Prime Minister David Cameron.\nThe republic announced its borders and airspace were closed to Obama and Merkel for \"conniving with so-called acting 'President' of Ukraine Oleksandr Turchinov.\"\nIt also criticized the leaders for using the term \"anti-terrorist\" when referring to an operation by Ukraine's government to dislodge separatists from strongholds in cities across the east.\nThe statement came after the group asked to be annexed by Russia, following a controversial referendum backing the move and mirroring the path of the southern peninsula of Crimea in March.\nAshton was accused in the statement of failing to perform her diplomatic duties and giving freedom to \"neo-Nazi\" groups to act with \"impunity.\" The statement said this failure led to violence in the southwestern port city of Odessa, in which dozens died in a fire in the local trade union building.\nCameron was included on the sanctions list on a provisional basis, the statement added. The British prime minister was urged to \"think about his attitude towards Kiev junta, especially in the light of traditionally good relations between the Great Britain and Donbass.\"\nThe mention of good relations was a reference to an agreement from 1870 between the Russian Empire and British businessman John Hughes, who started a metal works in the area and founded the city of Donetsk.\nThe U.S. and European Union themselves have imposed several rounds of sanctions in an attempt to influence what they see as Russia’s belligerent actions during the crisis. These have amounted to travel bans and asset freezes on government officials in Moscow and Crimea, as well as on oligarchs in Vladimir Putin’s so-called “inner circle.”\n- Maria Stromova and Alexander Smith","url":"https://www.nbcnews.com/storyline/ukraine-crisis/ukraine-separatists-slap-travel-ban-president-barack-obama-n103956"}
