{"authors":[],"date_download":"2018-10-22 20:37:13","date_modify":"2018-10-22 20:37:13","date_publish":"2014-05-02 14:26:24","description":"The clashes came as Ukraine troops attempted to dislodge pro-Russian separatists from the east of the country.","filename":"data/vaneerConsumption/UkraineViolenceSpreadsAtLeastOneKilledinOdessaRiots.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/416816/140502-odessa-protests-mn-1416_1b862a963f94bd6c315afd26d078f3b8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_ukraine-violence-spreads-least-one-killed-odessa-riots-n95626_1540240633.html","title":"Ukraine Violence Spreads: At Least One Killed in Odessa Riots","title_page":"Ukraine Violence Spreads: At Least One Killed in Odessa Riots","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nUkraine's tug-of-war between Russia and the West lurched to the central southern coastal city of Odessa on Friday, with around a thousand rival protesters involved in violent clashes in the city center.\nA demonstration calling for the country's unity marched through the streets and was met by pro-Russian activists, Kiev-based UNIAN news agency and the Ukrainian online newspaper Ukrainskaya Pravda reported.\nRiot police stepped in as the crowds threw flares and light bombs, and fired stones in slingshots. The English-language Kiev Post reported that one person had been killed in the clashes, showing a photograph of a body wrapped in the Ukrainian flag.\nThe Kiev Post said most of the pro-Russian group were fans of the local football team.\nThe flare-up came as Ukraine troops were attempting to drive pro-Russian separatists out of Slovyansk, one of several cities across the east occupied by protesters opposing the new Kiev-government.\nLike Slovyansk and the Russian-annexed peninsula of Crimea, Odessa has a significant number of Russian speakers and played a prominent role in Russian history.\nAll of these regions formed the power base for former President Viktor Yanukovych, whose ouster lead to the formation of the current administration in Kiev.","url":"https://www.nbcnews.com/storyline/ukraine-crisis/ukraine-violence-spreads-least-one-killed-odessa-riots-n95626"}
