{"authors":["John Hayward"],"date_download":"2018-10-30 20:35:16","date_modify":"2018-10-30 20:35:16","date_publish":"2015-03-06 21:03:19","description":"A high school biology teacher from Manchester named Jamshed Javeed was sentenced to six years in prison on for his plan to join up with ISIS.","filename":"data/vaneerConsumption/UKScienceTeacherSentencedto6YearsforTryingtoJoinISIS.json","image_url":"https://media.breitbart.com/media/2015/03/Jamshed-Javeed-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_06__1540931716.html","title":"UK Science Teacher Sentenced to 6 Years for Trying to Join ISIS","title_page":"UK Science Teacher Sentenced to 6 Years for Trying to Join ISIS | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A 30-year-old high school biology teacher from Manchester named Jamshed Javeed was sentenced to six years in prison on Thursday for his plan to join up with ISIS.\nHe was arrested in December 2013 on the verge of departing for Syria—a plan that failed, in no small part, because of his family’s remarkably persistent efforts to stop him.\nAs the UK Daily Mail relates, Javeed was considered a “settled, moderate Muslim” until he was radicalized by the online sermons of fire-breathing imams such as American-born al-Qaeda guru Anwar al-Awlaki, who eventually ran afoul of an even more fiery missile, launched by a CIA drone in Yemen.\nBy the time he was ready to roll out for Syria, Javeed had already helped his younger brother Mohammed and three of his fellow students travel there to join the Islamic State. (His brother and one of the other men evidently died fighting for the Islamic State.)\nJaveed’s own determination to enlist with ISIS was not deterred by the fact that he already had one child, and his wife was pregnant again. His mother called him a “murderer” for his role in seeing young Mohammed off to his doom and said of the Islamic State’s theology, “If this religion doesn’t allow respect for a mother and father this is not the religion of my prophet, peace be upon him. Yours is a different religion.” His father threatened to testify against him in court, a threat that didn’t seem to rattle Jamshed Javeed, because he was under the mistaken impression that conspiring to support ISIS was not a crime.\nHis wife grew suspicious when Javeed started carrying his previously untouched passport around, suspecting that he was planning to abandon her and the kids so he could jet off to Syria. In one of her more poignant rebukes, she chastised him via text message for refusing to “take on board anyone’s opinion unless I’ve got a gun and I’m in Syria.” She also accused him of ignoring her opinions in favor of the guidance given in Awlaki’s book, Constants in the Path of Jihad.\nThe family tried hiding his passport and jihad supplies to stop him, but he forged a friend’s signature to get a replacement copy, which he had mailed to the school where he worked to keep his family from intercepting it. By then, the authorities were on to him, and he was arrested after booking a plane flight to Turkey.\nThe judge and police praised Javeed’s family for their “resolve and courage” in trying to thwart his plans, although his mother and father both begged for leniency at the trial, insisting he was not a terrorist threat to the UK. His father portrayed him as an idealist who wanted to help the Syrian people fight off the regime of Bashar Assad and said he acted to keep his son from getting swallowed up in an increasingly brutal “sectarian civil war.” Javeed’s mother praised him as “kind-hearted, generous, and loving.”\nHe didn’t sound very kind-hearted, generous, or loving on the recordings made of the family arguments by one of his sisters, and prosecutors argued that “references to gruesome images of severed heads on his social media profiles showed he was ready to kill and die.” The judge concluded that he had a “violent jihadist mindset” and dismissed arguments of his idealistic interest in the welfare of the Syrian people by noting that he never expressed any interest in supporting humanitarian aid projects.\nIt was also noted that, according to a text message exchange with the man he planned on traveling to Syria with, Javeed’s wife wanted to go there with him; his comrade advised him to tell her he would check out accomodations in the Islamic State, get some paramilitary training done, and send for her after he was settled in.\nAn unsettling postscript to the story involves the text messages Jamshed received from his younger brother Mohammed after the latter made his journey to join ISIS. Like a disturbingly large number of Islamic State recruits, Mohammed didn’t seem to have much trouble slipping through Turkey and getting across the border into Syria.\nHe mentioned that some Turks he encountered tried to talk him out of joining ISIS by recommending al-Qaeda’s operation in Syria, Jabhat al-Nusra, instead. Jamshed responded, “They would say that! Ha! Don’t get tempted by the FSA! Ha!” That’s a reference to the Free Syrian Army, the “moderate” rebel organization American policymakers have long touted as a white-hat alternative to ISIS and al-Qaeda in the struggle to overthrow Assad. Evidently no one in jihad-world has a very high opinion of the FSA’s capabilities.","url":"https://www.breitbart.com/national-security/2015/03/06/uk-science-teacher-sentenced-to-6-years-for-trying-to-join-isis/"}
