{"authors":["Liam Deacon"],"date_download":"2018-10-30 18:40:08","date_modify":"2018-10-30 18:40:08","date_publish":"2016-05-03 16:58:11","description":"A Scottish school where every single one the 222 students were born abroad is appealing for extra money to teach English.","filename":"data/vaneerConsumption/UKSchoolWith100ForeignBornStudentsBegsForMoneyToTeachEnglish.json","image_url":"https://media.breitbart.com/media/2016/05/Screen-Shot-2016-05-03-at-17.17.46.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_05_03__1540924808.html","title":"UK School With 100% Foreign Born Students Begs For Money To Teach English","title_page":"UK School With 100% Foreign Born Students Begs For Money To Teach English","title_rss":"NULL","source_domain":"breitbart.com","text":"A Scottish school where every single one the 222 students were born abroad is appealing for extra money, as it struggles to teach the children who cannot speak English.\nAt Annette Street primary school in Glasgow, 181 of the school’s 222 students are recent arrivals from Romania and Slovakia – mostly Roma gipsy. The rest are believed to be of South Asian origin.\nThe head teacher, Shirley Taylor, has now launched an online crowdfunding campaign, appealing for new playground and classroom equipment to help teach the kids.\nMrs. Taylor said the school suffered because most parents do not speak English and some of the children, as old as 10-years old, arrive having never been to school before.\nSpeaking on a Youtube video to launch the campaign, she says the school is in an “area where by tradition, over many decades, migrant families come to settle in Scotland”.\nShe later explained how Eastern Europeans had colonised the area: “They settled in and then started communicating with families back home, and word got out for others to come to Annette Street Primary, and so they did.\n“And now the same thing is happening with our Romanian families. Most come from the same area and word has got back to their extended families that if you go to Glasgow, you should go to Annette Street.”\nBecause of the Children’s backgrounds, “many of our children come to us having had little or no experience of school and unable to speak English” and live in “poverty and overcrowding”, she explains.\n“As a result of such fundraising activities most schools can provide opportunities and equipment to complement the curriculum. As you can imagine, the parents and the children in my school just don’t have the linguistic or financial capacity to do this”, she says.\n“On top of that, they may be hungry because there was no money to buy breakfast or tired because they have had interrupted sleep from having to share a bed with three other siblings, or maybe can’t concentrate due to terrible toothache, because they and family have never had access to dental care.\n“These are challenges and barriers faced on a daily basis by children at Annette Street”.\nA spokesman for Glasgow City Council told the Evening Times said the “diversity” was only a good thing:\n“The diversity and many cultures in our classrooms across the city make Glasgow the wonderful city that we have become known for.\n“Our children and young people can all learn from each other. Almost 140 languages are spoken in our schools in Glasgow. Working and studying together brings tolerance.”","url":"https://www.breitbart.com/europe/2016/05/03/uk-school-with-100-forign-born-students-begs-for-money-to-teach-english/"}
