{"authors":["Associated Press"],"date_download":"2018-10-23 03:11:10","date_modify":"2018-10-23 03:11:10","date_publish":"2016-01-29 17:56:08","description":"BRUSSELS (AP) — British Prime Minister David Cameron warned Friday that his nation and the European Union still have serious hurdles to overcome ahead of a m...","filename":"data/vaneerConsumption/UKsCameronStillplentyofworktodoatEUreformtalks.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:dbec360df796487b9212629580d976c0-4PuZeKVXE7cd9005b2c876cde7cb-329_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422488_Cameron-kicks-high-stakes-weekend-EU-reform-talks_1540264270.html","title":"UK's Cameron: Still plenty of work to do at EU reform talks","title_page":"UK's Cameron: Still plenty of work to do at EU reform talks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UK's Cameron: Still plenty of work to do at EU reform talks\nBRUSSELS (AP) — British Prime Minister David Cameron warned Friday that his nation and the European Union still have serious hurdles to overcome ahead of a mid-February summit at which he hopes to cement reforms that will persuade British voters to stay in the EU.\nAfter talks with top EU officials, Cameron said the proposal for reform currently on the table is \"not good enough.\"\n\"It needs more work, but we are making progress,\" he said.\nBritish Prime Minister David Cameron, right, walks with European Commission President Jean-Claude Juncker prior to a meeting at EU headquarters in Brussels on Friday, Jan. 29, 2016. British Prime Minister David Cameron is kicking off a high-stakes weekend of diplomatic negotiations on the European Union reforms with a visit to EU headquarters. (AP Photo/Virginia Mayo)\nAt the same time, Poland again balked at Britain's desire to place temporary curbs on benefits for EU migrants in the U.K. The 28-nation bloc values the free flow of its citizens to work and live among member nations — but Britain's Conservative government says hundreds of thousands of people from Eastern Europe who have flocked to the U.K. are straining schools, hospitals and social services.\n\"We will not accept solutions that would lead to the discrimination of our citizens in any EU member nation,\" Polish Foreign Minister Witold Waszczykowski said in Warsaw.\nAfter Friday's talks with EU Commission President Jean-Claude Juncker and European Parliament chief Martin Schulz, Cameron will host EU President Donald Tusk for a working dinner in London on Sunday as the Feb. 18-19 EU summit on the issue draws near.\nOver the past weeks, both sides have shown signs that a deal may be possible. If he gets enough reform, Cameron will urge voters to back continued EU membership during a British referendum that could come as early as this summer.\nCameron has said he needs more independent decision-making brought back to national capitals from EU headquarters in Brussels, and that he was heartened by recent talks.\n\"What I was previously told was impossible is now looking like it is possible,\" he told the BBC Friday.\nMany EU leaders oppose Cameron's proposal that new immigrants wait four years before they can receive some British benefits. But the EU may be prepared to offer Britain an \"emergency brake\" that would let it deny some welfare provisions to workers if it's clear the national system is under strain.\nThe proposal could satisfy Britain's goal of regaining some control over immigration and other countries' desire to maintain the key EU principle of free movement among member states.\nSchulz said Friday he was \"optimistic there will be a deal in mid-February\" if there was \"good will from both sides.\"\nCameron said Britain simply wanted \"a system where you have to pay in before you get out. We don't want a something-for-nothing society.\"\n\"I can't be certain we'll get there in February, but I will work as hard as I can to deliver a good deal for the British people,\" the prime minister said.\nBut Nigel Farage, leader of the anti-immigrant U.K. Independence Party — which wants Britain to leave the bloc — said the changes Cameron hoped to achieve were minor.\nHe compared the British leader to the lead character in \"Oliver!\" — \"holding out the begging bowl and saying, 'Please sir, can we have some more concessions?' It's pathetic.\"\n___\nJill Lawless contributed from London, Monika Scislowska from Warsaw\nBritish Prime Minister David Cameron, left, stands with European Commission President Jean-Claude Juncker prior to a meeting at EU headquarters in Brussels on Friday, Jan. 29, 2016. British Prime Minister David Cameron is kicking off a high-stakes weekend of diplomatic negotiations on the European Union reforms with a visit to EU headquarters. (AP Photo/Virginia Mayo)\nBritish Prime Minister David Cameron, left, speaks with European Commission President Jean-Claude Juncker prior to a meeting at EU headquarters in Brussels on Friday, Jan. 29, 2016. British Prime Minister David Cameron is kicking off a high-stakes weekend of diplomatic negotiations on the European Union reforms with a visit to EU headquarters. (AP Photo/Virginia Mayo)\nThe British, right, and EU flags flap in the wind outside of EU headquarters in Brussels on Friday, Jan. 29, 2016. British Prime Minister David Cameron is kicking off a high-stakes weekend of diplomatic negotiations on the European Union reforms with a visit to EU headquarters. (AP Photo/Virginia Mayo)\nA woman walks by the British, right, and EU flags as they flap in the wind outside of EU headquarters in Brussels on Friday, Jan. 29, 2016. British Prime Minister David Cameron is kicking off a high-stakes weekend of diplomatic negotiations on the European Union reforms with a visit to EU headquarters. (AP Photo/Virginia Mayo)","url":"https://www.dailymail.co.uk/wires/ap/article-3422488/Cameron-kicks-high-stakes-weekend-EU-reform-talks.html"}
