{"authors":["Will Martin"],"date_download":"2018-10-31 00:10:29","date_modify":"2018-10-31 00:10:29","date_publish":"2018-07-12 00:00:00","description":"\"The new model is like cohabitation, with close collaboration, a shared approach to finances and decisions and obligations to each other, but ultimately separate people making their own choices.\"","filename":"data/vaneerConsumption/UKsetformajorconcessioninfinancialservicesregulationspostBrexit.json","image_url":"https://amp.businessinsider.com/images/5b47126474391628008b47f9-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_uk-set-for-major-concession-in-financial-services-regulations-post-brexit-2018-7_1540944629.html","title":"UK set for major concession in financial services regulations post-Brexit","title_page":"    UK set for major concession in financial services regulations post-Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"WPA Pool/Getty Images\nBritain is prepared to have a much more distant relationship with the European Union's financial services sector after Brexit, and is ready to move away from plans for a system of \"mutual recognition,\" according to a report from the Financial Times.\nPrime Minister Theresa May has moved on from mutual recognition — which would have meant the UK recognising EU regulations around the financial services industry, and the EU doing the same with the UK, with both sets of rules closely aligned.\nInstead, she will set out an approach one person who has seen the paper described to the FT as being like \"cohabiting but without the same commitment as marriage.\"\n\"Mutual recognition was like a marriage,\" the person said.\n\"The new model is like cohabitation, with close collaboration, a shared approach to finances and decisions and obligations to each other, but ultimately separate people making their own choices.\"\nDetails of the new plan have not been released, but the FT reports that it will seek to improve on existing requirements for equivalence of rules between the EU and outside countries.\nEquivalence is a framework whereby the EU acknowledges that the legal, regulatory and supervisory regime of a non-EU country is as good as its own, and therefore allows that state access to the financial services sector within the bloc.\nThe initial plan of mutual recognition was favoured by Chancellor Philip Hammond and was intended to minimise disruptions to doing business between the UK and EU, following the UK's loss of financial passporting rights with the rest of Europe after Brexit.\nThe financial passport is effectively set of rules and regulations which allow UK-based finance firms to trade with and sell their services into Europe. It is tightly linked to membership of the single market, so will not apply to the UK once Britain leaves the EU, given the government's desire to also leave the single market.\nWhile Hammond favoured this model, it was roundly rejected by the EU side of negotiations, with chief negotiator Michel Barnier saying in a speech on Tuesday that this plan did not provide adequate \"safeguards.\"\n\"The UK needs to understand that the EU cannot accept such mutual market access without all the safeguards that underpin it,\" Barnier told an audience at the European American Chamber of Commerce in New York.","url":"https://www.businessinsider.com/uk-set-for-major-concession-in-financial-services-regulations-post-brexit-2018-7"}
