{"authors":["Simon Kent"],"date_download":"2018-10-30 22:02:59","date_modify":"2018-10-30 22:02:59","date_publish":"2017-03-30 08:56:13","description":"British volunteers who join the Israeli army are foreign fighters and should be prosecuted on return to the UK, according to Baroness Warsi.","filename":"data/vaneerConsumption/UKSoldiersinIsraeliArmyShouldBeProsecuted.json","image_url":"https://media.breitbart.com/media/2017/03/warsi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_03_30__1540936979.html","title":"UK Soldiers in Israeli Army Should Be Prosecuted","title_page":"Baroness Warsi: UK Soldiers in Israeli Army Should Be Prosecuted","title_rss":"NULL","source_domain":"breitbart.com","text":"British volunteers who join the Israeli army are foreign fighters and should be prosecuted as such on their return to the UK, according to Baroness Sayeeda Warsi.\nLady Warsi, one-time chairman of the Conservative Party and Britain’s first Muslim cabinet minister, made her call in an interview with Middle East Eye (MEE). It came on the same day she published a book, The Enemy Within, in which she said there are clear distinctions under UK law between Muslims who went to fight for non-state groups and militant organisations, and British citizens who volunteered to fight for Israel.\nLady Warsi seeks to close a gap she says is designed to protect Israel. The former foreign office minister, who now holds the title of baroness in the House of Lords, claims it distinguishes between Britons who fight for state armies like Israel and Pakistan and those who fight for non-state groups like Kurdish and militant organisations. She said:\n“One of the questions I asked the Foreign Office was that we have a distinction between state actors and non-state actors.\n“If you go out there and fight for any group, you will be subject to prosecution when you get back. If you go out and fight for Assad, I presume, under our law, that is okay. That can’t be right.”\n“The only reason we allow the loophole to exist is because of the IDF [Israel Defence Forces], because we are not brave enough to say if you hold British citizenship, you make a choice. You fight for our state only. That has to go out strong.”\nLady Warsi gained her Cabinet post when David Cameron became prime minister in 2010. She resigned four years later in protest at his support of Israel and Operation Protective Edge. Now she says that UK citizens must fight for Britain or not at all:\n“You have to belong to something and belonging to Britain for Muslims is a thing we talk about a lot. We don’t talk about it in relation to other communities. We accept that other communities hold multiple identities. Let’s just shut down this loophole. If you don’t fight for Britain, you do not fight.”\nJonathan Arkush, president of the Board of Deputies, refuted Lady Warsi’s claim of special treatment for British volunteers in the IDF.\nHe told the Jewish News: “Sayeeda Warsi lost all touch with reality when she flounced out of government over her Gaza issues, and into well-earned obscurity. If she is really suggesting a Briton who volunteers for the French Foreign Legion, or the Kurdish fight against Isis, or Israel, then should be prosecuted for being a traitor, then no-one can treat her seriously.”\nConservative Friends of Israel Honorary President, Lord Polak, also disputed Baroness Warsi’s attempt at moral equivalence linking the actions of the Israeli Defense Force and non-state actors like Islamic State.\n“This blasé attitude is both careless and shows a total lack of understanding of the only true democracy in the Middle East,” he said.","url":"https://www.breitbart.com/middle-east/2017/03/30/baroness-warsi-uk-soldiers-israeli-army-prosecuted-foreign-fighters/"}
