{"authors":[],"date_download":"2018-10-22 22:56:28","date_modify":"2018-10-22 22:56:28","date_publish":"2014-06-09 16:03:04","description":"The case has lasted seven months and revealed countless stories from the world of celebrity and Britain's corridors of power.","filename":"data/vaneerConsumption/UKsPhoneHackingCaseHandedtoJuryAfterMonthsofIntrigue.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/496846/140509-phone-hacking-brooks-515p_df43fc4c6c9b258b8ef59d3893babd00.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_uks-phone-hacking-case-handed-jury-after-months-intrigue-n126326_1540248988.html","title":"UK's Phone Hacking Case Handed to Jury After Months of Intrigue","title_page":"UK's Phone Hacking Case Handed to Jury After Months of Intrigue","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nLONDON - After a marathon court case that exposed the secrets of the world's royal, political, and media elite, Britain's phone hacking trial was handed over to jurors on Wednesday.\nAt the heart of the case is the now-shuttered News of the World, a brash tabloid owned by media tycoon Rupert Murdoch that was famous for undercover investigations and celebrity kiss-and-tells.\nBoth prosecutors and defense lawyers agree that staff at the London-based paper obtained some of their sensational stories by listening to the voice mails belonging to scores of people, including A-list celebrities and a 13-year-old murder victim.\nSign up for breaking news alerts from NBC News\nBut prosecutors allege that two of the newspaper's most high-profile editors, Rebekah Brooks and Andy Coulson, knew about the widespread use of this illicit practice and \"none of them lifted a finger to stop it.\" If convicted the defendants face up to two years in jail, the maximum term for phone hacking.\nFive other people, including Brooks' husband and her personal assistant, also face charges such as bribery and perverting the course of justice.\nThe seven-month case has served up countless tidbits of gossip from the lives of celebrities, royalty and other members of the British establishment.\n\"Everyone is subject to the law of the land. No one is so powerful they can ignore the law\"\nHollywood stars Jude Law and Sienna Miller were among the celebrities who testified about being alleged targets of phone hacking at the hands of News of the World journalists.\nSalacious as many of these celebrity and political stories aired during the trial were, perhaps the biggest intrigue involved the relationship between Brooks, Coulson, and British Prime Minister David Cameron.","url":"https://www.nbcnews.com/news/world/uks-phone-hacking-case-handed-jury-after-months-intrigue-n126326"}
