{"authors":["Thomas Colson"],"date_download":"2018-10-30 23:03:52","date_modify":"2018-10-30 23:03:52","date_publish":"2016-12-09 00:00:00","description":"Thirty trade groups said that EU workers play a 'significant role' in keeping UK food prices stable.","filename":"data/vaneerConsumption/UKtradegroupswarnfoodpricesaresettoriseafterBrexit.json","image_url":"https://amp.businessinsider.com/images/583d7cdadd08953f1a8b4ac6-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_brexit-food-prices-agriculture-labour-shortage-costs-set-to-rise-after-brexit-2016-12_1540940632.html","title":"UK trade groups warn food prices are set to rise after Brexit","title_page":"    UK trade groups warn food prices are set to rise after Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Pumpkins are harvested at David Bowman Pumpkins in Spalding, England, September 2013 Reuters / Nigel Roddis LONDON — Industry groups warned that Britain will face higher food prices unless the government offers \"unambiguous reassurance\" to workers from the European Union about their right to remain in the UK after Brexit.\nIn a letter published by the Guardian, directors of 30 trade groups warned that Britain relies heavily on EU migrants to grow, harvest, and sell produce in the UK.\nIt said that EU workers play a \"significant role\" in keeping UK food prices stable and called for the government to place food and drink \"at the heart of Brexit negotiations.\"\nThe letter also warned that \"some workers are already leaving the UK,\" echoing concerns that the UK's food industry is facing a major labour shortage in the wake of the Brexit vote, despite overall immigration being up.\nA survey released last week by the Association of Labour Providers, which supplies the bulk of the UK's short-term agricultural labour, said job applications from EU workers had slumped by as much as 70%.\nIt said: \"The government should offer unambiguous reassurance to EU workers throughout our supply chain about their right to remain.\n\"For the longer term, it is important to recognise that these workers are highly flexible and provide an essential reservoir of skilled, semi-skilled and unskilled labour.\"\nHome Secretary Amber Rudd has stated her intention to reduce overall immigration to the \"tens of thousands\" after Brexit, which would represent a huge cut from its current level.\nAnnual levels currently lie at around 650,000— a record high which has been boosted by a large number of EU migrants moving to the UK before it exits from the union.\nThe letter called for the government to consider \"all options\" for a post-Brexit immigration policy, including a sector-based points system — something Theresa May has already ruled out.\nSignatories of the letter include directors of major trade bodies such as the Food & Drink Federation, the National Union of Farmers (NUF), and the British Beer & Pubs Association.","url":"https://www.businessinsider.com/brexit-food-prices-agriculture-labour-shortage-costs-set-to-rise-after-brexit-2016-12"}
