{"authors":["Will Martin"],"date_download":"2018-10-30 22:16:44","date_modify":"2018-10-30 22:16:44","date_publish":"2016-12-14 00:00:00","description":"The Office for National Statistics released its latest snapshot of the UK's employment picture on Wednesday.","filename":"data/vaneerConsumption/UKunemploymentandwagegrowthfiguresforNovember.json","image_url":"https://amp.businessinsider.com/images/5851132bdd0895cb558b4beb-750-375.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_uk-unemployment-wage-growth-october-september-brexit-2016-12_1540937804.html","title":"UK unemployment and wage growth figures for November","title_page":"    UK unemployment and wage growth figures for November - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Unemployment in the UK remained unchanged at the latest reading, staying at just 4.8% — a 10-year low, according to the data released by the Office for National Statistics.\nThat was in line with forecasts from economists polled prior to the release, and unchanged from the number released in November.\nEmployment also remains at its highest level since records began, at 74.5% of the population.\nThere were 31.76 million people in work between August and October, which was \"little changed compared with May to July 2016 but 342,000 more than for a year earlier,\" an ONS release said.\nHere is the ONS' chart showing the unemployment rate over the last five years:\nONS\nSince the Brexit vote, various economists and financial institutions have predicted that the UK's unemployment rate will shoot up as a result of the vote to leave. Credit Suisse, for example, predicts an increase to 6.5% for the base rate, equivalent to roughly 500,000 jobs being lost. However, November saw the rate remain near its record low and Wednesday's figures show the trend appears to be holding up.\nThe Bank of England expects unemployment to rise to 5.5% once the full effects of the referendum are felt across the economy. However, BOE governor Mark Carney has said that the bank is willing to allow inflation to overshoot its target in order to protect jobs.\nAverage earning grew by 2.5% in November, a slight acceleration on October's figure of 2.4%, and in line with the 2.5% that was forecast prior to the release.\nThere was one major disappointment in the figures, with the UK's employment rate falling for the first time in over a year, dropping marginally from 74.5% to 74.4%.\n\"The employment rate (the proportion of people aged from 16 to 64 who were in work) was 74.4%, slightly down from the joint record high of 74.5% recorded for May to July 2016 but higher than for a year earlier (73.9%),\" the ONS' release said.","url":"https://www.businessinsider.com/uk-unemployment-wage-growth-october-september-brexit-2016-12"}
