{"authors":["Associated Press"],"date_download":"2018-10-23 03:47:28","date_modify":"2018-10-23 03:47:28","date_publish":"2016-01-29 19:02:31","description":"LONDON (AP) — A British woman has been found guilty of taking her toddler son to join the Islamic State group, becoming the first woman to be convicted of th...","filename":"data/vaneerConsumption/UKwomanfoundguiltyoftakingsontojoinISinSyria.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423193_UK-woman-guilty-taking-son-join-IS-Syria_1540266448.html","title":"UK woman found guilty of taking son to join IS in Syria","title_page":"UK woman found guilty of taking son to join IS in Syria | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UK woman found guilty of taking son to join IS in Syria\nLONDON (AP) — A British woman has been found guilty of taking her toddler son to join the Islamic State group, becoming the first woman to be convicted of the offense after returning to the U.K. from the self-declared caliphate in Syria.\nTareena Shakil, 26, was convicted of being a member of the Islamic State and encouraging acts of terrorism. She will be sentenced on Monday. Police said in October 2014 she and her one-year-old son boarded a plane to Turkey, where she crossed into Syria and spent three months there.\nCounter-terrorism officers arrested Shakil on suspicion of Syria-related terrorism offenses and child neglect at London's Heathrow Airport when she returned last February. Her son has since been taken into social care.\nDuring her trial, Shakil denied the charges, claiming she only travelled to Syria because she wanted to live under strict Islamic law. But a photo on her phone showed her posing with a firearm and wearing an Islamic State balaclava, and another photo showed her posing in Syria under the group's flag. Police also said she had sent a series of tweets before she left Britain, encouraging others to commit terror acts.\n\"Our assessment is that she was not naïve; she had absolutely clear intentions when she left the U.K.,\" said Marcus Beale at West Midlands Police. He added that she \"presented a real threat\" to Britain upon her return.","url":"https://www.dailymail.co.uk/wires/ap/article-3423193/UK-woman-guilty-taking-son-join-IS-Syria.html"}
