{"authors":[],"date_download":"2018-10-30 14:26:48","date_modify":"2018-10-30 14:26:48","date_publish":"2015-08-01 00:00:00","description":null,"filename":"data/vaneerConsumption/UnaccompaniedpooparrivingviaMexicancilantro.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_unaccompanied_poop_arriving_via_mexican_cilantro_1540909608.html","title":"Unaccompanied poop arriving via Mexican cilantro","title_page":"Unaccompanied poop arriving via Mexican cilantro","title_rss":"NULL","source_domain":"americanthinker.com","text":"I repeat: tainted with human feces. Now, if that doesn't put a damper on your hankering for cilantro jalapeño pesto, I don't know what will.\nNo one cares, but right around July 4, Barack Obama informed the world that he's a fan of classic guacamole. Now, less than a month later, I'm sorry to have to be the bearer of bad news, but much to the horror of salsa and guacamole aficionados everywhere, the FDA has banned the import of some fresh cilantro shipments from Mexico after evidence indicated that the crop was tainted with human feces.\nEveryone knows what feces is, but for those who don't know what cilantro is, it's a popular herb that's a key ingredient in Mexican food.\nUnfortunately for cilantro-loving illegals in America or \"co-exist\" types anxious to embrace the full palate of cultural diversity, Puebla farm workers with less than first-world bathroom habits have been fertilizing the coriander crop with their own version of Miracle Grow.\nIn addition to the feces, used toilet paper was also found among the harvested green herb. So, with a handy roll of 100% recycled tissue tucked neatly away in the backpack, when the urge hit, hardworking Mexican laborers regularly deposited gifts that hopefully migrated from Puebla all the way up to President Obama's classic guacamole dip.\nThe sob story is that some of the farms have no toilet facilities for the workers, which could explain why 60% of all illegal immigrants are from Mexico. They've come north in search of a job with a bathroom.\nIf you happen to be cilantro with feces on it, right now you're indefinitely banned from entry into the U.S. However, if you're a farm worker in search of an accessible toilet, the border is open to you, your backpack, and that traveling roll of farm-ready toilet paper.\nPoop cilantro is no-no; cilantro-poopers are sí-sí.\nThe problem for Americans is that if a pooping cilantro farm worker decides to head north to the land of porcelain commodes, there's a good chance that third-world bathroom habits will migrate, too.\nIt's probably considered insensitive to say this, but once a former cilantro farm worker is residing illegally in the U.S., he is free to spread around what would have otherwise been left in the herb patch in Puebla. In other words, there's a good chance that the added ingredient that disqualifies Mexican cilantro from American consumption will likely show up on things like shopping cart handles, gym equipment, doorknobs, and the king of poop-to-mouth bacteria transfer: grocery store produce.\nNow some people are saying that fecal matter may also be responsible for other recent outbreaks of food poisoning in the U.S. For example, in 2013 and 2014, several occurrences of a stomach illness attributed to the cyclospora parasite, which was virtually unknown before 1990, were linked to Puebla farms, where having a poo in the great outdoors appears to be customary.\nAccording to Seattle-based food safety lawyer Bill Marler, \"cyclospora is called an emerging pathogen… [and is] a relatively new bug making people sick in the U.S.\" Marler says that the uptick recently in cyclospora occurrences is somewhat concerning, but that \"given the numbers of outbreaks that have occurred … banning the product is probably a bit past due.\"\nSpeaking of the pesky imported protozoa, who would have thought the exact same single-cell organism found in the salsa would mysteriously show up in America's public pools? Apparently, a number of enthusiastic swimmers have swallowed poo-tainted pool water and come down with waterborne Cryptosporidium cramping, nausea, and diarrhea.\nWe know that if we asked guacamole fan Obama, he'd insist that unaccompanied minors and other illegal immigrants who swam across the Rio Grande are not responsible for the chlorine-resistant waterborne bacteria currently making their home in our public pools.\nYeah, but the last time I checked, Mexican cilantro didn't grow in American swimming pools. So how, pray tell, did Pedro's poop migrate to the deep end?\nWell, taking into consideration the fact that millions of illegal outdoor poopers have overrun every area of our lives, it doesn't take a genius to figure out that cyclospora invades pools the same way it contaminates Mexican cilantro.\nJeannie hosts a blog at www.jeannie-ology.com.","url":"https://www.americanthinker.com/blog/2015/07/unaccompanied_poop_arriving_via_mexican_cilantro.html"}
