{"authors":["Belinda Cleary For Daily Mail Australia"],"date_download":"2018-10-23 00:40:24","date_modify":"2018-10-23 00:40:24","date_publish":"2017-03-16 10:10:11","description":"An 11-year-old boy is missing after playing in floodwaters near Wollongong on Thursday. Authorities fear the boy may have been swept away by the fast-moving water.","filename":"data/vaneerConsumption/Unanderraboymissingafterplayinginfloodwaters.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54DF1C00000578-0-image-a-58_1489675290043.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319434_Boy-11-missing-playing-floodwaters-Unanderra_1540255224.html","title":"Unanderra boy missing after playing in floodwaters","title_page":"Unanderra boy missing after playing in floodwaters | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An 11-year-old boy may have been swept away in floodwaters while playing in a park during heavy rain, authorities say.\nRyan Teasedale was last seen on Thursday at 4.30pm in Riley Park, Unanderra, near Wollongong, sliding down the hills on his boogie board in the rain.\nThe 11-year-old boy was playing with his brother and up to 20 other children and adults when he went missing.\nRyan's brother went home when he couldn't find him at the park - but he wasn't there either, police said.\nRyan Teasedale is missing after playing in floodwaters with his brother and dozens of other children in Wollongong, south of Sydney\nDozens of children and adults were playing in the flood water, pictured\nThe search for the 11-year-old boy continued after dark and in heavy rain\nFamily went back to the park to look for the boy - but at 6.30pm they phoned emergency services fearing he had been swept away by floodwaters.\nRyan was last seen wearing a blue board shorts, no shirt, and was in possession of a blue body board which has not been located.\nSES volunteers, police and specialist ambulance teams trained in saving people from water are still looking for the boy.\n'We have good reason to believe he may have been swept into floodwaters at the time,' NSW State Emergency Service spokesman Phil Campbell said.\nThe search and rescue teams were focused on the storm water drains in the park at 6.30pm - but have not yet found the missing child.\nThe boy's family have been notified and are speaking with authorities.\nThe search and rescue teams were focused on the storm water drains in the park at 6.30pm - but have not yet found the missing child\nRescue teams searched storm water drains with torches - starting in areas closest to the park\nOther children continue to take advantage of the slippery slopes at the park despite the frantic search for the missing boy.\nAt least 53mm of rain was dumped in 60 minutes at Warragamba, while three train services were shut down and two highways near Albion Park closed due to rising waters.\nThe SES received 800 calls for help, mostly for leaking roofs and flooded properties.\nMore than 20 children and adults were playing in the water - some continuing even as emergency crews searched for the boy\nrescue teams searching drains near where the boy went missing after playing in the rain on a boogie board\n'At one point we were getting one flood rescue call every 10 minutes,' Mr Campbell said.\nHeavy rain was likely to bring more flash flooding to the south coast for several hours on Thursday night, according to the Bureau of Meteorology, which issued a severe thunderstorm warning for the area.\nHeavy rain was likely to bring more flash flooding to the south coast for several hours\nAn 11-year-old boy may have been swept away in floodwaters while playing in a park during heavy rain","url":"https://www.dailymail.co.uk/news/article-4319434/Boy-11-missing-playing-floodwaters-Unanderra.html"}
