{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 19:56:13","date_modify":"2018-10-30 19:56:13","date_publish":"2017-02-14 01:24:08","description":"Every Democrat joined every Republican in voting to confirm Dr. David Shulkin as the next man to run the Department of Veterans Affairs in a 100-0 vote. | Politics","filename":"data/vaneerConsumption/UnanimousSenateConfirmsDrDavidShulkintoTakeoverVeteransAffairs.json","image_url":"https://media.breitbart.com/media/2017/02/Dr.-David-Shulkin-Confirmation-Fox.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_02_13__1540929373.html","title":"Unanimous: Senate Confirms Dr. David Shulkin to Take over Veterans Affairs","title_page":"Unanimous: Senate Confirms Dr. David Shulkin to Take over Veterans Affairs | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Every Democrat joined every Republican in voting to confirm Dr. David Shulkin as the next man to run the Department of Veterans Affairs in a 100-0 vote.\nSpeaking on the Senate floor shortly before the vote, Sen. Susan Collins (R.-Maine) said she was thrilled by Shulkin’s nomination, and it was one of the few things Republicans and Democrats have agreed on recently.\nCollins said that she was especially impressed when Shulkin kept a commitment he made to her in a private meeting and visited the only veterans hospital in Maine with her.\n“I was truly impressed and remain truly impressed with Dr. Shulkin’s understanding of the needs of rural veterans and the challenges of providing health care in rural settings,” she said.\n“While in Maine, Dr. Shulkin listened to veterans, health care providers, VSO advocates, and the VA staff alike,” she said. A VSO is a veterans services organization, such as the American Legion or the Veterans of Foreign Wars.\nPresident Donald Trump confounded observers with the Shulkin pick because he was promoting from inside a department he routinely criticized while he was on the campaign trail.\nShulkin was appointed by President Barack Obama in 2015 to serve as the chief executive of the Veterans Health Administration, which is the medical operations and services part of the The VA. The system is the largest single health care group in the country.\nDr. Shulkin leads the nation’s largest integrated health care system with over 1,700 sites of care, serving 8.76 million veterans each year. The Veterans Health Administration is also the nation’s largest provider of graduate medical education and major contributor of medical research. Dr. Shulkin will have oversight over the system that employs over 300,000 people who work in the health system.\nThe new chairman of the House Veterans Affairs Committee Rep. Phil Roe (R.-Tenn.), who is also a physician, said Shulkin was the right pick for the task ahead.\n“I am pleased President-elect Trump has chosen a physician to lead the Department of Veterans Affairs, especially one familiar with the integrating of private practitioners into the VA’s network of health care providers,” Roe said, adding, “I’ve long said I would be happy to work with anyone committed to ensuring our heroes have access to the services they have earned, especially quality health care, and I look forward to working with Dr. Shulkin to bring wholesale reform to the department.”\nThe senior Democrat on the Senate Committee on Veterans Affairs, Sen. Jon Tester (D.-Mont.), told Fox and Friends Feb. 2 that Shulkin had an excellent hearing before the committee and that Shulkin had his vote.\n“He gave great answers to everyone on the panel, both Republicans and Democrats,” said Tester. “He’s been there for 18 months, I think he knows the problems with the VA.”\nTester said there was no grace period and that Shulkin was expected to deliver results. “I think he is a good, solid pick.”","url":"https://www.breitbart.com/politics/2017/02/13/senate-confirms-dr-david-shulkin-take-veterans-affairs/"}
