{"authors":["Will Martin"],"date_download":"2018-10-30 20:35:21","date_modify":"2018-10-30 20:35:21","date_publish":"2016-12-29 00:00:00","description":"Versions of 'uncertain' or 'uncertainty' were uttered 78% more times in 2016 than in 2015.","filename":"data/vaneerConsumption/UNCERTAINTYTheBankofEnglandsunofficialwordoftheyear.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bank-of-england-uncertainty-brexit-2016-12_1540931721.html","title":"'UNCERTAINTY': The Bank of England's unofficial word of the year","title_page":"    'UNCERTAINTY': The Bank of England's unofficial word of the year - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bank of England Governor Mark Carney on August 4, 2016, the day the bank cut interest rates for the first time in seven years. Reuters/Pool \"Uncertainty\" might as well be the Bank of England's unofficial word of the year after the central bank used it 123 times in official communications during 2016.\nSimply put, if you weren't uncertain this year, you were doing something wrong. Uncertainty was everywhere. Uncertainty about political events like the Brexit vote and the US election, uncertainty about what their shock outcomes will mean going forward, uncertainty about which beloved celebrity will be the next to die prematurely.\nNowhere was this uncertainty more prominent than in the direction of the British economy after the country voted to sever ties with Brussels and leave the European Union.\nIn the run-up to the referendum on June 23, many — including BoE Governor Mark Carney— predicted a recession in the event of a vote to leave. What actually followed surprised most, with the economy remaining resilient and growing at a much faster pace than forecast.\nA perfect indicator of just how uncertain Britain's economic climate was this year comes from the minutes of the 11 meetings of the Bank of England's rate setting Monetary Policy Committee this year.\nThe Bank of England used the words \"uncertain\" or \"uncertainty\" a total of 123 times in the minutes of its meetings in 2016, an average of 11.18 uses per meeting. We first noticed this fact thanks to the Financial Times' excellent round-up of \"The UK economy in numbers in 2016.\"\nIn itself that's pretty impressive, but what is even more striking is that its a 78% increase from 2015, when the MPC met 12 times.\nBack in 2015 all the world had to be unsure about was a hard landing from the Chinese economy, and maybe the odd Greek debt crisis, but things really ramped up in 2016.\nThe Bank of England did not meet in October as it is switching from 12 meetings per year to 10. Business Insider/Will Martin\n2016 got off to a fairly certain start in the eyes of the MPC. \"Uncertainty\" was mentioned just 15 times in the first three months of the year, with not a single mention at the bank's January meeting. As the June referendum approached, uncertainty began to really come into focus, with the MPC's April meeting making 20 mentions of the \"U\" word.\n\"There are some signs that uncertainty relating to the EU referendum has begun to weigh on certain areas of activity, as some decisions, including on capital expenditure and commercial property transactions, are being postponed pending the outcome of the vote,\" the bank's summary on April 14 said.\nFor most of the rest of the year, uncertainty was mentioned between 12-19 times per meeting. In August, when the bank cut interest rates for the first time in seven years, taking its base rate to a record low 0.25%, uncertainty was mentioned on 12 occasions.\nToward the end of the year usage tailed off a little, and at the bank's December meeting it was mentioned just eight times.","url":"https://www.businessinsider.com/bank-of-england-uncertainty-brexit-2016-12"}
