{"authors":["Associated Press"],"date_download":"2018-10-22 20:29:31","date_modify":"2018-10-22 20:29:31","date_publish":"2016-01-28 01:28:58","description":"UNITED NATIONS (AP) — The U.N. secretary-general on Wednesday challenged investors around the world to at least double their investments in clean energy by 2...","filename":"data/vaneerConsumption/UNchiefwantscleanenergyinvestmentsdoubledby2020.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:6860122d1eda411c9954732f20359fd9-4vVdYopwYQ7f641721b07a71932b-527_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419594_UN-chief-wants-clean-energy-investments-doubled-2020_1540240171.html","title":"UN chief wants clean energy investments doubled by 2020","title_page":"UN chief wants clean energy investments doubled by 2020 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UN chief wants clean energy investments doubled by 2020\nUNITED NATIONS (AP) — The U.N. secretary-general on Wednesday challenged investors around the world to at least double their investments in clean energy by 2020, saying that \"we must begin the shift away from fossil fuels immediately.\"\nBan Ki-moon told an investor summit on climate risk that increasing investment in clean energy is critical in following up on the landmark agreement to tackle climate change reached in Paris last year.\nBan said about $330 billion was invested in clean energy last year, but that is far from what he calls the \"clean trillion\" needed per year in the decades to come.\nA large video monitor shows former New York mayor Michael Bloomberg, the U.N. Secretary-General¿s special envoy for cities and climate change, address the biennial \"Investor Summit on Climate Risk\" on Wednesday, Jan. 27, 2016 at U.N. headquarters. (AP Photo/Bebeto Matthews)\nThe U.N. chief also said he has invited all of the world's heads of states and government to attend an April 22 signing ceremony for the climate agreement, and that 55 countries' signatures are needed to put the agreement into effect.\nThe U.N. and some world leaders have been reaching out to the business community since the Paris agreement, urgently seeking financial support for efforts to slow rising global temperatures.\n\"Sustainable, clean energy is growing, but not nearly fast enough to meet energy demand,\" Ban said Wednesday.\nBut last week, the head of the International Energy Agency, which advises oil-importing countries, told global leaders and business executives at the World Economic Forum in Davos that the plunge in oil prices is a growing threat to the world's goal to reduce emissions through the increase in renewable energies.\nFatih Birol said energy efficiency has been driven largely not so much by environmental concerns but an interest in saving money, which is disappearing as fossil fuels become cheaper.\nAnd the head of the International Chamber of Commerce, John Danilovich, told The Associated Press in Davos that adapting investment to meet the lower-emissions goals in the Paris agreement will be among several struggles for global businesses this year.\nBut France's environment minister, Segolene Royal, told Wednesday's investor summit that lower oil prices make the search for more oil less attractive. She said the \"time is ripe\" to remove subsidies for fossil fuel and introduce a price on carbon dioxide pollution. She said 60 countries and regions are now paying for such emissions through taxes or carbon markets.\nThe U.N. chief also called for carbon pricing and the removal of fossil fuel subsidies.","url":"https://www.dailymail.co.uk/wires/ap/article-3419594/UN-chief-wants-clean-energy-investments-doubled-2020.html"}
