{"authors":["Deborah Danan"],"date_download":"2018-10-30 18:56:59","date_modify":"2018-10-30 18:56:59","date_publish":"2018-07-22 15:04:36","description":"TEL AVIV - UN Secretary-General Antonio Guterres called on Hamas to stop sending incendiary balloons and terror kites over the border.","filename":"data/vaneerConsumption/UNChiefDemandsHamasStopKiteTerror.json","image_url":"https://media.breitbart.com/media/2018/06/wi/afp/26/3d8b2a_un-chief-antonio-guterres-congolese-malian-yemeni-groups-added-black-violating.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2018_07_22__1540925819.html","title":"UN Chief Demands Hamas Stop Kite Terror","title_page":"UN Chief Demands Hamas Stop Kite Terror | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – UN Secretary-General Antonio Guterres called on Hamas Saturday to stop sending incendiary balloons and terror kites over the border with Israel and risk “another devastating conflict” in Gaza.\n“I am gravely concerned over the dangerous escalation of violence in Gaza and southern Israel,” Guterres said in a statement. “It is imperative that all sides urgently step back from the brink of another devastating conflict.”\n“I call on Hamas and other Palestinian militants to cease the launching of rockets and incendiary kites and provocations,” he said.\nHe added that Israel “must exercise restraint to avoid further inflaming the situation.”\nGuterres’s statement came after a weekend of heavy fighting which saw IDF strikes on more than 60 Hamas terror targets all over Gaza, a reprisal for the killing of an Israeli soldier by Palestinian snipers.\nThe death of IDF Sgt. Aviv Levi, 21, from Petah Tikva marked the first Israeli killed by Hamas since the 2014 war.\nFour Palestinians were killed in the onslaught, three of whom Hamas said were its fighters.\n“The attack delivered a severe blow to Hamas’ training array, command and control abilities, weaponry, aerial defense and logistic capabilities along with additional military infrastructure,” the IDF said.\nEgypt warned Hamas that Israel would launch a war “in two hours” if the terror group responded to IDF strikes, Channel 10 reported. The warning resulted in Hamas announcing a ceasefire Friday night.\nEgypt further said it would impose sanctions on Hamas if it did not cease sending incendiary devices over the border.\nHamas has demanded in return that Israel ease restrictions on the transfer of goods into Gaza and called on Egypt to keep the Rafah border crossing open. The terror group also asked Egypt to pressure Palestinian Authority President Mahmoud Abbas into paying the salaries of PA employees in Gaza, the report said.\nThe weekend saw fewer kite attacks than in previous weeks.\nNevertheless, Hamas sources denied reports by Israeli officials that they have pledged to stop the incendiary terror, Army Radio reported.","url":"https://www.breitbart.com/middle-east/2018/07/22/un-chief-demands-hamas-stop-kite-terror/"}
