{"authors":[],"date_download":"2018-10-30 20:08:39","date_modify":"2018-10-30 20:08:39","date_publish":"2014-11-01 04:00:00","description":"Georgia laws provide for remarkably swift eviction when a landlord files for dispossessory action. But if this is happening to you, there are some protections built into the law to protect your rights.","filename":"data/vaneerConsumption/UnderstandingtheevictionprocessinGeorgia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/04/29/Videos/4382022.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_understanding-the-eviction-process-georgia__1540930119.html","title":"Understanding the eviction process in Georgia","title_page":"Understanding the eviction process in Georgia","title_rss":"NULL","source_domain":"ajc.com","text":"Georgia laws provide for remarkably swift eviction when a landlord files for dispossessory action. But if this is happening to you, there are some protections built into the law to protect your rights. Here are some questions I am most often asked about the eviction process and how to avoid it.\nRELATED: How to evict someone in Georgia\nQ: Exactly what is an eviction and how does it work?\nA: In Georgia, the Legislature recognizes that the idea of kicking someone out into the street is a serious one, so the process allows for protection of both landlord and tenant rights.\nYou should start with the lease agreement between the parties. Most renters don’t read their lease, but they should. It spells out what happens if you fail to follow the terms of the lease, and when the landlord can file for eviction.\nI have a friend who is an attorney, and he explains his lease like this: “Everything in this lease is stacked against you — there’s nothing in your favor — and if we find something in your favor, we’ve got take it out. Basically, the whole thing says this: If you don’t pay, you don’t stay.”\nQ: So eviction is all about getting the rent paid on time?\nA: Yes, the vast majority of evictions are brought about because the rent has not been paid.\nQ: Let’s say I can’t pay my rent, but I have a very good reason. Let’s say I lost my job, or I had a serious medical condition, or both.\nA: The law is very clear. The landlord’s obligation is to repair, while the tenant’s obligation is to pay rent. Those sound like very unfortunate circumstances that have befallen you, but they are not legally acceptable reasons for failure to pay the rent.\nQ: So, are there any legally acceptable reasons for failure to pay rent?\nA: Not many. The law recognizes that the owner has to be able to generate income in order to pay the mortgage and the taxes.\nOne excuse is valid: The courts in Georgia have held that if your landlord has failed to make reasonable repairs to the property on a timely basis, you can employ a “repair and deduct” strategy in which you pay for the repairs yourself and deduct that amount from future rent.\nBut even that is a risky business, because the landlord can later say he was unaware of the problem, and you may get stuck with the cost of the repair.\nQ: Are you saying that once the landlord files for eviction, there is no defense at all?\nA: Only one. That defense is payment in full, including rent, late fees, and all court costs up to that moment. If offered, the landlord must accept the rent, but it can only stop an eviction once a year.\nQ: Let’s say I can’t pay the rent this month. How fast can all this happen?\nA: If your rent is due on the first, you’ll probably get a late letter in a day or two. If you still don’t pay and you don’t contact the landlord, you will probably get a demand notice on the tenth day of the month.\nIt’s called a Notice to Pay Rent or Quit, and it means that the landlord is about to swear out a dispossessory warrant, seeking to have you evicted by the court for non-payment.\nQ: What happens next?\nA: Once the dispossessory is filed, the county marshal will deliver a summons to your residence demanding that you answer the charges of non-payment of rent. You have seven calendar days to answer the summons in writing.\nIf you answer with almost any written response, a court date will be set for a trial of the facts, usually within two weeks of the answer.\nQ: Then what happens in court?\nA: If you appear on time for your court date, prepare to spend the whole day. There may be hundreds of cases ahead of you, and attorney cases always go first.\nOnce your case is called, the judge will ask you why you have not paid the rent. Remember — financial hardship is not an excuse. The judge will listen sympathetically, then recommend that the two parties meet with a mediator, perhaps right then and there, to try to work out a payment schedule.\nQ: What if the landlord refuses or demands all the money be paid immediately?\nA: If the landlord refuses mediation, the judge will very likely rule in his favor, granting him possession of your house or apartment in seven days. Any possessions left inside at that time will be placed at the curb.\nQ: All this sounds rather harsh. No one likes the idea of evicting a family into the street. How often does this happen?\nA: Believe it or not, the threat of eviction is usually enough to get the tenant to either start paying or move out and find another place to live. Know the landlord would much rather see you move to another place than to have to put your possessions on the street. It’s no fun for anyone.\nQ: Is there anything that you can share that will stop an eviction?\nA: The only way to stop an eviction dead in its tracks is to file for protection under the federal Bankruptcy Act.\nFinal piece of advice: If you don’t pay, you don’t stay.\nRELATED\nTo access Georgia Legal Aid's Landlord Tenant Handbook, click here. For a free sample eviction notice for Georgia, click here. For the AJC's \"Atlanta Landlord Guide\" and other real estate tools, click here.","url":"https://www.ajc.com/lifestyles/understanding-the-eviction-process-georgia/peHyJ7mMgYEDVns0NXWPVI/"}
m, where you will find an expanded version of this column.","url":"https://www.ajc.com/business/real-estate/understanding-the-eviction-process-georgia/MBxUKjrDuIdYD7lPUYQksK/"}
