{"authors":["John Hayward"],"date_download":"2018-10-30 20:46:58","date_modify":"2018-10-30 20:46:58","date_publish":"2015-11-18 14:22:10","description":"\"I cannot think of a more potent recruitment tool for ISIL than some of the rhetoric coming out of here,\" thundered Obama.","filename":"data/vaneerConsumption/UndisputedTopRecruiterforISISBarackHusseinObama.json","image_url":"https://media.breitbart.com/media/2015/11/Obama-screen-cap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_18__1540932418.html","title":"Undisputed Top 'Recruiter' for ISIS? Barack Hussein Obama","title_page":"Undisputed Top 'Recruiter' for ISIS? Barack Hussein Obama | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"I’m old enough to remember liberals howling that “politics must stop at the water’s edge,” every time anyone from either Bush Administration spoke on foreign soil. I remember when they said “divisive rhetoric” was one of the worst political sins.\nBut there was Barack Obama at the ASEAN conference in the Philippines, lobbing insult after insult at Americans concerned about his reckless Syrian refugee policy. Obama can barely stifle a yawn when talking about the heinous acts of terrorists, but his blood really gets pumping when he has an opportunity to savage his fellow Americans. You can see the light flickering on in his eyes, like the neon tubes buzzing to life at a back-roads convenience store after sunset.\n“I cannot think of a more potent recruitment tool for ISIL than some of the rhetoric coming out of here in the course of this debate,” thundered Obama at a news conference.\n“ISIL seeks to exploit the idea that there is a war between Islam and the West,” Obama continued. “And when you start seeing individuals in positions of responsibility suggesting that Christians are more worthy of protection than Muslims are, in a war-torn land, that feeds into the ISIL narrative. It’s counterproductive and it needs to stop.”\nThe very same alleged “leader” went on to make a cheap “joke” about how his opponents are supposedly scared of Syrian moppets: “These are the same folks often times that say they’re so tough that just talking to Putin or staring down ISIL or using some additional rhetoric will solve the problem – and they’re scared of widows and three-year-old orphans.”\nWas that a “counterproductive” remark? More than half of state governors have now expressed reservations about Obama’s Syrian refugee program, and they have a legally-mandated role to play in the process. He’s lobbing irresponsible, childish, bitterly-divisive partisan slander at people he needs to work with.\nThat should tell you a lot about what Obama really thinks of the security risk he’s needlessly imposing on the American people. If he thought his program was defensible, he’d be defending it, not hurling spoiled-brat taunts at his critics.\nHe’s running a political game here, not governing or leading. He’s throwing out red meat to his supporters, most definitely including the media, who desperately want something to talk about other than the horrifying dumpster fire of a statement Obama gave after the Paris terror attacks. A partisan food fight is just the ticket.\nNot all of the critics are Republicans, either. Senator Chuck Schumer (D-NY) said that a pause in resettlement might be necessary on Tuesday. Does Obama think Chuck Schumer is scared of three-year-old orphans?\nThanks to voter backlash against Obama’s failed presidency, there aren’t many Democrat governors left, but one of them Governor Maggie Hassan of New Hampshire, and she’s got qualms about the refugee resettlement program. Does Obama think she’s a top recruiter for ISIS?\nFBI Director Robert Comey has admitted there is no way to screen the 10,000 Syrian refugees Obama wants, offering the entirely logical explanation that record-keeping is atrocious in war-torn Syria, and few of these refugees have any significant database footprint anywhere else. The chairman of the House Homeland Security Committee, Rep. Michael McCaul, has been given similar reports by officials from the Department of Homeland Security. Are those security officials all ISIS recruiters who quiver in fear at the sight of Syrian children, in Obama’s estimation?\nEven leaving the childishness and divisiveness of Obama’s rhetoric aside, his points are stupid and dishonest. The Syrian refugees are not largely comprised of 3-year-old orphans; they’re mostly military-age males unaccompanied by women or children. If Obama wants to pitch a refugee policy limited solely to small children, the state governors will probably be willing to hear him out. It is highly significant that Obama clings to these lies about who the refugees are… because he knows he can’t afford to tell the American people the truth.\nAs for the vicious idiocy of Obama’s allegations about Republican rhetoric being a “potent recruiting tool for ISIS,” the idea that Islamic State psychopaths care about the fate of the people they’re driving out of Syria is absurd on its face. If you listen to what ISIS is actually saying, they’re delighted about the refugee tide overwhelming Europe, and salivating at the thought of slipping their operatives through porous borders, and recruiting from among disaffected refugee populations.\nIslamic State recruiting has been going gangbusters for years, long before the media cooked up its first phony propaganda photo of women and little children waiting outside the gates of Europe, with the vast throng of rowdy military-age males kept discreetly off-camera. If we’re going to play the game of blaming Western politicians for the rise of ISIS, the undisputed world champion recruiter, by an order of magnitude, is Barack Hussein Obama.\nTake it from Obama’s own CIA Director, John Brennan, speaking at the Center for Strategic and International Studies on Monday. He noted that ISIS was “pretty much decimated when US forces were there in Iraq. It had maybe 700-or-so adherents left. And then it grew quite a bit in the last several years, when it split then from al-Qaida in Syria, and set up its own organization.”\nHe also admitted that the Obama Administration has consistently underestimated the threat of ISIS… from the day it took its first city, through the day it murdered over 130 people in Paris, just hours after Obama boasted it was “contained.”\nAs the American Enterprise Institute notes, the CIA found in September 2014 that ISIS could muster “between 20,000 and 31,500 fighters across Iraq and Syria,” a total that “reflects an increase in members because of stronger recruitment since June following battlefield successes and the declaration of a caliphate, greater battlefield activity, and additional intelligence.”\nThat works out to an increase in ISIS manpower between 2,700 and 4,400 percent… due entirely to Barack Obama throwing away a hard-fought victory in Iraq, over the advice of far more intelligent men, and performing a reckless withdrawal to satisfy his extreme left-wing base. Nobody else can be fingered for a 4,400 percent increase in the Islamic State’s manpower.\nObama is also responsible for appointing two of the worst Secretaries of State in American history, Hillary Clinton and John Kerry.\nClinton’s disastrous war in Libya has been an absolute bonanza for terrorist recruiting and armament. ISIS is taking ground in the nation Clinton and Obama reduced to rubble, announcing their invasion with the horrific mass slaughter of Christian captives. You’ll never find an ISIS recruiting video that carps about Republican rhetoric on Syrian resettlement, but you’ll find plenty of them featuring that beachfront beheading of Copts in Libya.\nISIS has grown so dangerous in Libya that the U.S. military had to start conducting air strikes against them – we just bagged one of their leaders earlier this week. For some reason, the media currently giggling like prom queens over the totes outrageous sick burn Obama laid on Republicans from half a world away didn’t see fit to make a big deal about American pilots forced to swing into action against ISIS in Libya.\nThere’s no question that the craven and dishonest way Clinton and Obama handled Benghazi was enormously encouraging to terrorists, giving them good reason to think the neurotic Obama Administration would respond with political spin and domestic warfare… exactly the way Barack Obama is behaving right now.\nAs for Clinton’s successor, John Kerry, he just went to the U.S. Embassy in Paris and told them how the murdered staffers of Charlie Hebdo magazine had it coming, because Islamists had a legitimate grievance against their flagrant violation of sharia speech codes. By contrast, he said the subsequent massacre in Paris was “absolutely indiscriminate”… even though the killers were loudly shouting the reason for their attack while they pumped bullets into helpless victims. Somehow the Secretary of State missed all the reports of ISIS thugs screaming “This is for Syria!” while they bathed the hall of the Bataclan in innocent blood.\nDoes anyone want to try claiming that Kerry’s foolish blather about “legitimacy” for the Charlie Hebdo attack won’t be a useful Islamist recruiting tool? How about Barack Obama granting sharia enforcers legitimacy by declaring before the United Nations, “The future must not belong to those who slander the prophet of Islam?”\nWhat about his idiotic lectures on the Crusades? You’ll find that talking point in every single issue of the ISIS magazine. Obama makes concessions to Islamist ideology more often than he argues with it. In fact, no Democrat really “argues with it” at all, because they can’t even bring themselves to name it.\nThere is more news breaking today about ISIS operatives slipping in with the refugee tide. The Islamic State has openly stated its desire to use refugee resettlement as a tool for infiltrating the West – and we have bloody evidence they have done more than discuss it. For Obama to ignore all that, and reframe the issue as a partisan squabble, is a dereliction of duty he should be made to answer for.\nIf he was a Republican, you know damn well the media would currently be hounding every single Republican candidate to disavow his remarks in the Philippines, and go on the record demanding the immediate resignation of John Kerry for his offensive stupidity in Paris.\nWe would hear endless lectures about the sin of using divisive partisan rhetoric when national security is in peril, and our allies are under attack. Shame on every media hack who responded any other way to this President’s outrageous behavior… but since they’re apparently comfortable with our national security discourse sinking to Obama’s level, by all means, let’s talk about which American politicians have done the most to make ISIS more of a threat.","url":"https://www.breitbart.com/politics/2015/11/18/undisputed-top-recruiter-isis-barack-hussein-obama/"}
