{"authors":[],"date_download":"2018-10-22 22:34:38","date_modify":"2018-10-22 22:34:38","date_publish":"2016-01-29 09:35:26","description":"A UN envoy on Friday warned of a gradual erosion of the freedom of assembly in South Korea, and cited North Korea as an extreme example of what happens when ...","filename":"data/vaneerConsumption/UNenvoywarnsoferodingfreedomsinSKorea.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h8cf-4PuZeKVXE7cd9005b2c8767e3715-638_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422444_UN-envoy-warns-eroding-freedoms-S-Korea_1540247678.html","title":"UN envoy warns of eroding freedoms in S. Korea","title_page":"UN envoy warns of eroding freedoms in S. Korea | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UN envoy warns of eroding freedoms in S. Korea\nA UN envoy on Friday warned of a gradual erosion of the freedom of assembly in South Korea, and cited North Korea as an extreme example of what happens when such tendencies go unchecked.\nWrapping up a week-long visit, UN Special Rapporteur Maina Kiai praised South Korea's successful transition from military rule to democracy, but also highlighted signs that the country was moving backwards.\n\"I sense a trend of gradual regression on the rights to freedom of peaceful assembly and of association – not a dramatic shutdown of these rights, but a slow, creeping inclination to degrade them,\" Kiai said.\nMaina Kiai, United Nations Special Rapporteur on the rights to freedom of peaceful assembly and of association, speaks during a press conference wrapping up his week-long visit to South Korea in Seoul on January 29, 2016 ©Jung Yeon-Je (AFP)\n\"I find that space for exercising the right to peaceful assembly has been shrinking over the past few years,\" he added.\nIn particular, he noted cases where government officials had restricted protests by citing the inconvenience they caused or by raising the spectre of the security threat posed by North Korea.\nAnd he expressed concern over police tactics used against demonstrators during rallies.\nLast November, more than 60,000 people took to the streets of Seoul to protest the government's push for an unpopular labour reform plan and a controversial scheme to impose state-issued history textbooks in schools.\nThat protest -- the largest South Korea has seen in nearly a decade -- erupted into violent clashes between demonstrators and police using water cannons and pepper spray.\nPresident Park Geun-hye condemned the rally as an effort to \"deny the rule of law,\" urging strong measures against violent protesters.\nBut Kiai insisted that gatherings and demonstrations served a critical social role.\n\"They allow underrepresented groups to amplify their voices,\" he told a press conference in Seoul.\n\"Consider the alternatives. DPRK is a glaring example to avoid,\" he said, using the official acronym for North Korea.\n\"Protests helped make this country great, and openness has long been a tradition. I would urge both the people and the government of this country to cherish that legacy,\" Kiai said.\nCritics of Park's conservative government say it is promoting a return to the authoritarian rule of her father, the late military strongman Park Chung-Hee.\nReferring to some 1,500 demonstrators who were summoned for investigation following the November 14 protest, Kiai said such actions were deterring would-be participants.\n\"Organisers of peaceful assemblies should not be held liable, under any circumstances, for the criminal actions of others,\" Kiai said.\nThe UN envoy will submit a full report on his visit to the UN Human Rights Council in June.\nAnti-government protesters run between water cannons towards riot police in Seoul on November 14, 2015 ©Ed Jones (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3422444/UN-envoy-warns-eroding-freedoms-S-Korea.html"}
