{"authors":[],"date_download":"2018-10-23 03:20:34","date_modify":"2018-10-23 03:20:34","date_publish":"2017-04-26 14:41:37","description":"A new round of peace talks between Yemen's warring sides should begin by the end of May, the UN mediator said Wednesday, as alarm grows over the country's...","filename":"data/vaneerConsumption/UNeyesnewYemenpeacetalksbyendofMay.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/14/wire-465503-1493214099-281_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4447860_UN-eyes-new-Yemen-peace-talks-end-May_1540264834.html","title":"UN eyes new Yemen peace talks by end of May","title_page":"UN eyes new Yemen peace talks by end of May | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A fighter loyal to Yemen's Saudi-backed president, in the mountains outside the central city of Taez\nA new round of peace talks between Yemen's warring sides should begin by the end of May, the UN mediator said Wednesday, as alarm grows over the country's humanitarian crisis.\nUN special envoy Ismail Ould Cheikh Ahmed told AFP that negotiations were underway to stave off a feared military attack on the vital Red Sea port of Hodeida, in what he hoped would be a first step towards a ceasefire.\nAverting an attack on Hodeida -- the main entry point for desperately needed aid to Yemen -- could allow \"a real cessation of hostilities and to go back to the talks,\" he said.\n\"We are at the preliminary stage, but time is also a real constraint for us, because my aim is to finish all of this before Ramadan,\" he said, adding that he hoped \"to enter into a new round of talks before Ramadan.\"\nThe Muslim holy fasting month of Ramadan is set to begin around May 27 this year.\nEven if Ould Cheikh Ahmed manages to get the parties to the table, any success will be hard-won: since Yemen's conflict escalated two years ago, all UN mediation attempts and seven declared ceasefires have failed.\nYemen's war has pitted pro-government forces against Iran-backed Huthi rebels and their allies, renegade troops loyal to former president Ali Abdullah Saleh.\nA toddler suffering from malnutrition receives treatment in Bani Hawat, on the outskirts of Sanaa\nA Saudi-led coalition intervened in Yemen in March 2015 to help the government retake the capital Sanaa and swathes of the country's north and west.\nMore than 7,700 people have been killed in the past two years of fighting, while the country has plunged into a deep humanitarian crisis and faces the imminent risk of famine.\n- 'Major humanitarian consequences' -\nHodeida is currently controlled by the Huthis, but fears are mounting over a potential coalition offensive.\nThe UN and other organisations have urged the Saudi-led coalition not to bomb Hodeida, Yemen's fourth most populated city, and a \"major lifeline for a country on the verge of starvation\".\n\"We believe that any military operation on Hodeida will have major humanitarian consequences and could lead to a very high level of civilian casualties,\" Ould Cheikh Ahmed said Wednesday.\nSchoolchildren studying in a war-damaged classroom in Hodeida\nAt the same time, he said, he was hearing concerns from the coalition that the port was being used to smuggle in weapons.\n\"We are trying to explore various options by which we can reinforce inspection mechanisms maybe or see how we can minimise the risk of any additional smuggling,\" he said.\nThe UN mediator said the Huthis had voiced interest in his proposals and that he aimed to invite them to a meeting in Oman next month to discuss different options.\n\"I'm a bit optimistic, (because) if we are able, as I am hoping, to stop the military operation in Hodeida, I think we are paving the way for new talks,\" he said, adding that the negotiations would likely be held in Geneva or Kuwait.","url":"https://www.dailymail.co.uk/wires/afp/article-4447860/UN-eyes-new-Yemen-peace-talks-end-May.html"}
