{"authors":["Chris Molanphy"],"date_download":"2018-10-22 20:07:56","date_modify":"2018-10-22 20:07:56","date_publish":"2015-02-03 00:00:00","description":"Bands like Pixies, Pavement and Sleater-Kinney might reunite for money, unfulfilled glory or a renewed creative spark. But can album sales help us measure how much they have been missed?","filename":"data/vaneerConsumption/UnfinishedBusiness.json","image_url":"https://media.npr.org/assets/img/2015/02/03/pixies-2004_wide-8a1e61c259609132e779bc9f49bf60255842381d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_therecord_2015_02_03_383507767_unfinished-business_1540238876.html","title":"Unfinished Business","title_page":"Unfinished Business : The Record : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Unfinished Business What The Charts Tell Us About The Comebacks Of Classic Indie Bands\nEnlarge this image toggle caption Tim Mosenfelder/Getty Images Tim Mosenfelder/Getty Images\nOne thing you can say for the improbable return of Olympia punk deities Sleater-Kinney: By the standards of a Greatest Indie Rock Band of Their Generation, it's off to a rousing start. Not just with critics and fans, but possibly also with people who've never bought a Sleater-Kinney album before.\nNo Cities to Love, the critically adored new album by the trio of Carrie Brownstein, Corin Tucker and Janet Weiss, arrived on last week's Billboard 200 album chart all the way up at No. 18. That is easily the highest berth ever achieved by a Sleater-Kinney album. Their last disc before a decade-long hiatus, 2005's The Woods, debuted and peaked at a modest No. 80; prior to Cities, that was S-K's only title to make the album chart's upper half, let alone the top 20. The new album debuts to first-week sales of 28,000, which in one week is already more than one quarter of the way to the total sales of each of their last four albums.\nIt's an encouraging comeback story for what has been called the best American rock band of the late '90s and early '00s. It's also, arguably, a better-planned relaunch than either of the previous indie-rock greats to attempt similar comebacks.\nI'm talking about Pixies and Pavement — a pair of bands also considered Velvet Undergrounds of their respective mini-eras, each of which took a decade off from active duty before improbably reforming. Pixies, the late '80s indie-punk colossus and inventor of the quiet-loud sound of '90s alternative rock, came back in 2004 for a second life that's still ongoing. And Pavement, standard-bearer of '90s slack-rock and so-called \"indie-est band ever,\" returned for a brief victory-lap tour in 2010.\nThese three groups form a very specific returning-band category. Sure, bands reforming for a lucrative tour and/or album after years of public denials is the oldest story in the book — everyone from The Eagles to The Police to Van Halen to Pink Floyd fit that description. But there's a crucial difference with those classic-rock dinosaurs — they had hits and sold out arenas the first time around, and their comebacks were reboots of already-lucrative machines. Or, on the complete opposite end of the spectrum, the recent returns of indie obsessions My Bloody Valentine and Neutral Milk Hotel after years of inactivity did much to reenergize and reaffirm their grass-roots fanbases. But Kevin Shields's and Jeff Magnum's respective noms de bande had such small recorded legacies, and were gone so long (22 and 15 years, respectively), those comebacks felt vital but more marginal.\nTo be sure, one shouldn't overstate the size of Pixies', Pavement's or Sleater-Kinney's fanbases, either. Indeed, given the sheer amount of press and praise these three bands have received, a walk through their sales and chart histories offers a chill-wind realization of what it means to be called \"greatest indie band of your generation\" — that and four bucks will buy you a latte.\nIn one of my periodic attempts to merge two of my obsessions — Gen-X rock and chart nerdery — I asked the helpful folks at Nielsen Soundscan for a breakdown of these three bands' career stats. Let's take each band, run down its sales history and consider the X-factors (no pun intended) that gave Pixies, Pavement and Sleater-Kinney whatever success they've had. I'll go in chronological order, listing only canonical albums and EPs and major compilations. I'm including each disc's Billboard album-chart peak, if any; cumulative sales through January 2015; and — in very rare cases — gold status, which is the RIAA's certification for shipment of 500,000 albums. (Forget platinum. These bands don't do platinum.)\nPIXIES\nStudio albums/EPs*:\nCome on Pilgrim EP (1987, did not chart): 198,000\nSurfer Rosa (1988, did not chart): 705,000, certified gold\nDoolittle (1989, No. 98): 834,000, certified gold\nBossanova (1990, No. 70): 281,000\nTrompe le Monde (1991, No. 92): 359,000\nIndie Cindy (2014, No. 23): 34,000\nCompilations:\nDeath to the Pixies (1997, No. 180): 148,000\nWave of Mutilation: Best of Pixies (2004, No. 161): 316,000\n* SoundScan data begins May 1991; cumulative sales for pre-1991 albums are higher.\nMore than a decade after this seminal Boston foursome put aside their (deep, abiding) differences to reunite at Coachella 2004 and launch a tour, it may be hard to remember how impossible it seemed before it actually happened, and what a shock it was when it did. In the years since, the reunion of Charles \"Black Francis/Frank Black\" Thompson, Joey Santiago, David Lovering and Kim Deal (who is now out of the band again) has essentially become the template for how a small but influential band can reunite profitably. By Thompson's own admission, Pixies' decade-long post-reunion tour has been motivated more by the band's bottom line than by any great artistic motivation. But back in the mid-2000s, what inspired fans was watching the band that codified — then scarcely profited from — the sound of '90s rock get their belated chance at classic-rock glory.\nIt's impossible to know precisely how well most of Pixies' albums did, because their original active period — from 1985 until their spiteful 1993 breakup by fax — spans the years both before and after the 1991 launch of SoundScan. In those pre-SoundScan days, industry sales data were exceedingly fudgeable and unreliable. But the band's post-'91 stats are still illustrative, and a few things are clear from the data we do have.\nFor one thing, while Pixies broke up without a single gold album to its name, that changed in the mid-'90s. The band's 1989 major-label debut Doolittle was quietly certified gold in November 1995, right around the commercial peak of so-called Modern Rock radio. Years of post-Nirvana quiet-loud bands citing Pixies as an influence clearly sent some fans back to the album that contained what were, to that point, their best-known songs: \"Monkey Gone to Heaven\" (which peaked at No. 5 on the Modern Rock chart) and \"Here Comes Your Man\" (Modern Rock No. 3).\nThat album, and those songs, would come to be eclipsed in Pixies' canon thanks to Hollywood. In late 1999, the millennial cinema classic Fight Club closed with a now-iconic scene that pairs Pixies' \"Where Is My Mind\" with the film's (anti)hero watching a city crumble. This movie moment — as anyone who's listened to rock radio since 2000 will tell you — made \"Mind\" the ur-song in Pixies' catalog; it did for that track what the last Sopranos episode did for Journey's \"Don't Stop Believin'.\" And the band's sales history since then reflects it: Surfer Rosa, the 1988 album containing \"Mind\" (and Pixies' last to be distributed entirely by indies 4AD and Rough Trade before a switch to Elektra on Doolittle), was certified gold in April 2005. At this point, while Doolittle still boasts a higher cumulative SoundScan total than Surfer Rosa, the fact that Rosa is only about 130,000 copies shy of the former — remember, Doolittle earned its gold certification a full decade earlier — indicates how much \"Mind\" and Rosa rose in public esteem after Fight Club. A 2014 Apple iPhone ad containing Rosa's other classic track, Kim Deal's priapic \"Gigantic,\" has only further burnished the album's commercial cred.\nThe point is, even for a once-subversive band like Pixies, extraneous factors like movies and TV matter, probably more than even a celebrated reunion does. The 2004 best-of Wave of Mutilation, timed for the band's reunion and tour, has done more than respectable business over the last decade at 316,000 copies, but it's still far from gold (Rosa has probably sold about that many copes over that period). The evidence also shows a reunion isn't guaranteed to boost a new recording, either. Indie Cindy, the 2014 album that was Pixies' first new disc since 1991's Trompe le Monde, debuted and peaked at No. 23 — ironically, the band's first and only Top 40 album — but sales during its nine-month existence have been anemic (10K in its first week, 34K total).\nThe fact that the band finally chose to record after Kim Deal walked out, and that Indie Cindy has been widely panned, offers lessons for any band considering a return to the studio so long after a reunion. Anyway, before we compare Pixies' experience as a middle-aged recording act to Sleater-Kinney's, let's explore the control group in this thought experiment: a band that did the lucrative-reunion thing but not the new wax platter.\nPAVEMENT\nStudio albums/EPs:\nSlanted and Enchanted (1992, did not chart; 2002 reissue No. 152): 292,000\nWatery, Domestic EP (1992, did not chart): 38,000\nCrooked Rain, Crooked Rain (1994, No. 121): 357,000\nWowee Zowee (1995, No. 117): 179,000\nBrighten the Corners (1997, No. 70): 190,000\nTerror Twilight (1999, No. 95): 116,000\nCompilations:\nWesting (By Musket & Sextant) (1993, did not chart): 71,000\nQuarantine the Past: The Best of Pavement (2010, No. 170): 30,000\nThe kings of always holding back and not giving a fuck, this California-by-way-of-Virginia fivesome — Mark Ibold, Scott \"Spiral Stairs\" Kannberg, Bob Nastanovich, Steve West and frontman Stephen Malkmus — make an apt bridge between Pixies and Sleater-Kinney. Pavement's entire recording career, save for their micro-distributed 1989 debut EP, is encapsulated within the 1990s, making them the quintessential band for the decade of irony. The band's peak also lined up neatly with the peak of alternative rock; indeed, if you consider alt-rock's zenith to be 1993 or 1994, Pavement are the only band of these three that was recording at the time and really caught the wave at all.\nAs such, you might think Pavement would have done a little better commercially. If Liz Phair and the Butthole Surfers could score gold albums at alt-rock's height, why couldn't Malkmus's band of snarky pranksters? Perhaps it was because they never evinced any interest in pandering, if they even knew how to pander. Accordingly, of these three bands that reunited after a decade away, Pavement's reunion in 2010 felt the most tossed-off and unassuming (\"[T]his tour is not a prelude to additional jaunts and/or a permanent reunion,\" their 2009 announcement read), even as the shows earned rapturous reviews and larger crowds than the band had ever seen in the '90s.\nAs for Pavement's SoundScan history, their sales were certainly quite consistent, with all five of their canonical full-length albums on über-indie Matador Records selling a low-six-figure sum. They range from a high-water mark of 357K for Crooked Rain, Crooked Rain to a low of 116K for their swan song, the Nigel Godrich–produced Terror Twilight. (How untrendy were Pavement? Their lowest-selling album came out in 1999, the high point for the music industry, when everyone from Matchbox Twenty to Radiohead was minting platinum. It takes a special brand of slacker indifference to underperform in that environment.) Thanks to the aforementioned MTV, Crooked Rain became their best-seller in '94 thanks in no small part to containing the band's one actual video/radio hit: \"Cut Your Hair,\" the career-minded (or Korea-minded) track that's their only song ever to appear on a Billboard chart (Modern Rock No. 10).\n\"Hair\" is also basically Pavement's only pop-culture X-factor, which explains why they never became a major unit-shifter. What about Hollywood? \"Hair\" only appeared on the soundtracks of A Very Brady Sequel (1996) and Jackass Number Two (2006), neither one a film classic. Influence? Without a doubt, all of 21st-century indie culture owes them a debt — but indie-rock of the last 15 years has been considerably more earnest-sounding than Pavement, even the sardonic stuff. New material? With hindsight, the moment for Pavement to drop a new album would have been 2008 or 2009, when Brooklyn-hipster culture was at its height in the form of MGMT, TV on the Radio, Dirty Projectors, Animal Collective and Grizzly Bear. But one imagines Malkmus, Kannberg & co. would actively avoid that scene — they were never all that beardy, anyway.\nThe only album timed for Pavement's 2010 reunion was their greatest...um, \"hits\" compilation Quarantine the Past, a collection Matador put together early that year as the tour was gearing up. To date, it has shifted a measly 30,000 copies. To be fair, its Billboard chart peak (No. 170) was not drastically different from other 2000s archival releases from Matador like the special editions of Slanted and Enchanted (No. 152, 2002) or Wowee Zowee (No. 185, 2013). Which all suggests that Pavement's popularity has a ceiling. And that they were perhaps wise not to try recording again and potentially sully their legacy — a pitfall Sleater-Kinney were desperate to avoid.\nSLEATER-KINNEY\nStudio albums/EPs:\nSleater-Kinney (1995, did not chart): 25,000\nCall the Doctor (1996, did not chart): 60,000\nDig Me Out (1997, did not chart): 130,000\nThe Hot Rock (1999, No. 181): 97,000\nAll Hands on the Bad One (2000, No. 177): 98,000\nOne Beat (2002, No. 107): 90,000\nThe Woods (2005, No. 80): 94,000\nNo Cities to Love (2015, No. 18): 28,000 (first week)\nCompilations:\nStart Together (box set) (2014, No. 176): 3,000\nIn a probing interview with Jessica Hopper, an editor at Pitchfork, Carrie Brownstein, Corin Tucker and Janet Weiss talk candidly about the self-applied pressure to not only reform Sleater-Kinney but also generate an album worthy of its legacy:\nThey wanted to get it perfect. \"We didn't want to put out something where people were like, 'Wow, they really fucked this up!'\" says Brownstein. \"On your third record, there is a next time. But there would not be a next time if we fucked this record up. We did a ton of work on the songs — we would throw away a song we had been practicing for two weeks. The three of us can get in a room and start making songs that sound like Sleater-Kinney pretty fast, but that's not necessarily good enough. We had to find a new approach to the band.\"\nIt's hard to read this exchange and not have Pixies in mind, given Indie Cindy's artistic failure and vestigial-tail cultural status. But throwing sales into the picture actually provides an even richer context for comparison: Pixies could afford to shrug off Cindy as a low-selling lark; they'll be shifting a few thousand copies a year of Surfer Rosa and Doolittle to generations of new rock fans. For Sleater-Kinney, however, returning with an album as strong as No Cities to Love might actually improve upon their history.\nBecause despite all their glowing press coverage, Sleater-Kinney's sales even in their heyday were very limited — even for an indie band, even for a punk band. No S-K album has surpassed the band's 1997 classic Dig Me Out, which at 130K has sold just slightly more than Pavement's worst-seller Terror Twilight. And did I say Pavement were consistent? Take a look at the absurdly tight range of 90K-plus for S-K's last four albums before their hiatus — only 8,000 copies separates the lowest of the bunch, 2002's One Beat, from the highest, 2000's All Hands on the Bad One. Forget American gold; these four albums wouldn't qualify as Canadian platinum. It's as if 90,000 Americans joined a Sleater-Kinney fan club in 1997 and told the rest of the country to go buy Goo Goo Dolls albums and leave them alone.\nWhy couldn't Sleater-Kinney break out of their modest-selling lane? One can't take gender out of the equation — the depressing fact is, riot-grrrl never produced a platinum-seller (unless one counts riot-grrrl apostate Courtney Love). But a simpler, and perhaps related, explanation was that SK never scored even a minor hit single. In a just world, \"You're No Rock n' Roll Fun\" would've been a Modern Rock No. 1; but no song of theirs ever graced a Billboard chart back in the day, unlike one-hit wonders Pavement. For a band that said they wanted to be our Joey Ramone, Sleater-Kinney arguably had what I'd call a Ramones problem: S-K's album roster is consistently high-quality but with no fluke radio songs — not even the ones that deserved to be hits.\nThe new album is certainly off to an auspicious start, but one wonders what catalyst will make Sleater-Kinney's 2015 return more successful than the band's first decade. Of course, there is one pop-culture elephant in the room: Carrie Brownstein's left-field comic celebrity as one-half of TV's Portlandia with Fred Armisen. S-K fans would certainly prefer that the band succeed on the strength of their tunes — but as Hopper chronicles in her Pitchfork profile, the band appears to regard Carrie's newfound red-carpet status as a help, not a hindrance, in their desire to generate healthy interest in their return.\nIn fact, not to take anything from either Pixies or Pavement, but so far it seems like Sleater-Kinney has (subconsciously) absorbed all of its forbears' reunion lessons and done this comeback thing right. Unlike Pavement, they waited until a wider — but still tasteful — circle of people had become aware of them, and their tour will hopefully play to more than just the faithful. Unlike Pixies, they generated their own pop-cult X-factor, and they didn't wait a full decade into the reunion — and after a key band member left — to record a new album. Plus, duh, they made sure the new album was great. It's easy to look for patterns among seminal bands like these, but what's most heartening about the Sleater-Kinney reunion is that they're refining the pattern, then throwing it away.","url":"https://www.npr.org/sections/therecord/2015/02/03/383507767/unfinished-business"}
