{"authors":["Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:52:38","date_modify":"2018-10-30 22:52:38","date_publish":"2016-11-10 08:00:00","description":"As a state bluer than Lake Tahoe in sunlight, California has adopted a slew of progressive policies that drive Donald Trump nuts. They combat climate","filename":"data/vaneerConsumption/UnfundedorundoneATrumppresidencyeyesCaliforniapolicies.json","image_url":"https://calmatters.org/wp-content/uploads/TrumpPresidencyPhoto.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939958.html","title":"Unfunded or undone: A Trump presidency eyes California policies","title_page":"Unfunded or undone: A Trump presidency eyes California policies | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"As a state bluer than Lake Tahoe in sunlight, California has adopted a slew of progressive policies that drive Donald Trump nuts. They combat climate change, protect undocumented immigrants, evangelize for Obamacare and more.\nSo this week—as candidate Trump morphed into President-elect Trump—uncertainty swept the state. While protesters hit the streets and the hashtag #Calexit spiked with residents semi-seriously advocating U.S. secession, policy-makers scrambled to identify state programs at risk in the coming Trump administration.\nThe Legislature’s top leaders, both Democrats, issued a rare joint statement promising to “maximize the time during the presidential transition to defend our accomplishments using every tool at our disposal.”\n“We will be reaching out to federal, state and local officials to evaluate how a Trump presidency will potentially impact federal funding of ongoing state programs, job-creating investments reliant on foreign trade, and federal enforcement of laws affecting the rights of people living in our state,” said Senate President Pro Tem Kevin de Leon of Los Angeles and Assembly Speaker Anthony Rendon of Paramount.\nThe politically savvy were warning not to expect any special favors from the President-elect, given this reception by California. Although some Californians cheered him as an overdue antidote to what they see as their state’s foolhardy liberal excesses, voters statewide rejected Trump by a 28-point spread—only Hawaii and Vermont gave him a colder shoulder.\nCalifornia really is a different world\nIn California, Democrats control the statehouse—powerful Republican politicians are about as endangered a species as the Delta smelt. But with Republicans poised to take control of everything in Washington, here’s a look at policies that experts say are in jeopardy of being unfunded, undercut or utterly undone:\nThe environment:\nThere may be no greater point of departure from the policies of a Trump administration than California’s leading-edge environmental programs. On Thursday, Gov. Jerry Brown issued a statement noting the country’s deep divisions. “In California, we will do our part to find common ground whenever possible,” he said. “But as Californians, we will also stay true to our basic principles. We will protect the precious rights of our people and continue to confront the existential threat of our time—devastating climate change.”\nBy way of contrast, candidate Trump tweeted and often repeated his view that climate change is a hoax invented by China.\nBut could President Trump reach into California and unspool many of the state’s signature climate policies?\n“The overwhelming majority of our climate programs are rooted in state law,” said Annie Notthoff, the director of California advocacy for the Natural Resources Defense Council. “The California public, time and time again, has supported state action on climate. More than 60 percent of voters are willing to pay more for clean energy. You have a very willing public and strong laws.”\nTrump has reportedly tapped Myron Ebell, a well-known climate skeptic, to lead his Environmental Protection Agency transition team. The agency has a broad portfolio: overseeing federal air and water laws, regulating toxic substances and setting national emissions standards for automobiles and industry. As such, it is frequently in the crosshairs of business interests and Republicans in Congress who perceive it as an overlord issuing onerous regulations.\nWhen California attempted to exercise special authority to regulate tailpipe emissions, it initially tried and failed to get a waiver from the federal EPA to do so under the Bush administration in 2005. Only after President Obama’s election and intervention in the process in 2009 did the EPA grant California its waiver. That episode underscores the fed authority to override state intentions.\nIt would be a “nightmare scenario” if the Trump administration imposed national rules to overrule state climate policies, said Ethan Elkind, director of the Climate Program at UC Berkeley School of Law. “Congress could preempt most of California’s climate agenda if they had the political support to do that,” he said. “Once the federal government takes an action on an issue, they could preempt the field.”\nApart from the feds, the governor seems determined to forge his own path for California—undertaking independent agreements with others states and nations to form carbon trading markets and agree to emissions limits.\nThe federal government also plays a significant role in water policy in California, paying for some projects and signing off on others.\nCase in point: According to an economic analysis commissioned by the state, California’s water fix in the Delta is dependent on federal help. Gov. Jerry Brown’s plan to build 40-foot wide tunnels to ferry water from the Sacramento River to serve cities and farms to the south is only viable with $4 billion in funding from Washington, the report found.\nEven as multiple state agencies mobilized to address the prolonged drought, candidate Trump told an audience in Fresno earlier this year that, “There is no drought.” He blamed state officials for cutting off water to farmers to benefit endangered fish, and vowed to let more water flow to farmers, without specifying how. “We’re going to solve your water problem,” he said. “You have a water problem that is so insane. It is so ridiculous where they’re taking the water and shoving it out to sea.\nSpeaking of the sea, California—which ranks third among oil-producing states—has not yet fully exploited its federal territory more than three miles offshore. Those troves of oil and gas have not been leased for years, thanks to Congressional and presidential moratoria and a lack of industry interest. That could change under a Trump-appointed Interior Secretary who could order federal agencies here to open more land on and offshore for energy prospecting. Among the names being floated for the post: former GOP Alaska Gov. Sarah Palin, who has summed up her energy approach in three words: “Drill, baby, drill.”\nOn the clean energy front, California has been at the forefront in both renewable energy production and clean energy innovation. Both emerging sectors have been incubated by billions in federal tax incentives and research grants that could evaporate at any time.\nThe state’s push to decarbonize the energy grid and electrify transportation is supported in part by tax credits and rebates that are entirely discretionary. While the solar energy industry is robust and enjoys a wide market, other programs are less able to wean off federal assistance.\n“A lot of our efforts in California are supported by the federal government. Our electric car goals are supported by federal tax credits and funding, as is the electric vehicle charging infrastructure, the battery storage technology…” Elkind said. “Federal support makes it cheaper for us to meet the carbon reduction goals we have in California, which are in danger if we see a retrenching in policy.”\nHealth care:\nThe Affordable Care Act, or Obamacare, hangs in the balance after the sweeping win on Tuesday by President-elect Donald Trump, who called it “a catastrophe” and promised to kill it immediately. This week GOP leaders continued to cite its repeal as their top priority.\nThat has big implications for California, a state that enthusiastically embraced the federal expansion and relied on federal dollars to pay for it.\n“Can he effectively limit the program as of the first day or early in the administration? Absolutely,” said Gerald Kominski, director of the UCLA Center for Health Policy Research. “He’s not going to be able to have any credibility with his constituents if he starts waffling on day one.”\nKominski said the Trump administration could begin to dismantle the program almost immediately by taking away federal funding. California receives $20 billion a year through the program—both for subsidies that allow some 1.2 million people to purchase health insurance on the Covered California state exchange, and to fund its expansion of Medi-Cal health care to cover an additional 4 million people who can’t afford to buy health insurance on their own.\nOf course Trump hasn’t just promised to repeal Obamacare—he’s vowed to replace it.\nBut other than extolling the virtues of “the free market,” Trump’s health care plan is vague—there are no details about a complete replacement plan that would provide insurance options for those that would be dumped from the exchange.\nKominski said in California up to 3 million people could lose coverage—and that if funding is hollowed out, California lawmakers will have tough decisions to make.\nThe administration could, of course, break the Affordable Care Act into pieces—keeping some popular components such as allowing young people to stay on their parents’ insurance until they are 26. That’s the expectation of Sandra Hernandez, president and CEO of the California Health Care Foundation, a nonprofit that works to improve health care access for low-income Californians.\nImmigration:\nImmigrant advocates are already mobilizing to challenge the promises of President-elect Trump, who vowed to create a deportation force to expel up to 11 million undocumented immigrants.\n“Our state has long been a leader in working to protect rights of immigrants in the face of harmful federal policies,” said Cynthia Buiza, executive director of the California Immigrant Policy Center. “Thus we call on Gov. Brown and all of the leaders in our state—and all people of conscience—to demonstrate bold leadership and do everything in their power to protect each and every immigrant who calls our state and our nation home.”\nAfter Trump appointed Kansas Secretary of State Kris Kobach Secretary to his transition team, California Secretary of State Alex Padilla on Thursday released a statement calling it “a deeply troubling message that telegraphs an imminent assault on our collective voting rights and civil rights. His participation is a threat to diverse communities throughout our nation. Kobach’s pattern of supporting racist, anti-immigrant policies including voter suppression and racial profiling laws, such as Arizona’s SB 1070, are not only divisive, but have repeatedly been found unconstitutional.” The Arizona measure would have required police to demand proof of citizenship if they suspected someone of not being a citizen.\nAdvocates are especially worried about the four-year-old Deferred Action for Childhood Arrivals program, which allows young people brought to the country as children who meet certain requirements to work legally without fear of deportation. It currently protects nearly 800,000 young people—nearly half of them Californians.\nPresident Obama created this program through an executive order. A President Trump has promised to “immediately terminate” it.\n“If they repeal the executive actions, they have to face the fact that they would transfer more than half a million legal workers into the shadows,” said Joseph Villela, policy director for the Coalition for Humane Immigrant Rights Los Angeles.\nVillela said the administration would have to take the economy into account before canceling DACA or deporting millions of people, many who hold jobs in top immigrant labor sectors like agriculture and construction\nTrump has also promised to stop federal funds for sanctuary cities, which have ended or stopped cooperating with immigration enforcers. There are more than 30 sanctuary cities in the nation and many of them are in California, including San Francisco, Oakland, Los Angeles and Santa Ana. Immigrant advocate groups, cities and others concerned about these changes started meeting almost immediately after the election but are not yet revealing their exact strategies going forward.\nEducation:\nCalifornia made college accessible and affordable for undocumented immigrants when Gov. Brown signed legislation in 2011 granting them access to in-state tuition and financial aid. Fear that Trump would try to roll that back—not to mention pursuing deportation—coursed through college campuses across the state this week.\nWhile a Trump administration might pursue deportation efforts, activists insist he can’t touch any protections for immigrants enshrined in state law.\n“We feel these protections are sound and will remain in place once Trump takes office,” said Carlos Amador, lead organizer for the California Immigrant Policy Coalition, a nonprofit advocacy group based in Los Angeles. Still, he urged undocumented students to “organize and push back” should any challenges to state law crop up.\nSeeking to quell students’ anxiety, University of California President Janet Napolitano released a statement Wednesday with UC’s chancellors pledging to root out intolerance and squash it. “In light of yesterday’s election results, we know there is understandable consternation and uncertainty,” Napolitano wrote. But “diversity is central to our mission” and “we remain absolutely committed to supporting all members of our community.”\nThe lone K-12 policy proposal Trump touted on the campaign trail—boosting school choice with a $20 billion federally funded voucher program—isn’t expected to impact California much either, education policy experts say. Since states would likely need to apply for those funds, California could avoid adopting the policy by declining to apply.\nTrump’s appointment to the U.S. Supreme Court, however, could have huge implications for California’s labor unions.\nEarlier this year, several weeks after Justice Antonin Scalia’s death, the court deadlocked 4-4 in Friedrichs v. California Teachers Association, a case that sought to strip public-sector unions of their right to collect fees from workers who choose not to join. Once Trump appoints Scalia’s replacement, the case could be revived —and likely wouldn’t be decided in the union’s favor, said Jack Pitney, a political science expert at Claremont McKenna College.\n“It’s not that Trump himself is focused on this case. But the strategists around him surely are,” Pitney said. “If I were a CTA official, I wouldn’t be sleeping well these days.”\nThe economy:\nCalifornia’s $2.4 trillion economic engine, the sixth-largest largest economy in the world, has outpaced the rest of the nation on multiple fronts: job growth, wages and housing prices. The technology industry continues to flourish and exports are up 31 percent from the recession.\nBut the election of Donald Trump is causing some economic forecasters to change their outlook.\nBeacon Economics released a report Thursday warning that Trump’s pledge to slash taxes would widen the federal deficit; bowing out of U.S. commitments to free trade would disrupt supply chains and drive up consumer prices; and deporting millions of immigrants without legal documents would cause massive disruption, let alone trigger a “human tragedy.”\n“Any of these three issues, if pursued vigorously, has the potential to cause a recession,” writes Christopher Thornberg, one of the authors.\nCalifornia business interests are gearing up to protect the Trans-Pacific Partnership, an agreement among 12 Pacific Rim countries to expand trade. The deal is touted by supporters for boosting sales of everything from laptops to almonds, and adding jobs in a state that already exports $71.6 billion of goods to those partner countries.\nPeter Leroe-Munoz, vice president of technology and innovations at the Silicon Valley Leadership Group, said trade-related jobs pay 15 to 18 percent higher than workers whose companies only sell domestically.\n“As Silicon Valley adjusts to the new political reality, we’re still hopeful,” Leroe-Munoz said. “We’re working to make sure President-elect Trump has the full picture of the innovation economy. … We’re fully aware this is going to be a big political lift.”\nA Trump presidency also brings uncertainty for tens of thousands working in California’s shipping industry, says Robert Kleinhenz, another economist with Beacon Economics. For example, the ports of Los Angeles and Long Beach make up the largest port complex in the Western Hemisphere and handles 30 to 40 percent of containers that flow into the country. “Just the idea that he would like to revisit our trade agreements in the Pacific Rim certainly raises concerns about goods flow in California,” Kleinhenz said.\nGov. Brown’s finance spokesman H.D. Palmer cautioned “it’s far too early to speculate” about the consequences of a Trump presidency.\nSince the adoption of the Affordable Care Act, California has been drawing down significantly more federal dollars to help insure low-income residents. This year, the state is expecting $96 billion from Washington, D.C., on top of its own $171 billion budget.\nLess clear are the big-ticket, controversial infrastructure projects like California’s high-speed rail. While Trump has endorsed federal infrastructure spending, his fellow Republicans in Congress are wary of increased federal spending. Trump has also suggested spurring infrastructure spending through public-private partnerships but thus far, it’s unclear if companies will invest their own capital to help build and operate the bullet train.\nReported by Elizabeth Aguilera, Jessica Calefati, Julie Cart, Judy Lin and Matt Levin of CALmatters.","url":"https://calmatters.org/articles/unfunded-or-undone-how-a-trump-presidency-may-affect-california/"}
