{"authors":["Associated Press"],"date_download":"2018-10-23 01:44:01","date_modify":"2018-10-23 01:44:01","date_publish":"2017-03-16 11:59:33","description":"PARIS (AP) - The United Nations on Thursday announced nine possible candidates on a shortlist to replace the chief of UNESCO, the world body's Paris-based...","filename":"data/vaneerConsumption/UNhas9candidatesonshortlistforculturalagencychief.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319914_UN-reveals-Arab-heavy-shortlist-cultural-agency-chief_1540259041.html","title":"UN has 9 candidates on shortlist for cultural agency chief","title_page":"UN has 9 candidates on shortlist for cultural agency chief | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PARIS (AP) - The United Nations on Thursday announced nine possible candidates on a shortlist to replace the chief of UNESCO, the world body's Paris-based cultural agency, including four Arab candidates.\nCommentators have warned that a chief from an Arab nation will enflame divisions in UNESCO, which frequently has found itself used as a theater for political disputes between Israel and Arab nations.\nThe U.N. cultural organization took a huge blow in 2011 when the United States cut funding for it after a vote fueled by Arab-nation lobbying admitted Palestine as a member state, inflaming Israel. That represented 22 percent of UNESCO's entire funding.\nLast year, UNESCO's executive board approved a resolution that Israel said denies the deep historic Jewish connection to holy sites in Jerusalem - a move that has angered Israel's government and many Jews around the world.\nBut Arab nations say it's their turn to head the body. They note UNESCO has had European, Asian, African and American chiefs, but never an Arab one since the organization was founded in 1945 following World War Two to promote world peace through culture.\nEgypt has been lobbying hard for its choice, former minister Moushira Khattab, after it lost the 2009 nomination to current chief Irina Bokova of Bulgaria, who's stepping down this year after two terms. Khattab robustly defended her candidacy to The AP on Thursday - saying that Egypt's history of dialogue with Israel would make it uniquely positioned to heal wounds in the organization.\n\"Don't forget that we started peace with Israel,\" Khattab said from Cairo, referring to the 1979 Egypt-Israel Peace Treaty that made Egypt the first Arab state to officially recognize Israel. \"Over decades, and despite the upheavals that we've seen in the very recent six years, we've still maintained the peace. Egypt is a country that ... believes in dialogue.\"\nThe other Arab candidates include Qatar's Hamad bin Abdulaziz al-Kawari, Iraq's Saleh al-Hasnawi and Lebanon's Vera el-Khoury Lacoeuilhe.\nAlso on the shortlist are Guatemala's Juan Alfonso Fuentes Soria, Vietnam's Pham Sanh Chau, Azerbaijan's Polad Bulbuloglu, China's Qian Tang, and France's Culture Minister Audrey Azoulay.\nAzoulay's candidacy, which has the backing of French President Francois Hollande, is considered powerful because UNESCO's headquarters is based in Paris.\n___\nThomas Adamson can be followed at Twitter.com/ThomasAdamson_K","url":"https://www.dailymail.co.uk/wires/ap/article-4319914/UN-reveals-Arab-heavy-shortlist-cultural-agency-chief.html"}
