{"authors":[],"date_download":"2018-10-23 00:31:48","date_modify":"2018-10-23 00:31:48","date_publish":"2016-01-29 13:31:19","description":"The UN insisted that high-stakes peace talks aimed at ending the brutal, five-year-old Syrian conflict would still begin in Switzerland later Friday despite ...","filename":"data/vaneerConsumption/UNinsistsshakySyriapeacetalkstogoahead.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h6zr-4PuZeKVXE7cd9005b2c876a733b4-271_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422225_Syria-peace-talks-kick-Geneva-without-key-figures_1540254708.html","title":"UN insists shaky Syria peace talks to go ahead","title_page":"UN insists shaky Syria peace talks to go ahead | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UN insists shaky Syria peace talks to go ahead\nThe UN insisted that high-stakes peace talks aimed at ending the brutal, five-year-old Syrian conflict would still begin in Switzerland later Friday despite uncertainty over whether key groups would even attend.\nUN envoy Staffan de Mistura \"will start by meeting the government's delegation today (Friday)\" in Geneva, followed by talks with \"other participants\", the United Nations said in a statement.\nThe Syrian government delegation, headed by Syria's envoy to the UN Bashar al-Jaafari, arrived in Geneva early afternoon, a source said.\nMore than 260,000 people have been killed in Syria's war ©Karam Al-Masri (AFP/File)\nOpposition figures not part of the umbrella group High Negotiations Committee (HNC), said they would be present.\nHowever, despite Western pressure on the HNC, it has yet to decide whether to come and was engaged in a fourth day of discussions in Saudi Arabia on Friday.\nThe talks, backed by all the external powers embroiled in the war, are the biggest push yet to end a conflict that has killed more than 260,000 people and facilitated the meteoric rise of the extremist Islamic State (IS) group.\nThe highly complex conflict, now almost five years old, has also destabilised the already restive Middle East and drawn in not only regional powers like Saudi Arabia, Iran and Turkey but also the United States and Russia.\nIt has also forced millions of Syrians from their homes, many of them into neighbouring states and further afield, causing a major political headache for the European Union which received around a million migrants in 2015.\nDe Mistura issued on Thursday an emotional video message to the Syrian people both inside and outside the country saying that after previous failures, this new effort \"cannot fail\".\n\"Five years of this conflict have been too much. The horror is in front of everyone's eyes,\" de Mistura said. \"You must know also that we count on you to raise your voice to say 'khalas' (\"stop\" in Arabic).\"\n- Vienna Process -\nThe Geneva negotiations, if they happen, would not be a face-to-face conversation between the regime and its opponents. Instead they are \"proximity talks\" when go-betweens shuttle between the different participants.\nThey are part of an ambitious plan launched in Vienna in November by a raft of key actors including Russia, the United States, Gulf states, Iran and Turkey that foresees elections within 18 months.\nDespite Western pressure, the HNC is refusing to show up in Switzerland before an agreement is reached on aid reaching hundreds of thousands of people stuck in besieged towns.\nWith such an agreement highly unlikely in the immediate term, a senior delegate for the HNC told AFP that it may still decide later in the day to travel to the negotiations.\nThe HNC, which named Mohammed Alloush of the Islamist rebel group Army of Islam as its chief negotiator, has also asked for \"clarifications\" after the UN issued invitations to other opposition figures.\nIndividual invitations were reportedly issued to a list of figures opposed to the regime but who are thought to have closer ties to Moscow and have limited influence on the ground.\nRanda Kassis, a member of that list, told AFP in Geneva on Friday that despite the uncertainty on who would attend, \"something has to start. We have to think of the Syrian people.\"\nThe HNC and its Saudi and Turkish backers have also objected to the participation of Syrian Kurdish groups that have made key advances against IS in northern Syria in recent months.\nRussia, however, which has helped the regime of President Bashar al-Assad make inroads against rebels with air strikes since September, says Kurdish involvement is essential.\n- 'Inflexible' Assad -\nHaytham Manna, a longstanding opposition figure who is co-chair of the political wing of a Kurdish-Arab alliance, told AFP in Geneva he did not expect the discussions to begin until Monday.\nFrance-based Middle East analyst Agnes Levallois said the opposition was growing increasingly frustrated that the question of Assad's fate, a key stumbling block in previous talks, was being put off.\n\"Assad is feeling stronger and stronger so is being inflexible,\" she said.\nIranian President Hassan Rouhani, whose Shiite country also backs Assad and is at daggers drawn with Sunni regional rival Saudi Arabia, said in a visit to Paris on Thursday that the process would take time.\n\"We hope that these talks will succeed as soon as possible. But I would be surprised if they succeed very quickly because in Syria there are groups who are at war with the central government and also amongst themselves,\" French media quoted him as saying.\n\"There is interference in the internal affairs of Syria,\" he added.\nSyrian refugees ©Adrian Leung/Gal Roma (AFP)\nA member of the Syrian pro-government forces guards a road in the town of Rabia in Syria's coastal Latakia province ©Maher al Mounes (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3422225/Syria-peace-talks-kick-Geneva-without-key-figures.html"}
