{"authors":["Matt Turner"],"date_download":"2018-10-30 23:45:23","date_modify":"2018-10-30 23:45:23","date_publish":"2016-12-05 00:00:00","description":"Greg Hayes just described how the deal Carrier struck with President-elect Donald Trump could have a big consequence. Workers won't like this.","filename":"data/vaneerConsumption/UnitedTechCEOTrumpCarrierdealwillyieldautomationfewerjobs.json","image_url":"https://amp.businessinsider.com/images/58462c20ba6eb66d268b76b8-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_united-tech-ceo-says-trump-deal-will-lead-to-more-automation-fewer-jobs-2016-12_1540943123.html","title":"United Tech CEO: Trump-Carrier deal will yield automation, fewer jobs","title_page":"    United Tech CEO: Trump-Carrier deal will yield automation, fewer jobs - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"President-elect Donald Trump with workers during a visit to the Carrier factory on Thursday in Indianapolis. AP Photo/Evan Vucci Greg Hayes, the CEO of United Technologies, the parent company of the heating and air-conditioner manufacturer Carrier, just let slip a consequence of a deal struck to keep jobs in Indiana.\nAnd American workers won't like it.\nCarrier said last month that it would keep more than 1,000 jobs across two locations in Indiana, following pressure from President-elect Donald Trump. The decision was touted as a win for the incoming president, who had pledged keep the jobs from moving to Mexico.\nIn a wide-ranging interview with CNBC's \"Mad Money with Jim Cramer\" that aired Monday, Hayes set out the comparative advantages of moving to jobs to Mexico, the motivation behind his decision to keep those jobs in Indiana, and the ultimate outcome of the deal: There will be fewer manufacturing jobs in Indiana.\nBefore we get to that\nFirst, Hayes was asked what's so good about Mexico. Quite a lot, it turns out. From the transcript (emphasis added):\nJIM CRAMER: What's good about Mexico? What's good about going there? And obviously what's good about staying here?\nGREG HAYES: So what's good about Mexico? We have a very talented workforce in Mexico. Wages are obviously significantly lower. About 80% lower on average. But absenteeism runs about 1%. Turnover runs about 2%. Very, very dedicated workforce.\nJIM CRAMER: Versus America?\nGREG HAYES: Much higher.\nJIM CRAMER: Much higher.\nGREG HAYES: Much higher. And I think that's just part of these — the jobs, again, are not jobs on assembly line that people really find all that attractive over the long term. Now I've got some very long service employees who do a wonderful job for us. And we like the fact that they're dedicated to UTC, but I would tell you the key here, Jim, is not to be trained for the job today. Our focus is how do you train people for the jobs of tomorrow?\nSo Mexico has cheaper labor with a much more dedicated workforce, and these are the kinds of low-skilled jobs most people don't find that attractive. Elsewhere in the interview, he made clear that United Technologies intended to keep engineering jobs in the US and that these higher-skilled jobs were not at risk of being moved overseas.\n\"The assembly lines in Indiana — I mean, great people,\" Hayes said. \"Great, great people. But the skill set to do those jobs is very different than what it takes to assemble a jet engine.\"\nHayes was then asked why he decided to cancel the move to Mexico. From the transcript (emphasis added):\nGREG HAYES: So, there was a cost as we thought about keeping the Indiana plant open. At the same time, and I'll tell you this because you and I, we know each other, but I was born at night but not last night. I also know that about 10% of our revenue comes from the US government. And I know that a better regulatory environment, a lower tax rate can eventually help UTC of the long run.\nBut here's the kicker\nThe result of keeping the plant in Indiana open is a $16 million investment to drive down the cost of production, so as to reduce the cost gap with operating in Mexico.\nWhat does that mean? Automation. What does that mean? Fewer jobs, Hayes acknowledged.\nFrom the transcript (emphasis added):\nGREG HAYES: Right. Well, and again, if you think about what we talked about last week, we're going to make a $16 million investment in that factory in Indianapolis to automate to drive the cost down so that we can continue to be competitive. Now is it as cheap as moving to Mexico with lower cost of labor? No. But we will make that plant competitive just because we'll make the capital investments there.\nJIM CRAMER: Right.\nGREG HAYES: But what that ultimately means is there will be fewer jobs.\nThe general theme here is something we've been writing about a lot at Business Insider. Yes, low-skilled jobs are being lost to other countries, but they're also being lost to technology.\nEveryone from liberal, Nobel-winning economist Paul Krugman to Republican Sen. Ben Sasse has noted that technological developments are a bigger threat to American workers than trade. Viktor Shvets, a strategist at Macquarie, has called it the \"third industrial revolution.\"\nHayes said in the same interview that United Technologies was focused on how to \"train people for the jobs of tomorrow.\"\nIn the same breath, he seems to be suggesting the jobs it is keeping in Indiana are the jobs of yesterday.","url":"https://www.businessinsider.com/united-tech-ceo-says-trump-deal-will-lead-to-more-automation-fewer-jobs-2016-12"}
