{"authors":["The Associated Press"],"date_download":"2018-10-30 21:16:13","date_modify":"2018-10-30 21:16:13","date_publish":"2017-04-11 00:00:00","description":"The CEO of United Airlines has issued a stronger apology about a passenger who was dragged off a United Express flight, calling the confrontation \"truly horrific.\"","filename":"data/vaneerConsumption/UnitedCEOissuesnewapologyafterpassengerdraggedoffplane.json","image_url":"https://media.arkansasonline.com/img/photos/2017/04/11/AP17100757256101_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_apr_11_dragging-u_4f557b8ed18127d375d27cc938b82fce__page=1_1540934173.html","title":"United CEO issues new apology after passenger dragged off plane","title_page":"United CEO issues new apology after passenger dragged off plane","title_rss":"NULL","source_domain":"arkansasonline.com","text":"This Sunday, April 9, 2017, image made from a video provided by Audra D. Bridges shows a passenger being removed from a United Airlines flight in Chicago. (Audra D. Bridges via AP)\nThe CEO of United Airlines has issued a stronger apology about a passenger who was dragged off a United Express flight, calling the confrontation \"truly horrific.\"\nOscar Munoz said in a note to employees Tuesday that he continues to be disturbed by the events Sunday night in Chicago.\nHe said, \"No one should ever be mistreated this way.\"\nMunoz was widely criticized for two statements Monday about the altercation in which he described the 69-year-old man taken off the plane as \"disruptive and belligerent.\"\nOn Tuesday, Munoz said he was committed to \"fix what's broken so this never happens again.\" He pledged to review the company's policies for seeking volunteers to give up their seats, for handling oversold flights and for partnering with airport authorities and local law enforcement.\nThe company plans to share results of the review by April 30.\nRead Wednesday's Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2017/apr/11/dragging-united-passenger-sparks-outrage-anger/?page=1"}
