{"authors":[],"date_download":"2018-10-22 22:52:33","date_modify":"2018-10-22 22:52:33","date_publish":"2014-05-12 23:17:46","description":"The U.S. military is flying \"manned surveillance flights\" over Nigeria at the request of the Nigerian government.","filename":"data/vaneerConsumption/UnitedStatesSendingMannedFlightsOverNigeriatoLookforGirls.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/438046/140513-boko-haram-nigeria-6a_e8f0b7c7549fa3ae8feb99c93a0e8b60.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_united-states-sending-manned-flights-over-nigeria-look-girls-n103701_1540248753.html","title":"United States Sending Manned Flights Over Nigeria to Look for Girls","title_page":"United States Sending Manned Flights Over Nigeria to Look for Girls","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe U.S. military is flying \"manned surveillance flights\" over Nigeria at the request of the Nigerian government in search of the nearly 300 missing girls kidnapped by Boko Haram, senior U.S. officials confirmed to NBC News.\nWhile there had been reports the missions were being launched from a U.S. drone base in Niger, a senior defense official told NBC News on Tuesday that the flights were originating elsewhere. The official would not say where the flights originated.\nIn addition, U.S. intelligence officials are helping the Nigerians \"analyze\" surveillance photos from commercial satellites obtained by the Nigerian government, officials said separately.\n\"We have shared commercial satellite imagery with the Nigerians and are flying manned ISR (intelligence, surveillance and reconnaissance) assets over Nigeria with the government's permission,\" one senior administration official told NBC News.\nEarlier Monday, the Boko Haram terror group released a video of their leader saying they would consider giving the girls back in exchange for the release of militant prisoners.\nU.S. officials told NBC News on Monday that they believe the video is authentic, and outside experts said the video reveals that at least some of the girls are alive — or at least they were whenever it was recorded, sometime after the April 15 kidnappings. The video shows about 100 girls.\nVarious reports have said that the terrorists were selling the schoolchildren as \"brides\" to other Islamic fundamentalists across the borders in Cameroon and Chad for as little as $12 dollars.\nFifty-three girls managed to escape and 276 remain missing, officials say.\n— with Catherine Chomiak and Hasani Gittens","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/united-states-sending-manned-flights-over-nigeria-look-girls-n103701"}
