{"authors":[],"date_download":"2018-10-22 22:37:26","date_modify":"2018-10-22 22:37:26","date_publish":"2014-06-10 17:31:34","description":"The carrier's latest program changes are going to make earning a free flight an even bumpier ride.","filename":"data/vaneerConsumption/UnitedPlanstoAwardMilesBasedonFareNotDistance.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/127326/2d11297689-airbus-united-blocks_desktop_medium_8ff69d99af9abd9053a9641bae468c1a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_united-plans-award-miles-based-fare-not-distance-n127511_1540247846.html","title":"United Plans to Award Miles Based on Fare, Not Distance","title_page":"United Plans to Award Miles Based on Fare, Not Distance","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBuckle up, United fliers. The carrier's latest program changes are going to make earning a free flight an even bumpier ride — although a few travelers may benefit.\nUnited announced Tuesday that starting March 1, 2015, it will revamp its MileagePlus program to award fliers based on total ticket price, rather than miles flown. Regular travelers will earn five times their fare; elites will earn seven to 11 times the fare, depending on their tier.\nIt's the second major carrier to make such a change. Delta said in February it would link fare price and miles earned, starting Jan. 1, 2015. Other airlines, including Southwest and JetBlue, already base miles earned on traveler spending.\n\"This is playing well into the hands of Capital One and the other travel reward cards because, if you are a person who is buying lower-priced fares, lower-yield fares, the news so far this year has been bad for you.\"\nFor most fliers, United's program update is yet another nudge away from airline loyalty. Deal-hunters whose flights are restricted to one or two family vacations a year will earn even fewer miles on most itineraries. A round-trip economy flight from New York City to San Francisco, for example, might net 2,250 miles ($450 x 5)—less than half of the 5,130 miles flown.\nGiven that United hasn't announced any changes on its redemption side, where a round-trip domestic ticket costs 25,000 miles, many travelers will be that much further from redemption. \"Clearly the programs are being redesigned to favor high-yield passengers,\" said Jay Sorensen, president of IdeaWorksCompany, a frequent flier research firm.\nTravelers are usually better off these days picking a general travel rewards or cash back card, which are also based on fares, but let travelers earn and redeem for seats on any airline.\n\"This is playing well into the hands of Capital One and the other travel reward cards because, if you are a person who is buying lower-priced fares, lower-yield fares, the news so far this year has been bad for you,\" Sorensen said.\nStill, a few travelers may end up benefiting — generally those who are booking pricier fares, such as business travelers, said Brian Kelly, founder of ThePointsGuy.com.\nA silver lining for procrastinators: They'll get more miles. Fares tend to get pricier 14 days out from departure, and then again at seven days out. \"There will be a small minority who spend a huge amount on last-minute or refundable tickets, who will probably earn more,\" Kelly said.\nSome short-haul routes also offer the potential for better earnings, because fares under the old system typically carried a high cost per mile. The average one-way fare from New York City to Boston is $190, with a cost per mile of $0.95, according to FareReport.com. Under the new rules, a traveler would earn at least 950 miles each way, versus 201. That knocks the cost per mile to $0.20.There's also a potential loophole in partner fares. United said it will continue awarding miles based on distance for tickets booked through and operated by a Star Alliance or MileagePlus partner. (Those include Air Canada, Lufthansa, Aer Lingus, Hawaiian Airlines and Singapore Airlines, among others.) For a round-trip flight from Los Angeles to Hawaii, booking Hawaiian instead would net a traveler 5,112 miles, versus 3,350 for a $670 fare.\n\"There are some examples where someone could indeed earn 75,000 miles [the new program's per-flight maximum], if they have elite status and they're buying a business-class ticket,\" Sorensen said.\nThat's a strategy to approach with caution, however, especially if you're angling for elite status. \"You may earn more miles, but zero of those dollars spent will count toward elite-qualifying dollars,\" said Kelly. United's partner programs also, in some cases, vary miles earned by fare class as well as distance. Someone booking cheaper economy-class tickets between North America and Ireland on Aer Lingus, for example, might earn 50 to 75 percent of miles flown.","url":"https://www.nbcnews.com/business/travel/united-plans-award-miles-based-fare-not-distance-n127511"}
