{"authors":["Alex Swoyer"],"date_download":"2018-10-30 18:22:34","date_modify":"2018-10-30 18:22:34","date_publish":"2015-11-10 00:20:48","description":"At a school known for journalism, the press is being silenced. Protesters forced President Tim Wolfe of the University of Missouri to resign","filename":"data/vaneerConsumption/UniversityofMissouriRacialProtestersShoveMedia.json","image_url":"https://media.breitbart.com/media/2015/11/U-Missouri-Students-Block-Media-ConcernedStudent1950.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_09__1540923754.html","title":"University of Missouri Racial Protesters Shove Media","title_page":"University of Missouri Racial Protesters Shove Media","title_rss":"NULL","source_domain":"breitbart.com","text":"Students who protested at the University of Missouri – forcing President Tim Wolfe of the school to resign on Monday – are now pushing the media and reporters back physically, despite the university’s traditional support for the First amendment.\nThe heated exchange between student media and the radical protestors who built a human-wall around their tent encampment, has been posted on Youtube and on Facebook by Mark Schierbecker, a student at the University of Missouri.\nAn Asian-American photographer, Tim Tai, tried to take photographs of the protestors, and to walk into the center of the encampment, but he was blocked by a wall of mostly-white protestors. They would not let him pass, and gradually forced him back. Towards the end of the roughly six minute video, Tai is shoved, pushed and assaulted by the protesters.\nThe protestors would not reveal their names, and demanded not be be photographed.\n“We’re asking you to leave,” said one African-American student. “Our friend’s life was on the line,” he claimed.\n“What they need right now is to be left alone,” said a blond female protestor.\n“You lost this one bro, you lost this one bro, back up… back,” repeated another protestor.\n“Put the sign in his face,” said another protestor.\n“You do not respect our space,” said another protestor.\n“I’m walking forward,” said one tall man as he pushed Tai back. “It is our right to walk forward,” added a woman.\n“Who wants to help me to get this reporter our of here? I need some muscle over here,” said a red-headed protestor, when the cameraman, Schierbecker, got through the ring of protestors and took some video of the encampment.\nThe protesters – who call themselves “ConcernedStudent1950” – have put together a list of demands, although Wolfe has already resigned after the protesters claimed he didn’t address racial issues on campus.\nOne demand is that Wolfe write a public apology letter and read it aloud at a press conference.\nThe list of demands also states that Wolf must “acknowledge his white male privilege.”","url":"https://www.breitbart.com/politics/2015/11/09/university-of-missouri-protesters-push-journalists-prevent-coverage-of-racial-protest/"}
