{"authors":["Ben Kew"],"date_download":"2018-10-30 18:21:26","date_modify":"2018-10-30 18:21:26","date_publish":"2016-05-30 20:52:44","description":"The University of Missouri will use $1.1m to fund a \"diversity audit,\" despite a fall in both donations and enrollment figures.","filename":"data/vaneerConsumption/UniversityofMissouriSpending1MillionforDiversityAuditDespiteMillionsLostFollowingProtests.json","image_url":"https://media.breitbart.com/media/2015/11/GettyImages-496421764-mizzou.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_05_30__1540923686.html","title":"University of Missouri Spending $1 Million for 'Diversity Audit' Despite Millions Lost Following Protests","title_page":"University of Missouri Spending $1 Million for 'Diversity Audit' Despite Millions Lost Following Protests | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The University of Missouri will use $1.1m to fund a “diversity audit,” despite a fall in both donations and enrollment figures.\nThe independent audit, which will analyse the university’s “diversity and inclusion policies,” is a response to a year marred by race protests that forced out President Tom Wolfe and Chancellor R. Bowen Loftin in 2015.\nIn a statement, the university announced “the launch of a systemwide audit of diversity and inclusion polices, practices and procedures, continuing the process of building more diverse and inclusive environments throughout the UM System.”\n“The audit, part of a series of diversity, equity and inclusion initiatives announced in November 2015 by the University of Missouri Board of Curators, is expected to be completed by the end of the calendar year,” it continues.\nSince October, the university has also hired a chief diversity officer and initiated a “systemwide task force for diversity, equity and inclusion.”\nMissouri officials also announced plans to invest $2 million on a range of “diversity initiatives” alongside the independent audit.\nIn the aftermath the embarrassing debacle, the university has seen a $32 million deficit and a 20% drop in freshman enrollment, as donors and potential students were put off by the furore\\ surrounding the racial tensions.\nIn April of this year, Missouri also banned disruptive student protests, with offenders now facing the possibility of disciplinary proceedings affecting their degree or even police action.\nYou can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at ben@yiannopoulos.net","url":"https://www.breitbart.com/tech/2016/05/30/university-of-missouri-spending-1-million-for-diversity-audit-despite-millions-lost-following-protests/"}
