{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 18:20:05","date_modify":"2018-10-30 18:20:05","date_publish":"2015-11-09 05:08:36","description":"32 members of the University of Missouri-Columbia football team joined a hunger strike to protest purported acts of racism on campus.","filename":"data/vaneerConsumption/UniversityofMissouriFootballPlayersGoOnStrikeOverSupposedRacismonCampus.json","image_url":"https://media.breitbart.com/media/2015/11/university-of-missouri-hunger-strike-over-racism-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_08__1540923605.html","title":"University of Missouri Football Players Go On Strike Over Supposed Racism on Campus","title_page":"University of Missouri Football Players Go On Strike Over Supposed Racism on Campus","title_rss":"NULL","source_domain":"breitbart.com","text":"Over the weekend, 32 African-American members of the University of Missouri-Columbia football team joined a group of students staging a hunger strike to protest purported acts of racism on campus.\nThe team members vowed to boycott all practices, games, and team activities unless and until university President Tim Wolfe resigns from office.\nThe protests had begun earlier this month, launched by a grad student named Jonathan Butler who claimed that three acts of racism spurred his campaign.\nIn a letter posted to his Facebook page, Butler insisted that he started his campaign over several purported acts of racism on campus.\nButler claimed that a state law that prevents Planned Parenthood from conducting abortions on campus is an act of “racism.” In two other instances, Butler said that hazy rumors that some unknown and unidentified man yelled a racist comment from a passing truck and that a swastika was drawn in a dormitory bathroom in human feces—the latter a likely hoax—contributed to an atmosphere where students can’t “achieve their full academic potential.”\n“I already feel like campus is an unlivable space,” the student proclaimed. “So it’s worth sacrificing something of this grave amount, because I’m already not wanted here. I’m already not treated like I’m a human.”\nEven though Butler acknowledged that President Wolfe had nothing to do with these mysterious acts of “racism,” the student leader is still demanding that Wolfe resign or be fired apparently for not stopping such things.\nFor his part, university President Wolfe has decried the “racism” on campus and pledged to support an internal investigation. Wolfe met with this student and even insisted that Butler was “an important voice for social justice” on campus.\nAs to the players’ part in this, it appears that Mizzou Coach Gary Pinkel has endorsed their stance.\nThe Mizzou Family stands as one. We are united. We are behind our players. #ConcernedStudent1950 GP pic.twitter.com/fMHbPPTTKl — Coach Gary Pinkel (@GaryPinkel) November 8, 2015\nAccording to NBC News, Missouri’s Democrat Governor Jay Nixon has also jumped into the controversy to claim that the state will somehow ensure that the purported racism flooding the university is ended.\nIn a statement, Nixon said, “racism and intolerance have no place at the University of Missouri or anywhere in our state… these concerns must be addressed to ensure the University of Missouri is a place where all students can pursue their dreams in an environment of respect, tolerance and inclusion.”\nThe Mizzou Tigers have even more trouble than hunger strikes and boycotts. With a record of 4-5 and 1-5 in the SEC, the team has been struggling.","url":"https://www.breitbart.com/politics/2015/11/08/mizzou-football-players-join-hunger-strike-supposed-racism-campus/"}
