{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 18:52:51","date_modify":"2018-10-30 18:52:51","date_publish":"2016-10-21 14:25:40","description":"Students offended by insensitive Halloween costumes are being provided with around-the-clock counseling services.","filename":"data/vaneerConsumption/UniversityofFloridatoOfferCounselingforStudentsOffendedbyHalloweenCostumes.json","image_url":"https://media.breitbart.com/media/2016/10/native-american-halloween-costume-flickr.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_10_21__1540925571.html","title":"University of Florida to Offer Counseling for Students Offended by Halloween Costumes","title_page":"University of Florida to Offer Counseling for Students Offended by Halloween Costumes | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"According to a blog post from administrators at the University of Florida, students offended by insensitive Halloween costumes are being provided with around-the-clock counseling services.\n“If you choose to participate in Halloween activities, we encourage you to think about your choices of costumes and themes,” the school advises in a recent blog post from the public university’s administrators.\nSeveral Twitter users lambasted the students at the University of Florida for their willingness to be coddled. One user criticized the decision to allocate public funds for the purpose of comforting students upset by Halloween costumes.\nUniversity of Florida is offering counseling to anyone upset by a halloween costume. In other news, the 4th Horseman just saddled up — Andy Lambert (@AndyLambertAndy) October 15, 2016\n#UniversityOfFlorida has a hotline to call if you're offended by a Halloween costume. Should I worry about dressing as a pumpkin? — NikiLynn (@NiikiLynn) October 14, 2016\nUniversity of Florida, funded by taxpayers, is now offering TRAUMA COUNSELING for students \"offended\" by Halloween costumes *smh* — AMERICAN MOM ~ CAT (@GOPAmericanMom) October 20, 2016\nI saw on the news this morning that the state of Florida is providing therapy for people if Halloween costumes offend them😅 — Sam Walker (@sammyk1429) October 20, 2016\nStudents who are triggered by insensitive Halloween costumes are instructed to contact the university’s 24/7 counseling services center for support.\nAs a community, we aspire to demonstrate integrity, respect, and compassion that strives to maintain an affirming campus climate for all members of our community. If you are troubled by an incident that does occur, please know that there are many resources available. Please take advantage of the 7 day a week presence of the U Matter, We Care program at the University of Florida by emailing umatter@ufl.edu. Additionally, there is a 24/7 counselor in the Counseling and Wellness Center available to speak by phone…\nThe post concludes by thanking students for “being mindful” of the importance of inclusiveness and kindness, and instructs them to “have a fun and safe Halloween.”\nTom Ciccotta is a libertarian who writes about Free Speech and Intellectual Diversity for Breitbart. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart.com","url":"https://www.breitbart.com/tech/2016/10/21/university-florida-offer-counseling-students-offended-halloween-costumes/"}
