{"authors":["Lee Stranahan"],"date_download":"2018-10-30 18:22:43","date_modify":"2018-10-30 18:22:43","date_publish":"2015-11-10 00:48:42","description":"Hours after the resignation of University of Missouri President Tim Wolfe, Chancellor R. Bowen Loftin announced he was resigning,","filename":"data/vaneerConsumption/UnivofMissouriChancellor.json","image_url":"https://media.breitbart.com/media/2015/11/Chancellor-Loftin-Resigns-Jeff-RobersonAP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_09__1540923763.html","title":"Univ of Missouri Chancellor","title_page":"Second Scalp for Black Radicals: Univ of Missouri Chancellor","title_rss":"NULL","source_domain":"breitbart.com","text":"Just hours after the apologetic resignation of University of Missouri President Tim Wolfe, the small Black Lives Matter-influenced activist group #ConcernedStudents1950 got another major scalp, as Chancellor R. Bowen Loftin announced he was resigning, effective at the end of year, and “transitioning” to another role.\nEarlier in the day, Roll Call reporter Eli Yokley reported that “word on the street” was that Wolfe wanted Loftin to resign.\nword on the street: @UMPrez doesn't want to leave unless #Mizzou Chancellor Loftin goes, too. #ConcernedStudent1950 — Eli Yokley (@eyokley) November 9, 2015\nAlthough removing Loftin was not one of #ConcernedStudent1950’s demands, he had been the focus of complaints by #ConcernedStudent1950, so the group’s supporters wasted no time in claiming victory.\nThe Missouri Chancellor R. Bowen Loftin just announced his resignation, effective end of this year. #ConcernedStudent1950 — Shaun King (@ShaunKing) November 9, 2015\nWolfe gone and Loftin leaving too? NO ONE CAN TELL ME PRAYER DOESN'T WORK. #ConcernedStudent1950 — SPARKSwillFLY. (@SymonneSPARKS) November 9, 2015\nThe resignation of Loftin came even after he had met with students at the tent city they’d erected on campus.\nChancellor Loftin visitng #ConcernedStudent1950, \"to make sure they have what they need.\" @TheManeater pic.twitter.com/oH2eM0kcc9 — Elane Edwards (@ElaneEdwards12) November 8, 2015\nCovering the #ConcernedStudent1950 walkout at the Student Center where Chancellor Loftin has shown up. @TheManeater pic.twitter.com/XMBZv7sDZJ — Tessa Weinberg (@Tessa_Weinberg) November 5, 2015\nAs the Columbus Daily Tribune reported, however, there were other complaints against Loftin since he took over the Chancellor role in February, 2014. Nine deans had written a letter calling after for Loftin’s ouster after meeting with him in early October:\nThe deans said Loftin has shown failed leadership through a number of instances, including the elimination and eventual reinstatement of graduate assistant health insurance and the elimination of the vice chancellor for health sciences position. The deans claim Loftin created a “toxic environment through threat, fear and intimidation.” “It is imperative to take immediate action to begin the process of resolving the issues and improving the environment,” they wrote. On Sunday, faculty members of the Department of Romance Languages and Literatures sent a letter to the Curators saying they had no confidence in Loftin’s leadership. The letter said 28 faculty members in the department expressed no confidence in Loftin; two abstained from the vote.\nThe dual resignations show the sway that the leftist protesters held over the University of Missouri’s administration after Black Lives matter-inspired activists led to black players from the University of Missouri football team announcing a strike this weekend.\nFollow investigative reporter and Citizen Journalism Boot Camp founder Lee Stranahan on Twitter at @Stranahan.","url":"https://www.breitbart.com/politics/2015/11/09/second-scalp-black-radicals-university-missouri-chancellor-resigns/"}
