{"authors":["Breitbart News"],"date_download":"2018-10-30 22:09:16","date_modify":"2018-10-30 22:09:16","date_publish":"2015-08-28 23:39:42","description":"The University of Tennessee Knoxville posted a language guide encouraging students to use non-\"gender binary\" words to describe their peers.","filename":"data/vaneerConsumption/UniversityofTennesseeDeniesMandatingPCPronouns.json","image_url":"https://media.breitbart.com/media/2015/08/17244078486_e8655a5ef4_k.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_28__1540937356.html","title":"University of Tennessee Denies Mandating PC Pronouns","title_page":"University of Tennessee Denies Mandating PC Pronouns","title_rss":"NULL","source_domain":"breitbart.com","text":"The University of Tennessee Knoxville posted a language guide Wednesday titled “Inclusive Practice: Pronoun Usage,” encouraging students to use non-“gender binary” words to describe their peers.\nDonna Braquet (pictured), director of the university’s “Pride Center,” wrote:\nWith the new semester beginning and an influx of new students on campus, it is important to participate in making our campus welcoming and inclusive for all. One way to do that is to use a student’s chosen name and their correct pronouns. … In the first weeks of classes, instead of calling roll, ask everyone to provide their name and pronouns. This ensures you are not singling out transgender or non-binary students. The name a student uses may not be the one on the official roster, and the roster name may not be the same gender as the one the student now uses. …\nWe are familiar with the singular pronouns she, her, hers and he, him, his, but those are not the only singular pronouns. In fact, there are dozens of gender-neutral pronouns. A few of the most common singular gender-neutral pronouns are they, them, their (used as singular), ze, hir, hirs, and xe, xem, xyr. These may sound a little funny at first, but only because they are new. The she and he pronouns would sound strange too if we had been taught ze when growing up.\nRead the rest of the article here.\nOnce the suggested language spread to the wider public, the intense backlash forced the university to put out a statement insisting it wasn’t trying to phase out the traditional “he,” “she,” “him,” and “her.”\nFrom the Daily Mail:\nA statement from a university spokesman said: ‘We would like to offer clarification of the statements that have been made referring to gender-neutral language. ‘There is no mandate or official policy to use the language. The information provided in our Office of Diversity and Inclusion newsletter was offered as a resource to our campus community on inclusive practices. ‘We recognize that most people prefer to use the pronouns he and she; we do not dictate speech. ‘We do strive to be a diverse and inclusive campus and to ensure that everyone feels welcome, accepted, and respected.’\nRead the rest of the story here.","url":"https://www.breitbart.com/politics/2015/08/28/university-of-tennessee-denies-pressuring-students-to-drop-sex-specific-pronouns-he-she/"}
