{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 18:52:41","date_modify":"2018-10-30 18:52:41","date_publish":"2016-11-22 05:37:32","description":"Professors at the University of New Hampshire are calling for two students to be expelled for protesting an anti-Trump rally.","filename":"data/vaneerConsumption/UniversityofNewHampshireProfessorsCallforTrumpSupporterstobeExpelled.json","image_url":"https://media.breitbart.com/media/2016/11/AP_16315037497034.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_21__1540925561.html","title":"University of New Hampshire Professors Call for Trump Supporters to be Expelled","title_page":"University of New Hampshire Professors Call for Trump Supporters to be Expelled | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Professors at the University of New Hampshire are calling for two Trump-supporting students to be expelled for counter-protesting an anti-Trump rally dressed as Richard Nixon and Harambe.\nCourtney Marshall, a former UNH professor, posted a photo of the two students who are called to be expelled on her Facebook page, writing, “There was a walkout yesterday at my former institution (UNH), and these two people showed up.” The photo spread to some current professors in the English and Women’s Studies departments, Campus Reform reported.\nHer photo prompted those professors to “call for the expulsion of the students, even writing sample letters to administrators in the comments.”\n“Time to call for an investigation leading to the expulsion of these students,” said Robin Hackett, associate professor of English and faculty member of the Women’s Studies Program, “before listing the names of several administrators for professors to direct their complaints.”\n“Another English professor and Women’s Studies Program faculty member, Siobhan Senier, drafted a letter to UNH President Huddleston and Provost Targett, claiming that the Harambe costume is ‘harassing, intimidating, and racist.'”\n“Somebody knows who these two students are, who dressed as Nixon and Harambe,” Senier wrote. “And whatever their intent, it seems that a conversation with them is in order.”\nUniversity spokesperson Erika Mantz told Campus Reform that “Every member of the University of New Hampshire community has the right to hold, defend, and promote their personal opinions.”\n“At least two of the professors who called for disciplinary action against the counter-protesters are members of the Women’s Studies Department,” which promoted the anti-Trump rally on Facebook despite tax rules that prohibit universities from “engaging in partisan political activity.”\nThe department even supplied materials for protesters, who were encouraged to make their own posters.\nN.H. Rev. Stat. § 15:5 states that “…no recipient of a grant or appropriation of state funds may use the state funds to… participate in political activity, or contribute funds to any entity engaged in these activities.”\nMantz said the university was “troubled” by the posts, even though they hadn’t been removed from the department’s Facebook page and said the university was aware of state law regarding political activity.\nNo action has been taken against any of the professors in the department or the department itself.","url":"https://www.breitbart.com/politics/2016/11/21/university-new-hampshire-professors-call-trump-supporters-expelled/"}
