{"authors":["Lee Stranahan"],"date_download":"2018-10-30 18:23:38","date_modify":"2018-10-30 18:23:38","date_publish":"2015-11-21 15:00:18","description":"Ben Shapiro’s speech Thursday evening at the University of Missouri was a galvanizing moment for the campus and community that became the national focus of media attention in early November after a group of radical black liberation activists, assisted by leftist faculty members, forced the resignation of the university’s president and chancellor.","filename":"data/vaneerConsumption/UniversityofMissouriAudienceApplaudsasBenShapiroRipsAggressiveProfessor.json","image_url":"https://media.breitbart.com/media/2015/11/shapiro-missouri.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_21__1540923818.html","title":"University of Missouri Audience Applauds as Ben Shapiro Rips Aggressive Professor","title_page":"University of Missouri Audience Applauds as Ben Shapiro Rips Aggressive Professor | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Ben Shapiro’s speech Thursday evening at the University of Missouri was a galvanizing moment for the campus and community that became the national focus of media attention in early November after a group of radical black liberation activists, assisted by leftist faculty members, forced the resignation of the university’s president and chancellor.\nThe event marked the first large, public backlash to the political correctness gone wild that had overtaken Mizzou in the past several months.\nTowards the end of his rousing speech, Shapiro discussed how the “micro aggression” culture of taking offense at minor, even unintended things leads to real aggression. Shapiro said, “There’s never been a bad person on planet Earth who has not felt justified in doing his or her bad thing. All colleges do now is give people reasons to feel justified in doing the bad things that they want to do.”\nShapiro lit into the very real aggressions that had played out at the University of Missouri, including the story that Breitbart News covered of Mizzou faculty member Dr. Melissa Click, who blocked a student reporter with a camera when he attempted to enter a public space on campus that #ConcernedStudent1950 activists had declared a “safe space” for themselves.\nBecause you’re micro aggressed, once you’re part of the self-designated victim group, driven to extremes by the evils of “white privilege,” you can now ban white students from black safe spaces; which, by the way, is a policy that the KKK loves, because the space is both seperate and equal. You can have the police investigate “hateful” remarks, as Mizzou cops are now doing, as the notice went out a couple of weeks ago that was heavily covered. I tweeted out that everybody should immediately call the cop and inform them that Professor Melissa Click is engaged in micro aggressions and actual aggressions.\nAt the end, Shapiro added a heartfelt personal comment that was not in his prepared text:\nYou can ban reporters by calling for muscle. By the way, why Melissa Click is still employed at this University is absolutely beyond me.\nThe audience of over 350 responded immediately with applause that lasted several seconds. The crowd’s applause showed the cathartic impact of someone speaking the truth out loud at the University of Missouri.\nMeanwhile, no word on whether University of Missouri police will file charges against Click. Student journalist Mark Schierbecker, whose video of the threats by Click went viral, filed a complaint against the professor after she gabbed at his camera. Last week, Scott Richardson told CNNMoney that the investigation remains “open and active.”\nWatch the whole speech here.\nFollow lead investigative reporter and Citizen Journalism Boot Camp founder Lee Stranahan on Twitter at @Stranahan.","url":"https://www.breitbart.com/politics/2015/11/21/university-missouri-audience-applauds-ben-shapiro-rips-aggressive-professor/"}
