{"authors":[],"date_download":"2018-10-22 22:34:52","date_modify":"2018-10-22 22:34:52","date_publish":"2014-05-11 16:58:51","description":"Two passengers of the hot air balloon that exploded Friday were staff members at the University of Richmond. The school celebrates graduation Sunday.","filename":"data/vaneerConsumption/UniversityofRichmondHonorsVictimsofVeryOddBalloonAccident.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/434976/140511-balloon-virginia-fire-2p_727698757927e8e03e73b0778944a9b3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_hot-air-balloon-accident_university-richmond-honors-victims-very-odd-balloon-accident-n102551_1540247692.html","title":"University of Richmond Honors Victims of 'Very Odd' Balloon Accident","title_page":"University of Richmond Honors Victims of 'Very Odd' Balloon Accident","title_rss":"NULL","source_domain":"nbcnews.com","text":"Authorities confirmed that they had found the first two bodies Saturday.\nThe university previously identified the two people on board with the pilot: Ginny Doyle, an alumna and a coach for the women’s basketball team, and Natalie Lewis, a former championship swimmer for the school and a director for the basketball team.\n“Ginny and Natalie have been beloved members of our community,” said Richmond President Edward L. Ayers. “Their leadership and friendship will endure in the lives of so many.”\n“I just can't believe this happened,” team member Amber Battle, who will be a senior next season, told The Associated Press. As many as three members of the women’s basketball team are graduating seniors, according to the roster.\nThe university canceled weekend basketball games but went ahead with weekend graduations as planned. School spokeswoman Cynthia Price said that a moment of silence was held for the women, and the ceremony provided a distraction for the shaken school community.\n“For a few hours people were focused on the graduates and their futures,” Price told NBC News.\nPresident Ayers briefly called attention to the loss the school had suffered during the beginning of Sunday’s commencement, and Saturday’s law school graduation also included a moment of silence for Doyle and Lewis.\nThe National Transportation Safety Board and FAA will investigate. Witness accounts indicate that weather and wind speeds didn’t appear to cause the balloon to collide with the power line, Parks and Geller said.\nParks described ballooning as something of a team sport, in which a crew follows the path of the balloon from the ground and meets it where it happens to land, because the trajectory of the balloon is ultimately based on breeze directions.\nTwelve other balloons ascended Friday night and landed safely, but something caused Kirk’s balloon — embossed with the message “support our troops” — to hit the power line.\nThe collision sparked the fire, which “spread quickly,” Geller said. The balloon the shot “so far away and so high,” Geller said, which Parks said makes sense because the balloon is designed to be propelled by hot air provided by propane.\n“An excessive amount of heat would make the balloon rise rapidly,” Parks said, adding that it was probably the propane tank — or tanks — that caused the explosion.\nBecause the balloon traveled so far off course before erupting, crews struggled to locate the bodies in heavily wooded Caroline County, Geller said.","url":"https://www.nbcnews.com/storyline/hot-air-balloon-accident/university-richmond-honors-victims-very-odd-balloon-accident-n102551"}
