{"authors":["Associated Press"],"date_download":"2018-10-22 20:56:20","date_modify":"2018-10-22 20:56:20","date_publish":"2016-01-28 05:18:44","description":"KANSAS CITY, Mo. (AP) — The University of Missouri on Wednesday suspended an assistant professor who is charged with assault in a campus run-in with student ...","filename":"data/vaneerConsumption/UniversityofMissourisuspendsprofessorinassaultcase.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:330aa0020845410e919f211d3561d99e-4vVdYopwYQ7f641721b07a8fdfed-514_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420210_Missouri-chancellor-presses-mend-race-relations-campus_1540241780.html","title":"University of Missouri suspends professor in assault case","title_page":"University of Missouri suspends professor in assault case | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"University of Missouri suspends professor in assault case\nKANSAS CITY, Mo. (AP) — The University of Missouri on Wednesday suspended an assistant professor who is charged with assault in a campus run-in with student journalists during protests in November.\nThe university system's governing board of curators announced the move in a statement after a special meeting Wednesday night.\nMelissa Click was charged Monday with misdemeanor assault and has pleaded not guilty through an attorney. Click had a confrontation with a student photographer and a student videographer on Nov. 9 during protests at the Columbia campus over what some saw as university leadership's indifference to racial issues. Click called for \"some muscle\" to help remove the videographer from the protest area on the campus. She later said publicly that she regretted her actions.\nUniversity of Missouri interim chancellor Hank Foley delivers the State of the University address Wednesday, Jan. 27, 2016, in Columbia, Mo. (AP Photo/Jeff Roberson)\nThe board of curators ordered its general counsel to conduct an investigation so it can determine whether additional discipline \"is appropriate,\" Pam Henrickson, chair of the board, said in a written statement.\nClick \"is suspended pending further investigation,\" the statement said.\nClick did not immediately respond to a request for comment from The Associated Press.\nEarlier in the day, the interim chancellor at the University of Missouri's Columbia campus spoke about the November protests during his \"State of the University\" speech, calling that chapter painful, but declaring that the school's push toward more inclusivity is a priority.\n\"One way to regard student unrest is a sign that the institution has not kept pace with change, especially with students' and the public's expectations,\" Hank Foley, who took the helm at the campus less than three months ago, said. \"The tension around race relations and the campus climate shows that we need to do more to be fully inclusive.\"\nFoley said having the system's troubles draw national scrutiny was difficult but added, \"I'm asking our Mizzou family to come back together around a love for this great institution.\"\nFoley took over after R. Bowen Loftin resigned Nov. 9, along with the system's president, Tim Wolfe, amid discord that included a student's hunger strike and members of the school's football team pledging to boycott the rest of their season until Wolfe was gone.\nFoley's speech did not mention Click. Amid calls by a system administrator and Republican lawmakers to fire the professor, Foley told reporters this week that the university \"must allow due process to play out.\" He said he would not rush when it comes to determining her future at the school, including a decision on tenure.\nFoley's address and Click's suspension came the same day several newspapers reported that Wolfe, in an email to supporters and donors after his resignation, criticized most officials involved in the turmoil leading to his exodus.\nWolfe insisted the university is \"under attack\" by the Missouri Legislature, rendering the board of curators \"frozen\" by the pressure, and asked the email recipients to press the board to sweeten a financial package for him that he's negotiating the university.\nMessages left Wednesday with the board and Concerned Student 1950, an activist group that led the November protests, were not immediately returned.\nJohn Fougiere, a spokesman for the university system, said the university is aware of Wolfe's email, adding that since Wolfe's resignation, the matter has been in mediation \"aimed at reaching an acceptable post-resignation agreement.\"\n\"Our position has been that any agreement would have to be consistent with the legal constraints within which a public institution such as the university operates,\" Fougiere said without addressing other elements of Wolfe's email.\nAlso Wednesday, board of curators member Yvonne S. Sparks resigned. She did not mention the turmoil at the Columba campus in a statement released by the board.\n\"After careful consideration of the demands of my professional obligations and those required to engage in the work of the Board at the level that I expect of myself, I have concluded that it is not possible to do both well,\" said Sparks, who works in the banking industry and who was appointed to the board by Democratic Gov. Jay Nixon last year. \"This is an important and demanding time for the System, the role deserves a representative that is able to that devote.\"\n___\nAmy Shafer reported from Chicago.\nUniversity of Missouri interim chancellor Hank Foley delivers the State of the University address Wednesday, Jan. 27, 2016, in Columbia, Mo. (AP Photo/Jeff Roberson)\nUniversity of Missouri interim chancellor Hank Foley delivers the State of the University address Wednesday, Jan. 27, 2016, in Columbia, Mo. (AP Photo/Jeff Roberson)\nUniversity of Missouri interim chancellor Hank Foley delivers the State of the University address Wednesday, Jan. 27, 2016, in Columbia, Mo. (AP Photo/Jeff Roberson)","url":"https://www.dailymail.co.uk/wires/ap/article-3420210/Missouri-chancellor-presses-mend-race-relations-campus.html"}
