{"authors":["Daniel J. Flynn"],"date_download":"2018-10-30 18:22:21","date_modify":"2018-10-30 18:22:21","date_publish":"2015-11-12 17:42:08","description":"The University of Missouri wears all-white uniforms when the Tigers take on the BYU Cougars this Saturday at Arrowhead Stadium. |","filename":"data/vaneerConsumption/UniversityofMissouriDonsAllWhiteUniformsafterBlackStudentProtests.json","image_url":"https://media.breitbart.com/media/2015/11/Missouri-White-Uniforms.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_11_12__1540923741.html","title":"University of Missouri Dons All-White Uniforms after Black Student Protests","title_page":"University of Missouri Dons All-White Uniforms after Black Student Protests | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The University of Missouri wears all-white uniforms when the Tigers take on the BYU Cougars this Saturday at Arrowhead Stadium.\nMicroaggression? Institutional racism? Triggering tint?\nThe all-white privilege comes as a first in the history of the football program and follows the university president’s resignation earlier this week after more than thirty black football players boycotted team activities. Earlier today, someone—maybe the same mysterious figure who drew a swastika with his feces—redacted the “Black” in the Black Culture Center’s sign with spraypaint. Columbia remains volatile, as though waiting, in order to launch a new round of teach-ins and takeovers, for some well-meaning but benighted freshman to utter blackguard, or some other subconsciously racist term, in relation to the anonymous bigots painting and shouting hate speech (before disappearing into the night) all over campus. But the school wants everyone to know that the white duds don’t come as a fashionable response to that black dude’s hunger strike. Really they don’t.\n“Prior to the season, Mizzou Assistant Athletic Director for Equipment Don Barnes came up with a uniform concept that Mizzou had never worn: a white base jersey-pant combo with black numbers and an anthracite Tiger stripe overlay accompanied by a white helmet equipped with a chrome secondary Tiger logo and facemask,” a news release from the athletic department announces. “The uniform combination will also feature gloves with the anthracite Tiger stripe pattern.”\nThat last part’s good to know. Anthracite appears blackish, so it’s appearance on the unis surely will please the perpetually displeased. But white clearly occupies a hegemonic, privileged position on the gear, acting as a bright, shining metaphor for the truths told in sociology class. Perhaps to mitigate against any such outrage the school’s athletic department emphasizes that the “jerseys feature black numbers.”\nThe timing, like presiding over a university right when preschool sensitivities preside over its students, seems off. White’s just not in fashion, at least not in Columbia, Missouri.","url":"https://www.breitbart.com/sports/2015/11/12/university-of-missouri-dons-all-white-uniforms-after-black-student-protests/"}
