{"authors":["Gareth Davies For Mailonline"],"date_download":"2018-10-23 02:22:38","date_modify":"2018-10-23 02:22:38","date_publish":"2017-04-26 13:28:23","description":"The hilarious video was captured by the Waseda Waterski Team and the unfortunate member of the squad identified as Miroku posted it online after the painful incident on the Tone River in Japan.","filename":"data/vaneerConsumption/Unluckywaterskierhitinthegroinbyaleapingfish.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9FA19700000578-0-image-a-52_1493209689556.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447238_Unlucky-water-skier-hit-groin-leaping-fish_1540261358.html","title":"Unlucky water skier hit in the groin by a leaping fish","title_page":"Unlucky water skier hit in the groin by a leaping fish | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A wave of pain washed over this unlucky water skier after a fish leapt from the water and smashed him in the groin.\nThe hilarious video was captured by the Waseda Waterski Team and the unfortunate member of the squad identified as Miroku posted it online.\nAs he slides through the water's surface on the Tone River in the Kantō region of Japan, a fish appears from nowhere and clatters into his nether regions.\nScroll down for video\nThe water skier, who has been identified as Miroku, about to be hit in the privates by the fish\nAs he glides through the water, the Waseda Waterski Team member has no idea what is about to happen\nThe fish catches him right in the nether regions and as he doubles over in pain he lets go of the towrope\nThe man's pain is evident and as he doubles over he is forced to let go of the towrope and collapses into the water.\nAfter posting his misery online, the tweet garnered tens of thousands of likes and comments.\nAlmost all of the replies carried the same message - sympathy for the victim, but an appreciation for sharing the hilarious accident.","url":"https://www.dailymail.co.uk/news/article-4447238/Unlucky-water-skier-hit-groin-leaping-fish.html"}
