{"authors":[],"date_download":"2018-10-30 01:02:00","date_modify":"2018-10-30 01:02:00","date_publish":"2018-06-26 00:05:57","description":null,"filename":"data/vaneerConsumption/UnmaskedAmericasRealFascists.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/06/Old_hen.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861320.html","title":"Unmasked: America’s Real Fascists","title_page":"Unmasked: America’s Real FascistsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"They come in all different disguises.\n* Protesters disrupting the Mexican restaurant meal of a Cabinet Secretary, forcing her to leave.\n* The owner of an innocent-sounding “Red Hen” restaurant in Lexington, Virginia boasting that she refused to serve the presidential press secretary Sarah Sanders and asked her to leave. Sanders quite politely did. Now we learn from Sanders’ Dad, Governor Mike Huckabee, that when Sanders did as requested and went to another nearby restaurant — the angry Red Hen owner followed and kept harassing her. (Note: At press time I had heard that Sanders herself was present at another restaurant when harassed again by the owner of the Red Hen. This was later clarified. So to update correctly: Sanders and husband went home after the incident at the Red Hen, but the family with her stayed and it is they who were harassed a second time, not Sanders.)\n* A Florida Democratic Party activist threatened Republican Congressman Brian Mast’s children, saying to one of the Congressman’s interns: “If you are going to separate kids at the border, I’m going to kill his kids.” News reports note that the man had called the Congressman’s office 478 times.\n* Hostile students physically assaulting a speaker at Middlebury College, giving an accompanying college official a concussion.\n* Hooded Antifa members, “armed with sticks and shields and clad in shin pads and gloves” (per the Washington Post), rampaging through the streets of Berkeley to attack a peaceful rally. Five people were assaulted.\n* Media Matters and its constant campaigns to bully advertisers into removing conservative X from the nation’s television screen or radio air waves, warning that advertisers will get “burned” if they don’t comply.\n* A Member of Congress calls on supporters to confront and harass Trump administration officials when seen in public. Said Maxine Waters: “They’re not going to be able to go to a restaurant, they’re not going to be able to stop at a gas station, they’re not going to be able to shop at a department store. The people are going to turn on them, they’re going to protest, they’re going to absolutely harass them.”\n* Florida’s Attorney General Pam Bondi, a Republican and Trump supporter, needed a police escort to get through hecklers who had confronted her at a movie theater in Tampa. The movie she had seen? It was about Mr. Rogers, the late Fred Rogers whose motto of his kids show was “Won’t you be my neighbor?” Questioned by a reporter one of the protesters snapped: “I’m not Mr. Rogers.” Indeed. Reported Bondi: “Thugs cursed me one inch from my face…”\n* White House aide Stephen Miller was, per the New York Post, “accosted at a Mexican restaurant by a patron calling him a ‘fascist.’”\n* A Left-wing activist shoots and almost kills the Trump-supporting Republican House Whip, Louisiana Congressman Steve Scalise, at a practice for the congressional baseball game. He wounds three others as well.\n* Fox contributor Tomi Lahren, having brunch with her parents at a Minneapolis restaurant, has a glass of water thrown in her face by a fellow diner as other diners yelled at her and called her a racist.\n* Leftist activist Dan Savage tweets out a call for a “…. march on Fox News HQ — all of this hateful propaganda is being broadcast from an office building in midtown Manhattan. Activists surrounded & shut down an ICE office in Portland. The same can and should be done to Fox News in NYC.”\n* Actor Peter Fonda tweets out that someone should “rip Barron Trump from his mother’s arms and put him in a cage with pedophiles.”\n* Actor Robert De Niro, making a presentation on the nationally televised Tony Awards for Broadway stars, makes a point of looking out at the cameras and saying, as reported by the Washington Post, “‘ F— Trump,’ using an expletive. Then, in case, anyone missed it, he circled back. “It’s no longer down with Trump,” he said, “but f— Trump.” The audience of celebrities jumped to their feet and cheered.\nAnd, oh yes. Recall when Canadian Prime Minister Justin Trudeau remarked that “Canadians, we’re polite, we’re reasonable….”? Perhaps the PM hasn’t met one “Quebec City writer Nora Loreto” who, as described here, suggested First Lady Melania Trump should be decapitated. Yes, you read that right.\nThere are more tales like this out there, but these will suffice to illustrate the problem.\nNewsflash? America, we have a problem.\nWhatever guise in which they cloak themselves — actor, patron, restaurant owner, Member of Congress, Media Matters official, activist, student — in fact, behind the mask, these are America’s real fascists. The BBC noted of Mussolini’s “Black Shirts” that they were organized “into armed squads known as Black Shirts, who terrorized their political opponents” — which is, in one form or another, precisely what today’s American fascists are all about. Antifa is, in fact, as reported by the Washington Post, decidedly acting as hooded “armed squads” — in the fashion of another founded-by-Leftists made-in-America terror squad…the Ku Klux Klan.\nWhile we are not hell and gone from freedom, we are in fact on the road to a society in which fascists are on the loose amongst us. And I use the word “fascists” (as I have before) advisedly. These aren’t “bullies” — the standard “hey I’m bigger than you” tough guys encountered periodically in everyday life on schoolyards or in executive suites or labor halls. These are out-and-out Mussolini-style fascists, determined to terrorize and silence their political opponents and anyone else they see as getting in their way.\nThis has been a long time coming. Decades worth of leftist violence have preceded this moment — whether at the Democratic National Convention in 1968 or the window smashing spree in Seattle when the World Trade Organization came to Seattle in 1999 or the car-burning, window smashing rage on the streets of Washington, D.C. during Trump’s 2017 inauguration — and, oh, so much more.\nThe central reality, as Roger Simon nails it over at PJ Media, is that the American Left, having been stymied by Donald Trump, has finally gone over the edge. Wrote Simon, bold print supplied:\nThe problem is that it’s not just Hollywood lamebrains and jejune social justice idiots that have been infected, it’s the entire liberal/progressive side of the country, starting with the literary/media elites who give them their marching orders. They are all having a nervous breakdown and it keeps getting worse, because… because… because Trump. But I have news for them. It’s not at all about Trump. It’s about them. Trump is what the shrinks call the “presenting complaint.” The real problem, as is often the case in psychotherapy, is something entirely different. And it is this: The left is dead. It’s not only dead, it’s decomposed with no there there or anywhere. Only dopes or con artists believe in socialism anymore (hello, Venezuela!) and identity politics has been exposed as the racist shell game it is with blacks and Latinos actually doing better than they have in decades under the current pro-capitalist administration. So the left has nothing to say, only most of them don’t quite realize it yet. But this blockage, this reluctance and even inability to deal with what is actually happening shuts down the brain and emerges as anger, the hamster wheel of constant rage against Trump.\nOne only has to read the Twitter feed out there of this or that progressive — or of conservatives when progressives show up to rage — and one is struck by the mental unbalance, the raw anger, the foaming-at-the-mouth frustrated fury. Tellingly, they project on to others what is in fact true of themselves. “Fascist! Nazi! Racist!” they shriek, celebrating those who threaten or wield the clubs of verbal or physical repression, not to mention the racism of identity politics. And downhill it goes from there.\nThe question is: what to do about the rage of now-unmasked American fascists? Before someone gets hurt?\nOr, in the case of Congressman Scalise, before this unmasked rage of American fascists gets someone else hurt?","url":"https://spectator.org/unmasked-americas-real-fascists/"}
