{"authors":[],"date_download":"2018-10-30 01:06:10","date_modify":"2018-10-30 01:06:10","date_publish":"2017-04-03 00:00:00","description":null,"filename":"data/vaneerConsumption/UnmaskingSusanRiceandherNSCdeadenders.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_04_unmasking_susan_rice_and_her_nsc_deadenders_comments_1540861570.html","title":"Unmasking Susan Rice and her NSC dead-enders","title_page":"Blog: Unmasking Susan Rice and her NSC dead-enders","title_rss":"NULL","source_domain":"americanthinker.com","text":"Journalist and activist Mike Cernovich reports that former White House national security adviser Susan Rice obtained intelligence reports showing the identities of innocent Americans who incidentally spoke to foreign officials under security sweeps for spying or intelligence activities. Under U.S. law, U.S. persons are protected from such disclosure, which could be dry cleaners asking envoys to pick up their laundry or wrong number phone messages spilling their guts about their mothers-in-law. If such U.S. persons get swept up in surveillance, they are protected. But only if they remain \"masked,\" which is the law of the land. Cernovich says the White House counsel's office has confirmed that Rice was one of the few officials with the authority to make the requests to unmask the innocent Americans caught up in surveillance dragnets. There was no national security reason to do so, but she did. It makes a lot of sense if the aim is... (Read Full Post)","url":"https://www.americanthinker.com/blog/2017/04/unmasking_susan_rice_and_her_nsc_deadenders_comments.html"}
\" Based on White House logs, she did, during the transition, back when angry miserable Obama White House officials frowned in a group photo for the cameras. The White House counsel's office disclosed these logs to House Intelligence Committee chairman Devin Nunes, who has been as responsible a steward of America's secrets as anyone (and said nothing). But it would mean that Rice has to have been responsible for the illegal leaking to the press of the legitimate activities of people like her NSC successor, Mike Flynn, for political rather than national security purposes. This would be true whether she did it herself or dispatched a flunky like fellow NSC official Ben Rhodes or Joe Biden's NSC man Colin Kahl to execute the dirty-tricks skullduggery. It's par for the course. Rice was the speaker of the infamous phony White House talking points on why four Americans, including Ambassador Chris Stevens, were slaughtered in Benghazi on 9/11/12, repeatedly stating for the press that the attack on the U.S. compound was the act of a spontaneous crowd that got out of control over a video and not the pre-planned, lethally executed al-Qaeda terrorist attack it was. After that, she went on to support the admittedly phony narratives about the Iran deal, which her buddy Ben Rhodes, a creative writing major, cooked up out of thin air, just as he did the Benghazi talking points. Cernovich reports that New York Times reporter Maggie Haberman (caught on WikiLeaks being in the tank with Obama) had the information and chose to sit on it to protect the former president. But based on the White House counsel act, the news nevertheless got out. The story meshes well with what FBI director James Comey told the House Intelligence Committee in response to Nunes's request for information on leaks last March 20. Comey told the committee that only 20 people would have had access to the names of innocent Americans caught up in the spy dragnet during the transition. Rice was one of them. Rice, like Rhodes, has the farthest of far-left backgrounds and the highest of malice against the incoming president. Rhodes never was able to pass a background check to obtain a security clearance and continues to mock and berate Trump & Co., as if he thinks he owned the job and now they took it. Another coeval at NSC, Colin Kahl, who was attached to Joe Biden, seems to have laid out the diabolical plans for picking off Trump's lieutenants one by one. The tweets he issues are unbelievable. Here is one: The 2nd essential step is purging or marginalizing the “Axis of Ideologues” in the West Wing: Bannon, Miller, Anton, Gorka, KT McFarland.14/ — Colin Kahl (@ColinKahl) March 11, 2017 With a pattern of malice and mishandled security information centered on NSC dead-enders, the one thing we can see is that there is a coterie of illegal leakers who will compromise national security to enact their political aims. Devin Nunes pointedly asked Comey whether he knew that illegally leaking national security secrets is a jail-time offense. The FBI director said yes. It's time to start investigating this arrogant abuse of power. Comey has not stated whether he is investigating these people or not, and this is proper. But with these dead-enders clearly threatening the Trump presidency, it's time to see a hard hand come out against these deep-staters who don't know when to leave office and who subscribe to the leftist situational ethics of \"by any means necessary.\" They are poison for our republic, and if they are not removed, they will destroy the Trump presidency.","url":"https://www.americanthinker.com/blog/2017/04/unmasking_susan_rice_and_her_nsc_deadenders.html"}
