{"authors":["Associated Press"],"date_download":"2018-10-22 23:10:05","date_modify":"2018-10-22 23:10:05","date_publish":"2016-01-28 11:48:24","description":"SEOUL, South Korea (AP) — The position is not yet vacant, and may not become so, yet people are already beginning their undeclared campaigns to be president ...","filename":"data/vaneerConsumption/UnofficialcampaignsalreadystartingforAFCpresidency.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420378_Unofficial-campaigns-starting-Asias-job_1540249805.html","title":"Unofficial campaigns already starting for AFC presidency","title_page":"Unofficial campaigns already starting for AFC presidency | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Unofficial campaigns already starting for AFC presidency\nSEOUL, South Korea (AP) — The position is not yet vacant, and may not become so, yet people are already beginning their undeclared campaigns to be president of the Asian Football Confederation.\nThe incumbent, Sheikh Salman bin Ebrahim Al Khalifa, is in the race to become head of FIFA, and if he succeeds, the AFC job will be available.\nDr. Hafez Al Medlej, a candidate in the 2013 AFC presidential election when Salman was first elected, believed it would be a wide open race.\n\"Sheikh Salman has a good chance of winning the FIFA election,\" Al Medlej told The Associated Press. \"As soon as it happens, then the AFC will start moving. When you look at the AFC executive committee then you can see so many candidates.\"\nAccording to the Saudi Arabian, the three most likely are Sheikh Ahmad Al-Fahad Al-sabah of Kuwait, Tengku Abdullah of Malaysia, and Kohzo Tashima of Japan. The trio was elected onto FIFA's powerful executive committee last year.\nSheikh Ahmad, the president of the Olympic Council of Asia, is a powerful figure in sports politics. His support of Sheikh Salman was crucial to the Bahraini taking the AFC presidency, and was just as important as he aimed for the FIFA job.\n\"Sheikh Ahmad wants to be the president (of the AFC),\" Al Medlej said. \"He didn't enter the FIFA executive committee without an interest in football, and the AFC would likely be a target, and Abdullah is well known all around Asia.\"\nAbdullah recently resigned as head of the Football Association of Malaysia, ostensibly due to the country's poor results in qualification for the 2018 World Cup, though his allies perceived he was giving himself time to concentrate on his AFC and FIFA ambitions.\nA key issue in the election will be the master rights deal the AFC signed in 2009 with sports marketing company World Sports Group — now known as Lagardere Sports and Entertainment — that runs from 2013-20.\nDuring a forensic audit of the AFC accounts in 2012, consultancy group PricewaterhouseCoopers raised questions about the $1 billion deal, and recommended that the AFC seek legal advice on whether it could be renegotiated or even canceled. Sheikh Salman, elected on a promise of transparency, has seemingly done little to act on the issue.\nPrince Ali bin Al-Hussein has raised questions about the rights deal. The Jordanian ran against Sepp Blatter for the FIFA presidency last year, winning one third of the vote. Al Hussein is again a candidate in the FIFA election but sources say it is unlikely he would be interested in the Asian job.\nAnother possible candidate is former president of the United Arab Emirates Football Association, Mohammed Khalfan Al Romaithi, while Qatar, host of the 2022 World Cup, would be expected to join any race.\nChong Mong-gyu, the president of the Korea Football Association, has also been mentioned. If Chong stays out of the race, then Tashima, who defeated Chong in the FIFA executive committee election last year, would almost certainly be east Asia's only candidate.\nAccording to Al Medlej, the vice-president of the Japan Football Association (JFA) has plenty of work to do.\n\"Tashima does not have a wide relationship outside Japan and east Asia. If he is to win, he needs the support of strong leaders like Sheikh Ahmad and Abdullah, but they may be running against him.\"\nTashima will contest an election in Tokyo on Sunday to become president of the JFA. A defeat at the hands of Hiromi Hara would be a blow to his continental chances.","url":"https://www.dailymail.co.uk/wires/ap/article-3420378/Unofficial-campaigns-starting-Asias-job.html"}
