{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:21:10","date_modify":"2018-10-30 21:21:10","date_publish":"2015-05-22 15:38:49","description":"A North Texas honors student was days away from his high school graduation when he was suspended after campus police and K9 unit discovered an unopened beer in a cooler in the back of his pickup truck between a few bottles of water and some cans of soda.","filename":"data/vaneerConsumption/UnopenedCanofBeerGetsTexasHonorsStudentSuspendedBarredfromGraduation.json","image_url":"https://media.breitbart.com/media/2015/05/Kaufman-ISD-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_05_22__1540934470.html","title":"Unopened Can of Beer Gets Texas Honors Student Suspended, Barred from Graduation","title_page":"Unopened Can of Beer Gets Texas Honors Student Suspended, Barred from Graduation","title_rss":"NULL","source_domain":"breitbart.com","text":"A North Texas honors student was days away from his high school graduation when he was suspended after campus police and K9 unit discovered an unopened beer in a cooler in the back of his pickup truck between a few bottles of water and some cans of soda.\nQuintin Walker was charged with “minor consumption” by Kaufman Independent School District (ISD) police who found an eight ounce Bud Light in the dried out cooler that was left in there by his mother from a recent family lake outing. Also, he was ordered to attend a Disciplinary Alternative Education Program (DAEP) and told he was barred from participating in any school functions, including his high school graduation this week.\nWalker did not know the can of beer was even in the cooler. He was upset by this turn of events. “I worked 12 years to walk across that stage,” he told CBS DFW, calling it “crazy” to see his whole public education implode over “one eight ounce beer can.”\nHis mother, Jarita Marshall, felt worse. She tearfully told the Dallas CBS News affiliate that the beer was hers. “It was very heart-breaking. He worked really hard and I felt like it was my fault,” she said.\n“It’s not right. It’s not fair to him,” continued Marshall.\n“Make a good judgment call. I know that they got rules but it seems like a no-brainer,” added Rusty Evans, the father of Walker, whose frustration was directed at the high school and the district.\nRegardless of what seems to be right or fair, or make sense, the Kaufman High School Code of Conduct mandates Disciplinary Alternative Education Program (DAEP) for behavior including “Sells, gives, or delivers to another person an alcoholic beverage; commits a serious act or offense while under the influence of alcohol; or possesses, uses, or is under the influence of alcohol, if the conduct is not punishable as a felony offense. (School related felony alcohol offenses are addressed in the Expulsion section.)”\nDAEP was created as part of the state’s Safe Schools Act of 1995. In the bigger picture, it is part of zero tolerance, those policies which are “disciplinary removal of a student from his or her classroom without taking into account student intent, self-defense, disciplinary history, or other factors that might have influenced the behavior,” writes Texas Appleseed, a non-profit legal advocacy organization that specializes in issues relating to juvenile justice.\nDAEP is a behavioral facility for students who commit “virtually any disciplinary violation or certain criminal offenses specified in Chapter 37 of the Texas Education Code,” according to Schooling a New Class of Criminals? by the Texas Public Policy Foundation (TPPF), the Austin-based think tank.\nBreitbart Texas has reported on TPPF’s look at a system where “discretionary” referrals are the greater share of alternative education placements – over 80 percent. TPPF cautioned that the broad nature of categorical offenses – disruptive, abusive or violence — meant that a school district could find a “basis for using virtually any disciplinary violation as justification for discretionary DAEP referral.\nLast year, Houston area high school student Chaz Seale swore he grabbed the wrong beverage accidentally out of the refrigerator for his lunch. He was rushing to get to school and said he did not even notice that what he packed was not soda pop but Coors Lite until the third period. Seale then did the “right thing” by telling his teacher. According to CBS DFW, he gave the can of beer to his teacher, in good faith. He got suspended.\nThis Livingston High School 17-year-old was slapped only with three days of Out-Of-School Suspension (OSS) but got the maximum 60 school days of DAEP, which can play out over months on a school calendar. Like Walker, he had no prior criminal record or history of trouble.\nThe Texas Appleseed report When My Child is Disciplined at School: A Guide For Families underscores that mandatory DAEP placement results when a school has reason to believe that a student is guilty of serious misconduct specified by the Texas Education Code, Chapter 37.\nStudent Codes of Conduct list mandatory offenses and lesser “school-district specific discretionary referrals” to DAEP. Additionally, principals have discretion to assign DAEP. According to Texas Appleseed, the average student stay is 30 to 40 day and it is not necessary for a court to be involved for a school to authorize a DAEP placement.\nMeanwhile, in the educational “stakeholder” community, parents are often shortshrifted, often only learning about “disciplinarian actions” like DAEP being assigned to their child by email. Texas Appleseed’s guide instructs parents on what to look for and how-to stay involved when a child is disciplined at school, emphasizing it is critical to learn if that “disciplinary offense will become part of your student’s record—and if it is serious, whether your student will be ticketed, arrested and required to appear in court, where the incident could become part of a municipal court, justice court, or juvenile court record.”\nBreitbart Texas has reported on the Texas public school policies that steer minors down the school-to-prison pipeline, the result of those unforgiving zero tolerance disciplinary policies that criminalize student behavior and sets them on a dubious paths.\nIn zero tolerance society, rules are carved in stone. There is not one smidgeon of empathy for even a first time offender. Except, oddly enough, in the very same Kaufman High School that just barred honor roll student Walker from his own graduation over a beer he did not drink.\nIn March, Kaufman ISD found plenty of wiggle room for 15 drunken under-aged revelers during a prom limo ride that ended with a Kaufman County couple facing 18 counts of purchasing and furnishing alcohol to the high school seniors. These students were suspended from school following their sloshed night out. They were also ordered to spend 45 days at DAEP, according to KDFW-4.\nHowever, those students who displayed good behavior while serving time in the alternative education behavioral facility “would be allowed to participate in commencement exercises in May,” a Kaufman ISD spokeswoman said recently, which KDFW-4 also reported.\nTo the contrary, Kaufman ISD superintendent Dr. Lori Blaylock would not speak about the Walker incident to CBS DFW on camera but told them that, according to the code of conduct, if any student is suspended and sent to DAEP that student cannot participate in any school function.\nIt is not clear if Walker was actually assigned to or intends to complete DAEP. He has fulfilled all his high school requirements and will attend Stephen F. Austin State University in the fall to study engineering.\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2015/05/22/unopened-can-of-beer-gets-texas-honors-student-suspended-barred-from-graduation/"}
