{"authors":["Bill Chappell"],"date_download":"2018-10-23 01:03:23","date_modify":"2018-10-23 01:03:23","date_publish":"2015-08-12 00:00:00","description":"\"Enough is enough,\" U.N. chief Ban Ki-moon says, accepting Babacar Gaye's resignation after peacekeepers were accused of raping a girl and killing two people in the Central African Republic.","filename":"data/vaneerConsumption/UNOustsItsHeadPeacekeeperInCARAmidNewAccusations.json","image_url":"https://media.npr.org/assets/img/2015/08/12/babacar-un-car_wide-6a87662bb6dbdcee94f1bb25a3def1b79d66ba83.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2015_08_12_431926847_un-ousts-its-head-peacekeeper-in-car-amid-new-accusations_1540256603.html","title":"U.N. Ousts Its Head Peacekeeper In CAR Amid New Accusations","title_page":"U.N. Ousts Its Head Peacekeeper In CAR Amid New Accusations : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"U.N. Ousts Its Head Peacekeeper In CAR Amid New Accusations\nEnlarge this image toggle caption Hazim/Xinhua /Landov Hazim/Xinhua /Landov\nSaying \"enough is enough,\" U.N. chief Ban Ki-moon says he has accepted the resignation of the head of the peacekeeping mission in the Central African Republic, after new allegations of sexual abuse and other misdeeds by U.N. troops.\nBabacar Gaye of Senegal resigned his post as the United Nations' top peacekeeper in CAR one day after Amnesty International accused peacekeepers of raping a 12 year-old girl and killing a teenager and his father in separate incidents this month.\nNPR's Ofeibea Quist-Arcton reports:\n\"Amnesty International says the girl was hiding in a bathroom when a man in a U.N. blue helmet and vest reportedly took her outside and raped her behind a truck in Central African Republic's capital. \"A resident and his 16-year-old son were reportedly shot and killed outside their home in Bangui. \"Both alleged incidents involve peacekeepers from Rwanda and Cameroon. \"The UN is under international scrutiny over its handling of allegations of sexual abuse against children by French soldiers in CAR last year. And U.N. peacekeepers there have been accused in recent months of rape and sexual abuse – including against street children.\"\nBan said that Gaye had worked \"under extremely challenging circumstances and throughout an unprecedented crisis.\" He added, \"I want to be clear that this problem goes far beyond one mission or one conflict or one person.\"\nBan also urged victims to come forward, saying, \"You should not feel shame. Shame belongs to the perpetrators.\"\nThe Amnesty International report accuses peacekeepers of shooting Balla Hadji, a 61-year-old truck driver and his son, who was 16, in the street — and then firing at another family member who tried to rush to their aid.\nGaye led a peacekeeping mission that was deployed early last year to protect people from sectarian and ethnic violence in the CAR, much of it between militias affiliated with either Christians or Muslims (who are a minority in the country).\nAccording to U.N. estimates, \"some 450,000 people remain displaced inside the country while thousands of others have sought asylum across the borders. Meanwhile, overall some 2.7 million people in the CAR remain in direct need of urgent humanitarian assistance.\"","url":"https://www.npr.org/sections/thetwo-way/2015/08/12/431926847/un-ousts-its-head-peacekeeper-in-car-amid-new-accusations"}
