{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 21:55:25","date_modify":"2018-10-30 21:55:25","date_publish":"2016-12-16 00:00:00","description":null,"filename":"data/vaneerConsumption/UnpackingVisaandMastercardstokenizationdeal.json","image_url":"https://amp.businessinsider.com/images/5853fac3ca7f0cc2178b578b-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_unpacking-visa-and-mastercards-tokenization-deal-2016-12_1540936525.html","title":"Unpacking Visa and Mastercard's tokenization deal","title_page":"    Unpacking Visa and Mastercard's tokenization deal - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nVisa and Mastercard announced a tokenization agreement associated with Visa Checkout and Masterpass, the companies' mobile wallets. The agreement will allow each company to provision the other's tokens into its wallet, essentially making the two products interoperable.\nIt could also help make tokenization more standard across mobile wallets. Visa and Mastercard expect to launch the cross-provisioning in the second half of 2017 in the US, with a global launch to follow.\nTokenization makes mobile payments more secure. The process replaces a card number added into a digital wallet with a unique identifier that's passed between the wallet, merchant, and other relevant parties. That prevents a customer's actual card number and associated sensitive data from being accessed by third parties in a transaction, ultimately better protecting it.\nThe deal between the card networks means that when a user loads a card from the other network into a wallet (e.g. a Mastercard into Visa Checkout), that card will have an associated token.This ultimately creates a unified standard for tokenization across both wallets, and could help make it a more commonly understood practice. And that could help incentivize mobile wallet adoption among consumers, because it could help relieve some of the perceived security risks that continue to be a barrier between consumers and mobile wallets.\nIn addition, the deal could ultimately grow the wallets' merchant networks and therefore increase adoption.\nMerchant networks could expand. By cross-provisioning tokens, Visa and Mastercard are making it easy for more customers to use these wallets by making them more closely resemble card- or issuer-agnostic wallets, like Apple Pay or Android Pay. Having consistent standards, and consistent implementation of those standards, is a \"critical enabler for scale,\" Visa merchant solutions delivery and commercialization VP Vish Shastry told BI Intelligence.\nThat could ultimately increase consumer adoption. Merchants don't work in the business of payments, according to Shastry. Instead, they want to focus on providing their consumers with tools that are both seamless and transparent. As merchant networks expand, consumers will more easily be able to form habits around the wallet, which could increase both adoption and engagement. As such, growing prevalence of the wallet combined with growing opportunities to use it will likely bolster both products.","url":"https://www.businessinsider.com/unpacking-visa-and-mastercards-tokenization-deal-2016-12"}
