{"authors":["Michelle Moons"],"date_download":"2018-10-30 20:09:02","date_modify":"2018-10-30 20:09:02","date_publish":"2015-05-06 20:00:35","description":"“I am not remorseful,” 30-year-old Thomas Miguel Guerra told a San Diego Judge as he faced conviction and a six-month sentence for knowingly infecting another man with HIV. |","filename":"data/vaneerConsumption/UnrepentantHIVManGets6MonthsforKnowinglyInfectingLover.json","image_url":"https://media.breitbart.com/media/2015/02/Screen-Shot-2015-02-20-at-10.28.59-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_05_06__1540930142.html","title":"Unrepentant HIV+ Man Gets 6 Months for Knowingly Infecting Lover","title_page":"Unrepentant HIV+ Man Gets 6 Months for Knowingly Infecting Lover | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"“I am not remorseful,” 30-year-old Thomas Miguel Guerra told a San Diego Judge as he faced conviction and a six-month sentence for knowingly infecting another man with HIV.\nGuerra blamed the man he infected with the AIDS virus, saying the two were texting on “gay, bi, and curious guys” phone-based dating app Grindr, and quickly got together. The infected man, whose identity was protected, referenced text messages, saying Guerra laughed at the idea of infecting his sexual partners.\n“Understand the medical facts and accept the fact that he just can’t take responsibility for his actions. I did not rape this person. I did not take him of against his will. Within five minutes of Grindr text messaging, he was there. So, I mean, if you’re that reckless with your life how can you blame anyone else for your actions,” Guerra told the judge in defense of his actions.\nStatements made during court proceedings portray Guerra as a man predatorily seeking out young men and convincing them to have unprotected sex while knowingly exposing them to the AIDS virus.\nGuerra’s former lover called police after the relationship ended, according to prosecutors cited in a 10 News report.\nThe defendant reportedly stated he had not taken HIV medication for five years.\n“We hope this tragic case helps to educate people that they have a legal obligation–as well as a moral and ethical obligation–to inform their sex partners of their HIV status,” said City Attorney Jan Goldsmith in a statement, Team 10 reported.\nGuerra is reported as the first man in California to be convicted of the misdemeanor of willfully exposing a person to an infectious disease.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/05/06/unrepentant-hiv-man-gets-6-months-for-knowingly-infecting-lover/"}
