{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:48:09","date_modify":"2018-10-30 20:48:09","date_publish":"2016-07-09 09:38:43","description":"The Conservative party’s failed attempts to control spending and bring down public debt breach “human rights”, the UN has declared.","filename":"data/vaneerConsumption/UNSaysUKAusterityBreachesHumanRights.json","image_url":"https://media.breitbart.com/media/2016/07/Screen-Shot-2016-07-08-at-17.46.30.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_07_09__1540932489.html","title":"UN Says UK Austerity ‘Breaches Human Rights’","title_page":"UN Says UK Austerity ‘Breaches Human Rights’","title_rss":"NULL","source_domain":"breitbart.com","text":"The Conservative party’s failed attempts to control spending and bring down public debt breach “human rights”, the United Nations (UN) has declared, calling for a bigger state and a higher minimum wage.\nThe UN Committee on Economic, Social and Cultural Rights made the conclusions in a new report, claiming to be “deeply concerned” about “the various changes in the entitlements to, and cuts in, social benefits”.\nThe “State party’s” policies of “austerity” also “disproportionately affects the rights of disadvantaged and marginalised individuals” they claimed, adopting the lexicon of the far left.\nThe Committee further recommended the UK adopt a “socially equitable” tax policy and demanded the Tory party pursue a feminist agenda.\nThe UK should “intensify its efforts to increase the level of representation of women in decision-making positions, both in the public and private sectors… [and] adopt effective measures to eliminate the persistent gender pay gap,” they insisted.\n“The Committee notes with concern that certain groups of the population are more affected by, or at an increased risk of, poverty, in particular persons with disabilities, persons belonging to ethnic, religious or other minorities, single-parent families and families with children,” authors write.\nAdding: “Despite the increase of the national minimum wage that came into effect on 1 April 2016, the Committee is concerned that it is not sufficient to ensure a decent standard of living in the State party.”\nThe conclusions of the reports were based on evidence provided by campaigning charities and largely left-wing campaign groups.\nJust Fair, for example, an “economic, social and cultural rights movement”, supplied a large chunk of the evidence, and is run by card-carrying members of the Labour party, Europhiles and left-wing campaigners.","url":"https://www.breitbart.com/europe/2016/07/09/un-says-uk-austerity-breaches-human-rights-demands-higher-minimum-wage/"}
