{"authors":["Brakkton Booker"],"date_download":"2018-10-23 01:02:54","date_modify":"2018-10-23 01:02:54","date_publish":"2015-10-20 00:00:00","description":"The secretary-general's visit comes as recent clashes between Israelis and Palestinians have left dozens dead.","filename":"data/vaneerConsumption/UNSecretaryGeneralBanKimoonInJerusalemUrgesCalmAsViolenceContinues.json","image_url":"https://media.npr.org/assets/img/2015/10/20/ban-bibi-62228981_h40242592_wide-ec5da15a878e580766a2464efe8119e3bff652b7.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2015_10_20_450314699_un-secretary-general-ban-ki-moon-in-jerusalem-urges-calm-as-violence-continues_1540256574.html","title":"U.N. Secretary-General Ban Ki-moon In Jerusalem Urges Calm As Violence Continues","title_page":"U.N. Secretary-General Ban Ki-moon In Jerusalem Urges Calm As Violence Continues : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"U.N. Secretary-General Ban Ki-moon In Jerusalem Urges Calm As Violence Continues\nEnlarge this image toggle caption Li Rui/Xinhua /Landov Li Rui/Xinhua /Landov\nUnited Nations Secretary-General Ban Ki-Moon said his visit \"reflects the sense of global alarm\" and also urged calm during a stop in Israel on Tuesday. He met with Prime Minister Benjamin Netanyahu in an effort to quell the increase in violence there over the past month.\nDuring a joint press conference Tuesday with Netanyahu, Ban said the only way to bring an end to the new round of Israeli-Palestinian violence is through negotiations that produce \"visible, meaningful results.\" Ban added:\n\"I am here in the hope that we can work together to end the violence, ease the tensions and begin to restore a long-term political horizon of peace. ... \"Israelis and Palestinians are standing on the brink of another catastrophic period of violence. We need to keep the situation from escalating into religious conflict. ... We must create the conditions for meaningful negotiations that will end the occupation and realize the aspirations of both peoples.\"\nBan is also expected to meet with Palestinian Authority President Mahmoud Abbas on Wednesday, according to The Guardian.\nThe secretary-general's visit comes as recent clashes between Israelis and Palestinians have left dozens dead. Sunday saw a particular rise in violence following an attack on a bus station that killed a member of the Israeli security force and wounding 10 others.\nThe surge of bloodshed is attributed to the tensions surrounding a site in Jerusalem that is sacred to both Jews and Muslims. The site is known to Jews as the Temple Mount and to Palestinians as the third holiest place in Islam, the site of the Al-Aqsa Mosque.\nYouTube\nSpeaking at the news conference in Jerusalem, Netanyahu said denied claims that Israel was encroaching on the Al-Aqsa Mosque. He also said:\n\"In recent weeks, Israelis have been deliberately run over, shot, stabbed, even hacked to death. And in large part this is because [Palestinian Authority] President Abbas joined ISIS and Hamas in claiming that Israel threatens the Al-Aqsa Mosque. This, Mr. Secretary, is a total lie. Israel vigorously protects the holy sites of all faiths. We keep the status quo. The Palestinians by contrast are the ones who violate the status quo.\"\nReporting from Jerusalem ahead of Ban's visit, NPR's Emily Harris told our Newscast Unit:\n\"The UN says the secretary general has been 'anguished' over the recent weeks of increased Israeli-Palestinian violence. His wants to defuse tensions by meeting with leaders and victims of the violence on both sides. \"The recent escalation has been fed by conflicts over a Jerusalem site holy to both Jews and Muslims. A French proposal for the U.N. to bring international observers to the site was shot down by Israel and the U.S. But Palestinians say anger is also boiling over due to decades of restrictions under Israeli rule. Many Israelis see the upsurge in attacks as a religious fight, stoked by extremists in the region.\"\nAs the Two-Way has reported, Secretary of State John Kerry speaking from Madrid on Monday, called for Israel to uphold the status quo. NPR's Harris has confirmed that Netanyahu will meet with Kerry on Thursday, but the exact time is still in the works.\nThe secretary of state will meet with Abbas later in the week.\nSpeaking from Washington, Kerry said he wanted to urge both sides to \"go back to some basics\" when it comes to easing tensions over Jerusalem's holy site.\nHe also sought to hedge any notions of a breakthrough ahead of his high profile meetings with Israeli and Palestinian leaders. Kerry added:","url":"https://www.npr.org/sections/thetwo-way/2015/10/20/450314699/un-secretary-general-ban-ki-moon-in-jerusalem-urges-calm-as-violence-continues"}
