{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:05:57","date_modify":"2018-10-30 21:05:57","date_publish":"2017-01-03 21:52:27","description":"Mike Huckabee slammed the United Nations as a \"farce\" for caring more about \"Israelis building bedrooms\" than the threats posed by Iran.","filename":"data/vaneerConsumption/UNSlamsIsraelForBuildingBedroomsButAllowsSlaughterOfSyrians.json","image_url":"https://media.breitbart.com/media/2017/01/Mike-Huckabee-with-Maale-Adumim-mayor-Beni-Kashriel-at-a-cornerstone-laying-ceremony.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_01_03__1540933557.html","title":"UN Slams Israel For Building Bedrooms But Allows Slaughter Of Syrians","title_page":"Mike Huckabee To Knesset: UN Slams Israel For Building Bedrooms But Allows Slaughter Of Syrians","title_rss":"NULL","source_domain":"breitbart.com","text":"JERUSALEM/ MAALE ADUMIM – Mike Huckabee slammed the United Nations as a “farce” for caring more about “Israelis building bedrooms” in the settlements than the threats posed by Iran and the human rights violations of Syria and North Korea.\nThe former Arkansas governor was speaking at a Knesset session advocating the annexation of areas of Judea and Samaria, the Israeli government’s term for the West Bank. The session, and Huckabee’s trip to Israel, was coordinated by the Orthodox Jewish (OJ) Chamber of Commerce and its Public Policy Committee, which is led by activists Duvi Honig, Dr. Joseph Frager, Dr. Paul Brody, and Odeleya Jacobs.\n“When there is more outrage at the United Nations for the Israelis building bedrooms in their own land for their own people than there is for the Iranians building bombs to kill all those children there is something wrong,” Huckabee said.\nHe stated that the Islamic Republic was pressing forward on its “hell-bent desire to build a nuclear device” – and added, in a veiled reference to President Barack Obama – “which only an idiot would believe they don’t intend to weaponize.”\nHuckabee said that UN Security Council Resolution 2334, which determines all territory captured by Israel in the 1967 defensive war “occupied Palestinian territory,” was “an act of hate and contempt toward Israel.”\nHe attacked the international body for condemning North Korea, Russia, Iran and Syria only once each over the last year while Israel received a total of 20 resolutions against it.\nThe former governor also attacked Secretary of State John Kerry for his “irrational” speech.\n“It was absolute bull-butter. It was insulting, to me as an American and certainly to Israelis as well.”\nHuckabee said he believed the incoming president would support Israel’s right to construction in the settlements.\n“Everything [Donald Trump] has said to me indicates that he has extraordinary respect for Judea and Samaria and will have policies that reflect that,” he said.\nAs for his own feelings toward Trump, who beat him in the presidential race, Huckabee says he’s “proud to have supported him after I was out the race, proud to call him a friend and proud to say I think he is going to be a great president.”\nThe former presidential candidate added some advice for the president-elect: “Go big and go bold. Do not let the people of Washington drag you into their quagmire of inaction.”\nHe added that Trump and Prime Minister Benjamin Netanyahu, with whom he met after the Knesset speech, would get on “terrifically well,” because they’re both natural leaders and “plain-spoken people.”\nHe said he hopes that Trump makes good on his promise to move the U.S. embassy to Jerusalem, with Huckabee saying he “would be jumping up and down and celebrating.”\nWith regard to the two-state solution, Huckabee contends it is a “fantasy.”\n“The idea that you’re going to put two people on the same piece of real estate and one of those parties doesn’t believe the other has the right to exist, that’s not a policy, that’s a fantasy,” Huckabee said.\n“I think it’s time for us to say this isn’t going to work,” he said, adding that every time Israel made concessions in the past, such as the withdrawal from Gaza, it was an “unmitigated disaster” and ended up in the deaths of more Israeli civilians.\nHuckabee ended his address by instructing Israelis not to “give in to the world’s demands” regarding the settlements.\n“The world doesn’t hate you because of where you are, they hate you because of who you are and they hate you because of whose you are,” he said.\n“And I want to say as an outsider that they’re not going to hate you less if you give into their demands.”\nHuckabee was joined by 12 members of Knesset from a range of parties and Breitbart Jerusalem’s bureau chief, Aaron Klein, who addressed the session by outlining practical steps Israeli lawmakers should take in combating the Boycott, Divestment and Sanctions (BDS) movement.\nFollowing the Knesset event, the former governor visited the Jerusalem satellite city of Maale Adumim to attend a cornerstone-laying ceremony. On Sunday, Education Minister Naftali Bennett (Jewish Home) said he was submitting legislation to apply full Israeli sovereignty to Maale Adumim, a city of some 41,000 residents.","url":"https://www.breitbart.com/middle-east/2017/01/03/mike-huckabee-to-knesset-un-slams-israel-for-building-bedrooms-but-allows-slaughter-of-syrians/"}
