{"authors":["Associated Press"],"date_download":"2018-10-23 02:56:04","date_modify":"2018-10-23 02:56:04","date_publish":"2016-01-28 18:12:05","description":"GENEVA (AP) — The U.N. special envoy to Syria said Thursday that the peace talks he plans to launch in Geneva \"in the next few days\" are an opportunity not b...","filename":"data/vaneerConsumption/UNSyriaenvoyGenevatalksanopportunitynottobemissed.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:5e7eca889fd04af4a867df3102c77445-4PuZeKVXE7cd9005b2c876016cae-585_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420723_Opposition-says-Syrian-peace-talks-unlikely-begin-Friday_1540263364.html","title":"UN Syria envoy: Geneva talks an opportunity not to be missed","title_page":"UN Syria envoy: Geneva talks an opportunity not to be missed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UN Syria envoy: Geneva talks an opportunity not to be missed\nGENEVA (AP) — The U.N. special envoy to Syria said Thursday that the peace talks he plans to launch in Geneva \"in the next few days\" are an opportunity not be missed, urging Syrians to step up to the occasion to end their country's devastating civil war even as the main Syrian opposition group continued to delay its departure.\nSpeaking in a recorded message to the Syrian people on the eve of the talks, he said the United Nations \"will never abandon\" them and urged every Syrian to raise their voice and tell delegations coming to Geneva to compromise for the sake of peace.\n\"You have seen enough conferences — two of them already have taken place. This one cannot fail,\" he said.\nFILE - In this Saturday, Nov. 14, 2015 file photo, UN Special Envoy for Syria Staffan de Mistura speaks during a news conference in Vienna, Austria. One of the major opposition groups in the Syrian war said Wednesday, Jan. 27, 2016 it will only attend the imminent Geneva peace talks if the sieges in the country are lifted and other conditions are met, casting further uncertainty on the talks scheduled to begin in two days (AP Photo/Ronald Zak, File)\nPeace talks are scheduled to begin on Friday, but are now likely to be delayed due to ongoing disputes over which opposition parties will attend. And the main Syrian opposition group said it was still waiting for an official response from the United Nations about a list of concerns.\nThe Saudi-backed opposition bloc known as the Higher Negotiating Committee, which will be the main bloc in the talks, says that before it participates in the Geneva talks the government should stop bombardments and allow humanitarian access to besieged rebel-held areas according to U.N. Security Council Resolutions.\n\"It will be very difficult to hold the talks on Friday,\" said one Syrian opposition figure whose group is part of the Saudi-backed list. He added that many opposition figures still haven't obtained visas or made reservations to come to Geneva. He spoke on condition of anonymity because he was not authorized to speak to the media.\nDe Mistura, in his message, sidestepped the issue of when the talks would actually start, saying the U.N. was planning to launch the Syrian talks in the next few days.\n\"The horror is in front of everyone's eyes,\" he said, addressing the Syrian people. \"You must know also that we count on you to raise your voice to say 'khalas,' it's enough, to say to everyone who is coming from Syria and from abroad to this conference that there are expectations on them,\" he added.\n\"Now we need to hear your voice to everyone coming to this conference saying this conference must be an opportunity not to be missed.\"\nA senior opposition figure, Ahmad Ramadan, said the opposition's meetings in the Saudi capital, Riyadh, were \"ongoing\" and they are still waiting for a reply from the U.N. chief to a letter they sent him a day earlier asking the Security Council to implement its own resolutions with regards to halting bombardment of civilian areas and lifting blockades on besieged areas.\n\"There is a decision to participate in any negotiations that might alleviate Syrian suffering, but we are asking for clarifications about our concerns,\" Ramadan said. \"We expect there to be at least a mechanism for implementing U.N. Security Council clauses that have to do with humanitarian issues.\"\n\"If the U.N. is unable to implement a resolution that 15 countries voted on unanimously, how do they expect to move the peace process forward?\" he asked.\nRamadan added that he did not expect any of the Saudi-backed opposition people to be in Geneva by Friday, saying nobody is on their way. \"Everyone is still waiting,\" he said.\nAnother Syrian opposition figure said that the peace talks are unlikely to begin on Friday for \"technical reasons,\" adding that his group has named a second opposition list to be part of the talks.\nHaitham Manna, co-president of the Arab and Kurdish group known as the Syrian Democratic Council, told The Associated Press in the Swiss city of Lausanne that his group and their allies have named their own list of opposition participants, separate from the list named in Saudi Arabia, a move that is likely to anger the Saudi-backed opposition.\n\"We finished our list and we have what we can call the Democratic Secular Syrian list,\" Manna said without elaborating what groups it includes and whether the main Kurdish faction in Syria, the Democratic Union Party or PYD, is part of it. Turkey is strongly opposed to the PYD participating in the talks. He said the list includes 15 \"essential\" members and 15 others as supporting team.\nManna had said earlier he would boycott the talks if the PYD is not taking part.\nAsked Thursday whether the talks would kick off Friday, as envisioned by the U.N. Syria envoy, Manna said: \"I don't think so, for technical reasons now it's impossible.\" He did not elaborate.\n____","url":"https://www.dailymail.co.uk/wires/ap/article-3420723/Opposition-says-Syrian-peace-talks-unlikely-begin-Friday.html"}
