{"authors":["James Slack In London","John Stevens In Brussels For The Daily Mail"],"date_download":"2018-10-22 20:17:04","date_modify":"2018-10-22 20:17:04","date_publish":"2016-01-28 00:47:51","description":"A joint report by refugee agencies said an increasing number of people will come from south west Asia and Africa, adding further pressure to Europe's worst migration crisis since World War Two","filename":"data/vaneerConsumption/UNwarnsmigrantsfromAsiaandnorthAfricawillworsenEuropesmigrationcrisis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/30984C1000000578-0-image-a-35_1453941897858.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420209_EU-expect-million-year-warns-economic-migrants-Asia-north-Africa-worsen-Europe-s-migration-crisis_1540239424.html","title":"UN warns migrants from Asia and north Africa will worsen Europe's migration crisis","title_page":"UN warns migrants from Asia and north Africa will worsen Europe's migration crisis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"One million more migrants will arrive in Europe this year with increasing numbers of economic migrants coming from Asia and Africa, the United Nations warned yesterday.\nA joint report by refugee agencies said the conflict in Syria will continue to be a source of refugees seeking asylum in the European Union.\nBut an increasing number of people will also come from south west Asia and northern and western Africa adding further pressure to Europe's worst migration crisis since World War Two.\n'Continued arrivals will most likely put strain on affected communities and their willingness to accept refugees and migrants,' it said in the report compiled by the UN Refugee Agency, the International Organization for Migration and 65 other organisations.\nScroll down for videos\nOne million more migrants will arrive in Europe this year with increasing numbers of economic migrants coming from Asia and Africa, the United Nations warned yesterday (pictured, migrants arriving on Greek island of Lesbos)\nThe warning came as Greece was warned it could be sealed off from the rest of Europe within three months after the European Commission found it 'seriously neglected' its borders during the migrant crisis last year.\nA snap investigation found Greece was failing to screen those arriving on its islands and simply waving them through towards the rest of Europe.\nIt said Greece could be suspended from the EU's border-free travel-area, Schengen, for its failure to control the numbers of people coming in.\nCommission vice president Valdis Dombrovskis said: 'Greece is seriously neglecting its obligations. There are serious deficiencies in the carrying out of external border controls that must be overcome and dealt with by the Greek authorities.'\nIn an unannounced visit to the Greek islands Chios and Samos in November, inspectors found arrivals were not being checked before being allowed to continue their journeys.\nAt least two of the jihadi terrorists who took part in the Paris attacks came through the Greek island of Leros posing as Syrian refugees.\nThe said the conflict in Syria will continue to be a source of refugees seeking asylum in the European Union (pictured, migrants in Serbia)\nMr Dombrovskis added: 'Whilst acknowledging that the Greek authorities are under pressure, the report notably finds that there is no effective identification and registration of irregular migrants and that fingerprints are not being systematically entered into the system and travel documents are not being systematically checked for the authenticity or against crucial security databases.'\nThe EU has already started sending border guards to Macedonia to patrol its border with Greece and stop people being able to continue their journeys up through Europe.\nMore than 850,000 people arrived in the country last year, with most hoping to get to northern Europe.\nOnce the European Commission's report is endorsed by a majority of EU member states, Greece will be given three months to take 'remedial action' or face losing its place in the travel zone.\nEU officials this week began taking steps that could lead to border checks being brought back between Schengen countries for up to two years.\nGreece is supposed to be setting up migrant processing centres on its islands to screen arrivals, but so far it has only managed to open one on Lesbos.\nAccording to EU figures, only 121,325 of the 492,744 migrants who arrived in Greece from 20 July to 30 November 2015 were fingerprinted.\nThe EU has already started sending border guards to Macedonia to patrol its border with Greece and stop people being able to continue their journeys up through Europe (pictured, migrants in Macedonia)\nDespite the wintry conditions, the numbers of people reaching the Greek islands is still high and around 30 times higher than this time last year.\nAn EU source said 4,000 people had arrived in Greece on Friday alone.\nThe Schengen Agreement is named after the town in Luxembourg where it was signed in 1985, a decade before the borders were removed.","url":"https://www.dailymail.co.uk/news/article-3420209/EU-expect-million-year-warns-economic-migrants-Asia-north-Africa-worsen-Europe-s-migration-crisis.html"}
