{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 18:19:48","date_modify":"2018-10-30 18:19:48","date_publish":"2015-11-09 18:59:12","description":"U of Missouri President Resigns in Face of Million-Dollar Fine for Missing Football Game","filename":"data/vaneerConsumption/UofMissouriPresidentResignsinFaceofMillionDollarFineforMissingFootballGame.json","image_url":"https://media.breitbart.com/media/2015/11/ap_jordan-sherit-nick-washington-russell-hansbrough_ap-photo-wi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_11_09__1540923588.html","title":"U of Missouri President Resigns in Face of Million-Dollar Fine for Missing Football Game","title_page":"U of Missouri President Resigns in Face of Million-Dollar Fine for Missing Football Game","title_rss":"NULL","source_domain":"breitbart.com","text":"Over the weekend, 32 African-American players on the University of Missouri-Columbia football team joined a strike to protest purported acts of racism on campus saying they would boycott team activities, including games. But that boycott could have cost the school a million dollars for missing the game.\nThe hunger strikers are protesting what they claim are recent acts of “racism” that have made the school an “unsafe” place for African Americans. They also insisted they would not relent until Mizzou president Tim Wolfe resigned his position. On Saturday, the players joined the effort with their threatened boycott of the team.\nIt doesn’t appear that the school had any desire to try and force the players to fulfill their commitments. Evidence to that effect is seen in the fact that coach Gary Pinkel rushed out to give full support to the players despite the possible fine. Coach Pinklel voiced his support of the players on Twitter.\nThe Mizzou Family stands as one. We are united. We are behind our players. #ConcernedStudent1950 GP pic.twitter.com/fMHbPPTTKl — Coach Gary Pinkel (@GaryPinkel) November 8, 2015\nBut if this strike forced the Mizzou Tigers to skip the upcoming game with BYU, the Missourians could have been forced to pay their opponents a one million dollar fine. At 4-5, Missouri still holds a chance of appearing in a lucrative bowl game. Ditching a scheduled contest all but eliminated that chance.\nAccording to CBS Sports if the team and coaching staff canceled the upcoming game, a whopping fine would have resulted. CBS obtained a copy of the contract signed by both schools in 2014. “It calls for a two-game series. Game 1 is Saturday at Kansas City’s Arrowhead Stadium. The return game is set to be played at BYU in 2020,” the network reported.\nThe home team is required to pay the visitor a modest $250,000 rescheduling fee for each game. Saturday is considered a Missouri home game. The cancellation clauses make up the biggest part of the contract. The “defaulting party” agrees to pay $1 million to be paid no later than 30 days after the scheduled game if it’s not played within that window.\nWith the threat of this huge financial burden hanging over the team, and unrest engulfing the campus, President Tim Wolfe resigned his post on Monday morning.\nPresident Wolfe announced his decision at a meeting of the Board of Curators.\nIn his resignation statement Wolfe claimed that the situation spun out of control because both sides stopped “listening” to each other. Wolfe concluded saying he hoped that his resignation could be used to “heal and to start talking again.”\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com","url":"https://www.breitbart.com/sports/2015/11/09/u-of-missouri-president-resigns-in-face-of-million-dollar-fine-for-missing-football-game/"}
