{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 19:56:25","date_modify":"2018-10-30 19:56:25","date_publish":"2017-03-16 16:00:21","description":"Despite this week’s ridiculous return to Winter (how rude,) Atlanta’s brunch game remain...","filename":"data/vaneerConsumption/UPDATEDforSpring201715mimosabrunchesaroundAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/15/Images/WPIMAGE_cmgajcfoodandmore_14692.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_up_a40b64955eb8af62db86f464e1d68cf4__1540929385.html","title":"UPDATED for Spring 2017: 15 mimosa brunches around Atlanta","title_page":"UPDATED for Spring 2017: 15 mimosa brunches around Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"Despite this week’s ridiculous return to Winter (how rude,) Atlanta’s brunch game remains strong. Patios have already begun to come alive with the sound of mimosas being poured and the utterances of “put an egg on it.” If bottomless mimosas are your idea of a weekend must, we’ve got just the list of boozy brunch deals for you. Our list (much like these mimosas) could be bottomless but we culled it to a manageable 15 around metro Atlanta. Remember, friends, you still have to wait until 12:30 p.m. on Sunday to partake (thanks, Georgia.)\nCRU Wine Bar\nAvalon’s CRU Wine Bar offers Sunday brunch goers $10 carafes for the table filled with the classic mimosa of OJ and bubbles, peach bellini (peach puree and prosecco) or blood peach bellini with Moscato, blood peach puree and lemon.\nAvalon, 2200 1st St., Alpharetta. 678-248-5181, cruawinebar.com. Mimosa hours: 12:30 p.m.-3 p.m. Sundays.\nThe Mill Kitchen and Bar\nWe’re all about sipping $15 bottomless mimosas with our French toast while sitting leisurely on the Mill’s expansive stone patio overlooking Roswell’s quaint, historic square.\n590 Mimosa Blvd., Roswell. 770-817-9345, themillkitchenandbar.com . Mimosa hours: 12:30 p.m.-3 p.m. Sundays.\nFood 101\nYour boozy brunch here could consist of deviled eggs and ham, hashbrown casserole and French toast washed down with $15 bottomless mimosas.\n4969 Roswell Road #200, Atlanta. 404-497-9700, food101atl.com. Mimosa hours: 12:30 p.m.-3 p.m. Sundays.\nRed Pepper Taqueria\nOrange juice is boring. Red Pepper Taqueria gives you a choice of lime, watermelon, blood orange, mixed berries or prickly pear $15 bottomless mimosas to pair with your chilaquiles fiesta.\n3135 Piedmont Road N.E., Atlanta. 404-869-2773. 2149 Briarcliff Road N.E., Decatur. 404-325-8151, eatredpepper.com . Mimosa hours: 11 a.m.-3 p.m. Saturdays and Sundays.\nThe Ritz-Carlton Buckhead\nDon your Sunday best and head to the Ritz for a $15 unlimited Bubble Bar full of Champagne, sparkling wines and juices to make your own mimosas, bellinis or whatever strikes your fancy.\n3434 Peachtree Road, Atlanta. 404-237-2700, ritzcarlton.com . Mimosa hours: 12:30 p.m.-2 p.m. Sundays.\nTwisted Soul Cookhouse\nA Sunday DIY bottomless mimosa and Bloody Mary bar? Sold. It will cure whatever may be ailing you from the night before brunch. Also, steak and eggs with a side of peach cobbler parfait.\n1133 Huff Road NW, Atlanta. 404-350-5500, twistedsoulcookhouseandpours.com . Mimosa hours: 12:30 p.m.-3 p.m. Sundays.\nThe Mercury\nFor $34.95 per person, The Mercury is serving up a bottomless brunch of epic proportions which includes carving stations of prime rib, turkey and pork alongside waffles, omelets, bacon and fried chicken. For an additional $19.95 per person, you have your choice of bottomless mimosas or Bloody Marys. Time to tuck in.\nPonce City Market, 675 Ponce De Leon Ave NE., Atlanta. 404-500-5253, themercuryatl.com. Mimosa hours: 12:30 p.m.-3 p.m. Sundays. Reservations highly recommended.\nTAP on Ponce\nPortable mimosa alert! For just $12, TAP on Ponce at Ponce City Market is offering mimosa seekers a nifty kit for all your outdoor partying needs containing a 16.9-ounce growler filled with draft sparkling wine, 10 ounces of Orangina and cups for sharing.\nPonce City Market Central Food Hall, 675 Ponce de Leon Ave. NE, Atlanta. 404-835-2844, atthetap.com. Mimosa hours: 12:30 p.m.-3:30 p.m. Sundays.\nSweet Auburn BBQ\nBaby back ribs, a bucket of cornbread and a platter full of veggies to which you can now add $15 bottomless mimosas every Saturday and Sunday.\n656 N. Highland Ave. NE, Atlanta. 678-515-3550, sweetauburnbbq.com. Mimosa hours: 12:30 p.m.-3 p.m. Saturdays and Sundays.\nVenkman’s\nGet to Venkman’s when life demands not only $18 bottomless mimosas but chef Nick Melvin’s duck egg hash with breakfast poutine and a few local bands on the main stage.\n740 Ralph McGill Blvd. N.E., Atlanta. 470-225-6162, venkmans.com . Mimosa hours: 10:30 a.m.-3 p.m. Saturdays, 12:30 p.m.-4 p.m. Sundays.\nThe Shed at Glenwood\nThe Shed knows how to do brunch properly offering its mimosa lovers not one but three bubbly breakfast cocktail options. While you’re taking down a pastry basket, a few oysters and shrimp and grits, sip on the classic mimosa served bottomless for $16 or via a 48-ounce pitcher for $21, a peach bellini pitcher for $25 or a poinsettia (cranberry and sparkling wine) for $25.\n475 Bill Kennedy Way SE, Atlanta. 404-835-4363, theshedatglenwood.com. Mimosa hours: 12:30 p.m.-3 p.m. Sundays.\nSmoke Ring\nSoccer on the telly, breakfast burrito on your plate and $15 bottomless mimosas in your glass in Castleberry Hill. Don’t forget the first Sunday of every month is Bluegrass Brunch with live music (and bottomless mimosas.)\n309 Nelson St. SW, Atlanta. 404-228-6377, smokeringatlanta.com. Mimosa hours: 11:30 a.m.-3 p.m. Saturdays and Sundays.\nCafe Lily\nOk, so technically this isn’t a mimosa or bottomless but sometimes you just want sangria--an entire bottle of sangria for $28, to be precise. Pair that sangria bottle with Cafe Lily’s Greek lamb and eggs or the beignet de crabe for brunch .\n308 W. Ponce de Leon Ave., Decatur. 404-371-9119, cafelily.com. Sangria hours: 12:30 p.m.-3 p.m. Sundays. Paleo, vegetarian/vegan, dairy/gluten free friendly.\nSprig Restaurant\n$12 bottomless mimosas pair nicely with locally grown ingredients in dishes like a crab omelet, chicken and waffles or roasted beet and spinac h salad.\n2860 Lavista Road, Decatur. 404-248-9700, sprigrestaurant.com. Mimosa hours: 11 a.m.-2:30 p.m. Saturdays and Sundays.\n1910 Public House\nFeel good about yourself while you sip on your $15 bottomless mimosas at this Lilburn restaurant because you’ll be brunching on sustainably-farmed, local foods. “Eat well. Stay positive.”\n107 Main St. NW, Lilburn. 770-564-6911, 1910publichouse.com. Mimosa hours: 11 a.m.-3 p.m. Saturdays and Sundays.\nRead more of our coverage of the Atlanta bar scene\nClassic cocktail pop-up The Traveller Bar lands at the Loews Atlanta\n86 women-owned restaurants, food/beverage businesses in Atlanta\n4 new Atlanta-distilled spirits to add to your home bar\nWe predict Atlanta’s top 5 cocktail trends for 2017\n10 best drinks of 2016 in Atlanta\nRead The A List: The faces, places, dishes and drinks defining the Atlanta dining scene right now\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following@ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/updated-for-spring-2017-mimosa-brunches-around-atlanta/a7sA23Kk9qOezY2b5PezMO/"}
