{"authors":[],"date_download":"2018-10-30 20:15:17","date_modify":"2018-10-30 20:15:17","date_publish":"2015-05-08 14:12:49","description":"» The latest: Plane crash on I-285 at Peachtree Industrial Boulevard Four people have died after a small plane crashed Friday morning at I-285 at Peachtree Industrial Boulevard.","filename":"data/vaneerConsumption/Update4peopledeadinplanecrashonI285.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/05/08/Images/photos.medleyphoto.7240420.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_update-people-dead-plane-crash-285__1540930517.html","title":"Update: 4 people dead in plane crash on I-285","title_page":"Update: 4 people dead in plane crash on I-285","title_rss":"NULL","source_domain":"ajc.com","text":"» The latest: Plane crash on I-285 at Peachtree Industrial Boulevard\nFour people have died after a small plane crashed Friday morning at I-285 at Peachtree Industrial Boulevard.\nThe plane, according to Channel 2, left from DeKalb-Peachtree Airport and had problems climbing out.\nThe pilot reportedly said, “We’re going down.”\nChamblee and Doraville police are on the scene.\nOn the ground, there were “a lot of close calls,” DeKalb County fire Capt. Eric Jackson said. One of the cars nearly hit by the plane was that of a former DeKalb firefighter, he said.\nI-285 remained closed between Ashford Dunwoody and Chamblee Tucker most of the morning. And the traffic backups, according to Channel 2, could last for as many as eight hours.\nAccording to the Georgia Department of Transportation website, all lanes in both directions are shut down most of the morning.\nMotorists on eastbound I-285 were being diverted at exit No. 29 (Ashford Dunwoody Road) and can re-enter the interstate at Peachtree Industrial Boulevard. Traffic on westbound I-285 is closed at exit No. 34 (Chamblee Tucker Road). Westbound motorists can re-enter at Peachtree Industrial Boulevard.\nBunny Lenhard was on her way to one of those mundane daily activities, getting a manicure, when she suddenly saw the belly of an airplane overhead, almost on top of her.\n“I looked up and ducked,” said the Sandy Springs woman who, a moment later, saw the plane crash into flames in her rear view mirror of her Ford Edge.\nLenhard was eastbound on I-285 in the far right lane and didn’t hear the plane engine as it was coming down, she said, because she had the radio and the air conditioning on.\n“It was coming from the right, at an angle,” she said. “It looked big to me.”\n— Please return to AJC.com for updates.","url":"https://www.ajc.com/news/update-people-dead-plane-crash-285/7T06D9dPAev5xQUk7jaIiL/"}
