{"authors":["Tamar Hallerman"],"date_download":"2018-10-30 20:58:34","date_modify":"2018-10-30 20:58:34","date_publish":"2016-06-22 11:51:17","description":"Washington - U.S. Rep.","filename":"data/vaneerConsumption/UpdatedJohnLewisleadingguncontrolsitinonHousefloor.json","image_url":"https://politics.myajc.com/rf/image_large/Pub/p7/Politics-MyAJC/2016/03/01/Images/WPIMAGE_cmgajcpolitics_19398.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/politics.myajc.com/blog_politics_updated-john-_6e19c77b09c0670d7f70f5208cdf8e3f__1540933114.html","title":"Updated: John Lewis leading gun control sit-in on House floor","title_page":"Updated: John Lewis leading gun control sit-in on House floor","title_rss":"NULL","source_domain":"ajc.com","text":"Washington - U.S. Rep. John Lewis led Democrats in a surprise sit-in of the House chamber on Wednesday afternoon as the party pushed Republican leaders to allow for debate and votes on gun control legislation 10 days after the deadliest mass shooting in U.S. history.\nThe rare form of protest began shortly before noon, when the Atlanta Democrat and civil rights icon stepped into the well of the House for a searing five-minute speech urging the chamber to act in the memory of people who have been killed by gun violence.\n“We were elected to lead, Mr. Speaker,” Lewis said. “We must be headlights, and not taillights. We cannot continue to stick our heads in the sand and ignore the reality of mass gun violence in our nation.”\nHere's how it developed:\nUpdated at 3:08 p.m. A little color from the House floor as Democrats' gun control sit-in hurtles past the three-hour mark.\nDozens of House Democrats and half a dozen senators (including Elizabeth Warren) are clustered around the well of the House, some sitting on the carpet, others fanned out in seats, as lawmakers line up to address the group one-by-one. Atlanta Democrat John Lewis, who is leading the protest, is seated in the center of it all with his back against the clerk's desk.\nSome speakers simply read out the names of the 49 people shot dead by the Orlando shooter. Others talked about their districts' experiences during previous mass shooting while even more rallied the group about the legislative action they think House leaders should take after the deadliest mass shooting in American history.\nIn the crowd, lawmakers snapped pictures and videos, chanted and shouted back to their colleagues, \"No bill, no break.\"\n\"We're going to be here from a long time,\" Connecticut Democrat John Larson, who's helping organize the effort, told the crowd.\nOriginal Post:\nU.S. Rep. John Lewis, D-Atlanta, is currently leading a sit-in on the House floor, part of an attempt to force votes on gun control legislation in the wake of the June 12 Orlando massacre.\nDemocrats want GOP leaders to agree to a vote on legislation that would prevent people on the government's no-fly and terror watch lists from buying guns and expand background checks. They said Speaker Paul Ryan, R-Wis., should keep the House in session to debate and vote on such gun violence legislation, skipping the scheduled July 4 recess.\nIn a searing speech on the House floor, Lewis said Congress has dragged its feet for too long:\n\"We were elected to lead, Mr. Speaker. We must be headlights, and not taillights. We cannot continue to stick our heads in the sand and ignore the reality of mass gun violence in our nation. Deadly mass shootings are becoming more and more frequent. Mr. Speaker, this is a fact. It is not an opinion. We must remove the blinders. The time for silence and patience is long gone. We are calling on the leadership of the House to bring common-sense gun control legislation to the House Floor. Give us a vote. Let us vote. We came here to do our jobs. We came here to work. The American people are demanding action.\"\nRepublicans, who control the House floor, recessed the chamber after the sit-in began. They attempted to restart legislative business about 20 minutes later but quickly recessed again after dozens of Democrats stood in the well of the House and chanted \"no bill, no break.\"\n\"The House cannot operate without members following the rules of the institution, so the House has recessed subject to the call of the chair,\" a Ryan spokeswoman said.\nC-SPAN does not air video of the House floor when the chamber is in recess (which is an issue in and of itself), but California Democrat Scott Peters has been streaming live video of the proceedings on Periscope:\nhttps://www.periscope.tv/w/1OdKrwbWDNkGX\nHouse Democrats have also been posting pictures on Twitter:\nThe Senate rejected four firearms-related bills on Monday, including proposals related to background checks and blocking sales to suspected terrorists, and there are plans in the works to vote on a bipartisan \"no-fly, no-buy\" bill later in the week. The action came about after Democrats staged a nearly 15-hour talkathon on the Senate floor.\nBut the U.S. House functions much differently. It's majority rule, and unlike their Senate colleagues members of the House cannot stage filibusters in order to force the hand of the chambers' leaders.\nA Democratic aide said the sit-in is part of a week of disruptions the party has planned to bring gun violence to the forefront.\nThe group also wrote a letter to Ryan outlining their objectives. Here's an excerpt:\nThere is broad agreement among Americans – greater than 90 percent by some measures – that expanding background checks for firearms purchases is a reasonable measure for this Congress to pass. An overwhelming majority also agree that we should enact safety measures that keep guns out of the hands of suspected terrorists. The question before us is, what is this Congress waiting for?\nPhysically sitting on the House floor is technically a violation of House rules. Ditto for taking photos and video in the chamber.","url":"https://politics.myajc.com/blog/politics/updated-john-lewis-leading-gun-control-sit-house-floor/4SP84HOg54s6iDtVJz5YVK/"}
