{"authors":[],"date_download":"2018-10-30 20:16:34","date_modify":"2018-10-30 20:16:34","date_publish":"2015-03-17 15:15:41","description":"A suspicious, powdery substance that caused a scare at a federal prisons office in East Point Tuesday morning was later determined to be blood pressure medication.","filename":"data/vaneerConsumption/UpdateSuspiciouspowderfoundinEastPointwasmedication.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/03/17/Images/photos.medleyphoto.6955902.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_update-suspicious-powd_88550f38f2976fb3c93542f8c4bdf754__1540930594.html","title":"Update: Suspicious powder found in East Point was medication","title_page":"Update: Suspicious powder found in East Point was medication","title_rss":"NULL","source_domain":"ajc.com","text":"A suspicious, powdery substance that caused a scare at a federal prisons office in East Point Tuesday morning was later determined to be blood pressure medication.\nHowever, a note attached to the package elevated concern, officials said.\nRenita T. Shelton, spokeswoman for the City of East Point, told The Atlanta Journal-Constitution that an employee in the mailroom of the Federal Bureau of Prisons administrative office opened a letter just before 9:30 a.m. and found a “white, powdery substance.”\nAccording to East Point fire acting Chief William Ware, the package, which was mailed from Colorado, included a note.\n“The note was, ‘This is your morning cocktail,’” Ware told Channel 2 Action News. “So, obviously, that would raise concerns.”\nEast Point officials requested assistance from Atlanta fire officials, who sent a hazardous materials crew.\nJanet Ward, spokeswoman for the Atlanta Fire Rescue Department, said crews initially thought as many as 80 people might need to be decontaminated, but officials on the scene later told Channel 2 that three people were exposed to the substance and were being evaluated.\nOfficials said a second package from the same sender was intercepted en route to a different location. The substance in that package was deemed to be Aspirin.","url":"https://www.ajc.com/news/update-suspicious-powder-found-east-point-was-medication/vVwWBmHUpu1axCDyg8AAgO/"}
