{"authors":[],"date_download":"2018-10-30 20:42:29","date_modify":"2018-10-30 20:42:29","date_publish":"2014-05-25 20:56:36","description":"While no charges have been filed in a deadly crash that blocked Ga. 316 in Lawrenceville for hours on Sunday, the driver of one of the vehicles remains in custody in Gwinnett County today on an outstanding warrant from DeKalb in a vehicular homicide case.","filename":"data/vaneerConsumption/Update1killedinmultivehicleaccidentthatblockedGa316.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/05/26/Videos/3589000575001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_update-killed-mu_a0f8923f6c0970c14bb9c28385d85a0f__1540932149.html","title":"Update: 1 killed in multi-vehicle accident that blocked Ga. 316","title_page":"Update: 1 killed in multi-vehicle accident that blocked Ga. 316","title_rss":"NULL","source_domain":"ajc.com","text":"While no charges have been filed in a deadly crash that blocked Ga. 316 in Lawrenceville for hours on Sunday, the driver of one of the vehicles remains in custody in Gwinnett County today on an outstanding warrant from DeKalb in a vehicular homicide case.\nSabrina Townes, 32, of Lawrenceville, was treated at a hospital following the seven-vehicle wreck that killed one person and injured several others. She is in the Gwinnett County jail awaiting transfer to DeKalb, police said.\nSunday’s crash happened on Ga. 316 eastbound underneath the Lawrenceville Suwanee Road bridge around 3:20 p.m., Gwinnett County fire Capt. Tommy Rutledge said.\nAll lanes were blocked in both directions for several hours.\nWhen authorities arrived on the scene, there were two people trapped in one of the vehicles and they had to be extricated by firefighters, Rutledge said. One vehicle had flipped several times and came to rest upright.\nFour people were transported to Gwinnett Medical Center, where one of them died, Lawrenceville police said. The deceased was later identified as 39-year-old Pamela Leake, of Lawrenceville. Two of the patients were treated and released, police said. One remains in the hospital with non-life-threatening injuries. Two people had minor injuries and were treated at the scene.\nWitnesses told police that Townes was driving in the emergency lane and caused the chain-reaction crash, Channel 2 Action News reported.\nTownes was wanted in DeKalb in connection with the multi-vehicle wreck that killed Lymeng Lim in 2012, Channel 2 said.","url":"https://www.ajc.com/news/local/update-killed-multi-vehicle-accident-that-blocked-316/zljrXXF6eaNsxdFyaAukOM/"}
