{"authors":["Associated Press"],"date_download":"2018-10-23 01:41:34","date_modify":"2018-10-23 01:41:34","date_publish":"2016-01-29 15:42:48","description":"BISMARCK, N.D. (AP) — North Dakota and Minnesota are helping farmers with the three-year transition from traditional crops to organic production, an effort t...","filename":"data/vaneerConsumption/UpperMidwestfarmerstransitioningtoorganiccangetaid.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422985_Upper-Midwest-farmers-transitioning-organic-aid_1540258894.html","title":"Upper Midwest farmers transitioning to organic can get aid","title_page":"Upper Midwest farmers transitioning to organic can get aid | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Upper Midwest farmers transitioning to organic can get aid\nBISMARCK, N.D. (AP) — North Dakota and Minnesota are helping farmers with the three-year transition from traditional crops to organic production, an effort that the industry's main trade group says could boost the acreage of organically grown crops in the U.S. if it takes root beyond the upper Midwest.\nMinnesota started its grant program first, in 2013, and North Dakota followed suit this year. Both programs assist with the transition costs — everything from soil testing to education. Minnesota farmers can get up to $750 annually and North Dakota farmers up to $1,000.\nThe expense of the transition, which bans farmers from using mainstream chemicals and likely leads to lower yields, is not prohibitive, but \"there's a learning curve there that the farmer needs to go through,\" said Lowell Kaul, an organic farmer near Harvey, North Dakota, who serves on a board that advises the state agriculture commissioner. During the conversion, farmers can't sell their crops into the organic market until they are certified organic by a government-approved agency.\nThe Organic Trade Association is pushing for an industry-led, government-administered certification program for organic farmers who are still in the transition phase, to give them better support and possibly even premium prices for their crops, according to Nathaniel Lewis, the association's senior crops and livestock specialist.\nThe aid programs launched by Minnesota and North Dakota \"dovetail really well with what we're working on,\" he said. \"This is one tool that can assist farmers with transition. It's not a silver bullet (but) it's an appropriate role for agriculture departments to play.\"\nOrganic crops account for less than 1 percent of U.S. farmland, the association said, and federal Agriculture Department data shows there are only about 14,000 organic farms — a fraction of the 2 million total farms in the U.S. But the demand is high for organic products: Sales have increased from $3.6 billion in 1997 to nearly $40 billion in 2014, association figures show.\nThe gap is being made up for through imports, Lewis said, adding, \"This is an opportunity and we don't want American farmers to miss out on it.\"\nJaime Good, a marketing specialist with North Dakota's Agriculture Department, said his department saw the grants as a \"great opportunity for us to show our support to the organic industry and help people get started.\"\nThe two states' programs could potentially serve as a model for other states. If the organic industry gets a national transitional certification program established, it could \"in turn fuel demand for cost-share help through the states, and help other states create programs,\" Lewis said.\nBoth state programs have limited money — $20,000 annually in Minnesota and $5,000 per year in North Dakota. Minnesota's program provided funding to only 10 farmers in its first two years.\n\"It really is a challenge to find and communicate with farmers while they're in transition. A lot of them do it quietly,\" said Meg Moynihan, administrator of Minnesota's program. \"That is beginning to change. We're hearing from more and more farmers.\"\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3422985/Upper-Midwest-farmers-transitioning-organic-aid.html"}
