{"authors":[],"date_download":"2018-10-30 19:44:28","date_modify":"2018-10-30 19:44:28","date_publish":"2018-06-28 19:05:00","description":"“Off the Wall” is an initiative between the city of Atlanta, the Atlanta Super Bowl Host Committee and WonderRoot.","filename":"data/vaneerConsumption/Upto30civilrightsthemedmuralstograceAtlantabeforeSuperBowl.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/06/28/Videos/4426895.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_civil-rights-the_5888865fd2cbee5376779df3b35dcbc5__1540928668.html","title":"Up to 30 civil rights-themed murals to grace Atlanta before Super Bowl","title_page":"Up to 30 civil rights-themed murals to grace Atlanta before Super Bowl","title_rss":"NULL","source_domain":"ajc.com","text":"Standing in the shadow of an iconic mural honoring U.S. Rep. and civil rights activist John Lewis, Mayor Keisha Lance Bottoms listed cultural institutions located on the surrounding streets:\nBig Bethel, Ebenezer and Wheat Street — churches where civil rights movements “literally began in the basement;” The Royal Peacock — the former blues club where her parents met.\n“It is really important that we have these lasting reminders in our city, of obviously what the civil rights movement means to Atlanta, but also what arts and culture means,” she said during a Thursday morning press conference.\nThose lasting reminders will come in the form of “Off the Wall,” an initiative wherein nine artists will create up to 30 public murals related to civil rights and social justice movements. The project is a partnership between the city, the Atlanta Super Bowl Host Committee and WonderRoot, the arts and advocacy organization partially responsible for the mural on the King Memorial MARTA station.\nMural of Congressman John Lewis on Auburn Avenue. BOB ANDRES / BANDRES@AJC.COM. (Jewel Wicker/Atlanta Life and Culture Blog)\nChris Appleton, WonderRoot’s executive director, said the project will help shape the city’s legacy around Super Bowl LIII.\n“There is no greater legacy than Atlanta’s contribution to the civil rights movement, in particular the black liberation movement of the 1950s and 1960s,” he said during the press conference. “And so we thought, let’s leverage that moment, let’s leverage our history, the moment that is Super Bowl, to bring together diverse stakeholders to further amplify and elevate the stories of struggle for change and justice in Atlanta and beyond.”\nThe murals are slated for two areas: the neighborhoods around the Mercedes-Benz Stadium — Vine City, English Avenue and Castleberry Hill — and downtown Atlanta. The designs haven’t been decided, but will be developed through a series of community conversations attended by the artists.\nREAD | These hotel brands have been shortlisted for old Georgia Dome site\nREAD | The day of the Hawks cheerleader is over — they’re the ATL Dancers now\nThe artist group includes Atlanta residents Shelia Pree Bright, Shanequa Gay and Sean Schwab, the creator of the John Lewis mural on Auburn Avenue. It also includes Yehimi A. Cambron Alvarez of Mexico and Atlanta, Brandan “B-Mike” Odums of New Orleans, Andrew “Gaia” Pisacane of New York City, Ernest Shaw of Baltimore, Reginald “L.E.O” O’Neal of Miami and Gilbert Young of Cincinnati.\nBright, who attended the press conference, floated the idea of turning an abandoned house into an installation and safe space for meetings.\n“Those are my initial thoughts, but I got to go into the community and find out,” the artists and photographer said. “I think that’s very important because a lot of times, artists, we go and we leave … we don’t really know that community.”\n\"March2Justice\" by Atlanta photographer Shelia Pree Bright (FILE)\n“Off the Wall” is part of a larger initiative aimed at creating a lasting legacy from the Super Bowl. Also announced this week, the “Legacy 53” a community engagement initiative, which includes five pillars: capital improvement; civil rights and social justice; sustainability; engagement; and working with Business Connect, the NFL’s supplier diversity program.\nBrett Daniels, the host committee’s chief operating officer, said the civil rights-themed mural project resonated with the group as “the right thing to do.”\n“This is not a story that can be told in other cities. It’s not a story for Miami, it’s not a story for Minneapolis, it’s the story of Atlanta,” Daniels said Thursday.\nThe complete collection of works will become part of the city of Atlanta’s permanent public art collection, to be maintained by the city. This will be Atlanta’s third Super Bowl; the event was also held here in 1994 and 2000.\nLike Intown Atlanta News Now on Facebook | Follow us on Twitter\n[Insert text here]","url":"https://www.ajc.com/news/local/civil-rights-themed-murals-grace-atlanta-before-super-bowl/fCwsRPTKS44B7HK7i7ls5M/"}
