{"authors":["Press Association"],"date_download":"2018-10-23 03:16:21","date_modify":"2018-10-23 03:16:21","date_publish":"2017-03-10 12:44:41","description":"Hosts Sri Lanka had dismissed the Tigers for 312 on day three to secure a 182-run first-innings lead, and they extended their advantage to 456 before declaring on 274 for six in Galle.","filename":"data/vaneerConsumption/UpulTharangaputsSriLankaincontrolagainstBangladesh.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E20708600000578-0-image-a-132_1489149429379.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-4301152_Upul-Tharanga-puts-Sri-Lanka-control-against-Bangladesh_1540264581.html","title":"Upul Tharanga puts Sri Lanka in control against Bangladesh","title_page":"Upul Tharanga puts Sri Lanka in control against Bangladesh | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Upul Tharanga hit a century as Sri Lanka closed in on victory on day four of the first Test against Bangladesh in Galle.\nThe hosts had dismissed the Tigers for 312 on day three to secure a 182-run first-innings lead, and they extended their advantage to 456 before declaring on 274 for six.\nBangladesh reached 67 without loss before bad light ended play, leaving them needing another 390 runs for an improbable victory. No team has ever successfully chased a three-figure score in the fourth innings at Galle.\nUpul Tharanga impressed by knocking a century for Sri Lanka against Bangladesh in Galle\nTharanga struck 115 in opening for Sri Lanka in their second innings against the Tigers\nWith rain forecast for Saturday, the weather may well see the visitors escape with a draw.\nOpener Tharanga struck 115 from 171 deliveries as the 32-year-old registered a third Test ton and Dinesh Chandimal also weighed in with an unbeaten 50 as the game drifted away from the tourists.\nDimuth Karunaratne fell to Taskin Ahmed for 32 in the morning session and Kusal Mendis became Shakib Al Hasan's first victim on 19, but Tharanga and Chandimal shared a 64-run stand for the third wicket.\nDimuth Karunaratne made 32 before he was dismissed off the bowling of Shakib Al Hasan\nTharanga was bowled by spinner Mehedi Hasan Miraz after hitting 11 fours and two sixes, and Asela Gunaratne was cleaned up by Shakib in the next over.\nNiroshan Dickwella also fell cheaply - caught behind off Mehedi - but Dilruwan Perera hit a quickfire 33 to set up the declaration.\nTamim Iqbal knuckled down to grind out 13 from 44 deliveries before stumps, but opening partner Soumya Sarkar threw caution to the wind in thrashing 53 from 47 balls, including six fours and a six off Rangana Herath.","url":"https://www.dailymail.co.uk/sport/cricket/article-4301152/Upul-Tharanga-puts-Sri-Lanka-control-against-Bangladesh.html"}
