{"authors":["Abc News"],"date_download":"2018-10-30 00:56:18","date_modify":"2018-10-30 00:56:18","date_publish":"2018-10-29 12:36:24","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.","filename":"data/vaneerConsumption/UrbanMeyersaysheplansoncoachingnextseason.json","image_url":"http://media.video-cdn.espn.com/motion/2018/1029/dm_181029_kershaw_machado_future/dm_181029_kershaw_machado_future_default.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Sports_urban-meyer-plans-coaching-season_story_id=58829498_1540860978.html","title":"Urban Meyer says he plans on coaching next season","title_page":"Urban Meyer says he plans on coaching next season - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Ohio State coach Urban Meyer said he plans on coaching next year amid rumors he could step down at the end of the season.\n\"I plan on coaching,\" Meyer said Monday at his weekly press conference.\nWhen pushed on the idea, Meyer was asked if he would definitely be coming back next season, to which he replied yes.\nESPN's Paul Finebaum had said that signs seemed to point that Meyer could retire soon. Finebaum mentioned through watching Meyer that he sensed his time was coming to an end at Ohio State.\nFinebaum mentioned Meyer's health and that this could be a precursor to Meyer walking away at the end of the season.\nMany have noted Meyer's demeanor on the sideline this season, ESPN analyst Kirk Herbstreit said Meyer has looked anguished during games. In the 30-14 win over Minnesota on Oct. 13, Meyer seemed to punch the air in anger multiple times, threw off his headset and threw his play sheet in frustration as the game was going on.\nSince Meyer has returned to the sidelines after serving a three-game suspension for mismanaging the employment of former wide receivers coach Zach Smith, Ohio State has had struggles on defense and is coming off of a 49-20 point loss to Purdue on Oct. 20.\nWhen Meyer was asked about his health at the press conference, he said he was fine and didn't want people to worry about him. He was pushed on the issue of his sideline demeanor and if this season has indeed taken its toll on him.\n\"The games have gotten me for 30 years,\" Meyer said. \"We're not playing well and I'm one of those guys that I want to help fix the issue, like all coaches do. I'm not sure what anguished means; pissed, upset. When you see some of the things we're doing, it's really uncharacteristic of our teams.\n\"That might be what it looks like.\"","url":"https://abcnews.go.com/Sports/urban-meyer-plans-coaching-season/story?id=58829498"}
