{"authors":["Mail Online Reporter"],"date_download":"2018-10-22 23:23:19","date_modify":"2018-10-22 23:23:19","date_publish":"2016-01-28 12:19:59","description":"The photographer, from New York, looks for abandoned stations and tunnels, but has had near death experiences as trains come whizzing past.","filename":"data/vaneerConsumption/UrbanexplorerknownasDarkCyanideriskshislifephotographingNewYork.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30AA41F900000578-0-image-a-34_1453983563356.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420854_Dark-dangerous-illegal-Urban-explorer-known-Dark-Cyanide-risks-life-photographing-New-York-subway-tunnels-dead-night_1540250599.html","title":"Urban explorer known as Dark Cyanide risks his life photographing New York","title_page":"Urban explorer known as Dark Cyanide risks his life photographing New York | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He has been caught by workers and the authorities many times despite hiding when trains come speeding past\nA daring urban explorer has risked his life in order to snap a stunning series images of New York's subway tracks.\nAt the dead of night, the photographer - known only to his Instagram followers as Dark Cyanide - heads out to look for hidden gems, like abandoned stations, provisions and tunnels.\nHis intriguing images feature vibrant streaks, graffiti, and tight framing - and by adding individuals to some to some of shots, he is also able to depict the incredible scale of some of the tunnels.\nThe photographer, 19, admitted what he and his friends do is highly dangerous, illegal, and he does not recommend others attempt to explore such tunnels.\nAs well as roaming New York, Dark Cyanide has also shot subway tunnels in Boston and Los Angeles. On his expeditions, the explorer travels with experienced tunnel runners - usually in groups of between three and five people.\nThe more people present the more difficult it is to hide when the train come speeding past.\nDark Cyanide revealed he has had a number of 'near death experiences' and has been caught by workers and the authorities on a number of occasions.\nThe explorer, from New York, said: 'People look at tunnels as dark portals with nothing in between - there's so much more in the darkness outside of the train.\n'People love underground shots because they can never see it through the darkness and speed of the train going through the tunnels.\n'I like to capture the old graffiti, structure of the tunnel, the way the tracks curve and switch. I aim to create an artistic vision of the tunnel.'\nAn unnamed subway track in New York: Dark Cyanide pictures graffiti like the 'We Own The Night' slogan pictured here\nA tunnel runner is pictured in the bowels of the New York subway system\nWhich way now? Two explorers check out the subway tracks in Los Angeles\nMasked: The explorers know they face prosecution if they are caught so cover their faces in pictures on subway trains or underground.\nDark Cyanide has had a number of near death experiences as trains come rushing through the tunnels\nRound the bend: 'People love underground shots because they can never see it through the darkness and speed of the train going through the tunnels.'\nThe explorer, from New York, said: 'People look at tunnels as dark portals with nothing in between - there's so much more in the darkness outside of the train.'\nDark Cyanide usually explores with experience tunnel runners. Pictured: A woman explores a subway track in New York","url":"https://www.dailymail.co.uk/news/article-3420854/Dark-dangerous-illegal-Urban-explorer-known-Dark-Cyanide-risks-life-photographing-New-York-subway-tunnels-dead-night.html"}
