{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:05:04","date_modify":"2018-10-30 23:05:04","date_publish":"2016-12-06 19:04:31","description":"As they suit up for battle against the Trump administration, Democrats who dominate California’s Legislature vow to unleash one of the superpowers of","filename":"data/vaneerConsumption/UrgentappealCaliforniaDemocratstoinvokenewantiTrumpweapon.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/Urgency_Photo_1-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940704.html","title":"Urgent appeal: California Democrats to invoke new anti-Trump weapon","title_page":"Urgent appeal: California Democrats to invoke new anti-Trump weapon | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"As they suit up for battle against the Trump administration, Democrats who dominate California’s Legislature vow to unleash one of the superpowers of holding a supermajority: the ability to enact laws immediately.An underplayed consequence of the fact that they won two-thirds of the seats in both houses last month is that—if they stick together—California Democrats have the required margin to pass a bill with an “urgency” clause. Unlike ordinary bills passed by a simple majority, bills with urgency clauses take effect the minute the governor signs them, and cannot be stalled by voters who might try to prevent them from becoming law by forcing a ballot referendum.\nBy passing urgency bills, Democrats in Sacramento predict they will be able to act fast—counter-punching in real time—if Republican President-elect Donald Trump signs federal laws or adopts policies they perceive as hostile to California. Legislative Democrats hope to demonstrate the old adage that there’s strength in numbers when it comes to issues over which they are at odds with Trump, including the environment, healthcare, and particularly immigration.\nOn Monday they launched a preemptive strike, opening the new legislative session by proposing two bills to boost legal aid for undocumented immigrants in response to Trump’s threats of deportation. One would train public defenders in immigration law, the other would fund lawyers to represent undocumented immigrants facing deportation. Both are “urgency” bills that require support from two-thirds of the Legislature to pass.\n“There is an urgency of deportation of young children and women and families,” said state Senate leader Kevin de León (D-Los Angeles) during a Capitol press conference introducing the bills. “The President-elect takes office on January 20th and so obviously the urgency is immediate. We can’t wait until 2018.”\nHis counterpart in the Assembly—after delivering a fiery speech saying “Californians do not need healing, we need to fight”—said passing laws to respond to the federal government will be easier with the Democratic supermajority, and the urgency-clause option it allows.\n“We’ll use it when necessary,” said Speaker Anthony Rendon (D-Paramount). “We’ll use urgency to deal with immigration issues or other issues as well.”\nAcknowledging that most potential uses for the urgency maneuver are speculative at this point, de León’s top aide said he could imagine using it to respond if Congress were to repeal or restrict the Endangered Species Act, causing ripple effects on California water policy. The Democratic-controlled Legislature could respond by passing a similar bill creating state endangered species protection, said Dan Reeves, de León’s chief of staff.\n“It’s a game of chess: They make a move, we make a move,” he said. “We have the ability to almost respond in real time, as opposed to having a six-month delay to our counter-punch.”\nMany Republicans derided Democrats’ immediate focus on immigration, with Assembly GOP leader Chad Mayes sending out a statement calling it a “divisive agenda designed to inflame tensions many of us seek to soothe.”\nBut with so few GOP votes in the Legislature now, there’s not much Republicans can do to torpedo a Democratic bill. Democrats’ margin theoretically allows them to govern in Sacramento without any input from Republicans. Beyond passing bills with urgency clauses, Democrats also could raise taxes, pass political reform bills and put constitutional amendments on the ballot—all without a single vote from the GOP.\nBut the real test will be whether Democrats will be able to hang together to oppose Trump.\nThe last time Democrats had a supermajority—in 2013—divisions within the party killed bills that needed two-thirds approval. This year, the Democratic supermajority includes many moderate Democrats who sometimes split from progressives on environmental and labor issues. Yet many of them are Latino, and would likely be wary of Trump’s hardline approach to immigration. Still, a leader of that band of moderate Democrats didn’t commit to voting with his party on everything it might do to oppose the new president.\n“If they want to use a supermajority it’s really going to depend on the details,” said Assemblyman Rudy Salas (D-Bakersfield). “I see moderates as the bridge between Democrats and Republicans….We love to be the glue that brings everything together.”\nDemocratic Gov. Jerry Brown struck a cautious tone meeting with reporters this week, saying he would take things step by step in navigating California’s relationship with a new federal government. Asked whether a Democratic supermajority could help California respond to potential conflicts, Brown said it “remains to be seen.”\nSupermajorities, he said, “are very challenging because the more Democrats there are, the more independent are the most recent members.”\nYet Brown said it’s likely Democrats will close ranks over immigration issues, even if they splinter in other areas: “I think there’s a lot of consensus on that. Just looking at who the new members are, I would think there would be a lot of unity.”\nAs proof of that unity, Rendon pointed to the votes on a pair of resolutions lawmakers considered Monday touting immigrants’ contributions to California and calling on Trump “not to pursue mass deportation strategies.” Though resolutions are non-binding, the symbolism was strong. Both resolutions passed with more than two-thirds approval; every single Democrat voted for them, along with two Republicans.","url":"https://calmatters.org/articles/urgent-appeal-california-democrats-to-invoke-new-anti-trump-weapon/"}
