{"authors":["Frances Martel"],"date_download":"2018-10-30 21:09:35","date_modify":"2018-10-30 21:09:35","date_publish":"2015-02-10 16:09:32","description":"Multiple groups believed to be Syrian refugees have been detained and rejected from Montevideo, Uruguay, after using falsified Israeli passports.","filename":"data/vaneerConsumption/UruguayDetainsTenSuspectedSyrianRefugeesUsingFakeIsraeliPassports.json","image_url":"https://media.breitbart.com/media/2015/02/Uruguay-airplane-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_10__1540933775.html","title":"Uruguay Detains Ten Suspected Syrian Refugees Using Fake Israeli Passports","title_page":"Uruguay Detains Ten Suspected Syrian Refugees Using Fake Israeli Passports | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Multiple groups of people believed to be Syrian refugees have been detained and rejected from Montevideo, Uruguay, after using falsified Israeli passports to book their flights into the nation.\nThis week, reports Spanish newswire EFE, ten individuals entered Carrasco International Airport in Montevideo using fake Israeli passports, traveling into Uruguay from Brazil. Authorities sought to verify their passports after Spanish authorities warned that they had seen similar cases of falsified Israeli passports in Europe. When interrogated by authorities, the group could not respond to English or Hebrew, leading authorities to suspect they were Syrian. The group consisted of seven women, two men, and a child. They were flown back into Brazil.\nThe group is the second in as many weeks stopped at the same airport with similarly counterfeit identification. Uruguay’s El Observador newspaper reports that authorities stopped a group of four Syrian citizens, also using false passports, at the capital’s airport. Those individuals were questioned by Israeli Mossad authorities, which have been working closely with the Uruguayan government on security issues for both the Israeli embassy and violent attacks against Jewish Uruguayans in particular.\nUruguay received international praise last year when it announced that it would begin accepting Syrian refugees to resettle in its borders. Within only months of the refugee program’s establishment, however, Uruguay announced this week that it would ban Syrian refugee men from entering Uruguay, accepting only women and children. Its argument is that incidents of domestic abuse within the Syrian refugee community were too high to allow them to continue relocating into the country as families with a father figure.\nAs authorities impose more stringent requirements of Syrian refugees to receive asylum, illegal activity involving the smuggling of Syrians out of their country has increased. In Spain, where the group of seven using Israeli passports is believed to have begun their journey into Uruguay, law enforcement shut down an entire smuggling ring dedicated to relocating Syrian refugees within the European Union in November.\nIt is believed that up to nine million Syrians have left their homes due to the civil war which erupted there in 2011 and continues to claim lives. It now consists not only of rebel factions against President Bashar al-Assad, but rebel factions against jihadist groups like the Islamic State, the al-Nusra Front, and the al-Qaeda outfit. While many have relocated to neighboring Turkey and Lebanon, some still have spread as far as the United States and Latin America, while others remain internally displaced within Syria.","url":"https://www.breitbart.com/national-security/2015/02/10/uruguay-detains-ten-suspected-syrian-refugees-using-fake-israeli-passports/"}
