{"authors":["Gavin Lesnick"],"date_download":"2018-10-30 01:15:51","date_modify":"2018-10-30 01:15:51","date_publish":"2018-09-14 01:37:00","description":"An Arkansas nursing care facility fired female employees or forced them to resign after they complained about sexual harassment, the U.S. Equal Employment Opportunity Commission contends in a lawsuit filed in federal court on Friday.","filename":"data/vaneerConsumption/USagencysuesArkansasnursingcarefacilitysaysitfiredworkerswhocomplainedofsexharassment.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_sep_14_arkansas-n_8763be6c4669b75326ae4ff044af1bbe__page=1_1540862151.html","title":"U.S. agency sues Arkansas nursing care facility, says it fired workers who complained of sex harassment","title_page":"U.S. agency sues Arkansas nursing care facility, says it fired workers who complained of sex harassment","title_rss":"NULL","source_domain":"arkansasonline.com","text":"An Arkansas nursing care facility fired female employees or forced them to resign after they complained about sexual harassment, the U.S. Equal Employment Opportunity Commission contends in a lawsuit filed in federal court Friday.\nThe lawsuit against Happy Valley Nursing and Rehabilitation in Malvern names three former employees and states all of them \"reported sexual harassment by the maintenance supervisor, a management employee\" to the owner.\n\"All of the claimants were terminated and/or were forced to resign within days and or weeks of reporting,\" the complaint states, noting harassment at the facility was first reported in 2016 and continued for two years with \"no corrective action.\"\nA woman who answered the phone at Happy Valley Nursing on Friday afternoon said she had no comment on the lawsuit.\nThe suit, filed in the U.S. District Court for the Western District of Arkansas, asks for compensation for lost wages for the three former workers and others who were affected in addition to \"punitive damages for ... malicious and reckless conduct\" to be determined at a jury trial.\nRead Saturday's Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2018/sep/14/arkansas-nursing-care-facility-fired-workers-who-c/?page=1"}
