{"authors":["Associated Press"],"date_download":"2018-10-23 00:09:37","date_modify":"2018-10-23 00:09:37","date_publish":"2017-04-26 09:20:23","description":"An unarmed Minuteman III intercontinental ballistic missile has been launched from a U.S. Air Force Base in California on a flight to a target in the Pacific Ocean.","filename":"data/vaneerConsumption/USAirForcetestsintercontinentalballisticmissile.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F6CEC00000578-0-image-a-5_1493207224481.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446768_Air-Force-launches-unarmed-missile-California_1540253377.html","title":"U.S. Air Force tests intercontinental ballistic missile","title_page":"U.S. Air Force tests intercontinental ballistic missile | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An unarmed Minuteman III intercontinental ballistic missile has been launched from a U.S. Air Force Base in California on a flight to a target in the Pacific Ocean.\nThe missile lifted off at 12:03am Wednesday from Vandenberg Air Force Base, 130 miles northwest of Los Angeles.\nAn Air Force statement said the mission was part of a program to test the effectiveness, readiness, and accuracy of the weapon system.\nThe U.S. Air Force tested an intercontinental ballistic missile early Wednesday morning. Above, a Minuteman III missile being launched at Vandenberg Air Force Base in California during a previous test in February 2016\nAbove, U.S. Air Force technicians perform an electrical check on a Minuteman III missile in 1980\nThe 30th Space Wing commander, Col. John Moss, said Minuteman launches are essential to verify the status of the U.S. nuclear force and to demonstrate the national nuclear capabilities.\nIn a Minuteman test, a so-called re-entry vehicle travels more than 4,000 miles downrange to a target near the Kwajalein Atoll in the Marshall Islands.\n'Team V is once again ready to work with Air Force Global Strike Command to successfully launch another Minuteman III missile,' Moss said.\n'These Minuteman launches are essential to verify the status of our national nuclear force and to demonstrate our national nuclear capabilities. We are proud of our long history in partnering with the men and women of the 576th Flight Test Squadron to execute these missions for the nation,' Moss added.\nThe missile on Wednesday was headed toward a location near the Kwajalein Atoll (pictured) in the Pacific Ocean\nThe 576th Flight Test Squadron will be responsible for installed tracking, telemetry, and command destruct systems on the missile.\nThe test comes amid rising tensions with North Korea, which has been testing its own missiles.\nPyongyang, North Korea is about 3,300 miles from Kwajalein Atoll.","url":"https://www.dailymail.co.uk/news/article-4446768/Air-Force-launches-unarmed-missile-California.html"}
