{"authors":["Associated Press"],"date_download":"2018-10-22 23:37:23","date_modify":"2018-10-22 23:37:23","date_publish":"2017-03-10 03:34:07","description":"BEIJING (AP) - American aluminum producers have filed a complaint accusing Chinese smelters of exporting at improperly low prices in the first case of its...","filename":"data/vaneerConsumption/USaluminumgroupfilestradecomplaintagainstChina.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/05/wire-194121-1489123170-791_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4299894_US-aluminum-group-files-trade-complaint-against-China_1540251443.html","title":"US aluminum group files trade complaint against China","title_page":"US aluminum group files trade complaint against China | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BEIJING (AP) - American aluminum producers have filed a complaint accusing Chinese smelters of exporting at improperly low prices in the first case of its kind for the administration of President Donald Trump.\nAn industry group, the Aluminum Association, said it filed the case Thursday with U.S. regulators accusing Chinese producers of receiving improper subsidies and selling at unfairly low prices that hurt foreign competitors. It asked the government to impose anti-dumping duties of 38 percent to 134 percent on aluminum foil for consumer and industrial uses.\nA flood of low-cost Chinese aluminum exports has pushed global prices so low that U.S. and European smelters are closing. Producers say thousands of jobs are at risk.\nFILE - In this Aug. 22, 2016 file photo, workers remove air ducts made from aluminum sheet metal in Beijing, China. American aluminum producers have filed a complaint on Thursday, March 9, 2017 accusing Chinese smelters of exporting at improperly low prices in the first case of its kind for the administration of President Donald Trump. (AP Photo/Ng Han Guan, File)\nTrump promised during his campaign to raise duties on Chinese imports to offset what he was unfair action by Beijing but has yet to take action.\nAluminum is one of an array of Chinese industries including steel, coal and glass whose production mushroomed over the past decade until supply vastly exceeded demand.\nThe ruling Communist Party is shrinking steel and coal production but has yet to announce plans for aluminum.\nChinese smelters that make more than half the world's aluminum are adding millions of tons of capacity, supported by what Western competitors say are improper subsidies.\nAfter a dip in early 2016, Chinese aluminum production rebounded to a new high of 2.95 million tons in the month ending in mid-February, according to data compiled by the International Aluminum Institute in London.\nThe Aluminum Association said it was the first trade case it has filed in the group's 85-year history. The complaint was filed with the U.S. Commerce Department and the International Trade Commission.\n\"This unprecedented action reflects both the intensive injury being suffered by U.S. aluminum foil producers and also our commitment to ensuring that trade laws are enforced to create a level playing field for domestic producers,\" said the association president, Heidi Brock, in a statement.\n___\nAluminum Association: www.aluminum.org","url":"https://www.dailymail.co.uk/wires/ap/article-4299894/US-aluminum-group-files-trade-complaint-against-China.html"}
