{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 17:56:40","date_modify":"2018-10-30 17:56:40","date_publish":"2016-03-30 13:08:49","description":"The Islamic Republic of Iran defied a United Nations Security Council resolution that endorsed the historic nuclear deal by conducting at least two sets of ballistic missile tests that were \"inherently capable of delivering nuclear weapons.\"","filename":"data/vaneerConsumption/USAlliesDeclareIranMissileTestsWereInDefianceofUNResolutionReport.json","image_url":"https://media.breitbart.com/media/2015/12/Iran-Tests-Ballistic-Missile-YouTube-ali-javid.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_30__1540922200.html","title":"U.S., Allies Declare Iran Missile Tests Were 'In Defiance of' U.N. Resolution - Report","title_page":"U.S., Allies Declare Iran Missile Tests Were 'In Defiance of' U.N. Resolution - Report | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Islamic Republic of Iran defied a United Nations Security Council resolution that endorsed the historic nuclear deal by conducting at least two sets of ballistic missile tests that were “inherently capable of delivering nuclear weapons.”\nThe announcement was made on Tuesday through a joint letter penned by the United States and its European allies that was seen by Reuters, which broke the news.\nEarlier this month, Iran conducted another round of illegal ballistic missile tests which were an even more egregious violation of sanctions than their previous launch in October.\nThe joint letter by the U.S., England, France and Germany addressed to Spain’s U.N. Ambassador Roman Oyarzun Marchesi and U.N. security chief Ban Ki-moon reportedly stated that the tests were “inconsistent with” and “in defiance of” council resolution 2231. The letter urged the Security Council to discuss “appropriate responses” to the regime’s failure to comply with the agreement.\nThe letter also reportedly said that Western powers “note with concern that Iranian military leaders have reportedly claimed these missiles are designed to be a direct threat to Israel.”\nHouse Foreign Affairs Chairman Rep. Ed Royce (R-CA) expressed deep concern over the writing on the side of those Iranian missiles in an exclusive interview with Breitbart News ahead of the Persian New Year: “Words to the effect of ‘Israel does not have the right to exist,’ or ‘will cease to exist.’ And what also concerns me is that the chants of ‘Death to America,’ ‘Death to Israel’ are still being made by the Ayatollah,'” Royce said.\nSeveral diplomats have suggested, and Reuters has pointed out, that “public rebuke” seems to be the most Iran could expect. However, others in public service have taken that one step further and reportedly suggested a rebuke by the Security Council could provide a foundation for Western nations to join forces and create new sanctions against the Iranian regime.\nAlthough Russia’s Vladimir Putin has clearly stated his opposition to imposing new U.N. sanctions on Iran, Western officials have been slightly less vehement in their response. The wording in the nuclear deal would only reimpose U.N. sanctions if Iran violated restrictions placed on its atomic program.\nOne of the facets of the Iran nuclear deal calls upon the nation to refrain from questionable activity for up to eight years. Missile launches, including those that are designed to be able to deliver nuclear warheads, are also part of the deal.\nReuters notes that the joint letter stopped short of calling the launches a “violation” of the resolution, known as the JCPOA.\nFollow Adelle Nazarian on Twitter @AdelleNaz.","url":"https://www.breitbart.com/national-security/2016/03/30/iran-defied-un-resolution-with-missile-tests/"}
