{"authors":["Associated Press"],"date_download":"2018-10-23 05:15:00","date_modify":"2018-10-23 05:15:00","date_publish":"2016-01-29 21:04:13","description":"JERUSALEM (AP) — U.S and British intelligence cracked the codes of Israeli drones operating in the Middle East and monitored their surveillance feeds for alm...","filename":"data/vaneerConsumption/USandUKspiedonIsraelidronesforyears.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422391_US-UK-spied-Israeli-drones-years_1540271700.html","title":"US and UK spied on Israeli drones for years","title_page":"US and UK spied on Israeli drones for years | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US and UK spied on Israeli drones for years\nJERUSALEM (AP) — U.S and British intelligence cracked the codes of Israeli drones operating in the Middle East and monitored their surveillance feeds for almost 20 years, according to documents leaked by an American whistleblower and published in international media on Friday.\nReports by the German magazine Der Spiegel and the investigative website The Intercept said the details emerged from documents leaked by Edward Snowden, the former National Security Agency contractor who leaked millions of documents about U.S. government surveillance in 2013.\nThe reports said the intelligence agencies were able to watch information that the drones and other aircraft broadcast back to their handlers. The project codenamed \"Anarchist\" has operated since 1998 and was based near the highest point in Cyprus. Israel was the focus of the program but it also hacked into systems in Egypt, Turkey, Iran and Syria, the reports said.\nIn one instance in 2008, an NSA internal newsletter boasted of the Anarchist program successfully collecting video from the cockpit of an Israeli F-16 fighter, the Intercept report said. It said the hacking granted intelligence agencies a \"virtual seat in the cockpit\" as Israeli aircraft hit targets.\nIt also showed footage of what it said appeared to be armed drones. Israel neither denies nor confirms use of weaponized drones.\nThere was no official comment on the reports In Israel. However, Israeli Cabinet minister Yuval Steinitz, who has held the post of minister of intelligence affairs, said, \"We are not surprised; we know that the Americans spy on every country in the world and on us as well, on their friends.\"\n\"It is nevertheless disappointing because among other reasons, we haven't been spying or collecting intelligence or cracking codes in the United States for decades,\" he told Army Radio.\nThe White House declined to comment on alleged U.S. intelligence activities but said the U.S. commitment to Israel's security remained \"sacrosanct.\"\n\"We do not conduct any foreign intelligence surveillance activities unless there is a specific and validated national security purpose,\" said White House spokesman Josh Earnest.\nBritain's Foreign Office said: \"We don't comment on intelligence matters.\"\n___\nAssociated Press writers Jill Lawless in London and Josh Lederman in Washington contributed to this report\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3422391/US-UK-spied-Israeli-drones-years.html"}
