{"authors":["Frances Martel"],"date_download":"2018-10-30 19:25:51","date_modify":"2018-10-30 19:25:51","date_publish":"2015-11-12 16:47:47","description":"Two nephews of Venezuelan President Nicolás Maduro have been extradited to NYC on charges of attempting to smuggle 800 kilograms of cocaine.","filename":"data/vaneerConsumption/USArrestsVenezuelanPresidentsNephewsforDrugs.json","image_url":"https://media.breitbart.com/media/2015/11/Maduro-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_12__1540927551.html","title":"U.S. Arrests Venezuelan President's Nephews for Drugs","title_page":"U.S. Arrests Venezuelan President's Nephews for Drugs","title_rss":"NULL","source_domain":"breitbart.com","text":"Two nephews of Venezuelan President Nicolás Maduro have been arrested and extradited to New York on charges of attempting to smuggle 800 kilograms of cocaine into the United States. These arrests follow more than a year of investigations and accusations that Venezuelan government officials are deeply involved in the drug trade.\nEfraín Antonio Campo Flores and Francisco Flores de Freitas, nephews of Maduro’s wife and legislative candidate Cilia Flores, have been flown out of Haiti to New York City to face charges that they negotiated with a DEA informant to sell cocaine in New York. The two suspects allegedly contacted a DEA informant requesting information regarding the trafficking of drugs out of the Honduran island of Roatán, ultimately shipping it to New York.\nAccording to the Wall Street Journal, not only did Campo Flores and Flores de Freitas request aid in trafficking the drugs, they physically presented 800 kilograms of the drug to the informant to allow him to inspect the product for quality. This meeting, the newspaper alleges, was recorded and will be used as evidence against them.\nCampo Flores, 29, identified himself to authorities upon his arrest as Maduro’s stepson, claiming to have been raised by Cilia Flores. In addition to running for an Assembly seat, Flores has previously served as the president of the National Assembly, a position currently held by the nation’s second-in-command, Diosdado Cabello.\nMaduro, currently flying out of Riyadh following the conclusion of an Arab-Latin American summit, has not made an explicit statement about the arrest yet. Taking to his Twitter account, however, he implied the arrest was “an imperialist ambush.”\nLa Patria seguirá su Camino,ni ataques,ni emboscadas imperiales,podrán con el Pueblo de los Libertadores,tenemos un solo destino..Vencer…. — Nicolás Maduro (@NicolasMaduro) November 12, 2015\n“The nation will continue its Way, neither attacks, nor imperialist ambushes, will be able to overcome the People of the Liberators, we have only one destiny..to Win….” he wrote on his account Wednesday night.\nDrug trafficking has become a major U.S. concern regarding the potential of Venezuela’s socialist government of doing harm in the region and potentially threatening the wellbeing of American citizens. The Wall Street Journal notes that at least 56 Venezuelan nationals have had their visas revoked over drug allegations in the past year.\nSpeaking anonymously to Argentine news outlet Infobae, a U.S. official notes that, under Maduro, Venezuela has become the most viable route to traffic cocaine out of Colombia to the United States. “Venezuela is the most efficient route for traffickers,” the official said. The report cites a DEA analysis that reveals that, “due to the success of Dominican authorities and interception efforts on behalf of the U.S. Coast Guard, drug traffickers have been forced to send thousands of tons of cocaine from Venezuela and Colombia directly to Puerto Rico,” a much longer, riskier route. In August 2015, the U.S. Coast Guard announced that it had seized more drugs traveling on ship in 2015 than it had in the past three years combined. Homeland Security Secretary Jeh C. Johnson praised the Coast Guard’s “great success” in cracking down on trafficking, much of it directed by Venezuelan smugglers.\nUnlike smugglers in other countries, American officials are investigating the nation’s most powerful politicians for organizing trafficking operations, not just private organized criminal syndicates. Among the most sought-after alleged drug smugglers is National Assembly president Diosdado Cabello. American officials are actively investigating Cabello after his former security chief defected to the United States and told officials that Cabello is the drug lord in charge of the Cartel de los Soles, one of South America’s largest cocaine trafficking operations. The cartel is named such because it is believed to be run exclusively by the Venezuelan military, who wear sun pendants on their uniforms.\nOther major Venezuelan government officials under investigation include former secret police chief Pedro Luis Martín and former counternarcotics official Jesús Alfredo Itriago.\nWhile there is no evidence that President Maduro himself is involved in the day-to-day of any drug smuggling operations, former Assistant Secretary of State for Western Hemisphere Affairs under George W. Bush, Roger Noriega, accused the president in April of having funded his last presidential campaign with drug money funneled through Cabello’s organization.\nThe Venezuelan government has repeatedly denied involvement in any drug trafficking, often taking to personally insulting witnesses against them as tools of American imperialism.","url":"https://www.breitbart.com/national-security/2015/11/12/u-s-arrests-venezuelan-presidents-nephews-drug-trafficking/"}
