{"authors":["Frances Martel"],"date_download":"2018-10-30 19:26:37","date_modify":"2018-10-30 19:26:37","date_publish":"2015-11-13 18:41:56","description":"Venezuelan President Nicolás Maduro has remained mum regarding the arrest of two of his nephews this week for attempting to sell cocaine.","filename":"data/vaneerConsumption/USArrestsofPresidentsNephewsNotConfirmed.json","image_url":"https://media.breitbart.com/media/2015/11/Maduros-Nephews-@InfobaeAmerica-Twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_13__1540927597.html","title":"U.S. Arrests of President's Nephews 'Not Confirmed'","title_page":"Venezuela TV: U.S. Arrests of President's Nephews 'Not Confirmed'","title_rss":"NULL","source_domain":"breitbart.com","text":"Venezuelan President Nicolás Maduro and high-ranking members of the socialist government there have remained mum regarding the arrest of two of Maduro’s nephews this week after attempting to sell cocaine to a DEA informant. On Venezuelan state TV, however, the arrests are treated as hearsay, “unconfirmed” rumors used to smear the head of state.\n“They are talking about allegations,” Tania Díaz, a socialist candidate for the National Assembly and second vice-president of the Venezuelan legislature, said on national television Thursday. “International agencies say the allegedly detained are the ones who supposedly said they were [Maduro’s] nephews.” She argued that international media had not covered the arrests and “The DEA has not ratified this information.”\nThe Southern District of New York had already made public the indictment against Efrain Antonio Campo Flores, 29, and Franqui Francisco Flores de Freitas, 30, by the time Díaz appeared on television that day. Flores and Flores de Freitas are nephews of First Lady Cilia Flores, who is currently also running for an Assembly seat. Flores identified himself as Maduro’s “stepson” and alleged that the First Lady had raised him upon his arrest.\nThe two are accused of working to “combine, conspire, confederate, and agree together and with each other to violate the narcotics laws of the United States” by trafficking 500 kilograms of cocaine out of Venezuela into New York, according to the indictment signed by U.S. Attorney Preet Bharara.\nOn Friday, Díaz made public statements yet again, this time blaming an international conspiracy for the arrests, but not denying that they occurred. “What a coincidence that the divulging of this alleged information occurs while President Maduro is in Saudi Arabia to fight, to battle for the price of oil that feeds all us Venezuelans,” she said, praising Maduro for “showing his face” at the United Nations Human Rights Council, where he is expected to speak this week.\nMaduro himself has not commented on the arrests, nor has his wife or any other high-ranking members of the government. Maduro did appear to allude to the arrests on Wednesday night on his Twitter account, condemning an unnamed “imperialist ambush” and warning that “the people” will “be able to overcome” and “have only one destiny… to win.”\nThe lack of coverage of the arrests, which are the latest in a string of accusations against people tied to the socialist government of being involved in the drug trade, has resulted in a large number of Venezuelans remaining in the dark about the indictment. Televisa, a Mexican television network, reports from Venezuela that many residents interviewed appeared to know nothing of what is being treated by the rest of the world as the biggest news in their country. “I had no idea! says 21-year-old Grecia Mayor, who adds with a lament, “it really doesn’t surprise me.” A 30-year-old man who asked not to be identified expressed outrage: “but I read all of the newspapers!”\nTelevisa notes that only one Venezuelan newspaper, El Nacional, published the story in print. Others opted only to do so online, where the rest of the world can have access to it but the Venezuelan people are far more likely to miss it.\nOnline, El Nacional ran an article with the title “Is Venezuela a Narco-State?”\nThe Flores nephews are far from the first suspected drug traffickers to be linked to Maduro. Maduro’s second-in-command, National Assembly President Diosdado Cabello, has been accused numerous times of being a drug lord. Leamsy Salazar, one-time security chief for late dictator Hugo Chávez, has signaled Cabello out as the boss of the Cartel de los Soles, one of Latin America’s biggest cocaine smuggling operations. The Cartel de los Soles gets its name from the sun pendant worn on Venezuelan military uniforms.\nCabello has denied the allegations, accusing Salazar of being a liar.","url":"https://www.breitbart.com/national-security/2015/11/13/venezuela-tv-u-s-arrests-of-presidents-nephews-not-confirmed-despite-indictment/"}
