{"authors":[],"date_download":"2018-10-22 22:43:17","date_modify":"2018-10-22 22:43:17","date_publish":"2014-06-10 21:04:43","description":"Eric Holder said that the refusal by the Boy Scouts of America to allow gay adults to be scout leaders \"perpetuates the worst kind of stereotypes.\"","filename":"data/vaneerConsumption/USAttorneyGeneralSlamsBoyScoutsOverGayScoutmasterBan.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/500466/140610-eric-holder-1658_fd55bbaece9b275be5b1a3bf741ebce4.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_u-s-attorney-general-slams-boy-scouts-over-gay-scoutmaster-n127746_1540248197.html","title":"U.S. Attorney General Slams Boy Scouts Over Gay Scoutmaster Ban","title_page":"U.S. Attorney General Slams Boy Scouts Over Gay Scoutmaster Ban","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAttorney General Eric Holder said Tuesday that the refusal by the Boy Scouts of America to allow gay adults to be scout leaders \"perpetuates the worst kind of stereotypes.\"\nIn remarks for delivery to a gay rights organization, Lambda Legal, Holder said with the repeal of the military's \"Don't Ask, Don't Tell\" policy, \"courageous lesbian, gay, and bisexual individuals routinely put their lives on the line\" in the armed services.\n\"If these men and women are fit for military service, then surely they are fit to mentor, to teach, and to serve as role models for the leaders of future generations.\"\nSign up for breaking news alerts from NBC News\nHolder said the Boy Scouts of America is \"an iconic American institution.\" But he said its policy is \"a relic of an age of prejudice and insufficient understanding.\"\nBoy Scouts of America President Robert Gates, who helped oversee the demise of \"Don't Ask, Don't Tell\" when he was secretary of defense, told the Scouts' annual meeting last month that while he personally favors a change, now is not the time to pursue it.\n\"I would have supported going further, as I did in opening the way for gays to serve in CIA and in the military.\" But, he said, re-opening the issue just a year after the organization agreed to admit gay children as scouts, \"would irreparably fracture and perhaps even provoke a permanent split in this movement.\"\nGates, who began a two-year term as Scouting's president in May, said he wants to devote his attention to local recruiting and fundraising.","url":"https://www.nbcnews.com/news/us-news/u-s-attorney-general-slams-boy-scouts-over-gay-scoutmaster-n127746"}
