{"authors":["Matthew Debord"],"date_download":"2018-10-30 21:17:31","date_modify":"2018-10-30 21:17:31","date_publish":"2016-12-21 00:00:00","description":"Even though some analysts think the market has plateaued and that there's no more growth to be had, the fundamentals point to continued strong sales.","filename":"data/vaneerConsumption/USautoindustrycouldseemoregrowthin2017.json","image_url":"https://amp.businessinsider.com/images/5799e6c84321f10d038bb794-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_us-auto-industry-growth-in-2017-2016-12_1540934251.html","title":"US auto industry could see more growth in 2017","title_page":"    US auto industry could see more growth in 2017 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Workers assemble a Ford truck. Bryan Woolston/Reuters As 2016 draws to a close, the US auto market is on the verge of setting a new sales record, beating last year's mark of 17.5 million new cars and trucks.\nAuto sales have been booming for several years, powered by a combination of cheap gas, easy credit, and pent-up demand. And with the unemployment rate now below 5%, there are plenty of Americans who now need a reliable, technologically up-to-date vehicle to get to and from work.\nEven though some analysts think the market has plateaued and that there's no more growth to be had, the fundamentals point to continued strong sales before a downturn — a downturn that at worst would probably only knock at most a million off the current pace.\nThat's the good news.\nThe bad news is that there's a clear structural shift occurring when it comes to consumer demand.\nThe mix is changing\nBusiness Insider For decades, sales have been composed on a mix of vehicles, primarily passenger cars and pickup trucks. For a brief period after the Toyota Prius was introduced and gained popularity in the early 2000s, hybrids came into the picture.\nBut the big shift arrived when the SUV appeared. Profits on these vehicles were so good that many automakers gave up on small cars, only to be caught in a bind when gas prices spiked after the financial crisis. Compromising the mix came back to haunt them.\nBut then they got smarter and starting building high-quality compact SUVs — often called \"crossover\" because they're constructed to drive more like cars than trucks and offer good fuel economy — and these vehicles have now become wildly popular.\nThey've effectively taken over the market, especially for entry-level vehicles. Meanwhile, a spate of new sedans and sports cars have struggled to find a buyership. This has occasioned abundant hand-wringing among market observers, with the latest round coming as the big three adjust their factory output to match demand.\nInventories on dealer lots have gotten too large for some vehicles, so the Detroit Big Three are idling factories to address the mismatch. Unfortunately, the excess numbers of small cars and sports cars has already led to accusations of \"channel stuffing,\" a practice whereby an automaker will load up dealers with vehicles in order to juke sales numbers (a car company can count a vehicle as sold once the dealer takes possession).\nA big debate\nCompact SUVs like the Ford Escape are in demand. Newspress\nOver 2017, there's going to be a furious debate in the industry about whether its worth it to go all-in on crossovers and SUV, risking the possibility that rising gas prices in the future could lead to a repeat of history. The hedge on this front is that smaller crossovers and SUVs now have greatly improved fuel economy. It seems that consumers just want more truck-like vehicles in the US, due to their versatility. Sedans have an aging customer base, and the heroic sports cars are falling into niche status.\nFor now, the industry is simply showing some welcome discipline. Detroit said it wasn't going to fall into the errors of the past, and now it decisively isn't. GM in particular has been careful to avoid dumping unwanted inventory into rental fleets.\nBut the industry isn't going to get a break. The whole notion of idled plants and laid-off workers makes for appealingly grim headlines, even if those plants will come back online when demand adjusts, or be retooled to build vehicles that customers want. The industry has, after all, been reluctant to add new capacity specifically because it's wary of sales running so hot for so long.\nThe business is cyclical, and the downturns always arrive.","url":"https://www.businessinsider.com/us-auto-industry-growth-in-2017-2016-12"}
