{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-23 02:26:00","date_modify":"2018-10-23 02:26:00","date_publish":"2016-01-28 17:12:51","description":"John Kerry issued the warnings to France, Germany, Belgium, Italy and Greece (pictured) after concerns were raised when it was revealed one of the Paris attackers used a fake passport.","filename":"data/vaneerConsumption/USAwarnsFranceGermanyandItalytoclampdowninfakepassporttrade.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30A90AD300000578-0-image-a-37_1454001161126.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421333_USA-warns-France-Germany-Italy-clamp-fake-passport-trade-sparked-migrtant-crisis-lose-visa-free-travel_1540261560.html","title":"USA warns France, Germany and Italy to clamp down in fake passport trade","title_page":"USA warns France, Germany and Italy to clamp down in fake passport trade | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Five European countries have been warned to clamp down on the fake passport trade or lose visa-free ESTA travel to America, sources say.\nUS Secretary of State John Kerry is said to have issued warnings to Germany, Belgium, France, Italy and Greece after two bombers from the Paris terrorist attacks were found to have stolen passports.\nIt comes as security officials from Homeland Security and Interpol saw a worrying rise in the number of stolen passports being reported.\nScroll down for video\nThe Italian Navy rescued 290 migrants off the coats of Italy earlier today in the Strait of Sicily. Thousands of migrants arrive by boat there every month\nRefugees rest inside a giant tent at a refugee camp in the northern Greek village of Idomeni at the Greek-Macedonian border earlier today\nRefugees and migrants arrive yesterday aboard the passenger ferry Nissos Rodos at the port of Piraeus, near Athens, Greece\nInterpol has data on 250,000 stolen Iraqi and Syrian passports, a problem which enables organised crime and terrorism, but is hard to address in areas where Isis has taken control of official buildings.\nA Mail Online investigation into buying passports revealed just how easy it was, when reporter Nick Fagge bought the official document for $2,000 and it was ready in just four days.\nJohn Kerry is said to be most worried about Greece and Italy, where thousands of migrants arrive by boat every month.\nHe is said to have given the five nations a deadline of February 1 to fix a 'crucial loophole', reports Politico, or lose access to the visa waiver, which is used by 20million people from 38 countries per year - most of them in Europe.\nJohn Kerry is said to be most worried about Greece and Italy, where thousands of migrants arrive by boat every month\nHomeland Security's Jen Johnson will report their progress to President Obama next week, it is believed.\nThe concerns were raised after the passport of 'Ahmad Almohammad' was found at the Paris Stade de France terror attack.\nFinger print analysis of the bomber's remains revealed the man, who had falsely declared himself to be a Syrian named Ahmad Almohammad, 25, had entered Greece as a refugee on October 3.\nHe was among 198 migrants who landed on the island of Leros after crossing the Aegean from Turkey on a raft.\nHe was processed as a refugee by the Greek authorities who interview more than 1,000 migrants and refugees a day to establish their real identities and nationalities.\nThey took his photograph and fingerprints before giving him a document that enabled him to buy a ferry ticket to leave the island for Athens.\nAlmohammad left EU state Greece a few days later. He crossed into Macedonia and into Serbia where he was registered at the Presevo border crossing on October 7.\nHe continued north and entered the EU again when he crossed into Croatia. He was registered at the Opatovac refugee camp on October 8, before eventually travelling to Paris to commit mass murder.\nThe two other suicide bombers who detonated themselves outside the French national stadium carried false Turkish passports, it has emerged.\nThe French interior minister Bernard Cazeneuve (pictured) made the claim as he argued for the creation of a special task force to travel to Greece to help clamp down on stolen or fake passports\nISIS has formed an entire 'industry' out of making fake passports seized from Iraq, Syria and Libya, according to officials in France (file picture)\nThis week, the French interior minister Bernard Cazeneuve claimed Isis has created an entire industry out of selling fake passports.\nHe made the claim as he argued for the creation of a special task force to travel to Greece to help clamp down on stolen or fake passports.\nAccording to the Wall Street Journal, Cazeneuve told reporters: 'Daesh has managed to seize passports in Iraq, Syria and Libya and to set up a true industry of fake passports.'\nHe said that they were difficult to detect because they are actually genuine documents, seized by Isis forces, along with official buildings.","url":"https://www.dailymail.co.uk/news/article-3421333/USA-warns-France-Germany-Italy-clamp-fake-passport-trade-sparked-migrtant-crisis-lose-visa-free-travel.html"}
