{"authors":["John J. Xenakis"],"date_download":"2018-10-30 19:35:46","date_modify":"2018-10-30 19:35:46","date_publish":"2017-02-20 14:40:05","description":"Bombing in Somalia kills 50, said to target Somali-American president; US aircraft carrier renews challenge to China in the South China Sea; US-backed Iraqi army launches major new offensive in western Mosul | National Security","filename":"data/vaneerConsumption/USBackedIraqiArmyLaunchesMajorOffensiveinWesternMosul.json","image_url":"https://media.breitbart.com/media/2017/01/iraqi-soldiers-eastern-mosul-liberation-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_02_20__1540928146.html","title":"U.S.-Backed Iraqi Army Launches Major Offensive in Western Mosul","title_page":"U.S.-Backed Iraqi Army Launches Major Offensive in Western Mosul","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nBombing in Somalia kills 50, said to target Somali-American president\nUS aircraft carrier renews challenge to China in the South China Sea\nUS-backed Iraqi army launches major new offensive in western Mosul\nBombing in Somalia kills 50, said to target Somali-American president\nAftermath of car bomb attack on market in Mogadishu Somalia on Sunday (Reuters)\nA terrorist car bomb exploded in a marketplace in Somalia’s capital city Mogadishu on Sunday, killing 39 and injuring dozens more.\nNo one has claimed responsibility, but the al-Qaeda linked terror group al-Shabaab has been responsible for numerous terrorist attacks in Somalia. Although al-Shabaab did not claim responsibility, a senior al-Shabaab official threatened more attacks targeting any clans that collaborate with the new president, saying “We will fight against him during his four-year term.”\nThe new president, who took office on February 8, is Mohamed Abdullahi Mohamed, nicknamed Farmajo. Farmajo holds a dual Somali-American citizenship. In 1988, as a Somali government employee working in the Somali embassy in Washington, he feared for his life after criticizing the Somali government, and applied for asylum in the U.S. Since then, he earned several college degrees and settled in Buffalo, NY, as a civil servant in the New York Department of Transportation.\nHis ambition was to return to Somalia and help bring peace to the violent country. After meeting with and impressing Somalia’s president in 2010, he became prime minister of Somalia. His fight against both al-Shabaab and corruption made him very popular in his home country. Five years later he ran for president, winning a surprise victory, and took office two weeks ago, on February 8.\nBeyond terror attacks, Farmajo will have to deal with many other severe problems facing Somalia. Somalia’s clans have been fighting in a civil war since 1991, and a severe drought puts the country at risk of famine.\nFarmajo’s popularity, his American dual citizenship, and his education in American values and governance apparently have made him a huge threat to al-Shabaab, and we can apparently expect more terror attacks targeting people and clans cooperating with Farmajo. AFP and VOA and Politico\nRelated Articles\nUS aircraft carrier renews challenge to China in the South China Sea\nIn a new challenge to China’s illegal construction of artificial islands and military bases in the South China Sea, the aircraft carrier USS Carl Vinson (CVN 70) and the Carl Vinson Strike Group entered the South China Sea on Sunday to perform “routine” freedom of navigation operations (FONOPs).\nAs in previous operations, the Carl Vinson will simply transit the South China Sea, establishing the right of all nations to do the same, and especially for commercial ships to do so freely. Chinese media claim, without providing a reason, that these freedom of navigation operations are a military threat to China.\nThese operations have been going on for years, but there is a question about whether there will be a change in policy under the administration of president Donald Trump. The issue is how close the Carl Vinson will navigate to China’s artificial islands and military bases. In the Obama administration, the American ships stayed at least 12 nautical miles from any of China’s artificial islands. There is some speculation that, in the Trump administration, the American ships will travel closer than 12 nautical miles. This would be fully justified under international law, since the artificial islands are illegal, but it would infuriate the Chinese, and possibly trigger some kind of military confrontation. VOA and Navy Times (12-Feb) and Global Times (Beijing)\nRelated Articles\nUS-backed Iraqi army launches major new offensive in western Mosul\nIraq’s army, backed by American-led coalition warplanes, launched a major new military offensive on Sunday with the objective of recapturing western Mosul from the so-called Islamic State (IS or ISIS or ISIL or Daesh).\nIraq had hoped to recapture the entire city by the end of 2016, but only recaptured the eastern portion last month.\nAnalysts are giving several reasons why recapturing western Mosul is going to proceed very slowly:\nThere are 750,000 civilians in western Mosul, and the Iraq army will receive a great deal of international criticism if civilians are not protected. The contrast is to the recapture of Aleppo in Syria by Syria’s army, where civilians, including women and children, were specifically targeted by both Syrian and Russian warplanes with barrel bombs containing chemical weapons.\nISIS has been preparing for this battle for months, and has built a network of tunnels, and has booby trapped buildings and roads with bombs in order to slow the advance of Iraqi forces.\nISIS has already been driven out of a number of Iraqi cities, and western Mosul is the last ISIS stronghold in Iraq. They are expected to fight ferociously to prevent recapture.\nHumanitarian agencies are gearing up to aid 250,000 to 400,000 civilians who may flee because of the fighting. AP\nRelated Articles\nKEYS: Generational Dynamics, Somalia, Mogadishu, al-Shabaab, Mohamed Abdullahi Mohamed, Farmajo, China, USS Carl Vinson, South China Sea, Iraq, Mosul\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2017/02/20/20-feb-17-world-view-us-backed-iraqi-army-launches-major-new-offensive-western-mosul/"}
