{"authors":[],"date_download":"2018-10-22 22:09:24","date_modify":"2018-10-22 22:09:24","date_publish":"2014-05-09 09:37:09","description":"U.S. envoy offers first public account of Secretary of State John Kerry's failed, nine-month effort to strike a peace deal by April 29.","filename":"data/vaneerConsumption/USBlamesIsraelisPalestiniansforFailedMideastTalks.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/431166/140509-israel-palestinian-7a_224fff8bf015bedecad1ab748e301336.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_mideast_u-s-blames-israelis-palestinians-failed-mideast-talks-n101136_1540246164.html","title":"U.S. Blames Israelis, Palestinians for Failed Mideast Talks","title_page":"U.S. Blames Israelis, Palestinians for Failed Mideast Talks","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIsraeli and Palestinian leaders were unwilling to make the \"gut-wrenching\" compromises needed for peace, a top U.S. official said on Thursday, faulting both sides for the collapse of talks last month.\nOffering his first public account of Secretary of State John Kerry's failed, nine-month effort to strike a peace deal by April 29, U.S. special envoy Martin Indyk made clear there was blame on both sides, citing Israeli settlement-building as well as the Palestinians' signing of 15 international conventions.\nHowever, Indyk suggested talks may resume eventually, citing the start-and-stop example of former U.S. Secretary of State Henry Kissinger's ultimately successful 1975 effort to disengage Egyptian and Israeli forces in the Sinai.\n\"What was true then is also possibly true today,\" Indyk told a conference hosted by the Washington Institute for Near East Policy think tank. \"In the Middle East, it's never over.\"\nThe central issues to be resolved in the more than six-decade Israeli-Palestinian conflict include borders, security, the fate of Palestinian refugees and the status of Jerusalem.\n\"One problem that revealed itself in these past nine months is that the parties, although showing some flexibility in the negotiations, do not feel the pressing need to make the gut-wrenching compromises necessary to achieve peace,\" Indyk said.\n\"It is easier for the Palestinians to sign conventions and appeal to international bodies in their supposed pursuit of justice and their rights, a process which by definition requires no compromise,\" he said. \"It is easier for Israeli politicians to avoid tension in the governing coalition and for the Israeli people to maintain the current, comfortable status quo.\"\n\"The fact is, both the Israelis and Palestinians missed opportunities and took steps that undermined the process,\" Indyk said.\n-Reuters","url":"https://www.nbcnews.com/news/mideast/u-s-blames-israelis-palestinians-failed-mideast-talks-n101136"}
