{"authors":["The Associated Press"],"date_download":"2018-10-30 21:25:12","date_modify":"2018-10-30 21:25:12","date_publish":"2017-04-06 00:00:00","description":"WASHINGTON — The United States fired a barrage of cruise missiles into Syria Thursday night in retaliation for this week's gruesome chemical weapons attack against civilians, U.S. officials said. It was the first direct American assault on the Syrian government and Donald Trump's most dramatic military order since becoming president.","filename":"data/vaneerConsumption/USblastsSyriabasewithcruisemissiles.json","image_url":"https://media.arkansasonline.com/img/photos/2017/04/06/AP17097039876449_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_apr_06_us-blasts-syria-base-cruise-missiles__page=5_1540934712.html","title":"U.S. blasts Syria base with cruise missiles","title_page":"U.S. blasts Syria base with cruise missiles","title_rss":"NULL","source_domain":"arkansasonline.com","text":"In this photo provided by the U.S. Navy, the Arleigh Burke-class guided-missile destroyer USS Ross (DDG 71) departs Rota, Spain, on March 29, 2017. The United States fired a barrage of cruise missiles into Syria Thursday night in retaliation for this week’s gruesome chemical weapons attack against civilians, the first direct American assault on the Syrian government and Donald Trump’s most dramatic military order since becoming president. The Tomahawk missiles were fired from warships USS Porter and USS Ross in the Mediterranean Sea. (Mass Communication Specialist 3rd Class Robert S. Price/U.S. Navy via AP)\nWASHINGTON — The United States fired a barrage of cruise missiles into Syria Thursday night in retaliation for this week's gruesome chemical weapons attack against civilians, U.S. officials said. It was the first direct American assault on the Syrian government and Donald Trump's most dramatic military order since becoming president.\nThe strikes hit the government-controlled Shayrat air base in central Syria, where U.S. officials say the Syrian military planes that dropped the chemicals had taken off. The U.S. missiles hit at 8:45 p.m. in Washington, early morning Friday in Syria.\nThe surprise U.S. assault marked a striking reversal for Trump, who warned as a candidate against the U.S. getting pulled into the Syrian civil war, now in its seventh year. But the president appeared moved by the photos of children killed in the chemical attack, calling it a \"disgrace to humanity\" that crossed \"a lot of lines.\"\nAbout 60 U.S. Tomahawk missiles, fired from warships in the Mediterranean Sea, targeted an air base in retaliation for a chemical weapons attack that American officials believe Syrian government aircraft launched with a nerve agent, possibly sarin.\nThe president did not announce the attacks in advance, though he and other national security officials ratcheted up their warnings to the Syrian government throughout the day Thursday.\n\"I think what happened in Syria is one of the truly egregious crimes and shouldn't have happened and it shouldn't be allowed to happen,\" Trump told reporters traveling on Air Force One to Florida, where he was holding a two-day summit with Chinese President Xi Jinping.\nThe strike came as Trump was hosting Xi in meetings focused in part on another pressing U.S. security dilemma: North Korea's nuclear program. Trump's actions in Syria could signal to China that the new president isn't afraid of unilateral military steps — even if key nations like China are standing in the way.\nTrump has advocated greater counterterrorism cooperation with Russia, Assad's most powerful military backer. Just last week, the Trump administration signaled the U.S. was no longer interested in trying to push Assad from power over his direction of a conflict that has killed hundreds of thousands of people and led to the worst refugee crisis since World War II.\nRussian military personnel and aircraft are embedded with Syria's, and Iranian troops and paramilitary forces are also on the ground helping Assad fight the array of opposition groups hoping to topple him.\nBefore the strikes, U.S. military officials said they informed their Russian counterparts of the impending attack. The goal was to avoid any accident involving Russian forces.\nNevertheless, Russia's Deputy U.N. ambassador Vladimir Safronkov warned that any negative consequences from the strikes would be on the \"shoulders of those who initiated such a doubtful and tragic enterprise.\"\nTrump's decision to attack Syria came three-and-a-half years after President Barack Obama threatened Assad with military action after an earlier chemical weapons attack killed hundreds outside of Damascus. Obama had declared the use of such weapons a \"red line.\" At the time, several American ships in the Mediterranean were poised to launch missiles, only for Obama to abruptly pull back after key U.S. ally Britain and the U.S. Congress balked at his plan.\nHe opted instead for a Russian-backed plan that was supposed to remove and eliminate Syria's chemical weapons stockpiles.\nThursday night's strikes were launched from the USS Ross and USS Porter.\nThe world learned of the chemical attack earlier in the week in footage that showed people dying in the streets and bodies of children stacked in piles. The international outcry fueled an emotional response from Trump, who appeared to abandon his much-touted \"America First\" vision for a stance of humanitarian intervention, akin to that of previous American leaders. \"I think what happened in Syria is a disgrace to humanity,\" he said Thursday.\nTrump seemed to rapidly reconsider his feelings about Assad, saying: \"He's there and I guess he's running things, so something should happen.\"\nRead Friday's Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2017/apr/06/us-blasts-syria-base-cruise-missiles/?page=5"}
