{"authors":["Edwin Mora"],"date_download":"2018-10-30 19:46:48","date_modify":"2018-10-30 19:46:48","date_publish":"2015-03-04 05:59:02","description":"Lloyd Austin, the top commander of U.S. military efforts against ISIS, told a congressional panel that Iran poses a threat to the region.","filename":"data/vaneerConsumption/USCentcomChiefIranRepresentstheMostSignificantThreat.json","image_url":"https://media.breitbart.com/media/2015/03/general-lloyd-austin-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_03__1540928808.html","title":"U.S. Centcom Chief: 'Iran Represents the Most Significant Threat’","title_page":"U.S. Centcom Chief: 'Iran Represents the Most Significant Threat’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON—Gen. Lloyd Austin, the top commander of U.S. military efforts against the Islamic State in Iraq and Syria (ISIS), told a congressional panel that Iran poses the “most” serious threat to the region he oversees.\n“Iran represents the most significant threat to the Central Region… Iran continues to pursue policies that threaten U.S. strategic interests and goals throughout the Middle East,” declared Gen. Austin in written testimony prepared for a March 3 hearing held by the House Armed Services Committee.\n“Chronic instability, disenfranchised populations, and weak regional governments provide new footholds for a resilient and expanding global jihadist movement and an ideal environment for Iran and its allies to aggressively undermine U.S. regional goals,” later added Gen. Austin, who serves as the commander of U.S. Central Command (Centcom).\nCentcom’s area of responsibility (AOR) known as the “Central Region” covers at least 18 countries in the Middle East, North Africa, and Central Asia, including Iraq and Afghanistan.\nGen. Austin acknowledged that Iranian-backed militant forces have been engaged in Iraq and Syria.\nThe “most concerning” aspect of the Iranian threat is that the Shiite majority nation uses the Islamic Revolutionary Guards Corps-Qods Force, Iran’s Ministry of Intelligence and Security, and “proxy actors” such as the Lebanese terror group Hezbollah and the Palestinian terror group Hamas to “engage in malign activity,” he said.\nHe pointed out that Iran has fomented unrest in Syria and Iraq where a U.S.-led coalition is combating ISIS. Iran is reportedly helping Kurdish and Shiite militias in their fight against ISIS in Iraq.\n“During the past year, [Iran] primarily focused on Sunni groups in the Iraq and Syria-based conflict (including the moderate opposition in Syria) by bolstering the Syrian and Iraqi governments and overseeing engagements involving its own militant forces. Iran also maintains the ability to expand the scope of its activities,” explained Gen. Austin. “This is troubling as Iranian malign influence is enflaming sectarian tensions that are all too often exploited by violent extremist elements in the region.”\nGen. Austin testified before the House panel on the same day that Israeli Prime Minister Benjamin Netanyahu delivered an address to Congress against Iran’s nuclear program, warning that Iran will always be a threat to the United States.\n“When it comes to Iran and ISIS, the enemy of your enemy is your enemy,” Netanyahu told U.S. lawmakers.\nDespite the outcome of the nuclear talks the United States and five other countries (P5+1) are having with Iran, the U.S.-Iran relationship will remain challenging, according to Gen. Austin.\n“Our diplomats are working diligently to negotiate an acceptable agreement with respect to Iran’s nuclear program, and we hope that they will be successful,” the general told lawmakers. “But, regardless of the outcome of the P5+1 discussions, our relationship with Iran will remain a challenging one, as we are very concerned by their unhelpful behavior in a number of areas.”\n“One of the key opportunities that exist with respect to Iran is the prospect of an acceptable agreement regarding Iran’s nuclear program,” he later explained. “If the P5+1 are able to reach a long-term resolution, that would represent a step in the right direction and may present an unprecedented opportunity for positive change in the Central Region.”\nObama wants Iran to verifiably freeze its nuclear program for at least 10 years, a deal that Netanyahu and members of the president’s own party find unacceptable.\n“While we remain hopeful that the two sides will eventually reach an acceptable deal, it is presently unclear how things will play out,” testified Gen. Austin. “We have to be prepared for what comes next. We will be prepared.”\n“In addition to its nuclear program, Iran has a significant cyber capability, as well as the largest and most diverse ballistic missile arsenal in the Middle East… Iran is able to strike targets throughout the region with increasing precision using creatively adapted foreign technologies to improve its missile arsenal,” he warned. “It also has increased its anti-access area- denial air defense capabilities. Iran is improving its counter-maritime capabilities (e.g., mines, small boats, cruise missiles, submarines), which serve to threaten the flow of global commerce in the Strait of Hormuz.”\nIran is considered a state-sponsor of terror by the United States.","url":"https://www.breitbart.com/national-security/2015/03/03/u-s-centcom-chief-iran-represents-the-most-significant-threat/"}
