{"authors":["Associated Press"],"date_download":"2018-10-23 01:39:41","date_modify":"2018-10-23 01:39:41","date_publish":"2016-01-11 12:42:37","description":"A man identified as Kim Dong Chul, 62, was being held by the Pyongyang government, accused of stealing state secrets and smuggling them to authorities in South Korea.","filename":"data/vaneerConsumption/UScitizenKimDongChuldetainedbyNorthKoreangovernmentforspying.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300AA7D900000578-0-image-a-6_1452521790378.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393847_CNN-reports-American-detained-North-Korean-government_1540258781.html","title":"US citizen Kim Dong Chul 'detained by North Korean government' for spying","title_page":"US citizen Kim Dong Chul 'detained by North Korean government' for spying | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The government of North Korea has detained a U.S. citizen on suspicion of spying, CNN reported Monday.\nA man identified as 62-year-old Kim Dong Chul was being held by the Pyongyang government, accused of stealing state secrets and smuggling them to authorities in South Korea.\nBorn in South Korea, he gained US citizenship in 1987 and lived in Fairfax, Virginia, until 1997 when he moved to China and set up a business in Pyongyang.\nA man identified as Kim Dong Chul, 62, (pictured) was being held by the Pyongyang government, accused of stealing state secrets and smuggling them to authorities in South Korea, according to his CNN interview\nTwo years ago, he told a CNN correspondent, Kim was recruited by a government official and university professors in South Korea to gather state secrets that could be used against Kim Jong Un.\nKim claims he would bribe a local resident - a 35-year-old soldier - to gather military secrets and 'materials' that he would then drive to his employers in China or South Korea.\nHe was arrested in October 2015 as he tried to meet a contact to pick up a USB stick, CNN reported.\nDuring the two years he made $5,300 (35,000 yuan), the station said.\nIn Washington, a State Department official refused to confirm the story.\nHis employers allegedly wanted to obtain evidence to orchestrate a coup to overthrow Kim Jong Un\n'Speaking publicly about specific purported cases of detained Americans can complicate our tireless efforts to secure their freedom,' a State Department official said.\nThe official spoke only on grounds of anonymity because of the sensitivity of the situation.\nCNN also displayed Kim's US passport.","url":"https://www.dailymail.co.uk/news/article-3393847/CNN-reports-American-detained-North-Korean-government.html"}
