{"authors":["Associated Press"],"date_download":"2018-10-23 04:13:48","date_modify":"2018-10-23 04:13:48","date_publish":"2017-04-26 15:56:15","description":"MONTPELIER, Vt. (AP) - Fearing a return to violent protests that roiled campuses in the 1970s, colleges and universities are re-examining how to protect free...","filename":"data/vaneerConsumption/UScollegesconfrontaneweraofsometimesviolentprotest.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/20/wire-467647-1493236262-176_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448178_US-colleges-confront-new-era-violent-protest_1540268028.html","title":"US colleges confront a new era of sometimes-violent protest","title_page":"US colleges confront a new era of sometimes-violent protest | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MONTPELIER, Vt. (AP) - Fearing a return to violent protests that roiled campuses in the 1970s, colleges and universities are re-examining how to protect free speech while keeping students and employees safe in a time of political polarization.\nCampus police are trying new tactics to try to keep events peaceful, while other schools have abruptly canceled controversial speakers over safety concerns, as the University of California, Berkeley, did with conservative writer Ann Coulter's appearance, originally scheduled for Thursday.\nIn response to earlier rioting at Berkeley, the International Association of Campus Law Enforcement Administrators last month put on daylong protest preparation and response training sessions at Chapman University in Orange, California, the University of Notre Dame in Indiana and the University of Maryland, attended by law enforcement from about 40 colleges and universities. Another training session will take place Thursday at the University of Hartford in Connecticut.\nFILE - In this March 2, 2017, file photo, Middlebury College students turn their backs to author Charles Murray during his lecture in Middlebury, Vt. After a series of protests around the country, some institutions are rethinking their security and tactics in an age of growing political polarization. (AP Photo/Lisa Rathke, File)\n\"Our mission is basically to protect the university's mission, which is to have civil debate and present both sides of an issue and have things be done in a way that's civil,\" said the association's president, Randy Burba, police chief at Chapman. \"It's a challenge to make that happen when there's really opposing sides and views, but that's really what we're supposed to do.\"\nBurba declined to offer specifics about the training, to avoid disclosing proprietary police tactics.\nBut, he said, the sessions were a chance to remind campus police of best practices: to know and be engaged with the college community, do research on speakers, look at what's happened at other campuses, and meet with the leaders of protest groups ahead of time to talk about their plans and the college rules.\nAt Vermont's Middlebury College last month, protesters shouted down guest speaker Charles Murray, a social scientist who critics say used pseudoscience to link intelligence to race in the 1994 book \"The Bell Curve.\" Afterward, protesters surrounded Murray and professor Allison Stanger, with a protester pulling Stanger's hair, police said.\nThe protesters also climbed onto the car carrying Stanger and Murray and rocked it. Stanger, who was treated for a neck injury and a concussion, said she feared for her life.\nMiddlebury said last week that 70 people may be subject to discipline, and that more than 30 students so far had been punished, but officials did not elaborate.\nStanger wrote an editorial about her experience, saying the country's \"constitutional democracy will depend on whether Americans can relearn how to engage civilly with one another, something that is admittedly hard to do with a bullying president as a role model. But any other way forward would be antithetical to the very ideals of the university and of liberal democracy.\"\nBertram Johnson, chairman of the political science department that co-sponsored the event, last week wrote in the college newspaper that it was a mistake for him to offer a co-sponsorship without wider consultation.\nComplicating efforts to keep the peace is that protesters and event sponsors sometimes aren't connected to the schools hosting them.\nAuburn University last week cited safety concerns in canceling an appearance by white nationalist Richard Spencer, arranged by an outside organization, but a federal judge prevented the school from doing so. Three people were arrested for disorderly conduct.\nTexas A&M University has begun requiring that speakers be sponsored by a student, faculty or staff organization after a former student arranged a speech by Spencer in December.\nThe school held a simultaneous counter-event in the stadium called Aggies United, with speakers and musical acts, instead of a potential confrontation at the building where the speech was held, spokeswoman Amy Smith said.\nBerkeley's cancellation of Coulter's appearance came days after violent clashes at a rally in support of President Donald Trump off campus, in downtown Berkeley. Students who invited her have sued the university, saying it is violating their right to free speech.\nCoulter has said she might come to Berkeley on Thursday anyway. The university says it's bracing for possible violence whether she shows up or not.\nProtests on the Berkeley campus that stopped a speech of right-wing commentator Milo Yiannopoulos on Feb. 1 resulted in injuries to six people and three arrests. Prosecutors have declined to press charges in two of those cases, the school said.\nAbout 20 more people, including seven students, were possibly involved, school spokesman Dan Mogulof said. More arrests are possible.\nBerkeley student Gabriel Davtyan, who was at the Yiannopoulos protest, said he's all for police trying to keep the community safe and thinks they do as much as they can, confronting groups not affiliated with the university wreaking damage while also protecting individual free speech.\n\"I think Berkeley as an institution, their No. 1 priority is to make sure their students and whoever is giving these speeches are safe. Unfortunately, obviously, that gets difficult because you have sort of these outside groups that come in and ... they don't care about destroying property or anything like that,\" he said.\nFights also broke out in February at New York University when far-right men's club founder Gavin McInnes appeared at the school, leading to 11 arrests. No students were arrested. The school had earlier canceled an appearance by Yiannopoulos in November out of safety concerns, while Florida Atlantic University postponed his appearance in September because of threats of violence.\n____\nAssociated Press writer Cory Dawson contributed to this report.\nFILE - In this Feb. 1, 2017, file photo, University of California, Berkeley police guard the building where Breitbart News editor Milo Yiannopoulos was to speak in Berkeley, Calif. UC Berkeley police took a hands-off approach to protesters on the campus when violent rioters overtook a largely peaceful protest against a controversial speaker. After a series of protests around the country, some institutions are rethinking their security and tactics in an age of growing political polarization. (AP Photo/Ben Margot, File)","url":"https://www.dailymail.co.uk/wires/ap/article-4448178/US-colleges-confront-new-era-violent-protest.html"}
