{"authors":[],"date_download":"2018-10-23 04:35:57","date_modify":"2018-10-23 04:35:57","date_publish":"2016-01-11 17:46:48","description":"One of the largest US coal miners, Arch Coal, filed for bankruptcy protection Monday, succumbing to the competitive pressure of cheap natural gas from fracki...","filename":"data/vaneerConsumption/UScoalminerArchfilesforbankruptcyhitbycheapgas.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-70180-48qEJGFphM8d437f0aaf9278ec24-562_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394312_US-coal-miner-Arch-files-bankruptcy-hit-cheap-gas_1540269357.html","title":"US coal miner Arch files for bankruptcy, hit by cheap gas","title_page":"US coal miner Arch files for bankruptcy, hit by cheap gas | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US coal miner Arch files for bankruptcy, hit by cheap gas\nOne of the largest US coal miners, Arch Coal, filed for bankruptcy protection Monday, succumbing to the competitive pressure of cheap natural gas from fracking operations.\nRanked the second-largest coal miner after Peabody Energy, the St. Louis, Missouri-based Arch said it had reach an agreement with lenders to cut more than $4.5 billion in debt from its balance sheet to help stabilize its finances.\nArch said it \"expects its mining operations and customer shipments to continue uninterrupted\" as the reorganization under Chapter 11 of the bankruptcy code proceeds.\nA tractor trailer delivers a truckload of coal to Arch Coal Terminals June 3, 2014 in Cattletsburg, Kentucky ©Luke Sharrett (Getty/AFP/File)\nArch is the largest of some two dozen US coal companies to seek bankruptcy protection or to shut down in the past few years as cheap natural gas has pushed power companies to switch to the cleaner fuel.\nGas prices have sunk due to high output from shale-based reserves and the collapse of oil prices globally.\nArch sold 134 million tons of coal in 2014, mainly to customers in the power and steel industries, for revenues of $2.9 billion, but reported a net loss of $558 million, the third year in a row of steep losses.\nThe company has about $5 billion in long-term debt as well as obligations in mine leases and royalty payments.\nArch's share price has plunged from more than $300 in 2011 to 82 cents last Friday. It sank to 41 cents on Monday before the New York Stock Exchange suspended trading and said Arch shares would be delisted.\nThe company said Monday it has the cash reserves to continue mining operations. Arch has more than five billion tonnes of metallurgical and thermal coal reserves, mostly in the mid-Appalachian mountain zone of the eastern United States and in Colorado and Wyoming in the West.\n\"Today's announcement represents another significant step in our ongoing efforts to position the company for long-term success,\" said chairman and chief executive John Eaves in a statement.","url":"https://www.dailymail.co.uk/wires/afp/article-3394312/US-coal-miner-Arch-files-bankruptcy-hit-cheap-gas.html"}
