{"authors":["David Choi"],"date_download":"2018-10-30 23:59:30","date_modify":"2018-10-30 23:59:30","date_publish":"2018-07-12 00:00:00","description":"The US federal ethics agency criticized Commerce Secretary Wilbur Ross's asset reporting.","filename":"data/vaneerConsumption/USCommerceSecretaryWilburRosssayshellsellallhisequities.json","image_url":"https://amp.businessinsider.com/images/5b47faa450d5fd25008b48cb-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wilbur-ross-sells-equities-commerce-secretary-2018-7_1540943970.html","title":"US Commerce Secretary Wilbur Ross says he'll sell all his equities","title_page":"    US Commerce Secretary Wilbur Ross says he'll sell all his equities - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Commerce Secretary Wilbur Ross testifies at his confirmation hearing, January 18, 2017. Joe Raedle/Getty Images\nUS Commerce Secretary Wilbur Ross said he would sell all of his remaining equity holdings and buy US Treasuries after receiving a letter on Thursday from the federal ethics agency criticizing his asset reporting.\n\"To maintain the public trust, I have directed that all of my equity holdings be sold and the proceeds placed in US Treasury securities,\" Ross said in a statement.\nA letter from the US Office of Government Ethics (OGE) sent to Ross said an investigation by an ethics official at the Commerce Department found no indication of a violation of primary conflict of interest law.\n\"However, your failure to divest created the potential for a serious criminal violation on your part and undermined public confidence,\" the letter said.\nThe OGE noted \"various omissions and inaccurate statements\" in disclosure and compliance documents submitted in the past year.\nIt said the billionaire investor had reported two sales of Invesco stock in 2017 after the date by which he had agreed to divest his holdings.\n\"You also opened new short positions on various holdings that you committed to divesting in your Ethics Agreement, in contravention of that agreement,\" the OGE letter said.\nRoss's holdings were under scrutiny when in June, he was reported to have shorted a shipping firm's stock days after The New York Times emailed him some questions about his investments and the firm's links to Russia.\nAt one point, Russian President Vladimir Putin's son-in-law Kirill Shamalov reportedly owned as much as 20% in the firm, Navigator Holdings.\nRoss's sale was worth between $100,000 and $250,000, according to The New York Times.\nRoss denied the exchange was a result of insider trading.\n\"I did not receive any nonpublic information due to my government position, nor did I receive any nonpublic information from a government employee,\" Ross said in a statement, according to The Associated Press. \"Securities laws presume that information known to or provided by a news organization is by definition public information.\"\n(Reporting by Eric Walsh; Editing by Toni Reinhold)","url":"https://www.businessinsider.com/wilbur-ross-sells-equities-commerce-secretary-2018-7"}
