{"authors":[],"date_download":"2018-10-23 00:52:03","date_modify":"2018-10-23 00:52:03","date_publish":"2016-02-04 00:00:00","description":"The USDA says it will prevent 50,000 cases of illness each year. Skeptics say the agency needs to take a different approach to the salmonella problem because the current one has not worked very well.","filename":"data/vaneerConsumption/USDAImposesStricterLimitOnSalmonellaBacteriaInPoultryProducts.json","image_url":"https://media.npr.org/assets/img/2016/02/04/grilledchicken_wide-13f896b9acef157598a465b911168fcf127741c7.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=465530128_1540255923.html","title":"USDA Imposes Stricter Limit On Salmonella Bacteria In Poultry Products","title_page":"USDA Imposes Stricter Limit On Salmonella Bacteria In Poultry Products : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"RENEE MONTAGNE, HOST:\nOne of the most common ways Americans can get sick from salmonella bacteria is by eating chicken. Hundreds of thousands of Americans fall ill every year. This morning, the U.S. Department of Agriculture is announcing new rules. As NPR's Dan Charles reports, there's still a lot of uncertainty about how well the USDA's new approach will work.\nDAN CHARLES, BYLINE: It's really hard to get rid of all salmonella in poultry. Even when companies wash chicken carcasses after slaughter, the USDA has found the bacteria on about a quarter of all cut-up chicken parts heading to supermarket shelves. Under the USDA's new standard, fewer than 15 percent of chicken parts are supposed to be contaminated with salmonella. Alfred Almanza the USDA's top food safety official says after a year of testing, the USDA will start posting results online so consumers can see exactly which companies are being naughty or nice.\nALFRED ALMANZA: Which is not a good thing for them if they're failing. So those are pretty significant deterrents - or incentives for them to meet or exceed our standard.\nCHARLES: The USDA says when companies meet this new standard, 50,000 fewer people will get sick from salmonella each year. But there's a lot of guesswork in that population, and William James is not convinced it's true. He used to be a food safety official at the USDA. He's now a consultant for industry. James says, in recent years, after the USDA put in place an earlier version of this standard, the amount of salmonella on poultry did go down, but the rates of illness in the population did not drop. The problem, he says, is that the USDA standards treat all salmonella alike. But there are more than 2,000 different genetic strains of salmonella, and most of them don't make people sick. In fact, the ones that don't make you sick probably help you by crowding out the other salmonella strains that are dangerous. James wants poultry companies to take a more accurate aim at their problem.\nWILLIAM JAMES: The key here is probably still to focus on those few types that are causing illness and get serious about trying to eliminate those.\nCHARLES: He says poultry companies should be testing their chicken houses for those specific types of bacteria, like one strain called Salmonella Heidelberg. When those bacteria show up, those chickens should be slaughtered separately. The buildings should be decontaminated. The USDA's Alfred Almanza says it's true. Having a standard based on salmonella, generally, is imprecise, but he thinks it still will help uncover food safety problems.\nALMANZA: If you have a high level of salmonella, you are going to have some that are of significance to public health.\nCHARLES: And the new standards, he says, and posting testing results online will force companies to do more to make sure their products don't make people sick. Dan Charles, NPR News.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=465530128"}
