{"authors":["Breitbart London"],"date_download":"2018-10-30 18:59:49","date_modify":"2018-10-30 18:59:49","date_publish":"2018-07-17 16:36:12","description":"LONDON (AP) — U.S.-based defense contractor Raytheon says it remains committed to its operations in Britain, even as other manufacturers warn that they may curtail investment because of delays in negotiations over the country’s departure from the European Union. | London / Europe","filename":"data/vaneerConsumption/USDefenceGiantRaytheonCommittedtoBrexitBritain.json","image_url":"https://media.breitbart.com/media/2018/07/Screen-Shot-2018-07-17-at-17.32.16.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_17__1540925989.html","title":"U.S. Defence Giant Raytheon Committed to Brexit Britain","title_page":"U.S. Defence Giant Raytheon Committed to Brexit Britain | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"LONDON (AP) — U.S.-based defense contractor Raytheon says it remains committed to its operations in Britain, even as other manufacturers warn that they may curtail investment because of delays in negotiations over the country’s departure from the European Union.\nRaytheon, whose roots in Britain go back more than 100 years, sees opportunities to expand its U.K. business, regardless of Brexit, said John Harris, chief executive of the company’s international unit. Several other major firms, including Airbus and Jaguar Land Rover, have warned that the lack of certainty over Britain’s future relationship with the EU could force them to leave, taking tens of thousands of jobs with them.\n“We don’t see any material negative impact with Brexit,” Harris told The Associated Press. “We haven’t since the vote was held a few years ago.”\nHarris spoke Tuesday on the sidelines of the Farnborough International Airshow, a biannual trade show where billions of dollars of planes and parts are bought and sold. Analysts have suggested this year’s event will be a blockbuster, amid growing demand for air travel and increased defense spending.\nOn the first day alone, some $46.4 billion in deals were announced.\nRaytheon U.K. employs more than 1,600 people who work on projects ranging from precision missiles to cybersecurity and intelligence.\nThe company has long-term relationships with customers and suppliers in Europe and sees its presence in Britain as a “long play,” not a short-term investment, Harris said.\nFarage Slams ‘Political Project’ Airbus for Pushing Project Fear https://t.co/pUP2026ynz — Breitbart London (@BreitbartLondon) June 22, 2018\n“We’re not policy makers,” he said when asked about Brexit. “Our job is to understand the rules and to act accordingly.”\nDefense firms will be insulated from most of the incremental twists and turns of the Brexit process because their contracts are with governments who bear the cost of delays because they need their products for defense and security, Richard Aboulafiah, the respected aviation analyst at Teal Group.\nBut that doesn’t mean Brexit won’t have consequences.\n“Everyone is affected,” he said. “No one is completely immune. They’re just a lot more immune than others.”","url":"https://www.breitbart.com/europe/2018/07/17/u-s-defence-giant-raytheon-committed-to-brexit-britain/"}
