{"authors":["Associated Press"],"date_download":"2018-10-22 21:55:42","date_modify":"2018-10-22 21:55:42","date_publish":"2016-01-29 08:27:03","description":"WASHINGTON (AP) — The U.S. economy likely slowed significantly in the final three months of 2015 — and the picture seems to have grown gloomier in the first ...","filename":"data/vaneerConsumption/USeconomylikelyslowedsharplyinOctoberDecemberquarter.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:0f023515ffad4b79862aa1bad8f3d6d4-3bmscybNe842cce83474b5293a21-411_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422324_US-economy-likely-slowed-sharply-October-December-quarter_1540245342.html","title":"US economy likely slowed sharply in October-December quarter","title_page":"US economy likely slowed sharply in October-December quarter | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US economy likely slowed sharply in October-December quarter\nWASHINGTON (AP) — The U.S. economy likely slowed significantly in the final three months of 2015 — and the picture seems to have grown gloomier in the first few weeks of 2016.\nSinking oil and stock prices and weakness in China and other emerging markets have raised worries about their impact on the U.S. economy. The Federal Reserve noted that concern this week with a cautious assessment of the economy.\nOn Friday, the government is expected to estimate that the U.S. economy grew at a minuscule 0.9 percent annual rate in the October-December quarter, according to economists surveyed by data firm FactSet. It would be less than half the growth rate of the previous quarter.\nFILE - In this Tuesday, Jan. 26, 2016, file photo, Jeff Cuvelier, Jorgensen Forge master machinist, left, talks with Gov. Jay Inslee, center, on a tour of the plant in Seattle. On Friday, Jan. 29, 2016, the Commerce Department issues the first of three estimates of how the U.S. economy performed in the October-December quarter. (AP Photo/Elaine Thompson, File)\nA key reason was likely a broad effort by businesses last quarter to reduce their overhang of unsold goods. Another factor is expected to be a widening trade deficit: Further strength in the dollar has made American-made goods more expensive and thus less competitive overseas. In addition, economic troubles in regions from Europe to China have depressed U.S. exports.\nIt will be the government's first of three estimates of economic growth for the fourth quarter.\nDespite the fears that have gripped investors early in the year, economists predict that growth will strengthen in the January-March quarter to an annual rate of around 2 percent. The boost is likely to come mainly from consumer spending, which typically fuels about two-thirds of economic activity. Continued solid job growth is expected to embolden consumers to spend more.\nStill, that forecast assumes that severe winter weather won't depress first-quarter activity as it did the past two years.\nThe Fed left interest rates unchanged on Wednesday after having raised its benchmark short-term rate in December from record lows. Many analysts think that economic weakness, subpar inflation and global pressures will cause the Fed to slow its pace of rate hikes this year from what had been expected to be four increases to perhaps only two.\nFor all of 2015, economists have estimated that the economy grew around 2.3 percent, about equal to the 2.4 percent growth for 2014. That would continue the economy's pattern of subpar growth since the Great Recession officially ended in June 2009.\nFor 2016, economists are forecasting another year of modest growth of around 2 percent. At the same time they have nudged up the prospects for a recession this year. While still low, the likelihood is now put at around 20 percent, though most analysts still see an outright recession as unlikely.\n\"I think the fear of a global recession coming out of a slowdown in China is not going to be born out,\" said David Jones, chief economist at DMJ Advisors. \"I think a cautious consumer and cautious business attitudes will keep us growing slowly in the first half of the year, but we will pick up strength in the second half of the year.\"\nMany economists expect the strength in the domestic economy to offset weakness in export sales and in the U.S. energy sector, which has been slashing investment in response to the plunge in energy prices.\nWhile economic growth was lackluster last year, hiring was not. The economy added an average of 284,000 jobs a month in the final quarter of last year. The unemployment rate ended the year at a low 5 percent.\nMark Zandi, chief economist at Moody's Analytics, said he expects strong job growth to keep lowering unemployment and to help boost wages, which have lagged in this recovery. He said the extra consumer spending, which will be aided by lower gas prices, will support economic growth of around 2.5 percent in 2015.\nGrowth at that level is above the economy's potential right now, which many analysts put at around 2 percent, reflecting a slower pace of people entering the job market and slower productivity growth.\nThough the Fed didn't rule out a rate hike at its next meeting in March, Brian Bethune, an economics professor at Tufts University, said he believed the fact that the economy slowed in the final months of 2015 and faces more headwinds this year will be noted by the central bank.","url":"https://www.dailymail.co.uk/wires/ap/article-3422324/US-economy-likely-slowed-sharply-October-December-quarter.html"}
