{"authors":[],"date_download":"2018-10-23 03:11:14","date_modify":"2018-10-23 03:11:14","date_publish":"2016-01-29 17:55:26","description":"The US economy sputtered at the end of 2015, with the impact of slower global growth and turmoil across markets spilling over into US business investment and consumer spending.","filename":"data/vaneerConsumption/USeconomygrindstoanearhaltatendof2015.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i19r-3bmscybNe842cce83474b587b72a-772_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422822_US-economic-growth-slowed-fourth-quarter-0-7_1540264274.html","title":"U.S. economy grinds to a near halt at end of 2015","title_page":"U.S. economy grinds to a near halt at end of 2015 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The US economy sputtered at the end of 2015, with the impact of slower global growth and turmoil across markets spilling over into US business investment and consumer spending.\nEconomic output grew at only a 0.7 percent annual pace in the fourth quarter, to hold overall growth for last year at 2.4 percent, the same pace as 2014, the Commerce Department reported Friday.\nThe year and the quarter were still much stronger than other advanced economies, but the deceleration raised concerns about the underlying strength of US growth as many other countries, including China, struggle to maintain their footing.\nStandstill: conomic output grew at only a 0.7 percent annual pace in the fourth quarter, to hold overall growth for last year at 2.4 percent, the same pace as 2014, the Commerce Department reported Friday\nStagnating: The US economy sputtered at the end of 2015, with the impact of slower global growth and turmoil across markets spilling over into US business investment and consumer spending. Spending on homes and development held up (pictured) in a sign of some tenacity\nThe main contributors to the slowing pace were the contraction in investment in the energy sector due to the crash in oil prices, and the strong dollar's drag on exports.\nConsumer spending slowed somewhat but spending on homes held up in a sign of some tenacity.\nIt was the second straight quarterly deceleration, and a bit worse than the 0.9 percent rate that analysts had forecast.\nGross domestic product expansion was 2.0 percent in the third quarter of 2015 and a brisk 3.9 percent in the second.\nThe slowdown came on the back of slumping business investment in buildings and equipment, related in part to the deep contraction in the oil sector.\nAlso hitting growth was a drop in exports, linked to the strong dollar and slowing demand abroad.\nImports also fell, helped by the lower cost of imported crude oil, but overall the net trade deficit was a larger drag on GDP growth than in previous months.\nSupporting growth was consumer spending on durable goods, which slowed slightly, and services, which was barely changed from the previous quarter.\nHousing boost: The US economy got a boost from a 10.8 percent increase in new home sales in December 2015, according to the Commerce Department\nAlso strong was home building and buying, and government spending. Falling federal government spending has been a persistent drag on economic output for several years; in the fourth quarter a surge in especially defense-related spending made a solid contribution to overall growth.\nThe quarter rounded out a year that was somewhat disappointing, after early estimates forecast that economic activity might expand by as much as 3.0 percent.\nBut analysts were mixed about how to read the strength of the domestic economy after the quarterly data.\nIn both the quarter and the year, if the net drag on GDP of trade was excluded, the economy appeared to still have sturdy legs.\nIn addition, job creation numbers of the last three months of the year were strong, implying continued gains in household incomes that should support more spending on homes, cars and other consumer goods.\nIHS Global Insight chief economist Nariman Behravesh said that while the weaker consumer spending in the quarter \"is something to keep an eye on,\" he expects growth will rebound to a 3.0 percent annual pace by the second half of this year.\n'Both employment growth and income growth are robust,' he said.\nBut others took the data as a warning that the economy could be at the start of a soft patch.\nChris Low of FTN Financial pointed out that consumption weakened despite consumers saving significant amounts of money on cheaper gasoline and home heating costs amid a mild winter.\n'All components of private-sector growth are flashing warning signs,' he said.\nMarkets read the data in that way and took it as a sign that the Federal Reserve would likely not raise interest rates again in its next meeting in March.\nThe S&P 500 gained about 1.0 percent in early trade after the GDP announcement, and short-term Treasury bond yields fell.\n'Maybe the Fed should rethink this whole tightening thing,' quipped Low.","url":"https://www.dailymail.co.uk/news/article-3422822/US-economic-growth-slowed-fourth-quarter-0-7.html"}
