{"authors":["Associated Press"],"date_download":"2018-10-23 05:01:45","date_modify":"2018-10-23 05:01:45","date_publish":"2016-01-29 20:43:38","description":"WASHINGTON (AP) — The U.S. economy struggled to grow in the October-December quarter as consumer spending, business investment and exports slowed. Yet despit...","filename":"data/vaneerConsumption/USeconomyisexpectedtostrengthenafterweak4thquarter.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:603b4601bc974b3c881a2fff6dfab2dd-3bmscybNe842cce83474b59b4b7c-872_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422797_US-economy-slowed-scant-0-7-pct-growth-rate-quarter_1540270905.html","title":"US economy is expected to strengthen after weak 4th quarter","title_page":"US economy is expected to strengthen after weak 4th quarter | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US economy is expected to strengthen after weak 4th quarter\nWASHINGTON (AP) — The U.S. economy struggled to grow in the October-December quarter as consumer spending, business investment and exports slowed. Yet despite global weakness and shrunken oil and stock prices, many economists expect growth to accelerate on the strength of healthy job gains.\nThe economy grew at an annual rate of just 0.7 percent last quarter, less than half the 2 percent growth rate in the July-September period, the government said Friday. It was the worst showing since a severe winter slowed the economy, as measured by the gross domestic product, to a 0.6 percent annual growth rate in last year's first quarter.\nThough the slowdown late last year could renew doubts about the durability of the 6½-year-old economic expansion, most analysts said they expected the slump to be short-lived.\nFILE - In this Tuesday, Jan. 26, 2016, file photo, Jeff Cuvelier, Jorgensen Forge master machinist, left, talks with Gov. Jay Inslee, center, on a tour of the plant in Seattle. On Friday, Jan. 29, 2016, the Commerce Department issues the first of three estimates of how the U.S. economy performed in the October-December quarter. (AP Photo/Elaine Thompson, File)\n\"The weak growth is temporary,\" said Nariman Behravesh, chief economist at IHS Global Insight. \"This is not an early warning of something worse.\"\nBehravesh said two of the key negative factors last quarter — an effort by companies to pare an overhang of unsold goods and investment cutbacks by oil companies facing much lower energy prices — would likely diminish early this year. That would pave the way for decent annual growth of around 2.5 percent in the first half of 2016, Behravesh said.\nPaul Ashworth, chief economist at Capital Economics, said he thinks GDP growth will rebound to an annual rate between 2.5 percent and 3 percent in the first six months of 2016 as further solid job growth fuels additional consumer spending. Consumer spending accounts for about 70 percent of economic activity.\nMuch of last quarter's weakness reflected a slowdown in consumer spending, which grew at a 2.2 percent annual rate, compared with a 3 percent rate the previous quarter. Analysts said part of that weakness likely reflected a warmer-than-normal December, which reduced spending on winter clothing and utility bills.\nFriday's estimate of fourth-quarter growth was the first of three that the government will issue.\nBesides consumer spending, exports were a source of weakness last quarter. That reflected in part a stronger dollar, which has made U.S. goods pricier and therefore less competitive overseas. Persistent sluggishness in such key export markets as China and Europe hurt, too. A wider U.S. trade deficit cut annual growth last quarter by 0.5 percentage point.\nAn additional drag came from cutbacks in business investment spending, which fell at a 1.8 percent annual rate, with spending on structures down 5.3 percent. That reflected a 38.7 percent plunge in spending in the oil and gas industry, which has slashed drilling and exploration in response to the plunge in oil prices.\nBesides pulling back on investment, businesses cut spending on stockpiles to try to pare unwanted inventories. That effort reduced growth by 0.5 percentage point in the fourth quarter. But some economists said they thought the broad effort by businesses to trim stockpiles was nearing an end.\nHome construction was one of the bright spots in the fourth quarter; it grew at a solid 8.1 percent annual rate. The U.S. housing market has remained solid.\nGovernment spending slowed to growth of just 0.7 percent. Spending by the federal government grew at a 2.7 percent annual rate, while state and local governments cut back on spending at a rate of 0.6 percent.\nFor all of 2015, the economy grew 2.4 percent, matching the growth in 2014. Both years improved on 2013. Still, last year's growth rate extended the economy's pattern of subpar expansion since the Great Recession officially ended in June 2009.\nFor 2016, economists have forecast another year of modest growth of around 2 percent to 2.5 percent. At the same time, they have nudged up the likelihood of another recession, given the stock market plunge that began the year, sharply diminished energy prices and China's struggling economy, the world's second-largest.\nA possible recession beginning this year is put at a still-low 20 percent. Most analysts say the most likely outcome is for steadily strengthening growth as consumers benefit from rising employment.\n\"Consumer spending and housing remain solid, thanks to good fundamentals, including steady job gains, rising wages and low interest rates,\" said Gus Faucher, senior economist at PNC.\nFaucher predicts that the economy will generate job gains this year averaging around 180,000 a month, which he thinks would be enough to lower the unemployment rate to 4.7 percent by year's end from 5 percent now.\nThis week, the Federal Reserve issued a cautious assessment of the economy. The Fed left interest rates unchanged after having raised its benchmark short-term rate in December from record lows.","url":"https://www.dailymail.co.uk/wires/ap/article-3422797/US-economy-slowed-scant-0-7-pct-growth-rate-quarter.html"}
