{"authors":["James Delingpole"],"date_download":"2018-10-30 19:33:21","date_modify":"2018-10-30 19:33:21","date_publish":"2015-09-19 07:37:06","description":"Twenty alarmist climate scientists have written to President Obama urging him to use RICO laws to crush dissent by climate skeptics.","filename":"data/vaneerConsumption/UseRICOLawsToJailSkeptics.json","image_url":"https://media.breitbart.com/media/2015/08/obama-wind-farm-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_19__1540928001.html","title":"Use RICO Laws To Jail Skeptics!","title_page":"Climate Alarmists To Obama: Use RICO Laws To Jail Skeptics!","title_rss":"NULL","source_domain":"breitbart.com","text":"Twenty alarmist climate scientists – including UN IPCC lead author Kevin ‘Travesty’ Trenberth – have written a letter to President Obama urging him to use RICO laws to crush dissent by climate skeptics. Their hypocrisy and dishonesty, especially that of the main signatory, almost defies belief.\nThe letter goes like this:\nSeptember 1, 2015 Dear President Obama, Attorney General Lynch, and OSTP Director Holdren,\nAs you know, an overwhelming majority of climate scientists are convinced about the potentially serious adverse effects of human-induced climate change on human health, agriculture, and biodiversity. We applaud your efforts to regulate emissions and the other steps you are taking. Nonetheless, as climate scientists we are exceedingly concerned that America’s response to climate change – indeed, the world’s response to climate change – is insufficient. The risks posed by climate change, including increasing extreme weather events, rising sea levels, and increasing ocean acidity – and potential strategies for addressing them – are detailed in the Third National Climate Assessment (2014), Climate Change Impacts in the United States. The stability of the Earth’s climate over the past ten thousand years contributed to the growth of agriculture and therefore, a thriving human civilization. We are now at high risk of seriously destabilizing the Earth’s climate and irreparably harming people around the world, especially the world’s poorest people.\nWe appreciate that you are making aggressive and imaginative use of the limited tools available to you in the face of a recalcitrant Congress. One additional tool – recently proposed by Senator Sheldon Whitehouse – is a RICO (Racketeer Influenced and Corrupt Organizations Act) investigation of corporations and other organizations that have knowingly deceived the American people about the risks of climate change, as a means to forestall America’s response to climate change. The actions of these organizations have been extensively documented in peerreviewed academic research (Brulle, 2013) and in recent books including: Doubt is their Product (Michaels, 2008), Climate Cover-Up (Hoggan & Littlemore, 2009), Merchants of Doubt (Oreskes & Conway, 2010), The Climate War (Pooley, 2010), and in The Climate Deception Dossiers (Union of Concerned Scientists, 2015). We strongly endorse Senator Whitehouse’s call for a RICO investigation.\nThe methods of these organizations are quite similar to those used earlier by the tobacco industry. A RICO investigation (1999 to 2006) played an important role in stopping the tobacco industry from continuing to deceive the American people about the dangers of smoking. If corporations in the fossil fuel industry and their supporters are guilty of the misdeeds that have been documented in books and journal articles, it is imperative that these misdeeds be stopped as soon as possible so that America and the world can get on with the critically important business of finding effective ways to restabilize the Earth’s climate, before even more lasting damage is done.\nThere follow twenty signatures of which the only one of note is that of Kevin ‘Travesty’ Trenberth, a moustacheoed alarmist and IPCC lead author who works at the Climate Analysis Section at the US National Center for Atmospheric Research. Trenberth is best known for two things.\nThe first was his frustrated 2009 email, exposed during Climategate:\nThe fact is that we can’t account for the lack of warming at the moment and it is a travesty that we can’t.\n(Hence his nickname Kevin ‘Travesty’ Trenberth. The real travesty of that email, of course, is that what he’s shown clearly doing there is not science but politics. A scientist would see the “missing heat” issue not as a “travesty” but as an opportunity to reassess the now-falsified models in the light of new evidence.)\nAnd the second is the infamous occasion on which he caused one of his IPCC authors to resign in protest at the way he (Trenberth) had misrepresented his research on hurricanes.\nThe author’s name was Chris Landsea, Science Officer at the National Hurricane Center. As one of the US’s leading hurricane experts, he had been invited to contribute to the IPCC’s Fourth Assessment Report.\nLandsea made it quite clear in his contribution that the spate of recent hurricane activity – this was in 2005 – had nothing to do with global warming. However, he was appalled to discover that when Trenberth (who is not an expert on hurricanes) gave a conference at Harvard to announce his findings he claimed the opposite.\nLandsea resigned in disgust and wrote this public letter:\nFor the upcoming AR4, I was asked several weeks ago by the Observations chapter Lead Author – Dr. Kevin Trenberth – to provide the writeup for Atlantic hurricanes. As I had in the past, I agreed to assist the IPCC in what I thought was to be an important, and politically-neutral determination of what is happening with our climate. Shortly after Dr. Trenberth requested that I draft the Atlantic hurricane section for the AR4’s Observations chapter, Dr. Trenberth participated in a press conference organized by scientists at Harvard on the topic “Experts to warn global warming likely to continue spurring more outbreaks of intense hurricane activity” along with other media interviews on the topic. The result of this media interaction was widespread coverage that directly connected the very busy 2004 Atlantic hurricane season as being caused by anthropogenic greenhouse gas warming occurring today. Listening to and reading transcripts of this press conference and media interviews, it is apparent that Dr. Trenberth was being accurately quoted and summarized in such statements and was not being misrepresented in the media. These media sessions have potential to result in a widespread perception that global warming has made recent hurricane activity much more severe. I found it a bit perplexing that the participants in the Harvard press conference had come to the conclusion that global warming was impacting hurricane activity today. To my knowledge, none of the participants in that press conference had performed any research on hurricane variability, nor were they reporting on any new work in the field. All previous and current research in the area of hurricane variability has shown no reliable, long-term trend up in the frequency or intensity of tropical cyclones, either in the Atlantic or any other basin. The IPCC assessments in 1995 and 2001 also concluded that there was no global warming signal found in the hurricane record. Moreover, the evidence is quite strong and supported by the most recent credible studies that any impact in the future from global warming upon hurricane will likely be quite small.\nTrenberth, in other words, deliberately misrepresented the science in order to advance his political agenda. We know what that political agenda was – and is – because he revealed it in that “travesty” email. Having made up his mind about the existence of what we now call Catastrophic Anthropogenic Global Warming – even to the point of expressing irritation when the observed data refused to conform with the theoretical models he so worshipped – he chose cynically and dishonestly to ramp up public hysteria by lying at a press conference about a connection between global warming and hurricanes which he knew was not true.\nLet us savour, for a moment, the sheer gall of this puffed up, vindictive, self-righteous, grandstanding, mendacious bully whose influential position in the US scientific establishment is generously funded by the American taxpayer.\nTrenberth is a liar, a proven liar, who has now written a letter to the president full of still more lies urging the use of racketeering laws to harrass and pursue scientists for the crime of being more rigorous and questioning about science than Kevin Trenberth.\nThere’s a word for this kind of preposterous inversion of the natural order. I think it begins with a “T”.","url":"https://www.breitbart.com/politics/2015/09/19/climate-alarmists-obama-use-rico-laws-jail-skeptics/"}
