{"authors":[],"date_download":"2018-10-22 22:16:40","date_modify":"2018-10-22 22:16:40","date_publish":"2014-05-09 08:38:05","description":"A senior defense official said that any rescue mission had to be a Nigerian one.","filename":"data/vaneerConsumption/USExpertsArriveinNigeriatoHuntGirlsTakenbyBokoHaram.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/431996/140509-nigeria-schoolgirls-protest-mn-1055_a70bf4d5310fd01466c9d905a7121dd5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_u-s-experts-arrive-nigeria-hunt-girls-taken-boko-haram-n101126_1540246600.html","title":"U.S. Experts Arrive in Nigeria to Hunt Girls Taken by Boko Haram","title_page":"U.S. Experts Arrive in Nigeria to Hunt Girls Taken by Boko Haram","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA senior defense official told NBC News that Nigeria's military needs to \"step up\" in order to locate and rescue the 276 schoolgirls abducted by Boko Haram.\nSix U.S. military advisers arrived in Nigeria Friday to assist the nation in its search efforts, bringing the total number of US military personnel there to 18, including the 11 who are permanently assigned advise and help train Nigerian military forces.\nTwo additional military personnel are set to arrive later Friday, and seven more will travel to Nigeria on Saturday, said State Department Spokesperson Jen Psaki. “If there are needs for more, we'll continue to assess that,\" Psaki said.\nBut the official said that any rescue mission had to be a Nigerian one. \"We've been training Nigerian military and security forces in counter-terrorism for the past two years. They have to step up.\"\nU.S. defense and military officials for now knock down any speculation that US military forces would be directly involved in a rescue effort.\n\"We have no clear idea where they (girls) are,\" the official said. There's also a high level of concern that the girls themselves would not survive such a rescue mission.\nUnlike most hostage situations, this is a large group, spread out in separate locations, and Boko Haram has already proven they are willing to slaughter innocents in large numbers.\n\"There's a lot we can do,\" said one senior military official. \"Provide intel, training, advising, mission planning, communications. But we won't be the trigger pullers.\"\nReuters reported Thursday that the U.S. was considering a request by Nigeria to provide surveillance aircraft and intelligence.\n\"We are considering it,\" Linda Thomas-Greenfield, U.S. assistant-secretary of State for African Affairs, said in an interview.\nBut as of Friday, no U.S. military drones have flown any surveillance missions over Nigeria, Chad or Cameroon. It's not clear when or even if that may happen.\nKirby said Friday the use of drones was not being discussed. “There are no active discussions” with the Nigerian government about the use of “unmanned aerial surveillance,” said Rear Adm. John Kirby during a Pentagon briefing.\nThe Nigerian government has only accepted the offer of the small “coordination team” from the U.S., Kirby said, without disclosing what additional aid the U.S. may have offered.\nLate Thursday, Secretary of State John Kerry announced the arrival of U.S. support in Nigeria. “Our inter-agency team is hitting the ground,” he said. They are going to be working with Nigerian President Goodluck Jonathan’s government to return the girls to their families and their communities, he added.\n\"We are also going to do everything possible to counter the menace of Boko Haram,” Kerry said, referring to the extremist Islamist group which has claimed responsibility for kidnapping the girls from their school in the northeastern village of Chibok on April 14.\nThe kidnappings and a video featuring the terror organization's leader threatening to sell the girls \"in the market\" have sparked protests worldwide over the Nigerian government's perceived inaction and failure to find the girls.\n“The entire world should not only be condemning this outrage but should be doing everything possible to help Nigeria in the days ahead,” Kerry said.\nIn an interview with TODAY’s Al Roker earlier this week, President Barack Obama said military and law enforcement officials would go to Nigeria to help with the search.\nA British team has also arrived in Nigeria and they will be, \"working closely with their U.S. counterparts and others to coordinate efforts,” a U.K. Foreign and Commonwealth Office spokesperson said.\n\"The team will be considering not just the recent incidents but also longer-term counter-terrorism solutions to prevent such attacks in the future and defeat Boko Haram,\" they added.\nSpeaking at the World Economic Forum being hosted in the Nigerian capital Abuja on Thursday, Nigeria's President Goodluck Jonathan pledged to find the girls and thanked foreign nations for their support.\n\"By God's grace we will conquer the terrorists,\" he told the audience. “I believe that the kidnap of these girls will be the beginning of the end of terror in Nigeria.”\nBoko Haram - whose name, roughly translated, means “Western education is sinful” - has been waging a bloody campaign in northeast Nigeria for years, destroying churches, kidnapping scores of people and burning down schools, sometimes with the students locked inside.\nReuters contributed to this report.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/u-s-experts-arrive-nigeria-hunt-girls-taken-boko-haram-n101126"}
