{"authors":[],"date_download":"2018-10-22 21:57:56","date_modify":"2018-10-22 21:57:56","date_publish":"2014-06-07 13:49:16","description":"The United States is financing a new TV channel in northern Nigeria to counter insurgencies by Boko Haram and other groups in the region.","filename":"data/vaneerConsumption/USFinancesNigeriasAntiMilitantTVChanneltoCounterBokoHaram.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_22/469631/140527-nigeria-officials-jms-1708_7f3cd59b153db4f9d1b27dea003dbaa6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_u-s-finances-nigerias-anti-militant-tv-channel-counter-boko-n125226_1540245476.html","title":"U.S. Finances Nigeria's Anti-Militant TV Channel to Counter Boko Haram","title_page":"U.S. Finances Nigeria's Anti-Militant TV Channel to Counter Boko Haram","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWASHINGTON — The United States is financing a new 24-hour satellite TV channel in northern Nigeria meant to counter insurgencies by the militant Islamist Boko Haram and other groups in the region, the New York Times reported on Friday.\nA U.S. official confirmed the project was under way but did not give full details. The official said the United States would \"support Nigerian efforts to provide an attractive alternative to the messaging of violent extremists.\"\nThe project is a result of discussions with Nigeria dating back to late 2012 on ways to cooperate against Boko Haram and the content of the channel will be produced by Nigerians in Nigeria, the official said.\nThe United States has in recent months increased its collaboration with Lagos in response to violence from Boko Haram, including surveillance and communications help after the abduction of more than 200 schoolgirls in April.\nThe Times said the TV channel, which is not yet broadcasting but is near to completion, is financed by the State Department’s Bureau of Counterterrorism and is expected to cost about $6 million.\nThe project is run in Nigeria by Equal Access International, a San Francisco-based government contractor that has managed media programs sponsored by the State Department in Yemen and Pakistan meant to encourage youth participation in politics and counter Islamist extremism, it said.\nThe paper quoted foreign policy experts saying the project faced several challenges in a region with low levels of infrastructure, public services, literacy and security. Access to electricity is limited and few people own televisions.\nIn addition to the broadcasts, the Times said the project would provide training to journalists in the region.\n— Reuters","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/u-s-finances-nigerias-anti-militant-tv-channel-counter-boko-n125226"}
