{"authors":[],"date_download":"2018-10-22 21:22:33","date_modify":"2018-10-22 21:22:33","date_publish":"2014-05-06 18:26:22","description":"Suspected Boko Haram gunmen kidnapped eight girls from a village near one of the Islamists' strongholds in northeastern Nigeria overnight, police and residents said on Tuesday.","filename":"data/vaneerConsumption/USFormingCoordinationCellinNigeriatoFindAbductedGirls.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/424481/140506-boko-haram-nigeria-jhc-1635_e16362c4629383be3fdfa103f3937b0c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_u-s-forming-coordination-cell-nigeria-find-abducted-girls-n98431_1540243353.html","title":"U.S. Forming 'Coordination Cell' in Nigeria to Find Abducted Girls","title_page":"U.S. Forming 'Coordination Cell' in Nigeria to Find Abducted Girls","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAmerican military and law-enforcement personnel will coordinate with Nigerian officials in a stepped-up effort to find nearly 300 schoolgirls who were abducted by Islamic terrorists in the country last month, President Obama and John Kerry said Tuesday.\nThe United States first publicly announced an offer for help last week, but on Tuesday Kerry spoke with Nigerian president Goodluck Jonathan and a plan was put in action.\n“So what we've done is — we have offered, and it's been accepted — help from our military and our law enforcement officials,” Obama told NBC News’ Al Roker on Tuesday. \"We're going to do everything we can to provide assistance to them.\"\n“In the short term our goal is obviously to help the international community, and the Nigerian government, as a team to do everything we can to recover these young ladies,” Obama continued. “But we're also going to have to deal with the broader problem of organizations like this, that, uh, you know, can cause such havoc in people's day-to-day lives.”\nKerry on Tuesday spoke to the president of Nigeria and offered direct, concrete help in finding the girls kidnapped from their classrooms by Boko Haram, a terror group whose name means “Western education is a sin.”\nKerry said that a joint intelligence cell would be set up at the U.S. embassy in Nigeria and would begin work \"immediately.\"\n\"Our embassy in Abuja is prepared to form a coordination cell that could provide expertise on intelligence, investigations and hostage negotiations and to help facilitate information-sharing and victim assistance.\"\n\"(Nigerian) President Goodluck Jonathan was very happy to receive this offer and ready to move on it immediately,\" said Kerry at the press conference in Washington, D.C., with E.U. foreign policy chief Catherine Ashton. \"And we are immediately engaging in order to implement this.\"\nHe added, \"we remained deeply concerned about the welfare of these young girls.\"\nREAD MORE: Nigerian Schoolgirl Describes Kidnapping by Terrorists\nWhen asked later by NBC News why it has taken so long to mobilize the joint effort to find the abducted girls, Kerry bristled, saying \"First of all we have been in touch from Day One and our embassy has been engaged and we have been engaged, but the (Nigerian) government had its own set of strategies in the beginning.\"\n\"We are immediately engaging in order to implement this.\"\n\"I think now the complications that have arisen have convinced everybody that there needs to be a greater effort ... I think you’re going to see a very, very rapid response,\" he said.\nThe \"complications\" that have arisen could be the reports that the group that abducted the 276 girls, Boko Haram, is selling them into slavery across the borders of Chad and Cameroon.\nA senior U.S. intelligence official confirmed to NBC News that Nigeria officially asked for help on Tuesday, through the Office of the Director of National Intelligence, and the FBI has been tasked with the job. The ODNI could also help with satellite imaging and electronic eavesdropping, the official said.\nA second senior U.S. official confirmed that there are already U.S. intelligence assets in the region.\nAmong the American assets in the region are bases from which unarmed drones could fly to hunt for the missing girls and their captors.\nBoth officials stressed that U.S. technical assistance would be no guarantee that the girls would be found.\nCarl LeVan, an assistant professor at American University in Washington, D.C., who is an expert on Boko Haram – and who spoke to President Jonathan while travelling in Nigeria last month – said he believed the new air of cooperation could lead to positive results.\n\"Without knowing any additional details, I would say that the U.S. and other outside countries have relevant expertise to bring, and if they are willing partners of the Nigerian government, they certainly have technical capacities that aren't being used enough in the country.”\nHe pointed to the example of the Nigerian law-enforcement response to a bombing in the country just last month while he was there.\n“The first thing that happened within 24 hours is they completely cleaned up the scene (with brushes and hoses),” said LeVan. “(But) you want to collect the evidence. And that’s what the FBI do really well. They can share lessons not just from the United States but from other parts of the world — and say 'this is how you treat this as a crime scene.'”\nMeanwhile, just hours before Kerry spoke on Tuesday, a report was released that eight more girls have been kidnapped from a village near one of the Islamists' strongholds in northeastern Nigeria overnight, according to police and residents. The girls were aged 12 to 15.\nLazarus Musa, a resident of the village of Warabe, told Reuters that armed men had opened fire during the raid.\n\"They were many, and all of them carried guns. They came in two vehicles painted in army color. They started shooting in our village,\" Musa said by telephone from the village in the hilly Gwoza area, Boko Haram's main base.\nThe United Nations Children's Fund condemned the newest abduction, calling it \"especially abhorrent\" that the girls were taken to prevent them from attending school.\n\"UNICEF calls on the abductors to immediately return these girls unharmed to their communities, and we implore all those with influence on the perpetrators to do everything they can to secure the safe return of the girls-and to bring their abductors to justice,\" the group said in a statement.\nBoko Haram leader Abubakar Shekau threatened in a video released to the media on Monday to sell the girls abducted from a secondary school on April 14 \"on the market\".\nThe kidnappings by the Boko Haram, who say they are fighting for an Islamic state in Nigeria, have shocked the world. But they have also embarrassed the government before a World Economic Forum (WEF) meeting on Africa, the annual gathering of the wealthy and powerful, in Abuja from May 7-9.\n\"We remained deeply concerned about the welfare of these young girls.\"\nThe United Nations warned Boko Haram that if they carried out their leader's threat to sell the girls, they would forever be liable to prosecution for war crimes, even decades after the event.\n\"We warn the perpetrators that there is an absolute prohibition against slavery and sexual slavery in international law. These can ... constitute crimes against humanity,\" U.N. human rights spokesman Rupert Colville said in Geneva.\nThe military's inability to find the girls in three weeks has led to protests in the northeast, Abuja and Lagos, the commercial capital. More are expected on Tuesday in Abuja, just as delegates will be collecting their badges to allow them entry to the hotel where the WEF will take place.\nBritish Foreign Minister William Hague reiterated an offer of help to Nigeria on Tuesday, after calling the abductions \"disgusting and immoral.\"\nAlso on Tuesday, U.S. lawmakers — including House Minority Leader Nancy Pelosi (D-CA), Sen. Barbara Boxer (D-CA), Sen. Barbara Mikulski (D-MD), Sen. Amy Klobuchar (D-MN), Sen. Tim Scott (R-SC) and Rep. Karen Bass (D-CA) — gathered together on the east steps of the US Capitol to participate in a moment of silence for the kidnapping victims in Nigeria.\n\"We refuse to be indifferent because God has entwined our destinies, and injustice anywhere is a threat to justice everywhere,\" said the Reverend Barry Black, who led the politicians in prayer.\n— with NBC News' Robert Windrem and Frank Thorp, and Reuters","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/u-s-forming-coordination-cell-nigeria-find-abducted-girls-n98431"}
