{"authors":[],"date_download":"2018-10-22 21:50:44","date_modify":"2018-10-22 21:50:44","date_publish":"2014-05-08 15:39:29","description":"The \"skills gap\"—the mismatch between workers seeking jobs and the skills employers actually want—may be trickling down to the booming energy sector.","filename":"data/vaneerConsumption/USGasandOilBoomisBeingHinderedbyEnergySkillsGap.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/429401/140508-140508-shale-1154_e48dfb793862df306a680bd2d96045a7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_energy_u-s-gas-oil-boom-being-hindered-energy-skills-gap-n100406_1540245044.html","title":"U.S. Gas and Oil Boom is Being Hindered by Energy Skills Gap","title_page":"U.S. Gas and Oil Boom is Being Hindered by Energy Skills Gap ","title_rss":"NULL","source_domain":"nbcnews.com","text":"The hotly debated \"skills gap\"—the mismatch between workers seeking jobs and the skills employers actually want—may be trickling down to the booming energy sector.\nThe dynamic, dissected at length at the national level in the context of a weak job market, is a growing source of concern for U.S. energy producers, according to two new reports. As the country churns out record levels of oil and gas, the findings suggest oil companies are increasingly concerned about the quality of the applicant pool for jobs that are integral to fueling the shale gas boom.\nRecruitment company Manpower, which expects the number of U.S. energy-related jobs to nearly double to 3 million by 2020, found in a survey that 72 percent of oil and gas executives cited an \"inability to attract quality candidates\" to their jobs. A \"double squeeze\" of both entry-level and top-ranking talent may cost the United States jobs and productivity, the study found.\nBecause of an energy boom that has sent U.S. oil production to its highest in nearly 40 years, \"more skills are needed today than just five years ago,\" said Jorge Perez, Manpower's senior vice president, who assisted in the report's findings.\nOil companies believe \"if we don't have enough from the people … energy production won't be done as fast or efficiently as it could otherwise,\" Perez added in an interview.\nThe skills mismatch is a pressing problem because the U.S. is projected to surpass Saudi Arabia and Russia as the world's largest producer of oil and natural gas. Meanwhile, salary isn't a sticking point. Because of the labor and risk involved—as well as the size and scope of the U.S. boom—pay in the sector is far more competitive than in previous years. In North Dakota's Bakken region, for instance, compensation can easily top $100,000.","url":"https://www.nbcnews.com/business/energy/u-s-gas-oil-boom-being-hindered-energy-skills-gap-n100406"}
