{"authors":["Associated Press"],"date_download":"2018-10-23 02:28:26","date_modify":"2018-10-23 02:28:26","date_publish":"2017-03-16 12:59:28","description":"BERLIN (AP) - The U.S. and German finance chiefs say they're ready to cooperate and avoid \"trade wars,\" playing down in their first meeting the tensions that...","filename":"data/vaneerConsumption/USGermanfinancechiefsseektodefusetradetensions.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/18/wire-229997-1489688365-797_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320114_German-finance-chief-rejects-protectionism-US-meeting_1540261706.html","title":"US, German finance chiefs seek to defuse trade tensions","title_page":"US, German finance chiefs seek to defuse trade tensions | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BERLIN (AP) - The U.S. and German finance chiefs say they're ready to cooperate and avoid \"trade wars,\" playing down in their first meeting the tensions that have grown globally over commerce since the new U.S. administration came to power.\nDuring a visit to Berlin before a wider meeting with the finance chiefs of the Group of 20 economic powers, Steve Mnuchin said Thursday that \"it is not our desire to get into trade wars.\"\nBut he said, without providing specifics, that President Donald Trump wants to review some international trade deals to make them fairer for American workers.\nU.S. Treasury Secretary Steven Mnuchin, right, and German Finance Minister Wolfgang Schaeuble, left, address the media during a joint press conference after a meeting in Berlin, Germany, Thursday, March 16, 2017. (AP Photo/Michael Sohn)\n\"Our objective is getting more balanced trade agreements,\" he told reporters while sitting by Germany's Wolfgang Schaeuble.\nThe German had earlier in the day warned against protectionism and nationalism and conceded that he and Mnuchin did not agree on all points.\nA Trump adviser had earlier this year accused Germany of benefiting from a weak euro that boosts its exports. Germany rejects the charge, saying it sells more abroad because its companies make competitive products and that it can't do much to influence the euro's exchange rate since eurozone monetary policy is set by the European Central Bank.\nSchaeuble and Mnuchin sought to defuse any tensions on the issue. \"It's not about giving lectures to each other,\" Schaeuble said.\nTrump himself has accused China of currency manipulation, and while walking back from the adviser's comments about the euro, Mnuchin suggested that didn't mean the entire issue was off the table.\n\"The euro is a currency that is used by many countries and is impacted by many aspects, so it is a different situation than when you have a single currency controlled by a single country,\" he said.\nMnuchin's views are being scrutinized to signs of how hard he might be in implementing Trump's message that the U.S. needs a tougher approach to trade that would put American workers and companies first. Trump has already pulled the U.S. out of a proposed trade deal with Pacific Rim countries and has started the process to renegotiate the North American Free Trade Agreement with Mexico and Canada.\nMembers of the Group of 20, a gathering of the world's most powerful economies, will debate whether to confirm their rejection of trade barriers when they meet Friday and Saturday in southern Germany.\nMnuchin also appeared to want to ease concerns that the U.S. might act to limit the rise of the dollar, since a stronger currency can hurt exporters. Purposefully weakening - or \"manipulating\" - a currency has been rejected by the G-20 collectively.\nMnuchin said Thursday that in the longer term, \"the strengthening of the dollar is a good thing\" as it shows confidence in the U.S. economy and currency.\n___\nMcHugh reported from Frankfurt, Germany.\nU.S. Treasury Secretary Steven Mnuchin, right, and German Finance Minister Wolfgang Schaeuble, left, address the media during a joint press conference after a meeting in Berlin, Germany, Thursday, March 16, 2017. (AP Photo/Michael Sohn)","url":"https://www.dailymail.co.uk/wires/ap/article-4320114/German-finance-chief-rejects-protectionism-US-meeting.html"}
