{"authors":["Deborah Danan"],"date_download":"2018-10-30 20:23:03","date_modify":"2018-10-30 20:23:03","date_publish":"2016-06-01 13:25:01","description":"TEL AVIV – The openly gay grandson of a West Bank Hamas founder has finally found refuge in the United States, VICE News reported.","filename":"data/vaneerConsumption/USGrantsRefugeToGrandsonOfHamasFounder.json","image_url":"https://media.breitbart.com/media/2016/06/Screen-Shot-2016-06-01-at-14.35.40.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_06_01__1540930983.html","title":"U.S. Grants Refuge To Grandson Of Hamas Founder","title_page":"U.S. Grants Refuge To Grandson Of Hamas Founder","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – The openly gay grandson of a West Bank Hamas founder has finally found refuge in the United States, VICE News reported.\nThe renamed John Calvin (pictured) was living under the threat of deportation for years while waiting for political asylum from Canada. According to the report, Calvin said that if he were to heed a Canadian court’s decision to deport him back to the Palestinian territories he would face certain death for coming out as gay, converting to Christianity, and renouncing the Islamist terror organization his grandfather co-founded.\nEventually rejected by the Canadian immigration system, the 25-year-old crossed into the U.S. late last year and was placed on immigration hold until his release.\nHowever, a deferral of removal granted him by a Massachusetts immigration court under the Convention Against Torture means that Calvin will be able to stay in the U.S. indefinitely. However, the ruling does not grant any permanent immigration status and neither will Calvin be able to apply for a green card.\n“I’ve literally been to hell and back, so it’s going to take a while for me to rebuild my life,” Calvin told VICE News.\n“I’m in New York, and it’s one of the greatest places on earth. I’m trying to focus … and gradually trying to make it home, but it’s still not home,” he added.\nCalvin was living in Canada for five years before the Immigration and Refugee Board rejected his application on the grounds that he was once an active member of Hamas.\nA member of the Immigration Appeal Division defended the decision, ruling that Calvin’s explanation that he was indoctrinated by his family and anything he did on behalf of Hamas was strictly out of obedience and loyalty “does not excuse membership in a terrorist organization.”\n“Growing up as a ‘Son of Hamas’ does not relieve the respondent from responsibility for his actions,” the member added.\nNevertheless, Calvin bears no hard feelings towards Canada and says he believes its hardline policies are crucial for the interests of national security.\n“If I was to hold a grudge, it wouldn’t help anyone,” he said. “The law is righteous, despite the fact that I got bitten by it unjustly.”\nNow in the U.S., he’ll be able to obtain a work permit, apply for universities, and, he quips, “get very long and expensive therapy.”\nAt the age of 16, Calvin escaped the complex where he grew up with his grandfather, Said Bilal, the Nablus chief of the Muslim Brotherhood and a co-founder of Hamas, and other family members who were also senior officials in the terror organization.\nHe ran away to Israel where he was arrested for illegally entering the country. While serving a stint in jail, Calvin was raped by a Muslim man.\nThe horrific experience led to a series of events that made him question everything he’d ever been taught about Israel.\n“[I] ended up getting assistance from Jewish psychiatrists and from the jail administration, which helped me through the worst thing that ever happened to me in my life. That ended up changing my life entirely. The entire staff tried to help, including the prison warden,” Calvin told the Times of Israel in an interview last year.\n“They tried to keep it quiet because of the culture in jail and even followed up with me after my release. This was not the image I grew up with about Jewish people.”\nHe says at that point everything he knew “collapsed on itself and was absolutely destroyed.”\n“From that point on, I had to develop my own beliefs and ideologies [after being] exposed to the truth — that Jewish people were not the monsters I was taught they are. They were actually normal people who showed humanity and compassion in my time of need,” he said.","url":"https://www.breitbart.com/middle-east/2016/06/01/u-s-grants-refuge-to-grandson-of-hamas-founder/"}
