{"authors":["Associated Press"],"date_download":"2018-10-23 04:34:52","date_modify":"2018-10-23 04:34:52","date_publish":"2016-01-11 17:39:40","description":"WASHINGTON (AP) — The Supreme Court on Monday appeared ready to deal a major blow to organized labor as it considers the free speech rights of government wor...","filename":"data/vaneerConsumption/UShighcourtseemsskepticalofmandatorypublicunionfees.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:e9d1f2baaecf46db88b085514c89033b-3WAQP5SaQH704788ebcf7e15fab5-366_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394277_US-high-court-skeptical-mandatory-public-union-fees_1540269292.html","title":"US high court seems skeptical of mandatory public union fees","title_page":"US high court seems skeptical of mandatory public union fees | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US high court seems skeptical of mandatory public union fees\nWASHINGTON (AP) — The Supreme Court on Monday appeared ready to deal a major blow to organized labor as it considers the free speech rights of government workers who say they shouldn't be forced to pay fees to public sector unions.\nThe high court's conservative justices seemed inclined during 80 minutes of oral argument to overrule a four-decade old precedent that allows public unions to collect \"fair share\" fees from non-members to help cover the costs of collective bargaining.\nA group of California public school teachers claims those mandatory fees violate the constitutional rights of workers who disagree with the union's positions.\nLesa Curtis of Westchester, N.Y., right, who is pro agency fees and a former president of her union, rallies outside of the Supreme Court in Washington, Monday, Jan. 11, 2016, as the court heard arguments in the 'Friedrichs v. California Teachers Association' case. The justices were to hear arguments in a case that challenges the right of public-employee unions to collect fees from teachers, firefighters and other state and local government workers who choose not to become members. (AP Photo/Jacquelyn Martin)\nLabor officials fear that union members will leave in droves if they realize they can get all the benefits of representation without paying for it. Union advocates say the lawsuit is part of a conservative agenda to weaken powerful labor unions, known for reliably supporting Democratic candidates and policies. The teachers are backed by the conservative Center for Individual Rights.\nFor decades, the growth of union workers in government has helped compensate for steep losses in manufacturing, construction and other private industries where unions once thrived. About half of all union members are now in the public sector, which has a membership rate of 36 percent. That's more than five times higher than that of the private sector, at 6.6 percent.\nJustice Anthony Kennedy rejected arguments made by lawyers for the state of California and the California Teachers Association that the current fee system is needed to prevent non-members from becoming \"free riders\" who get all the benefits of union bargaining and grievance procedures without paying for it.\n\"The union is basically making the teachers 'compelled-riders' on issues with which they strongly disagree,\" Kennedy said.\nArguing in support of the union, California Solicitor General Edward Dumont said the state needs a reliable bargaining partner that is funded by all the workers it represents. He said the fees for collective bargaining typically apply to non-political issues such as mileage reimbursement, working hours and other mundane issues.\nBut Chief Justice John Roberts said even routine matters can become politically charged if they involve how the state spends money.\n\"That's always a public policy issue,\" Roberts said.\nThe California teachers want the high court to overturn a 1977 precedent that allows public unions to collect money from non-members to help cover the costs of collective bargaining as long as the money doesn't go to political causes. The court in that case, Abood v. Detroit Board of Education, said the arrangement was justified to prevent non-members from becoming free riders.\nBut the teachers argue that unions have become more political over time. They say even a push for higher salaries and pension benefits raises political questions about the best use of tax dollars for cash-strapped localities.\nA federal district court ruled against the teachers, saying the outcome was clear under Abood. The 9th U.S. Circuit Court of Appeals affirmed that decision.\nA decision in the case is expected by late June.\nRosalind LaRocque of Upper Marlboro, Md., and who is a member of the American Teachers Union and is pro agency fees, rallies outside of the Supreme Court in Washington, Monday, Jan. 11, 2016, as the court heard arguments in the 'Friedrichs v. California Teachers Association' case. The justices were to hear arguments in a case that challenges the right of public-employee unions to collect fees from teachers, firefighters and other state and local government workers who choose not to become members. (AP Photo/Jacquelyn Martin)\nPeople participate in a rally at the Supreme Court in Washington, Monday, Jan. 11, 2016, as the court heard arguments in the 'Friedrichs v. California Teachers Association' case. The justices were to hear arguments in a case that challenges the right of public-employee unions to collect fees from teachers, firefighters and other state and local government workers who choose not to become members. (AP Photo/Jacquelyn Martin)\nPeople stand in line hoping to enter the Supreme Court in Washington, Monday, Jan. 11, 2016, for arguments in the 'Friedrichs v. California Teachers Association' case. The justices were to hear arguments in a case that challenges the right of public-employee unions to collect fees from teachers, firefighters and other state and local government workers who choose not to become members. (AP Photo/Jacquelyn Martin)","url":"https://www.dailymail.co.uk/wires/ap/article-3394277/US-high-court-skeptical-mandatory-public-union-fees.html"}
