{"authors":["Akin Oyedele"],"date_download":"2018-10-30 22:41:06","date_modify":"2018-10-30 22:41:06","date_publish":"2018-07-30 00:00:00","description":"The housing market is in a slowdown as rising prices and mortgage rates, low inventory, and slow wage growth combine. Americans still see buying a house as a good investment, but fewer people are succeeding at it.","filename":"data/vaneerConsumption/UShousingmarketslowdownwavesredflagfortheeconomy.json","image_url":"https://amp.businessinsider.com/images/5b5f245173f5a71a008b4846-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_us-housing-slowdown-economy-2018-7_1540939266.html","title":"US housing market slowdown waves red flag for the economy","title_page":"    US housing market slowdown waves red flag for the economy - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Housing investment and sales have been falling for months. Robert Galbraith/Reuters\nThe US housing market is slowing down.\nFriday's report on US economic growth spurred a presidential victory lap after it showed that gross domestic product rose at a 4.1% annual rate, the fastest in nearly four years.\nBut it had an ugly detail about the housing market that added to evidence of a slump: Residential investment, which includes construction and brokers' fees, shrank in the second quarter for a third quarter out of four.\nAdd this to the worst housing affordability in nearly a decade and rising mortgage rates, and you have a recipe for a slowdown.\nFor Lindsey Piegza, the chief economist at Stifel, the housing market \"raises a large red flag\" about economic growth in the second half of the year. She added that home sales help drive other parts of the economy, including consumer confidence and the pace of construction.\nAnd Ian Shepherdson, the chief economist at Pantheon Macroeconomics, said in a recent note: \"It's very hard to escape the conclusion that the market has peaked for this cycle, given the rise in mortgage rates since last fall and the gradual tightening of lending standards.\"\nBuyer fatigue\nBuyer fatigue is building, even though a strong jobs market and the maturing of millennials mean there's plenty of demand for houses.\nEvidence of this fatigue came last week in several sales reports.\nExisting-home sales, which make up about 90% of the market, fell for a third straight month in June to an annual pace of 5.38 million units, according to the National Association of Realtors. And new residential construction, or housing starts, softened in June to an annual rate of 1.17 million units, according to the Census Bureau. In March, starts were at an annual rate of 1.33 million.\nEconomists often caution against drawing broad conclusions from monthly housing data because it's volatile and often revised.\nBut for several months now, the trend of many key indicators has been downward.\n\"We have officially arrived at a moment in housing nationwide,\" Jonathan Miller, CEO of the real-estate appraiser Miller Samuel, said in a newsletter.\nHe said sales in both the high and the low ends of housing were slowing for different reasons. Luxury-home sales in major markets including Manhattan, Los Angeles, and the Hamptons have cooled amid uncertainty about the effects of the new tax law.\nAt the cheaper end, the market has \"crossed an affordability threshold\" after many years of increasing prices, low inventory, slow wage growth, and, now, rising mortgage rates, Miller said.\nWhat these four ingredients in this recipe for a housing slowdown are not telling us, however, is that Americans don't see housing as a good investment.\nBut they're showing that it's getting harder to buy a home and that fewer Americans are succeeding at it.\nSee also:","url":"https://www.businessinsider.com/us-housing-slowdown-economy-2018-7"}
