{"authors":[],"date_download":"2018-10-22 20:49:14","date_modify":"2018-10-22 20:49:14","date_publish":"2014-05-02 20:53:19","description":"For U.S. hotels hoping to attract Chinese tourists, it may start with learning to say \"Nin Hao\" but it's also about knowing lucky numbers.","filename":"data/vaneerConsumption/USHotelsCourtingChineseTravelersWithTeaLuckyNumbers.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_18/417311/140502-tourists-china-1638_ee98f39269e61b4f97fb449e59c78ccd.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_u-s-hotels-courting-chinese-travelers-tea-lucky-numbers-n96011_1540241354.html","title":"U.S. Hotels Courting Chinese Travelers With Tea, Lucky Numbers","title_page":"U.S. Hotels Courting Chinese Travelers With Tea, Lucky Numbers","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFor U.S. hotels hoping to attract big-spending Chinese travelers, it may start with learning to say \"Nin Hao\" but it's also about knowing the lucky numbers, unlucky colors, and which carafes to order for the coffeemakers.\nThe staff at the New York Marriott Marquis hotel recently got a crash course in how to welcome some of Amway China's 1,500 guests who won incentive sales trips to New York City in April.\n\"We replaced the carafes so these guests could make tea each morning,\" Kathleen Duffy, Marriott International's market director of public relations/NYC, told CNBC. \"And we brought in Terri Morrison, author of 'Kiss, Bow, or Shake Hands,' to give a course for managers to learn all the cultural things we need to be aware of.\"\nFrom the days when its only Chinese visitors were high government officials, the Marquis had already assigned names (Royal, Pinnacle, etc.) to presidential suites on the 44th and 45th floors, because the number four is considered unlucky in Chinese culture.\nBut now that many more Chinese citizens are heading to the United States on business and leisure trips, Marriott International hotels, as well as Starwood, Hilton and many other lodging brands, are working harder to boost brand recognition and make the hotel visit a more important part of the Chinese tourist's visit.\nThe target market is big — and getting bigger.\nIn 2013, an estimated 1.8 million Chinese tourists visited the United States. For 2014, the U.S. Department of Commerce's Office of Travel and Tourism Industries expects that number to rise by 21 percent, to more than 2.1 million, with increases of about 20 percent per year through 2018.\nLos Angeles and New York City received the most Chinese tourists in 2012, according to the Department of Commerce. And in the New York region alone, Marriott has seen a 17 percent growth in 2013 over 2012 for the Chinese market, according to Robert Ambrozy, Marriott international sales director for the New York City region.\nOn an internal website for its associates, Marriott International provides tips and guidelines for properties to use to \"customize, personalize and cater to the Chinese traveler.\"\nThe suggestions are separated into categories that include pre-arrival, food and beverage, guest amenities, concierge, and things to avoid, such as writing a guest's name in red ink — which signifies death in Chinese culture.\nThe number eight is considered lucky in Chinese culture, so standing out to a Chinese guest \"can be as simple as what the Chicago Marriott Oak Brook did, which was to put eight chocolate coins and candy in a small mesh bag with an attached welcome note,\" said Seema Jain, director of Multicultural Markets and Alliances for Marriott International.\n\"It's a burgeoning market and, beyond hotels, there are companies and destinations adapting their products and services to these new clients.\"\nIn Chicago, tourism growth from Asian markets was up more than 30 percent in 2012; twice the national average, according to Choose Chicago.\nThat led the Hyatt Regency Chicago to create a \"Nin Hao\" welcome program to ensure that Chinese guests checking into their room find bathrobes and slippers, tea kettles with special teas and tea cups, a welcome letter, maps and information brochures in Chinese and a Chinese TV channel.\nThe hotel also tries to insure a Mandarin-speaking employee is available and, in addition to having translation technology such as iPad and iPhone translation apps handy, maintains a 24-hour hotline to a Mandarin-speaking translator.\nOverall, in 2012, Chinese visitors to the U.S. spent $8.8 billion, nearly $6,000 per visit, according to the U.S. Travel Association, an industry trade group. Nightly room rates in New York City and Los Angeles can be quite pricey, but not all that money was spent at hotels.\nShopping, dining, sightseeing, visiting museums and spending time at amusement and theme parks are among the top activities participated in by Chinese visitors to the U.S., according to the U.S. Department of Commerce. And while right now only about 4 percent of all outbound Chinese travelers head for the United States, \"it's a burgeoning market and, beyond hotels, there are companies and destinations adapting their products and services to these new clients,\" Greg Staley, vice president of communications at the U.S. Travel Association, told CNBC. \"It's a new market for many destinations around the country and a vast opportunity to grow the U.S. economy.\"","url":"https://www.nbcnews.com/business/travel/u-s-hotels-courting-chinese-travelers-tea-lucky-numbers-n96011"}
