{"authors":["Mark Fleming","First American Financial Corporation"],"date_download":"2018-10-31 00:25:19","date_modify":"2018-10-31 00:25:19","date_publish":"2018-07-10 00:00:00","description":"Homeownership rates in the US continue to fall below potential. But rising rates aren't weighing on demand for homes — even for millennials. It's possible millennials are not rejecting homeownership, but rather delaying it.","filename":"data/vaneerConsumption/UShousingdemandisunfazedbyrisingrates.json","image_url":"https://amp.businessinsider.com/images/5ade15e419ee861b008b4642-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_us-housing-demand-is-unfazed-by-rising-rates-even-for-millennials-2018-7_1540945519.html","title":"US housing demand is unfazed by rising rates","title_page":"    US housing demand is unfazed by rising rates — even for millennials - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Federal Reserve Board Chairman Jerome Powell prepares to testify before a Senate Banking Housing and Urban Affairs Committee hearing on the The Semiannual Monetary Policy Report to the Congress; on Capitol Hill in Washington, U.S., March 1, 2018. Yuri Gripas/Reuters\nAs we reflect on our country's recent Independence Day commemoration, we find that the desire to achieve the American dream of homeownership still exists. Because, while the U.S. homeownership rate remains close to half-century lows, demand is strong, especially among millennials. In fact, results of our Real Estate Sentiment Index survey of title agents and real estate professionals conducted in the second quarter of 2018 showed nearly 87 percent of first-time home buyers were in the prime home-buying age of 26 to 35, which corresponds with the ages of millennials.\nWhen considering homeownership rates, it's important to note that traditional measures do not account for shifts in underlying demographic or economic factors. Instead, they report only the share of households that are homeowners. Analysis based on these traditionally calculated homeownership rates has resulted in mistaken conclusions that are often propagated as conventional wisdom. We developed our annual Homeownership Progress Index (HPRI) to provide a more in-depth look into the changes in homeownership rates over time by accounting for the impact of critical lifestyle, societal and economic trends that influence the likelihood of renting or owning a home. Understanding these homeownership characteristics and tracking how they change over time allows us to measure potential homeownership demand.\nHomeownership Rate Continues to Underperform Potential\nThe figure below shows the actual homeownership rate versus potential homeownership demand represented by the HPRI. In years past, potential homeownership demand was greater than the actual homeownership rate. This was largely due to baby boomers making the lifestyle and economic decisions that drive homeownership demand, notably settling down to form households of their own. From 1984 to 1986 and again in 1992, the actual homeownership rate was at or above the potential demand. This was most likely a result of innovations in mortgage finance, and the economic boom of the 1990s. In the late 1990s to the early 2000s, the potential demand again peaked above the actual homeownership rate. Achieving the dream of homeownership may have been restricted then by access to credit or the down payment necessary to purchase a first home.\nThe housing crisis brought an interesting change, as the homeownership rate exceeded the potential demand from 2008 to 2012. Speculation, easy access to credit and exuberance during the housing boom of 2004-2007 spurred the homeownership rate to record highs. As the housing market turned in 2008 and economic fundamentals supporting potential homeownership demand decreased in subsequent years, the homeownership rate exceeded potential homeownership demand, with the gap reaching almost 9 percent at its peak in 2010.\nThis contrasts sharply with the dynamic observed in 2017, the most recent year of available data to estimate the HPRI. In 2017, potential homeownership demand grew by one percent over the prior year, while the actual homeownership rate underperformed potential demand by almost 9 percent. So, what could be the cause of this?\nMillennial Demand Yet to Peak\nOne likely answer rests with the largest generational cohort - millennials. Millennials are often referred to as a \"renter generation,\" because they have prioritized furthering their education and thus delayed getting married and having children, which are critical lifestyle triggers to buying a first home. However, the dream of homeownership is far from dead for this age group. Nearly 80 percent of millennials who responded to a recent study by Harvard University's Joint Center for Housing Studies agreed that homeownership was part of achieving the American Dream. Is it possible that they are not rejecting homeownership, but rather, simply delaying it?\nFirstAm","url":"https://www.businessinsider.com/us-housing-demand-is-unfazed-by-rising-rates-even-for-millennials-2018-7"}
