{"authors":["Neil Munro"],"date_download":"2018-10-30 19:08:40","date_modify":"2018-10-30 19:08:40","date_publish":"2018-09-14 07:03:56","description":"Immigrant Population Hits 13.7 percent, up from 5 Percent in 1970.","filename":"data/vaneerConsumption/USImmigrantNumbersHit445MillionNear108YearRecord.json","image_url":"https://media.breitbart.com/media/2017/06/AP_17046697164669.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_09_14__1540926520.html","title":"U.S. Immigrant Numbers Hit 44.5 Million, Near 108-Year Record","title_page":"U.S. Immigrant Numbers Hit 44.5 Million, Near 108-Year Record | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The immigrant percentage of the U.S. population has hit 13.7 percent, near the 1910 record of 14.7 percent, according to the latest release by the Census Bureau.\nIn 2017, 13.7 percent of people (one in 7.3 people) in the United States were immigrants, up from 13.5 percent in 2016, and up from 5 percent (one in 20 people) in 1970, according to the bureau’s data.\nThe rising share means 44.5 million people in a population of 325.7 million people were born abroad. That 44.5 million includes roughly 22 million naturalized citizens, 11 million other residents, including more than 1.5 million foreign temporary visa-workers, plus roughly 11 million illegal immigrants, according to the bureau:\nThe millions of migrants are concentrated in the coastal metropolises, such as Los Angeles and New York, but many are migrating into interior states. According to the New York Times:\nNew York and California, states with large immigrant populations, both had increases of less than six percent since 2010. But foreign-born populations rose by 20 percent in Tennessee, 13 percent in Ohio, 12 percent in South Carolina and 20 percent in Kentucky over the same period.\nThe recent inflow includes a rising percentage of Asians from China, Vietnam, India, said the New York Times.\nBrookings Institution analysis of that data shows that 41 percent of the people who said they arrived since 2010 came from Asia. Just 39 percent were from Latin America. About 45 percent were college educated, the analysis found, compared with about 30 percent of those who came between 2000 and 2009.\nThe Asian inflow include includes many college graduates because many of them are immigrating via the various business-backed programs for college-graduate visa-workers.\nThe Census Bureau may have undercounted the number of illegal immigrants, ensuring the immigrant population now exceeds the 1910 percentage, NBC News reported:\nIllegal immigrants can be more difficult for surveyors to locate due to informal living arrangements, and some may avoid being included in surveys for fear of being reported to the government, researchers say. Jeffrey Passel, a demographer at Pew Research Center, has estimated that the actual immigrant population is likely 3 percent to 5 percent higher than the number in the Census Bureau’s American Community Survey.\nA chart by the Washington Post suggests that this huge wave of migrants has changed politics by giving Democrats’ identity-politics ideology an electoral lock in counties where immigrants comprise more than 20 percent of the population:\nThe New York Times report, however, demurely ignored the political and economic impact of this huge wage of workers, consumers, and renters.\nSome economic impacts are obvious, for example, immigrants expand the economy by working, consuming and renting real-estate. Some also raise the productivity of Americans by inventing new products, importing new goods, or develop novel services that allow Americans to produce more wealth or enjoyment per hour.\nBut many less-skilled migrants play their largest role by simply shifting small slices of wealth from person to person, for example, by competing up rents in their neighborhood or by competing down wages in their workplace. The crudest examples can be seen in agriculture.\nEuropean farms tend to buy labor-saving machines from well-paid European manufacturing workers because their farmworkers’ wages are high, but many U.S. farm companies simply use cheap legal and illegal immigrant labor while sharing the savings from not buying machines between profit-seeking investors and penny-counting consumers.\nNext time you enjoy radishes in your salad, remember the farmworkers like these Oxnard workers, who harvest the food that we eat. #WeFeedYou #Calor #Ovetime4FarmWorkers pic.twitter.com/mjICn0nnta — United Farm Workers (@UFWupdates) September 9, 2018\nOf course, that cheap-labor business practice leaves Americans taxpayers to carry the off-work costs of immigrants, such as welfare programs, civic turmoil, Diversity, education costs for migrants’ children, and the occasional murder of an Iowa jogger, a massacre in a Florida nightclub, or the destruction of the Twin Towers in 2011.\nBut the immigration is not happening in a vacuum — it is happening as a vast wave of technology allows companies and investors to move products and assets (such as cheap migrant labor) around the world, at very low cost. This technological change has liberated societies to vastly enrich themselves — see China for example — even as it also seems to centralize power and wealth.\nThere is plenty of data to suggest that this combination of technological change and Congress’ passage of the 1965 immigration law have together since shifted a huge volume of wealth from younger, working Americans towards the older Americans who own real-estate, stocks, or companies.\nThat wage-pressure process began first among the interchangeable, blue-collar, unskilled Americans — such as farm workers — but it is shifting up the economic ladder to hit interchangeable, college-educated Americans. In President Donald Trump’s economy, blue-collar Americans are gaining amid modest restrictions on immigration while middle-class Americans are seeing slower gains as companies import more cheap college-graduates and also export their jobs to expanding foreign populations of clever, hardworking college-graduates.\nThis economic shift is reflected in another important economic change — the declining importance of Americans’ wages and salaries compared to other Americans’ dividends and stock prices. As the New York Times noted September 12:\nData from the Federal Reserve show that over the last decade and a half, the proportion of family income from wages has dropped from nearly 70 percent to just under 61 percent. It’s an extraordinary shift, driven largely by the investment profits of the very wealthy. In short, the people who possess tradable assets, especially stocks, have enjoyed a recovery that Americans dependent on savings or income from their weekly paycheck have yet to see. Ten years after the financial crisis, getting ahead by going to work every day seems quaint, akin to using the phone book to find a number or renting a video at Blockbuster” … In 2016, net worth among white middle-income families was 19 percent below 2007 levels, adjusted for inflation. But among blacks, it was down 40 percent, and Hispanics saw a drop of 46 percent. For many, old-fashioned hard work has simply not been a viable path out of this hole. After unemployment peaked in the fall of 2009, it took years for joblessness to return to pre-recession levels. Slack in the labor market left the employed and unemployed alike with little leverage to demand raises, even as corporate profits surged. Maybe it was inevitable that when half the population watches its wages stagnate while the other half gets rich in the market, the result is President Donald Trump and Brexit.\nUnsurprisingly, many legislators are under severe pressure from donors to preserve the current national economic strategy of growth-by-immigration. In February 2018, for example, a loose alliance of business-first Republicans, pro-migration Democrats, and progressive media blocked President Donald Trump’s “Four Pillars” immigration reforms which would shift the United States back towards a low-immigration/high-wage economy.\nEconomists, investors, talking heads and political advocates in the Democratic and Republican parties are deeply reluctant to draw any connection between the immigration inflow of consumers, workers, and renters, and the economic shift from wages to stocks.\nBut the linkage is often hinted at. For example, Noah Smith, a pro-immigration, pro-diversity writer for Bloomberg News empire, wrote a column in July 2018 saying that the 1924 immigration cutbacks helped create the 1929 crash:\nThe housing crash of the mid-1920s might well have been a direct result of the curtailment of immigration. And if the Great Depression and/or the stock crash of 1929 was caused or exacerbated by that housing crash, there’s a clear and direct link between immigration restriction and the U.S.’s worst economic crisis of the 20th century. The reduction in agglomeration effects reported by Ager and Hansen probably also contributed to lower corporate earnings and sapped vitality in American cities.\nYet Smith is silent about the flip-side of immigration cuts — the impact of the 1965 immigration expansion law, which has added up to 44.5 million consumers, workers and renters to the United States’ marketplace.\nImmigration Economics\nOverall, the Washington-imposed economic policy of economic growth via immigration shifts wealth from young people towards older people by flooding the market with cheap white-collar and blue-collar foreign labor.\nFour million young Americans will join the workforce this year, but the federal government will also import 1.1 million legal immigrants, and allow an army of at least 2 million visa-workers to work U.S. jobs, alongside asylum-claiming migrants and illegal aliens.\nThat flood of outside labor spikes profits and Wall Street values by cutting salaries for manual and skilled labor offered by blue-collar and white-collar employees. The policy also drives up real estate prices, widens wealth-gaps, reduces high-tech investment, increases state and local tax burdens, hurts kids’ schools and college education, pushes Americans away from high-tech careers, and sidelines at least 5 million marginalized Americans and their families, including many who are now struggling with opioid addictions. Immigration also pulls investment and wealth away from heartland states because investment flows towards the large immigrant populations living in the coastal states.\n.","url":"https://www.breitbart.com/politics/2018/09/14/immigrant-numbers-break-108-year-record/"}
