{"authors":[],"date_download":"2018-10-23 04:59:14","date_modify":"2018-10-23 04:59:14","date_publish":"2016-01-11 18:01:27","description":"The United States insisted Monday that aid convoys must have unfettered access to besieged towns in Syria under the terms of the international push to end th...","filename":"data/vaneerConsumption/USinsistsaidmustgotobesiegedSyriantowns.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-702m8-3WAQP5SaQH704788ebcf7e194c33-782_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394336_US-insists-aid-besieged-Syrian-towns_1540270754.html","title":"US insists aid must go to besieged Syrian towns","title_page":"US insists aid must go to besieged Syrian towns | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US insists aid must go to besieged Syrian towns\nThe United States insisted Monday that aid convoys must have unfettered access to besieged towns in Syria under the terms of the international push to end the civil war there.\nSpeaking alongside King Abdullah II of Jordan at the start of the latter's trip to Washington, US Secretary of State John Kerry said all foreign stakeholders in the conflict agreed.\n\"We need full access -- and that's what we agreed on in the ISSG meeting in New York and the UN Security Council and we're raising it to all parties right now,\" he said.\nUS Secretary of State John Kerry speaks January 7, 2016 ©Saul Loeb (AFP/File)\nThe ISSG is the International Syrian Support Group -- 17 nations and three world organizations that are trying to broker peace talks between Bashar al-Assad's regime and rebel forces.\nIt includes Russia and Iran, which back Assad's position, and the United States and Saudi Arabia, which support the opposition and have demanded the strongman step down.\nAs he spoke, the first Red Crescent aid convoy had arrived in the rebel-held town of Madaya, where reports have warned that thousands of civilians face starvation.","url":"https://www.dailymail.co.uk/wires/afp/article-3394336/US-insists-aid-besieged-Syrian-towns.html"}
