{"authors":["David Shepardson"],"date_download":"2018-10-30 21:28:50","date_modify":"2018-10-30 21:28:50","date_publish":"2016-12-20 00:00:00","description":"The government said it has reports of 25 crashes from owners alleging vehicle roll-away.","filename":"data/vaneerConsumption/USinvestigatesFiatChryslervehiclesforrollawaycrashes.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_r-us-investigates-one-million-fiat-chrysler-vehicles-for-roll-away-crashes-2016-12_1540934930.html","title":"US investigates Fiat Chrysler vehicles for roll-away crashes","title_page":"    US investigates Fiat Chrysler vehicles for roll-away crashes - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Fiat Chrysler assembly workers work on partially assembled minivans at the Windsor Assembly Plant in Windsor, Ontario, February 9, 2015. Reuters The U.S. National Highway Traffic Safety Administration is launching an investigation into about 1 million newer Fiat Chrysler Ram pickup trucks and SUVs after receiving complaints the vehicles rolled away after being parked, it said on Tuesday.\nFiat Chrysler Automobiles NV said it is cooperating with the government investigation that covers the 2013-2016 model year Ram 1500 pickup truck and 2014-2016 Dodge Durango SUV. The government said it has reports of 25 crashes from owners alleging vehicle roll-away and 9 injuries and urged drivers to set the parking brake before exiting the vehicles.\nThe vehicles under investigation have an electronic rotary control for driver gear selections that is different to the shifter that Fiat Chrysler recalled earlier this year for roll away issues.\nIn April, Fiat Chrysler recalled more than 1.1 million cars and SUVs worldwide because the vehicles may roll away after drivers exit.","url":"https://www.businessinsider.com/r-us-investigates-one-million-fiat-chrysler-vehicles-for-roll-away-crashes-2016-12"}
