{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 18:42:00","date_modify":"2018-10-30 18:42:00","date_publish":"2017-03-13 12:09:54","description":"A US-Iranian couple have been charged with hosting parties in Tehran, while another couple were given the death penalty for running a \"cult\".","filename":"data/vaneerConsumption/USIranianandWifeChargedoverTehranPartiesProsecutor.json","image_url":"https://media.breitbart.com/media/2017/03/alcohol.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_03_13__1540924920.html","title":"U.S.-Iranian and Wife Charged over Tehran Parties: Prosecutor","title_page":"U.S.-Iranian and Wife Charged over Tehran Parties: Prosecutor","title_rss":"NULL","source_domain":"breitbart.com","text":"TEHRAN (AFP) – A jailed US-Iranian and his wife have been formally charged with hosting parties in Tehran, while another couple were given the death penalty for running a “cult”, the Tehran prosecutor said Monday.\nNo names were given, but the dual national and his wife are thought to be the high-profile owners of an art gallery in the capital that regularly hosted events for dignitaries and foreign diplomats prior to their arrest last summer.\nThe case “is related to a woman and man who provided alcoholic drinks, and encouraged corruption and debauchery by holding mixed parties,” said prosecutor Abbas Jafari Dolatabadi.\nHe said 4,000 litres of alcohol had been found in the basement of their building in northern Tehran.\nThe couple are known to be members of the Zoroastrian religion, who are allowed to have alcohol for private use but are banned from sharing it with Muslims.\nDolatabadi also described a separate case of a couple who “by founding a cult and attracting individuals, were active in sexual deviation.”\nThey were found guilty of “corruption on Earth”, a charge introduced after the 1979 revolution that carries the death penalty.\nWhile moderate President Hassan Rouhani has made good on his vow to improve ties with the West through a deal to curb Iran’s nuclear programme, his promises to ease social restrictions at home have come to nothing.\nIn January, Tehran’s chief prosecutor said as many as 70 “spies” were serving sentences in the city’s prisons — only a handful of which have been made public.\nMany have been dual nationals who also hold a European or US passport — undermining Rouhani’s call for ex-pat Iranians to return home and help rebuild the economy.\nIn October, US-Iranian business consultant Siamak Namazi and his 80-year-old father Baquer, a former UNICEF official, were given 10 years in prison for “espionage and collaboration with the American government”.\nBritain has frequently protested the detention of Nazanin Zaghari-Ratcliffe who was given a five-year sentence for her alleged involvement in 2009 protests, although exact charges have not been published.\nShe was separated from her two-year-old daughter when she was arrested last April, leaving the child stranded with her grandparents in Iran.\nAhead of a likely bid for re-election in May, Rouhani published a new “Charter of Citizens’ Rights” in December, but officials have admitted it has no power over conservative-dominated parts of the power structure such as the judiciary and Revolutionary Guards.","url":"https://www.breitbart.com/middle-east/2017/03/13/u-s-iranian-wife-charged-tehran-parties-prosecutor/"}
