{"authors":[],"date_download":"2018-10-22 21:59:53","date_modify":"2018-10-22 21:59:53","date_publish":"2014-06-07 15:52:06","description":"The meeting will come after the most recent round between Iran and six world powers ran into difficulties last month during a conference in Vienna.","filename":"data/vaneerConsumption/USIranianOfficialsScheduleNewRoundofTalks.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/494356/iran-ejo-60214_152c2db7610e344adc6e5fded11c87c7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_u-s-iranian-officials-schedule-new-round-talks-n125256_1540245593.html","title":"U.S., Iranian Officials Schedule New Round of Talks","title_page":"U.S., Iranian Officials Schedule New Round of Talks","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWASHINGTON/NEW YORK — American and Iranian officials will meet on Monday and Tuesday for talks before the next round of negotiations between Iran and six world powers on Iran's nuclear program, the U.S. State Department said on Saturday.\nThe U.S. delegation will be led by Deputy Secretary of State Bill Burns, who conducted the secret negotiations that helped bring about the Nov. 24 interim nuclear agreement between Iran and the major powers. It will also include the senior U.S. negotiator with Iran, Under Secretary of State Wendy Sherman.\nThe meeting comes after the most recent round of nuclear talks between Iran and the six powers in Vienna last month ran into difficulties, with both sides accusing the other of having unrealistic demands in negotiations aimed at curbing Tehran's atomic program in exchange for an end to sanctions.\nThe U.S. decision to head to Geneva and meet with the Iranian delegation, which a senior U.S. official said might be led by Iranian Deputy Foreign Minister Abbas Araqchi, appeared to highlight Washington’s desire to break the deadlock.\n\"We’ve always said that we would engage bilaterally with the Iranians if it can help advance our efforts, in active coordination with the P5+1,\" the U.S. official told Reuters.\nThe official said the talks next week were not negotiations.\n\"These are really consultations to exchange views in advance of the next negotiating round in Vienna,\" the official said.\nThe United States is set to join the other members of the six-power negotiating group known as the P5+1 — Britain, China, France, Germany and Russia — and Iran in Vienna for a full round of negotiations June 16-20.\n— Reuters","url":"https://www.nbcnews.com/news/world/u-s-iranian-officials-schedule-new-round-talks-n125256"}
