{"authors":["Hannah Al-Othman For Mailoline"],"date_download":"2018-10-23 00:58:52","date_modify":"2018-10-23 00:58:52","date_publish":"2017-03-16 10:34:32","description":"A new report published by the International Narcotics Control Board, measures the global use of opioids, around the world, and found that Americans are being prescribed huge numbers of opiates.","filename":"data/vaneerConsumption/USistheWORSTcountryintheworldforabuseofheroin.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54174900000578-0-image-a-6_1489670130929.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319448_US-WORST-country-world-abuse-heroin_1540256332.html","title":"US is the WORST country in the world for abuse of heroin","title_page":"US is the WORST country in the world for abuse of heroin | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The United States is now the worst country in the world for the abuse of heroin and other opiates, a study has found.\nA new report published by the International Narcotics Control Board measures the global use of opioids, the class of powerful drugs which includes heroin and many of the strongest prescription painkillers, around the world.\nThe report found that Americans are being prescribed opioids much more frequently than citizens in any other country.\nIt also concluded that US citizens, despite making up only five per cent of the global population, are consuming more than 99 per cent of the world’s supply of hydrocodone.\nThis graph shows how more opioids have been prescribed\nThe report also found that Americans are being prescribed six times more opiates than those living in Portugal or France.\nOpiates include strong painkillers like oxycodone, hydrocodone, codeine, morphine, and fentanyl.\nOpioids are highly addictive drugs, which affect parts of the brain that control both pain and emotions, encouraging the production of dopamine and producing a rush of euphoria.\nThe addictive nature of the high-potency drugs combined with over-prescription and their recreational use, have led to a staggering number of opiate-related deaths.\nAccording to CNN, 33,091 Americans died of an opioid overdose in 2015, while an average of 91 continue to die every day.\nWriting about the report for the Washington Post, Stanford psychiatrist Keith Humphreys, said the high use of opioids among Americans is not down to an ageing population or the fact that they have objectively more aches and pains.\nThe United States is now the worst country in the world for the abuse of heroin and other opiates, a new report has found\nHe says it is instead down to lax drug marketing regulations, as well as the fact that 'relative to Europeans, Americans have more faith that life is perfectible' - the belief that all pain can be avoided.\nHumphreys said: 'One might think that Americans consume more opioids because as an aging population, they have objectively more aches and pains.\n'Countries with a much higher proportion of senior citizens than the United States, such as Australia and Italy, consume only a fraction of the prescription opioids of Americans.\n'None of this means that some Americans don’t have a legitimate need for opioids, nor that US doctors sometimes don’t prescribe opioids when they should.\n'But it does suggest that before launching into hysteria that the recent, small drops in opioid prescribing reflect a “war on pain patients,” we should recognize that US consumption dwarfs that of other developed countries that have older populations with better access to prescribing health-care providers.'","url":"https://www.dailymail.co.uk/news/article-4319448/US-WORST-country-world-abuse-heroin.html"}
