{"authors":[],"date_download":"2018-10-23 02:46:21","date_modify":"2018-10-23 02:46:21","date_publish":"2017-03-16 13:23:16","description":"New claims for US unemployment insurance edged downwards in mid-March, continuing a record stretch of low-levels, the Labor Department reported Thursday.With...","filename":"data/vaneerConsumption/USjoblessclaimsdipinmidMarch.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/13/wire-228569-1489670598-918_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4320282_US-jobless-claims-dip-mid-March_1540262781.html","title":"US jobless claims dip in mid-March","title_page":"US jobless claims dip in mid-March | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The tightening labor market has seen employers forgo layoffs out of fear they may not be able to replace the workers they let go\nNew claims for US unemployment insurance edged downwards in mid-March, continuing a record stretch of low-levels, the Labor Department reported Thursday.\nWith an unemployment rate below five percent since May, the tightening labor market has seen employers forgo layoffs out of fear they may not be able to replace the workers they let go.\nThough they can see large week-to-week swings, jobless claims can be used to gauge the prevalence of layoffs and the health of labor markets.\nFor the week ending March 11, initial claims for unemployment insurance fell by 2,000 to 241,000, seasonally adjusted, a result largely in line with analyst expectations, and retracing a small part of the prior week's jump.\nThe result marks seven consecutive weeks with claims below 250,000.\nThe less volatile four-week moving average was essentially flat, up just 750 to 237,250, having remained below 250,000 for nine weeks.\nJobless benefits claims have been below 300,000 for more than two years, a streak not recorded since 1970.","url":"https://www.dailymail.co.uk/wires/afp/article-4320282/US-jobless-claims-dip-mid-March.html"}
