{"authors":[],"date_download":"2018-10-22 21:26:25","date_modify":"2018-10-22 21:26:25","date_publish":"2014-05-07 00:06:26","description":"As Congress drags its feet over curbing carbon emissions, the rest of the world isn't waiting to come up with solutions to tackle climate change.","filename":"data/vaneerConsumption/USLagsinCarbonTaxtoFightClimateChange.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/424936/climate-change-china_71c086f6f3dab67389656ef8444c69d9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_energy_u-s-lags-carbon-tax-fight-climate-change-n98731_1540243585.html","title":"U.S. Lags in Carbon Tax to Fight Climate Change","title_page":"U.S. Lags in Carbon Tax to Fight Climate Change","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAs Congress continues to drag its feet over curbing carbon emissions, the rest of the world isn't waiting to come up with solutions to tackle climate change.\nThe latest call for action on climate change came Tuesday in a comprehensive White House report on the dire consequences of inaction. Citing the diverse economic impact of climate change — from oyster growers in Washington state to maple syrup producers in Vermont — the National Climate Assessment warned that the bill for decades of unchecked carbon emissions is already coming due.\nAnd while potential solutions to reverse the process have been mired in Congress for over a decade, much of the developed world has already begun implementing measures to slow carbon emissions.\nThose measures are taking several forms, but all rely on the simple economics of attaching a price to emitting carbon dioxide into the atmosphere.\n\"This is not about picking winners or subsidizing alternatives,\" said Gernot Wagner, a senior economist at the Environmental Defense Fund. \"All of these things are important. But the primary instrument — the one and only instrument — is to price CO2 and get out of the way.\"\nThe power of 'cap and trade' schemes\nThat's the idea behind the so-called \"cap and trade\" schemes that have emerged over the past decade to reward companies that cut carbon emissions and raise the cost for those that don't. Under cap and trade, a government issues companies permits to produce a set amount of carbon emissions each year, and then gradually reduces the amounts that can be produced. Companies that figure out how to cut emissions faster can then sell their credits to companies that exceed the cap.\nOne of the oldest and best established cap and trade schemes is in place in Europe, covering roughly half of all carbon emissions produced by 11,000 companies and power plants throughout the European Union. Though permits were initially given away for free, the plan began auction sales last year. The scheduled caps — if left in place — would cut emissions 20 percent below 2005 levels by the end of this decade, with a 70 percent reduction by the middle of this century.\nThe Japanese government has slapped caps on some 1,400 large carbon emitters in Tokyo with a goal of cutting 25 percent of 1990-level output by the end of the decade. Two years ago, Australia slapped carbon limits on 300 of the country's biggest polluters, which pay a tax for each ton of carbon dioxide produced. A trading scheme is set to begin next year; the EU has agreed to link its system with Australia's by 2018.\nProposals for federal limits on carbon have been mired in an intense lobbying battle among U.S. energy producers and consumers for more than a decade.\nIn China, where explosive growth has produced some of the world's most polluted urban skylines, pilot cap and trade programs have been rolled out in seven provinces and cities, including Beijing, Chongqing, Guangdong, Hunan, Shanghai, Shenzhen and Tianjin. Additional pilot programs are planned for 2016, but a national system is not expected until at least before the end of the decade.\nIndia is rolling out cap and trade this year covering more than half the country's industrial energy consumption. South Korea, Thailand, Vietnam, Mexico, Taiwan and New Zealand also have announced cap and trade programs at various stages of rollout.\nAnd while there is no federal limit on carbon dioxide in the U.S., carbon caps are gradually taking hold at the state level. Launched last year, California's cap and trade program covers plants and manufacturing and will be expanded to cover transportation fuel next year. Polluters get permits covering 90 percent of their emissions that then buy additional credits at state-run auction.\nA more limited program is in place in the northeast U.S., where nine states in 2009 launched a program to cut power plant emissions 10 percent below 2009 levels by 2018.\nBut proposals for federal limits on carbon have been mired in an intense lobbying battle among U.S. energy producers and consumers for more than a decade. Coal and oil producers have fought hard to block the program, while clean energy producers such as nuclear and solar power producers have supported it.\nThough the proposal to put a price on carbon generated some momentum in the last presidential election, \"the financial crisis basically put an end to that, because it was such an immediate concern,\" said Michael Peltz, editor of Institutional Investor.\nSince then, the White House has largely decided to move ahead on its own, unveiling a climate action plan a year ago that focuses on executive orders the president can make without Congressional approval.\nEven without a federal cap, many American companies are already factoring in the rising, long-term cost of carbon emissions. Much of that effort has come in response to pressure from investors who are trying to determine the financial impact on the corporate bottom line.\n\"If you go out and look at most of the largest global companies they're publishing sustainability reports, they're providing information ... on what their carbon footprint is, what their energy expenses are,\" Peltz said.\nThat's due, in part, to the work of groups such as CDP (formerly the Climate Disclosure Project), a London-based nonprofit that collects and publishes information on corporate sustainability programs. In its latest report, the group found that 84 percent of its list of global 500 companies had set carbon emissions targets and some three-quarters of them had reduced emissions in some areas of their business.","url":"https://www.nbcnews.com/business/energy/u-s-lags-carbon-tax-fight-climate-change-n98731"}
