{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:37:50","date_modify":"2018-10-30 20:37:50","date_publish":"2015-09-03 18:36:48","description":"The CIA and U.S. Special Operation forces have begun a secret drone campaign to kill terrorism suspects in Syria deemed “high-value targets.\"","filename":"data/vaneerConsumption/USLaunchesSecretDroneCampaignInSyria.json","image_url":"https://media.breitbart.com/media/2015/05/ap_ap-photo497-e1434806465610.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_09_03__1540931870.html","title":"U.S. Launches Secret Drone Campaign In Syria","title_page":"WaPo: U.S. Launches Secret Drone Campaign In Syria","title_rss":"NULL","source_domain":"breitbart.com","text":"The CIA, in collaboration with U.S. Special Operation forces, has embarked on a secret drone campaign to track and kill terrorism suspects in Syria deemed “high-value targets,” namely senior Islamic State (ISIS/ISIL) jihadists, The Washington Post has learned from U.S. officials.\nAccording to The Washington Post (WaPo) article, the secret drone offensive was launched as a component of a targeted killing program that is operated separately from the broader U.S.-led airstrike campaign against ISIS.\nThe unnamed U.S. officials told WaPo that “the CIA and the Joint Special Operations Command (JSOC) are flying drones over Syria in a collaboration responsible for several recent strikes against senior Islamic State operatives… among those killed was a British militant thought to be an architect of the terrorist group’s effort to use social media to incite attacks in the United States.”\n“The clandestine program represents a significant escalation of the CIA’s involvement in the war in Syria, enlisting the [CIA] agency’s Counterterrorism Center (CTC) against a militant group that many officials believe has eclipsed al-Qaeda as a threat,” notes The Post.\nUnder the secret campaign, aimed at what officials have deemed “high value” terror suspects, the strikes are being carried out exclusively by JSOC, while the CIA’s CTC has been charged with identifying and locating the targets — senior ISIS jihadists.\nJSOC is overseen by the U.S. Special Operations Command.\nU.S. officials told The Post that the joint CIA-JSOC program “is aimed primarily at leadership figures in the Islamic State as well as operatives suspected of being involved in efforts to build a terrorist network beyond the borders of its declared caliphate [in Iraq and Syria],” adding that “Al-Qaeda militants also are approved targets.”\nSpokespersons for the CIA and the U.S. Special Operations Command declined to comment on the drone operation, points out WaPo, adding that other officials familiar with the program agreed to only discuss it on the condition of anonymity.\n“The decision to enlist the CIA and JSOC reflects rising anxiety among U.S. counterterrorism officials about the danger the Islamic State poses, as well as frustration with the failure of conventional strikes to degrade the group’s strength,” reports The Post.\n“Against that backdrop, the Obama administration has turned again to two of its preferred weapons against terrorist groups: the [CIA’s] CTC, which pioneered the use of armed drones and led the search for Osama bin Laden, and JSOC, which includes the elite commando unit that carried out the raid that killed the al-Qaeda chief,” it adds.\nSo far, only a tiny portion of the 2,450-plus strikes conducted in Syria over the past year can be attributed to the drone campaign.\n“The involvement of the CIA complicates one of President Obama’s remaining counterterrorism policy goals of gradually reversing the agency’s evolution from spy service to paramilitary force,” notes The Post.\nIn 2014, President Obama announced his intent to shift the control of drone operations away from the CIA to the Pentagon, shifting the spy agency’s focus back to more traditional espionage missions.\nPresident Obama remains committed to increasing the transparency of counterterrorism operations by “turning to the U.S. military to take the lead and to provide information to the public,” Peter Boogaard, a spokesman for the White House National Security Council, told The Post.\nHowever, without specifically commenting on operations in Syria, he added that the effort will be “carried out in a manner that does not degrade our ability to leverage the full range of counterterrorism capabilities.”\nObama administration officials consider the CIA-Joint Special Operations Command hybrid approach in Syria as a potential venue to salvage at least part of Obama’s plan to transfer drone strike operations to the U.S. military.\nThe [CIA] agency is expected to remain deeply involved in “finding and fixing” terrorism targets while working with JSOC, but will leave the actual strikes to the military, at least in Syria, officials told The Post.\n“All of the strikes in Syria are being carried out under the military’s post-9/11 authority to pursue al-Qaeda, officials said, rather than a presidential directive or ‘finding’ issued to the CIA,” adds the article. “The restriction means that armed CIA drones can be fired only if they are operating under JSOC authority.”","url":"https://www.breitbart.com/national-security/2015/09/03/wapo-u-s-launches-secret-drone-campaign-to-kill-isis-leaders-in-syria/"}
