{"authors":[],"date_download":"2018-10-22 21:13:57","date_modify":"2018-10-22 21:13:57","date_publish":"2014-05-06 16:14:26","description":"Somalia may be the worst place to be a mother, but the U.S. is losing ground against other countries and gets just middling scores from health groups.","filename":"data/vaneerConsumption/USLosesGroundinReportsonMotherhood.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/411396/140430-mothers-save-the-children-chad-3p_20fb1cd6dc0a49d9310e37b3e53ee981.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_womens-health_u-s-loses-ground-reports-motherhood-n98271_1540242837.html","title":"U.S. Loses Ground in Reports on Motherhood","title_page":"U.S. Loses Ground in Reports on Motherhood","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSomalia is the worst place in the world to be a mother, a new report finds, and women and children are 14 times more likely to die in a disaster than men are. Women from rich countries are usually way better off, with one glaring exception: the United States.\nA batch of new reports on women and children shows the U.S. is moving in the wrong direction, with an increase in pregnancy and birth-related deaths linked to poor prenatal care and conditions such as obesity and diabetes.\n“American women face the same risk of maternal death as their counterparts in Iran or Romania,” Save the Children says in its annual report on mothers and children, released Monday.\nAnother report, this one from the United Nations, shows things can get better. The U.N. survey shows maternal deaths have fallen 45 percent globally since 1990. In 1990, 523,000 women died from complications of pregnancy or childbirth; last year, 289,000 women did.\n“American women face the same risk of maternal death as their counterparts in Iran or Romania.\"\nAfghanistan is one great example of improvement, says Save the Children’s president and CEO Carolyn Miles. “They were actually the worst place to be a mother in 2010. They moved up 30 places in 2013,” Miles told NBC News.\nHow? “They invested in community health workers so that moms actually had people there when they were delivering,” she said. “Women had been just dying in childbirth, and after that change, the maternal mortality rate came down.” Afghanistan’s standing in the Save the Children report also improved because of investments in education for girls, she said.\nDespite improvements, the reports all show the same thing – thousands of women and children dying. “Each day, 800 mothers and 18,000 young children die from largely preventable causes,” Save the Children says.\nIn most of the world conflict or natural disasters are to blame: war in Syria and Afghanistan, a typhoon in the Philippines, continued unrest in the Democratic Republic of Congo and Somalia.\n“Violence and conflict have uprooted more families than at any time on record. By the end of 2012, more than 45 million people worldwide were forcibly displaced due to conflict or persecution,” Save the Children says in its report.\n“Syria’s civil war now in its fourth year has had a devastating impact on mothers and children. Almost 1.4 million children and 690,000 women have fled the conflict and become refugees in neighboring countries, while over 9 million people inside Syria are in need of lifesaving humanitarian assistance. Estimates suggest as many as 1,000 women and children a month have been killed in the conflict.”\nPolio and measles have made a comeback as vaccination campaigns fall apart, the report adds.","url":"https://www.nbcnews.com/health/womens-health/u-s-loses-ground-reports-motherhood-n98271"}
