{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:30:11","date_modify":"2018-10-30 20:30:11","date_publish":"2015-08-20 02:40:32","description":"The United States may take additional measures to ensure the protection of its lightly equipped force in Egypt’s Sinai Peninsula.","filename":"data/vaneerConsumption/USMayTakeActiontoProtectForce.json","image_url":"https://media.breitbart.com/media/2015/08/egyptian-armed-forces-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_08_19__1540931411.html","title":"U.S. May Take Action to Protect Force","title_page":"Pentagon on Sinai: U.S. May Take Action to Protect Force","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON D.C.—The United States may take additional measures to ensure the protection of its lightly-equipped peacekeeping force in Egypt’s Sinai Peninsula, said a Pentagon spokesperson.\nHis comments came in response to Breitbart News asking him about a recent report from the Associated Press (AP) suggesting that the U.S. is considering pulling out its Sinai force in response to a growing threat from the Islamic State (ISIS/ISIL) and other jihadist groups operating in the area.\nThe Pentagon did not explicitly deny that the U.S. may end up withdrawing the estimated 700 American Army soldiers who are currently in the Sinai.\nFor more than three-decades, the U.S. troops in the Sinai and their international counterparts, known as the Multinational Force and Observers (MFO), have been helping ensure that Egypt and Israel adhere to the terms of the peace treaty signed by the two countries in 1979. The U.S. troops in the peninsula are reported to have little offensive capability.\nSenior administration officials, speaking on condition of anonymity, told AP that the Obama administration has been “quietly” conducting an “inter-agency review” of the U.S. posture in the Sinai Peninsula, “fearful the lightly equipped peacekeepers could be targets of escalating Islamic State-inspired violence.”\nOptions being considered by the Obama administration include bolstering U.S. troop protection or withdrawing them altogether, the officials told AP.\nThe AP report emerged after an Aug. 11 editorial from the New York Times suggested that the U.S. should consider pulling out its peacekeeping troops from the Sinai.\nBreitbart News specifically asked the Pentagon if the U.S. was considering withdrawing its troops from Sinai.\n“The US supports the role being played by the Multinational Force and Observers [MFO] in supporting the Treaty of Peace between Israel and Egypt. In light of the security situation in parts of Northeastern Sinai, we are considering what, if any, additional measures might be needed to ensure force protection,” responded U.S. Army Maj. Roger Cabiness II, a Department of Defense (DoD) spokesman.\n“This includes bringing in additional equipment if necessary. The US will continue to consult closely with the Government of Egypt, the Government of Israel, and with the MFO on any potential additional measures,” he continued.\nThe Pentagon spokesman did not mention the complete withdrawal option.\nWhen Breitbart News pressed him again on whether or not the U.S. was considering pulling out of the Sinai, Maj. Cabiness said, “The safety and security of US forces remains our priority, and we are always considering what steps are necessary to ensure their protection. We will always be vigilant when it comes to the safety of our service-members.”\nThe U.S. peacekeeping force is reportedly ill-equipped.\n“Armed primarily with light weapons, armored personnel carriers and similarly limited material, the forces lack the capacity to take on Islamic State or other militants across the sparsely populated, desert territory,” reports AP. “As a result, officials said, the Obama administration has been conducting an ‘inter-agency review’ of the US posture in the Sinai.”\nThe presence of two American military units is legally mandated by the Camp David Accords, which led to the signing of the peace treaty between Egypt and Israel.\nHowever, the U.S. can reportedly withdraw its troops, at least temporarily, if they are in imminent danger.\nOne administration official told AP that the U.S. does not believe the American peacekeeping troops are facing an imminent threat.\n“The US is concerned over deteriorating security conditions in an area of northeastern Sinai where Egyptian security forces as well as civilian and military elements of the MFO, including the US military forces stationed at the MFO North Camp, are exposed to potential risk,” acknowledged Mark Toner, a State Department spokesman.\nHe said the U.S. was working with Egypt’s government to address the threat faced by the American soldiers.\n“Egypt has battled militants in northern Sinai for years, but attacks against its military and police have expanded since the July 2013 coup of Islamist President Mohammed Morsi, with the Islamic State affiliate based in Sinai claiming responsibility for several large-scale assaults,” notes AP. “Egypt’s army under current President Abdel-Fattah el-Sissi is trying to snuff out the insurgency.”\n“Islamic extremists may claim the U.S. withdrawal as a victory. Regional allies already wearied by a U.S.-led nuclear pact with Iran and America’s limited military engagement in Iraq and Syria could see any step away from the Sinai as further evidence that President Obama wants out of the Middle East,” it adds. “And without the U.S. contingent, it is unlikely the Multinational Force and Observers… would be able to sustain itself much longer.”","url":"https://www.breitbart.com/national-security/2015/08/19/pentagon-on-sinai-withdrawal-u-s-may-take-action-to-ensure-force-protection/"}
