{"authors":["Paddy Dinham For Mailonline"],"date_download":"2018-10-23 01:23:26","date_modify":"2018-10-23 01:23:26","date_publish":"2017-03-10 09:31:37","description":"A US marine who asked his colleague to demonstrate a 'brachial stun' was shown perhaps a better example than he expected - as he is knocked clean out.","filename":"data/vaneerConsumption/USMarineknockshiscolleagueoutwithbrachialchop.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21E12400000578-0-image-a-3_1489138176781.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300350_US-Marine-knocks-colleague-brachial-chop_1540257806.html","title":"US Marine knocks his colleague out with 'brachial chop'","title_page":"US Marine knocks his colleague out with 'brachial chop' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A US marine who asked his colleague to demonstrate a 'brachial stun' was shown perhaps a better example than he expected - as he is knocked clean out.\nThe two men were caught on camera practicing the move, and it proves to have devastating effect.\nDressed in matching green Marine t-shirts, the more experienced of the pair is showing his friend how to perform the karate-style chop to his brachial plexus, around the area where the shoulder meets the neck.\nThe Marine on the left, facing the camera, gets knocked out by his colleague when he asks to have a move demonstrated on him\n'You've got to show me,' the rookie eagerly asks his teacher, who duly shows him a couple of practice shots through the air so he can mimic the technique.\nBut he seals his own fate when he says: 'How hard do you have to hit them, though? Demonstrate it on me.'\nWithout hesitation the more experienced Marine assumes the position and chops him right on the pressure point.\nDressed in matching green Marine t-shirts, the more experienced of the pair is showing his friend how to perform the karate-style chop to his brachial plexus\nHe is immediately knocked out cold, and his legs completely crumple beneath him after the demonstration\nHe slumps backwards before coming to rest with his face against the door, as he friend laughs hysterically\nDespite his huge frame, the learner's legs immediately give way and he slumps backwards before coming to rest with his face against the door, as his friend laughs hysterically.\nThe hilarious video, the location of which is unclear, was originally uploaded to YouTube in 2010, but re-emerged this week.","url":"https://www.dailymail.co.uk/news/article-4300350/US-Marine-knocks-colleague-brachial-chop.html"}
