{"authors":["Associated Press"],"date_download":"2018-10-23 03:10:33","date_modify":"2018-10-23 03:10:33","date_publish":"2016-01-28 18:28:02","description":"CAPE CANAVERAL, Florida (AP) — Dozens of educators who competed alongside Christa McAuliffe to become the first teacher in space gathered Thursday to remembe...","filename":"data/vaneerConsumption/USmarks30thanniversaryofshuttleChallengerdisaster.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:e1a4ce2f9f544c9fa1f5a53007ffe76f-4PuZeKVXE7cd9005b2c876034d67-910_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421435_US-marks-30th-anniversary-shuttle-Challenger-disaster_1540264233.html","title":"US marks 30th anniversary of shuttle Challenger disaster","title_page":"US marks 30th anniversary of shuttle Challenger disaster | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US marks 30th anniversary of shuttle Challenger disaster\nCAPE CANAVERAL, Florida (AP) — Dozens of educators who competed alongside Christa McAuliffe to become the first teacher in space gathered Thursday to remember the seven astronauts who perished aboard Challenger 30 years ago.\nThey still believe strongly in what McAuliffe hoped to accomplish aboard Challenger before disaster struck during liftoff on Jan. 28, 1986.\nNames of the Challenger dead were read during the memorial service. The former astronaut reciting the names of all 24 astronauts killed in the line of duty over the years, Jon McBride, had to fight back tears.\nThe awful moment, just 73 seconds after take off, that the shuttle exploded on January 28 1986 as 17 per cent of the American population watched on in horror\nClose to 40 of the 113 remaining semifinalists for teacher-in-space traveled to Cape Canaveral for the anniversary, the biggest gathering ever for a NASA memorial like this.\nAnother first: McAuliffe's son, Scott, 39, took part in the ceremony. He said having his own two sons there with him, ages 6 and 8, made it easier.\nThe crowd numbered close to 400 and included family members of astronauts killed in all three of NASA's spacecraft tragedies: Challenger; Columbia's catastrophic descent on Feb. 1, 2003; and the Apollo 1 fire on Jan. 27, 1967.\nSteven McAuliffe still declines interviews about his late wife Christa, but he noted in a statement that although 30 years have passed, \"Challenger will always be an event that occurred just recently. Our thoughts and memories of Christa will always be fresh and comforting.\"\nA leak in the right booster doomed the ship; unusually cold weather that morning left Challenger's booster rockets with stiff O-ring seals.\nBesides Christa McAuliffe, the Challenger dead include pilot Michael Smith, Judith Resnik, Dick Scobee , Ronald McNair, Ellison Onizuka and Gregory Jarvis.\n___\nOnline:\nChallenger Center: http://www.challenger.org/\nNASA: http://www.history.nasa.gov/sts51l.html\nA million pieces: Ebeling knew the weather in Florida was too cold for a safe launch of the Challenger space shuttle on January 28, 1986\nFILE - This photo provided by NASA shows the crew of the Space Shuttle Challenger mission 51L. All seven members of the crew were killed when the shuttle exploded during launch on Jan. 28, 1986. Front row from left are Michael J. Smith, Francis R. (Dick) Scobee, and Ronald E. McNair. Front row from left are Ellison Onizuka, Christa McAuliffe, Gregory Jarvis, and Judith Resnik. (NASA via AP)\nThe crew members walked out to the launch pad at Kennedy Space Center in Cape Canaveral for the fateful launch\nFILE - In this Jan. 28, 1986 file picture, spectators at the Kennedy Space Center in Cape Canaveral, Fla. react after they witnessed the explosion of the space shuttle Challenger. (AP Photo/File)\nFILE - This Jan. 28, 1986 file picture shows U.S. President Ronald Reagan in the Oval Office of the White House after a televised address to the nation about the space shuttle Challenger explosion. (AP Photo/Dennis Cook)\nFILE - In this series of Jan. 28, 1986 photos, the space shuttle Challenger explodes shortly after lifting off from the Kennedy Space Center in Cape Canaveral, Fla. A family from Michigan watches the explosion from Shepard Park in Cocoa Beach. (Malcolm Denemark/Florida Today via AP) NO SALES; MANDATORY CREDIT\nFILE - In this Friday, Jan. 28, 2011 file photo, June Scobee Rodgers, widow of Dick Scobee, commander of space shuttle Challenger, looks upward during the playing of the National Anthem at a remembrance ceremony to mark the 25th anniversary of the Challenger explosion at the Kennedy Space Center visitor complex in Cape Canaveral, Fla., Friday, Jan. 28, 2011. On the 30th anniversary of the space shuttle Challenger accident, June Scobee Rodgers _ widow of Challenger commander Dick Scobee and longtime spokeswoman for the families of the lost astronauts _ is passing the torch to daughter Kathie. (AP Photo/John Raoux)","url":"https://www.dailymail.co.uk/wires/ap/article-3421435/US-marks-30th-anniversary-shuttle-Challenger-disaster.html"}
