{"authors":["Ildefonso Ortiz"],"date_download":"2018-10-30 22:19:21","date_modify":"2018-10-30 22:19:21","date_publish":"2014-12-23 18:39:13","description":"A disabled man from California has been sent to prison for using his wheelchair and special van to smuggle weapons and ammunition for the infamous Knights |","filename":"data/vaneerConsumption/USManUsedWheelchairtoSmuggleGunsforMexicanCartel.json","image_url":"https://media.breitbart.com/media/2014/12/Screen-Shot-2014-12-23-at-12.38.11-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_12_23__1540937961.html","title":"US Man Used Wheelchair to Smuggle Guns for Mexican Cartel","title_page":"US Man Used Wheelchair to Smuggle Guns for Mexican Cartel","title_rss":"NULL","source_domain":"breitbart.com","text":"A disabled man from California has been sent to prison for using his wheelchair and special van to smuggle weapons and ammunition for the infamous Knights Templar cartel.\nA U.S. District judge in San Diego sentenced 53-year-old Sergio Garcia Rico to five years and eight months in prison last week; the prison term will be followed by a term of supervised release which is similar to probation, court records obtained by Breitbart Texas revealed.\nGarcia had pleaded guilty to drug conspiracy and weapon smuggling charges in August in an apparent deal with prosecutors. The case against him began when officers with U.S. Customs and Border Protection at the Otay Mesa International Bridge stopped the quadriplegic man on a southbound inspection, court documents revealed.\nWhile inspecting the vehicle CBP and Border Patrol agents found thousands of ammunition rounds hidden inside his electric wheelchair as well as firearms and firearm parts stashed inside the special equipment that Garcia used to get in and out of the van with his wheelchair.\nCourt records obtained by Breitbart Texas show that Garcia would buy the weapons at local gun shows and then smuggle them into Mexico where he would sell them to members of the Knights Templar.\nThe Knights Templar is the name now used by the members of the ultra-violent cartel once known as La Familia Michoacana which rules the Mexican state of Michoacan and its members have mastered the production of methamphetamines. Unlike other cartels, the Knights Templar follow a religious doctrine spelled out in a manifesto where its members believe they are holy warriors. The cartel has earned a name for their brutal executions and according to Mexican law enforcement sources its members have been known to practice ritual sacrifices as well as in some cases cannibalism.\nFollow Ildefonso Ortiz on Twitter and on Facebook.","url":"https://www.breitbart.com/border/2014/12/23/us-man-used-wheelchair-to-smuggle-guns-for-mexican-cartel/"}
