{"authors":["Press Association"],"date_download":"2018-10-22 23:07:23","date_modify":"2018-10-22 23:07:23","date_publish":"2017-04-26 06:49:09","description":"Donald Trump has told reporters he might be willing to wait until September for the border wall´s funding.","filename":"data/vaneerConsumption/USMexicowalldemandseasedasspendingtalksadvance.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/10/wire-464223-1493198954-562_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4446356_US-Mexico-wall-demands-eased-spending-talks-advance_1540249643.html","title":"US-Mexico wall demands eased as spending talks advance","title_page":"US-Mexico wall demands eased as spending talks advance | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Congressional negotiators have inched towards a potential agreement on a catch-all spending bill that would deny President Donald Trump’s request for immediate funding to construct a wall along the Mexico border.\nThe emerging measure would increase the defence budget and eliminate the threat of a government shutdown on Mr Trump’s 100th day in office this Saturday.\nTop Senate Democrat Chuck Schumer said Republican negotiators were following the lead of Mr Trump, who signalled on Monday evening that he would not insist on one billion dollar-worth (£800 million) of wall funding now as an addition to the one trillion dollar-plus (£800 billion) spending bill.\nGood for the US that @POTUS is taking the wall off the table in negotiations. Now negotiators can continue working on outstanding issues. — Chuck Schumer (@SenSchumer) April 25, 2017\nMr Trump told a gathering of conservative media reporters that he might be willing to wait until September for the funding.\nOther stumbling blocks remain, but the decision by Mr Trump and his Republican allies to back down on the wall steered the talks on the spending measure in a positive direction.\nSenate majority leader Mitch McConnell said he was optimistic the talks would produce “an agreement in the next few days”.\nDon't let the fake media tell you that I have changed my position on the WALL. It will get built and help stop drugs, human trafficking etc. — Donald J. Trump (@realDonaldTrump) April 25, 2017\nAn existing temporary funding bill expires on Friday at midnight and all sides anticipated that another stopgap measure would be required to buy time for the House and Senate to process the massive spending bill, which would wrap together 11 unfinished agency spending bills through September.\nMr Trump campaigned throughout the country last year promising a wall across the entire 2,200-mile southern border, promising that Mexico would pay for it. But while the idea is a priority of Mr Trump’s most fervent supporters, it is resolutely opposed by Democrats and even many Republicans, who see it as wasteful and who prefer other steps like new technologies and additional border agents to curb illegal immigration.\n“I support additional border security funding,” said Senator Lindsey Graham, a critic of Mr Trump who dined with the president on Monday at the White House. “But a 2,200-mile wall, I don’t think there’s a whole lot of support for it.”\nDonald Trump\nMr Trump vowed to fight for the wall.\n“The wall is going to get built,” he said at the White House on Tuesday. Asked when, he said, “Soon.”\nDemocrats vowed not to give up, either, and look forward to the fight.\n“It’s not a negotiation,” Mr Schumer said. “No wall.”\nDonald Trump\nMeanwhile, Mr Trump appeared poised to procure about 15 billion dollar (£11.6 billion) to boost the military. Democrats said they were satisfied with the emerging outlines of the measure, which stick closely to versions of the legislation that were being negotiated late last year.\nSenator Patty Murray observed that Republican negotiators “have simply ignored” a roster of “18 billion dollar in extreme cuts” offered by White House budget director Mick Mulvaney to lower the measure’s cost. The measure would also while maintain foreign aid accounts that Mr Trump has targeted, along with a series of grant programmes popular with politicians in both parties, such as community development block grants.","url":"https://www.dailymail.co.uk/wires/pa/article-4446356/US-Mexico-wall-demands-eased-spending-talks-advance.html"}
