{"authors":["Abc News","More Luis"],"date_download":"2018-10-30 00:50:43","date_modify":"2018-10-30 00:50:43","date_publish":"2018-10-29 13:01:47","description":"The U.S. military is preparing to send at least as 5,200 active duty troops to the southwest border ahead of the anticipated arrival of a migrant caravan.","filename":"data/vaneerConsumption/USmilitarytosend5200troopshelicoptersheavyequipmenttoborder.json","image_url":"https://s.abcnews.com/images/US/guardsmen-border-02-gty-jrl-180509_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Politics_us-military-readyi_c0e5f6a7091eff8109ab8cc788735add_story_id=58830081_1540860643.html","title":"US military to send 5,200 troops, helicopters, heavy equipment to border","title_page":"US military to send 5,200 troops, helicopters, heavy equipment to border - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"The U.S. military announced Monday that, by the end of the week, it will send 5,200 active duty troops to the southwest border, as well as helicopters and heavy equipment to build new barriers, to meet a request from the Department of Homeland Security to augment resources in anticipation of the arrival of two caravans of migrants currently in Mexico.\nInterested in Immigration? Add Immigration as an interest to stay up to date on the latest Immigration news, video, and analysis from ABC News. Add Interest\nThe deployment of active duty service members was triggered by President Trump’s remarks last week that he wanted the military to get involved in dealing with the caravan of migrants from Central America.\nOn Monday, Trump, who has made the caravan and immigration a top issue ahead of the midterm elections, tweeted that the caravan of migrants included \"Many Gang Members and some very bad people\" and that they would not be allowed to enter the United States unless they went through \"the legal process\".\n\"This is the invasion of our country and our Military is waiting for you!\" he added.\nMany Gang Members and some very bad people are mixed into the Caravan heading to our Southern Border. Please go back, you will not be admitted into the United States unless you go through the legal process. This is an invasion of our Country and our Military is waiting for you! — Donald J. Trump (@realDonaldTrump) October 29, 2018\nIn announcing the deployment, the head of Customs and Border Protection (CBP) cited concerns over the migrant caravans as reasons why his agency was adding 1,000 personnel along the border and requesting assistance from the Department of Defense.\nMcAleenan said the caravan in Mexico now numbers 3,500 people and cited a second group of 3,000 that has become a concern because it has had violent interactions with security personnel as it attempted to enter Mexico Sunday.\n“We want to be ready for that,\" he said. “We think this opportunity to harden our ports of entry, to be ready for mobile deployment between ports is a better way to prepare for the potential arrival of a large group like this.\"\nGen. Terrence O'Shaughnessy, the commander of U.S. Northern Command, told a Washington news conference that 800 soldiers from Fort Campbell and Fort Knox in Kentucky were already en route to Texas as the first wave of Operation Faithful Patriot.\n“I think the president has made it clear that border security is national security,” said O'Shaughnessy. “That's the direction we are given. That's the direction we are marching to. Our orders are very clear. We are engaged and here to support CBP. We are going to secure the border.”\nHe described the 5,200 troops to be deployed as just “the start of this operation” that could be adjusted as needed.\nAccording to O'Shaughnessy, the active duty troops will help “harden” the border using the Army Corps of Engineers and construction units that will build vehicle barriers and fencing. Like the 2,100 National Guardsmen already deployed in a similar mission, the active duty troops will not carry out law enforcement duties, since that is prohibited by the federal law kn9own as Posse Comitatus.\n“Everything that we are doing is in line with and adherence to Posse Comitatus,” said O’Shaughnessy.\nAs part of a 45-day mission, the active duty forces will begin arriving in ports of entry in a support role and then move onto other support projects like construction of temporary housing for Customs and Border Protection personnel, medical support and use helicopters to transport CBP officers to hard to reach areas along the border.\nThe helicopter units will also use their sophisticated equipment \"to spot, identify groups and rapidly deploy CBP personnel where they are needed.\"\nNorthhcom has already begun pre-positioning gear to the border area.\n“We have enough concertina wire to cover up to 22 miles, already deployed already to the border,” said O'Shaughnessy. “We have additional concertina wire that we can string, with over 150 miles available.”\nOrlando Sierra/AFP/Getty Images\nAbout 1,800 active duty forces are planned to be sent to Texas; 1,700 to Arizona and 1,500 to California said multiple U.S. officials. The specific states were selected to match the support requirements made by Customs and Border Protection.\nLast week, in an exclusive interview with ABC News, Vice President Mike Pence would not rule out the option of closing down the border ahead of the midterm elections. Asked if the president is mulling an executive order to stop all immigration at the border, Pence said: \"What we need to do is secure our border. The president will take steps to do that. But we also need to reform our laws.\"\nMcAleenan denied that the deployment of additional CBP and U.S. military personnel was triggered by American political concerns.\n\"This is a law enforcement operation from CBP 's perspective,\" he said. \"And we partner with DOD all the time to help secure our border.\"\nLast Friday when news of the deployment of active duty troops was first reported, officials had said that as many as 800 to 1,000 forces might be sent to the border. A U.S. official said that number was an initial estimate and that as planning developed the numbers increased.","url":"https://abcnews.go.com/Politics/us-military-readying-send-5000-troops-border-officials/story?id=58830081"}
