{"authors":[],"date_download":"2018-10-22 21:33:42","date_modify":"2018-10-22 21:33:42","date_publish":"2017-04-26 02:01:18","description":"The US government doesn't have a clear idea of what NAFTA covers, a business body representing several big North American multinationals said on Tuesday...","filename":"data/vaneerConsumption/USmisunderstandsNAFTANorthAmericanbusinessbodysays.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/02/wire-462585-1493168482-312_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446026_US-misunderstands-NAFTA-North-American-business-body-says_1540244022.html","title":"US misunderstands NAFTA, North American business body says","title_page":"US misunderstands NAFTA, North American business body says | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US Commerce Secretary Wilbur Ross claims that NAFTA isn't \"functioning properly,\" allegedly because Canada is exporting subsidized lumber to the US and is preventing easy access to its market by American dairy farmers\nThe US government doesn't have a clear idea of what NAFTA covers, a business body representing several big North American multinationals said on Tuesday after Washington picked a trade fight with Canada.\nThe Canadian American Business Council took umbrage at a comment by US Commerce Secretary Wilbur Ross that NAFTA wasn't \"functioning properly,\" allegedly because Canada was exporting subsidized lumber to the US and was preventing easy access to its market by American dairy farmers.\n\"It is important to understand that neither dairy nor lumber are covered by the NAFTA,\" the CEO of the Washington-based council, Maryscott Greenwood, said in a statement.\n\"The fact that these two protected sectors are the subject of bilateral disputes in recent weeks is not evidence that NAFTA is failing.\"\nThe Canadian American Business Council covers 50 big corporations, including Coca-Cola, Facebook, Ford, Air Canada and Bombardier.\nIts members are alarmed by fresh statements by President Donald Trump that he wants his administration to renegotiate the North American Free Trade Agreement linking the US, Mexican and Canadian markets.\n\"People don't realize, Canada has been very rough on the United States. Everyone thinks of Canada of being nice but they've outsmarted our politicians for many years,\" Trump told a group of farmers at the White House.\nHis government on Monday announced surprise new tariffs on Canadian softwood lumber, and he complained Tuesday about what he said was a Canadian block on American farmers near the border exporting their products north.\nBut the head of Quebec's dairy farmers' federation, Bruno Letendre, told Radio Canada that the Canadian government played no role in the case of a concentrated milk company in the US border state of Wisconsin losing an export contract to Canada.\nInstead, Canadian milk-producers had themselves negotiated a \"competitive\" deal with local milk processers, he said.\n\"The milk processers have the option of buying from the United States or from Canada. There are no rules stopping them,\" Letendre explained.","url":"https://www.dailymail.co.uk/wires/afp/article-4446026/US-misunderstands-NAFTA-North-American-business-body-says.html"}
