{"authors":["Associated Press"],"date_download":"2018-10-22 23:07:01","date_modify":"2018-10-22 23:07:01","date_publish":"2017-04-26 06:35:44","description":"SEOUL, South Korea (AP) - Hyundai Motor Co. reported Wednesday more than a 20 percent drop in its first quarter profit as the anti-Korean sentiment in China...","filename":"data/vaneerConsumption/USmissilesystemclaimsanothervictimHyundaiMotor.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446352_Hyundai-Motor-reports-21-percent-drop-1Q-profit_1540249621.html","title":"US missile system claims another victim: Hyundai Motor","title_page":"US missile system claims another victim: Hyundai Motor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SEOUL, South Korea (AP) - Hyundai Motor Co. reported Wednesday more than a 20 percent drop in its first quarter profit as the anti-Korean sentiment in China sparked by the deployment of the U.S. missile defense system battered the Korean carmakers' sales in its biggest auto market.\nThe company said its January-March net profit was 1.3 trillion won ($1.2 billion), down 21 percent from 1.7 trillion won a year earlier.\nIts profit slide was smaller than what analysts expected. FactSet, a financial data provider, said the market consensus was 1.22 trillion won.\nSales rose 5 percent to 23.4 trillion won ($20.8 billion). Operating profit fell 7 percent to 1.3 trillion won.\nThe biggest drag in earnings was the U.S. missile system that triggered China's anger and hurt Korean businesses in the world's most populous country.\nHyundai Motor, the maker of Tucson sports utility vehicles and Sonata sedans, said it sold 206,000 cars in China during the first three months, down 14 percent from a year earlier.\nIn January and February, Hyundai appeared to have been on track for sales recovery in China. That changed when South Korea's Defense Ministry signed an agreement with Lotte Group in late February to use its golf course in the southwest to deploy the missile defense system, known as THAAD. In March, Hyundai saw a sharp fall in its China car sales.\n\"Such sales fall is not due to the internal factor as you know. It is the result of the anti-Korean sentiment that flared up within China since late February and some rivals that launched marketing to exploit the anti-Korean sentiment,\" said Koo Zayong, a vice president at Hyundai Motor.\nSouth Korea and the U.S. say THAAD is a deterrent against North Korean aggression, but China opposed it because it worries that its powerful radars could peer through its territory.\nChina has shown its displeasure in other areas too. The once-steady inflows of Chinese tourists to South Korea withered, and Lotte was ordered to stop operations of its big discount chains in China, which cited safety violations. Instances of anti-Korean sentiments also emerged on Chinese social media and some South Korean schools canceled their trips to China.\nHyundai's performance in the U.S., its second-biggest market, also dropped 3 percent, outweighing growth in Western Europe and India.\nHyundai Motor was also hit by massive recalls it estimated to cost around 200 billion won ($178 million) during the first quarter. Earlier this month, Hyundai and Kia recalled 1.4 million cars in U.S., Canada and South Korea due to possible engine failures.","url":"https://www.dailymail.co.uk/wires/ap/article-4446352/Hyundai-Motor-reports-21-percent-drop-1Q-profit.html"}
