{"authors":[],"date_download":"2018-10-23 01:29:33","date_modify":"2018-10-23 01:29:33","date_publish":"2016-01-28 15:50:25","description":"The United States is monitoring Iraq's largest dam for signs of further deterioration that could point to an impending catastrophic collapse, US army officer...","filename":"data/vaneerConsumption/USmonitoringIraqslargestdamforsignsofcollapse.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h1qg-4vVdYopwYQ7f641721b07aee6b50-954_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421218_US-monitoring-Iraqs-largest-dam-signs-collapse_1540258173.html","title":"US monitoring Iraq's largest dam for signs of collapse","title_page":"US monitoring Iraq's largest dam for signs of collapse | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US monitoring Iraq's largest dam for signs of collapse\nThe United States is monitoring Iraq's largest dam for signs of further deterioration that could point to an impending catastrophic collapse, US army officers said on Thursday.\nThe Islamic State (IS) jihadist group seized the Mosul Dam briefly in 2014, leading to a lapse in maintenance that weakened an already flawed structure, and Baghdad is seeking a company to make repairs.\n\"The likelihood of the dam collapsing is something we are trying to determine right now,\" Lieutenant General Sean MacFarland, the commander of the US-led operation against IS, told journalists in Baghdad.\nA general view shows the Mosul Dam on the Tigris River ©Ahmad al-Rubaye (AFP/File)\nThe dam has long been in danger of collapse, which US officials have warned could send a huge wave crashing into IS-held Mosul, Iraq's second-largest city that lies about 40 kilometres (25 miles) away.\nThe US put measuring devices on the structure in December to monitor how much it is \"moving or deteriorating over time\", MacFarland said.\n\"We're still evaluating that data,\" he said, but if it does collapse, \"it's gonna go fast, and that's bad.\"\nThe US is sharing the data it collects with the Iraqi government and working with Baghdad on an evacuation plan, MacFarland said.\n\"They understand that there is the potential for the Mosul dam to collapse,\" he said.\n\"If this dam was in the United States, we would have drained the lake behind it -- we would have taken that dam out of commission.\"\nColonel Steve Warren, the spokesman for the anti-IS operation, said that divers had also assessed the dam.\nThe dam, which was completed in 1984, was constructed atop a foundation that continuously erodes with exposure to water, leaving cavities beneath the structure.\nSince its completion, the Iraqi government has sought to shore up the foundation by injecting mortar-like grout into the subsoil and cavities and controlling seepage.\nBut that regular maintenance lapsed in 2014 after IS seized the dam, stealing the equipment and chasing off the workers, Warren said.\n\"After we regained control of that dam, the equipment was all gone, and the workers really never did come back,\" Warren said.\n\"So the rate of decay increased because they weren't doing that regular maintenance, that regular grouting.\"\nIn 2007 the US ambassador to Iraq and the top American military commander in the country wrote a letter warning the dam could fail with devastating results.\n\"A catastrophic failure of the Mosul Dam would result in flooding along the Tigris River all the way to Baghdad,\" the letter said.\n\"Assuming a worst case scenario, an instantaneous failure of Mosul Dam filled to its maximum operating level could result in a flood wave 20 metres deep at the city of Mosul,\" it said.","url":"https://www.dailymail.co.uk/wires/afp/article-3421218/US-monitoring-Iraqs-largest-dam-signs-collapse.html"}
