{"authors":[],"date_download":"2018-10-22 22:31:08","date_modify":"2018-10-22 22:31:08","date_publish":"2014-05-10 22:35:44","description":"It was an historic milestone that couple David Bucher and Bruce Moats wed at the U.S. Naval Academy Chapel on Saturday, the venue's first gay wedding.","filename":"data/vaneerConsumption/USNavalAcademyHostsFirstSameSexWeddingforMarylandCouple.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/434406/140510-annapolis-wedding-1913_a4a372d7750b5fa0a6825ca2612ab286.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_u-s-naval-academy-hosts-first-same-sex-wedding-maryland-n102276_1540247468.html","title":"U.S. Naval Academy Hosts First Same-Sex Wedding for Maryland Couple","title_page":"U.S. Naval Academy Hosts First Same-Sex Wedding for Maryland Couple","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nANNAPOLIS, Md. — Beneath the magnificent cupola of the Navy’s most recognizable religious structure, two men — accompanied by their two children and about 100 guests — gathered here Saturday for the U.S. Naval Academy Chapel's first-ever same-sex wedding.\nFor the Naval Academy, it was an historic milestone that David Bucher, a 49-year-old Academy graduate who works at the Pentagon, and partner Bruce Moats, 50, tied the knot.\nBefore the ceremony got underway, the couple's wedding day jitters mingled with concerns they had about opposition to their nuptials.\nMoats said that while he and Bucher are not advocates trying to make a political statement with their wedding, they do want to continue the efforts of those fighting for gay rights.\n“We’re here to break barriers — and take advantage of the rights we have,” Moats said, beaming.\nThe wedding was not widely publicized, and it wasn’t surprising to Naval Academy spokesman Cmdr. John Schofield to see no Academy opposition to the ceremony.\n“The Naval Academy is all about creating leaders for the future and embodying and promoting a culture of dignity and respect,” Schofield said. “And I think that it’s in line with those values, those tenets that we hold dear, that we have our first same-sex marriage here.”\nHe said the Academy was proud to hold the wedding — in line with Maryland law. Same-sex marriage went into effect in 2013.\nAs groundbreaking as the wedding was for the Academy, it stuck to tradition with formal prayers, a reading from Corinthians and the United States Navy Hymn.\nBut Academy Chaplain Lt. John Connolly, who officiated the ceremony, said the run-up to the memorable day wasn’t all smooth sailing.","url":"https://www.nbcnews.com/news/us-news/u-s-naval-academy-hosts-first-same-sex-wedding-maryland-n102276"}
