{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:37:38","date_modify":"2018-10-30 20:37:38","date_publish":"2015-11-09 15:12:47","description":"U.S. Secretary of Defense Ash Carter said the United States needs “much more than airstrikes” to defeat ISIS in Iraq and Syria.","filename":"data/vaneerConsumption/USNeedsMuchMoreThanAirstrikesToDefeatISIS.json","image_url":"https://media.breitbart.com/media/2015/06/ap_ash-carter_ap-photo2-e1447081956507.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_09__1540931858.html","title":"U.S. Needs 'Much More Than Airstrikes' To Defeat ISIS","title_page":"Def Sec: U.S. Needs 'Much More Than Airstrikes' To Defeat ISIS","title_rss":"NULL","source_domain":"breitbart.com","text":"U.S. Secretary of Defense Ash Carter, while addressing the Reagan National Defense Forum, said the United States needs “much more than airstrikes” to defeat the Islamic State (ISIS/ISIL) in Iraq and Syria.\n“If you say, is it enough? I don’t think it’s enough,” he said Saturday referring to the U.S. bombing campaign against ISIS during the third annual defense conference hosted by the Ronald Reagan Presidential Library in California. “Yes, we’re willing to do more. And as we identify opportunities to do more, you see us doing more and we need to do more, much more than air strikes.”\nIn a January 2014 interview with The New Yorker, President Obama downplayed ISIS’ threat level, saying the terrorist group was like a “JV [junior varsity] team.”\nThe president then suggested the jihadist group could be defeated with airstrikes only, repeatedly vowing that the U.S. fight against ISIS “will not involve American combat troops fighting on foreign soil.”\nObama officially broke his no combat boots on the ground promise almost a year after he unveiled his plan to defeat ISIS.\nOn Oct. 30, the White House officially announced that up to 50 U.S. special operations forces would be deployed to Syria to provide “some training, advice and assistance to local forces that are operating on the ground there against ISIL.”\nCarter, on Oct. 23, said he expected American troops to conduct more ground raids in support of partners or unilaterally to rescue hostages from ISIS in Iraq.\n“We won’t hold back from supporting capable partners in opportunistic attacks against ISIL or conducting such missions directly,” the defense secretary told the Senate Armed Services Committee on Oct. 27, alluding to the Obama administration’s campaign against the Islamic State in Iraq and Syria. “Whether by strikes from the air or direct action on the ground.”\nISIS continues to control large swaths of territory in Iraq and Syria more than a year after the U.S.-led fight against the terrorist group began.\nIn July, Senate Armed Services Committee Chairman John McCain (R-AZ), Obama’s Republican opponent in the 2008 race for the White House, blasted Obama’s “delusional” lack of strategy against ISIS, suggesting the U.S. was “losing” the fight.\n“The fundamental strategy in Iraq and Syria for dealing with ISIL and dealing a lasting defeat to ISIL is to identify then train, equip, and enable local forces that can keep the peace… Finding those capable and motivated and willing forces turns out to be difficult,” Carter declared on Saturday. “And so as we identify them and strengthen them, we will do more. But we have to support capable and motivated forces, we can’t substitute for them.”\nThe Pentagon ended its failed $500 million program to train and equip the so-called moderate Syrian forces last month.\nAfter shutting down that program, the Obama administration airdropped 50 tons of small arms ammunition and grenades intended for Arab rebels in northern Syria as part of a new effort.\nHowever, the People’s Protection Units (YPG), the national Kurdish army in Syria, reportedly claimed the supplies. Pentagon officials insisted that Syrian Arabs received the ammunition.\nThe initial train and equip program was a massive embarrassment for the administration’s effort to recruit local fighters to combat ISIS.\nOne group of trainees surrendered their U.S.-provided weapons to the al Nusra Front, an al-Qaeda affiliate in Syria.\nWhile testifying before the House Foreign Affairs Committee last Wednesday, Anne Patterson, assistant secretary for the Bureau of Near Eastern Affairs at the State Department, suggested that America’s Arab allies have discussed sending their own ground forces into Syria.\n“We’ve had lots of discussions with our gulf allies and with Jordan about the possibility of introducing ground troops,” she told lawmakers.\nNevertheless, Carter criticized America’s Gulf State allies for not contributing enough to the fight against ISIS after the senior State official made those comments.\n“The reason they lack influence, and feel they lack influence in circumstances like Iraq and Syria, with [ISIS], is that they have weighted having high-end air-force fighter jets and so forth over the hard business of training and disciplining ground forces and special-operations forces,” the defense secretary told The Atlantic.","url":"https://www.breitbart.com/politics/2015/11/09/def-sec-u-s-needs-much-airstrikes-defeat-isis/"}
