{"authors":["Associated Press"],"date_download":"2018-10-22 20:11:05","date_modify":"2018-10-22 20:11:05","date_publish":"2016-01-28 00:29:52","description":"WASHINGTON (AP) — Americans rushed to buy new homes in December at the strongest pace in 10 months, with 2015 marking the strongest year for this segment of ...","filename":"data/vaneerConsumption/USnewhomesalessoarinDecember.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:c39040e5a13644ccac8692ec2f0b5127-2vdWmEltwXfba0ce28e632204733-381_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419380_US-new-home-sales-soar-December_1540239065.html","title":"US new-home sales soar in December","title_page":"US new-home sales soar in December | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US new-home sales soar in December\nWASHINGTON (AP) — Americans rushed to buy new homes in December at the strongest pace in 10 months, with 2015 marking the strongest year for this segment of the housing market since 2007.\nThe Commerce Department said Wednesday that new-home sales surged 10.8 percent last month to a seasonally adjusted annual rate of 544,000. It was the third consecutive monthly gain since sales collapsed in September. The increase nearly pulled the sales rate even with the level of 545,000 in February 2015 and points to continued momentum for real estate and construction in the opening months of this year.\n\"This is a promising sign for the housing market as we move into 2016,\" said Tian Liu, chief economist at Genworth Mortgage Insurance. \"We expect the strong increase in new home sales to continue as the fundamentals in the housing market remain strong and newer vintage homes are in short supply.\"\nA new home is shown for sale Tuesday, Jan. 26, 2016, in Riverview, Fla. On Wednesday, the Commerce Department reports on sales of new homes in December. (AP Photo/Chris O'Meara)\nSales of new homes accelerated sharply in 2015, rising 14.5 percent on the entire year to 501,000. Steady job growth that cut the unemployment rate to a healthy 5 percent has given many homebuyers increased confidence, while relatively low mortgage rates improved affordability. Yet sales of new homes continue to run below the 52-year historic average of 655,200, a sign of the severe hit absorbed by the market after the housing bubble burst.\nBuilders responded to the demand by increasing construction. Over the course of 2015, ground breakings rose 10.8 percent to 1.1 million. Yet supplies main relatively low with only 5.2 months' inventory of new homes available, down from 5.6 months in November. The industry generally considers six months' supply to be healthy.\nNew-home sales climbed strongly in the Northeast, Midwest and West in December. They were nearly flat in the South — the country's largest housing market.\nThe median new-home sales price fell 4.3 percent from a year ago to $288,900. But Ralph McLaughlin, chief economist at the real estate firm Trulia, cautioned that this doesn't necessarily mean that affordability has improved for first-time buyers.\nOnly 19 percent of new-home sales were below $200,000 in 2015, a decrease from 23 percent in 2014.\n\"This is likely due to a combination of low inventory of new starter homes and fewer first-time homebuyers,\" McLaughlin said.\nStill, lower borrowing costs have helped reduce cost pressures and encourage sales, a trend likely to run through this year.\nMortgage buyer Freddie Mac says the average rate on a 30-year fixed-rate mortgage declined to 3.81 percent last week from 3.92 percent a week earlier. Rates have historically averaged 6 percent, meaning that interest expenses are relatively low for homebuyers.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3419380/US-new-home-sales-soar-December.html"}
