{"authors":["Zoe Szathmary For Dailymail.Com"],"date_download":"2018-10-22 20:14:24","date_modify":"2018-10-22 20:14:24","date_publish":"2016-01-29 00:45:58","description":"People from New Jersey to Connecticut posted on social media and called local police departments to report a series of tremors starting just before 1:30 p.m.","filename":"data/vaneerConsumption/USNortheasttremorscausedbysonicboomandNOTearthquakes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30AFF7A800000578-0-image-a-41_1454047796060.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421779_Tremors-U-S-Northeast-caused-sonic-boom-not-quake-agency_1540239264.html","title":"US Northeast tremors caused by sonic boom and NOT earthquakes","title_page":"US Northeast tremors caused by sonic boom and NOT earthquakes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two fighter jets from a U.S. Navy base in Maryland may have caused a series of sonic booms on Thursday near the New Jersey coast that prompted hundreds of residents to report earthquake-like tremors.\nA spokeswoman for Naval Air Station Patuxent River said an F-35C and an F-18 were conducting routine flight testing over the Atlantic Ocean on Thursday afternoon, which may have caused sonic booms.\nPeople from New Jersey to Connecticut posted on social media and called local police departments to report a series of tremors starting just before 1:30 p.m.\nScroll down for video\nA spokeswoman for Naval Air Station Patuxent River said an F-35C and an F-18 were conducting routine flight testing over the Atlantic Ocean on Thursday afternoon, which may have caused sonic booms. An F-18 is seen in this file photo\nPeople from New Jersey to Connecticut posted on social media and called local police departments to report a series of tremors starting just before 1:30 p.m\nOne Twitter user wrote online 'Windows shaking violently at work today 3 times with no explanation'\n@Lilah425 tweeted: 'So you mean to tell me that earthquake like tremors was felt in NJ, NY, And CT and it's not real.'\nThe U.S. Geological Survey, which monitors earthquake activity, said no quake had struck.\nThe agency reported at least nine sonic booms had been recorded over 90 minutes starting at 1:24 p.m. near Hammonton, New Jersey, about 35 miles (56 km) southeast of Philadelphia.\nA sonic boom is produced when an airplane travels faster than the speed of sound, or 768 miles per hour (1,236 kph). The sound waves can hit the Earth and cause shaking, which is sometimes mistaken for an earthquake, according to the USGS.\nThe U.S. Geological Survey, which monitors earthquake activity, said no quake had struck\nThe agency reported at least nine sonic booms had been recorded over 90 minutes starting at 1:24 p.m. near Hammonton, New Jersey, about 35 miles (56 km) southeast of Philadelphia\nIt tweeted: 'Since many have asked: A sonic boom travels through the air w/ the airplane so it arrives at different ground locations at different times.'\nA different tweet from the agency said: 'The Navy has confirmed testing of supersonic aircraft offshore from where sonic booms and shaking were reported.'\nTwo days ago, residents in Charleston, South Carolina, also reported feeling tremors, likely caused by sonic booms from F-18 fighter jets on a training run from a nearby military base, according to media reports.\nA sonic boom is produced when an airplane travels faster than the speed of sound, or 768 miles per hour (1,236 kph). The sound waves can hit the Earth and cause shaking, which is sometimes mistaken for an earthquake, according to the USGS\nIn New York, seismologists at the Lamont-Doherty Earth Observatory at Columbia University confirmed no earthquake had occurred in the region on Thursday. The observatory measured vibrations and low-frequency sound waves consistent with about eight sonic booms from approximately 1:20 p.m. to 2:40 p.m., said Won-Young Kim, a research professor there.\nHe said residents on the ground likely would not have heard the booms but would have experienced 15 to 20 seconds of shaking during each one.\nThe tremors produced numerous emergency calls to local police departments, some of which took to Twitter to ask residents not to flood their lines with more reports.\nNo serious damage was immediately reported.\nOn Facebook, the New Jersey State Police jokingly posted a photograph of an alien\nTest aircraft from the naval air station fly almost daily along the same route, according to the base's spokeswoman, but most sonic booms are never heard on land. Certain atmospheric conditions, however, can make the sound travel.\nSome Twitter users offered a lighthearted response. One person using the handle @VixenRogue quipped: 'Aliens are invading New Jersey. What's the best way to let them know the other 49 states are just fine with this?'\nOn Facebook, the New Jersey State Police posted a photograph of an alien.","url":"https://www.dailymail.co.uk/news/article-3421779/Tremors-U-S-Northeast-caused-sonic-boom-not-quake-agency.html"}
