{"authors":[],"date_download":"2018-10-22 21:25:59","date_modify":"2018-10-22 21:25:59","date_publish":"2014-05-07 02:11:54","description":"The federal government and one of its space launch contractors called on a judge to lift her ban on the purchase of Russian rocket engines.","filename":"data/vaneerConsumption/USOfficialsWantJudgetoLiftBanonRussianRocketEngines.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/425116/140506-engine_c1cc98f2526288d3178ee9af3d629dbf.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_u-s-officials-want-judge-lift-ban-russian-rocket-engines-n98851_1540243559.html","title":"U.S. Officials Want Judge to Lift Ban on Russian Rocket Engines","title_page":"U.S. Officials Want Judge to Lift Ban on Russian Rocket Engines","title_rss":"NULL","source_domain":"nbcnews.com","text":"Last year, the Air Force and United Launch Alliance struck a deal to purchase billions of dollars' worth of hardware for launches using the Atlas 5 or ULA's other workhorse rocket, the Delta 4. ULA's main competitor, SpaceX, is contesting the \"block-buy\" deal in the U.S. Court of Federal Claims.\nAmong SpaceX's objections was the fact that Russian Deputy Prime Minister Dmitry Rogozin, who is in charge of his country's space program, is also among officials whose assets are being frozen under the terms of U.S. sanctions sparked by the Ukraine crisis.\nSpaceX argued that United Launch Services' purchases of NPO Energomash's RD-180 engines violated the sanctions because of the Rogozin connection. However, officials from the Treasury and State Departments wrote letters saying that the purchases from or payments to the Russian company were not prohibited.\nMeanwhile, a Commerce Department official sent a letter saying that she deferred to the Treasury and State Departments.\nIn the wake of those filings, United Launch Services said it was joining in the government's request to lift the ban.\nRead Tuesday's filings from the federal government and United Launch Services. Tip o' the Log to @Jeff_Foust.","url":"https://www.nbcnews.com/science/space/u-s-officials-want-judge-lift-ban-russian-rocket-engines-n98851"}
