{"authors":["Associated Press"],"date_download":"2018-10-22 20:01:34","date_modify":"2018-10-22 20:01:34","date_publish":"2016-01-29 00:00:48","description":"WASHINGTON (AP) — North Korea may be preparing to launch a rocket or missile, according to a U.S. defense official and expert analysis of commercial satellit...","filename":"data/vaneerConsumption/USofficialsaysactivitydetectedatNKoreanlaunchsite.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421868_US-official-says-activity-detected-NKorean-launch-site_1540238494.html","title":"US official says activity detected at NKorean launch site","title_page":"US official says activity detected at NKorean launch site | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US official says activity detected at NKorean launch site\nWASHINGTON (AP) — North Korea may be preparing to launch a rocket or missile, according to a U.S. defense official and expert analysis of commercial satellite imagery published Thursday.\nThe analysis comes just three weeks after North Korea drew international condemnation for conducted its fourth nuclear test explosion.\nThe official told The Associated Press the U.S. has seen activity at a ballistic missile test site that is consistent with previous tests, but the official would not go into more detail. The official was not authorized to speak publicly on the matter and requested anonymity.\nThe North Korea-focused website, 38 North, said it has detected what could be the early stages of preparation for launching a space launch vehicle at the nation's main rocket launch site at Sohae. It based its findings Thursday on satellite imagery taken this week.\nNorth Korea fired its first rocket into space from Sohae, on its west coast, in December 2012, sending into orbit a satellite that soon malfunctioned. The North has said it has the right to launch rockets any time for its space program, but such long-range launches have drawn U.N. sanctions because similar technology can be used for development of ballistic missiles.\nThe U.N. Security Council is deliberating over how to respond to the Jan. 6 underground nuclear explosion. The U.S. is pressing for tighter sanctions — a step that China, the North's only ally, appears reluctant to take.\nGovernments and experts have been skeptical about North Korea's claim it tested a hydrogen bomb, but whatever device the North detonated, it will likely push the country a step closer toward its goal of manufacturing a miniaturized warhead to place on a missile that can threaten the U.S. mainland. A major launch would only deepen those concerns.\nInitial word of a possible launch came Wednesday. The Japanese news agency, Kyodo, cited an unnamed Japanese government source as saying that satellite imagery analysis showed the North may be readying to fire a long-range ballistic missile from Sohae, and that the launch could occur in about a week at the earliest.\nThe 38 North analysis said a rocket test in the coming week appeared unlikely. Imagery from Monday showed vehicles or equipment and personnel near the rocket launch tower, but a rocket wasn't visible. The website said there's a high level of uncertainty about what snapshots of activity at the launch pad offered by the commercial imagery indicate.","url":"https://www.dailymail.co.uk/wires/ap/article-3421868/US-official-says-activity-detected-NKorean-launch-site.html"}
