{"authors":["Tsvetana Paraskova"],"date_download":"2018-10-30 22:41:13","date_modify":"2018-10-30 22:41:13","date_publish":"2018-07-30 00:00:00","description":"Some workers are using easily-accessible drugs and alcohol to get through long shifts in the Permian basin. Perhaps most strikingly, there is a strong correlation between the rise of drilling activity and the number of crystal meth seizures by authorities in the area.","filename":"data/vaneerConsumption/USoilPermianisboomingpushingworkerstodrugsalcohol.json","image_url":"https://amp.businessinsider.com/images/5b5f5ba51982d822008b477b-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_us-oil-permian-is-booming-pushing-workers-to-drugs-alcohol-2018-7_1540939273.html","title":"US oil: Permian is booming, pushing workers to drugs, alcohol","title_page":"    US oil: Permian is booming, pushing workers to drugs, alcohol - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Andrew Burton/Getty Images\nThe fastest-growing oil region in the U.S. is fueling not only the second American shale revolution—it's fueling a subculture of drug and alcohol abuse among oil field workers.\nThe Permian shale play in West Texas is once again booming with drilling and is full of oil field workers, some of which are abusing drugs and alcohol to help them get through long shifts, harsh working conditions, and loneliness and isolation.\nDrugs are easily accessible in the Permian, which is close to highways and to Mexico. For oil field workers making six-figure salaries, money is not a problem to buy all kinds of illegal substances to shoot, snort and swallow to get through 24-hour-plus shifts. The physically exhaustive work also sometimes causes aches for workers, making them susceptible to getting hooked on prescription painkillers.\nThe drug and alcohol abuse subculture in the Permian is a known—yet rarely reported or discussed—issue in the most prolific U.S. shale play, where oil production is booming, and relentless drilling attracts oil field workers from all over Texas and all parts of the United States.\nIn Midland, in the very heart of the Permian oil boom, The Springboard Center—a drug and alcohol addiction treatment facility—has many clients from the oil fields, Christopher Pierce, director of marketing for center, tells Rigzone's Valerie Jones in an interview.\n\"We get a lot of clients who work in the oilfield because of where we're located,\" says Pierce, 35, a former oil field worker, and a former addict.\nPierce and The Springboard Center in Midland are now working on building a gated living camp community free of drugs or alcohol for people who want to be in a safe place.\nOil workers are not speaking up at work about their addiction for fear of getting fired, Pierce said, adding that he doesn't have anything negative to say about the oil industry, which is the backbone of the economic growth in the Permian.\nSome oil field workers and contractors use drug cocktails or various substances depending on the condition they seek to achieve during their 24-hour-plus shifts. At the beginning of a long or overnight shift, they would use 'uppers' like cocaine and methamphetamines, and finish the shift with 'downers' such as prescription medication or alcohol, Kayla Fishbeck, regional evaluator for Prevention Resource Center Region 9, a data repository for 30 counties in West Texas, told Rigzone.\n\"In Region 9, the most screened drug last year was amphetamines and that was largely in the oilfield,\" she said.\nThanks to the oil boom, the unemployment rate in Midland is at a record low 2.1 percent, and the unemployment rate in Odessa is also a historically low of 2.8 percent.\nAccording to Fishbeck, Midland and Odessa are the top two Texas cities for drunken-driving fatalities.\n\"We hear stories of guys getting off their shift, getting a six-pack or 12-pack on their way home and start drinking in their truck,\" Fishbeck told Rigzone.\nThe Permian's drug of choice is crystal meth, a stimulant increasingly supplied by Mexican drug cartels, according to law enforcement officials who spoke to the Houston Chronicle in May.\nThere is a strong correlation between the rise of drilling activity and the number of crystal meth seizures by authorities in the Permian area, Houston Chronicle's cross-analysis of data from the Texas Department of Public Safety and the rig count shows.\nEddy Lozoya, a former oil field trucker and a recovering addict at 23, has recently found a job at a local department store selling shoes. At least for the next few months, he doesn't plan to return to the oil field.\n\"I don't see myself being able to work 100 hours a week sober,\" he told the Houston Chronicle. \"The oil field is tough.\"","url":"https://www.businessinsider.com/us-oil-permian-is-booming-pushing-workers-to-drugs-alcohol-2018-7"}
