{"authors":["Associated Press"],"date_download":"2018-10-23 01:08:56","date_modify":"2018-10-23 01:08:56","date_publish":"2016-01-29 14:59:02","description":"WASHINGTON (AP) — U.S. paychecks increased moderately in the final three months of last year, yet the gain was little changed from the sluggish post-recessio...","filename":"data/vaneerConsumption/USpaychecksshowlittlesignofacceleratingin4thquarter.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:93d5e7fb8a9f4823ab43e9bd27cad5a5-3bmscybNe842cce83474b5701775-366_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422800_US-paychecks-little-sign-accelerating-4th-quarter_1540256936.html","title":"US paychecks show little sign of accelerating in 4th quarter","title_page":"US paychecks show little sign of accelerating in 4th quarter | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US paychecks show little sign of accelerating in 4th quarter\nWASHINGTON (AP) — U.S. paychecks increased moderately in the final three months of last year, yet the gain was little changed from the sluggish post-recession trend.\nThe employment cost index, which tracks wages and benefits, rose 0.6 percent in the October-December quarter, the Labor Department said. That's the same as the previous three months.\nIn the past year, salaries and benefits have risen just 2 percent, the same annual pace as the previous two quarters. That is below the roughly 3.5 percent rate that is consistent with a healthy economy.\nIn this Friday, Sept. 18, 2015, photo, an employee works on a school bus on the assembly line at Blue Bird Corporation's manufacturing facility, in Fort Valley, Ga. On Friday, Jan. 29, 2016, the Labor Department releases the employment cost index for the fourth quarter, a measure of wage and benefit growth. (AP Photo/David Goldman)\nThere have been some signs wages are picking up in other data, but those gains are modest. Average hourly pay increased 2.5 percent in December from a year earlier, according to the government's monthly jobs report. That was only the second time since 2009 that increases have reached that level, but it's not far from the sluggish 2 percent pace that has existed since the recession.\nStill, the modest annual gain in the employment cost index suggests that companies are able to find the workers they need without offering much higher pay. That suggests there still may be millions of Americans who are unemployed or underemployed but are not reflected in the official unemployment rate.\nFor example, the number of people with part-time jobs but who would prefer full-time work remains higher than pre-recession levels.\n\"In short, largely a continuation of recent tame trends,\" Jim O'Sullivan, chief U.S. economist at High Frequency Economics, said in an email. \"Unemployment is just approaching standard estimates of the full employment level now and still appears to be trending down, and wages tend to lag.\"\nAmericans are seeing some improvement in inflation-adjusted wages. The Fed's preferred inflation gauge rose just 0.3 percent in 2015, held down by sharp drops in gas and other energy prices. That's lower than the 1.4 percent gain recorded in 2014 and means that U.S. paychecks were able to stretch a bit further last year.\nThe modest wage increase suggests that inflation will likely remain tame in the coming months. Higher labor costs would force companies to raise prices. The Federal Reserve predicted Wednesday that inflation would stay low in the short term.\nIt has been stuck below Fed policymakers' 2 percent target for more than three years, which could complicate their plans to boost interest rates. The Fed raised its short-term benchmark rate in December after keeping it pinned at nearly zero for seven years.\nYet since then, oil prices have plummeted and inflation is further from the Fed's goal.\nEmployers added 2.7 million jobs in 2015, and the unemployment rate fell from 5.6 percent at the end of 2014 to 5 percent in December.","url":"https://www.dailymail.co.uk/wires/ap/article-3422800/US-paychecks-little-sign-accelerating-4th-quarter.html"}
