{"authors":["Associated Press"],"date_download":"2018-10-23 02:09:48","date_modify":"2018-10-23 02:09:48","date_publish":"2016-01-28 16:58:31","description":"WASHINGTON (AP) — The number of people signing contracts to purchase homes managed to inch up last month, thanks to unseasonably warm weather in the Northeas...","filename":"data/vaneerConsumption/USpendinghomesalesinchupinDecember.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:67cb3a2ab4ad47b4b1770dc2ee0cdee6-2vdWmEltwXfba0ce28e632ad7bfc-717_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421121_US-pending-home-sales-inch-December_1540260588.html","title":"US pending home sales inch up in December","title_page":"US pending home sales inch up in December | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US pending home sales inch up in December\nWASHINGTON (AP) — The number of people signing contracts to purchase homes managed to inch up last month, thanks to unseasonably warm weather in the Northeast.\nThe National Association of Realtors said Thursday that its seasonally adjusted pending home sales index crept up 0.1 percent to 106.8. Signed contracts jumped 6.1 percent in the Northeast, while they declined in the other three major U.S. regions.\nLast month was one of the warmest Decembers on record on the East Coast.\nThis Tuesday, Jan. 26, 2016, photo, shows a \"For Sale\" sign hanging in front of an existing home in Atlanta. On Thursday, Jan. 28, 2016, the National Association of Realtors releases its December report on pending home sales, which are seen as a barometer of future purchases. (AP Photo/John Bazemore)\nThe tiny bump is consistent with many analysts' views that home sales may rise only slightly this year after a solid increase in 2015. Rising home prices and a lack of available homes for sale are frustrating many would-be buyers.\nThe data is \"a bit weaker than expected,\" Jim O'Sullivan, chief U.S. economist at High Frequency Economics, said in a research note. \"Through the volatility, trends still look upward. The latest mortgage applications data have also suggested a still-rising trend for home sales.\"\nThe Realtors predict that sales will increase 1.5 percent this year to 5.34 million. That would come after last year's stronger gain of 6.5 percent to 5.26 million, the highest level since 2006.\nSolid job gains and low mortgage rates have encouraged more Americans to take the plunge and buy a home.\nNew home sales surged last year, up 14.5 percent to 501,000. Still, that is below the long-run historical average of 655,000.\nThe inventory of available houses remains low. The number of existing homes for sale fell 3.8 percent in December from a year ago, the Realtors said last week.\nThe tight supply is pushing up prices faster than average incomes, which is making it harder for many Americans to afford a purchase.\nThat's kept many Americans renting. The homeownership rate has fallen to 63.8 percent, down from a peak of 69.2 percent in 2004.\nHome prices rose 5.8 percent in November from a year earlier, according to the Standard & Poor's/Case-Shiller 20-city index. Nationwide, the index is nearing its pre-recession peak, and prices have fully recovered in four metro areas.","url":"https://www.dailymail.co.uk/wires/ap/article-3421121/US-pending-home-sales-inch-December.html"}
