{"authors":[],"date_download":"2018-10-23 01:40:48","date_modify":"2018-10-23 01:40:48","date_publish":"2016-01-28 16:05:26","description":"US pending home sales edged higher in December, benefiting from mild winter weather in the Northeast that pulled in buyers, the National Association of Realt...","filename":"data/vaneerConsumption/USpendinghomesalescrawlhigherinDecember.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h1zd-4vVdYopwYQ7f641721b07aefc61e-979_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421229_US-pending-home-sales-crawl-higher-December_1540258848.html","title":"US pending home sales crawl higher in December","title_page":"US pending home sales crawl higher in December | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US pending home sales crawl higher in December\nUS pending home sales edged higher in December, benefiting from mild winter weather in the Northeast that pulled in buyers, the National Association of Realtors said Thursday.\nThe NAR pending home sales index, based on contract signings, rose 0.1 percent to 106.8 in December. The November reading was revised down slightly to 106.7.\nA large 6.1 percent jump in contract signings in the Northeast outpaced declines in the South, Midwest and West, the industry group said.\nThe National Association of Realtors pending home sales index, based on contract signings, rose 0.1 percent to 106.8 in December ©Justin Sullivan (Getty/AFP/File)\nYear-over-year, pending home sales were up 4.2 percent.\nContract activity, which has trended lower from the year's peak in May, ended the year on a stable footing, NAR's chief economist Lawrence Yun said.\n\"While sustained job creation is spurring more activity compared to a year ago, the ability to find available homes in affordable price ranges is difficult for buyers in many job-creating areas,\" Yun said in a statement.\nHe pointed out that tight inventory and rising prices were likely to persist for some time.\nIan Shepherdson of Pantheon Macroeconomics said there were signs the housing market could rebound in the coming months.\n\"The clear increase in applications for new mortgages to finance house purchase in recent months should translate into a clear and sustained rebound in home sales by early spring at the latest,\" he said.","url":"https://www.dailymail.co.uk/wires/afp/article-3421229/US-pending-home-sales-crawl-higher-December.html"}
