{"authors":["Associated Press"],"date_download":"2018-10-23 01:56:58","date_modify":"2018-10-23 01:56:58","date_publish":"2016-01-11 13:20:55","description":"MANILA, Philippines (AP) — The Philippine foreign and defense chiefs will discuss with their American counterparts ways to address new security concerns aris...","filename":"data/vaneerConsumption/USPhilippinestodiscussconcernsovernewChineseislands.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:5a08468a135f49a589c885f6fe5eb144-48qEJGFphM8d437f0aaf92535b10-176_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393693_US-Philippines-discuss-concerns-new-Chinese-islands_1540259818.html","title":"US, Philippines to discuss concerns over new Chinese islands","title_page":"US, Philippines to discuss concerns over new Chinese islands | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US, Philippines to discuss concerns over new Chinese islands\nMANILA, Philippines (AP) — The Philippine foreign and defense chiefs will discuss with their American counterparts ways to address new security concerns arising from China's completion of artificial islands in the disputed South China Sea, an official said Monday.\nDepartment of Foreign Affairs spokesman Charles Jose said the Philippines will ask the United States to continue patrols to ensure freedom of navigation in the area, a strategic passageway for many commercial and military ships, during Tuesday's talks in Washington.\nThe possibility of joint patrols by the U.S. and its Asian security allies may also be discussed, he said.\nFILE - In this Wednesday, Jan. 6, 2016 file photo released by China's Xinhua News Agency, a China Southern Airlines jetliner lands at the airfield on Fiery Cross Reef, known as Yongshu Reef in Chinese, in the Spratly Islands, known as Nansha Islands in Chinese, of the South China Sea. An official says Philippine and U.S. foreign and defense chiefs will discuss new security concerns arising from China's completion of artificial islands in the disputed South China Sea, on Tuesday, Jan. 12 in Washington. (Cha Chunming/Xinhua via AP, File) NO SALES\nRecent Chinese flights to test a runway on one of the seven man-made islands, Fiery Cross, have raised concerns that Beijing may plan to impose an air defense identification zone over the South China Sea, officially or otherwise, Jose said.\nVietnam and the Philippines opposed the Chinese flights.\n\"They can declare it officially or we may witness a de facto ADIZ,\" Jose said by telephone. \"There's a need, therefore, to take actions showing that we won't recognize any such imposition.\"\nIn 2013, China declared such an aviation security buffer zone over the East China Sea, where Beijing and Tokyo have been contesting ownership of a chain of uninhabited islands. The U.S. and its allies led by Japan protested the action and announced they would not recognize the Chinese defense zone.\nIn the South China Sea, Beijing shooed away U.S. and Philippine planes even while it was building the islands from previously submerged reefs and atolls in the Spratly Islands, indicating its intention to control access to the region, Philippine diplomats said.\nThe U.S. sent a guided-missile destroyer close to one of the Chinese-built islands, called Subi Reef, in October in one of its boldest challenges yet to Beijing's territorial claims, sparking warnings from China. U.S. officials vowed to continue maneuvers to protect freedom of navigation and overflight.\nChina has said it built the islands primarily to foster safe civilian sea travel and fishing but added they may also be used militarily.\nAnalysts say the new islands will give Beijing a much stronger security grip over a vast stretch of the South China Sea farthest from the Chinese mainland, in an area where Vietnam, the Philippines, Taiwan and Malaysia have stationed forces on islands and reefs which China also claims.\nPhilippine Foreign Secretary Albert del Rosario and Defense Secretary Voltaire Gazmin also plan to discuss further U.S. help in strengthening the Philippine military's capability for territorial defense in their talks with U.S. Secretary of State John Kerry and Defense Secretary Ash Carter, Jose said.","url":"https://www.dailymail.co.uk/wires/ap/article-3393693/US-Philippines-discuss-concerns-new-Chinese-islands.html"}
