{"authors":["Valerie Edwards For Dailymail.Com"],"date_download":"2018-10-23 02:40:30","date_modify":"2018-10-23 02:40:30","date_publish":"2017-03-16 13:19:20","description":"An unidentified Dallas postal worker was fired after being accused of dumping dozens of letters (pictured) in the woods. The letter carrier also faces potential criminal charges, authorities have said.","filename":"data/vaneerConsumption/USpostalworkerfiredfordumpinglettersinthewoods.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54561C00000578-0-image-a-2_1489669458769.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320116_Postal-worker-fired-dumping-letters-woods_1540262430.html","title":"US postal worker fired for dumping letters in the woods","title_page":"US postal worker fired for dumping letters in the woods | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Dallas postal worker was fired after being accused of dumping 'hundreds' of letters in the woods.\nThe letter carrier, who hasn't been identified, also faces potential criminal charges.\nOn Monday, Don Sutton, who lives nearby, found the letters strewn on the ground.\nSutton told CBS that he went to pick up what he though was trash when he discovered that it was actually mail that never made it to the homes of local residents.\nA Dallas postal worker was fired after being accused of dumping dozens of letters (pictured) in the woods. The letter carrier, who hasn't been identified, also faces potential criminal charges\nOn Monday, Don Sutton (pictured), who lives nearby, found the letters strewn on the ground. Sutton said he went to pick up what he though was trash when he discovered that it was actually mail that never made it to the homes of local residents\nSutton said there were 'hundreds' of letters that 'didn't just fall, it stuck together'. He then called authorities and the next day, postal inspectors arrived to gather the letters\n'It was dumped right through here all the way to the bottom,' Sutton said as he pointed to a wooded area.\nSutton told the station that there were 'hundreds' of letters that 'didn't just fall, it stuck together'.\nHe called authorities and the next day, postal inspectors arrived to gather the letters.\nSutton said he saw a mail truck parked across the street on his surveillance camera before he discovered the mail.\nPostal service investigators were able to identify the letter carrier using the footage.\nA spokesman with the postal service's Inspector General's office confirmed to CBS that the employee no longer works there.\nSutton said some of the letters were addressed to residents on Perryton Drive, about three miles away, according to the station.\nVictims have been notified of their missing mail and will soon get their letters delivered to their homes. It's unclear if the letter carrier will face criminal charges.\nPostal inspectors (pictured) arrived at the scene and began putting the letters in bags. Investigators said the mail is being processed and will be delivered to its rightful owners","url":"https://www.dailymail.co.uk/news/article-4320116/Postal-worker-fired-dumping-letters-woods.html"}
