{"authors":[],"date_download":"2018-10-22 22:03:29","date_modify":"2018-10-22 22:03:29","date_publish":"2014-06-04 00:00:00","description":"Robert Ford served as the U.S. ambassador to Syria until late February. Ford says as the uprising became a civil war, he was frustrated by limited U.S. support for rebel forces.","filename":"data/vaneerConsumption/USPolicyInSyriaCouldNoLongerBeDefendedExAmbassadorSays.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=318752310_1540245809.html","title":"U.S. Policy In Syria Could No Longer Be Defended, Ex-Ambassador Says","title_page":"U.S. Policy In Syria Could No Longer Be Defended, Ex-Ambassador Says : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\nIt's MORNING EDITION from NPR News. Good morning, I'm David Greene.\nSTEVE INSKEEP, HOST:\nAnd I'm Steve Inskeep. President Obama's former point man on Syria resigned because he can no longer defend U.S. policy there. Ambassador Robert Ford was once known for dramatic gestures supporting Syria's opposition. But Ford says, as the uprising became a civil war he was frustrated by limited U.S. support for rebels. And even now, Ford told the \"PBS NewsHour\" he is not sure the Obama administration is doing enough.\n(SOUNDBITE OF TV SHOW, \"PBS NEWSHOUR\")\nROBERT FORD: It's not clear to me yet if they are prepared to ramp it up in such a way that will be meaningful on the ground. And that's really what matters. This is a civil war. And we can't get to a political negotiation until the balance on the ground compels - and I use that word precisely - compels Assad not to run sham elections, but rather to negotiate a political deal. But the situation on the ground is key.\nINSKEEP: That's former U.S. Ambassador Robert Ford. NPR's Deborah Amos has interviewed Ford over the years and joins us now from a town on the border with Syria and Turkey. Hi Deb.\nDEBORAH AMOS, BYLINE: Hi, good morning.\nINSKEEP: How significant a voice is Robert Ford?\nAMOS: He was the point man for Syrian policy through this revolt. For him to speak out now, this close to the moment where he left the administration, is important. He did not voice any of those frustrations as a diplomat. He did defend the policy when he was a diplomat. And now that he's quit, he is remarkably speaking out. There have been others - Fred Hoff, also from the State Department, also resigned, said that he was frustrated by the policy and has been writing regularly. So now we have two senior diplomats who are saying publicly that they are frustrated.\nINSKEEP: Saying that the U.S. should be doing more now. In our interview with President Obama last week, he tried to explain why he's been reluctant to get too involved in Syria. Let's listen to some of that, Deb Amos.\n(SOUNDBITE OF ARCHIVED BROADCAST)\nPRESIDENT BARACK OBAMA: Ultimately, I did not think then and I still do not believe that American military actions can resolve what is increasingly a sectarian civil war. And I also believe that, ultimately, the only way you're going to get a resolution that works for the Syrian people in the region is going to require some sort of political accommodation between the various groups there.\nINSKEEP: Deb Amos, they're both talking about a political solution - Robert Ford and President Obama. So what is the difference here?\nAMOS: I did notice that. And I think the difference is how you get there. Ex-ambassador Ford is saying how you get there is you support moderate rebels. You put pressure on the regime. They are not going to come to any negotiating table without that kind of pressure. And there is not enough. We just saw yesterday an election in Damascus. Many Western governments, certainly the opposition, called it a shameful sham. But nevertheless, it demonstrated the resilience of the regime. There is no diplomatic solution in sight. And so, this war is likely to go on for some time to come until there is some reason for the Assad regime to negotiate with the opposition.\nINSKEEP: Deb Amos, just to underline the stakes here - would you remind us just where you are?\nAMOS: I am in a town called Kilis. It is a Turkish border town. Here - I haven't been here in a while, and I noticed that many of the shop signs are in Arabic now. This town is 50-50 - half Syrian refugees. Many thousands have arrived just since January from the Syrian town of Aleppo, where there has been a hellacious campaign of barrel bombs. Regime helicopters have been dropping them on civilian areas. You see kids begging on the streets. It is a town that has been awash with Syrian refugees. This is the spillover of the war in Syria.\nINSKEEP: Reminder of the human stakes. From NPR's Deborah Amos. Deb, thanks very much.\nAMOS: Thank you.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=318752310"}
