{"authors":[],"date_download":"2018-10-22 20:42:55","date_modify":"2018-10-22 20:42:55","date_publish":"2014-05-02 16:44:22","description":"President Barack Obama said Friday that a botched execution this week in Oklahoma is \"deeply troubling.\"","filename":"data/vaneerConsumption/USReviewingStateExecutionsasObamaDecriesOklahomaBlunder.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/416656/140502-obama_merkelpresser_execution-1323_11c6d5c4f047effee2a30c6c835f9e83.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_lethal-injection_u-s-reviewing-state-executions-obama-decries-oklahoma-blunder-n95746_1540240975.html","title":"U.S. Reviewing State Executions as Obama Decries Oklahoma Blunder","title_page":"U.S. Reviewing State Executions as Obama Decries Oklahoma Blunder","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPresident Barack Obama said Friday that a botched execution this week in Oklahoma is \"deeply troubling\" and highlights \"significant questions about how the death penalty is being applied\" in the U.S.\nClayton Lockett died 43 minutes after his execution began Tuesday night and was described by witnesses as writhing in pain because of a problem with one of his veins. Lockett was convicted of shooting a teenager and burying her while she was still alive.\nCiting \"significant problems,\" including the problems with lethal injection, racial bias and uneven application of the death penalty, Obama said he had directed the Justice Department to launch an \"analysis of what steps have been taken, not just in this particular instance, but more broadly in this area.\"\nThe Justice Department, which has already imposed a moratorium on federal executions, said Friday that it was undertaking a \"survey of state-level protocols and related policy issues\" as Obama had requested.\nMadeline Cohen, who represents Charles Warner, a convicted killer who was due to have been executed just two hours after Lockett, told NBC News that she was \"very glad to see that.\"\n\"We need a truly independent and far-reaching review,\" Cohen said Friday night.\nEarlier this week, white House press secretary Jay Carney said the Oklahoma execution fell short of “humane” standards.\nObama \"has long said that while the evidence suggests that the death penalty does little to deter crime, he believes there are some crimes that are so heinous that the death penalty is merited,\" Carney said.\nM. Alex Johnson and Tracy Connor of NBC News contributed to this report.","url":"https://www.nbcnews.com/storyline/lethal-injection/u-s-reviewing-state-executions-obama-decries-oklahoma-blunder-n95746"}
