{"authors":[],"date_download":"2018-10-22 20:37:06","date_modify":"2018-10-22 20:37:06","date_publish":"2014-05-02 18:38:10","description":"The United States has reported its first case of a new virus found in the Middle East, in a traveler from the region.","filename":"data/vaneerConsumption/USReportsFirstCaseofMERS.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/417186/1405020-mers-jhc-1605_cb582f86015c6865faea5328fba26b83.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-news_u-s-reports-first-case-mers-n95871_1540240626.html","title":"U.S. Reports First Case of MERS","title_page":"U.S. Reports First Case of MERS","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe United States has reported its first case of a new virus found in the Middle East, in a traveler from the region, the Centers for Disease Control and Prevention says.\nThe patient, a healthcare worker who traveled from Saudi Arabia to Indiana, is being kept isolated in an Indiana hospital after being diagnosed with Middle East Respiratory Syndrome (MERS) virus, the CDC says.\n\"In 2014 these new diseases are just a plane ride away,\" said Dr. Anne Schuchat, assistant surgeon general and director of CDC’s National Center for Immunizations and Respiratory Diseases. “We have been preparing since 2012 for this eventuality.”\nThe World Health Organization has expressed alarm about the increase in reports of MERS. WHO reports more than 250 confirmed cases and 93 deaths since the virus was identified in 2012. But Saudi Arabia alone has reported 371 cases, with 107 deaths.\nExperts say it was only a matter of time before it came to the United States.\n“In this interconnected world we live in, we expected MERS to make its way to the United States.\"\nSchuchat says this first imported case poses only a low risk for the general public. \"We don't have a sense right now that this is very easy to spread,\" Schuchat told reporters on a conference call.\nThe virus has not been known to spread on airplanes or buses. Most cases have been among people caring for sick patients or in very close contact with them.\nThe CDC says it is tracking down anyone who might have been in contact with the patient, including airplane seat mates, out of an abundance of caution. They're also checking health care workers who cared for him.\n“On April 24, the patient traveled by plane from Saudi Arabia to London, then from London to Chicago,” the CDC said. “The patient then took a bus from Chicago to Indiana. On the 27th, the patient began to experience signs of illness, including shortness of breath and coughing. The patient went to an emergency department on April 28th. Because of the patient’s symptoms and travel history, Indiana public health officials had him tested for MERS.”\nIndiana state health officials said the patient was at Community Hospital in Munster.\n\"In light of federal privacy regulations, we can only disclose that the patient is in good condition,\" hospital officials said in a statement. \"We are maintaining appropriate isolation protocols for the protection of health care staff.\"\nExposed family members and health care workers will be monitored daily throughout the 14-day incubation period for MERS, officials said. The patient wasn't out in the local community, so any public exposure was \"minimal,\" they added.\nThe virus has infected people in Jordan, Kuwait, Oman, Qatar, Saudi Arabia, Egypt, the United Arab Emirate, France, Germany, Greece, Italy, Britain, Tunisia, Malaysia and the Philippines. There’s no specific treatment, no cure and no vaccine for MERS.\nLast week, WHO predicted a springtime surge in MERS cases.\nMERS first showed up in 2012, when it killed an elderly Saudi man. It worries health experts because it’s related to severe acute respiratory syndrome, or SARS, which swept around the world in 2003, infecting around 8,000 people and killing close to 800 before it was stopped. Both conditions are caused by coronaviruses, members of a family of viruses that usually cause common cold symptoms and that infect a wide range of mammals.\nThe most recent research traces it to camels, although most cases seem to be spread from one person to another.\n\"It is not always possible to identify patients with MERS early because some have mild or unusual symptoms.\"\nThe virus can survive on surfaces, and might spread when people touch something contaminated. SARS appears to have spread that way, and many other viruses do, too.\nCDC and WHO say the virus has spread many times in hospitals, dialysis centers and other healthcare facilities, so they are cautioning health workers to take special precautions.\n“Infection prevention and control measures are critical to prevent the possible spread of MERS in health care facilities,” WHO says.\n“Health care workers should be educated, trained and refreshed with skills on infection prevention and control. It is not always possible to identify patients with MERS early because some have mild or unusual symptoms. For this reason, it is important that health-care workers apply standard precautions consistently with all patients — regardless of their diagnosis — in all work practices all the time.”\nWhile MERS kills about a third of the patients who show symptoms, some people have been found later to have been infected but they never got sick. Most of those who have been severely ill have been elderly or had other illnesses such as diabetes or kidney disease.","url":"https://www.nbcnews.com/health/health-news/u-s-reports-first-case-mers-n95871"}
