{"authors":["Associated Press"],"date_download":"2018-10-22 23:21:13","date_modify":"2018-10-22 23:21:13","date_publish":"2016-01-11 05:22:32","description":"DES MOINES, Iowa (AP) — Three weeks before Iowa kicks off the state-by-state presidential nominating contests, businessman Donald Trump and Texas Sen. Ted Cr...","filename":"data/vaneerConsumption/USRepublicansmayfacedevilsbargainincampaign.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:9812158e6b5c4543a78a9d4d5a5bffe3-48qEJGFphM8d437f0aaf920b5ad1-993_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393403_US-Republicans-face-devils-bargain-campaign_1540250473.html","title":"US Republicans may face 'devil's bargain' in campaign","title_page":"US Republicans may face 'devil's bargain' in campaign | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US Republicans may face 'devil's bargain' in campaign\nDES MOINES, Iowa (AP) — Three weeks before Iowa kicks off the state-by-state presidential nominating contests, businessman Donald Trump and Texas Sen. Ted Cruz are generating overwhelming enthusiasm among Republican voters in the state, along with concern, though not panic, among the party professionals who believe both are unelectable in November against the Democratic nominee.\nDespite such fears, talk of a \"takedown\" effort aimed at either Trump or Cruz appears to have faded as the Feb. 1 caucuses in Iowa near. For now, there is nervous acceptance that two of the Republican Party's most divisive figures may stay at the top of the presidential pack well into the first month of voters' getting their say.\n\"Cruz would not only cost us the general (election), he would cost the GOP (Republican Party) the future. Trump is not a Republican and he is not a conservative,\" said Republican strategist Alex Castellanos, who is not affiliated with a 2016 campaign. \"The geometry is conflicting: If you limit one, you aid the other.\nIn this Jan. 8, 2016, photo, Republican presidential candidate, Sen. Ted Cruz, R-Texas, holds a town hall at Praise Community Church in Mason City, Iowa. With three weeks to go before Iowa kicks off the 2016 presidential campaign, Donald Trump and Cruz are generating overwhelming enthusiasm among Republican voters in the state. (AP Photo/Patrick Semansky)\n\"At the end,\" Castellanos said, \"Republicans may face the devil's bargain and have to settle for the lesser of two anti-establishment evils.\"\nThat feeling is echoed by party officials across the country, who acknowledged they have few tools to stop Cruz or Trump. Instead, there is hope that voters ultimately will settle on what they consider a more viable alternative from a group of candidates that includes Florida Sen. Marco Rubio, New Jersey Gov. Chris Christie, former Florida Gov. Jeb Bush and Ohio Gov. John Kasich.\n\"Let's see how the votes go before we panic,\" said Washington-based Republican operative John Feehery, who has been critical of Cruz and Trump.\nThere is little evidence of widespread alarm from establishment Republican leaders and their well-funded supporters. Despite their commanding presence in preference polls, Trump and Cruz have almost completely escaped paid attack ads, particularly in Iowa.\nRepublican National committeeman Ron Kaufman of Massachusetts said the party's \"centrist conservatives\" will have to be patient until what they see as a more electable alternative to Trump and Cruz emerges.\n\"This is about who's going to be in the finals,\" Kaufman said. \"Clearly on one side it's going to be Trump and/or Cruz. And for the centrist conservatives, it's going to come down to one of three governors or Rubio.\"\nThat may explain why the attacks on Cruz and Trump pale in comparison to the amount spent disparaging other candidates. For example, a Rubio-boosting group recently put more than $1 million into sharp-elbowed anti-Christie attacks in New Hampshire. Rubio has been the target of close to $1 million in negative advertising, mostly in Iowa and mostly by Cruz boosters.\nThere is unquestioned excitement among the Republican electorate in Iowa for the two front-runners.\nOn Saturday, Cruz concluded a six-day, 28-stop trek across the state, drawing overflow crowds everywhere — from a pizza restaurant in Pocahontas to a small college in Sioux Center, where hundreds packed the auditorium, spilling into the stairwell and upper level.\n\"There is no doubt that the Washington cartel is in full panic mode,\" said an almost giddy Cruz this past week. \"They are in full panic mode because they are seeing on the ground conservatives uniting.\"\nAt other stops, Cruz supporters stood outside in snow and sub-freezing temperatures, unable to get in for a seat, but still trying to listen through open doors. At a Friday morning event in Mason City, 48-year-old Robert Peterson said he was sold on Cruz, even though he said he had never before voted for a Republican presidential candidate.\n\"It's time for a change,\" Peterson said, standing at the back of the room wearing a red \"Cruz 2016\" button and holding a red, white and blue Cruz sign. \"The status quo has got to go.\"\nIt's much the same for Trump, who is showing no signs of slowing down after leading most national preference polls since the summer. The brash real-estate billionaire and former reality television star routinely draws thousands of people to his rallies, packing high school auditoriums, arenas, convention centers — even an airplane hangar — across the country.\nSupporters began lining up at dawn for a 7 p.m. rally in Burlington, Vermont, this past week, while in Massachusetts and New Hampshire, hundreds stood outside in the bitter cold for hours waiting to get in.\n\"Folks, we have a revolution going on,\" Trump said in Lowell, Massachusetts, marveling at the thousands of people who filled the arena. \"People are tired and they're sick of the stupidity that we're seeing coming out of Washington.\"\n___\nAssociated Press writers Julie Bykowicz in Washington, Scott Bauer in Webster City, Iowa, and Jill Colvin in Burlington, Vermont, contributed to this report.","url":"https://www.dailymail.co.uk/wires/ap/article-3393403/US-Republicans-face-devils-bargain-campaign.html"}
