{"authors":[],"date_download":"2018-10-23 04:25:42","date_modify":"2018-10-23 04:25:42","date_publish":"2016-01-28 20:25:26","description":"The United States marked the 30th anniversary Thursday of the explosion of the Challenger space shuttle with a pledge to remember lost astronauts as it press...","filename":"data/vaneerConsumption/USremembersastronautskilledpledgestoreachMars.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5ys-4PuZeKVXE7cd9005b2c87611052a-983_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420411_US-remembers-astronauts-killed-pledges-reach-Mars_1540268742.html","title":"US remembers astronauts killed, pledges to reach Mars","title_page":"US remembers astronauts killed, pledges to reach Mars | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US remembers astronauts killed, pledges to reach Mars\nThe United States marked the 30th anniversary Thursday of the explosion of the Challenger space shuttle with a pledge to remember lost astronauts as it presses on toward Mars.\nAt the Kennedy Space Center in Florida, where the shuttle blasted off on January 28, 1986, singers in red and blue belted out the Star Spangled Banner for a crowd that included relatives and friends of the seven killed that day.\nSix NASA astronauts and Christa McAuliffe -- who would have been the first teacher in space -- died when the shuttle exploded 73 seconds after liftoff.\nThis photo taken on January 28, 1986 shows a solid fuel rocket booster as it disappears behind the contrail of the explosion of the Space Shuttle Challenger over Kennedy Space Center ©Bob Pearson (AFP/File)\nThe cause was a failed booster engine, according to the US space agency.\n\"These brave women and men are forever a part of a story that is ongoing,\" President Barack Obama said in a statement.\n\"It is a story that will bring human beings to Mars and out into our solar system -– and beyond. It is a story made possible by their sacrifice and heroism.\"\nWreaths were laid at Arlington National Cemetery near the US capitol as NASA commemorated the 24 US lives lost in space disasters and test flights over the years.\n\"As we undertake a journey to Mars, they will be with us. They have our eternal respect, love and gratitude,\" said a statement by NASA administrator Charles Bolden, a former astronaut.\n\"On this solemn occasion, we pause in our normal routines and remember.\"\nThe other major shuttle accident was on February 1, 2003. Seven people died aboard the Columbia shuttle when it broke into pieces while re-entering Earth's atmosphere.\nNASA said later that a piece of foam had come loose from the external tank during launch, and formed a hole in one of the shuttle's wings, causing it to break up 16 minutes before it was to have landed.\n- Astronaut honors best friend -\nThe US space agency also commemorated the three men who died in the Apollo 1 launch pad fire in 1967, before the nation ever made it to the moon.\n\"Remembering the crews today that we've lost, especially my best friend Ed White who perished in the Apollo 1 fire,\" astronaut Buzz Aldrin -- the second person to step foot on the Moon after American astronaut Neil Armstrong -- said on Twitter.\nBolden also recalled the 1967 loss of Mike Adams who died on an X-15 hypersonic rocket-powered aircraft, and others who perished in \"test flights and aeronautics research throughout our history.\"\nShortly after taking office, Obama cancelled a NASA program to return to the moon, saying he preferred to funnel resources into deep space exploration and aimed to have a human mission to Mars under way by the 2030s.\nThe space shuttle program was formally ended in 2011 after three decades of ferrying astronauts to and from low-Earth orbit.\nIts retirement left the United States with no vehicle for human space travel.\nIn the meantime, the world's astronauts hitch rides to the International Space Station aboard Russia's Soyuz capsules, while private companies Boeing and SpaceX ready their own spaceships for use in 2017 and beyond and NASA focuses on building its Orion deep space capsule.\nNASA picture shows the crew of the doomed US space shuttle Challenger - (Front from L) Mike Smith, Dick Scobee, Ron McNair, (Back row L) Ellison Onizuka, Christa McAuliffe, Greg Jarvis, and Judith Resnik\nNASA Administrator Charles Bolden (R) speaks to NASA personnel and others during a wreath laying ceremony as part of NASA's Day of Remembrance on the 30th anniversary of the Challenger accident, January 28, 2016, at Arlington National Cemetery ©Aubrey Gemignani (NASA/AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3420411/US-remembers-astronauts-killed-pledges-reach-Mars.html"}
