{"authors":["Deborah Danan"],"date_download":"2018-10-30 18:59:53","date_modify":"2018-10-30 18:59:53","date_publish":"2018-08-02 00:09:25","description":"Washington has insisted that there has been no change to its \"firm position\" regarding Iran despite President Donald Trump's proclamation that he would meet Iranian President Hassan Rouhani \"anytime\" without preconditions, a senior Israeli official said on Tuesday.","filename":"data/vaneerConsumption/USReassuresIsraelNoChangeinIranPolicyOfficialSays.json","image_url":"https://media.breitbart.com/media/2018/08/wi/afp/01/714733_an-president-hassan-rouhani-any-talks-us-include-return-nuclear-deal-president.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2018_08_01__1540925993.html","title":"U.S. Reassures Israel No Change in Iran Policy, Official Says","title_page":"U.S. Reassures Israel No Change in Iran Policy, Official Says | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Washington has insisted that there has been no change to its “firm position” regarding Iran despite President Donald Trump’s proclamation that he would meet Iranian President Hassan Rouhani “anytime” without preconditions, a senior Israeli official said on Tuesday.\n“Israel maintains constant communications with the American administration. Senior American officials told Israel there is no change to the firm stance against Iran,” the official said.\nDuring a press briefing after a meeting with Italian Prime Minister Giuseppe Conte on Monday, Trump said he would agree to meet with Iranian leaders to discuss improving relations after the American withdrawal from the nuclear deal.\n“If they want to meet, we’ll meet,” he said. “I’ll meet with anybody. I believe in meeting. … There’s nothing wrong with meeting.”\n“I don’t know that they’re ready yet. I ended the Iran deal. It was a ridiculous deal. I do believe that they will probably end up wanting to meet and I’m ready to meet any time that they want to,” he added.\nIranian officials responded by saying that talks would need to be preceded by re-signing the nuclear deal.\n“Those who believe in dialogue as a method of resolving disputes in civilized societies should be committed to the means,” said political adviser Hamid Aboutalebi.\nHowever senior cleric Ali Akbar Nategh Nouri, a member of the influential Expediency Council, said Iran would be wise not to reject Trump’s suggestion out of hand.\n“It should be discussed in the Supreme National Security Council,” said Nategh Nouri, who is also a former aide to Supreme Leader Ayatollah Ali Khamenei. Nategh Nouri said “we have to contemplate” the proposal, but added “we should not rejoice over this offer and not get excited.”\n“Trump may take advantage of this over-excitement,” he said, the state-run IRNA news agency reported. “It could be a test for us.”\n“If this negotiation (is) carried out in any form, then it will be considered as surrender and the Iranian nation will not surrender,” he added.\nFormer Foreign Ministry director-general Dore Gold cautioned against making a mountain out of a molehill over Trump’s remark.\n“I don’t think the US would fundamentally change its approach on Iran sanctions, unless Iran made certain concessions,” said Gold according to the Jerusalem Post.\n“In moments of political-military tension, there are many times when ideas are floated for a meeting; sometimes they work out and sometimes they don’t,” he said.\n“I think the US has had a very comprehensive agenda on Iran,” Gold, who is head of the Jerusalem Center for Public Affairs, added. “I don’t believe that a meeting between Rouhani and Trump would only deal with the number of centrifuges spinning — in other words, the regional role of Iran has been very much on the administration’s agenda, and would be on the agenda of such a meeting, including the withdrawal of Iranian forces from Syria.”","url":"https://www.breitbart.com/middle-east/2018/08/01/u-s-reassures-israel-no-change-in-iran-policy-official-says/"}
