{"authors":["Deborah Danan"],"date_download":"2018-10-30 20:53:35","date_modify":"2018-10-30 20:53:35","date_publish":"2016-04-24 13:30:02","description":"Saudi Arabian and other Gulf press lashed out at Barack Obama prior to his visit to Riyadh, accusing Congress of being in cahoots with Iran.","filename":"data/vaneerConsumption/USSchizophrenicPlayingIntoHands.json","image_url":"https://media.breitbart.com/media/2016/04/wi/ap_barack-obama-king-salman_ap-photo-4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_04_24__1540932815.html","title":"U.S. Schizophrenic, Playing Into Hands","title_page":"Saudi, Gulf Press: U.S. Schizophrenic, Playing Into Hands","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Saudi Arabian and other Gulf press lashed out at President Barack Obama prior to his visit to Riyadh, accusing a “schizophrenic” Congress of being in cahoots with Iran in its attempt to pass a bill that would hold the kingdom responsible for involvement in the 9/11 terror attacks.\nAccording to the articles translated by MEMRI, the Guld news media claimed the 9-11 allegations lack any factual basis and are likely to cause irreversible damage to U.S.- Saudi ties.\nKhalaf Al-Harbi, a columnist for the official Saudi daily ‘Okaz, wrote an article demanding to know what made the U.S. change it’s mind. If Saudi Arabia was indeed the perpetrator, Harbi asks, “Why then did the U.S. destroy the impoverished Afghanistan until nothing was left standing there? Why did it invade Iraq and set it back a thousand years? Why did it choose Saudi Arabia, of all [countries], as its ally in its war on terror and rely on it heavily in its fight against Al-Qaeda?”\n“Has mother America become schizophrenic, that it now accuses us of backing our common enemy?!” Harbi adds.\nMeanwhile, Salman Al-Dosari, editor of the London-based Saudi daily Al-Sharq Al-Awsat, wrote:\nThese claims are not based on facts, proof, or legal evidence, and their actual purpose is to cause cracks in the unified ranks of the two main allies that oppose terrorism [Saudi Arabia and the U.S.] and to undermine the trust between the two sides. How indeed can you win a war when you doubt your main ally [in the struggle] against your common enemy?\nDosari goes on to assert that there is “clear cut evidence” to prove that the damage Al-Qaeda exacted on Saudi Arabia far exceeds the damage done on the U.S. but that regardless, even “if 15 of the 9/11 perpetrators were Saudis, this is not grounds for Saudi Arabia bearing the blame for their crime forever.”\nOther Gulf states are also furious at the bill. Faisal Al-Sheikh wrote in the Bahraini daily Al-Watan that the U.S. feels threatened by Saudi’s emergence as the primary force in the Arab world, as its warming relations with Egypt and Turkey attest.\n“Washington cannot stand idly by and watch this happen,” Sheikh writes, hence Congress’ bill which serves “the domination[-oriented] trends of the White House, even if President Obama is trying – like in some pathetically directed movie scene – to seem as though he is trying to dissuade Congress from passing this bill.”\nWriting for the Bahraini daily Akhbar Al-Khaleej, columnist ‘Abd Al-Mun’im Ibrahim claims that the Iran-U.S. axis is clear in Congress’ recent bill. According to Ibrahim, “Recent debates in Congress reveal the existence of a pro-Iran, anti-Saudi lobby in the U.S. government.”\nSaudi Foreign Minister Adel Al-Jubeir threatened, during a March visit to the U.S., that his country would sell off 750 billion dollars in U.S. Treasury securities and other assets to avoid their being frozen by U.S. courts, according to the New York Times.\nAdministration officials, however, claimed that Obama “really cleared the air” with King Salman at their meeting in Riyadh on Wednesday.","url":"https://www.breitbart.com/middle-east/2016/04/24/saudi-gulf-press-u-s-schizophrenic-playing-into-hands-iran-with-allegations-of-saudi-involvement-in-september-11-attacks/"}
