{"authors":["Kelly Mclaughlin For Mailonline"],"date_download":"2018-10-23 03:15:11","date_modify":"2018-10-23 03:15:11","date_publish":"2017-03-16 13:59:10","description":"The Pentagon is expected to put $2.8billion more toward its Presidential Aircraft Recapitalization program by 2021, reaching a total of $11billion over two decades.","filename":"data/vaneerConsumption/USsettospend11bonpresidentialfleetin2decades.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54342D00000578-0-image-a-52_1489672689183.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320336_US-set-spend-11b-presidential-fleet-two-decades_1540264511.html","title":"US set to spend $11b on presidential fleet in 2 decades","title_page":"US set to spend $11b on presidential fleet in 2 decades | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"President Donald Trump has repeatedly vowed to cut the price of the Air Force One program, but the aircraft fleet's history shows that might be harder than he expected, according to a new report.\nThe Pentagon is expected to put $2.8billion more toward its Presidential Aircraft Recapitalization program by 2021.\nIf that money goes through, the US will have spent $11billion on the aircraft fleet over two decades - not including the funds needed to maintain the current fleet - having already spent $8.8billion since 2002.\nPresident Barack Obama was as critical of the funding as Trump has been, but his effort to cut costs came at a significant delay and with very little success.\nAnd a report from Bloomberg News shows that there have been several attempts at not only cutting costs, but also revamping the nearly 50-year-old fleet. Not much has been successful.\nScroll down for video\nThe Pentagon is expected to put $2.8billion more toward its Presidential Aircraft Recapitalization program by 2021, reaching a total of $11billion over two decades. Pictured above, Trump waves from the steps of Air Force One earlier this month\nTrump first wrote about the cost of the presidential aircraft fleet in December, saying the US Air Force should cancel its order with Boeing for a pair of planes that are slated to serve as the new Air Force One and a backup aircraft\nA plane revitalization project - named the Presidential Aircraft Recapitalization program - has been in the works for several years, but is has faced plenty of stoppage.\nThe two 747-200s that serve Air Force One will hit the end of their 30-year life expectancy this year, after first taking flight in 1987.\nMany of the Marine One helicopters have been part of the fleet since as early as 1974.\nThe helicopter squadron contains 23 aircraft, 11 of which have been operating since 1974. Eight more date back to 1989.\nOutside the helicopter fleet, is the presidential airplane fleet, which includes Air Force One, smaller Gulfstream jets and older 757s that fly the Vice President. Four ultra-reinforced 'Doomsday' 747s sit ready at Offutt Air Force Base in Nebraska.\nIn 2002, the Navy, which oversees Marine aviation programs, started a formal project to develop a new Marine One.\nIt came after then-President George W Bush became frustrated at the lack of communication systems aboard Air Force One on September 11.\nThe White House considered several options, including using other aircraft in the fleet as replacements, but ultimately decided to unveil a new helicopter by 2007.\nA plane revitalization project - dubbed as the Presidential Aircraft Recapitalization program - has been in the works for several years, but is has faced plenty of stoppage\nDubbed the VH-71 by the Navy, the helicopters were projected to cost $180million each, which turned out to be an extremely low estimate.\nThe plan for the helicopter was for it to be an 'Oval Office in the sky', complete with video conferencing and heavy armor.\nThe fleet number fluctuated from 23 to 36, before going down again.\nThe initial budget for the program was set at $6.5billion, then increased to $11.5billion by January 2007.\nBy the time Obama was sworn in in 2009, the program had an estimated $13billion cost.\nIn May 2008, after spending $3.3billion on the project, the Pentagon shut down the Marine One Program.\nBut, after just three years, Obama decided to re-open the project.\nThe Navy took a new approach the second time around, trying to cut costs, lower passenger capacity and getting rid of the planned kitchen and toilet.\nIn 2013, the US Government Accountability Office praised the Navy's 'rational balance between requirements, costs and schedule'.\nThe Pentagon is expected to put $2.8billion more toward its Presidential Aircraft Recapitalization program by 2021. Pictured above, Trump poses in his office aboard Air Force One\nSikorsky Aircraft Corp, in Stratford, Connecticut, which manufactured every helicoptor in the squadron's first fleet, when Dwight Eisenhower was in office, won a $1.2billion contract to start the project.\nTwo helicoptors have been built and are currently undergoing groud testing.\nIf all goes well, their debut could come as early as 2020, and the full fleet would arrive by 2023.\nThe total cost of the project is estimated to be $5billion, but Colonel Robert Pridgen, head of the Marine One program, said the cost is 'coming down as we speak'.\nBut, senior Pentagon adviser John Young said, the president 'is going to get significantly less helicopter for that money'.\nTrump will have a bit of influence over the next Air Force One, which is still in its planning phase.\nBut in the month after he was elected president, Trump voiced criticism over the cost of the new aircraft.\nTrump first wrote about the cost of the presidential aircraft fleet in December, saying the US Air Force should cancel its order with Boeing for a pair of planes that are slated to serve as the new Air Force One and a backup aircraft.\n'Boeing is building a brand new 747 Air Force One for future presidents, but costs are out of control, more than $4 billion. Cancel order!' Trump tweeted.\nIf the $2.8billion is spent on new aircraft, the US will have spent $11billion on the aircraft fleet over two decades, having already spent $8.8billion since 2002. Pictured above, Trump and First Lady Melania Trump wave from the steps of Air Force One\nHe hinted to reporters in the lobby of Trump Tower less than an hour later, however, that the Boeing contract could be continued once he moves in at 1600 Pennsylvania Avenue because he wants Boeing to be profitable – to a point.\n'The plane is totally out of control. It's going to be over $4billion – it's for [the] Air Force One program. And I think it's ridiculous,' Trump said. 'I think Boeing is doing a little bit of a number. We want Boeing to make a lot of money, but not that much money.'\nSince taking office, Trump has had nothing but praise for the current Air Force One plane, taking it on regular trips to Mar-a-Lago and using it on a visit to Boeing's South Carolina facility.\nIt still remains unclear where Trump's $4billion number came from.\nCongress set aside $1.65billion last year to cover the entire Air Force One replacement program through 2019.\nLast year that number grew to $2.8billion through 2021. But as of December, Boeing's contract only called for $170million in payments for research, development and other preparations – not the plane-building itself.\nSenior Pentagon official John Young told Bloomberg: 'Both of these systems cost an absurd amount of money, but that's what we choose to do for the President of the United States to have increased safety and security.\n'There aren't magic lessons that's going to make it cost half as much.'","url":"https://www.dailymail.co.uk/news/article-4320336/US-set-spend-11b-presidential-fleet-two-decades.html"}
