{"authors":["Compiled Democrat-Gazette Staff Wire Reports"],"date_download":"2018-10-30 14:07:54","date_modify":"2018-10-30 14:07:54","date_publish":"2018-10-29 00:00:00","description":"Senior U.S. officials said Monday that some 5,200 additional U.S. troops will deploy to the border with Mexico by the end of the week, as President Donald Trump likened a caravan of Central American migrants who are heading north to \"an invasion.\"","filename":"data/vaneerConsumption/USsending5200troopstotheborder.json","image_url":"https://media.arkansasonline.com/img/photos/2018/10/29/resized_250499-4aimmigraion-52pbw_57-25303_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30__1540908474.html","title":"U.S. sending 5,200 troops to the border","title_page":"U.S. sending 5,200 troops to the border","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A new group of Central American migrants is met by Mexican Federal Police after the migrants waded in mass across the Suchiate River, which connects Guatemala and Mexico, on Monday in Tecun Uman, Guatemala.\nWASHINGTON -- Senior U.S. officials said Monday that some 5,200 additional U.S. troops will deploy to the border with Mexico by the end of the week, as President Donald Trump likened a caravan of Central American migrants who are heading north to \"an invasion.\"\nThe deployments, labeled Operation Faithful Patriot, already are underway, said Air Force Gen. Terrence O'Shaughnessy, the chief of U.S. Northern Command. He said the military, working alongside U.S. Customs and Border Protection, will focus first on hardening the border in Texas, followed by Arizona and California.\nO'Shaughnessy spoke at a news conference alongside Kevin McAleenan, commissioner of Customs and Border Protection.\nThe announcement of troops did not appear to discourage some 4,000 migrants in the first of at least three caravans making their way toward the U.S. border. The first group is the largest, covering about 20-30 miles per day, and it is still at least 1,000 miles away from the border.\nA second group containing hundreds of Central Americans crossed a river from Guatemala into Mexico on Monday, defying a heavy Federal Police presence deployed to patrol that country's southern frontier. A third group, with about 300 Salvadorans, set off from San Salvador on Sunday.\nO'Shaughnessy said the U.S. deployments will include three combat engineer battalions, members of the U.S. Army Corps of Engineers and troops who specialize in aviation, medical treatment and logistics. He highlighted the deployment of helicopters, which will have night-vision capabilities and sensors.\n\"We'll be able to spot and identify groups and rapidly deploy [Customs and Border Protection] personnel where they are needed,\" he said.\nO'Shaughnessy said the Pentagon also will deploy military police units and cargo aircraft, including three C-130s and one C-17. Combined command posts will be established to integrate U.S. military and Customs and Border Protection efforts.\n\"As we sit right here today, we have about 800 soldiers who are on their way to Texas right now,\" the general said. \"They're coming from Fort Campbell. They're coming from Fort Knox. They're moving closer to the border. They're going to continue their training, and they're ready to deploy to actually be employed on the border.\"\nThe Pentagon already has sent 22 miles of concertina wire to the border, and has enough additional wire to cover 150 miles, he said.\nMilitary personnel are legally prohibited from engaging in immigration enforcement. That spurred criticism and accusations that the deployment was a publicity stunt.\n\"Sending active military forces to our southern border is not only a huge waste of taxpayer money, but an unnecessary course of action that will further terrorize and militarize our border communities,\" said Shaw Drake of the American Civil Liberties Union's border rights center at El Paso, Texas.\nHowever, supporters note that the troops can still perform a wide variety of functions, such as transporting supplies for the Border Patrol.\n'INVASION' TWEET\nThe deployments thrust the military further into a political fight in which the president has cast the migrants as a national security threat.\n\"Many Gang Members and some very bad people are mixed into the Caravan heading to our Southern Border,\" Trump said Monday on Twitter. \"Please go back, you will not be admitted into the United States unless you go through the legal process. This is an invasion of our Country and our Military is waiting for you!\"\nMcAleenan said the aim was to deter migrants from crossing illegally between ports, but he conceded his officers were overwhelmed by a surge of asylum seekers. Migrants are entitled under both U.S. and international law to apply for asylum, but there is already a bottleneck of asylum seekers at some U.S. border crossings, in some cases as long as five weeks.\nTrump said Monday night in an interview with Fox News host Laura Ingraham that if any of the migrants do make it to the border and apply for asylum, the U.S. plans to \"hold them until such time as their trial takes place.\"\n\"We're going to build tent cities,\" he said. \"We're going to put tents up all over the place. We're not going to build structures and spend all of this, you know, hundreds of millions of dollars. We're going to have tents. They're going to be very nice, and they're going to wait, and if they don't get asylum, they get out.\"\nCustoms and Border Protection agents using crowd-control equipment rehearse formations and maneuvers Monday at the Gateway International Bridge in Brownsville, Texas.\nMcAleenan said Mexico was also prepared to offer asylum to the caravan, and at least 1,895 caravan members have applied there. Hundreds more have accepted offers of return to their places of origin.\n\"If you're already seeking asylum, you've been given a generous offer,\" he said of Mexico. \"We want to work with Mexico to manage that flow.\"\nImmigrant-rights groups have accused Trump of demagoguery on the issue by inflating the size and security threat posed by the migrants, made up largely of families, including children. No evidence has emerged to support the claim that the caravans contain members of the MS-13 gang or any other gang.\nHowever, the second caravan has been marred by violence. Guatemala's Interior Ministry said police officers were injured when the migrant group broke through border barriers on Guatemala's side of the bridge spanning the Suchiate River, which separates Tecun Uman in southwest Guatemala from Ciudad Hidalgo in southeast Mexico.\nMexico authorities said migrants attacked its agents with rocks, glass bottles and fireworks when they broke through a gate on the Mexican end but were pushed back. During the first push on Sunday, one migrant died of a head wound apparently caused by a rubber bullet.\nOn Monday, Mexican Interior Secretary Alfonso Navarrete Prida lamented what he called a second \"violent attempt\" to storm the border, accusing people of placing the elderly, pregnant women and children at the front, putting them at risk of being crushed.\n\"Fortunately, that did not happen,\" he said.\nAbout 600 migrants in the second caravan chose to avoid the bridge Monday, instead wading in groups through the river's murky waters.\nA low-flying police helicopter hovered overhead, apparently trying to use the downdraft from its rotors to discourage them. Guatemala's Noti7 channel reported that one man drowned.\nOnce on the Mexican side, the migrants were surrounded and escorted by black-uniformed officers as sirens wailed. But they were allowed to stay in Ciudad Hidalgo, and they said they hoped to continue onward early this morning.\nRIVER CROSSING\nThe first caravan had largely avoided the bridge gate, and confrontations with police, by passing through the Mexico-Guatemala border via the river, wading or on rafts.\nThat group rested outside the city of Tapanatepec, Mexico, on Sunday before setting out Monday toward that day's goal: Niltepec, about 34 road miles to the northwest. Federal Police patrols drove alongside encouraging them to stay on the shoulder.\nVictor Argueta, 54, of Santa Barbara, Honduras, recalled that he and his wife had spent two nights sleeping on the international bridge before eventually crossing the river on a raft.\n\"We came with the goal of wanting to improve our future for ourselves and for our family. We did not come with the intention of finding death on the road,\" Argueta said, reflecting on the news of the Honduran man's death the previous night. \"Maybe that boy came with good intentions, perhaps with a young person's idea of supporting his family.\"\nSandra Rodriguez, 31, had heard about the incident because her husband's family lives in Tecun Uman. The couple from Guatemala City had joined the caravan in the border town and never considered someone could die on the bridge.\n\"I think they are risking much to cross to this side,\" Rodriguez said.\nOthers in the first group have grown exhausted. Hasiel Isamar Hernandez, 28, is a mother of three who has been with the caravan since it started with about 160 people in her hometown of San Pedro Sula, Honduras, and she has seen the people who have joined the group in El Salvador and Guatemala.\n\"Of the friends that I have been with, all want to go back,\" Hernandez said, adding that many had blistered feet. For her, the last straw was when her husband told her that her 3-year-old daughter back home had stopped eating because she missed her mother.\nAnother Honduran, Teodozo Melendez, 31, was also waiting for a bus back home after fighting a fever for two days. His body ached.\n\"I thought it would be easier,\" Melendez said, lying on the ground.\nMelendez's goal had been to join relatives living in Houston. His experience with the caravan had taught him one thing, he said: \"The next time, I'm going to need a 'coyote'\" -- a smuggler.\nInformation for this article was contributed by Dan Lamothe, Nick Miroff, David Nakamura, Seung Min Kim, Alex Horton and Paul Sonne of The Washington Post; and by Santiago Billy, Christopher Sherman, Robert Burns, Colleen Long, Jill Colvin, Julie Watson, Sonia Perez D., Elliot Spagat and Lolita C. Baldor of The Associated Press.\nA Section on 10/30/2018","url":"https://www.arkansasonline.com/news/2018/oct/30/u-s-sending-5-200-troops-to-the-border-/"}
