{"authors":["Associated Press"],"date_download":"2018-10-23 02:37:41","date_modify":"2018-10-23 02:37:41","date_publish":"2016-01-28 17:38:53","description":"WASHINGTON (AP) — Migrant children in the government's care were placed in U.S. homes and left vulnerable to human trafficking due to sometimes non-existent ...","filename":"data/vaneerConsumption/USSenateprobefaultsgovtformigrantchildabuse.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:adefcdbaac894eb0b5d67a7df8b4cd3d-2vdWmEltwXfba0ce28e632b35ab2-290_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420920_US-Senate-subcommittee-examines-migrant-children-abuse_1540262261.html","title":"US Senate probe faults gov't for migrant child abuse","title_page":"US Senate probe faults gov't for migrant child abuse | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US Senate probe faults gov't for migrant child abuse\nWASHINGTON (AP) — Migrant children in the government's care were placed in U.S. homes and left vulnerable to human trafficking due to sometimes non-existent screening by the Department of Health and Human Services, according to a congressional report released Thursday.\nThe investigation says the department failed to run background checks on the adults in the sponsors' households, failed to visit sponsors' homes and failed to realize some sponsors were accumulating multiple unrelated children, which can be a sign of human trafficking.\nLawmakers contend the government weakened its child protection policies as it was overwhelmed by tens of thousands of children crossing the border from Central America. A Senate subcommittee held a hearing Thursday to release the report and examine weaknesses in the department's placement of migrant children.\nMarvin Velasco, 15, practices soccer outside his new home in Los Angeles on Monday, Jan. 11, 2016. Velasco's perilous journey from Guatemala included crossing a river, even though he doesn't swim, and getting lost at night in a frigid desert. Once in the United States, he turned himself in to U.S. Border Patrol agents in Reynosa, Texas, and was sent to a shelter run by the U.S. Department of Health and Human Services' Office of Refugee Resettlement. (AP Photo/Mark J. Terrill)\nAt the hearing, HHS officials declined to fully answer many of the senators' questions, at times saying they did not have the legal authority from Congress to follow up on the children.\nThe investigation by the panel echoes the findings of an Associated Press investigation that found more than two dozen unaccompanied children were sent to homes across the country where they were sexually assaulted, starved or forced to work for little or no pay.\nSen. Rob Portman, the Republican chairman of the panel, says the HHS placement program for migrant children suffers from \"serious, systemic defects.\"\nThe congressional investigation and hearing are in response to a case in Portman's home state of Ohio, where six Guatemalan unaccompanied minors were placed with human traffickers, including sponsors and their associates. Lured to the U.S. with the promise of an education, the teens instead were forced to work up to 12 hours a day on egg farms under threats of death.\nThe report says the department did not conduct any home visits in the Ohio case and performed visits in less than 5 percent of cases overall from 2013 to 2015.\nMark Greenberg, acting assistant secretary for HHS's Administration for Children and Families, testified at the hearing that the Ohio case is a \"deeply dismaying event\" but said he is not able to discuss details due to an ongoing criminal investigation. He said policies in place at the time were followed.\nLawmakers from both parties bristled at the officials' answers, saying they weren't adequate when the lives of children had been endangered.\nThe panel's top Democrat, Claire McCaskill, said she is \"disgusted and angry\" by the results of the investigation.\n\"The bottom line is when a child is admitted into our county, the United States of America should be an example for the world of how we care for those children,\" McCaskill said.\nSen. Heidi Heitkamp, a Democrat, criticized the overly legal tenor of many of the officials' responses and asked if they understood why the senators were angry. Sen. John McCain, R-Arizona, stopped his line of questioning and left the hearing after saying that the witnesses were \"the definition of noncooperative.\"\nPortman said federal officials don't know how many migrant children they've sent to live with convicted criminals across the U.S. over the last three years.\n\"Perhaps the most troubling, unanswered question is this: how many other cases are there like the Marion trafficking case?\" Portman asked. \"The answer is HHS doesn't know.\"\nThe panel's report says the agency still can't track whether an adult is attempting to sponsor multiple children at the same time. The agency also commonly places unaccompanied children with alleged distant relatives or family friends without setting eyes on the sponsor or their environment. In addition, current policies allow sponsors to prevent children from being contacted by social workers who go to the home for a check-up visit.\n___\nBurke reported from San Francisco.\nMarvin Velasco, 15, poses at his new home in Los Angeles on Monday, Jan. 11, 2016. In September 2014, Velasco said he soon realized that nine other people lived in the apartment of his first sponsor in the United States, a distant relative whom he had never met. The sponsor told Velasco he would be punished if he left the apartment, and demanded rent payments. When Velasco told the sponsor he wanted to study, the man called the boy's parents in Guatemala, threatening to kick him out if they didn't pay. Then he started withholding food, Velasco said. (AP Photo/Mark J. Terrill)\nMarvin Velasco, 15, poses for a photo at his home in Los Angeles on Monday, Jan. 11, 2016. Velasco says his first U.S. sponsor \"told authorities that he was going to take me to school and help me with food and clothing, but it wasn't like that at all.\" Velasco has since been granted special legal status for young immigrants. \"The whole time, I was just praying and thinking about my family.\" (AP Photo/Mark J. Terrill)\nMarvin Velasco, 15, practices music at his church in Los Angeles on Monday, Jan. 11, 2016. With help from the son of Velasco's abusive sponsor, he escaped and sought sanctuary in this nearby church, where he met a parishioner who took him in and became his legal guardian. Now he lives with a Guatemalan immigrant family that is raising him as a son, and is thriving in school and leads the church's devotional band. (AP Photo/Mark J. Terrill)\nMarvin Velasco, 15, right, poses for a photo with his new sponsor, Ingrid Ainspac, at their home in Los Angeles on Monday, Jan. 11, 2016. After escaping from a previous sponsor who was abusive, he sought sanctuary in a nearby church, where he met a parishioner who took him in and became his legal guardian. He now lives with a Guatemalan immigrant family, which is raising him as a son. (AP Photo/Mark J. Terrill)","url":"https://www.dailymail.co.uk/wires/ap/article-3420920/US-Senate-subcommittee-examines-migrant-children-abuse.html"}
