{"authors":[],"date_download":"2018-10-22 23:00:32","date_modify":"2018-10-22 23:00:32","date_publish":"2017-03-16 05:33:14","description":"Angela Garlington feels alone in the way she teaches science at a high school in Odessa, a Texas city populated by oil field workers. When she teaches...","filename":"data/vaneerConsumption/USstatesmulllawsallowingreligioninscienceclass.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/05/wire-226533-1489642397-983_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4318918_US-states-mull-laws-allowing-religion-science-class_1540249232.html","title":"US states mull laws allowing religion in science class","title_page":"US states mull laws allowing religion in science class | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Several US states are considering laws which would give teachers latitude to present science \"that may cause controversy\" as a debatable theory\nAngela Garlington feels alone in the way she teaches science at a high school in Odessa, a Texas city populated by oil field workers.\nWhen she teaches evolution, the science of how Earth's creatures evolved over billions of years, Garlington approaches it as a theory on par with creationism, the belief that life on Earth was created by God as described in the Bible.\n\"I simply tell my students (that) as educated young adults they have a right... to choose what they believe,\" said the teacher in her late 40s.\n\"I don't have any idea if my colleagues will teach both sides of a controversial issue, but I always have and probably always will.\"\nTexas state legislators are now considering a bill introduced in February that would offer teachers like Garlington some legal protection, by giving them latitude to present science \"that may cause controversy\" as a debatable theory.\nTexas is one of eight US states where such laws have been proposed since the beginning of the year. South Dakota, Oklahoma, Iowa, Alabama, Indiana, Florida and Arkansas are the others.\nThe bills are the latest salvo in the debate in the United States over how science is taught in schools and whether religious beliefs should be considered in the classroom.\nForty-two percent of Americans believe that God created humans in their present form some 10,000 years ago, according to a 2014 Gallup poll that showed little change since the study was launched three decades earlier.\nAnother 31 percent believe that humans evolved from less advanced life forms, under God's guidance, while 19 percent believe God had nothing to do with the process of evolution.\n- 'Don't you believe in God?' -\nThe issue is particularly emotive in conservative southwest Texas, where Kimberly Villanueva teaches at a middle school in the small, cotton-farming town of Stanton, about 45 minutes east of Odessa.\n\"I had children last year get up and leave the classroom when we taught plate tectonics and evolution,\" she said.\n\"Don't you believe in God?\" she recalled the students asking her.\nUnder current law, Villanueva is not allowed to answer that question or defend her beliefs.\nShould the Texas bill become law, Villanueva believes she would at least be able to have discussions that would keep students in the classroom and \"open (their) minds to scientific possibilities as well.\"\nCritics of the bills in Texas and other states charge that they are an attempt to circumvent constitutional limitations requiring separation of church and state. They say the bills give teachers the ability to introduce religious theories as alternative explanations to science.\nThere have been multiple court cases dating back decades on teaching creationism in US schools.\nAround 70 bills addressing the issue have surfaced across the United States since 2004, according to Glenn Branch, deputy director of the National Center for Science Education.\nThe recently-proposed bills aim to head off potential court challenges by giving teachers the option of teaching religious theories in science class, rather than a mandate that they do so.\nBut such legislative attempts have to date had mixed success.\nLouisiana enacted such a bill in 2008 and Tennessee followed suit in 2012.\nBut in conservative South Dakota and Iowa this year, similar bills did not succeed.\nTwo introduced in the Iowa legislature died in committee, failing to advance for a full debate.\n- 'Science in science class' -\nDetractors say these laws boosting teachers' options can sow confusion in the classroom and bind the hands of school administrators.\n\"Allowing the teacher to teach creationism would risk the possibility of a lawsuit from a parent objecting that it's unconstitutional to teach creationism,\" Branch said.\n\"Stopping the teacher from proceeding would risk the possibility of a lawsuit from the teacher.\"\nThe South Dakota bill died in the state legislature in a matter of weeks, thanks in part to the opposition of David Evans, executive director of the National Science Teachers Association.\n\"We strongly support teaching science in science class and are strongly opposed to teaching other things in science class,\" said Evans, whose group crusaded against the bill with a letter-writing campaign.\nBut Garlington says she has not faced any backlash for the way she blends science and religion in her Texas classroom.\nAnd she believes the bill, should it become law, would embolden more teachers to adopt her methods.\n\"Until it becomes a standard, I don't think (creationism) will be taught in classrooms,\" she said.","url":"https://www.dailymail.co.uk/wires/afp/article-4318918/US-states-mull-laws-allowing-religion-science-class.html"}
