{"authors":["Associated Press"],"date_download":"2018-10-23 01:14:20","date_modify":"2018-10-23 01:14:20","date_publish":"2016-01-29 14:59:32","description":"NEW YORK (AP) — U.S. stocks opened higher, despite signs of weak economic growth, on encouraging earnings news and higher energy prices. The government said ...","filename":"data/vaneerConsumption/USstocksopenhigherdespitesluggisheconomy.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:041f982199b0456fba4e7f75cb8557c7-4PuZeKVXE7cd9005b2c876b60201-93_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422224_Japan-stocks-gyrate-BOJ-markets-gain_1540257260.html","title":"US stocks open higher despite sluggish economy","title_page":"US stocks open higher despite sluggish economy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US stocks open higher despite sluggish economy\nNEW YORK (AP) — U.S. stocks opened higher, despite signs of weak economic growth, on encouraging earnings news and higher energy prices.\nThe government said Friday that growth in the U.S. economy slowed as consumers spent less, business didn't invest as much, and exports fell.\nMicrosoft rose 5 percent after it reported stronger-than-expected results. Consol Energy rose sharply along with the price of natural gas.\nFILE - This Jan. 4, 2010, file photo, shows an historic marker on Wall Street in New York. Japan led global stock markets higher Friday, Jan. 29, 2016, after its central bank introduced a negative interest rate policy in the latest move to overcome malaise in the world's third-biggest economy. The yen dived against the dollar and the euro. (AP Photo/Mark Lennihan, File)\nAmazon shares fell 9 percent reporting that its costs rose more than expected.\nThe Dow Jones industrial average rose 125 points, or 0.7 percent, to 16,194 as of 9:35 a.m. Eastern time.\nThe Standard & Poor's 500 index rose points, or 0.7 percent, to 1,905. The Nasdaq composite rose points, or 0.5 percent, to 4,528.","url":"https://www.dailymail.co.uk/wires/ap/article-3422224/Japan-stocks-gyrate-BOJ-markets-gain.html"}
