{"authors":[],"date_download":"2018-10-30 01:15:32","date_modify":"2018-10-30 01:15:32","date_publish":"2016-09-09 00:23:56","description":null,"filename":"data/vaneerConsumption/USSubsidizedTerror.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/09/Secretary_Kerry_Speaks_With_Palestinian_Authority_President_Abbas_Before_Meeting_In_West_Bank_About_Gaza_Cease-Fire_14701754686.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862132.html","title":"U.S. Subsidized Terror","title_page":"U.S. Subsidized TerrorThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Palestinian Authority President Mahmoud Abbas and his government incite their citizens to hate Israelis and incentivize them to murder civilians using a “pay-to-slay” lethal form of welfare that makes killing and maiming far more profitable than working at a regular job.\nOn the morning of June 30, a 17-year-old Palestinian Arab terrorist, Muhammad Taraireh, stabbed to death a 13-year-old Israeli child, Hallel Ariel, as she slept in her bed.\nIt was an attack of unimaginable barbarity and viciousness. Hallel was stabbed dozens of times. Her assailant turned over her lifeless body to stab her in her back for good measure. The terrorist was killed after he stabbed another Israeli who rushed to the child’s bedside.\nThe killer’s mother, knowing that she will receive a premium reward for her sacrifice, bragged to the press that her son was a “hero,” a “martyr” who made her “proud” and urged others to kill Jews in the name of Allah. The Palestinian Authority (PA) declared Taraireh a “shahid,” or martyr, the highest honor achievable in Islam. This murder came days after a senior adviser to Abbas said in an interview, “Every place you find an Israeli, cut off his head.”\nHallel, a vivacious teen who just graduated from the 8th grade, wanted to grow up to be a zoologist. Her 17-year-old killer had a very different goal. On his Facebook page he expressed his desire to be a martyr because, as he had been taught, dying for Islam was a privilege.\nNow, according to PA law, his family will receive a one-time payment of about $1560 and a monthly stipend of about $364 from the Palestinian government’s “martyr fund.” Had Taraireh been married, his wife would receive an additional monthly stipend of $104 plus $52 per child. Had he been a member of the PA military force, they would receive additional funds depending on rank.\nThe minimum amount paid to imprisoned terrorists is equivalent to the average wage of a jobholder in the territories and 40% higher than the average wage for Gazans. The more gruesome the attack and the longer the prison sentence, the higher the financial reward. The maximum stipends paid are considered an unimaginable fortune within Palestinian society.\nYou have to hand it to Abbas — this is definitely the way to instigate terror!\nIn the last 9 months, Palestinians committed 155 stabbings, 96 shootings, 45 vehicular attacks and one bus bombing, resulting in 40 people were killed and 511 people injured. The killing and maiming continue, as do the bounty payments.\nThe Palestinian “pay-to-slay” program provides approximately $300 million per year to terrorists and their families for killing Jews. In the PA’s 2016 budget, $137.8 million is earmarked for prisoners and their families, and $172.5 million for the families of “martyrs” — 5-10% of the government’s total budget.\nThe PA receives around $1 billion in foreign aid every year. By underwriting the PA, international donors, including the U.S., are helping to fund blood money to terrorists like Muhammad Taraireh.\nThanks to public exposure of the “pay-to-slay” program, Congress passed legislation in 2014 requiring the U.S. to deduct from its development assistance to the PA an amount equal to the PA payment of blood money for terrorism. Then Abbas circumvented this law by transferring the responsibility for subsidizing terrorism from the PA to the PLO to create the appearance that the PA wasn’t involved. The U.S. State Department willingly bought into this fiction. Western dollars for terrorism continue to flow.\nIndiana Republican Senator Dan Coates has introduced new legislation to counter this Palestinian ruse and cut U.S. aid to the Palestinians “by an amount… equivalent to the amount expended by the Palestinian Authority, the Palestine Liberation Organization and any successor or affiliated organizations, as payments for acts of terrorism.” If this legislation is passed, it will be up to the State Department to implement it.\nDespite their incitement to hate and incentive to kill programs, Palestinians remain the perennial “victims du jour” in the minds of the misguided West and the corrupt UN. Hallel Ariel and other Israelis, the real victims, are blamed for the terrorism visited upon them.\nOnly in this world of moral inversion, where truth is trashed, lies are lauded and the depraved are empowered, would the Palestinian Authority have the audacity to say about Western funding of their “pay-to-slay” policy, “The world owes the Palestinians money for enabling Israel’s establishment.”","url":"https://spectator.org/251138-2/"}
