{"authors":[],"date_download":"2018-10-22 20:52:07","date_modify":"2018-10-22 20:52:07","date_publish":"2014-05-04 21:16:27","description":"A new study shows a almost half the students in public schools are nonwhite, while more than 4 in 5 of their teachers are white.","filename":"data/vaneerConsumption/USTeachersAreNowhereNearasDiverseasTheirStudents.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/419381/140504-classroom-jms-1725_f84a1929d453ad6ed6d8ce2a3b715ea5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_u-s-teachers-are-nowhere-near-diverse-their-students-n96796_1540241527.html","title":"U.S. Teachers Are Nowhere Near as Diverse as Their Students","title_page":"U.S. Teachers Are Nowhere Near as Diverse as Their Students ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAlmost half the students attending public schools are minorities, yet fewer than 1 in 5 of their teachers is nonwhite.\nNew studies from the Center for American Progress and the National Education Association are calling attention to this \"diversity gap\" at elementary and secondary schools in the United States. The groups want more to be done to help teachers more accurately mirror the students in their classrooms.\nThere were about 3.3 million teachers in American public elementary and secondary schools in 2012, according to a study by the National Center for Education Statistics. It said 82 percent were white, 8 percent were Hispanic, 7 percent were black and about 2 percent were Asian.\nStudents are a different story. In 1993, minority students made up 31 percent of the public school population; it was 41 percent in 2003.\nThe Center for American Progress' most recent statistics show 48 percent of the students in public schools are nonwhite — 23 percent Hispanic, 16 percent black and 5 percent Asian — and that percentage is expected to continue to increase.\n\"We project that this fall, for the first time in American history, the majority of public school students in America will be nonwhite,\" Education Secretary Arne Duncan said last week.\nIt becomes easier for students to believe \"when they can look and see someone who looks just like them, that they can relate to,\" said Kevin Gilbert, coordinator of teacher leadership and special projects for the Clinton Public School District in Clinton, Mississippi. \"Nothing can help motivate our students more than to see success standing right in front of them.\"\nIt will take political will to change those numbers, advocates say. Most states already have programs and policies intended to increase the number of minority teachers, \"but the yield of new teachers of color is disappointing,\" the NEA report said.\n— The Associated Press","url":"https://www.nbcnews.com/news/us-news/u-s-teachers-are-nowhere-near-diverse-their-students-n96796"}
