{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:53:46","date_modify":"2018-10-30 19:53:46","date_publish":"2015-06-23 21:51:58","description":"On Tuesday, Senate Minority Leader Harry Reid (D-NV) said the United States is the \"only advanced country\" where public \"mass violence\" occurs, and more gun control is needed now to keep Charleston-like attacks from happening again.","filename":"data/vaneerConsumption/USTheOnlyAdvancedCountryWhereMassViolenceOccurs.json","image_url":"https://media.breitbart.com/media/2015/02/harry-reid-injured-eye-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_23__1540929226.html","title":"US The 'Only Advanced Country' Where 'Mass Violence' Occurs","title_page":"Harry Reid: US The 'Only Advanced Country' Where 'Mass Violence' Occurs","title_rss":"NULL","source_domain":"breitbart.com","text":"On Tuesday, Senate Minority Leader Harry Reid (D-NV) said the United States is the “only advanced country” where public “mass violence” occurs, and more gun control is needed now to keep Charleston-like attacks from happening again.\nReid’s announcement that public “mass violence” does not happen in other advanced countries echoed a similar claim by Obama in which he referenced Charleston by claiming “that this type of mass violence does not happen in other advanced countries.”\nLike Obama, Reid overlooked the January 7 Paris attack in which two men completely ignored “restrictive” French gun controls and killed 12 people at Charlie Hebdo headquarters. He also ignored the February 14/15 attack in Copenhagen, where a gunman shot and killed two civilians and wounded five others. Nor did he reference the November 18, 2013, firearm-related attack on the daily French newspaper “Liberation.”\nAnd Reid made no mention of the July 22, 2011, attack in which Anders Behring Breivik killed 8 people with a bomb in Oslo, Norway, then shot and killed 69 people at a youth camp in Utoya.\nMoreover, CBSNews reported that Breivik’s ultimate goal had been to “kill all 600″ people attending the camp.\nThis the same thing Sen. Joe Manchin (D-WV) pushed after the heinous Sandy Hook attack, with the exception that Manchin admitted the gun control law would not have prevent Sandy Hook from happening. So he was just pushing gun control for the sake of gun control. And that is exactly what Reid is doing now, pushing new gun controls that would have in no way prevented the Charleston attack from taking place.\nWe already have background checks. And here is a short list of people who passed them to get their guns then used their guns to commit heinous crimes:\nElton Simpson and Nadir Soofi (Garland), Jared and Amanda Miller (Las Vegas), Elliot Rodger (Santa Barabara), Ivan Lopez (Fort Hood 2014), Darion Marcus Aguilar (Maryland mall), Karl Halverson Pierson (Arapahoe High School), Paul Ciancia (LAX), Andrew John Engeldinger (Minneapolis), Aaron Alexis (DC Navy Yard), Tennis Melvin Maynard (West Virginia), James Holmes (Aurora theater), Jared Loughner (Tucson), Nidal Hasan (Fort Hood 2009), Jiverly Wong (Binghamton), Seung-Hui Cho (Virginia Tech), Naveed Haq (Seattle), and Mark Barton (Atlanta).\nAnd if CNN is correct, we can add alleged Charleston gunman Dylann Roof to this list as well. According to CNN, “two law enforcement officials” revealed that Roof bought his gun at a Charleston gun store in April.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/06/23/harry-reid-us-the-only-advanced-country-where-mass-violence-occurs/"}
