{"authors":["Breitbart News"],"date_download":"2018-10-30 19:10:11","date_modify":"2018-10-30 19:10:11","date_publish":"2016-11-13 21:38:17","description":"CANBERRA, Australia (AP) — The United States has agreed to resettle an unspecified number of refugees languishing in Pacific island camps in a deal that is expected to inspire more asylum seekers to attempt to reach Australia by boat, officials said on Sunday. | Politics","filename":"data/vaneerConsumption/UStoResettleAustraliasRefugeesLanguishingonIslands.json","image_url":"https://media.breitbart.com/media/2016/11/GettyImages-621185170.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_13__1540926611.html","title":"US to Resettle Australia's Refugees Languishing on Islands","title_page":"US to Resettle Australia's Refugees Languishing on Islands | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"CANBERRA, Australia (AP) — The United States has agreed to resettle an unspecified number of refugees languishing in Pacific island camps in a deal that is expected to inspire more asylum seekers to attempt to reach Australia by boat, officials said on Sunday.\nPrime Minister Malcolm Turnbull would not say whether he had discussed the deal with President-elect Donald Trump during their telephone conversation on Thursday.\nThe Obama administration had agreed to resettle refugees among almost 1,300 asylum seekers held at Australia’s expense on the island nations of Nauru and Papua New Guinea. Another 370 who came to Australia for medical treatment then refused to return to the islands would also be eligible.\n“We deal with one administration at a time and there is only one president of the United States at a time,” Turnbull told reporters.\nTrump has called for a moratorium or tight restrictions on Muslim immigration. Most of the asylum seekers are Muslims from the Middle East, Africa and Asia.\nU.S. Secretary of State John Kerry confirmed that the United States had “agreed to consider referrals” from the United Nations refugee agency on Australia’s refugees.\n“We are going to work to protect vulnerable refugees around the world, and we’ll share that responsibility with our friends in the regions that are most affected by this challenge,” Kerry told reporters in New Zealand.\nAustralia refuses to resettle any refugee who has arrived by boat since the date the tough policy was announced on July 19, 2013.\nAustralia pays Nauru and Papua New Guinea to house boat arrivals and has been searching for countries that will resettle them.\nFew refugees have accepted offers to resettle in Papua New Guinea and Cambodia because most hope that Australia will eventually take them in.\nAny refugee who refuses to go to the U.S. would be given a 20-year visa to stay on Nauru, a tiny impoverished atoll with a population of 10,000 people, Immigration Minister Peter Dutton said.\nU.S. Department of Homeland Security officials are expected in Australia this week to begin assessing refugees.\nTurnbull would not say how many refugees the United States might take, but said the most vulnerable would be given priority.\n“Our priority is the resettlement of woman, children and families,” Turnbull said. “This will be an orderly process. It will take time. It will not be rushed.”\nRefugees who arrive in the future would not be sent to the United States, he said.\n“We anticipate that people smugglers will seek to use this agreement as a marketing opportunity to tempt vulnerable people onto these perilous sea journeys,” Turnbull said. “We have put in place the largest and most capable maritime surveillance and response fleet Australia has ever deployed.”\nAustralian Border Force Commissioner Roman Quaedvlieg said ships had been positioned to turn boats back to Indonesia if asylum seekers attempt to reach Australia in the hope of being sent to the U.S.\nNo people smuggling operation has successfully delivered asylum seekers to Australia by boat since July 2014.\nTurnbull announced at Obama’s Leaders’ Summit on Refugees in September that Australia would participate in the U.S.-led program to resettle Central American refugees from a camp in Costa Rica. Australia would also increase its refugee intake by 5,000 to 18,750 a year.\nTurnbull said at the time that the agreement to resettle Hondurans and El Salvadoreans was “not linked to any other resettlement discussions” involving Australia’s refugees getting to the U.S.\nRefugee Action Coalition spokesman Ian Rintoul said some refugees on Nauru were “hopeful” of resettlement in the United States, but were frustrated by the lack of detail. There seemed no short-term hope for asylum seekers on Papua New Guinea’s Manus Island, a male-only camp holding 873 men.\n“There are some people who if the United States is offered to them, certainly they will take it,” Rintoul said, adding that several would prefer Australia where they had family.\nRights groups have been scathing about conditions on the island immigration camps. Two asylum seekers set themselves on fire on Nauru this year and two local men have been convicted of murdering an Iranian asylum seeker during a 2004 riot at the Manus Island camp.\n___\nAssociated Press writer Nick Perry in Wellington, New Zealand, contributed to this report.","url":"https://www.breitbart.com/politics/2016/11/13/us-accept-refugees-australia/"}
