{"authors":["Associated Press"],"date_download":"2018-10-22 22:52:17","date_modify":"2018-10-22 22:52:17","date_publish":"2017-03-16 05:04:38","description":"FRANKFURT, Germany (AP) - U.S. President Donald Trump has vowed to get tough on trade partners like China, Mexico and Germany. Now his Treasury chief, Steven...","filename":"data/vaneerConsumption/UStoconfronttradepartnersatglobalfinancemeeting.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/10/wire-227843-1489661375-72_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318866_US-confront-trade-partners-global-finance-meeting_1540248737.html","title":"US to confront trade partners at global finance meeting","title_page":"US to confront trade partners at global finance meeting | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"FRANKFURT, Germany (AP) - U.S. President Donald Trump has vowed to get tough on trade partners like China, Mexico and Germany. Now his Treasury chief, Steven Mnuchin, will get his first opportunity to confront them all in one room.\nThe meeting of the 20 most powerful economies' finance ministers in Germany this week is likely to be dominated by talk about whether to commit to free trade, as previous meetings have - or implicitly accept that some countries may put up barriers, like tariffs, as Trump has promised.\nThe officials are also due to discuss their longstanding ban on manipulating currencies to gain economic advantage. Weakening a currency can help a country's exporters, but can also end up dumping its troubles with business costs and competitiveness on its trade partners.\nEmployees roll out a red carpet during preparations for the G20 summit of finance ministers in Baden-Baden, southern Germany, Monday March 13, 2017. The summit is scheduled for March 17 and March 18, 2017. (Uli Deck/dpa via AP)\nThe gathering Friday and Saturday in the southern German resort town of Baden-Baden will help set the tone for international commerce and finance and will give Mnuchin a chance to clarify what the U.S. position is.\nThe focus will be on the final statement issued jointly by the finance ministers on Saturday.\nLast year's gathering of the Group of 20 finance ministers in Chengdu, China, issued a statement opposing \"all forms of protectionism.\" This time, such unequivocal language could be softened to refer to trade that is \"open\" and \"fair,\" without the absolute opposition to import restrictions to benefit domestic workers.\nTrump has repeatedly emphasized that the U.S. needs a tougher approach to trade that would put American workers and companies first. He has already pulled the U.S. out of the proposed Trans-Pacific Partnership agreement with Japan and other Pacific Rim countries and he has started the process to renegotiate the North American Free Trade Agreement with Mexico and Canada, both of whom are G-20 members.\nAdditionally, Britain is preparing to pull out of the European Union and its free-trade zone that permits cross border business without import and export taxes, or tariffs, after voters chose to leave in a referendum last year.\n\"We are committed to open and fair trade,\" said a senior U.S. Treasury official this week, who briefed reporters only on condition of anonymity to discuss the U.S. position ahead of the talks. \"That means a trading system that has a level playing field for our firms and our workers globally. We will be encouraging policies that lead to that level playing field.\"\nThe official would not comment on what language might be in the finance ministers' final statement this week.\nHe also did not want to discuss what changes if any the United States might be seeking to the G-20's statement on currency policy but said Mnuchin would press counterparts to live up to their commitments to refrain from manipulation. During the campaign, Trump said he planned to name China a currency manipulator right after he took office. But since taking office, he has not discussed the topic.\nFederal Reserve chair Janet Yellen will join Mnuchin in representing the United States. Other prominent participants will be European Central Bank President Mario Draghi, China's finance minister, Xiao Jie, and the host finance minister, Wolfgang Schaeuble of Germany.\nThe G-20 is also due to discuss ways to strengthen the global economy and create more jobs. Other issues include international financial regulation and efforts to crack down on tax avoidance and evasion.\nThe summit is taking place with the global economy in relatively good shape: the International Monetary Fund predicts growth of 3.4 percent this year and 3.6 percent next year, compared with 3.1 percent last year.\nYet the election results in Britain and the U.S. have underlined discontent with trade and globalization and a sense among many that the benefits of a globalized economy - that is, fewer barriers to trade and business - do not reach enough people. Ahead of the summit, IMF head Christine Lagarde said that it was clear that highly educated workers benefit more from globalization and called for the G-20 to focus on \"greater efforts to equip lower-skilled workers with the tools they need to seek and find better-paying jobs.\" Those could include targeted job training and education.\nThe G-20 calls itself the premier forum for cooperation on international economic issues. Its members make up more than 80 percent of the world economy. The finance ministers' meeting will pave the way for a summit of national leaders in Hamburg, Germany, on July 7-8.\nThe G-20's decisions and statements are not legally binding on member countries. The group depends on the individual leaders' commitments to follow through back home, and the degrees and speed of compliance can vary.\n___\nCrutsinger contributed from Washington, DC.\nFILE- In this Wednesday, Nov. 30, 2016 file photo, Steven Mnuchin, talks with reporters in the lobby of Trump Tower, in New York. U.S. President Donald Trump has vowed to get tough on trade partners like China, Mexico and Germany. Now his Treasury chief, Steven Mnuchin, will get his first opportunity to confront them all in one room. (AP Photo/Evan Vucci, File)\nBritain's Chancellor Philip Hammond welcomes the US Secretary of the Treasury Steven Mnuchin, right, at 11 Downing Street in London, Thursday, March 16, 2017.(AP Photo/Frank Augstein)\nEmployees work during last preparations for the G 20 finance ministers meeting, in Baden-Baden, Germany, Monday, March 13, 2017. The Meeting is scheduled for March 17 and March 18, 2017. ( Uli Deck/dpa via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4318866/US-confront-trade-partners-global-finance-meeting.html"}
