{"authors":["Edwin Mora"],"date_download":"2018-10-30 21:00:42","date_modify":"2018-10-30 21:00:42","date_publish":"2015-11-19 17:36:26","description":"Poor oversight of government contractors in Afghanistan paved the way for insurgents to plant roadside bombs that killed U.S. troops.","filename":"data/vaneerConsumption/USTroopsinAfghanistanKilledDuetoPoorOversight.json","image_url":"https://media.breitbart.com/media/2015/11/US-troops-carry-casket-of-afghanistan-casualty-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_19__1540933242.html","title":"U.S. Troops in Afghanistan Killed Due to Poor Oversight","title_page":"U.S. Troops in Afghanistan Killed Due to Poor Oversight","title_rss":"NULL","source_domain":"breitbart.com","text":"Poor oversight of government contractors in Afghanistan paved the way for insurgents to plant roadside bombs under highways and embankments that ultimately killed and wounded U.S. troops, according to a congressional watchdog tasked with rooting out fraud, waste, and abuse in American taxpayer-funded projects to rebuild the war-torn country.\nImprovised explosive devices (IEDs), also known as roadside bombs, are the number-one killer of U.S. forces in Afghanistan.\nCulvert Denial Systems are designed to block access to roadway culverts by Taliban members and other insurgents, who can use the culverts to plant IEDs or other explosives.\nThe U.S. Department of Defense (DOD) has funded numerous contracts for the placement of denial systems across Afghanistan.\nIn October 2012, the office of the Special Inspector General for Afghanistan Reconstruction (SIGAR), a watchdog agency appointed by Congress, informed DOD:\nA large number of culvert denial systems might have been falsely reported by Afghan contractors as complete when, in fact, the denial systems were not installed or were installed in a defective manner, rendering them ineffective and susceptible to compromise by insurgents seeking to emplace IEDs.\nSIGAR, in July 2013, reported that it is investigating “whether this apparent failure to perform may have been a factor in the death or injury of several U.S. soldiers.”\nJohn Sopko, the special inspector general, delivered a speech at Brown University on Wednesday, in which he provided what appeared to be an update to SIGAR’s investigation, confirming that the Afghan contractors’ negligence resulted in the death and injury of U.S. service members.\n“Poor oversight can cost lives. In one particular case, U.S. contracting officer representatives did not properly oversee the installation of Culvert Denial Systems,” he said. “Culvert Denial Systems are barriers made of rebar at either end of culverts under a highway and are designed to prevent human entry, while still allowing water to flow through the culvert itself.”\n“Insurgents use culverts under the highways to plant improvised explosive devices (IED’s) intended to kill coalition forces and Afghan civilians,” he continued. “In this case, the contractor submitted fraudulent invoices stating the Culvert Denial Systems had been installed, but, as a result of the systems not being installed, American soldiers were killed and wounded by IEDs placed in these culverts.”\nSopko did not specifically say how many U.S. troops were killed and injured due to poor oversight and the contractors’ negligence. It is also uncertain when the casualties occurred. SIGAR did not immediately respond to requests for comment.\nAt least 2,229 members of the U.S. military have been killed and another 20,093 wounded in Afghanistan since the war started in October 2001, according to Pentagon figures. The majority of casualties are IED-related.\n“It sadly illustrates the simple fact that fraud can kill,” the inspector general told Brown University Wednesday, referring to the contractor billing the U.S. government for work that was never even started. “Oversight is not just about saving money but, more importantly, it can save lives.”\nSIGAR’s investigation highlighted in the agency’s 2013 report found that at least two Afghan contractors were awarded a contract for nearly $1 million to install the Culvert Denial Systems.\nIn just one province, the two contractors “committed fraud by billing the U.S. government for the installation of 250 culvert denial systems that were either never installed or incorrectly installed.”\n“To date, an Afghan contractor and his sub-contractor have both been arrested and charged with fraud and negligent homicide,” reported SIGAR in July 2013. “Our investigators are working with the Afghan Attorney General’s Office to arrest the second contractor.”\nThe U.S. has spent more than $110 billion of taxpayer funds on reconstruction programs in Afghanistan since the war started more than 14 years ago.\nDuring his speech at Brown University, Sopko also discussed current and future U.S. challenges in Afghanistan.\nTragedies related to the U.S. reconstruction effort in Afghanistan “often occur when the U.S. officials who implement and oversee programs fail to distinguish fact from fantasy, or output from outcome, and operate in a world where personal accountability is nearly nonexistent,” Sopko said in his prepared remarks:","url":"https://www.breitbart.com/national-security/2015/11/19/watchdog-u-s-troops-afghanistan-killed-due-contractors-poor-oversight/"}
