{"authors":["Eyder Peralta"],"date_download":"2018-10-23 05:47:19","date_modify":"2018-10-23 05:47:19","date_publish":"2014-11-21 00:00:00","description":"Four of them are the first Yemeni detainees to be transferred since 2010. There are still 143 men at the U.S. military prison at Guantanamo Bay, Cuba.","filename":"data/vaneerConsumption/USTransfers5GuantanamoDetaineesToGeorgiaSlovakia.json","image_url":"https://media.npr.org/assets/img/2014/11/21/171668837_wide-e2c1b32edccb59532f78685d035f8525c812565b.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_11_21_365647274_u-s-transfers-5-guantanamo-detainees-to-georgia-slovakia_1540273639.html","title":"U.S. Transfers 5 Guantanamo Detainees To Georgia, Slovakia","title_page":"U.S. Transfers 5 Guantanamo Detainees To Georgia, Slovakia : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"U.S. Transfers 5 Guantanamo Detainees To Georgia, Slovakia\nEnlarge this image toggle caption Joe Raedle/Getty Images Joe Raedle/Getty Images\nThe United States has transferred five detainees being held at its prison in Guantanamo Bay, Cuba, to Georgia and Slovakia.\nAs The Wall Street Journal reports, four of the men are Yemeni, and that is important because they are the first Yemeni prisoners to be transferred since 2010. The newspaper explains:\n\"The U.S. banned transfers of Yemeni detainees to Yemen after Umar Farouk Abdulmutallab , a Nigerian man, attempted to blow up an airliner on Christmas Day 2009 with an underwear bomb made by a Yemen-based terror group. \"Yemeni detainees are the largest group in Guantanamo, and transferring those detainees from the prison remains an obstacle to closing it, according to human rights advocates. \"There now are 143 men held at Guantanamo, including 84 Yemen nationals, according to the Pentagon. Of the Yemenis held at the prison, 54 are eligible to be transferred from Guantanamo and have been cleared for release, the Pentagon said.\"\nIf you remember, President Obama has repeatedly vowed to close the Guantanamo prison, but congressional Republicans have opposed those attempts.\nDespite that, as The Associated Press explains, Congress eased restrictions on transferring detainees to countries willing to keep an eye on them.\nThe AP adds:","url":"https://www.npr.org/sections/thetwo-way/2014/11/21/365647274/u-s-transfers-5-guantanamo-detainees-to-georgia-slovakia"}
