{"authors":[],"date_download":"2018-10-30 00:56:25","date_modify":"2018-10-30 00:56:25","date_publish":"2018-06-28 21:20:23","description":null,"filename":"data/vaneerConsumption/USTurkishRelationsInNeedofCounseling.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/06/Screen-Shot-2018-06-28-at-2.42.15-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860985.html","title":"U.S.-Turkish Relations: In Need of Counseling","title_page":"U.S.-Turkish Relations: In Need of CounselingThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Updated June 29th, 2018\nOur relationship with Turkey is comparable to a failing marriage. One evening you come home from a long and difficult day at work only to find your spouse in bed with Vladimir Putin.\nOver the past decade, our diplomatic relationship with Turkey has become challenging. Between its questionable involvement in the Syrian Civil War, newfound friendship with Russia, and human rights abuses, one must ponder, what is our future together?\nFor the latter part of the 20th century and into the new millennium, Turkey stood as a firm and stable partner in a region defined by instability and conflict. Our relationship stemmed from our mutual wariness of the Soviet sphere of influence and was solidified through economic and security measures over the past 70 years. This included our aid to Turkey through the Truman Doctrine, its admittance into NATO, and our stationing of nuclear weapons in their country as a deterrent to Russia.\nThen came trouble in paradise, or rather, the 2011 Syrian Civil War. Our support for the Kurds — an ethnic group that spans across the region — against ISIS in northern Syria is a primary source of disconnect between the United States and Turkey. Turkey, whose love for the Kurds is second only to the Armenians, is vehemently opposed to their U.S. backing and has since threatened to stop allowing our use of the Incirlik Air Base to carry out operations in Syria. Despite Turkish opposition, the U.S. continues supporting the Kurds in order to maintain some stability in northern Syria.\nBe it the cause or effect of rising tensions and U.S. support for the Kurds, Turkey has since opted to work with the Iranians, and more unprecedentedly, the Russians, to act as the peace brokers in Syria. In April of this year, the three countries hosted a summit, where they pledged their partnership in bringing a peaceful end to the 7-year civil war. The development comes as a shock to many, as U.S.-Turkish relations have been primarily based on their mutual concern over Russian influence and aggression, which should be affirmed by both countries’ commitment to NATO. “Should” being the key word in that sentence.\nTurkey does not have an excellent track-record with NATO. Take its aggression towards Greece, also a NATO member state, and its naval assets in the Mediterranean Sea, for example. The Hellenic Navy has cited Turkish encroachment into Greek waters, and extremely antagonizing air maneuvering, including an instance of harassing a helicopter carrying Greek Prime Minister Alexis Tsipras and the Greek Armed Forces Chief Admiral.\nBeyond their aggression towards Greece, Turkey has recently signed a deal to purchase S-400 Air Defence systems from Russia — a move that has alarmed the United States and NATO. This comes in the midst of Lockheed Martin finalizing an F-35 Stealth Jet deal with the Turks. The U.S. Congress has denounced Turkey for its actions, and recently voted to sanction them as well as work to prevent the F-35 deal should it choose to continue pursuing a deal with Russia. NATO member states are fiercely opposed to Turkey’s adoption of the Russian air system as well, with some accounts of murmuring over Turkey’s future place in the alliance.\nIn all of these developments, Turkey has become increasingly authoritarian, cracking down on dissidents and ethnic Kurds across the country, especially since the failed coup d’état of 2016. Recep Tayyip Erdogan won his presidential re-election on June 24, and secured the powers granted to the presidency in a referendum called for after the coup. It includes absorbing the powers of the Prime Minister, ability to issue presidential decrees with greater weight, and appointing and removing individuals to and from government positions at will.\nAll of this considered, the United States must take a serious look at its future with Turkey. In stark contrast to our productive past, we now face a partnership on the rocks. The Turkey we see today is defined by a tyrant who has at every juncture opted to oppress ethnic minorities, work against its allies, and seek out working relationships with their former adversaries. Relationships can get complicated and messy, but now is the time to decide on whether we salvage it, or break up.","url":"https://spectator.org/u-s-turkish-relations-in-need-of-counseling/"}
