{"authors":[],"date_download":"2018-10-22 20:06:26","date_modify":"2018-10-22 20:06:26","date_publish":"2016-05-13 00:00:00","description":"For the first time, the finale of the Eurovision Song Contest is being broadcast live on American television. The cable channel Logo will air Saturday's championship round live at 3 p.m. ET.","filename":"data/vaneerConsumption/USTVViewersCanNowWatchEurovisionSongContestsLiveFinale.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=477900492_1540238786.html","title":"U.S. TV Viewers Can Now Watch Eurovision Song Contest's Live Finale","title_page":"U.S. TV Viewers Can Now Watch Eurovision Song Contest's Live Finale : NPR","title_rss":"NULL","source_domain":"npr.org","text":"(SOUNDBITE OF SONG, \"LOIN D'ICI\")\nZOE: (Singing in French) Et quand tu chantes, oui moi, je chante aussi.\nDAVID GREENE, HOST:\nThis song has been entered at the Eurovision Song Contest. 180 million people watch this event and for the first time it's being broadcast live in the U.S. The show is in Stockholm. Andrew Jones is there to answer this question.\nUNIDENTIFIED WOMAN: Maybe you wonder what is this wonderful Eurovision Song Contest thing?\nANDREW JONES, BYLINE: If you like pyrotechnics, Cypriot rock songs, or Hungarian heartthrobs, Eurovision is the song contest for you.\n(SOUNDBITE OF ARCHIVED RECORDING)\nUNIDENTIFIED WOMAN: (Singing) We'll have two songs with sign language and three in a made-up tongue.\nJONES: Previous winners have included everyone from ABBA and Celine Dion, to a bearded Austrian drag queen. Countries from across Europe and beyond each submit a song. Viewers then vote on the live performances a. Two semifinals were held here in Stockholm this week leading up to the final on Saturday. And you can feel and see the excitement in the host city. I'm walking through the Eurovision village. It's a park in central Stockholm which has been transformed into a hotbed of all things Eurovision. There's a concert stage. A children's choir just performed. There are restaurants and merchandise stands, corporate sponsors and even a pop-up branch of the ABBA Museum. And there are lots of fans proudly supporting their countries.\nLUKE DAVIS: I'm Luke. Luke Davis.\nJONES: And so Luke describe for me what you're wearing.\nDAVIS: Well, it's a Union Jack Suit.\nJONES: I asked an Irishman in a green suit covered with shamrocks what Americans can expect from Eurovision.\nUNIDENTIFIED MAN: I just think it's just a spectacular show like, as a show, as spectacle. It's incredible.\nJONES: As for the music itself, Eurovision songs can best be described as cheesy pop music. Take the Russian entry.\n(SOUNDBITE OF SONG, \"YOU ARE THE ONLY ONE\")\nSERGEY LAZAREV: (Singing) Thunder and lightening, it's getting exciting. Lights up the skyline to show you are, my love -\nJONES: One of this year's favorites. Other strong contenders include Ukraine, France and Sweden. Officially, Eurovision is non-political. This year's theme is come together, but conflicts from the non-musical world often spill into the contest. The Ukrainian entry has a song called 1944.\n(SOUNDBITE OF SONG, \"1944\")\nJAMALA: (Singing) When strangers are coming, they come to your house. They kill you all and say, we're not guilty. Not guilty.\nJONES: The song is about the forced deportation of Tatars from Crimea in 1944 - a topic that might not immediately make you think inspiration for a pop song. Critics say it's a very thinly-veiled shot at Russia over its recent annexation of Crimea. You have politics playing on a glitzy stage is nothing new for European viewers of Eurovision. Now Americans can get in on the spectacle.\n(SOUNDBITE OF ARCHIVED RECORDING)\nUNIDENTIFIED PEOPLE: (Singing) Music is a language that we all know how to speak.\nJONES: For NPR News, I'm Andrew Jones in Stockholm.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=477900492"}
iption process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2016/05/13/477900492/u-s-tv-viewers-can-now-watch-eurovision-song-contests-live-finale"}
