{"authors":[],"date_download":"2018-10-23 03:40:17","date_modify":"2018-10-23 03:40:17","date_publish":"2016-01-29 18:45:57","description":"US and British intelligence agencies for years hacked into Israeli drones carrying out surveillance to prepare for a potential strike on Iran, Israeli daily ...","filename":"data/vaneerConsumption/USUKhackedintoIsraeliairsurveillance.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h9nk-3bmscybNe842cce83474b58dd447-436_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422693_US-UK-hacked-Israeli-air-surveillance-report_1540266017.html","title":"US, UK hacked into Israeli air surveillance","title_page":"US, UK hacked into Israeli air surveillance | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US, UK hacked into Israeli air surveillance\nUS and British intelligence agencies for years hacked into Israeli drones carrying out surveillance to prepare for a potential strike on Iran, Israeli daily Yediot Aharonot reported on Friday.\nCiting documents leaked by rogue US intelligence contractor Edward Snowden, Yediot said that the operation, codenamed \"Anarchist\", began in 1998 at a British facility in the Troodos mountains of Cyprus and a US National Security Agency (NSA) site at Menwith Hill, in northern England.\n\"From the documents it emerges that Israel operates a large fleet of unmanned aerial vehicles,\" the paper wrote.\nThe US and UK intelligence agencies were able to monitor an Israeli F-16 pilots' heads-up display ©Jack Guez (AFP)\n\"They collect intelligence in the Gaza Strip, the West Bank and throughout the Middle East and were even used according to the editors (of the Snowden files) for gathering intelligence to plan the bombing of Iran.\"\nSnowden, who had worked for the NSA, leaked a hoard of documents in 2013 revealing a worldwide US surveillance programme.\nThe Yediot report, which the paper says was submitted to the Israeli military censor before publication, does not give details of the Jewish state's surveillance of Iran but it shows what are purportedly the first published images of armed Israeli drones.\nIt also tells of Anarchist's penetration of F16 fighter pilots' heads-up display, in one case showing the aircraft tracking a target on the ground.\n\"It's as if they sat with them in the cockpit,\" the paper wrote.\n\"It's a look into the secret Israeli combat world,\" it said. \"Potential targets, aims, priorities and capabilities, from Israel's view of its enemies. The United States and Britain profited from Israel's superb intelligence abilities and saw everything that Israel saw.\"\nIsrael's foreign ministry declined to comment but Yuval Steinitz, minister of energy and a former intelligence minister, said he was disappointed.\n\"We are not surprised. We know that the Americans spy on everyone including us, their friends,\" he told Israeli army radio.\n\"It's disappointing nonetheless because of the fact that for decades we haven't spied or gathered intelligence or broken codes in the United States.\"\nAfter the 1985 arrest in Washington of US Navy intelligence analyst Jonathan Pollard, for passing US secrets to Israel, the Jewish state pledged never to spy on its ally again.\nYediot quoted an unnamed senior Israeli intelligence official describing the latest report as \"an earthquake.\"","url":"https://www.dailymail.co.uk/wires/afp/article-3422693/US-UK-hacked-Israeli-air-surveillance-report.html"}
