{"authors":["Kiri Blakeley For Dailymail.Com"],"date_download":"2018-10-22 21:26:38","date_modify":"2018-10-22 21:26:38","date_publish":"2017-04-26 01:49:28","description":"Veteran Marinna Rollins, 23, of Fayetteville, North Carolina was charged with animal cruelty Tuesday for allegedly killing her service dog. Warning: graphic photos.","filename":"data/vaneerConsumption/USveterantiedservicedogtotreeandshothim.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B73C800000578-0-image-a-54_1493167724735.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446054_Veteran-tied-service-dog-tree-shot-him_1540243598.html","title":"US veteran 'tied service dog to tree and shot him'","title_page":"US veteran 'tied service dog to tree and shot him' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A veteran is accused of tying her service dog to a tree in the woods and shooting him five times while her soldier boyfriend filmed it.\nMarinna Rollins, 23, from Fayetteville, North Carolina, was charged with animal cruelty and conspiracy on Tuesday.\nEarlier this month, Rollins allegedly brought her gray and white male pitbull service dog called Cam, who helped her deal with PTSD, to a wooded area.\nShe then tied him to a tree in the woods and shot him five times while taking turns filming it with her boyfriend, reported the Fayetteville Observer.\nThe pair are heard laughing in the horrifying footage.\nFormer soldier Marinna Rollins, 23, and her boyfriend, Army soldier Jarren Heng, 25, are seen in a video allegedly tying her service dog, Cam, to a tree (above) before shooting him\nService dog Camboui, called Cam, was an emotional service animal to Rollins because she suffered from PTSD and was given a medical discharge from the military\nRollins and her boyfriend allegedly brought Cam to the woods, tied him up, and shot him (video, above)\nRollins (above) served in the military and was reportedly stationed in South Korea and given a medical discharge\nRollins was recently medically discharged from the Army.\nPolice say boyfriend Jarren Heng, 25, who is a soldier with the US Army stationed at Fort Bragg, also participated in the twisted act and filmed it.\nAuthorities said Heng can be heard on the video saying 'Let me hit him once' as he and Rollins shot the dog, according to ABC 11.\nIn the video, a female voice can also be heard saying 'It's been real ... I love you, you're my puppy, you're a good puppy, but...'\nThe video then seems to show Rollins dragging the dead dog's body around before burying him in a shallow grave.\n'Kind of put him a little deeper,' Heng then appears to say.\nThe Cumberland County Sheriff’s Office and Cumberland County Animal Control said they found multiple videos of the killing and also text messages talking about it.\nRollins was charged with animal cruelty; as was Heng; both are reportedly still in the county jail on $25,000 bond each\nCam used to be named Huey and was adopted from the Cumberland County Animal Shelter, but apparently not originally by Rollins but someone else. It's unclear when the dog ended up with Rollins\nThe Facebook page Justice for Cam posted a screen shot purportedly from Marinna Rollins saying that Cam was going to a good home, with Heng saying 'He's gonna have such a great new life'\nA Justice for Cam Facebook site sprang up almost immediately, and a screen grab purporting to be from Rollins' Facebook page shows someone who appears to be Rollins saying 'Great last day with the pooch! Sad he has to go, but he will be much happier where he is heading off to :)'\nHeng then wrote: 'He's gonna have such a great new life.'\nRollins was being held on $10,000 bail and Heng on $5,000 bail, but after an outcry by animal lovers, their bails were raised to $25,000, according to the Justice for Cam Facebook page.\nAccording to a picture of the dog posted on the page, Cam was originally adopted from the Cumberland County Animal Shelter in 2015 by a different person.\n'He is super friendly, very sweet, calm and loving. He just wants someone to love him and give him a chance,' the posting said.\nFriends of Cumberland County, NC Shelter confirmed that the dog in the posting was Cam.","url":"https://www.dailymail.co.uk/news/article-4446054/Veteran-tied-service-dog-tree-shot-him.html"}
