{"authors":[],"date_download":"2018-10-23 03:28:29","date_modify":"2018-10-23 03:28:29","date_publish":"2017-04-26 14:56:29","description":"A US warship has fired a warning flare at an Iranian Revolutionary Guards vessel that refused to maintain distance in Gulf waters, a US spokesman said...","filename":"data/vaneerConsumption/USwarshipfireswarningflareatIranvesselinGulf.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/14/wire-465579-1493214991-919_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4447938_US-warship-fires-warning-flare-Iran-vessel-Gulf_1540265309.html","title":"US warship fires warning flare at Iran vessel in Gulf","title_page":"US warship fires warning flare at Iran vessel in Gulf | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Guided-missile destroyer USS Mahan fired a warning flare at an Iranian Revolutionary Guards vessel that refused to maintain distance in Gulf waters, a US spokesman said\nA US warship has fired a warning flare at an Iranian Revolutionary Guards vessel that refused to maintain distance in Gulf waters, a US spokesman said Wednesday.\nGuided-missile destroyer the USS Mahan had an \"unprofessional interaction\" with an Iranian Revolutionary Guard Corps Navy vessel on Monday in the international waters of the Gulf, US Navy spokesman Lieutenant Rick Chernitzer told AFP.\nChernitzer said the Iranian vessel came within 1,100 yards (1,005 metres) of the destroyer, prompting the US Navy to issue warning messages, twice blast the internationally recognised five-whistle danger signal and deploy \"a flare to determine the Iranian vessel's intentions\".\n\"Eventually, the Iranian vessel opened the distance, steering a course away from Mahan,\" Chernitzer said.\nThe Iranian Revolutionary Guards, a paramilitary force that answers directly to the Islamic republic's supreme leader, periodically approaches US warships in international waters and the Strait of Hormuz, ignoring US radio messages and giving little indication of its intentions.\nIn January, the USS Mahan fired warning shots at the Revolutionary Guards in the Straight of Hormuz, a key gateway for global oil supplies.\nThe Pentagon identified 35 similar incidents in the first half of 2016 along, up from a recorded 23 incidents in 2015.","url":"https://www.dailymail.co.uk/wires/afp/article-4447938/US-warship-fires-warning-flare-Iran-vessel-Gulf.html"}
