{"authors":["Dave Burke For Mailonline"],"date_download":"2018-10-22 22:36:15","date_modify":"2018-10-22 22:36:15","date_publish":"2017-04-26 05:00:14","description":"Sandy Phan-Gillis, a naturalised US citizen, has been detained in China since March 2015 after being accused of espionage.","filename":"data/vaneerConsumption/USwomanjailedforthreeyearsforspyingonChina.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA0B61700000578-0-image-a-82_1493222254514.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446224_China-court-sentences-U-S-citizen-jail-espionage-orders-deportation_1540247775.html","title":"US woman jailed for three years for 'spying on China'","title_page":"US woman jailed for three years for 'spying on China' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An American woman has been jailed for three-and-a-half years in a secretive Chinese court over spying claims branded 'beyond ridiculous' by her husband.\nSandy Phan-Gillis, a naturalised US citizen, has been detained in China since March 2015 after being accused of espionage.\nThe case has heightened tension between the US and China, but her lawyers are hopeful she will be returned home soon.\nSandy Phan-Gillis, a naturalised US citizen, has been detained in China since March 2015 after being accused of espionage\nHer lawyer Shang Baojun told Reuters that Phan-Gillis had admitted espionage during a closed trial in the southwestern city of Nanning and was not planning to appeal.\n'She will probably be exported to the U.S. soon, but we do not know the exact date yet,' Shang said, adding that she was being held in a police station in the meantime.\nThe government has not released details of the charges against Phan-Gillis, but her husband Jeff Gillis, from Houston, Texas, has been outspoken in his criticism of her treatment.\nHe told the Associated Press in October last year: 'Hearing how they had treated her, it made me cry.' He described the allegations against her as 'easily proven to be false'.\nSandy Phan-Gillis with husband Jeff, who has branded her detention 'beyond ridiculous'\nShang said that because the case touched upon 'state secrets', he could not reveal details of the ruling until the official verdict had been released, which was expected within the next five days.\nPhan-Gillis had been in regular contact with US officials while in detention, Shang said.\nThe US Embassy in Beijing referred questions about the charges of espionage to Phan-Gillis' legal team.\n'We remain concerned about Ms Phan-Gillis' welfare and continue to follow her case closely,' embassy spokeswoman Mary Beth Polley told Reuters.\nPhan-Gillis' arrest added to tension between China and the United States in the final months of former President Barack Obama's administration\n'We are in favour of any result that allows her to return home to her family soon,' Polley said, when asked about a possible Chinese deportation order.\nChina's definition of state secrets is very broad, encompassing everything from government directives to top leaders' birthdays. Information can also be declared a state secret retroactively.\nThe arrest added to tension between China and the United States in the final months of former President Barack Obama's administration, a relationship already strained by China's assertiveness over its claims in the disputed South China Sea.\nDespite criticising China on the campaign trail, US President Donald Trump has recently warmed to it after a summit with President Xi Jinping in Florida in early April when Trump said they had developed an 'outstanding' relationship.\nIn recent days, Trump has praised Chinese efforts to press North Korea to give up its development of nuclear weapons and long-range missiles.","url":"https://www.dailymail.co.uk/news/article-4446224/China-court-sentences-U-S-citizen-jail-espionage-orders-deportation.html"}
