{"authors":[],"date_download":"2018-10-22 22:49:07","date_modify":"2018-10-22 22:49:07","date_publish":"2014-05-12 18:36:48","description":"The State Department called the referendum that took place in Ukraine this weekend \"illegal.\"","filename":"data/vaneerConsumption/USWontRecognizeEastUkraineIndependenceVotes.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/437171/140512-ukraine-vote-jms-1548_e20de2a435a3ff0eb30037fe0b0617ff.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_u-s-wont-recognize-east-ukraine-independence-votes-n103426_1540248547.html","title":"U.S. Won't Recognize East Ukraine Independence Votes","title_page":"U.S. Won't Recognize East Ukraine Independence Votes","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe U.S. government will not recognize the results of two sovereignty referendums in eastern Ukraine, officials said on Monday.\nState Department spokeswoman Jen Psaki called the voting process \"suspect.\"\n\"We do not recognize the illegal referendum that took place in portions of Donetsk and Luhansk over the weekend,\" Psaki said on Monday. \"It was illegal under Ukrainian law and an attempt to create further division and disorder in the country. Its methodology was also highly suspect, with reports of carousel voting, pre-marked ballots, children voting, voting for people who were absent, and even voting in Moscow and St. Petersburg.\"\nIn the vote on Sunday, pro-Russian separatists in the Luhansk and Donetsk regions won by an large majority in favor of independence from the main Ukrainian government in Kiev.\nThe insurgents said voters overwhelmingly backed sovereignty in the quickly arranged referendums. But it was impossible to verify the insurgents' claims given that no international election monitors were in place.\nRussian President Vladimir Putin had previously said the referendum should be postponed, but the pro-Russian insurgents in eastern Ukraine still moved forward with the votes.\nWhite House spokesman Jay Carney said it was \"disappointing\" that Russia did not use more of its influence to stop the vote from happening.\nCarney said the White House's focus now is on ensuring that national elections are held in Ukraine without interference on May 25.\nEarlier on Monday, the EU and Ukraine rejected the results of the referendums as well.\n— with NBC News' Catherine Chomiak and the Associated Press","url":"https://www.nbcnews.com/storyline/ukraine-crisis/u-s-wont-recognize-east-ukraine-independence-votes-n103426"}
