{"authors":["Associated Press"],"date_download":"2018-10-22 23:42:43","date_modify":"2018-10-22 23:42:43","date_publish":"2017-03-16 07:49:15","description":"U.S. women's hockey players let a deadline to decide on whether they'll boycott the world championships pass Thursday without any indication they've changed...","filename":"data/vaneerConsumption/USwomenshockeyplayersstandfirminwagefight.json","image_url":"https://i.dailymail.co.uk/1/2017/03/17/01/wire-231647-1489712662-653_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319142_US-women-threatening-boycott-puts-worlds-defense-doubt_1540251763.html","title":"US women's hockey players stand firm in wage fight","title_page":"US women's hockey players stand firm in wage fight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"U.S. women's hockey players let a deadline to decide on whether they'll boycott the world championships pass Thursday without any indication they've changed their minds in a standoff with USA Hockey over wages.\n\"We are focused on the issue of equitable support and stand by our position,\" the players said in a statement released shortly after the 5 p.m. EDT deadline. \"We continue to be grateful for the encouragement and loyalty of our fans.\"\nThe powerhouse U.S. women's program has been plunged into chaos less than a week until the scheduled start of training camp and just over two weeks from defending its world championship gold medal on home ice in Plymouth, Michigan.\nFILE - In this Nov. 4, 2014, file photo, Team United States' Monique Lamoureux, right, celebrates her goal against Team Finland with teammate Alex Carpenter during the third period at the Four Nations Cup women's hockey tournament in Kamloops, British Columbia. The U.S. women's hockey team is threatening to boycott the world championships because of a wage dispute. The team announced Wednesday that they will not participate in the International Ice Hockey Federation tournament that begins March 31, 2017, in Plymouth, Michigan. (AP Photo/The Canadian Press, Jeff Bassett, File)\nCoach Ken Klee was replaced by Robb Stauber earlier this month, and now it's unclear how USA Hockey will fill its roster for a tournament it has won six of the past eight times and was expected to serve as a measuring stick for the South Korea Winter Olympics just 11 months away.\nIt was not immediately clear what USA Hockey's next step will be ahead of the International Ice Hockey Federation Women's World Hockey Championship, which begins March 31. USA Hockey said it is proceeding according to plan.\n\"The organization's clear objective is to continue to work toward ensuring the players that have been selected for the team are those that represent the United States in the world championship,\" USA Hockey spokesman Dave Fischer said.\nPlayers are seeking more compensation and a four-year deal. The deadline came one day after the team announced it would boycott the tournament, citing a lack of progress in labor talks.\nStars such as Hilary Knight, Amanda Kessel, captain Meghan Duggan and twins Jocelyne Lamoureux-Davidson and Monique Lamoureux-Morando are leading the charge to skip the tournament. Knight thinks other players who might be asked will turn down the offer.\n\"We're unanimously united as a player pool,\" Knight said Wednesday. \"Good luck getting a suitable No. 1 competition to represent our country on a world stage. I kind of dare them. It's tough.\"\nJocelyne Lamoureux-Davidson said USA Hockey emailed players on Wednesday asking for a decision on the world championships.\n\"Every single player is still waking up every morning and training and preparing like we are going to show up for camp on the 21st,\" Lamoureux-Davidson said Thursday after the deadline passed.\n\"With that being said, there was a deadline that was not met today because we are wanting to resolve this. ... As far as we know that was a hard deadline and we haven't been told anything else, and so if USA Hockey wants to meet us at the table and resolve this, we're waiting.\"\nSeveral players said USA Hockey pays players $1,000 per month during their six-month Olympic residency period. Players only have contracts in Olympic years and are seeking a deal that covers them during the remaining 3½ years.\nSome 14 months of negotiations have gone nowhere. An attorney for the players, John Langel, called the gap a \"chasm.\"\nNeither USA Hockey nor the players have revealed details of the wages in dispute or how the men's team is compensated. The U.S. men's team is comprised of highly paid NHL players, as are most established men's national teams.\nCanada, the world's other women's hockey powerhouse, puts more money into the sport in part because of government funding.\nHockey Canada general manager of women's programs Melody Davidson said development players receive $900 a month and senior-level players $1,500 a month even outside Olympic years and that players are supported full-time for nine months around the Olympics.\nThe wage dispute follows one by U.S. women's soccer players, who last year filed a complaint with the federal Equal Employment Opportunity Commission that alleged wage discrimination by the U.S. Soccer Federation.\n___\nFollow Hockey Writer Stephen Whyno on Twitter at http://www.twitter.com/SWhyno .\nFILE - In this Feb. 7, 2017, file photo, WNHL player Hilary Knight answers questions during an interview in New York. The U.S. women's hockey team is threatening to boycott the world championships because of a wage dispute. The team announced Wednesday that they will not participate in the International Ice Hockey Federation tournament that begins March 31, 2017, in Plymouth, Michigan. (AP Photo/Julie Jacobson, File)\nFILE - In this Oct. 2, 2013, file photo, United States Olympic hockey player Jocelyne Lamoureux poses for a portrait at the 2013 Team USA Media Summit in Park City, Utah. The U.S. women's hockey team is threatening to boycott the world championships because of a wage dispute. The team announced Wednesday that they will not participate in the International Ice Hockey Federation tournament that begins March 31, 2017, in Plymouth, Michigan.(AP Photo/Carlo Allegri, File)\nFILE - In this Feb. 17, 2014, file photo, Meghan Duggan of the United States looks up during a face off during the second period of the 2014 Winter Olympics women's semifinal ice hockey game against Sweden at Shayba Arena in Sochi, Russia. The U.S. women's hockey team is threatening to boycott the world championships because of a wage dispute. The team announced Wednesday that they will not participate in the International Ice Hockey Federation tournament that begins March 31, 2017, in Plymouth, Michigan. (AP Photo/Mark Humphrey, File)\nFILE - In this Feb. 17, 2014, file photo, Kacey Bellamy of the United States, right, is congratulated by teammates after scoring a goal against Sweden during the first period of the 2014 Winter Olympics women's semifinal ice hockey game in Sochi, Russia. The U.S. women's hockey team is threatening to boycott the world championships because of a wage dispute. The team announced Wednesday that they will not participate in the International Ice Hockey Federation tournament that begins March 31, 2017, in Plymouth, Michigan. (AP Photo/Julio Cortez, File)","url":"https://www.dailymail.co.uk/wires/ap/article-4319142/US-women-threatening-boycott-puts-worlds-defense-doubt.html"}
