{"authors":[],"date_download":"2018-10-22 20:58:47","date_modify":"2018-10-22 20:58:47","date_publish":"2014-06-03 20:01:26","description":"Some Utah high school students who cracked their yearbooks to find sleeves digitally added to their tank tops and a tattoo erased say school officials have apologized to them.","filename":"data/vaneerConsumption/UtahSchoolApologizestoTeensforAlteredPhotos.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_22/476961/140530-altered-yearbook-mn-1000_d125bfebb55e1601af0de8bb1bff5adf.1200;630;7;70;5.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_utah-school-apologizes-teens-altered-photos-n121626_1540241927.html","title":"Utah School Apologizes to Teens for Altered Photos","title_page":"Utah School Apologizes to Teens for Altered Photos","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSome Utah high school students who cracked their yearbooks to find sleeves digitally added to their tank tops and a tattoo erased say school officials have apologized to them.\nWasatch High School administrators in recent days offered at least one student the chance to return her yearbook and get back her $50.\nBut sophomore Shelby Baum opted to keep the memento.\n\"I was a little surprised, but for the most part I knew, if it was real or not, I would get an apology,\" she said Monday evening. \"I'm over the whole thing. There's not much that I can do about it now.\"\nLast week, Baum discovered her collarbone tattoo reading \"I am enough the way I am\" was lifted from her yearbook photo. She also found a high, square neckline drawn onto her black V-neck T-shirt.\nHalf a dozen other girls noticed camisoles or sleeves added to their pictures.\nDistrict officials declined to comment Tuesday, pointing to their statement last week acknowledging error in doctoring pictures of some students but not others who were similarly dressed.\nWasatch High School is in Heber City, about 40 miles outside Salt Lake City.\nBaum earlier said she planned to ask for a refund or a new yearbook with an unaltered photo, but she changed her mind at her mother's urging.\nAt the very least, said Baum's mother, Bobbi Westergard, the doctored photos can remind the girls they spoke out against a policy that singled out some students.\nBaum said she and her mother met with a vice principal who said he didn't want Baum to feel unwelcome at the school.\nThe district's statement pointed out that yearbook staffers warned students that clothing violating the school dress code adhering to modesty might undergo digital touchups.\n\"The high school yearbook staff did make some errors and were not consistent in how they were applied to student photos,\" it reads, \"and the school apologizes for that inconsistency.\"\nOther students say they have not received an apology but are eager to move past the ordeal and on with summer vacation, which began Friday.\n- Associated Press","url":"https://www.nbcnews.com/news/us-news/utah-school-apologizes-teens-altered-photos-n121626"}
