{"authors":["Myriah Towner For Dailymail.Com"],"date_download":"2018-10-23 05:14:17","date_modify":"2018-10-23 05:14:17","date_publish":"2016-01-28 21:13:55","description":"Eric and Heather Bailey from Salt Lake City were dining at Italian restaurant Tuscany on Tuesday when the mother-of-three went into labor. With the help of staff, the couple welcomed their son Christopher.","filename":"data/vaneerConsumption/Utahrestaurantstaffhelpscoupledelivertheirbabyboy.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD57BA00000578-0-image-a-88_1454014798080.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421660_Restaurant-staff-helps-Utah-couple-deliver-baby-boy_1540271657.html","title":"Utah restaurant staff helps couple deliver their baby boy","title_page":"Utah restaurant staff helps couple deliver their baby boy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A couple was celebrating Valentine's Day early but ended up leaving the restaurant with a new bundle of joy after the expecting mother went into labor during their meal.\nEric and Heather Bailey from Salt Lake City were dining at Italian restaurant Tuscany to celebrate the romantic holiday on Tuesday after learning their baby was due on February 14.\nHowever, when the mother-of-three went to the restroom she unexpectedly went into labor but with the help of the restaurant's staff they were able to deliver the couple's baby boy Christopher.\nScroll down for video\nEric and Heather Bailey from Salt Lake City were dining at Italian restaurant Tuscany on Tuesday when the mother-of-three went into labor. The couple pictured above with their baby boy and staff and NBA All-Star Mark Eaton, who is part owner\n'We never ever thought we would say we had a baby inside a restaurant, but yeah, apparently he didn't want to wait,' Eric Bailey told Fox13Now.\nServer Sydney Malmrose had been waiting on the couple for the evening and had gone to collect their main course when Heather Bailey got up and went to the restroom.\n'I had kind of intermittent contractions through the first two, three courses,' the mother told Fox13Now.\nHer husband started to get concerned after his wife had been gone for several minutes which was when he called Malmrose over to their table.\nWith the help of staff, including their waitress Sydney Malmrose (pictured right) the couple welcomed their son Christopher (left)\n'We never ever thought we would say we had a baby inside a restaurant, but yeah, apparently he didn't want to wait,' Eric Bailey, pictured with his wife and baby, said\n'I was, like, jokingly, \"Hey, you want me to go check on your wife and make sure she's not going into labor in the bathroom,\"' she said to the father without realizing this soon would be a reality.\nMalmrose went to the restroom where she called out asking the mother if she was okay before she heard some 'definite labored noises,' according to Fox13Now.\nWhen the waitress realized what was happening she remained calmed, recalling her experience helping deliver her baby sister when she was 15, got Mr Bailey and told the hostess to get towels.\nWithin the next minutes, their baby boy was born.\nWhen their waitress realized what was happening she remained calmed, recalling her experience helping deliver her baby sister when she was 15, got Mr Bailey and told the hostess to get towels\nAfter all of the excitement that night, the couple ended up having their meal comped and got to take food to-go. The owner reportedly said that each year on the baby's birthday the restaurant plans to treat the couple\n'We rush into the bathroom, and I arrive just in time to basically catch,' Eric Bailey told Fox13Now.\nOn Facebook, the restaurant wrote proudly of their staff who helped with the delivery.\n'Baby born tonight at Tuscany with the help of our amazing staff! First time in 20 years of business,' the post read.\nAfter all of the excitement that night, the couple ended up having their meal comped and got to take food to-go.","url":"https://www.dailymail.co.uk/news/article-3421660/Restaurant-staff-helps-Utah-couple-deliver-baby-boy.html"}
