{"authors":["Erica Tempesta For Dailymail.Com"],"date_download":"2018-10-22 20:23:49","date_modify":"2018-10-22 20:23:49","date_publish":"2016-01-28 01:07:23","description":"Sarah Ellett, 43, from Nephi, Utah, puts two drops of cannabis oil on her severely -disabled daughter Remie's tongue a day to treat the symptoms of her various medical conditions.","filename":"data/vaneerConsumption/UtahmotherSarahEllettillegallytreatsherdisableddaughterwithcannabis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/22/30A4B67200000578-0-image-a-93_1453934749333.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3419909_Utah-mom-illegally-treats-severely-disabled-three-year-old-cannabis-oil-pleads-state-legalize-miracle-drug-family-doesn-t-move_1540239829.html","title":"Utah mother Sarah Ellett illegally treats her disabled daughter with cannabis","title_page":"Utah mother Sarah Ellett illegally treats her disabled daughter with cannabis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"legalized in Utah as she considers moving to another state to treat her\nSarah has already gotten a visit from Utah Division of Child and Family Services about her use of cannabis oil in treating Remie\nThe mother-of-seven says the cannabis oil helps treat Remie's symptoms from panhypopituitarism, a condition that affects the pituitary gland\nSarah Ellett, 43, from Nephi, Utah, puts two drops of cannabis oil on her\nA Utah mother who is forced to illegally treat her severely-disabled three-year-old daughter with cannabis oil fears she will lose custody of her little girl because of her state's laws.\nSarah Ellett, 43, from Nephi, Utah, said two drops of cannabis oil under the tongue a day is a 'miracle' treatment for her daughter Remie, who suffers from thyroid disease, respiratory issues and digestive problems that require a feeding tube. However, the single mother-of-seven, who has two other disables children, lives in fear that authorities will try and take her little girl away.\n'My biggest worry is being unable to continue to treat Remie without being in violation of Utah law. There are a lot of risks there,' she told People.\nScroll down for video\nHope in a bottle: Sarah Ellett, 43, from Nephi, Utah, said cannabis oil has been a 'miracle' treatment for her severely-disabled three-year-old daughter Remie (pictured)\nDesperate times: Sarah (center) has been illegally treating her daughter with cannabis oil and fears she will lose custody of her little girl because of state laws\nSarah said the cannabis oil helps treat Remie's symptoms from panhypopituitarism, a condition that affects the pituitary gland and either reduces or destroys its function.\nAccording to the mother, growth hormones and thyroid and hydrocortisone medications have helped, but it is the cannabis oil that keeps her blood sugar balanced, treats her nausea, and enables her to move her jaw.\nSarah said that the first day she treated Remie with cannabis oil was also the first day she walked on her home for the first time.\n'Because of this oil, she's achieving milestones that we never thought possible,' she said.\nFighting for her child: Sarah had Remi held this sign when she went with her mother to Utah State Capitol to fight for the legalization of medical marijuana\nHappy child: The mother-of-seven, who has two other disabled children, said cannabis oil gives Remie 'a good quality of life'\nConstant struggle: Remie, whose name means 'sweet little remedy', suffers from thyroid disease, respiratory issues and digestive problems that require a feeding tube\nHowever, Sarah believes she may have to move out of her home state until medical marijuana is legalized. The mother said caseworkers from the Utah Division of Child and Family Services visited her home on Monday because they had learned that she is illegally treating Remie with cannabis oil.\nSarah, who thinks someone tipped them off, said she was told that they needed to make sure that her daughter wasn't in any danger. Sarah responded by telling them they would have to leave and talk to her lawyer.\nThe mother is now thinking about moving her family to Colorado or another state where she can legally treat her daughter with cannabis, explaining that the oil is what is giving Remie 'a good quality of life'.\nSarah is also struggling to find away to acquire the cannabis oil. While Remie was registered for the Oregon Medical Marijuana program, the only one of its kind that allowed out-of-state patients to enroll, the policy has ended this month.\nAmazing strides: Sarah said the first day she treated Remie with cannabis oil was also the first day Remie walked on her own\nMiracle child: Doctors didn't believe Remie was going to survive after she was born, and she spent 20 days in the hospital after her birth\nTough decision: Sarah is considering selling her house and moving to Colorado or another state where medical marijuana is legal so she can continue to treat her daughter\nThe concerned mom's only options are to either sell her house and move or travel to another state to buy the oil whenever she runs out.\nSarah noted that her daughter has come a long way, explaining that doctors didn't expect her to survive after she was born.\nRemie, whose name means 'sweet little remedy', was hospitalized for 20 months after her birth, and while the cannabis oil has vastly improved her life, her mother said that she believes she and four of her other children could benefit from using the oil.\nSarah, who works part-time for an insurance company, was diagnosed with familial adenomatous, an inherited condition that causes extra tissue to form in the colon and rectum, and three years ago she had her colon removed.\nNatural medicine: Sarah said the cannabis oil helps treat Remie's symptoms from panhypopituitarism, a condition that affects the pituitary gland and either reduces or destroys its function\nSound asleep: Sarah said her main concern is saving her child's life. The proud mother posted this picture of Remie sleeping on her Facebook page earlier this week\nDespite her condition, she said she often staves off sleep so she can take care of her daughter day and night. Remie's amazing response to cannabis oil has prompted Sarah to team up with other parents and patients to get a bill passed in Utah that legalizes marijuana for medical use.\nEnedina Stanger, a disabled Utah mother who was arrested last year after cops found her using marijuana while her two-year-old daughter was in the vehicle in October, is among the people that Remi has joined forces with.\nThe mother has also started a Go Fund Me page, with the goal or raising $5,000 for her family's medical expenses that aren't covered by insurance. Sarah has already raised more than $2,400 after starting the page at the beginning of January.\nWhile the Utah Department of Child and Family Services said they can't comment on Sarah's situation, Sarah said she realize that her daughter 'doesn't have the luxury of waiting' for a law legalizing marijuana in Utah to pass.","url":"https://www.dailymail.co.uk/femail/article-3419909/Utah-mom-illegally-treats-severely-disabled-three-year-old-cannabis-oil-pleads-state-legalize-miracle-drug-family-doesn-t-move.html"}
