{"authors":[],"date_download":"2018-10-22 20:12:49","date_modify":"2018-10-22 20:12:49","date_publish":"2016-07-21 00:00:00","description":"Phil Wright of the Utah Republican Party backed Cruz; analysis from ex-Bush administration official Sara Fagen and NPR's Scott Detrow. Youth Radio's Phoebe Petrovic covers balloon drop preparations","filename":"data/vaneerConsumption/UtahDelegationFavoredCruzBalloonDropWillEndGOPConvention.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=486854429_1540239169.html","title":"Utah Delegation Favored Cruz; Balloon Drop Will End GOP Convention","title_page":"Utah Delegation Favored Cruz; Balloon Drop Will End GOP Convention : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nNow let's hear briefly from a Republican delegate who hoped this week's convention might turn out differently. Phil Wright of Utah is among those who tried to force a roll call vote this week that might plausibly have led to a different nominee. He is on the line from his hotel in Akron, Ohio. Good morning, sir.\nPHIL WRIGHT: Good morning.\nINSKEEP: Hey, the convention's in Cleveland. How'd you end up many miles away in Akron?\nWRIGHT: (Laughter) Well, when you have delegates from 50 states, it's quite a challenge to make sure you have hotel accommodations for every state, so...\nINSKEEP: OK (laughter).\nWRIGHT: ...Utah ended up in Cleveland - in Akron for that reason.\nINSKEEP: OK. Well, I'm glad you could join us by phone. Now lots of delegates we know from Utah and some other states wanted a different result here. We've reported on that on the program. But let me ask what it means now. You're in a very red state. Does it stay red in November, do you think?\nWRIGHT: Absolutely. Look, the most important thing to Utahans is that we put a Republican in the White House. We do not want four more years of Obama by electing Hillary Clinton.\nINSKEEP: So you're saying that this was just a fight over procedures then? It really wasn't a fight to keep Donald Trump out of the White House at all costs.\nWRIGHT: Well, this was the - this was giving - to give delegates the opportunity to do what they came to Cleveland to do, and that's to vet the issues and vet the candidates and then vote. Any time you have an opportunity to vote on the rules, it's important to know what those rules are. If we can't vote on the rules and we're just voting for a package, it's no different than what Nancy Pelosi said, let's vote for Obamacare and find out what's in it afterwards. We didn't want to do that. We wanted each state to have the opportunity to understand the rules, ask questions that they had and then vote up or down.\nINSKEEP: OK. Now, your chairman, when you finally cast your state's ballots, said Utah is Republican now and forever - very red state, that's true. But there's actually some polling that shows Utah may not be quite so Republican this year. What do you think?\nWRIGHT: Well, like I said, I think Utah will unite behind our Republican nominee because it's more - it's most important for Utah that we elect somebody who understands and supports capitalism, not socialism. By electing Hillary Clinton, that's four more years of Obama, and that will not happen in Utah.\nINSKEEP: OK. Phil Wright, vice chairman of the Utah Republican Party, joining us from Akron, Ohio. Thank you very much, sir.\nWRIGHT: Thank you.\nINSKEEP: NPR's Scott Detrow is still in our studios this morning. What does the polling say about Utah?\nSCOTT DETROW, BYLINE: Well, it's a pretty close race according to a couple polls. I mean, Utah has not gone Democratic since 1964, but Donald Trump and Hillary Clinton were within 5 points or so in a few polls. It's still only a handful, but it's an interesting thing to look at. A big reason is that Mormon voters obviously dominate Utah, and many of them are just deeply uncomfortable with Donald Trump. They won't necessarily vote for Hillary Clinton, but many seem to be exploring the Libertarian ticket.\nINSKEEP: Sara Fagen, former Bush administration official, is still with us. Sara, aren't there are a lot of red states that are a little doubtful at this moment for Donald Trump?\nSARA FAGEN: Well, I wouldn't say there are a lot that are doubtful. There are many in which he's underperforming the previous nominees. And Utah's a really interesting one. The private polling matches what you said a minute ago. And I think there you could see many people vote for the Libertarian candidate because they just cannot get comfortable with Donald Trump and his style. It is conversely - it's converse to how Donald Trump lives his life.\nINSKEEP: And, I mean, let's face it - most red states are going to go red. But if one or two were to fall to Hillary Clinton, would it make a big difference in the election?\nFAGEN: It would make a huge difference in the election and not so much at the top of the ticket because she has a strong position going into Electoral College just as it stands. But it'll have an impact in the down ballot, and that's the real challenge for Republicans.\nINSKEEP: Let me ask one other thing, Sara Fagen, about a little bit of news here. Donald Trump continues to make news. He gave a New York Times interview. Foreign policy was the main subject. He raised questions about whether the U.S. really support a NATO ally, if attacked. He also said the United States does not have the moral authority, really, to speak up for democratic values abroad because we've got problems at home and police officers have been killed on the streets. What do you make of that?\nFAGEN: It is an antithesis of everything Republicans stand for in the foreign policy world. You know, one of the mantras has been that Obama is leading from behind. The Obama administration would greatly dispute that, but Donald Trump is basically putting it out there and saying we're not going to engage. And to not defend NATO member - or even to suggest it is remarkable. Scott Detrow, a couple seconds here.\nDETROW: What was remarkable is that that comment came after a convention where, again and again, people have criticized the Obama administration for not being more aggressive in places like Syria and by leaving the United States vulnerable because of that.\nINSKEEP: Scott Detrow and Sara Fagen, thanks to you both. Really appreciate it.\nINSKEEP: Now this convention ends tonight with 125,000 balloons dropped from the rafters. So how do you blow up 125,000 balloons? Well, teenagers from Garfield Heights, just outside Cleveland, did it. Youth Radio's Phoebe Petrovic was there.\nPHOEBE PETROVIC, BYLINE: After tying hundreds and hundreds of balloons, 14-year-old tuba player Kiliell Wallace is wishing he had the nimble fingers of a guitar player.\nKILIELL WALLACE: It's the tying that's really, really, really hurting us. So yeah, that's the problem.\nPETROVIC: The students here are all from Garfield High's band and chorus. Their booster club took this job in exchange for a $7,500 donation from the contractor who provides the convention with the massive balloon drop.\nUNIDENTIFIED STUDENTS: (Singing) A, B, C, D, E, F, G...\nUNIDENTIFIED GIRL: No - what?\nPETROVIC: The students told me they were excited to play a role in the Republican convention. So I asked a 14-year-old Kahlil Tyus and 17-year-old Allison Hill how they feel about Donald Trump.\nKAHLIL TYUS: Majority of our school is African-American, so you can only imagine how we're going to feel about Donald Trump and how he feels about us.\nALLISON HILL: Donald Trump is a bully. That's how I see it. He's a bully.\nPETROVIC: As I sat there surrounded by the red, white and blue balloons, they told me they want the next president to focus on making college affordable and combatting gun violence, police brutality and racism. Eighteen-year-old Terez Siggers says police shootings are weighing her down.\nTEREZ SIGGERS: I remember, maybe last week, I woke up one day, went on Twitter and this video just went viral. The next morning, it was another one. I couldn't take it. I couldn't take - like, it's too much. I don't want to keep waking up to bad news. I want to wake up to - hey, look at this. It's a beautiful world. I'm waking up to another man killed for selling CDs. Like, I can't. I don't want to hear it anymore.\nPETROVIC: Terez told me that when she joined choir as a freshman, she and her peers made an extra effort to be welcoming and supportive. And now she says it's like they're all best friends.\n(LAUGHTER)\nPETROVIC: Teen after teen told me they're looking for that same sort of unifying force in the White House.\nHOLLAND PETWAY: What's most important to me is the president who's trying to make peace with almost everybody, trying to bring everybody together.\nPETROVIC: Like most of the high schoolers who made tonight's balloon drop possible, Holland Petway is too young to vote. But he cares a lot about who wins. For NPR News, I'm Phoebe Petrovic.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=486854429"}
w.npr.org/2016/07/21/486854429/republican-national-convention"}
