{"authors":["Richard Gonzales"],"date_download":"2018-10-23 05:31:08","date_modify":"2018-10-23 05:31:08","date_publish":"2016-08-09 00:00:00","description":"Prosecutors had argued that in prioritizing profits, the company neglected to adequately maintain its pipelines, leading to the deaths of eight people in an explosion in San Bruno, Calif., in 2010.","filename":"data/vaneerConsumption/UtilityGiantPGEConvictedofViolatingGasPipelineSafetyLaws.json","image_url":"https://media.npr.org/assets/img/2016/08/09/ap_16222812398550_wide-60e5620f9af3c931e0300147c3f1512671da4c75.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_08_09_489401025_utility-giant-pg-e-convicted-of-violating-gas-pipeline-safety-laws_1540272668.html","title":"Utility Giant PG&E Convicted of Violating Gas Pipeline Safety Laws","title_page":"Utility Giant PG&E Convicted of Violating Gas Pipeline Safety Laws : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Utility Giant PG&E Convicted of Violating Gas Pipeline Safety Laws\nEnlarge this image toggle caption Noah Berger/AP Noah Berger/AP\nA federal jury found Pacific Gas and Electric Company guilty on five felony counts of failing to adequately inspect its gas pipelines before the blast that incinerated a neighborhood in San Bruno, Calif., in September 2010. The utility was also found guilty of one count of misleading federal investigators about the standard it used to identify high-risk pipelines.\nPG&E was acquitted on six other charges of violating pipeline safety laws.\nThe blast came without warning in the early evening. It killed eight people, seriously injured 38 others and destroyed 58 homes in the suburb just south of San Francisco.\nThe explosion was caused by a bad internal seam weld in a pipeline installed in the 1950s. According to PG&E records, that weld didn't exist.\nGovernment prosecutors argued during the trial that PG&E maintained shoddy records and failed to monitor aging pipelines. They said PG&E managers knew that their records were unreliable. One company memo described the database as containing \"a ton of errors.\"\nThe utility was acquitted on charges of knowingly failing to maintain proper records. But it was found guilty of the most serious charges: failing to identify high-risk pipelines, not prioritizing the most serious hazards, and not using the most accurate means for inspecting pipelines.\nThe company defense was to portray itself as a collection of hard-working employees who performed to the best of their abilities in the face of ambiguous regulations.\nThe trial lasted for more than a month and the jury deliberated for over seven days.\nThe utility faces a maximum penalty of $3 million, or $500,000 for each count. The government originally sought $562 million in potential penalties. That would have been twice the amount of money prosecutors argued that PG&E saved by cutting safety programs. But last week prosecutors shocked many court-watchers by slashing the potential fines.\nProsecutors had no immediate comment following the verdict.\nIn a statement, PG&E said: \"We have made unprecedented progress in the nearly six years since the tragic San Bruno accident and we are committed to maintaining our focus on safety. We want our customers and their families to know that we are committed to re-earning their trust.\"","url":"https://www.npr.org/sections/thetwo-way/2016/08/09/489401025/utility-giant-pg-e-convicted-of-violating-gas-pipeline-safety-laws"}
