{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:42:35","date_modify":"2018-10-30 18:42:35","date_publish":"2015-12-16 16:09:32","description":"UVA professors launched an online petition in support of Muslims and against Donald Trump's call for a temporary ban on Muslims in the U.S.","filename":"data/vaneerConsumption/UVAFacultyLaunchOnlinePetitionAgainstDonaldTrumpsCallforTemporaryBanonMuslims.json","image_url":"https://media.breitbart.com/media/2015/12/Trump-SC-Getty2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_16__1540924955.html","title":"UVA Faculty Launch Online Petition Against Donald Trump’s Call for Temporary Ban on Muslims","title_page":"UVA Faculty Launch Online Petition Against Donald Trump’s Call for Temporary Ban on Muslims | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A group of professors at the University of Virginia (UVA) has an online petition in support of Muslims and against the call by GOP frontrunner Donald Trump for a temporary ban on Muslims coming into the United States to protect Americans from possible terrorists.\nAccording to a report at NBC29, the petition, which has collected hundreds of signatures, contains a statement of support for Muslims, specifically:\nWe, members of the staff and faculty of the University of Virginia, affirm our support and love for our Muslim students, colleagues, and friends, along with their families and communities. For centuries, Muslim scholars have been creators and leaders in the sciences, medicine, law, politics, architecture, commerce, arts and humanities. We embrace your continuing presence here. We welcome, without regard to origin or faith, all who wish to join our community.\nUVA professor John Alexander says the statement for the petition was written after a conversation with a colleague who wanted to respond to Trump’s call for a temporary ban on Muslims to protect Americans.\n“To have that kind of intolerance spoken publicly, rhetorically, we just couldn’t let that stand,” Alexander said. “This is a thoughtful and a tolerant community, and I think we’ve been working hard the last couple of years on issues of diversity and multiculturalism.”\nRegarding Trump’s statement, Muslim Students Association (MSA) member Mariya Tayyab said, “When you hear comments like that, it’s like do I not belong here? Do people not want me here? It is a little tough to hear it.”\nAccording to The Investigative Project on Terrorism (IPT), the Muslim Students Association is “the most visible and influential Islamic student organization in North America.”\nThe organization, with approximately 600 chapters in the United States and Canada, was incorporated in January of 1963 when members of the Muslim Brotherhood convened at the University of Illinois Urbana-Champaign with the goal of “spreading Islam as students in North America,” reports IPT.\n“I’ve never heard any comments like Muslims don’t belong here or we might be terrorists at UVA, but it’s still nice to hear that people do support us,” Tayyab said.","url":"https://www.breitbart.com/politics/2015/12/16/uva-faculty-launch-online-petition-donald-trumps-call-temporary-ban-muslims/"}
