{"authors":["Melissa Ruggieri"],"date_download":"2018-10-30 20:01:34","date_modify":"2018-10-30 20:01:34","date_publish":"2017-03-26 02:05:38","description":"BY MELISSA RUGGIERI/AJC Music Scene\nIt wasn’t a “pop up&rdq...","filename":"data/vaneerConsumption/V103PopUpLivebroughtRickRossTI.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/MyAJC/2017/03/26/Images/WPIMAGE_cmgajcmusic_10853.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_music_concert-review-a_0f2b704aa5220bee00e8e66d0b6fc9c6__1540929694.html","title":"V-103 'Pop Up Live' brought Rick Ross, T.I.","title_page":"Concert review and photos: V-103 'Pop Up Live' brought Rick Ross, T.I.","title_rss":"NULL","source_domain":"ajc.com","text":"BY MELISSA RUGGIERI/AJC Music Scene\nIt wasn’t a “pop up” concert in the most accurate sense considering it was announced almost exactly a month ago.\nBut the V-103 “Pop Up Live” show that commandeered Philips Arena Saturday night sprang plenty of surprises as it unfurled over more than four hours.\nThe advertised stars – Plies, Meek Mill, Big Boi, Rick Ross and T.I. – eventually arrived to engage fans with enough hits to satisfy, but they all wisely exited the stage before boredom could take root.\nJaquees performed \"B.E.D. (Mood)\" at the show. March 25, 2017. (DAVID BARNES / DAVID.BARNES@AJC.COM)\nIn the hour before Florida rapper Plies appeared in his fedora, shades and matching silver sneakers and unzipped jacket, V-103’s Big Ray valiantly tried to distract the crowd from the fact that not much was happening other than DJ Swamp Izzo spinning tunes from atop his perch. The charismatic host would become a welcome sight throughout the night.\nAtlanta pedigree ran deep at this show, from early appearances by Jacquees and OJ da Juiceman to later visitors Killer Mike and B.o.B.\nHere’s what a nearly full Philips Arena experienced:\nPlies paid tribute to Shawty Lo and Bankroll Fresh. (DAVID BARNES / DAVID.BARNES@AJC.COM)\nPlies: This fall, the rapper will release his first album in seven years. But he appealed to old-school fans quickly with a call-and-response “Shawty,” then strolled through the crowd during “Plenty Money.” The slinky “Racks Up to My Ear” segued into tributes to Shawty Lo and Bankroll Fresh.\nMore Surprise Guests: In the mid-2000s, Atlanta’s Unk earned a platinum-selling hit with “Walk it Out,” and here he was chanting the once-ubiquitous earworm. Then it took fans a few seconds to realize that the sounds coming from the DJ altar were indeed those of “Stilettos (Pumps)” from Crime Mob’s 2004 album and that the group was indeed onstage singing it. Rich Homie Quan rounded out the trifecta, strolling the stage with a Louis Vuitton bag slung over his shoulder as he performed “Flex (Ooh, Ooh, Ooh).”\nBig Boi was joined by Killer Mike and Sleepy Brown. (DAVID BARNES / DAVID.BARNES@AJC.COM)\nBig Boi: Clad in white with a red Atlanta Falcons baseball hat, the always-appealing Big Boi zipped through Outkast’s “B.O.B.” and bobbed through “Ms. Jackson” before introducing Killer Mike, who lent an assist on the sing-song-y Grammy winner from 2003, “The Whole World.” Backed by a live bassist and a backup singer, Big Boi worked in some new music before posing his traditional, “Are you having a good tiiiiime?” query and launching into the liquid groove of “The Way You Move,” with Sleepy Brown at his side to add his dulcet tones to the song.\nMeek Mill brought plenty of energy. (DAVID BARNES / DAVID.BARNES@AJC.COM)\nMeek Mill: The Philly rapper hit the stage with fiery energy and immediately captivated the crowd through his music and his engagement. “Sometimes if you shine extra hard, you get a lot of people hatin’ on you,” he said at one point. And then later, “I’m single now, so I’m looking for all of the pretty ladies.” In between chatting, Meek roared through “House Party,” bounced hard in his tan work boots during a portion of “Amen” and steered the escalating “Dreams and Nightmares” into a frenzy of lights and dramatic lyrics.\nAnother Surprise: V-103’s Big Tigger emerged to salute the audience and introduce an unexpected show participant – DJ Khaled. The mere appearance of the Snapchat King thrilled fans, who immediately hopped to their feet to dance with the arm-waving Khaled as the DJ spun “All I Do is Win” and “I Got the Keys.” The producer/personality is an immensely likeable guy, and proved why with quick anecdotes about being a new father and his dedication to his faith.\nPals DJ Khaled and Rick Ross. (DAVID BARNES / DAVID.BARNES@AJC.COM)\nRick Ross: Khaled stuck around to introduce the newly slimmed Ross, who spent the day before the concert in a Fayette County courthouse . The Maybach Music czar led the crowd in the chanting chorus of “B.M.F. (Blowin’ Money Fast”) before Meek Mill bounded back onstage and flicked a towel overhead in time to the beats of “Trap Trap Trap,” from Ross’ new album, “Rather You Than Me.” Ross stalked the stage in his designer sunglasses while unleashing “I’m Not a Star” and his verse on Lil Wayne’s “John.”\nT.I. welcomed B.o.B. during his closing set. (DAVID BARNES / DAVID.BARNES@AJC.COM)\nT.I.: At exactly 11:30 p.m., the Atlanta ambassador popped out and instantly commanded the stage. He insisted on re-starting his opening song – and called out the sound guy in a cranky tone before turning his attention to a female fan. “You’d better get that under control,” he joked about the apparent wardrobe malfunction she was having in front of him. Within a couple of minutes, T.I., who also supported the Atlanta Falcons with his chosen hat, was back in the groove, bursting through “Rubber Band Man” behind plumes of dry ice, snarling “U Don’t Know Me” and welcoming pals B.o.B. and Young Thug to share his space.\nFollow the AJC Music Scene on Facebook and Twitter.","url":"https://www.ajc.com/blog/music/concert-review-and-photos-103-pop-live-brought-rick-ross-surprised-with-khaled/IenECumxThkoh9yGKC16YK/"}
