{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:34:24","date_modify":"2018-10-30 19:34:24","date_publish":"2015-06-10 12:39:17","description":"SACRAMENTO -- As a sea of red-clad protestors looked on, California’s fiercely debated vaccine mandate bill, SB 277, passed through the State Assembly Committee on Health on an essentially party-line vote of 12-6 on Tuesday, with one Democrat abstaining. |","filename":"data/vaneerConsumption/VaccineBillPassesAssemblyCommitteeDespiteRedSeaofOpposition.json","image_url":"https://media.breitbart.com/media/2015/06/SB-277-committee-Michelle-Moons-Breitbart-News.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_06_10__1540928064.html","title":"Vaccine Bill Passes Assembly Committee Despite Red Sea of Opposition","title_page":"Vaccine Bill Passes Assembly Committee Despite Red Sea of Opposition | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"SACRAMENTO — As a sea of red-clad protestors looked on, California’s fiercely debated vaccine mandate bill, SB 277, passed through the State Assembly Committee on Health on an essentially party-line vote of 12-6 on Tuesday, with one Democrat abstaining.\nArguments for and against the bill trudged on for hours over the bill, which would make California only the third state in the nation to refuse parents the ability to opt their children out of vaccines before attending either public or private school.\nThe bill’s co-author, State Sen. Richard Pan (D-Sacramento), led the arguments for the bill, citing statistics and bringing on witnesses and experts.\n“Vaccinations have prevented more than 21 million hospitalizations and 732,000 deaths among children born in the last 20 years. Vaccines are safe and vaccines work,” he contended.\nA crop of vaccine bills including SB 277 popped up after a measles outbreak in Disneyland last December. That outbreak affected 134 Californians, Pan noted.\nCo-author Ben Allen (D-Santa Monica) said, “A bill like this is absolutely constitutional” citing the Jacobson v. Massachusetts case of 1905 in the U.S. Supreme Court.\n“Unless we want to shut down our international airports, stop our role at the global center for international trade and tourism…we are going to be at risk of diseases that exist in other places if we don’t take the steps necessary to protect ourselves here. I think what, essentially, I do think at the end of the day though government has a role to play when one’s beliefs, one’s actions founded even upon sincerely felt beliefs start to impact other people,” he said.\nDr. Dean Blumberg, Associate Professor and Chief of Pediatric Infectious Diseases at UC Davis Children’s Hospital in Sacramento, testified on behalf of the American Academy of Pediatrics in California and California Medical Association and in favor of SB 277.\n“It probably would not be a problem if the small proportion of parents opting out of childhood vaccination was evenly geographically distributed, but they are not,” he said. “Opting out tends to cluster.”\nAmendments were offered by the committee and accepted by the bill’s authors.\nArguments then began in opposition to the bill.\nJay Gordon, a pediatrician from Santa Monica, CA and a Fellow with the American Academy of Pediatrics, testified, “SB 277 is not about whether vaccines are right or wrong….Should all children in California be forced to be fully vaccinated in order to attend preschool, day care, kindergarten or high school despite their parents’ personal, religious and medical beliefs?”\nVoluntary vaccination rates have increased in the state as a whole, he said, as a result of earlier legislation that requires consultation with a physician before granting exemptions to vaccination. “AB 2109 passed and has been in effect a little more than a year and it works.”\nGordon also suggested that school vaccinations will not significantly curtail cases of infectious diseases such as measles or whooping cough. “All cases of measles occurred outside the school environment… If SB 277 had been in place last year this outbreak would have proceeded in much the same manner.” He continued, “90% of the children who contracted whooping cough last year had been vaccinated.\n“The CDC (Centers for Disease Control) website on their Pertussis (Whooping Cough) page states that unvaccinated children are not driving these outbreaks, but rather it’s the waning immunity that allows the disease to spread even in fully vaccinated children.”\n“We need better vaccines, we don’t need a new law,” Gordon declared.\nThe story of witness George Fatheree, an attorney in education law and father of a child injured by reactions to vaccines, brought particular interest.\nHe asked about children in homes where no English is spoken, arguing that they could be forced to homeschool as a result of SB 277, and have no exposure to English in school. He also expressed that the bill doesn’t do enough to care for children with special needs.\nThe final witness for the opposition was Melissa Floyd, a data analyst and 15-year educator with a specialty in mathematics. Floyd pointed to what she called a misclassifying of most of the 2.5% of children with personal belief exemptions on file as unvaccinated. “In fact, less than 1 percent of children in California are completely unvaccinated.”\nFloyd states, “The authors have said that over 100,000 people die if measles every year, but what they’re not telling you is those are global numbers. The CDC says not one has died in California or in our entire country in 12 years.\n“Important to note, there is no correlation between the PBE percentage rate and the incidence of disease. L.A. County has a PBE rate of 1.62%, that’s very low and they had almost 30 cases of measles. Marin County on the other has over than 6.5% PBE and they had two cases. The same can be said about Pertussis last year. Three of the seven counties that had the most cases were over 95% vaccination coverage.”\nPublic commenters were given the opportunity to state their name, affiliated organization and position on the bill. While initially some came up to support the bill, they were vastly outnumbered by the hundreds upon hundreds dressed in red who opposed the passage of SB 277.\nAfter an estimated five hours of arguments, testimony, questions and public comment, the committee voted, passing the bill on to its next stage.\nThe bill must still face a floor vote in the Assembly and Governor Jerry Brown’s desk before it can become law.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/06/10/vaccine-bill-passes-assembly-committee-despite-red-sea-of-opposition/"}
