{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:34:27","date_modify":"2018-10-30 19:34:27","date_publish":"2015-06-25 20:02:37","description":"On Thursday, the California State Assembly passed the SB 277, which mandates child vaccinations as a condition of private and public school enrollment, by a vote of 46-30. Democrats and Republicans were divided within their own parties over the bill, which ultimately passed with bipartisan support. Due to amendments, however, the bill was immediately ordered back to the State Senate, where it previously passed. |","filename":"data/vaneerConsumption/VaccineMandateSB277PassesCaliforniaAssembly.json","image_url":"https://media.breitbart.com/media/2015/06/Vaccine-Joe-Raedle-Getty-e1480946047620.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_06_25__1540928067.html","title":"Vaccine Mandate, SB 277, Passes California Assembly","title_page":"Vaccine Mandate, SB 277, Passes California Assembly | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Thursday, the California State Assembly passed the SB 277, which mandates child vaccinations as a condition of private and public school enrollment, by a vote of 46-30. Democrats and Republicans were divided within their own parties over the bill, which ultimately passed with bipartisan support. Due to amendments, however, the bill was immediately ordered back to the State Senate, where it previously passed.\nThe bill eliminates parents’ ability to opt their children out of one or more vaccinations. If they choose not to vaccinate for one or more diseases required, that child will be relegated to either homeschool or independent study for education.\nAssemblymember Devon Mathis (R-Visalia) rose in opposition to the bill, noting that his children and even his dog are vaccinated. He argued the bill takes the choice away from parents and diminishes the relationship with their physicians, placing power in the hands of the state.\nAssemblymember Patty Lopez (D-San Fernando) said she does “not agree with this billm” and announced a choice to vote with the will of the voters in her district. She emphasized the homeschooling and independent study alternatives were not a sufficient alternative for those choosing to opt out of one or more vaccinations.\nAssemblymember Marc Levine (D-San Rafael) suggested SB 277 has probably received more public testimony than any other issue this year. He compared state mandated vaccinations for school enrollment to paying taxes and not playing loud music late at night, as he expressed his support for SB 277.\nAssemblymember Shannon Grove (R-Bakersfield) rose in opposition, stating her children and grandchildren have been vaccinated. She said the issue at hand is parents’ rights. Parents should be in the “driver’s seat” with their children’s health, she said.\nAssemblymember Rocky Chavez (R-Oceanside), who is also running for U.S. Senate, opposed the bill, noting that an earlier bill, AB 2109, which required education between physicians and parents regarding vaccines, had passed but had not yet been given a chance to show its effectiveness.\nAssemblymember David Hadley (R-Torrance) stated reluctant opposition. Vaccines are an essential part of health in America he said. He said he had really wanted to vote for the bill. He said opponents are very intelligent and that ultimately the issue is about parents’ rights. There is something fundamentally dishonest about the process with AB 2109 Hadley stated. It has not had time to take full effect and said would be repealed with the passage of SB 277.\nAssemblymember David Chiu (D-San Francisco) argued that the bill is Constitutional, on the basis that the right to education is not unconditional. He stated support for the bill.\nOpponents of SB 277 rallied Thursday morning in anticipation of the vote. Their numbers have continued to grow throughout the bill’s journey through the legislature, climbing into the many hundreds at a previous Assembly Health Committee hearing, which lasted around five hours. The crowds have been widely varied in ideology, but united in their fight against removal of parents’ right to choose which vaccinations are administered to their children.\nA majority of the protesters this reporter has interviewed at multiple demonstrations have expressed that they do vaccinate their children, but some have chosen to opt out of one or another. This bill would remove the ability of parents to opt out of even one vaccination on a list of those required.\nIf the bill is passed and signed into law, California would become only the third state to refuse exemption on the basis of either personal or religious belief.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/06/25/vaccine-mandate-sb-277-passes-california-assembly/"}
