{"authors":[],"date_download":"2018-10-22 21:32:45","date_modify":"2018-10-22 21:32:45","date_publish":"2014-06-05 18:54:00","description":"President Barack Obama's choice to be the top health official at the Veterans Affairs Department withdrew his nomination Thursday.","filename":"data/vaneerConsumption/VAHealthCareNomineeWithdraws.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/490441/140605-140528-phoenix-va-1453_d491303905fa020051f9cca360a90d65.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_va-hospital-scandal_va-health-care-nominee-withdraws-n123796_1540243965.html","title":"VA Health Care Nominee Withdraws","title_page":"VA Health Care Nominee Withdraws ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPresident Barack Obama's choice to be the top health official at the Veterans Affairs Department withdrew his nomination Thursday, saying he feared his confirmation could spark a prolonged political battle.\nJeffrey Murawsky, health care chief for the VA's Chicago-based regional office, was nominated last month to be the department's new undersecretary for health care, replacing Robert Petzel, who resigned under pressure. Petzel had been scheduled to retire later this year but was asked to leave early amid a firestorm over delays in patient care and preventable deaths at veterans hospitals.\nMurawsky now oversees seven VA hospitals and 30 clinics in Illinois, Indiana, Wisconsin and Michigan, including one in suburban Chicago where there are allegations that its staff used secret lists to conceal long patient wait times for appointments. Murawsky was a doctor at the Hines, Illinois, hospital and technically remains on staff.\nThe White House said in a statement that Murawsky feared a prolonged fight over his confirmation, adding that he believes the role is too important not to be filled quickly.\nObama accepted Murawsky's withdrawal and will move quickly to find a replacement, the White House statement said. The VA is required by law to convene a commission to seek and review candidates for the position, which oversees the 9 Veterans Health Administration, the largest single health provider in the nation with 9 million patients, 150 hospitals and 820 walk-in clinics.\nRobert Jesse, Petzel's chief deputy, has served as acting undersecretary since Petzel resigned May 16.\nMeanwhile, acting VA Secretary Sloan Gibson was making a visit Thursday to the Phoenix VA medical center, where reports about veterans dying while awaiting appointments set off the furor resulting in retired Gen. Eric Shinseki's resignation last week after holding the top VA job in Obama's Cabinet the past five years.\nAn interim inspector general's report last month said veterans in Phoenix wait an average 115 days for a first appointment -- five times longer than the 24-day average the hospital had reported. The inspector general said more than VA facilities nationwide were under investigation.\nThe VA said in a statement Thursday that officials appreciate Murawsky's service to veterans and respect his request to withdraw his nomination.\nMurawsky's withdrawal comes as the Senate moves forward on a compromise bill to help veterans avoid long waits to see a doctor and make it easier to fire administrators who falsify records to cover up long wait times.\n-- The Associated Press","url":"https://www.nbcnews.com/storyline/va-hospital-scandal/va-health-care-nominee-withdraws-n123796"}
