{"authors":["William Bigelow"],"date_download":"2018-10-30 19:57:20","date_modify":"2018-10-30 19:57:20","date_publish":"2015-08-19 03:43:27","description":"A Missouri patio comprised of military gravestones has prompted an investigation by the Federal Department of Veterans Affairs Office IG.","filename":"data/vaneerConsumption/VAInvestigatingMissouriPatioComprisedofMilitaryGravestones.json","image_url":"https://media.breitbart.com/media/2015/08/missouri-patio-made-of-military-headstones-Facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_18__1540929440.html","title":"VA Investigating Missouri Patio Comprised of Military Gravestones","title_page":"VA Investigating Missouri Patio Comprised of Military Gravestones | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Missouri patio and staircase comprised of military gravestones has prompted an investigation by the Federal Department of Veterans Affairs Office Inspector General.\n22-year Navy veteran Ed Harkreader, 55, of Mountain Home, AR, heard about the patio from a friend and drove to the residence near Lake Norfork, barely north of the Missouri-Arkansas line. He took pictures and unsuccessfully attempted to contact the property owner. Then he posted the pictures on Facebook, where tens of thousands of people viewed them. Many outraged responses were posted, including some that advocated violence.\nHarkreader said he had talked with a local VA rep about the situation; he asked readers to share his post to help find someone who could “fix this travesty.”\nThe St. Louis Post-Dispatch reported that some of the gravestones came from Alabama, California, and Texas.\nThe U.S. Department of Veteran Affairs explicitly states:\nPlease note that historic headstones (those greater than 50 years of age) will not be replaced to correct inscription inaccuracies based on modern research; requests for replacement of historic headstones will only be honored when inscriptions are worn to the point that they can no longer be read or if the headstone is otherwise damaged beyond repair. If a Government headstone or marker in a private cemetery is damaged by cemetery personnel, the cemetery should pay all replacement costs.\nMarble and granite headstones or markers that are permanently removed from a grave must be destroyed, ensuring that the inscription is no longer legible.\nSome of the gravestones had death dates as recent as the 2000s.","url":"https://www.breitbart.com/politics/2015/08/18/va-investigating-missouri-patio-comprised-of-military-gravestones/"}
