{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:49:39","date_modify":"2018-10-30 21:49:39","date_publish":"2016-01-21 16:44:43","description":"Republican lawmakers on Virginia's Senate Courts of Justice Committee defied Gov. McAuliffe (D) by passing a bill allowing concealed carry without a permit.","filename":"data/vaneerConsumption/VALawmakersDefyGovMcAuliffewithConcealedCarryBill.json","image_url":"https://media.breitbart.com/media/2015/02/terry-mcauliffe-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_21__1540936179.html","title":"VA Lawmakers Defy Gov. McAuliffe with Concealed Carry Bill","title_page":"VA Lawmakers Defy Gov. McAuliffe with Concealed Carry Bill","title_rss":"NULL","source_domain":"breitbart.com","text":"Republican lawmakers on Virginia’s Senate Courts of Justice Committee defied Governor Terry McAuliffe (D) by passing a bill on January 20 to allow concealed carry in the state without a permit.\nCurrently, Alaska, Arizona, Kansas, Maine, Montana, Vermont, and Wyoming allow concealed carry without a permit.\nAccording to Fredericksburg.com, Republican lawmakers also struck down a bill supported by McAuliffe intended to “require background checks on all gun buyers at gun shows.” McAuliffe has been pushing for such an expansion from the time he assumed the governor’s office.\nMcAuliffe is expected to veto the bill allowing concealed carry without a permit if it reaches his desk. Likewise, Republican lawmakers are expected to oppose at every turn his push for an expansion of background checks.\nOn August 26, 2015, McAuliffe called for expanding background checks while police were still pursuing the gunman who killed reporter Alison Parker and cameraman Adam Ward on air. Hours later, after the gunman was caught, it was revealed he had passed a background check to acquire his handgun.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/01/21/virginia-lawmakers-defy-terry-mcauliffe-with-concealed-carry-bill/"}
