{"authors":["Pete Jenson For Mailonline"],"date_download":"2018-10-22 23:57:19","date_modify":"2018-10-22 23:57:19","date_publish":"2016-01-29 12:33:27","description":"Gary Neville will take his team to Barcelona next Wednesday with a return at the Mestalla the following Wednesday for a place in the King's Cup final, having seen off Las Palmas on Thursday night.","filename":"data/vaneerConsumption/ValenciadrawnagainstBarcelonainCopadelReysemifinalsasGaryNevillereturnstositeof1999ChampionsLeaguevictory.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30ADB9E600000578-0-image-a-64_1454070553228.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422708_Valencia-drawn-against-Barcelona-Copa-del-Rey-semi-finals-Gary-Neville-returns-site-1999-Champions-League-victory_1540252639.html","title":"Valencia drawn against Barcelona in Copa del Rey semi-finals as Gary Neville returns to site of 1999 Champions League victory","title_page":"Valencia drawn against Barcelona in Copa del Rey semi-finals as Gary Neville returns to site of 1999 Champions League victory | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gary Neville is going back to the Nou Camp where he won the Champions League in 1999, after Valencia were drawn against Barcelona in the Copa del Rey semi-finals.\nNeville will take his team to Barcelona next Wednesday with a return at the Mestalla the following Wednesday for a place in the King's Cup final, having seen off Las Palmas on Thursday night.\nThe Valencia manager started the dramatic 2-1 victory over Bayern Munich in 1999 as Manchester United won the treble. Brother Phil was on the bench alongside Teddy Sheringham and Ole Gunaar Solskjaer, who both came on and scored to turn the final on its head after 91 and 93 minutes cancelling out Mario Basler's goal after just six minutes.\nGary Neville and his Valencia side have been drawn against Barcelona in the Copa del Rey semi-finals\nValencia's players celebrate after Rodrigo Moreno's decisive goal against Las Palmas on Thursday night\nNeville will be back at the Nou Camp, where he and brother Phil (left) won the Champions League in 1999\nCOPA DEL REY SEMI-FINAL DRAW Barcelona vs Valencia Sevilla vs Celta Vigo\nPhil has already taken charge of Valencia against Barcelona once this season when he was in the dugout as Gary looked on from the stands last December. Valencia drew the game 1-1 in the last fixture before Gary took charge of the team.\nSevilla will play Celta Vigo in the other semi-final and they will be happier than the Neville brothers with the draw. Barcelona are overwhelming favourites to win the tournament and whoever meets them in the final would be guaranteed a Europa League spot next season.\nNot avoiding them in the semi-finals is disappointing, but it does give Neville the chance to test himself against the best side in Europe.\nHe was under pressure going into Thursday's quarter-final against Las Palmas but Rodrigo Moreno scored 20 minutes in from an Andre Gomes cross and Valencia held out to win the game 2-1 on aggregate.\nNeymar scores Barcelona's third goal during their 3-1 Copa del Rey quarter-final against Athletic Bilbao\nLuis Suarez (left) is congratulated by his team-mates after opening the scoring against Bilbao on Wednesday\nValencia's Andre Gomes (centre) vies with Las Palmas' David Garcia (right) at the Estadio de Gran Canaria\nAlgerian winger Sofiane Feghouli came on in the second half of the game – his first action for over two months. And it was one of many signs that things are coming together for Valencia. Important players such as Shkodran Mustafi, Jose Luis Gaya and now Feghouli are fit and available and others such as Gomes are beginning to show some leadership on the pitch.\nOn Sunday they face Sporting Gijon and if Neville can pick up his first win in the league since taking over it will be the perfect platform for the double header against Luis Enrique's men.\nBarcelona's Andres Iniesta said: 'The team is playing very well and we will be ready for the game.'","url":"https://www.dailymail.co.uk/sport/football/article-3422708/Valencia-drawn-against-Barcelona-Copa-del-Rey-semi-finals-Gary-Neville-returns-site-1999-Champions-League-victory.html"}
