{"authors":["Jeff Poor"],"date_download":"2018-10-30 19:03:46","date_modify":"2018-10-30 19:03:46","date_publish":"2015-03-03 14:33:10","description":"Valerie Jarrett: Obama Too Busy to Watch Netanyahu Speech; Cites 'Let Girls Learn' Initiative","filename":"data/vaneerConsumption/ValerieJarrettObamaTooBusytoWatchNetanyahuSpeechCitesLetGirlsLearnInitiative.json","image_url":"https://media.breitbart.com/media/2015/03/Jarrett33a.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_03__1540926226.html","title":"Valerie Jarrett: Obama Too Busy to Watch Netanyahu Speech; Cites 'Let Girls Learn' Initiative","title_page":"Valerie Jarrett: Obama Too Busy to Watch Netanyahu Speech; Cites 'Let Girls Learn' Initiative | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In an appearance on MSNBC’s “Morning Joe” on Tuesday, Obama White House senior adviser Valerie Jarrett offered some reaction to the upcoming address to a joint session of Congress by Israeli Prime Minister Benjamin Netanyahu later in the day.\nJarrett insisted President Barack Obama remains committed to Israel’s security and preventing Iran from obtaining a nuclear weapon.\n“As the president said yesterday, Mika, the speech has become a bit of a distraction,” Jarrett said. What’s important to keep in mind is the fundamental fact that the United States is Israel’s staunchest ally. The president is committed to the safety and security of Israel. We share a common goal of ensuring that Iran does not develop nuclear weapons. We may disagree about the tactics of how to get there, but the important thing is that that’s our goal and that’s where we keep our focus.”\nAs for the speech itself, Jarrett explained the reason Obama won’t be watching the address is that he has a full slate.\n“Well, he’s got a full day today and I hope we’re going to in a second our announcement for today,” she continued. “He’s action packed. He and the first lady are so excited about the new initiative that we’re going to launch and when you’re ready, I’d love to talk about that.”\nThat initiative according to Jarrett is called “Let Girls Learn,” which is a program meant to promote education for girls.\n“Our new initiative is called simply ‘Let Girls Learn,’” Jarrett said. “Right now, 62 million girls are not in school. And half of those are adolescents. And we all know the best way to economic security, the best way to pursue your dreams is if you can have an education. What the president and first lady want to do today is put a spotlight on a whole of government approach to ensuring that all the world’s girls have the opportunity to pursue school and finish school because that is the pathway to success. And so for example, the Peace Corps is going to devote thousands of volunteer who is are going to work around the world with community-based organizations to help ensure that girls stay in school and the girl scouts are going to complete school. Have patches ‘Let Girls Learn’ to make sure American girls are educated about the ways we want to insure girls all over the world have the same opportunities that they have here in the United States.”\nFollow Jeff Poor on Twitter @jeff_poor","url":"https://www.breitbart.com/politics/2015/03/03/valerie-jarrett-obama-too-busy-to-watch-netanyahu-speech-cites-let-girls-learn-initiative/"}
