{"authors":["Pete Jenson For Mailonline"],"date_download":"2018-10-23 03:25:49","date_modify":"2018-10-23 03:25:49","date_publish":"2016-01-28 19:00:52","description":"PETE JENSON IN SPAIN: Gary Neville had his players practicing penalties on Wednesday ahead of their King’s Cup quarter-final second leg against Las Palmas.","filename":"data/vaneerConsumption/ValenciamanagerGaryNevilleputshissidethroughpenaltypracticeastheylooktogetseasonbackontrackagainstLasPalmas.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/3070CD8A00000578-0-image-a-24_1454007541572.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421509_Valencia-manager-Gary-Neville-puts-penalty-practice-look-season-track-against-Las-Palmas_1540265149.html","title":"Valencia manager Gary Neville puts his side through penalty practice as they look to get season back on track against Las Palmas","title_page":"Valencia manager Gary Neville puts his side through penalty practice as they look to get season back on track against Las Palmas | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gary Neville had his players practicing penalties on Wednesday ahead of their King's Cup quarter-final second leg against Las Palmas.\nIf they draw the game 1-1 then it will go to spot-kicks after extra-time and nothing can be left to chance.\nCome through this Copa del Rey quarter-final and the Neville brothers could be just 180 minutes from getting Valencia into Europe for next season.\nGary Neville had his players practicing penalties on Wednesday ahead of their King's Cup quarter-final\nNeville brothers could be just 180 minutes from getting Valencia into Europe for next season with a win\nThe surprise elimination of Atletico Madrid at the hands of John Guidetti's Celta Vigo on Wednesday, together with Real Madrid's earlier exit for fielding a suspended player have left the tournament wide open.\nAnd because Barcelona will finish in the Champions League – any team reaching the final against them will be in the Europa League by default. They will not have to win the final – just be in it to make it to Europe.\nAvoiding Barca in Friday's draw will be the key. And for that to happen Valencia need to be in the hat.\nHeadline of Valencia based newspaper SuperDeporte 'The Cup or Life: Gary Neville's team can't fail tonight'\nStruggling Valencia take on Las Palmas in the second leg of their cup tie on Thursday night\nValencia were held to a 1-1 draw with Las Palmas when both sides met in the first leg of the clash\nThey drew the first game 1-1 at home but did so thanks to a goal from Paco Alcacer who is out with strained ankle and knee ligaments and will be sorely missed.\nAlvaro Negredo picks up the baton and he is on a healthy run of two goals in two games. If that doesn't sound too impressive it needs to be held up against the back-drop of Valencia's season.\nThey went into free-fall at the start of November and Gary Neville has not been able to open the parachute yet. It could come on Thursday and if it does the prize will be big – both in-terms of morale and credibility.\nOne of the cornerstones of Peter Lim's long game at Valencia is that team compete in Europe every season\nHe believes in his young side but he needs the supporters to keep doing the same. They want new signings but none seem to be imminent so a cup run will lift everyone ahead of Sunday's meeting with Sporting Gijon in the league.","url":"https://www.dailymail.co.uk/sport/football/article-3421509/Valencia-manager-Gary-Neville-puts-penalty-practice-look-season-track-against-Las-Palmas.html"}
