{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 19:14:30","date_modify":"2018-10-30 19:14:30","date_publish":"2018-07-26 18:27:57","description":"Vandals reportedly untied Education Secretary Betsy DeVos's $40 million yacht from its docking station early Sunday morning.","filename":"data/vaneerConsumption/VandalsSetBetsyDeVoss40MillionYachtAdriftfromOhioDock.json","image_url":"https://media.breitbart.com/media/2018/03/wi/afp/11/1b7dl6_us-education-secretary-betsy-devos-she-chair-federal-commission-on-school-e1532627742560.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_26__1540926870.html","title":"Vandals Set Betsy DeVos's $40 Million Yacht Adrift from Ohio Dock","title_page":"Vandals Set Betsy DeVos's $40 Million Yacht Adrift from Ohio Dock | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Vandals reportedly untied Education Secretary Betsy DeVos’s $40 million yacht from its docking station early Sunday morning at a northern Ohio marina, setting the vessel adrift.\nCrew members of the 163-foot yacht named “Seaquest” knew something was amiss early Sunday morning when they noticed the vessel floating in the Huron Boat Basin unattached to a dock, the Toledo Blade reported.\nWord of the vandalism reached the boat’s captain, who called the Huron Police Department at 6 a.m. on Sunday.\nThe captain and his crew eventually regained control of the yacht, but not before it sustained $5,000 to $10,000 in damage from striking the dock, according to a police report.\nInvestigators are searching surveillance video to narrow down who may have set the yacht loose from the dock. The yacht has enough cabin space to accommodate 12 guests and 12 crew members. “Seaquest” is one of the ten boats owned by the DeVos family.\nDeVos was in northern Ohio this month touring a career center and a correctional facility, but it is unclear why the yacht was docked in Huron.","url":"https://www.breitbart.com/politics/2018/07/26/vandals-set-betsy-devoss-40-million-yacht-adrift-from-ohio-dock/"}
