{"authors":[],"date_download":"2018-10-22 20:52:27","date_modify":"2018-10-22 20:52:27","date_publish":"2014-06-03 14:12:03","description":"Vandals have destroyed prehistoric rock art, endangering a tableau of paintings and carvings classified by UNESCO as of \"outstanding universal value\".","filename":"data/vaneerConsumption/VandalsWipeOutPrehistoricRockArtinSouthernLibya.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/483971/140603-vandalized-rock-art-libya-02_06ff3a990c254998a05099a1f4e951db.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_vandals-wipe-out-prehistoric-rock-art-southern-libya-n121236_1540241547.html","title":"Vandals Wipe Out Prehistoric Rock Art in Southern Libya","title_page":"Vandals Wipe Out Prehistoric Rock Art in Southern Libya","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nVandals have destroyed prehistoric rock art in lawless southern Libya, endangering a sprawling tableau of paintings and carvings classified by UNESCO as of \"outstanding universal value\".\nLocated along Libya's southwestern tip bordering Algeria, the Tadrart Acacus mountain massif is famous for thousands of cave paintings and carvings going back up to 14,000 years.\nThe art, painted or carved on rocks sandwiched by spectacular sand dunes, showcase the changing flora and fauna of the Sahara stretching over thousands of years.\nHighlights include a huge elephant carved on a rock face as well as giraffes, cows and ostriches rendered in caves dating back to an era when the region was not inhospitable desert.\nBut in a visit to Libya's remote far south, Reuters found many paintings destroyed or damaged by graffiti sprayers or people carving in their initials.\nTourist officials in Ghat, the nearest large town, said the vandalism started around 2009 when a former Libyan employee of a foreign tour company sprayed over several paintings in anger after he had been fired.\nBut the destruction has accelerated since the 2011 civil war which ousted dictator Muammar Gaddafi and then plunged the sprawling North African country into widespread armed anarchy.\nWith tourist and archaeologists staying away on safety grounds, hunters have taken over the Acacus massif, shooting much of the wildlife across the arid, rugged landscape.\nWeapons are available anywhere these days in a country where the central government based in Tripoli on the northern Mediterranean coast exerts scant authority and the nascent armed forces are no match for armed tribesmen and militias.\n\"The destruction is not just affecting the paintings but also the natural reserve. Hunters are to blame,\" said Ahmed Sarhan, a tourist ministry official in Ghat.\n--- Reuters","url":"https://www.nbcnews.com/science/science-news/vandals-wipe-out-prehistoric-rock-art-southern-libya-n121236"}
