{"authors":["Rebecca Taylor For Mailonline"],"date_download":"2018-10-23 01:05:33","date_modify":"2018-10-23 01:05:33","date_publish":"2017-03-16 10:52:34","description":"Twitter user 'Bookie' from West Lothian shared a clip of the moment a young man charges at a bus stop and smashed the glass, sending it flying into the street around him. It has gained 1,950 retweets.","filename":"data/vaneerConsumption/Vandalsmashesbusstopsendingshatteredglassflying.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E538DD200000578-0-image-a-57_1489661290334.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319482_Vandal-smashes-bus-stop-sending-shattered-glass-flying_1540256733.html","title":"Vandal smashes bus stop sending shattered glass flying","title_page":"Vandal smashes bus stop sending shattered glass flying | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For early morning commuters, there can be little more frustrating than a broken bus stop when waiting for public transport.\nThis night time footage shows how they happen, as a youngster runs at full speed along a pavement before smashing straight into one, shattering glass everywhere.\nThe man throws himself at the stop before falling through into the stop and landing on top of the shattered glass.\nThe clip shows the young man running toward the bus stop at night while his friends crowd around him and laugh\nThe man then collapses on the ground with the shattered glass around him, as his friends laugh and one behind the camera says 'no'\nThe shocking mobile phone footage was uploaded to Twitter by 'Bookie' who lists his hometown as Blackburn, West Lothian.\n'Bookie' shared the footage on Tuesday night with the caption: 'When you're five minutes late for yer bus…'\nThe six-second clip has already gained 1,950 retweets and 3,375 likes since it was uploaded.\nThe video starts with the man running at high speed towards the glass side of the bus stop as laughter can be heard behind the camera.\nHe then turns slightly so his left shoulder hits the glass first as he throws himself into the stop.\nA loud thud can be heard as the glass shatters everywhere and the youngster lands on his side inside the stop.\nIt was uploaded to Twitter with the comment 'when you're late for your bus' and has been retweeted about 2,000 times\nIt has received many comments in response, but some have been less than impressed by the stunt, saying it was a costly prank\nThe other youngsters nearby start to laugh loudly as a stunned man's voice behind the camera says: 'No.'\nTwitter users have been quick to react to the unusual footage.\nColette joked: 'When it's 10:24 and you haven't left the house yet.'\nAmina commented: 'Probably something that would happen to me.'\nWhilst KG was concerned and wrote: 'I pass a stop every Sunday near my maw's and it's smashed in every week. I wonder why they don't make it plastic.'\nAnd Duncan asked: 'Aye funny. But who's going to fix it. Costs to repair that are more than a bed in a corridor at A&E.'","url":"https://www.dailymail.co.uk/news/article-4319482/Vandal-smashes-bus-stop-sending-shattered-glass-flying.html"}
