{"authors":[],"date_download":"2018-10-30 19:35:00","date_modify":"2018-10-30 19:35:00","date_publish":"2016-10-15 19:49:00","description":"Nick Chubb said all the right things.","filename":"data/vaneerConsumption/VanderbiltstunsGeorgiainAthens.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/15/Images/101616%20uga%20photos%20bs11.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_vanderbilt-stuns-georgia-athens__1540928100.html","title":"Vanderbilt stuns Georgia in Athens","title_page":"Vanderbilt stuns Georgia in Athens","title_rss":"NULL","source_domain":"ajc.com","text":"Nick Chubb said all the right things. He gave Vanderbilt’s defense credit for everything it did and everything it kept Georgia from doing. And he was not critical of Jim Chaney’s last offensive play call of the game. But his voice told you he was disappointed to not get the ball in his hand in that moment.\n“It’s a coach’s decision,” said Chubb, who served as lead blocker on a sweep right to Isaiah McKenzie for no gain. “He felt like that was a good play. We all agreed on it, Coach (Kirby) Smart, Coach (Sam) Pittman, we all agreed. We thought it would work, but they came up and stopped it.”\nIt wasn’t until after the play had been stopped and the referee signaled a Vanderbilt first down there other way that it truly sunk in for Chubb.\n“It’s just unreal,” he said. “Didn’t want to believe it, but it happened.”\nGeorgia, trailing 17-16 with 1:01 to play, faced fourth-and-one at the Vanderbilt 41-yard line when a game of chess broke out. Kirby Smart and Vanderbilt coach Derek Mason each exchanged timeouts, but ultimately both stuck with what they had called.\nGeorgia Bulldogs defensive back Juwuan Briscoe tries to strip the ball from Vanderbilt Commodores running back Khari Blasingame during the fourth quarter Saturday, Oct. 15, 2016, at Sanford Stadium in Athens. (Brant Sanderlin/AJC)\nWhat the Bulldogs had called was unusual in that situation. Flanker Isaiah McKenzie shifted out of the slot and moved behind Chubb to tailback. The 5-foot-7, 175-pound receiver then took a toss sweep right with Chubb as one of his lead blockers.\nIt looked at first as though there was some room out wide, next to the Bulldogs’ bench. The Commodores had crowded the middle of the line of scrimmage like they had all day and like Smart and the Bulldogs anticipated on that play. What they didn’t anticipate was linebacker Zach Cunningham coming free down the line of scrimmage to the outside. He caught up with McKenzie just as he planted to come up field to get the coveted yard.\n“I didn’t see the guy coming backside,” McKenzie said. “That’s basically what happened. It was a play they made, they made a good play. I was just thinking: ‘Get one yard, get one yard.’ But there was a man that came backside and tackled me.”\n“That Man” is Cunningham, the SEC’s leading tackler. And he will continue to be. That was his 19th tackle of the day.\nAnd he’s probably thankful it wasn’t Chubb he was having to bring down. Then again, Georgia’s ground game managed just 75 yards a week after going for 326. Chubb finished with 40 on 16 carries.\nChaney, Georgia’s offensive coordinator, was not available comment after the game as Smart’s policy does not allow for assistant coaches to be interviewed. But the head coach was asked a lot about that play in his postgame news conference. And he still believes it was a good call.\n“They had run the same stunt two or three times in the game,” Smart said. “They were looking for the inside zone play, which we had run earlier in the game. They had stopped us each time. Coming out of the timeout(s), they ran the same stunt, which I didn’t thing they did. They had everybody in the middle to plug. We really though we had exactly what we wanted. We were really to call (another) timeout if we didn’t.”\nThe concept of the play is McKenzie is the Bulldogs’ fastest offensive player, so conceivably he could get to the corner quicker than anyone else. But they could also have run the same play with Sony Michel lining up in the slot and then shifting into the backfield.\nThey could have just tossed it to Chubb as well. But neither he nor Michel or any of the Bulldogs’ other backs could it going. And it wasn’t from a lack of trying. Georgia averaged 2.1 yards a carry on 35 attempts.\n“We have confidence in ourselves,” Chubb said. “It’s just one yard, but we weren’t able to get it.”\nGeorgia Bulldogs running back Nick Chubb is brought down by Vanderbilt Commodores linebacker Ja'karri Thomas during the third quarter Saturday, Oct. 15, 2016, at Sanford Stadium . (Brant Sanderlin/AJC)\nEarly in the game, Georgia resorted to a play-action pass on third-and-one and completed it to keep a scoring drive alive. That was an option here as well.\n“We don’t get to make those decisions,” senior left tackle Tyler Catalina said. “Whatever Coach Chaney called, we’re with. As an offense, we have confidence in any play. We believe we’re going to succeed, no matter what the play is. We just have to execute. We got out-executed today.”\nPlayers were assigned to keep the middle linebacker from getting outside to make the tackle near the sideline. They just weren’t able to get it done.\n“We felt really good about it,” Smart said. “We were set to get the first down. The guy (Cunningham) came off his block. … We had the call we wanted.”\nSo did Vanderbilt.","url":"https://www.ajc.com/sports/college/vanderbilt-stuns-georgia-athens/o7zkKLSyt4D2VTlhjAE9tK/"}
