{"authors":["Hannah Mellin For Mailonline"],"date_download":"2018-10-23 03:23:11","date_modify":"2018-10-23 03:23:11","date_publish":"2017-03-10 12:55:53","description":"The actress, 28, rocked another chic ensemble as she grabbed a spot of breakfast in Los Angeles on Thursday morning.","filename":"data/vaneerConsumption/VanessaHudgensstylishindungareesandcameljacket.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E2299EB00000578-0-image-a-38_1489146785224.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300924_Vanessa-Hudgens-stylish-dungarees-camel-jacket_1540264991.html","title":"Vanessa Hudgens stylish in dungarees and camel jacket","title_page":"Vanessa Hudgens stylish in dungarees and camel jacket | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the ultimate queen of bohemian style.\nAnd Vanessa Hudgens rocked another chic ensemble as she grabbed a spot of breakfast in Los Angeles on Thursday morning.\nThe actress, 28, looked effortlessly on-trend in a pair of denim dungarees and a camel corduroy jacket with a cream fur-effect collar.\nScroll down for video\nBoho queen: Vanessa Hudgens rocked another chic bohemian-inspired ensemble as she grabbed a spot of breakfast in Los Angeles on Thursday morning\nTeetering along in a pair of towering black peep-toe heels, the former High School Musical star teamed her turned-up denims with a simple white crop top.\nThe brunette wore her dark locks slicked back into a tight bun and accentuated her striking features with vampy berry lipstick.\nVanessa toted her belongings in a large chocolate brown leather Chloe handbag, while sheltering her eyes from the Californian sun with a pair of stylish aviator shades.\nCaffeine fix: The actress, 28, looked effortlessly on-trend in a pair of denim dungarees and a camel corduroy jacket with a cream fur-effect collar\nThe actress grabbed a healthy breakfast on the go, and was seen emerging from her eatery of choice with a refreshing iced coffee and a bowl of fruit and yoghurt.\nVanessa - who currently has a role in NBC's new show Powerless, set in the Marvel world - has some existing projects in the works.\nThe star has bagged herself a role in forthcoming film, The Prenup, which will start filming in the next couple of months.\nVanessa will join Lone Survivor actor Emile Hirsch in the new romantic comedy.\nDressed to impress: Teetering along in a pair of towering black peep-toe heels, the former High School Musical star teamed her turned-up denims with a simple white crop top\nThe plot of the film centres around the aftermath of an American investment banker suggesting to his British bride that they should get a pre-nuptial agreement the night before their wedding.\nDownton Abbey's Hugh Bonneville will play Emile's character's father in the feel-good chick flick.\nVanessa's personal life seems to be going just as well as her career.\nThe actress - who previously dated Zac Efron, 29, for five years - has been in a long-term relationship with actor and singer Austin Butler, 25, since 2011.\nFun in the sun: Vanessa toted her belongings in a large chocolate brown leather Chloe handbag, while sheltering her eyes from the Californian sun with a pair of aviator shades","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300924/Vanessa-Hudgens-stylish-dungarees-camel-jacket.html"}
