{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 01:51:11","date_modify":"2018-10-23 01:51:11","date_publish":"2016-01-11 13:10:47","description":"The actress looked incredible in a black velvet dress with sexy sheer panels at the bust and on the skirt as she cuddled up to boyfriend Austin Butler at the Beverly Hilton Hotel after-party on Sunday.","filename":"data/vaneerConsumption/VanessaHudgensstunsinvelvetdresswithboyfriendAustinButleratGoldenGlobesparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300A6A8300000578-0-image-a-16_1452517645651.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393913_Vanessa-Hudgens-stuns-velvet-dress-boyfriend-Austin-Butler-Golden-Globes-party_1540259471.html","title":"Vanessa Hudgens stuns in velvet dress with boyfriend Austin Butler at Golden Globes party","title_page":"Vanessa Hudgens stuns in velvet dress with boyfriend Austin Butler at Golden Globes party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She usually favours a demure sense of style, but Vanessa Hudgens upped the glamour to attend the 2016 Golden Globes.\nThe 26-year-old actress looked incredible in a black velvet dress with sexy sheer panels at the bust and on the skirt as she cuddled up to boyfriend Austin Butler at the Beverly Hilton Hotel after-party on Sunday night.\nVanessa looked incredible in the slinky number, twisting and twirling on the red carpet to ensure her gown with pretty backless detailing was seen in all its glory.\nScroll down for video\nGood looking couple! Vanessa Hudgens cosied up to boyfriend Austin Butler at the 2016 Golden Globes after-party, held at the Beverly Hilton Hotel on Sunday night\nAustin, who has been dating the High School Musical beauty for four years, laced a protective arm around her waist as they made their grand arrival.\nThe cute couple looked perfectly in sync as they prepared to party the night away with a host of A-list names at the event.\nVanessa turned heads in her elegant gown, which boasted simple spaghetti straps and glittering swirls embellishing the sheer panels.\nGorgeous gown: The High School Musical actress wowed in a black velvet number with sparkling embellishment on the sheer train\nCoordinated to perfection: Vanessa set off her Gothic glam look with matching sparkling accessories and a black manicure\nShe accessorised with a sparkling silver clutch to match and kept her hair and make-up look classic.\nWearing her dark locks scraped back on top of her head in a ballerina bun, Vanessa sported a shimmery pink lip gloss and a dramatic smokey eye shadow.\nVanessa is nervously preparing to star in a live TV broadcast of the musical Grease on January 31, playing bad girl Rizzo opposite Julianne Hough.\nElegant: The 26-year-old beauty wore her brunette locks pulled back in a top knot for the bash\nVanessa told Entertainment Weekly that she's ready to tackle the role of the famous leader of the Pink Ladies, who she described as 'a toughie'.\n'She’s deep, you know. She’s a toughie. So I’m excited to kind of sink my teeth into that', she explained.\n'That’s a character I’ve never played before so it’ll be fun and a challenge.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393913/Vanessa-Hudgens-stuns-velvet-dress-boyfriend-Austin-Butler-Golden-Globes-party.html"}
