{"authors":["Sameer Suri For Dailymail.Com"],"date_download":"2018-10-23 04:43:12","date_modify":"2018-10-23 04:43:12","date_publish":"2017-04-26 16:17:12","description":"Vanessa Hudgens was spotted out and about in Los Angeles on Tuesday, baring a bit of her midriff beneath a black crop top. Her show Powerless was just yanked from the NBC schedule.","filename":"data/vaneerConsumption/VanessaHudgensshowsofftonedmidriffinLosAngeles.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA0710400000578-0-image-a-19_1493219538157.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4448088_Vanessa-Hudgens-shows-toned-midriff-LA_1540269792.html","title":"Vanessa Hudgens shows off toned midriff in Los Angeles","title_page":"Vanessa Hudgens shows off toned midriff in Los Angeles | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Vanessa Hudgens was spotted out and about in Los Angeles on Tuesday, baring a bit of her taut midriff beneath a black crop top.\nAmbling along beside a friend, the 28-year-old had pulled on a pair of high-waisted loose black and white sweats and slipped into pink fuzzy slippers.\nHer DC Comics office sitcom Powerless, which still has three episodes of its first season left to air, has been dropped from NBC's schedule, Variety reported Tuesday.\nScroll down for video\nShowing what she's got: Vanessa Hudgens was spotted out and about in Los Angeles on Tuesday, baring a bit of her taut midriff beneath a black crop top\nAn official cancellation hasn't been announced, and Patrick Schumacker - one of the showrunners alongside Justin Halpern - has tweeted his take on the news.\n'#Powerless will not air this week or next. This, I know for sure. I can guess some other things but they're not good. Thanks for watching,' he wrote re: the show, the most recent episode of which only drew in 2 million viewers and a 0.6 rating.\nVanessa's starred as the Director Of Research And Development at a company selling items to insulate people from superheroes' and supervillains' escapades.\nHaving a chat: Ambling along beside a friend, she'd pulled on a pair of high-waisted loose black and white sweats, flinging on a jacket and slipping into pink fuzzy slippers\nDishing to The Hollywood Reporter in February, Patrick gave the example: 'They can create an umbrella called a \"rumbrella\" that protects you from falling rubble.'\nBen Queen had created the series, but it emerged he was leaving last August, with Patrick and Justin ultimately sliding into his spot as showrunners.\nPatrick had explained to The Hollywood Reporter: 'Justin and I were brought on as five-day-a-week consulting producers on the original show, so we were there for pre-production when Ben Queen was running the show.'\nThe end?: Her DC Comics office sitcom Powerless, which still has three episodes of its first season left to air, has been yanked from NBC's schedule, Variety reported Tuesday\nBack then, 'it was a world of insurance,' but 'nobody on the staff understood the world of insurance and at best, you're telling stories where, if this team wins the day, it means, like, f***ing somebody out of money.'\nSaid he: 'We were really hitting a wall, and eventually when the turnover happened, we were asked to take over the show and we decided we wanted to do something that would more organically bring in the genre elements of it.'\nVanessa's co-stars on the show - set in the fictional Charm City - include Danny Pudi, Christina Kirk, Ron Funches, Alan Tudyk and Jennie Pearson.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4448088/Vanessa-Hudgens-shows-toned-midriff-LA.html"}
