{"authors":[],"date_download":"2018-10-30 14:22:46","date_modify":"2018-10-30 14:22:46","date_publish":"2016-12-16 00:20:00","description":"A minivan taken at knife-point in Alpharetta was recovered Thursday in Cherokee County, officials sa...","filename":"data/vaneerConsumption/VanrecoveredafterviolentcarjackinginAlpharetta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/15/Images/van.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_van-recover_f6c4a2995fd9cb8b5a88ef21b9df8aae__1540909366.html","title":"Van recovered after violent carjacking in Alpharetta","title_page":"Van recovered after violent carjacking in Alpharetta","title_rss":"NULL","source_domain":"ajc.com","text":"A minivan taken at knife-point in Alpharetta was recovered Thursday in Cherokee County, officials said.\nPolice found the abandoned car, but not the driver, near the intersection of Arnold Mill and Mill Creek roads in Woodstock shortly before 4 p.m., according to Channel 2 Action News.\nA man allegedly forced a woman from her van Wednesday when she stopped at a red light at the intersection of Rucker and Harris roads in Alpharetta.\nAlpharetta police said the woman was stopped at a light when the attacker broke out her passenger-side window and climbed into her van.\nThe woman attempted to fight back by elbowing the attacker in the head, Alpharetta police spokesman Officer George Gordon said.\nBut when the man pulled out a knife, she ran to a nearby home and called 911.\n“You can imagine how traumatized she was,” Gordon told Channel 2. “She lost her car. She lost her purse. It’s my understanding she had gifts in her vehicle for the holiday season.”\nVan taken during carjacking located, but search for carjacker continues. Latest at 4. pic.twitter.com/Ok0m5DzxHh — Mike Petchenik (@MPetchenikWSB) December 15, 2016\nGordon said the man believed to have carjacked the woman walked into a Walgreen’s pharmacy in Alpharetta on Wednesday night and attempted to rob it.\n“This guy is very brazen,” he said. “We consider him to be very dangerous.”\nCops: Man busts window, carjacks woman at knife-point in Alpharetta","url":"https://www.ajc.com/news/crime--law/van-recovered-after-violent-carjacking-alpharetta/ovoS0Q61UHcKKVNrmarInJ/"}
