{"authors":["Associated Press"],"date_download":"2018-10-23 04:56:56","date_modify":"2018-10-23 04:56:56","date_publish":"2017-03-16 15:59:18","description":"NEW ORLEANS (AP) - Many people who attend the annual Essence Festival in New Orleans do so without ever setting foot in the Superdome, where nightly,...","filename":"data/vaneerConsumption/VanzantDuVernaySharptonamongfestsdaytimespeakers.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320834_Vanzant-DuVernay-Sharpton-fests-daytime-speakers_1540270616.html","title":"Vanzant, DuVernay, Sharpton among fest's daytime speakers","title_page":"Vanzant, DuVernay, Sharpton among fest's daytime speakers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW ORLEANS (AP) - Many people who attend the annual Essence Festival in New Orleans do so without ever setting foot in the Superdome, where nightly, ticketed concerts are held as part of the experience.\nInstead, they attend the free daytime programs held at the Ernest N. Morial Convention Center.\nFestival organizers announced Thursday that life coach Iyanla Vanzant, U.S. Rep. Maxine Waters of California, the Rev. Al Sharpton, director Ava DuVernay, author and radio host Dr. Michael Eric Dyson, activist April Reign and National Women's March Co-Founder Tamika D. Mallory are among those scheduled to headline seminars and workshops as part of the festival, which takes place June 30-July 2.\nEssence magazine Editor-in-Chief Vanessa K. De Luca said this year's empowerment stage will \"bridge the gap between this generation's most prominent voices in leadership.\"\n\"Our audience doesn't want to come and just be entertained,\" De Luca said. \"They want to be informed. They want to be challenged to push the envelope and find out how they can become more engaged in the community. If you go to another festival, you won't get what you get at the Essence Festival. We give people something to take away from their time spent there. That's what this stage is for.\"\nDe Luca said she's especially excited about the newcomers, including 19-year-old Spelman College sophomore Mary-Pat Hector, who's running for office in Georgia, and poet Cleo Wade \"who will shed light on a new wave of social and artistic activism anchored by next generation's leaders.\"\n\"They have mastered the idea of social media and social activism to bridge that line between the next generation of leaders and the established old guard. We wanted to make sure we're bringing those new voices and new faces to our audience,\" De Luca said.\nLast year, between 100,000 and 120,000 people visited the convention center during the festival to participate in the Beauty and Style expo and the conference on Entrepreneurship, Money & Power.\n\"We know this is programming that resonates with our audience, otherwise, we wouldn't do it,\" De Luca said.\nFor a full lineup of this year's daytime speakers and artists, visit www.essencefestival.com.","url":"https://www.dailymail.co.uk/wires/ap/article-4320834/Vanzant-DuVernay-Sharpton-fests-daytime-speakers.html"}
