{"authors":["Samantha Young","David Gorn","Matt Levin","Ben Christopher"],"date_download":"2018-10-30 22:48:46","date_modify":"2018-10-30 22:48:46","date_publish":"2016-10-20 08:00:00","description":"“Unicorn” opens his mod device and lets a few drops of clear juice fall. His vaporizer replenished, he deeply inhales and slowly exhales—an enormous","filename":"data/vaneerConsumption/VapingonthevergeWithProp56Californiacouldstarttaxingecigsliketobacco.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/VapingRotator2-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939726.html","title":"Vaping on the verge: With Prop. 56, California could start taxing e-cigs like tobacco","title_page":"Vaping on the verge: With Prop. 56, California could start taxing e-cigs like tobacco | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"“Unicorn” opens his mod device and lets a few drops of clear juice fall. His vaporizer replenished, he deeply inhales and slowly exhales—an enormous amount of smoke billowing out of his nose and mouth. But it’s not actually smoke: the smell isn’t foul, it’s sweet.\n“The nicotine mellows me out without any of the negative impacts of smoking,” said Ryan Freeman, aka the Unicorn, a 28-year-old salesman in jeans and a backwards baseball cap, as he sinks into a couch at a vape shop in Folsom. “I went from wheezing every day to breathing.”\nVaping nicotine has grown in popularity in the last decade, especially among young adults like Freeman who are current or former cigarette smokers, according to the National Health Interview Survey. The liquid nicotine—or vape juice, e-juice and e-liquid—is touted as a safer alternative than cigarettes that contain harmful carcinogens and chemicals. But because e-cigarettes and vaping are relatively new to the market, they have been largely unregulated.\nUntil now. Increasingly public health officials are targeting the industry, condemning the products as addictive, alluring to youth and a gateway to cigarettes. And one of the greatest threats they face looms on the November ballot in California.\nProposition 56 is best known as the measure to dramatically boost the state’s relatively low cigarette tax. But it also would start to tax e-cigarettes and liquid nicotine like tobacco—which both sides say could trigger a similar push nationwide.\n“Electronic cigarettes are extending and expanding the tobacco epidemic,” said Stanton Glantz, professor of medicine at University of California, San Francisco and director of the Center for Tobacco Control Research and Education. “They are bringing a whole new group of kids into the tobacco market who would never start cigarettes.”\nIn June, the journal Pediatrics published a study that found adolescents who had smoked e-cigarettes were more than six times as likely to smoke cigarettes than their peers who had never used an e-cigarette.\nThe U.S. Food and Drug Administration in May issued regulations classifying the products as tobacco, banning the sale to anyone under 18 after surveys showed e-cigarette use among high school students had skyrocketed from 1.5 percent to 16 percent in the past four years. This summer, Gov. Jerry Brown signed a law raising the legal smoking age in California to 21—and applying it to vaping.\nA growing number of cities have banned flavored nicotine, which comes in more than a thousand combinations of concentrations and flavors: Blackberry, Watermelon and Apple Crisp, just to name a few. Five states so far have imposed additional taxes on e-cigarettes or vapor products.\n“We have been under attack,” said Tony Doan, who owns two liquid nicotine manufacturing facilities in the San Jose area. “They are making it impossible to stay in business and provide this alternative product. Passively, what they are doing is banning us.”\nProp. 56 increases taxes on cigarettes by $2, moving it from one of the lowest tobacco taxes in the country to one of the highest, and imposes new taxes on liquid nicotine products.\nWhile the $2 tax increase will certainly hit smokers in the wallet, it will be even greater for vapers. That’s because the proposition would levy a 68 percent tax on liquid nicotine—turning a $15-$20 bottle of juice into a $40 to $50 bottle.\n“Everybody is going to go back to cigarettes,” said Doan, founder and president of Shijin Vapor. “A lot of people don’t realize that.”\nThe battery-powered e-cigarettes and vaporizers are touted as way for smokers to quit – weaning them off nicotine with a product that still allows them to experience the sensation of smoking. A heavy smoker, for example, might start with a bottle of e-juice that contains 12 milligrams for each milliliter of nicotine and over time move to a bottle that contains just 3 mg/ml of nicotine. For those who just vape for fun, some liquids are nicotine-free.\nMost experts agree vaping is less hazardous because the liquids don’t contain carcinogens. But recent studies have linked nicotine itself to adverse health conditions, including increased risk of heart attack and stroke. Most researchers agree little is known about their long-term effects.\nThe fact that the proposition includes e-cigarette and vaping alongside cigarettes and other tobacco has resulted in an unlikely partnership among competitors. Industry giants Philip Morris and RJ Reynolds have poured $66 million so far into the campaign to oppose Proposition 56. The message from the opposition, however, has been largely focused on criticizing how the tax revenues would be spent. Meanwhile, the argument that e-cigarettes and vaping are a safer alternative to tobacco is being voiced at the grassroots level, as wholesalers talk to vape store owners, who then encourage their customers to vote against the measure.\nThe stakes for this nascent industry are high.\n“California is the mother of everything,” Doan said. “Once California passes it, every other state is going to follow suit and that’s what is alarming.”\nAt Folsom Vapor, a family owned-and-operated shop near the campus of Folsom Lake College, the owners say they are already struggling to keep their business afloat after the state banned vaping for those under 21. An added tax on liquid nicotine will make their products unaffordable to many of their customers, said co-owner James Goldsmith.\n“To be classified as tobacco—a lot of us as business owners feel we got manipulated into these laws,” said Goldsmith, a former smoker who now vapes. “It doesn’t feel right.”\nIf voters approve Prop. 56., Goldsmith said he is likely to close his store, a place where customers come not just to buy their juice but to socialize and catch up with friends. On a recent Friday evening, the store had just a handful of customers. Some just came to buy a bottle while others stayed to vape, blow O-rings and cloud chase or challenge a friend to a game on the PlayStation.\n“We’re a family. This is life for us,” said Freeman, the “Unicorn.” “If you’re a vaper, it doesn’t matter where you come from. You are part of the community.”\nIt is unclear what voters will do. Although public polls show support for Proposition 56, voters have twice opposed recent ballot initiatives that would have boosted tobacco taxes. In both cases, in 2006 and 2012, the tobacco industry spent heavily to defeat them.\nShow me the money: Prop. 56\nThis year is no different. Tobacco companies have mounted an aggressive TV campaign that underscores only 13 percent of the money raised would be spent on smoking prevention and cessation programs. Much of the additional tax revenue would pay for medical services for poor people through MediCal.\nHealth advocates argue that roughly 17,000 kids get hooked on tobacco every year, a third of whom will die from a tobacco-related disease. And they say the additional tax money raised by Proposition 56 would fully restore funding to effective anti-smoking programs that help keep cigarettes, e-cigarettes and vaping devices out of the hands of children.\n“If voters pass 56, I think we will wipe out tobacco as a health issue in the next few years,” Glantz said. “If that happens, we’ll set a precedent for the rest of the country and the world that would be devastating for the tobacco industry.”","url":"https://calmatters.org/articles/vaping-on-the-verge-with-prop-56-california-start-taxing-e-cigs-like-tobacco/"}
