{"authors":[],"date_download":"2018-10-22 22:12:57","date_modify":"2018-10-22 22:12:57","date_publish":"2014-05-09 13:08:16","description":"Internal government studies from the past several years found delays in patient care across the country, including delays that may have led to deaths.","filename":"data/vaneerConsumption/VAProblemsGoFarBeyondPhoenixSayGovernmentReports.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_va-hospital-scandal_va-problems-go-far-beyond-phoenix-say-government-reports-n101281_1540246377.html","title":"VA Problems Go Far Beyond Phoenix, Say Government Reports","title_page":"VA Problems Go Far Beyond Phoenix, Say Government Reports","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nLong before charges that at least 40 patients may have died while waiting for care at a Phoenix VA hospital, a series of internal government reports showed there were significant delays in patient care at ten different Veterans Health Administration facilities in eight states and the District of Columbia, including some that may have caused deaths.\nIn September 2013, the Inspector General’s office at the Veterans Affairs Department reported what it called “a disturbing set of events” at the William Jennings Bryan Dorn medical center in Columbia, S.C., that “led to thousands of delayed gastroenterology consults for colon cancer screening.”\n“Over 50 veterans had a delayed diagnosis of colon cancer, some of whom died from colon cancer,” said John Daigh, the assistant I.G. at the Veterans Affairs Department, during testimony before the House Committee on Veterans’ Affairs last month.\nIn July 2011, according to Daigh, there were 2,500 delayed gastroenterological consultations at the Columbia facility, including 200 that were deemed “critical” by VA doctors. By December, the backlog had grown to 3,800 delayed consultations. Later, 280 patients were diagnosed with malignancies, “52 of whom were associated with a delay in diagnosis and treatment.”\nWatch a CNBC documentary on the VA.\nAccording to the American Cancer Society, it can take as many as 10 to 15 years for a polyp to became cancerous, and early detection greatly increases the survival rate.\nAt the same hearing, Debra Draper, director of the GAO’s Health Care Government Accountability, described delays in VA patient care nationwide.\nAccording to a GAO study referenced by Draper, for all outpatient consults systemwide in 2012 -– meaning requests by doctors and others for outside doctor visits and procedures -- VA officials said that approximately 2 million consults had not been acted on for more than 90 days. Nearly 500,000 of those consults were still “unresolved” as of April 2014, according to the GAO.\n“Although access to timely medical appointments is critical to ensuring that veterans obtain needed medical care, problems with VHA’s scheduling and management of outpatient medical appointments may contribute to delays in care, or care not being provided at all,” said Draper.\nIn 2012, the GAO studied patient care at VA hospitals in Los Angeles, Washington, D.C., Dayton, Ohio and Fort Harrison, Mont. The GAO determined that at those facilities “medical appointment wait times were unreliable” and that “inadequate oversight of the outpatient medical appointment scheduling processes contributed to … problems with scheduling timely medical appointments.” The GAO has also cited poor training, inconsistent procedures, old software and employee turnover as factors in delayed care.\nIn 2013, a separate GAO study at five other facilities in Maine, Denver, California, Florida and Oklahoma also showed delays in outpatient care.\nIt described delays of more than 100 days in four out of 10 physical therapy consults, including one of 252 days, and a delay of 210 days for a colonoscopy.\nAccording to Draper, “VA medical center employees cited increased demand for services and patient no-shows and cancelled appointments among the factors that lead to delays.” The system is trying to cope with an influx of Iraq and Afghanistan veterans, many of whom have missing limbs and other battlefield injuries that require complex care, and the rising need of Baby Boom Vietnam era veterans for the medical services that come with advancing age.\nWhistleblowers are now accusing VA hospitals in Phoenix and elsewhere of producing misleading data about patient wait times, including creating secret patient “wait lists” to keep delays off the books.\n“When it comes to data on patient wait times and access to medical care, VA has a credibility problem that is growing by the day,” said Rep. Jeff Miller, R.-Fla, chairman of the House Committee on Veterans’ Affairs. “Therefore, I have no confidence that the department’s recently announced Nationwide Access Review will yield results that are either accurate or useful. Given the fact that the department now stands accused of cooking appointment wait time books in multiple locations, an independent review of VA’s entire system for ensuring veterans receive timely care is clearly warranted.”\nFollow NBC News Investigations on Twitter and Facebook.","url":"https://www.nbcnews.com/storyline/va-hospital-scandal/va-problems-go-far-beyond-phoenix-say-government-reports-n101281"}
