{"authors":["Edwin Mora"],"date_download":"2018-10-30 19:57:32","date_modify":"2018-10-30 19:57:32","date_publish":"2016-05-26 00:51:25","description":"Democrats and Republican lawmakers alike are lambasting VA Secretary Robert McDonald for comparing VA wait times to lines at Disneyland.","filename":"data/vaneerConsumption/VASecretarysDisneyRemarksDrawBipartisanIrefromLawmakers.json","image_url":"https://media.breitbart.com/media/2016/05/US-Secretary-of-Veterans-Affairs-Robert-McDonald-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_05_25__1540929452.html","title":"VA Secretary's Disney Remarks Draw Bipartisan Ire from Lawmakers","title_page":"VA Secretary's Disney Remarks Draw Bipartisan Ire from Lawmakers","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON, D.C. — Democrats and Republican lawmakers alike are lambasting Department of Veteran Affairs (VA) Secretary Robert McDonald for playing down the fatal impact of the wait times at VA medical centers by comparing them to lines at Disneyland.\nSome GOP senators, including former Republican presidential candidate Ted Cruz (R-TX), have called for McDonald to resign.\nMeanwhile, Senate Minority Leader Harry Reid (D-NV) has come out as one of the few officials to defend the embattled VA secretary, saying, “He is a good man. He’s doing his best under very, very difficult circumstances. So, I support Secretary McDonald all the way.”\nNot all Democrats, however, have taken the comments by President Barack Obama’s VA chief so lightly.\nDecorated Iraq war veteran Rep. Tulsi Gabbard (D-HI) told CBS News McDonald should just apologize but stopped short of calling for him to step down.\n“I got to tell you when I read that I got pissed off,” declared Rep. Gabbard, referring to McDonald’s comments. “I thought his remarks were insensitive at best, but they were just completely flat out wrong and he should do the right thing and apologize. Apologize to our veterans and apologize to the country for making such a terribly wrong statement.”\nThe secretary’s resignation will not solve the systemic problems at the VA, noted the Hawaii Democrat, who currently serves as a major in the U.S. Army National Guard.\nInstead, the VA “bureaucracy” should hold people accountable for the long wait times at VA hospitals, which have led to a number of deaths and other issues within the department, by either demoting or firing the employees responsible for the problems, she explained.\nInitially, Secretary McDonald refused to apologize for his Disneyland comparison, but more than a day after uttering those comments, he expressed “regret.”\nCBS News asked House Armed Services Committee member Gabbard whether McDonald’s statement “was enough.”\nShe replied,“I don’t know why he can’t just say ‘I’m sorry’… it means a lot to people when leaders stand strong and take responsibility.”\nFellow Democrat and Iraq war veteran Rep. Tammy Duckworth (D-IL), who lost her legs and partial use of her right arm in combat, also strongly condemned the secretary’s remarks.\n“Comparing abhorrent wait times to a trip to Disneyland is unbelievably tone-deaf and hurtful to American heroes desperately in need of care,” Duckworth, who represents Obama’s home state, said in a statement.\nThe VA secretary “needs to comprehensively address the VA’s systemic problems — and that means reducing wait times, improving care and increasing patient satisfaction,” she added, echoing Gabbard. The Illinois democrat, who is running for Senate, is still receiving VA-provided health care.\nRep. Gabbard told CBS News she agrees with her colleague that McDonald’s comments were “tone-deaf.”\n“It’s a very cold look at things when you actually look at the people who’ve been impacted by these wait times,” said Gabbard, noting that some of her fellow veterans and constituents in Hawaii were subjected to “the longest wait times of any state in the country.”\nSen. Richard Blumenthal (D-CT), the top Democrat on the Senate Veterans Affairs Committee, also expressed concern about McDonald’s comments.\n“I am troubled by the words but I hope there is better intent behind them and they do not reflect a broader attitude that delay and lack of accountability are okay,” he told CNN. “He’s been very responsive. He knows that care has to be high quality and timely and that’s been a goal. I look forward to talking to him about what he meant.”\nSen. Joni Ernst (R-IA), Sen. Roy Blunt (R-MO), and Sen. Cruz have called on McDonald to resign. Their Republican colleague in the House who represents a district with one of the highest numbers of veterans in the United States, Rep. Vern Buchanan (R-FL), has joined them.\nOther top Republicans, such as House Speaker Paul Ryan (R-WI), have criticized the VA secretary for his comments but stopped short of calling for his resignation.","url":"https://www.breitbart.com/national-security/2016/05/25/va-secretary-disneyland-remarks-draw-bipartisan-ire/"}
