{"authors":["Charlie Spiering"],"date_download":"2018-10-30 20:00:15","date_modify":"2018-10-30 20:00:15","date_publish":"2016-05-23 15:16:28","description":"Veterans Affairs Secretary Bob McDonald does not think that measuring the number of days it takes for a veteran to receive a medical appointment is a valid assessment of success for the Obama administration's VA. | Politics","filename":"data/vaneerConsumption/VASecretaryComparesLongHospitalWaitsToLinesAtDisneyland.json","image_url":"https://media.breitbart.com/media/2016/05/VA.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_05_23__1540929615.html","title":"VA Secretary Compares Long Hospital Waits To Lines At Disneyland","title_page":"VA Secretary Compares Long Hospital Waits To Lines At Disneyland | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Veterans Affairs Secretary Bob McDonald does not think that measuring the number of days it takes for a veteran to receive a medical appointment is a valid assessment of success for the Obama administration’s VA.\n“To me personally, the day to an appointment is really not what we should be measuring, what we should be measuring is the veterans satisfaction,” he said.\nTo illustrate his point, he cited the long lines at Disney theme parks.\n“When you go to Disney, do they measure the number of hours you wait in line or what’s important?” he said. “What’s important is: What’s your satisfaction with the experience.”\nHe argued that the 14 days to an appointment promise was “irrelevant” to the administration, which helped cause problems by some veterans hospitals falsifying the numbers.\n“Was that the right measure? I would argue it wasn’t,” he said. “The problem at VA right now is we have too many measures.”\nMcDonald made his remarks during a breakfast with reporters in Washington D.C. hosted by the Christian Science Monitor.\nHe refused to make the appointment wait times numbers public, arguing that it was not a suitable measure for success.\n“Maybe it’s because we don’t think it’s valid,” he said. “We want to validate every measure that we have before we give it to you to then write articles about criticizing us for that measure not being valid.”\nUPDATE:\nIn a statement to Breitbart News, Senator Mark Kirk (R-IL) condemned Secretary McDonald’s comment:","url":"https://www.breitbart.com/politics/2016/05/23/va-secretary-compares-long-hospital-waits-lines-disneyland/"}
