{"authors":["John Hayward"],"date_download":"2018-10-30 19:57:49","date_modify":"2018-10-30 19:57:49","date_publish":"2015-02-24 19:18:26","description":"Given both the crisis still in progress at the Department of Veterans Affairs, and the controversy over NBC News' Brian Williams getting in trouble for a phony story of taking fire in Iraq, this was not a good moment for a combo scandal in which the new VA Secretary, Robert McDonald, got caught making a false claim of serving with U.S. Special Forces. |","filename":"data/vaneerConsumption/VASecretaryApologizesForFalseClaimOfServingInSpecialForces.json","image_url":"https://media.breitbart.com/media/2015/02/AP458723257918.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_24__1540929469.html","title":"VA Secretary Apologizes For False Claim Of Serving In Special Forces","title_page":"VA Secretary Apologizes For False Claim Of Serving In Special Forces | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Given both the crisis still in progress at the Department of Veterans Affairs, and the controversy over NBC News’ Brian Williams getting in trouble for a phony story of taking fire in Iraq, this was not a good moment for a combo scandal in which the new VA Secretary, Robert McDonald , got caught making a false claim of serving with U.S. Special Forces.\nPerhaps more disturbingly, he was also recently caught misrepresenting the number of heads he’s sent rolling over his department’s “secret death list” scandal.\nThe false claim of Special Forces service came during a conversation with a homeless veteran, captured in a CBS News story broadcast on January 30. The controversial remark was very brief – when the homeless vet said he was a special operator, McDonald replied, “Special forces? What years? I was in special forces!”\nThe Huffington Post notes that with B.S. detectors still running hot after the Brian Williams scandal, it didn’t take long for several retired military officials to catch McDonald’s embellishment of his military service. As the HuffPo explains, he never actually served in a special-forces unit, although he did graduate Army Ranger school in the mid-Seventies.\nContacted by the Huffington Post for comment, McDonald was swift and direct in retracting his claim: “I have no excuse. I was not in special forces.” He described his incorrect claim as “spontaneous” and said that while he was wrong to make it, he had “no intent in any way to describe my record any different than it is.”\nSecretary McDonald later issued a longer statement of apology to the Military Times:\nWhile I was in Los Angeles, engaging a homeless individual to determine his Veteran status, I asked the man where he had served in the military. He responded that he had served in special forces. I incorrectly stated that I had been in special forces. That was inaccurate and I apologize to anyone that was offended by my misstatement. I have great respect for those who have served our nation in special forces.\nThere are several problems with McDonald’s conduct, beginning with the fact that he obviously underestimated how carefully the special-forces community checks such claims, particularly when they come from prominent individuals. Retired special forces commander Col. Gary Bloomberg said his initial reaction to McDonald’s false claim was, “What a boneheaded statement – is this what we want from our senior government officials?”\nHe used the word “boneheaded” enough to make an outsider suspect it is used with some frequency by the special operations community at these eye-rolling moments. It sounds like just the right word to capture the somewhat moderated exasperation they feel when an actual veteran inappropriately claims a special forces background, as opposed to full-blown “stolen valor” thieves peddling entirely false claims of service.\nTo repeat Col. Bloomberg’s question, how does someone “accidentally” claim to be a former special operator, and why would a high government official – let alone the Secretary of Veterans Affairs, especially at this troubled juncture – make such a claim, even during such a brief conversation?\nWhile the White House pronounced itself satisfied by McDonald’s explanation (which wasn’t really an “explanation” at all, although it’s a straightforward apology blessedly devoid of spin), the Huffington Post quoted Rep. Jeff Miller (R-FL) of the House Committee on Veterans’ Affairs expressing his disappointment: “I hope Sec. McDonald will redouble his efforts to ensure his statements – and those of all VA officials – are completely accurate.”\nThe “inflated claims of accountability” to which Rep. Miller refers were summarized by the Military Times: “The apology is the second major correction for McDonald in the last week. In a Feb. 15 appearance on ‘Meet the Press,’ he claimed that 60 department workers had been fired in recent months for problems related to the VA’s wait time scandal, but later backtracked to say only eight had lost their jobs.”\nNo one should be surprised that the patience of veterans, and the American people, for doubletalk from anyone at the VA has been strained past the breaking point. This is not the hour for heads of bone.","url":"https://www.breitbart.com/national-security/2015/02/24/va-secretary-apologizes-for-false-claim-of-serving-in-special-forces/"}
