{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-23 03:58:50","date_modify":"2018-10-23 03:58:50","date_publish":"2017-03-10 13:56:30","description":"A priest in Naples, southern Italy, is facing a formal inquiry by local church bosses despite denying claims he went online to find partners to pay for sex.","filename":"data/vaneerConsumption/Vaticanhitbywaveofluridclaimsofmisbehavingpriests.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/03BE5953000003E8-0-image-a-10_1489154174133.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301376_Vatican-hit-wave-lurid-claims-misbehaving-priests_1540267130.html","title":"Vatican hit by wave of lurid claims of misbehaving priests","title_page":"Vatican hit by wave of lurid claims of misbehaving priests | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Vatican has been hit with a wave of lurid accusations of misbehaving priests across Italy with scandals involving orgies, prostitution and porn videos.\nA priest in Naples, southern Italy, is facing a formal inquiry by local church bosses despite denying claims he went online to find partners to pay for sex.\nAnd in the northern city of Padua, another priest is facing defrocking over accusations he had up to 30 lovers.\nThe Vatican (file picture) has been hit with a wave of lurid accusations of misbehaving priests across Italy with scandals involving orgies, prostitution and porn videos\nThe claims are embarrassing to the Vatican, which under Pope Francis has demands high standards of the clergy.\nIn Naples, Reverend Mario D’Orlando was summoned by the city's archbishop amid claims he was holding gay orgies and had used the internet to look for possible partners to pay for sex.\nD’Orlando, from the parish of Santa Maria degli Angeli, denied the claims but has been removed from his position while a probe gets underway, according to Religion News Service.\nThe claims are embarrassing to the Vatican, which under Pope Francis (pictured) has demands high standards of the clergy\nMeanwhile, in Padua, 48-year-old Rev. Andrea Contin, of the parish of San Lazzaro, is facing judicial proceedings and defrocking over claims he had 30 lovers and that he took some of them to a French swingers' resort.\nOne of three women to come forward with complaints said she had been Contin's lover for over three years.\nShe claimed he carried bondage equipment and invited other priests to sex parties, Religion News Service reports.\nFrancis has attempted to clamp down on unethical behaviour ever since being made Pope in 2013 and has often spoken out against the pitfalls of 'temptation'.","url":"https://www.dailymail.co.uk/news/article-4301376/Vatican-hit-wave-lurid-claims-misbehaving-priests.html"}
