{"authors":[],"date_download":"2018-10-22 22:20:01","date_modify":"2018-10-22 22:20:01","date_publish":"2014-05-09 20:09:12","description":"Three whistleblowers tell NBC News how the VA allegedly disguised how long it took patients to receive medical care.","filename":"data/vaneerConsumption/VAWhistleblowersDescribeAllegedCookingoftheBooks.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/433326/140509-sam-foote-1815_e19579ebc770e827fa6cbe025f56a406.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_va-hospital-scandal_va-whistleblowers-describe-alleged-cooking-books-n101781_1540246801.html","title":"VA Whistleblowers Describe Alleged 'Cooking' of the Books","title_page":"VA Whistleblowers Describe Alleged 'Cooking' of the Books","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA whistleblower who worked at two Texas VA facilities claims he was “coached” on how to “cook the books” to conceal long wait times for patients, adding to concerns that the alleged falsification of records first alleged at a Phoenix VA hospital might be widespread.\n“We were changing numbers, we were changing dates,” Brian Turner, an Army medic turned VA scheduling clerk, told NBC News. “We were cooking the books.”\nStaffers at VA facilities in two states have now made public allegations that they were aware of or participated in the manipulation of records, and an internal email from a facility in a third seems to show that staffers were told how to “game the system” to hide wait times.\nTurner said he was inspired to come forward and contact the VA’s Inspector General by the allegations of the initial VA whistleblower, Dr. Samuel Foote, who claimed that the Phoenix facility where he worked until recently had a secret paper wait list in addition to its official electronic wait list so it could hide the length of time some patients had to go without care. He said that as many as 40 patients may have died because of delays.\n“Phoenix just so happened to open the eyes of others such as myself,” said Turner, “to say, ‘Wait a second. Are we doing something similar?’… It’s my belief this is something that could be nationwide.”\nDr. Foote, who left the Phoenix VA in December, told NBC News that he believes the fudging of data began as part of a management effort to reduce a huge backlog – thousands of patients waiting for appointments.\n“This was basically an elaborate scheme to cover up patient wait times, and cover up patients that we didn’t have providers for,” said Foote. “The main problem was, we had a huge demand and we had a relatively limited supply of service. And rather than admit to the problem, they were just covering it up.”\nWhistleblowers described two different methods of manipulating wait times.\nIn Phoenix, Dr. Foote claims that when the national VA tried to add a new data field that would have helped prevent the fudging of a patient’s requested appointment date, a local manager directed clerks to start putting new patient appointments on a paper records instead of into the computer system.\nDr. Katherine Mitchell, who still works for the Phoenix VA, alleges that a fellow employee told her the VA began destroying some of those paper records -- so-called \"secret\" appointment records -- in the days before the VA’s Inspector General began investigating last month. She says she has direct knowledge that VA administrators had attempted to alter another electronic data list of appointment requests.\nDr. Sam Foote says a VA facility in Phoenix kept a secret paper wait list in order to disguise the length of time patients had to wait for care. NBC News\nTurner describes using a different method in Austin and San Antonio. He says scheduling clerks were directed to input the first appointment date that was actually available for a patient as the patient’s “desired” appointment date – even if the actual appointment occurred weeks or months after the original request.\nTurner has worked at four VA facilities in Florida and Texas, but says he was only aware of the practice at the last two places he has worked in Austin and San Antonio. He is currently a scheduling clerk at the North Central Federal Clinic in San Antonio. A spokesperson for the San Antonio facility said the facility had investigated Turner’s claims and found that they were not substantiated.\nAn email from a VA staffer in Cheyenne, Wyo., that was obtained by NBC News seems to describe the same practice. On June 19, 2013, the staffer, a coordinator, appears to be advising scheduling clerks how to make the desired date match the actually available date, thus eliminating wait time and getting off what the nurse calls “the bad boy list.”\n“So here is how I handle it. Patient comes to me and says I want to see Dr. Smith. I pull the patient up in appointment management and see Dr. Smith (sic) appointments. I see that Dr. Smith’s first open visit is August 15th. So I say Dr. Smith’s first available is August 15th, when would you like to be seen? Patient says August 15th. I then back out of that screen, and go back in with desired date of August 15 and book the patient. “\n“Yes, it is gaming the system a bit. But you have to know the rules of the game you are playing.”\nVA Secretary Eric Shinseki said Friday that he had placed an employee from the Cheyenne VA Medical Center on paid leave and asked the inspector general to investigate. “VA takes any allegations about patient care or employee misconduct very seriously,” said the statement. “If true, the behavior outlined in the email is unacceptable.”\n“If this is what it takes for VA leaders to do the right thing, you can’t help but question how they operate when they think no one is paying attention,” said Rep. Jeff Miller, R.-Florida, chair of the House Committee on Veterans’ Affairs.\nIn Texas, Turner says he was troubled by manipulating the numbers, and wondered if he was doing something illegal or immoral. As a veteran himself, he felt a responsibility to the VA’s patients.\n“The public should know that the veterans deserve the care,” he said. “They have served this nation. And it’s our turn to serve them. They deserve factual numbers, no mishandling of any kind of medical records, no manipulating of any records. Let’s just be honest and truthful and move forward.”\nFollow NBC News Investigations on Twitter and Facebook.","url":"https://www.nbcnews.com/storyline/va-hospital-scandal/va-whistleblowers-describe-alleged-cooking-books-n101781"}
