{"authors":[],"date_download":"2018-10-22 22:35:18","date_modify":"2018-10-22 22:35:18","date_publish":"2014-05-11 23:03:24","description":"When showgirl Debora Flores Narvez missed the opening of \"Fantasy\" on the biggest night of her career, friends knew something must be wrong.","filename":"data/vaneerConsumption/VegasDancerJasonGriffithonTrialinShowgirlsDismemberment.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/435256/140511-jason-omar-griffith-jms-1943_d2c75ffd7ae17008fdc8fdfea95637f7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_vegas-dancer-jason-griffith-trial-showgirls-dismemberment-n102661_1540247718.html","title":"Vegas Dancer Jason Griffith on Trial in Showgirl's Dismemberment","title_page":"Vegas Dancer Jason Griffith on Trial in Showgirl's Dismemberment","title_rss":"NULL","source_domain":"nbcnews.com","text":"Griffith has pleaded not guilty and contends that he was defending himself from a violent and volatile woman when she was killed in 2010.\nProsecutors, who will continue putting on their case Monday, have painted a far more cold-blooded portrait of a two-timing brute who who choked his glamour girl, suffocated her with a plastic bag and sawed off her legs.\nOne of their witnesses has already testified that Griffith, 35, blithely told her that Flores' remains were in a blue plastic tub that he wanted to store at her house.\n\"He just said, 'It's Debbie,'\" Kalae Casorso told jurors last week, according to the Associated Press.\n\"I was shocked. Kind of, my head started to spin. I couldn't comprehend it.\n\"I think he said something to the effect of, 'It's not what you think.'\"\nFlores' body was found and Griffith was arrested after his roommate, Louis Colombo, began cooperating with police in exchange for immunity.\nHe has told investigators that he watched Griffith wrap his hands around Flores' neck during an argument, authorities say. He claims he left and returned to find the woman dead.\n\"I was shocked. Kind of, my head started to spin. I couldn't comprehend it.\"\nThe two men allegedly took a 700-pound tub containing fresh concrete and the body to the vacant house, but the tub started leaking.\nGriffith then broke the body out of the cement block, cut the body in half and distributed the remains in two smaller tubs, authorities alleged.\nColombo is expected to testify for the prosecution, which admits that the couple's relationship was stormy.\nGriffith's lawyer said that while the evidence — including crime-scene photos — may be grisly and shocking, that doesn't mean his client is guilty of murder.\n\"He was scared and he was afraid that she was violent,\" attorney Jeff Banks said in his opening statement.\nThe Associated Press contributed to this report.","url":"https://www.nbcnews.com/news/us-news/vegas-dancer-jason-griffith-trial-showgirls-dismemberment-n102661"}
