{"authors":["Frances Martel"],"date_download":"2018-10-30 19:26:25","date_modify":"2018-10-30 19:26:25","date_publish":"2014-05-06 17:39:00","description":"The shortage of basic goods in Venezuela thanks to President Nicolás Maduro's socialist mismanagement of the economy is finally hitting the media. El |","filename":"data/vaneerConsumption/VenezuelasBiggestNewspaperinStateofEmergencyOverLackofPaper.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Peace/2014/Latin-America/Venezuela/venezuela-newsprint-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2014_05_06__1540927585.html","title":"Venezuela's Biggest Newspaper in 'State of Emergency' Over Lack of Paper","title_page":"Venezuela's Biggest Newspaper in 'State of Emergency' Over Lack of Paper | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The shortage of basic goods in Venezuela thanks to President Nicolás Maduro’s socialist mismanagement of the economy is finally hitting the media. El Universal, the nation’s largest newspaper, declared itself in a state of emergency yesterday, as it does not have enough paper to keep printing issues.\nThe paper, which is celebrating its 105th anniversary, announced in an editorial today that a shipment of paper for them is being held in bond at a port, unable to reach the paper thanks to government withholding. The shipment has been at the port since January, they report, and forces the paper to “reduce our editions to two bodies of eight pages each.” The move removes almost 30% of the paper’s pages from a regular edition.\nAt this rate, the paper’s editorial staff predict they will be able to continue printing for the next two weeks. After that, the paper will be forced to cease publishing a daily edition until the government allows them to receive their shipment.\nColombia’s El País notes that El Universal is not the only newspaper in Venezuela suffering thanks to the government’s insistence on denying paper shipments entry into the country. While it is the largest paper, El País estimates around twenty newspapers around the country are currently struggling to continue printing or have already ceased doing so thanks to government intervention.\nColombian media have been especially receptive to the needs of their Venezuelan colleagues. The Association of Editors, Dailies, and Informative Media of Colombia sent a delivery of 52 tons of paper to Venezuela last month, particularly to newspapers El Nacional and El Nuevo País, both of whom announced an emergency paper shortage earlier this year. The Colombian aid is pursuant to an agreement by the Interamerican Press Association established in April to aid Venezuelan newspapers as they face challenges from the government, who, they note, expect that “newspaper close through the subtle method of denying them authority to import paper and other necessities not manufactured in the country.”\nThe current economic crisis caused by a new set of socialist initiatives by President Maduro have significantly diminished the quality of many of the nation’s institutions. Caracas’ largest university is considered to be nearly abandoned as paramilitary Chavista groups attacked anti-socialist students so often that many no longer choose to attend, and professors ended classes that were empty and unsafe.\nMeanwhile, residents of the OPEC member nation struggle to use their ration cards to buy basic goods at supermarkets that are barely stocked. The Venezuelan government announced shortages of such items as vegetable oil, milk, flour, and butter.","url":"https://www.breitbart.com/national-security/2014/05/06/venezuela-s-biggest-newspaper-in-state-of-emergency-over-lack-of-paper/"}
