{"authors":["Associated Press"],"date_download":"2018-10-23 05:56:23","date_modify":"2018-10-23 05:56:23","date_publish":"2016-01-28 21:32:27","description":"CARACAS, Venezuela (AP) — Venezuela authorities have broken their silence on the outbreak of Zika in the South American country and are pledging to mount a p...","filename":"data/vaneerConsumption/VenezuelaannouncesantiZikacampaignafterlongsilence.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:c46ea2716763426fb10b08d561d11e2d-4PuZeKVXE7cd9005b2c87617cd4f-485_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421736_Venezuela-announces-anti-Zika-campaign-long-silence_1540274183.html","title":"Venezuela announces anti-Zika campaign after long silence","title_page":"Venezuela announces anti-Zika campaign after long silence | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Venezuela announces anti-Zika campaign after long silence\nCARACAS, Venezuela (AP) — Venezuela authorities have broken their silence on the outbreak of Zika in the South American country and are pledging to mount a public health campaign to slow the virus' spread.\nHealth Minister Luisana Melo said Thursday on state television that 4,700 suspected cases of Zika have been recorded in Venezuela.\nShe says the country will begin fumigation operations and step up training of medical workers to protect against the mosquito-borne illness, which is being studied for possible links to birth defects.\nThis 2006 photo provided by the Centers for Disease Control and Prevention shows a female Aedes aegypti mosquito in the process of acquiring a blood meal from a human host. Scientists believe the species originated in Africa, but came to the Americas on slave ships. It's continued to spread through shipping and airplanes. Now it's found through much of the world. (James Gathany/Centers for Disease Control and Prevention via AP)\nVenezuela's socialist administration had been criticized in recent days for failing to publish statistics about Zika or take steps to control the outbreak.","url":"https://www.dailymail.co.uk/wires/ap/article-3421736/Venezuela-announces-anti-Zika-campaign-long-silence.html"}
