{"authors":["Frances Martel"],"date_download":"2018-10-30 19:26:21","date_modify":"2018-10-30 19:26:21","date_publish":"2015-11-26 10:00:24","description":"A Venezuelan diplomat in hiding is accusing the government of selling visas and passport to Hezbollah members out of Baghdad.","filename":"data/vaneerConsumption/VenezuelaSoldImmigrationDocumentstoHezbollahTerrorists.json","image_url":"https://media.breitbart.com/media/2015/05/article-urn-publicid-ap.org-3b3c6dfd2d5f433bbc6f645272a12fbf-6VTrzXTzo-HSK1-588_634x422.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_26__1540927581.html","title":"Venezuela Sold Immigration Documents to Hezbollah Terrorists","title_page":"Venezuela Sold Immigration Documents to Hezbollah Terrorists","title_rss":"NULL","source_domain":"breitbart.com","text":"A Venezuelan diplomat in hiding is accusing the socialist government of President Nicolás Maduro of selling visas, passports, and even falsified birth certificates out of its embassy in Baghdad to an estimated thousands of Middle Eastern citizens, including at least one confirmed Hezbollah terrorist.\nA man identifying himself as Misael López Soto, advisor working out of the Venezuelan embassy in Baghdad, says in a video uploaded to YouTube Wednesday evening that he has had to flee his official position following multiple death threats, after attempting to alert the government in Caracas that its satellite in Baghdad had become a marketplace for falsified documents.\n“I have made public how, under the complacent eye of diplomats in the mission [in Baghdad], local employees delivered visas, passports, birth certificates, and other types of Venezuelan documentation to citizens of Syria, Iraq, Palestine, and, in some cases, Pakistan,” he says in the video, noting that most types of documentation cost between $5,000 and $15,000. “In many cases, they were tied to terrorist groups, most of the Shiite variety.” López asserts that he can prove that, in at least one case, a known member of Hezbollah was granted falsified Venezuelan documents.\nLópez notes that he and an Iraqi official discovered enough instances of this practice to be able to identify it as routine, ending their probe in March 2014. López has subsequently been forced to flee Iraq. “The official who helped me in my investigation was murdered the same day he helped me board a flight out of Baghdad,” he says. To his knowledge, the Venezuelan Ambassador to Iraq, Jonathan Delfi Velasco Ramírez, did not report to Caracas over the situation, and those selling documents out of the embassy continue to be employed there.\nLópez also tells the story of a Venezuelan female national who appealed for help from the embassy after her partner, an Iraqi national, beat her physically and attempted to take her to a Sharia court to deprive her of custody over her child. The partner, López says, “had multiple Venezuelan aliases and known ties to drug trafficking.” López says she was rescued and placed on a plane back to Venezuela thanks to his efforts, but the embassy refused to help her. The Venezuelan site Periodista Internacional has identified her as 19-year-old Genesis Torres. The site adds also that, having reached out to López, he estimated that up to 50,000 Middle Eastern nationals have managed to receive counterfeit Venezuelan documentation.\nMost alarmingly for Venezuelan citizens given the upcoming December 6 election, López claims those handed counterfeit Venezuelan documents are registered to vote in Venezuela. “Venezuelan embassies in the Middle East are used to document people that have nothing to do with Venezuela, in mny cases are tied to terrorist organizations,” he says. “Thousands of Arab citizens… have been documented as Venezuelans and are voters within the Venezuelan political system… manipulated by the current government at their convenience.”\n“Venezuela for Venezuelans,” he concludes.\nLópez has since spoken to Colombian news outlet Caracol, explaining how he uncovered the fraud. “I can’t have a birth certificate from Maracaibo, Zulia State [Venezuela] and one from Basora, Iraq, and I can’t have two mothers,” he noted, adding this had become a common case.\nRumors have circulated regarding the Venezuelan socialist government’s ties to Middle Eastern terrorist groups for years, as late dictator Hugo Chávez cemented the nation’s close ties to the Islamic Republic of Iran. His successor, President Nicolás Maduro, has maintained that relationship and expanded it to include Iranian allies like Syrian dictator Bashar al-Assad.\nA report surfaced in April that it was through Assad that Maduro first met Hezbollah chief Hassan Hasrallah in Damascus. The two allegedly met in 2007 to discuss drug trafficking and, among other things, “the distribution of arms and issuing of passports… to terrorists.” The allegations surfaced in Boomerang Chávez, a book published this year by Spanish journalist Emili Blasco. At least three high-ranking members of Hezbollah are alleged to possess Venezuelan paperwork.\nIn 2014 – the year López’s allegations occurred – reports had already surfaced that this activity was going on under Chávez’s watch. A report implicated both Venezuela and Cuba in falsifying documents for Shiite Muslim terrorists; an estimated 173 passports, visas, and permits were given to Middle Eastern nationals by the Venezuelan government between April 2008 and November 2012.","url":"https://www.breitbart.com/national-security/2015/11/26/diplomat-venezuela-sold-immigration-documents-to-hezbollah-terrorists/"}
