{"authors":["Associated Press"],"date_download":"2018-10-22 22:36:23","date_modify":"2018-10-22 22:36:23","date_publish":"2017-04-26 05:05:23","description":"CARACAS, Venezuela (AP) - Venezuela's government announced Wednesday it will go ahead with its threatened withdrawal from the Organization of American...","filename":"data/vaneerConsumption/VenezuelagoesthroughwiththreattoleavetheOAS.json","image_url":"https://i.dailymail.co.uk/1/2017/04/27/04/wire-469437-1493263865-548_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446284_Venezuela-threatens-exit-OAS-pressure-Maduro-mounts_1540247783.html","title":"Venezuela goes through with threat to leave the OAS","title_page":"Venezuela goes through with threat to leave the OAS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"CARACAS, Venezuela (AP) - Venezuela's government announced Wednesday it will go ahead with its threatened withdrawal from the Organization of American States, the regional body whose leader has been one of the fiercest critics of embattled socialist President Nicolas Maduro.\nThe move came on the same day as fierce confrontations in the capital between security forces and anti-government protesters who staged yet another march amid political unrest that has been blamed for 29 deaths in recent weeks. Clashes were also reported in other Venezuelan cities.\nForeign Minister Delcy Rodriguez called for the OAS withdrawal after a brief but contentious meeting at the group's Washington headquarters in which its permanent council voted in favor of holding a special session to evaluate Venezuela's crisis, adding to mounting international pressure for Maduro to schedule delayed elections and free detained political activists.\nA man carries a Venezuelan flag amid tear gas launched by security forces blocking opponents to President Nicolas Maduro from marching to the Ombudsman's office in downtown Caracas, Venezuela, Wednesday, April 26, 2017. Hundreds of thousands of Venezuelans have flooded the streets over the last month to demand an end to Maduro's presidency. (AP Photo/Ariana Cubillos)\nRodriguez said the OAS's action was taken to \"intervene and take custody of our country, something that fortunately will never happen.\"\nLater, Maduro sent out a tweet calling for support against outside meddling in Venezuela's affairs. \"Enough of interventionist abuses and violation of legality,\" he said. \"Venezuela is the cradle of the Liberators and we will respect it.\"\nTension has been steadily rising between Venezuela and a group of OAS members that includes the United States since OAS Secretary General Luis Almagro issued a 75-page report in March accusing Maduro's government of systematically violating human rights and standards of democracy. Almagro unsuccessfully urged OAS members to suspend Venezuela unless general elections were held soon.\nAs Venezuela's unrest escalated in recent weeks, Almagro has been outspoken in denouncing the government's response to opposition protests demanding Maduro hold new elections.\n\"This is an authoritarianism that hides behind the armed forces that, far from acting as the forces of order, act as the forces of repression and terror,\" he said after the first reported death.\nLate Tuesday, Rodriguez had warned that Venezuela would quit the OAS if the body proceeded with scheduling a special session on the crisis here, calling it an infringement on Venezuela's sovereignty. She said the pressure being brought by the U.S. on some members like Haiti to punish Venezuela had been considerable.\nWithdrawing from the OAS is a two-year process, but Rodriguez said Venezuela would immediately stop participating. Venezuela is estimated to owe the OAS about $10.5 million in unpaid annual dues. No country has ever withdrawn from the group since its founding in 1948.\nThe decision drew quick rebuke from opposition leaders. Former congresswoman Maria Corina Macahdo said Maduro's exit from the OAS \"formalized Venezuela's outlaw status.\"\nEarlier in the day, thousands of protesters marched on Caracas' main highway seeking to deliver a message to the national ombudsman, whose job is to stand up for citizens' rights but who the opposition has tagged the \"defender of the dictator.\" They were met with plumes of tear gas that sent demonstrators running.\n\"The repression is very strong,\" Luis Florido, an opposition lawmaker, said as clouds of the white gas swirled around him.\nOpposition leaders said one protester, Juan Pablo Pernalete Llover, 20, died after being struck by a canister of tear gas. He was a student in political accounting at Metropolitan University, which issued a statement saying the institution was mourning the \"early and unjust departure of this talented young Venezuelan, who gave his life in exchange for the highest values of democracy.\"\nRamon Muchacho, a Caracas-area mayor, said at least 22 others were injured in Wednesday's protests, including 14 with traumatic wounds. Elsewhere, children were evacuated from a school after being exposed to tear gas. In the evening, government officials reported two national guardsmen were wounded by gunshots in the same part of Caracas where Pernalete Llover was killed earlier.\nIn all, 29 people have been killed, more than 400 injured and nearly 1,300 detained in the monthlong unrest roiling the nation.\nHundreds of thousands have taken to the streets demanding Maduro hold elections and denouncing his government as being responsible for triple-digit inflation, food shortages and a rise crime. The protests have frequently ended in violent confrontations with security forces, which have used tear gas and rubber bullets to disperse crowds, and there also have been clashes with pro-government groups.\nOpposition leaders have blamed armed pro-government militias known as \"colectivos\" for a number of the deaths, while government officials have accused the opposition of working with criminal gangs to foment unrest.\nThe swell of protests is the most violent seen in Venezuela since two months of anti-government demonstrations in 2014 that resulted in dozens of deaths. Maduro has called for renewed dialogue, but opposition leaders have discarded that as an option after earlier talks collapsed in December.\nThe tide of unrest shows no signs of diminishing soon, with opposition lawmakers vowing to march Thursday to the site where Pernalete Llover was killed. Leaders from both sides of the political divide are calling for mass gatherings on May Day.\n___\nAssociated Press writer Fabiola Sanchez reported this story in Caracas and AP writer Christine Armario reported from Bogota, Colombia. AP writer Joshua Goodman in Caracas contributed to this report.\nOpponents of President Nicolas Maduro take cover behind homemade shields during clashes with security forces blocking them from marching to the Ombudsman's office in downtown Caracas, Venezuela, Wednesday, April 26, 2017. Hundreds of thousands of Venezuelans have flooded the streets over the last month to demand an end to Maduro's presidency. (AP Photo/Ariana Cubillos)\nThousands of opponents of President Nicolas Maduro march in Caracas, Venezuela, Wednesday, April 26, 2017. Security forces blocked anti-government protesters that attempted to march to the Ombudsman's office in downtown in another day of protests that have already claimed dozens of lives since the start of April. (AP Photo/Fernando Llano)\nA protester holds an acrylic shield during clashes with security forces blocking opponents of President Nicolas Maduro in Caracas, Venezuela, Wednesday, April 26, 2017. Venezuela is threatening to pull out of the Organization of American States as the government's response to political unrest blamed for 27 deaths in recent weeks draws rebuke from the hemisphere's major powers. (AP Photo/Ariana Cubillos)\nBolivarian National Guards charge opponents of President Nicolas Maduro as they block protesters from reaching the national ombudsman office in Caracas, Venezuela, Wednesday, April 26, 2017. Hundreds of thousands of Venezuelans have flooded the streets over the last month to demand an end to Maduro's presidency. (AP Photo/Ariana Cubillos)\nAn armored police vehicle catches fires from molotov bombs thrown by anti-government protesters in Caracas, Venezuela, Wednesday, April 26, 2017. Security forces Opponents of President Nicolas Maduro that attempted to march to the Ombudsman's office in downtown in another day of protests that have already claimed dozens lives since the start of April. (AP Photo/Fernando Llano)\nBolivarian National Police officers fire tear gas against opponents of President Nicolas Maduro attempting to march to the Ombudsman's office in downtown Caracas, Venezuela, Wednesday, April 26, 2017. Hundreds of thousands of Venezuelans have flooded the streets over the last month to demand an end to Maduro's presidency. (AP Photo/Ariana Cubillos)\nA woman injured during clashes with security forces is aided by fellow anti-government protesters in Caracas, Venezuela, Wednesday, April 26, 2017. Opponents of President Nicolas Maduro attempted to march into downtown Caracas in another day of protests that have already claimed 26 lives since the start of April. (AP Photo/Fernando Llano)\nBolivarian National Police block opponents of President Nicolas Maduro attempting to march to downtown Caracas, Venezuela, Wednesday, April 26, 2017. Nationwide anti-government protests have already claimed 26 lives since the start of April. (AP Photo/Fernando Llano)\nAnti-government protesters loose their slingshots during clashes with security forces blocking them from marching to downtown Caracas, Venezuela, Wednesday, April 26, 2017. Nationwide anti-government protests have already claimed 26 lives since the start of April. (AP Photo/Fernando Llano)\nA masked anti-government protester jumps over a chain link at a roadblock set up by opponents to President Nicolas Maduro in Caracas, Venezuela, Wednesday, April 26, 2017. Nationwide protests asking for the resignation of Maduro and elections have claimed 26 lives since the start of April. (AP Photo/Fernando Llano)","url":"https://www.dailymail.co.uk/wires/ap/article-4446284/Venezuela-threatens-exit-OAS-pressure-Maduro-mounts.html"}
