{"authors":["Frances Martel"],"date_download":"2018-10-30 19:25:41","date_modify":"2018-10-30 19:25:41","date_publish":"2015-10-06 02:48:31","description":"Venezuela's President Nicolás Maduro warned viewers on Sunday that he expects December's elections to be the \"most difficult yet\" for him.","filename":"data/vaneerConsumption/VenezuelasMaduroAccusesUSofConspiracyAgain.json","image_url":"https://media.breitbart.com/media/2015/04/nicolas-maduro-venezuela-yeah-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_10_05__1540927541.html","title":"Venezuela's Maduro Accuses U.S. of Conspiracy, Again","title_page":"Venezuela's Maduro Accuses U.S. of Conspiracy, Again","title_rss":"NULL","source_domain":"breitbart.com","text":"Venezuelan President Nicolás Maduro warned viewers on Sunday that he expects December’s legislative elections to be the “most difficult yet” for the socialist Chavistas. Maduro, who barely scraped a victory against opposition leader Henrique Capriles Radonski in 2013, also accused the United States of “conspiracy” against him.\n“I believe that the December 6 elections could well be the most difficult ones that the Revolution has faced,” Maduro told an audience in a televised conversation with himself from the Principal Theater of Caracas. He urged Chavistas to campaign “door to door” and find the “discontented and confused” and implore that they vote for the United Socialist Party of Venezuela (PSUV).\nIn a sign of true concern, Maduro urged members of his party to celebrate the ideological diversity of the country, as an untold number of prisoners of conscience continue to suffer in the nation’s military detention centers. “We are united, but I make a call to the national leadership of all the parties and political movements to display the lovely unitarian diversity we have achieved,” he said, “each one should let his colors shine, his symbols, his strengths, so that they are known.”\nMaduro even claimed he could see a future in which Venezuela could repair its relations with the United States, according to national newspaper El Universal, which almost went out of business in 2014 because the Maduro administration refused to allow it to buy paper abroad. What Venezuela wants, he suggested, “is to achieve what Cuba achieved: relations of respect, of equality between States, from you to you and, hopefully, of achievement with the elites governing Washington and the American government.”\nThe Cuban government reached an agreement with the Obama administration in December 2014 which will allow for American money to flow into the Castro dictatorship and remove the label “State Sponsor of Terror” from the rogue nation. The U.S. government received no concrete concessions from the Cuban government for this deal, which continues to punish prisoners of conscience and provide safe haven to terrorists.\nEl Universal failed to note that, in a different part of the same telecast, Maduro accused the United States of various unnamed “conspiracies” against him. “Where there is a conspiracy, there is a gringo,” Maduro told his audience. “If there is a sabotage of our economy, behind it you will find a gringo adviser.”\nThe Venezuelan government is currently employing an American PR advisory group, FitzGibbon Media, to clean up its international image.\nArgentine news outlet Infobae notes that polls indicate the PSUV is in severe danger of losing their electoral edge to the Table of Democratic Unity (MUD) party, a center-right party led by Maduro’s former rival, Henrique Capriles Radonski. MUD is currently in the lead in the polls by 20 percentage points; Maduro’s personal approval rating stands at little more than 20 percent.\nMany in Venezuela still believe that Maduro lost the 2013 presidential election, which he officially won by a slim margin while threatening to have Capriles arrested for “inciting violence.” He had a number of high-profile political leaders arrested following his alleged victory—from Popular Will Party leader Leopoldo López, now sentenced to 13 years in prison for organizing a protest; to Caracas Mayor Antonio Ledezma, who security cameras caught being dragged out of his office by Secret Police officers “like a dog“; to San Cristóbal Mayor Daniel Ceballos, who was whisked out of his home in the middle of the night.","url":"https://www.breitbart.com/national-security/2015/10/05/venezuelas-maduro-accuses-u-s-of-conspiracy-again-as-hardest-election-ever-looms/"}
