{"authors":[],"date_download":"2018-10-22 22:55:38","date_modify":"2018-10-22 22:55:38","date_publish":"2014-05-07 20:33:42","description":"Some Florida suburbs have been transformed by an influx of young immigrant families from Venezuela's Jewish community.","filename":"data/vaneerConsumption/VenezuelanJewishFamiliesTransformMiamiSuburbs.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/429426/140508-david-bassan-1203_b1b0071653d9812a6eb331477cbc678e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_venezuelan-jewish-families-transform-miami-suburbs-n99711_1540248938.html","title":"Venezuelan Jewish Families Transform Miami Suburbs","title_page":"Venezuelan Jewish Families Transform Miami Suburbs ","title_rss":"NULL","source_domain":"nbcnews.com","text":"AVENTURA, Fla. -- Two and a half years ago David Bassan, a Venezuelan Sephardic Jew, was vacationing in Israel when a relative was kidnapped in Caracas while driving the car Bassan had loaned him.\nThe relative was released and Bassan quickly realized it could have been him. Shortly after, he moved with his wife and four children to the U.S., settling in the Miami suburb of Aventura.\n“That was the drop that spilled the glass,” said Bassan, sipping an espresso at a local café.\nHis decision to relocate was a culmination of events, which he blames primarily on the violence that has ravaged Venezuela. According to an April 2014 United Nations report on homicide around the globe, Venezuela is the only South American country with a \"consistently increasing homicide rate since 1995.\"\nThere were approximately 2,000 Venezuelan Jews living in Miami-Dade County in 2004, according to a study conducted by Ira Sheskin, of the University of Miami. “There is little doubt the number has increased significantly since then,” said Sheskin, who will be releasing an updated report in October.\nVenezuela’s Jewish community has decreased by 60 percent during the past 12 years, according to the Federation of Jewish Institutions of Venezuela (CAIV). In the meantime, Miami’s Venezuelan Jewish population has exploded.\nMost Venezuelan Jews have settled around the area of Aventura, which already had a robust Jewish population with a network of synagogues and Jewish schools. According to Rabbi Ariel Yeshurun of Sky Lake Synagogue, their temple “was really an old age home” until flocks of young Venezuelans began arriving.\n\"You come here and you feel you’re in a Latin Schul. You hear Spanish being spoken,” said Yeshurun, who grew up in Israel. He said he will soon give his first sermon in Spanish; he speaks \"un poco\" and has been learning.\nRabbi Ariel Yeshurun of Aventura, Florida's Sky Lake Synagogue said their temple “was really an old age home” until flocks of young Venezuelans began arriving.\nLast year the synagogue had to set up a tent to accomodate an additional 200 people during the high holidays. Now known as the “Venezuelan synagogue,” Sky Lake recently purchased two pieces of adjacent land to build another 30,000 square feet, including a social hall to accommodate up to one thousand people for weddings and bar-mitzvahs.\nAs Aventura's home prices have soared, many Venezuelan Jews are now settling in neighboring areas and becoming the majority in other synagogues as well. At the Michael-Ann Russell Jewish Community Center, Spanish is now commonly heard and Venezuelan families participate in sports and social events like they did at the Hebraica, a community center in Caracas with schools and health services.","url":"https://www.nbcnews.com/news/latino/venezuelan-jewish-families-transform-miami-suburbs-n99711"}
