{"authors":["Frances Martel"],"date_download":"2018-10-30 20:42:50","date_modify":"2018-10-30 20:42:50","date_publish":"2015-01-12 16:01:42","description":"The Venezuelan government has begun to target individuals who take photos of empty supermarket shelves or long lines of citizens waiting for their weekly rations of food.","filename":"data/vaneerConsumption/VenezuelansPostingPhotosofEmptySupermarketShelvesandLongLinesFaceHarassmentArrest.json","image_url":"https://media.breitbart.com/media/2015/01/Venezuela-food-ration-line.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_12__1540932170.html","title":"Venezuelans Posting Photos of Empty Supermarket Shelves and Long Lines Face Harassment, Arrest","title_page":"Venezuelans Posting Photos of Empty Supermarket Shelves and Long Lines Face Harassment, Arrest | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Venezuelan government has begun to target individuals who take photos of empty supermarket shelves or long lines of citizens waiting for their weekly rations of food, according to a number of Venezuelans on social media, who state they have been harassed by the national police force.\nArgentine news outlet Infobae reports that at least a number of cases in which those who have been publicly taking photos of the lines outside of supermarkets or the empty shelves within have been threatened with arrest and harassed by the Bolivarian National Guard for doing so. President Nicolás Maduro deployed the National Guard to supermarkets this week, citing the need to prevent unrest. Reports have circulated on Twitter that “there are allegedly orders to detain anyone who takes photos of long lines, police, or National Guard in markets with problems”:\nExtraoficial: existen supuestas instrucciones de detener a toda persona que tome fotos de colas, policías y GNB en mercados con problemas. — JOSE VICENTE HARO (@JOSEVICENTEHARO) January 10, 2015\nIn one specific instance captured by witnesses on Twitter, a 15-year-old boy was taken away by authorities after attempting to take a picture of a long line in front of his local supermarket:\nEste niño d 15 años estaba con un amigo sacando fotos d la protesta d Sta Fe y se los llevaron!! #PenaAjena pic.twitter.com/lHiTwRoy6F — Gabriel Reyes .·. (@greyesg) January 11, 2015\nThe BBC reports that the first instance of such harassment appeared to occur on December 30, when photographer Alejandro Cegarra attempted to take a picture of a long line in front of a supermarket, and its manager called for his arrest. Cegarra live-tweeted the incident, prompting responses from dozens of others who also claimed to have been harassed for attempting to take such photographs.\nWhile reaching new depths of poverty within the past 12 months, the economic shortages ravaging Venezuela’s economy have been developing for years under its socialist government, since the rise of former dictator Hugo Chávez. Last year, Maduro officially implemented a ration card system for milk, sugar, flour, and other goods that have been increasingly difficult to find in the nation. In late May, Maduro’s government was forced to ration water.\nTo highlight how difficult it is for the average Venezuelan to purchase necessary goods, such as milk, flour, vegetable oil, and meat, many have taken to social media with photographs of their local markets’ empty store shelves or the interminable lines in which they must stand to receive their ration of food:\n#EnZulia #8E Así están las cavas en el Mercado de Santa Rosalia en Maracaibo. pic.twitter.com/biQ1nwdXNG — TV VENEZUELA (@TV_VENEZUELA) January 8, 2015\nojo: TOMADO DE APORREA: Así se veían los estantes del HIPER mercado Bicentenario Plaza Venezuela pic.twitter.com/rLGoi5ij5Y — Raul Fernández (@Rfabada) January 5, 2015\nColas a las puertas de MERCAL (Mercado) en #Venezuela pic.twitter.com/Mz7AE2PCrs — EL ENMASCARADO (@maskednews) January 3, 2015\nGiven reports of a crackdown on dispersal of such images, it remains unclear whether the rest of the world will continue to have such open access to proof of how weak the Venezuelan economy has become, particularly in the wake of oil prices plummeting internationally.","url":"https://www.breitbart.com/national-security/2015/01/12/venezuelans-posting-photos-of-empty-supermarket-shelves-face-harassment-arrest/"}
