{"authors":["Frances Martel"],"date_download":"2018-10-30 17:55:34","date_modify":"2018-10-30 17:55:34","date_publish":"2018-07-11 18:11:49","description":"Venezuela's socialist dictator Nicolás Maduro may have found an unlikely savior for his economy: Turkish President Recep Tayyip Erdogan.","filename":"data/vaneerConsumption/VenezuelasMaduroShunnedonHisContinentSeeksInvestmentinTurkey.json","image_url":"https://media.breitbart.com/media/2018/05/wi/afp/22/563da3_turkish-president-recep-tayyip-erdogan-his-venezuelan-counterpart-nicolas-e1531332453902.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_07_11__1540922134.html","title":"Venezuela's Maduro, Shunned on His Continent, Seeks Investment in Turkey","title_page":"Venezuela's Maduro, Shunned on His Continent, Seeks Investment in Turkey | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Venezuela’s socialist dictator Nicolás Maduro may have found an unlikely savior for his economy: Turkish President Recep Tayyip Erdoğan, who invited Maduro to his inauguration Monday and appears to have facilitated meetings with Turkish investors.\nVenezuela is arguably the world’s most destitute economy, destroyed by decades of socialist economic policies and saddled with the world’s highest inflation rate (40,000 percent). While Maduro used to be able to count on investments from China and Russia to maintain a high standard of living for his socialist cronies, both nations have begun limiting investments in the country due to high risk, leaving Maduro to seek out other patrons.\nHa sido extraordinaria la jornada de toma de posesión del presidente Recep Tayyip Erdoğan. Con nuestros hermanos empresarios turcos, hemos trabajado en fortalecer la cooperación en los campos de la minería, agricultura y turismo. Venezuela quiere paz, desarrollo y beneficio mutuo pic.twitter.com/vRvSsyWtiT — Nicolás Maduro (@NicolasMaduro) July 10, 2018\nMaduro traveled to Ankara Monday for Erdoğan’s inauguration, his first under a new presidential system that significantly expands his executive powers without adding any notable checks or limitations. Maduro applauded the inauguration ceremony on Twitter, calling it “extraordinary” and branding Erdoğan “the leader of the new multi-polar world.”\n“President Recep Tayyip Erdoğan’s inauguration has been extraordinary,” Maduro wrote on Twitter. “With our Turkish business brothers, we have worked to strengthen cooperation in mining, agriculture, and tourism. Venezuela wants peace, development, and mutual benefit.”\nDuring the inauguration, Maduro also met with Palestinian, Qatari, and Russian leaders present to celebrate Erdoğan.\nFollowing the inauguration, Maduro headed to Istanbul, where he met with business leaders in an attempt to convince them to invest in Venezuela’s ruinous economy.\n“Venezuela has certified reserves. We may progress in production economy in oil and various fields. We are open to development,” Maduro said during remarks at the Turkey-Venezuela Business Forum, according to the Turkish state Anadolu News Agency. The Venezuelan president claimed to bring with him to show potential investors an unprecedented detailed plan on what Caracas would use their money for.\n“Turkish brothers, Venezuela is advancing on what could be the top gold reserve in the world. We are making investments to become a gold-exporting power,” Maduro reportedly said.\nIn addition to investing in Venezuela’s oil industry, Maduro attempted to sell the “petro,” a cryptocurrency he invented in an attempt to evade global sanctions. The Trump administration almost immediately banned Americans from dealing in the fraudulent currency and Venezuela’s legitimate National Assembly declared the “petro” illegal.\n“Petro cryptocurrency can be used in foreign trade and investments. This will benefit to Turkey and improve our economic ties,” Maduro told Turkish businessmen.\nAfter meeting business leaders and Erdoğan, Maduro and wife Cilia Flores also visited the set of the popular Turkish television series Dirilis Ertugrul. Anadolu Agency shows them touring the set and putting on costumes.\nVenezuelans back at home did not appear especially amused by Maduro’s tour. The typically anti-socialist site La Patilla highlighted the regal lodging Maduro received at the Elite World Prestige Hotel in Istanbul, “a luxury hotel certainly no Venezuelan could afford.” The news outlet quipped, “his socialist talk has little in common with the marvels that this hotel network offers … including two pools and a sauna/spa, a Turkish bath and vapor cabins.”\nOpposition leader Julio Borges condemned Maduro for disappearing halfway across the world in the middle of a crisis.\n“Maduro is currently in Turkey doing who-knows-what with the riches of Venezuela,” Borges protested. “He is taking gold from our [industry] and taking it to that country without any control. Maduro’s trip is tied to corruption and will not bring any benefits to Venezuelans, on the contrary, he is mortgaging the future of the country.”\nErdoğan and Maduro have become closer in the past half decade, defending each other from allegations of authoritarianism on the world stage. Erdoğan went out of his way in 2016 to defend Maduro’s violent crackdown on peaceful anti-socialist dissidents, which resulted in dozens of deaths of young people at the hands of his police. The Turkish president has also made a note of inviting Maduro to any international gatherings he hosts – no matter how irrelevant to the interests of Venezuela, as in the case of December’s Organization of Islamic Cooperation (OIC) meeting.\nVenezuela appears to be attempting to replace funds from nations like China with investment from Turkey. While once one of Maduro’s largest benefactors, Chinese Communist Party leader Xi Jinping has cut off Venezuela’s credit line, as Caracas has been unable to fulfill its payments to Beijing, and warned investors to stay out of the Venezuelan economy through its state-run media.\nMost of the nations in the Western Hemisphere and members of the Organization of American States (OAS) have refused to do business with Maduro, citing his government’s rampant human rights abuses and his illegitimate status as “president.”\nFollow Frances Martel on Facebook and Twitter.","url":"https://www.breitbart.com/national-security/2018/07/11/venezuelas-maduro-shunned-on-his-continent-seeks-investment-in-turkey/"}
