{"authors":["Frances Martel"],"date_download":"2018-10-30 19:23:19","date_modify":"2018-10-30 19:23:19","date_publish":"2015-02-04 20:07:08","description":"Venezuelan President Maduro is calling for his government to draft a blacklist of Venezuelans exiled in the U.S. calling for Congress to impose further sanctions on his socialist regime.","filename":"data/vaneerConsumption/VenezuelanPresidentMaduroVenezuelansinUSDemandingSanctionsGuiltyofHighTreason.json","image_url":"https://media.breitbart.com/media/2015/01/Nicolas-Maduro-Chavez-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_04__1540927399.html","title":"Venezuelan President Maduro: Venezuelans in US Demanding Sanctions Guilty of 'High Treason'","title_page":"Venezuelan President Maduro: Venezuelans in US Demanding Sanctions Guilty of 'High Treason' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Venezuelan President Nicolás Maduro is calling for his government to draft a blacklist of Venezuelans exiled in the United States calling for Congress to impose further sanctions on his socialist regime for both economic and political crimes, as well as ties to drug trafficking.\n“There cannot be impunity. … They must be found with first and last name, their faces shown on national television, because this is high treason against the nation to call for another country’s intervention,” said President Nicolás Maduro on television this week. He connects, specifically, a Venezuelan exile organization in Miami with the Table of Democratic Unity (MUD), an opposition party within Venezuela, and demands that the government use “political, diplomatic, judiciary” means to wage “a higher-level battle to defend our right to live in peace.”\nThe organization Maduro refers to in the video is the group Veppex, or Venezuelans Persecuted in Exile, based in Miami. The group sent an open letter this week to Senators Marco Rubio and Robert Menendez, calling for Congress not just to impose more sanctions on the Maduro socialist regime, but to officially declare Venezuela a “narco-state,” following accusations that high-level officials in the Maduro administration–including his second-in-command, Diosdado Cabello–are actively involved in the traffic of cocaine to the United States.\nThe letter demands:\nIt is urgent and necessary that those who have hijacked the powers of the state and turned it into a criminal organization be classified correctly, [those who] from those positions stimulate and protect illicit activities and create laws that allow them to act against the people to defend their business, which is drug trafficking.\nMaduro designated those authoring the letter as members of a “right-wing oligarchy” conspiring to sabotage his presidency.\nVeppex has responded to Maduro’s threat to use the force of the state of Venezuela against them for their high treason.” As Miami’s El Nuevo Herald reports, the leaders of the group asserted that their photos “are for public domain use,” should Maduro wish to broadcast them on Venezuelan television, and that “Maduro’s narco-regime” assumes responsibility “for any harm that any member of the organization may suffer.”\nMaduro’s regime has increased its vitriol towards the United States in recent days, following the defection of Leamsy Salazar, former head of security to Hugo Chávez and National Assembly President Diosdado Cabello. Salazar is reportedly willing to testify in New York court that Cabello, Venezuela’s second-in-command, is the leader of the Cartel de los Soles, a drug cartel specializing in trafficking cocaine, and thus named due to heavy military involvement in the trafficking.\nSalazar has also accused Maduro and Cabello, among others, of keeping Chávez’s death secret for months and using the time before the official announcement in March 2013 to pass decrees favorable to them under Chávez’s name.\nMaduro, in turn, has accused Vice President Joe Biden of spearheading a plot to stage a coup against his government.","url":"https://www.breitbart.com/national-security/2015/02/04/venezuelan-president-maduro-venezuelans-in-us-demanding-sanctions-guilty-of-high-treason/"}
