{"authors":["Frances Martel"],"date_download":"2018-10-30 20:42:08","date_modify":"2018-10-30 20:42:08","date_publish":"2015-04-01 15:03:46","description":"Venezuela is forcing citizens to sign a petition calling for Obama to remove sanctions on the socialist state for its human rights abuses.","filename":"data/vaneerConsumption/VenezuelaSignanAntiObamaPetitionAndWinaChickenorLoseYourJob.json","image_url":"https://media.breitbart.com/media/2015/04/obama-chicken.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_01__1540932128.html","title":"Venezuela: Sign an Anti-Obama Petition (And Win a Chicken) or Lose Your Job","title_page":"Venezuela: Sign an Anti-Obama Petition (And Win a Chicken) or Lose Your Job","title_rss":"NULL","source_domain":"breitbart.com","text":"The Venezuelan government is forcing citizens to sign a petition calling for President Obama to remove sanctions on the socialist state for its human rights abuses. Those eager to sign are rewarded with anything from a coveted smaller wait time on supermarket lines to whole chickens, but those who refuse may wind up unemployed.\nIn late March, President Nicolás Maduro announced a campaign to collect signatures against Obama, after he issued an executive order declaring Venezuela a “national security threat” and sanctioning seven high-ranking officials, most involved in the military or law enforcement and with direct control over armed forces responsible for various human rights abuses.\nThat campaign has evolved into a full-fledge promise to deliver to Obama ten million handwritten signatures at the Summit of the Americas on April 10 in Panama, and Maduro has been spending hours on live television broadcasts urging Venezuelans to sign. Many in the opposition, who not only agree with the sanctions but had actively called for them to be imposed, have refused to sign.\nAccording to a report from Fox News Latino, not signing can bring severe consequences. At least two government workers, both employees at the Vice Ministry of Supreme Social Happiness, were fired for refusing to add their names to the list, a human rights organization said. The Venezuelan Education-Action Program on Human Rights (Provea) alleged that a third employee was fired from a government-owned company that is not an agency of the government for the same reason.\nYet another woman reported being denied the ability to buy fish after waiting in line for two hours after refusing to sign the pledge. The government has established a special holiday, Socialist Fish Fair, for Holy Week, when Catholics abstain from eating meat in anticipation of Easter.\nThe government is not stopping at punishing those who fail to sign, however. Some who have signed the petition have claimed they were rewarded for doing so. At least one man, who gave his full name to Spanish newspaper ABC, said he received a free chicken for signing the petition. “It didn’t cost me much,” he explained, “on the line they just gave me the number for the chicken, but before that I had to add my name to the Obama list.”\nABC reports of other cases in which witnesses allege having received chicken, milk, laundry detergent, and other products for their signatures. Basic home goods like detergent, vegetable oil, and milk are strictly rationed and difficult to come by in Venezuelan supermarkets, with some having to spend up to five hours waiting in line to enter a market and buy the government-designated amount of each good.\nIn addition to the door-to-door campaigns and harassment of shoppers at markets, President Maduro has announced on his television program, In Contact with Maduro, that he endorses approaching tourists at hotels during the Easter holiday to gather signatures. He has also officially declared March 9 “Anti-Imperialism Day,” to commemorate the sanctions.\nPreviously, Argentine news outlet Infobae revealed that the Venezuelan government had forced at least one private school to make their children write hate mail letters to the White House, with the letter adding, “drawings against Obama are also acceptable.”","url":"https://www.breitbart.com/politics/2015/04/01/venezuela-sign-an-anti-obama-petition-and-win-a-chicken-or-lose-your-job/"}
