{"authors":["Frances Martel"],"date_download":"2018-10-30 19:24:28","date_modify":"2018-10-30 19:24:28","date_publish":"2015-02-02 18:20:23","description":"Venezuelan President Nicolás Maduro has personally accused the Vice President of the United States, Joe Biden, of plotting a \"coup d'etat\" plan against him, urging the nation's socialist government to remain on \"maximum alert\" against Biden and allies of the United States abroad. |","filename":"data/vaneerConsumption/VenezuelanPresidentJoeBidenConspiringCoupPlottoToppleMyGovernment.json","image_url":"https://media.breitbart.com/media/2015/01/Screen-Shot-2015-01-23-at-1.25.52-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_02__1540927468.html","title":"Venezuelan President: Joe Biden Conspiring Coup Plot to 'Topple My Government'","title_page":"Venezuelan President: Joe Biden Conspiring Coup Plot to 'Topple My Government' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Venezuelan President Nicolás Maduro has personally accused the Vice President of the United States, Joe Biden, of plotting a “coup d’etat” plan against him, urging the nation’s socialist government to remain on “maximum alert” against Biden and allies of the United States abroad.\nIn a speech at an event commemorating Venezuelan general Ezequiel Zamora on Sunday, Maduro warned listeners that his life was in danger, and that Biden’s conspiracy had already been “set into motion.”\n“Maximum alert!” he tells the crowd, “a coup d’etat plan has been set into motion in Venezuela, and we must unite the popular and military powers to defeat, on every stage, this coup. I know well what I say.”\nLater in the speech, he specifically accuses the Vice President of being the mastermind behind the coup plot.\n“The imperial power has entered a dangerous phase of desperation and has been talking to governments of the continent to announce the toppling my government,” he declares. “I accuse U.S. Vice President Joe Biden who personally spoke with the presidents and prime ministers about the plan.” According to Chinese state news agency Xinhua, Maduro later elaborated that Vice President Biden “announced the plan at a recent energy meeting in Washington with Caribbean leaders who told him last week in Costa Rica during the Summit of the Community of Latin American and Caribbean States (CELAC).”\nMaduro also accused “the press of the American empire”– specifically The New York Times— and “the fascist press of Madrid” of attempting to foment discord within Venezuela in an attempt to convince Venezuelans to “overthrow the revolutionary government that I preside over.”\nMaduro’s outburst against Vice President Biden is particularly perplexing because the Venezuelan leader had interacted personally with Biden as recently as early January. The two smiled and shook hands upon encountering each other at the swearing in of Brazilian President Dilma Rousseff. It is not, however, the first time the Venezuelan leader has accused the United States of attempting to sabotage his administration. Maduro has claimed that Secretary of State John Kerry has issued “threats of violence” in response to Kerry claiming that the Maduro government’s oppression of protesters is “unacceptable” and dubbed United States Senator Marco Rubio “the craziest of the crazies” for calling for an end to the political violence in that nation.\nSince having met with Biden in January, a number of high-ranking Venezuelan officials have defected from the nation and agreed to cooperate with United States courts in implicating Venezuelan politicians in criminal activity. The single most high-ranking among them is Leamsy Salazar, the former head of security to deceased leader Hugo Chávez Frías and head of security for current second-in-command Diosdado Cabello. Salazar has accused Cabello of being the drug lord at the helm of the Cartel de los Soles, which specializes in importing cocaine into the United States through trade routes Salazar claims Cuba had a hand in designing. He also claims that Maduro, Cabello, and others in their cabal hid Chávez’s death from the general public for three months, using the time to pass several edicts to their benefit under Chávez’s name.","url":"https://www.breitbart.com/national-security/2015/02/02/venezuelan-president-joe-biden-conspiring-coup-plot-to-topple-my-government/"}
