{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 22:45:44","date_modify":"2018-10-30 22:45:44","date_publish":"2016-12-12 00:00:00","description":"The Venezuelan government ordered its citizens to turn in their 100-bolivar bank notes within 72 hours to combat smuggling and food shortages.","filename":"data/vaneerConsumption/Venezuelabans100bolivarnote.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_venezuela-bans-100-bolivar-note-2016-12_1540939544.html","title":"Venezuela bans 100 bolivar note","title_page":"    Venezuela bans 100 bolivar note - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Protesters clash with riot police during a rally to demand a referendum to remove Venezuela's President Nicolas Maduro in Caracas Thomson Reuters The Venezuelan government pulled its 100-bolivar bank note out of service to combat smuggling and food shortages.\nThe government gave a 72-hour warning on Sunday.\n\"There has been a scam and smuggling of the one hundred bills on the border with Colombia. We have tried the diplomatic way to deal with this problem with Colombia's government; there are huge mafias,\" President Nicolas Maduro said on state television, according to a Bloomberg News report.\n\"I have given the orders to close all land, maritime and air possibilities so those bills taken out can't be returned and they're stuck with their fraud abroad,\" Maduro said, according to the BBC.\nThe country is experiencing a deep economic crisis. Despite being the biggest note in Venezuelan circulation, the 100-bolivar note has lost most of its value and is now worth about $0.02.\nVenezuela's opposition leader tweeted criticism of Maduro, calling his government \"inept.\"\nEstimates by economists at the International Monetary Fund put Venezuela's inflation rate at around 2,000%. The last official inflation rate published by the government last year had the figure at 160%.\nVenezuela is wracked by food shortages and crime and shop owners have taken to weighing money rather than counting it.\nLast week the Venezuelan central bank said it would issue six new notes, ranging up to 20,000 bolivars, in an effort to make \"the payments system more efficient,\" the BBC cited the bank as saying.","url":"https://www.businessinsider.com/venezuela-bans-100-bolivar-note-2016-12"}
