{"authors":[],"date_download":"2018-10-22 22:09:49","date_modify":"2018-10-22 22:09:49","date_publish":"2014-05-09 11:57:00","description":"After government forces raided and dismantled a protest camp,opposition forces said the move was meant to divert attention from a worsening economy.","filename":"data/vaneerConsumption/VenezuelansWhatsNextAfterGovernmentForcesRaidCamp.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/431271/140509-venezuela-raids-sl-0759_fbdbc7156499f32986ae5fc8d5b28f30.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_venezuela-crisis_venezuelans-whats-next-after-government-forces-raid-camp-n101191_1540246189.html","title":"Venezuelans: What's Next After Government Forces Raid Camp","title_page":"Venezuelans: What's Next After Government Forces Raid Camp","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nVenezuelan security forces conducted a pre-dawn raid in Caracas Thursday and dismantled camps which housed anti-government protesters, arresting 243 young people. A police officer was killed in violence following the raids, pushing the death toll to 42 since the clashes between opposition groups and the government started in February.\nSpeaking after the raids on national television, Venezuelan president Nicolas Maduro blamed the death of the police officer on \"right wing assassins,\" stating that is why the government needed to apply the \"firm hand of justice.\"\nSome in the country view the raid as a straightforward crackdown to restore order, others an attempt to chill student activists. Still others in the opposition saw it as an effort to revive a waning protest movement to distract Venezuelans from mounting economic woes.","url":"https://www.nbcnews.com/storyline/venezuela-crisis/venezuelans-whats-next-after-government-forces-raid-camp-n101191"}
