{"authors":["Abc News","More Clark"],"date_download":"2018-10-30 00:56:34","date_modify":"2018-10-30 00:56:34","date_publish":"2018-10-29 11:55:09","description":"The high waters flooding Venice have reached over five feet above sea level.","filename":"data/vaneerConsumption/Veniceexperiencingitsworstfloodingsince2012.json","image_url":"https://s.abcnews.com/images/International/venice-high-water-02-gty-jc-181029_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/International_venice-experiencing-worst-flooding-2012_story_id=58828272_1540860994.html","title":"Venice experiencing its worst flooding since 2012","title_page":"Venice experiencing its worst flooding since 2012 - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Tourists and residents in Venice's famous St. Mark's Square could be seen wading in nearly waist deep water as the city experienced its worst flooding since 2012.\nInterested in Environment? Add Environment as an interest to stay up to date on the latest Environment news, video, and analysis from ABC News. Add Interest\nBad weather and high winds were pushing more water in from the lagoon and city officials fear the water could reach the historic level of the 1966 flood, when the water was more than six feet above sea level.\nManuel Silvestri/Polaris\nSirens had sounded across the city early in the day when the water surpassed 43 inches. By late afternoon more than 70 percent of the city was flooded. The elevated levels shut down the city's water bus service known as vaporetti except to the outer island.\nAndrea Merola/ANSA via AP\nNearly all of Italy has been struck by bad weather in the past week. High winds have brought down dozens of trees across Rome, blocking roads. Schools were closed in the capital as a precaution.\nVenice has developed methods of coping with the annual flooding, also known as the \"acqua alta.\" Portable pedestrian bridges are erected to keep locals walking above the water level. But when the water level exceeds 47 inches, the pedestrian bridges are at greater risk of washing away.\nManuel Silvestri/Reuters\nTrain service to the city from the mainland was not affected. The city's 33rd marathon was held over the weekend, with participants competing in the flood waters.\nExperts say there are three main reasons for high water in the city: the rising floor in the lagoon caused by incoming silt; the undermining of the islands by the extraction of methane gas in the sea off Venice; and the overall increase in sea levels caused by global warming.","url":"https://abcnews.go.com/International/venice-experiencing-worst-flooding-2012/story?id=58828272"}
