{"authors":[],"date_download":"2018-10-30 01:05:59","date_modify":"2018-10-30 01:05:59","date_publish":"2018-09-14 16:52:22","description":null,"filename":"data/vaneerConsumption/VerizonRollsOut5GEightMonthsAfterTrumpNationalizationMemo.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/Verizon.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861559.html","title":"Verizon Rolls Out 5G Eight Months After Trump Nationalization Memo","title_page":"Verizon Rolls Out 5G Eight Months After Trump Nationalization MemoThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Verizon shot the first round in the 5G armament war this week with the introduction of “Verizon 5G Home.” The largest domestic mobile career, Verizon is pulling a quick draw on the ever evolving tech market in an attempt to outdistance its competitors. According to Gizmodo, 5G will be available in Houston, Los Angeles, Sacramento, and Indianapolis this fall. The new 5G isn’t fully 5G, however. Verizon’s 5G plan will offer an average of 300Mbps speed and peak speed of 1Gbps. These speeds are comparable to a wired Ethernet connection. A step in the right direction, yes. 5G, not quite.\n5G networks, shortly put, will revolutionize mobile technology on the scale of 4G/ LTE. Experts predict speeds of up to 100 times faster and less lag time, opening the way for alternative internet devices such as smart refrigerators and self-driving cars. 4G technology was focused on smartphones, 5G will move on towards internet connectivity on an industrial scale. Driverless cars, for example, become a realizable potential under 5G as information crosses seamlessly on the new network.\nRolling a national 5G network, however, is a bit more expensive than your average family plan. Three hundred thousand new pizza box-sized cells will have to be built in addition to the 150,000 towers dotting the U.S. Due to projected costs and timetables, Trump officials floated nationalizing the creation of a 5G network under the pretext of national security.\nThis January, a memo created by a senior White House official and leaked by Axios exposed the Trump administration’s concern over China’s centralized investments in the tech sector. The administration, particularly the National Security Council, worries the centralized effort will outdistance U.S. private production, leaving the U.S. at a considerable disadvantage on the cyber frontier. Federal Communication Commission Chairman Ajit Pai distanced himself from the memo: “The market, not the government, is best positioned to drive innovation and investment.”\nPatience bears fruit — Verizon’s effort is a new chapter in technological innovation. AT&T, T-Mobile, and Sprint are also all driving efforts toward 5G network creation which lies right around the corner.\nBesides, who would want to fork their phone bill over to the IRS?","url":"https://spectator.org/verizon-rolls-out-5g-eight-months-after-trump-nationalization-memo/"}
