{"authors":["Vibhuti Sharma","Sheila Dang"],"date_download":"2018-10-30 23:04:44","date_modify":"2018-10-30 23:04:44","date_publish":"2018-07-24 00:00:00","description":"The company added 398,000 subscribers who pay a monthly bill, topping the 352,000 that was expected.","filename":"data/vaneerConsumption/Verizonbeatsnewsubscriberstopestimates.json","image_url":"https://amp.businessinsider.com/images/5398bc5e69bedddb660d965c-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_verizon-earnings-beat-new-subscribers-top-estimates-2018-7_1540940684.html","title":"Verizon beats, new subscribers top estimates","title_page":"    Verizon earnings beat, new subscribers top estimates - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"AP / Paul Sakuma\nVerizon Communications Inc. reported better-than-expected quarterly profit and revenue on Tuesday, as the No. 1 US wireless carrier attracted more subscribers with unlimited-data plans.\nThe company's shares, which have fallen more than 4% this year, were up 2.4% to $51.98 in premarket trading.\nVerizon said it added 398,000 subscribers who pay a monthly bill on a net basis, beating analysts' average estimate of 352,000 subscribers, according to Thomson Reuters I/B/E/S.\nThe company has been investing heavily in building its 5G network and plans to roll out the service in three to five US markets in 2018. Verizon also named its chief technology officer, Hans Vestberg, as its new chief executive beginning August 1, in a move many analysts said signaled the company's focus on the network.\nNet income attributable to Verizon fell to $4.12 billion, or $1 a share, in the second quarter ended June 30, from $4.36 billion, or $1.07 a share, a year earlier.\nTotal operating revenue rose to $32.20 billion from $30.55 billion a year ago, above estimates of $31.78 billion.\nOn an adjusted basis, the company earned $1.20 a share, beating analysts' estimates of $1.14 a share.\n(Reporting by Vibhuti Sharma in Bengaluru and Sheila Dang in New York; Editing by Bernard Orr)","url":"https://www.businessinsider.com/verizon-earnings-beat-new-subscribers-top-estimates-2018-7"}
