{"authors":["Breitbart Tech"],"date_download":"2018-10-30 18:19:36","date_modify":"2018-10-30 18:19:36","date_publish":"2016-10-27 14:50:25","description":"A Verizon Communications Inc executive said the telecommunications company needs more information about Yahoo's massive breach of accounts.","filename":"data/vaneerConsumption/VerizonExecutiveSaysCompanyNeedsMoreInformationAboutYahooHackBeforeDealFinalized.json","image_url":"https://media.breitbart.com/media/2016/07/wi/ap_ap-photo-1414-e1475867933200.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_10_27__1540923576.html","title":"Verizon Executive Says Company Needs More Information About Yahoo Hack Before Deal Finalized","title_page":"Verizon Executive Says Company Needs More Information About Yahoo Hack Before Deal Finalized | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"(Reuters) — A Verizon Communications Inc executive said the acquisition of Yahoo Inc still makes sense, but the telecommunications company needs more information about the email provider’s massive breach of accounts.\nSpeaking at a tech conference hosted by the Wall Street Journal in Laguna Beach, California, Marni Walden, an executive vice president at Verizon, said on Wednesday Yahoo is investigating the 2014 data breach and that she hopes to resolve any questions related to the incident in 60 days.\n“I’ve got an obligation to make sure that we protect our shareholders and our investors, so we’re not going to jump off a cliff blindly,” said Walden, who is also Verizon’s president of Product Innovation and New Businesses.\nVerizon announced in July that it would buy long-struggling Yahoo for $4.83 billion. But in September, Yahoo disclosed that it had fallen victim to a data breach in 2014 that compromised users’ names, email addresses, telephone numbers, dates of birth and encrypted passwords, raising questions about whether Verizon would withdraw from the deal or renegotiate.\nRead the rest of the story at Reuters.","url":"https://www.breitbart.com/tech/2016/10/27/verizon-executive-says-company-needs-more-information-about-yahoo-hack-before-deal-finalized/"}
