{"authors":[],"date_download":"2018-10-30 17:56:53","date_modify":"2018-10-30 17:56:53","date_publish":"2018-08-29 15:34:00","description":"Verizon wanted to find out which small cities were best to start a small business in, so they conducted their own study to get an answer. Alpharetta ranks 15th in the country.","filename":"data/vaneerConsumption/VerizonstudyAlpharettaamongbestcitiestostartasmallbusiness.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/04/02/Images/newsEngin.21622353_Alpharetta-800x535.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_verizon-study-al_a3bdb091440ce93ec70a75daa25076d5__1540922213.html","title":"Verizon study: Alpharetta among best cities to start a small business","title_page":"Alpharetta among best to start a small business in, Verizon study says","title_rss":"NULL","source_domain":"ajc.com","text":"If you’re looking to start your own small business, Alpharetta might be the best place to do just that, according to a recent study.\nVerizon wanted to find the best cities for these businesses, so they conducted their own study. The results were posted Monday.\nAlpharetta was the only city from Georgia to make the list’s top 50, checking in at No. 15.\nREAD | Three Atlanta breweries named among ‘the hottest’ in America\nREAD | Ben Carson, Karen Handel tour affordable senior housing in Roswell\nREAD | Edible Arrangements moving main HQ from Connecticut to Sandy Springs\nTo determine the rankings, Verizon considered population, education, travel time to work, income per capita, broadband access and loans per capita. The study was limited to cities who have populations between 50,000 and 75,000 people, according to the most recent U.S. census.\nCities received higher ratings based on the percentage of the population that was 25 years and older that had at least a bachelor’s degree, how easy it is to get a loan in the city and if they had internet running at download speeds of at least 10 Mbs.\nAccording to the 2016 U.S. census, Alpharetta had a population of just a bit more than 65,000 people, its per capita income was $46,113 and 64 percent of Alpharetta’s population over 25 had at least a bachelor’s degree.\nPortland, Maine was the city that topped Verizon’s rankings, with Weston, Florida and Missoula, Montana checking in at second and third.\nLike North Fulton County News Now on Facebook | Follow on Twitter\n﻿MORE...","url":"https://www.ajc.com/news/local/verizon-study-alpharetta-among-best-cities-start-small-business/OulQhJ30sVjMsSenMmzDkN/"}
