{"authors":["Keith Griffith For Dailymail.Com","Associated Press"],"date_download":"2018-10-23 02:16:52","date_modify":"2018-10-23 02:16:52","date_publish":"2017-04-26 13:15:48","description":"Michael Seth Marshall, 42, of St. Albans, Vermont was arrested on Sunday and charged with cultivating marijuana after cops found dozens of pot plants and seeds in his residence.","filename":"data/vaneerConsumption/Vermontmangrewpotbecausehethoughtitdbelegalsoon.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA054D800000578-0-image-a-24_1493218445468.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447584_Police-Man-grew-pot-thought-itd-legal-soon_1540261012.html","title":"Vermont man grew pot because he thought it'd be legal soon","title_page":"Vermont man grew pot because he thought it'd be legal soon | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Vermont police have arrested a man who said he was growing marijuana to prepare for possible statewide legalization of the drug.\nMichael Seth Marshall, 42, of St. Albans, Vermont was arrested on Sunday and charged with cultivating marijuana after cops found dozens of pot plants and seeds in his residence.\nGame wardens were investigating a potential hunting license violation when they say Marshall fled from them into his house, and the wardens called in police.\nOnce police arrived, Marshall gave written consent for a search of his residence, where they found 13 full-grown marijuana plants and 27 smaller plants, according to police.\nMichael Seth Marshall, 42, of St. Albans, Vermont was arrested on Sunday and charged with cultivating marijuana after cops found dozens of pot plants in his home (stock photo)\nCops say Marshall told them he thought marijuana would be legalized soon, so he wanted to get an early start on growing it for future sale.\n'I've heard, through my 33 years of practicing law, pretty much every comical response somebody would come up with to a police officer who's about to bust them,' state Senator Joe Benning told NECN in reference to the case.\n'I got a kick out of that, but the nutshell is, this person knows full well we have no system in place,' he said.\nBenning, a Republican, supports efforts to legalize marijuana in the state.\nThe possession of small amounts of marijuana has been decriminalized in the state of Vermont, but it is still illegal for recreational use.\nMarshall is scheduled to appear in court on May 16. His attorney, Rory O. Malone, could not be reached for comment on Wednesday.","url":"https://www.dailymail.co.uk/news/article-4447584/Police-Man-grew-pot-thought-itd-legal-soon.html"}
