{"authors":["Nicole Fabian-Weber"],"date_download":"2018-10-30 23:18:59","date_modify":"2018-10-30 23:18:59","date_publish":"2014-08-13 20:12:10","description":"Some people like Shark Week and then other people are Verne Troyer. Austin Powers' littlest star is, like many of us, a huge fan of Discovery Channel's Shark Week. But the difference between your average SW fan and Troyer is... Troyer dresses the…","filename":"data/vaneerConsumption/VerneTroyersSharkWeekCostumePutsAllSharkEnthusiaststoShamePHOTO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/7aa551ff-97a3-4284-9c8e-31cda4584d29.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35673-verne-troyers-shark-week-costume-puts-all-shark-enthusiasts-to-shame-photo_1540941539.html","title":"Verne Troyer's Shark Week Costume Puts All Shark Enthusiasts to Shame - PHOTO","title_page":"Verne Troyer's Shark Week Costume Puts All Shark Enthusiasts to Shame — PHOTO","title_rss":"NULL","source_domain":"bustle.com","text":"Some people like Shark Week and then other people are Verne Troyer. Austin Powers' littlest star is, like many of us, a huge fan of Discovery Channel's Shark Week. But the difference between your average SW fan and Troyer is... Troyer dresses the part. Showing his love for all things shark, Troyer posted a photo of himself to Twitter, donning an adorable shark costume akin to Shark After Dark's Bob The Shark's. And I've gotta say, if there were a costume contest, Troyer would win. Sorry, Bob. We only ever see you from the waist-up. God knows what's below your torso.\nAs far as ways to celebrate Shark Week go, I think this is the way to do it. Tuna appetizers and whatnot are cute, but if you really want to show your love for sharks, go balls to the wall a la Troyer. It looks like it might get a little uncomfy if you have to go to the bathroom, or, you know, move, but who are we if we're not willing to make a few sacrifices for our love of our favorite fish?\nVerne, you've got the right idea, buddy. Now I've just gotta find a shop that overnights their 'stumes.\nAnd then there's this. You're welcome.","url":"https://www.bustle.com/articles/35673-verne-troyers-shark-week-costume-puts-all-shark-enthusiasts-to-shame-photo"}
