{"authors":["Hannah Paine For Daily Mail Australia"],"date_download":"2018-10-22 23:55:51","date_modify":"2018-10-22 23:55:51","date_publish":"2017-03-10 05:09:40","description":"It's the dating show which hopes to see Matty Johnson fall in love after being rejected by Georgia Love.","filename":"data/vaneerConsumption/VERYbustyblondeBachelorcontestantarrivesatmansion.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/04/3E1FFEBC00000578-0-image-a-32_1489120362104.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299930_VERY-busty-blonde-women-competing-Matty-J_1540252551.html","title":"VERY busty blonde Bachelor contestant arrives at mansion","title_page":"VERY busty blonde Bachelor contestant arrives at mansion | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's the dating show which hopes to see Matty Johnson fall in love after being rejected by Georgia Love.\nAnd judging from the women arriving at an offsite location earlier this month, there will be plenty of variety for the dark haired stud.\nAmong the women competing for Matty's affection includes a blonde with ample assets to rival previous contestant, Zilda Williams.\nScroll down for video\nMystery woman? Among the women competing for Matty's affection includes a curvy blonde with ample assets to rival previous contestant Zilda Williams\nThe busty singleton juggled several bags as she disembarked from a minivan, which had shuttled the ladies to an offsite location where they would get ready to meet Matty.\nThe mystery woman wore a form-fitting cropped T-shirt with denim shorts that showed off her tanned limbs.\nMaking her way inside, she stopped to talk to another contestant, a brunette wearing a low backed orange mini dress.\nHands full: The golden haired singleton juggled several bags as she disembarked from a minivan which had shuttled the ladies to an off site location\nAll dressed up! Another blonde contestant looked like she was dressed to impress Matty from the moment she stepped off the bus, wearing an elegant white cape\nCovering up? The mystery woman wore her long locks in a high pony tail, shielding her eyes with a pair of large aviator sunglasses\nThere didn't seem to be a specified dress code for the first day, with girls arriving in everything from track pants to cocktail dresses.\nAnother blonde contestant looked like she was dressed to impress Matty from the moment she stepped off the bus, wearing an elegant white cape.\nThe mystery woman wore her long locks in a high pony tail, shielding her eyes with a pair of large aviator sunglasses.\nDifference of temperature? The golden haired singleton juggled several bags as she disembarked from a minivan which had shuttled the ladies to the mansion\nResting her feet before she wears heels? Another contestant was clearly dressed for comfort, wearing a pair of white Birkenstocks\nAll black! The blonde draped a leather jacket over her shoulders, wearing a loose black maxi dress\nAnother contestant was clearly dressed for comfort, wearing a pair of white Birkenstocks.\nThe blonde draped a leather jacket over her shoulders, wearing a loose black maxi dress.\nSome of the women appeared to have been concerned about when they would next eat, having arrived clutching boxes of takeaway food.\nWorried about getting hungry? Some of the women appeared to have been concerned about when they would next eat, having arrived clutching boxes of takeaway food\nDressed to impress! One blonde in white T-shirt sported a Lara Bingle-like haircut, wearing skinny jeans, ankle books and oversized sunglasses, looking a lot like last season's contestant Keria Maguire\nFriends already? Some of the female contestants appeared to already know each other or had gotten close in a short space of time\nA male crew member stood by helping the women offload their bags from the van, chatting to the women as they became acquainted with their surroundings.\nOne blonde in white T-shirt sported a Lara Bingle-like haircut, wearing skinny jeans, ankle books and oversized sunglasses, looking a lot like last season's contestant Keria Maguire.\nSome of the female contestants appeared to already know each other or had gotten close in a short space of time.\nSimilar: These two women disembarked from the van in similar outfits of blouses, shorts and top buns\nSimple: This brunette also cut a casual figure while waiting for her bag to be loaded off the bus\nAs they made their way inside, one woman in a leopard print raincoat put her arm around another.\nAnother brunette appeared to chat animatedly to a blonde wearing a black baseball cap as they walked their way up a set of stairs.\nThe Bachelor has already started filming and will air in the next few weeks.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299930/VERY-busty-blonde-women-competing-Matty-J.html"}
