{"authors":["Lana Shadwick"],"date_download":"2018-10-30 19:58:39","date_modify":"2018-10-30 19:58:39","date_publish":"2015-08-04 15:34:05","description":"Over 260 veterans marched in their underwear \"silkies\" through Houston in the summer heat.","filename":"data/vaneerConsumption/VeteransMarchinSilkiesforComraderyandSuicideAwareness.json","image_url":"https://media.breitbart.com/media/2015/08/Veteran-Underwear-Walk1111.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_08_04__1540929519.html","title":"Veterans March in Silkies for Comradery and Suicide Awareness","title_page":"Veterans March in Silkies for Comradery and Suicide Awareness","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, Texas – Over 260 veterans marched in their “silkies” through Houston in the summer heat. The veterans marched for comradery and to raise awareness to the high rate of suicide and PTSD among service veterans and active duty military.\nThe march was billed as “22 with 22 for the 22,” referring to the number of suicides that are committed every day by military veterans. They marched 22 kilometers (13.6 miles) with backpacks weighing 22 kilograms (48.5 pounds).\nThe Department of Veteran Affairs issued a Suicide Data Report in 2012 which reported that 22 veterans a day commit suicide. Many suffer from PTSD (post-traumatic stress disorder).\nThe initial march took place in San Diego with marines and combat veterans. The concept expanded to Houston with veterans from all branches of the military. The Houston organizer said it was important for him to organize the event within a week of an event in San Diego. It was also important for him to open the event up to all veterans with all types of problems.\nIt was very fitting that participants started their march at Houston’s Memorial Park, one of the largest parks in this vast urban city. The land where the park is located was the site of Camp Logan, a World War I US Army training camp. A prominent Houston family purchased the land and dedicated it as a memorial to soldiers who lost their lives serving in World War I.\nDonny O’Malley, the founder of Irreverent Warriors in San Diego, California, marched with the veterans in Houston. His organization held the first “22 event” on July 25th in San Diego. The website for his organization states, “In order for us to cope, to process, and to deal with what we’ve done and seen, combat veterans have to get together, we have to be there for each other, we have to be able to talk to each other, laugh about our experiences, and understand that everything we did, thought, and saw, was what we needed to do, think, and see, in order to protect our country.”\nThe goal of the Irreverent Warriors group is for their 22 event to be a catalyst for other such events across the country. They say, “We don’t need to raise awareness for the 22, the whole country is already talking about it. What we need to raise awareness about is how to effectively help the 22, and the answer is simple. Facilitate communication amongst combat veterans of the same unit and same deployment, or of the same battlefield. Warriors have a powerful connection to the lands they fought on.”\nThe Irreverent Warriors describe themselves as “guys who have used humor to get through the darkest side of humanity. We are infantrymen, special operators, engineers, corpsman, combat medics, and anyone who has been attached to grunts and operators- and walked into the fire of combat.”\nO’Malley told Breitbart Texas, “I want civilians to know that the best way to help a loved one who is struggling with demons from combat is to put their loved one in touch with someone they served with in combat. Reconnecting with old battle buddies — or even guys who fought on the same battlefield — fuels the soul better than anything.”\nCesar Gill told the Houston Chronicle that he has lost eight friends to suicide. He said, “When you’re in the Corps, you’re part of a wolf pack. When you get out, you can feel lost. Bringing everyone together today, we’re a pack again and no longer sheep.” Gill served in the Marines from 2003 to 2007.\nMark A. Metzger III, a Houston criminal defense lawyer and former marine, organized the Houston event. He told Breitbart Texas the event was an Irreverent Warriors event “but with a twist.” He said Irreverent Warriors are combat veterans and they “focus on how to get them through that.”\nMetzger said his intent was to help all branches of the military by getting them together, and to help veterans with all problems. He said it was about “more than just having guys put a bullet in their head.”\nVeterans suffer from loneliness, isolation, depression, and drug and alcohol addiction, Metzger said. “Couple that with financial and relationship problems and an inability to assimilate to civilian life, and it can become a big problem.” He said at that point, “The only option is to remove yourself from the equation. This is where you get the situation where they remove themselves out.”\nHe said there is “this constant fear because if you don’t use humor, you’re only option is to fear.”\nMetzger said he “wanted to add everyone out there. We miss our brother, our comradery.” He continued, “being in the military is the best time in your life. You miss that time, there is a common thread. Talking to each other, just for one day, then suddenly life does not seem so bad. You have some good in your life.”\nThe criminal defense lawyer and former marine said, “If we can stop that decision, just take the gun down and put it on the nightstand. Then the chances are they will never pick it up again.”\nHe said these walks are great because “you combine humor and fun, comradery, and a little bit of pain (the hike and sun).”\nMetzger is planning another event for veterans in Houston next January. He said, “we are about extreme craziness, when it’s about 30 degrees. It was 100 degrees in Houston [when we did this walk].”\nJohnny Joseph Jones, a double-amputee and a marine, EOD (Explosive Ordinance Disposal) tech is planning an event for Austin.\nThese events are just for veterans. The Houston organizer said, “If you have not served, you do not understand. We have to be able to be ourselves.”\nThe veterans who participated in the event in Houston were a bit outrageous, some of them did a little drinking, and they were in their underwear, but they are doing what they know works for them. Metzger says it works, “veterans aren’t going to talk to anyone in a dark room, and medicine is a problem.”\nThe Houston veteran said he did not care if some do not understand their methods. Metzger quoted Jack Nicholson from the movie A Few Good Men and said, “I have neither the time nor the inclination to explain myself to a man who rises and sleeps under the blanket of the very freedom that I provide, and then questions the manner in which I provide it.”\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served in Texas as a prosecutor and associate judge. Follow her on Twitter @LanaShadwick2","url":"https://www.breitbart.com/border/2015/08/04/irreverent-warriors-march-in-undies-for-comradery-and-suicide-awareness/"}
