{"authors":["John Hayward"],"date_download":"2018-10-30 19:56:26","date_modify":"2018-10-30 19:56:26","date_publish":"2016-08-27 00:56:34","description":"76-year-old Navy veteran Peter A. Kaisen, of Islip, New York, killed himself in the parking lot of the Northport VA Medical Center on Sunday.","filename":"data/vaneerConsumption/VeteranCommitsSuicideinParkingLotofLongIslandVA.json","image_url":"https://media.breitbart.com/media/2016/08/northport-va-hospital-long-island-ny-facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_08_26__1540929386.html","title":"Veteran Commits Suicide in Parking Lot of Long Island VA","title_page":"Veteran Commits Suicide in Parking Lot of Long Island V.A.","title_rss":"NULL","source_domain":"breitbart.com","text":"76-year-old Navy veteran Peter A. Kaisen, of Islip, New York, killed himself in the parking lot of the Northport Veterans Affairs Medical Center on Sunday after reportedly being turned away for emergency care.\n“Kaisen served in the U.S. Navy from 1958 to 1962, working on the USS Denebola, a ship that delivered refrigerated items and equipment to ships in the fleet,” according to his friend Thomas Farley, as cited by Fox News.\nAfter leaving the Navy, Kaisen went to work for the Long Beach Police Department, where he was severely injured in a car accident, causing him to rely on pain medication over the following decades.\nThe New York Times quotes two sources connected to the Northport VA Medical Center who said Kaisen came there on Sunday seeking emergency-room care for a mental health issue but was turned away.\nAccording to these sources, the E.R. staff did not tell Kaisen that the mental health facility was open 24 hours a day, and a psychologist was on call. For what it’s worth, the Long Island Press notes the medical center’s website claims, “there is always a caring mental health doctor available 24/7 in our Emergency Room.”\nHe then went to the parking lot outside the medical center’s nursing home facility, where Newsday says he was found “bleeding and unresponsive” after shooting himself.\nAlthough the hospital is currently denying that Kaisen presented himself to the emergency room, the New York Times’s anonymous sources were scathing in their criticism.\n“He went to the E.R. and was denied service. And then he went to his car and shot himself,” said one source, identified as a hospital employee. “Someone dropped the ball. They should not have turned him away.”\nThe Times reports this is yet another VA facility with a troubled history:\nThe Northport hospital has been under scrutiny for mismanagement and poor care since The New York Times reported in May that it had closed all five of its operating rooms for months after sand-size black particles began falling from air ducts. The office of Representative Lee Zeldin, a Republican whose First Congressional District is on Long Island, had been looking into the allegations, Eric Amidon, Mr. Zeldin’s chief of staff, said in an email to The Times in June.\nNewsday reports that U.S. House Representatives Steve Israel and Peter King sent a letter to FBI Director James Comey on Thursday demanding an “expeditious and transparent investigation” of the incident. The FBI was already involved in the case because Kaisen’s death occurred on federal property, but there was no suspicion of criminal activity, and Kaisen is believed to have been alone when he died.\n“I’m a Vietnam vet – disabled from Agent Orange – and he was always looking out for me. He was such a faithful guy. He was such a big advocate for veterans and that’s what makes it’s so sad,” Kaisen’s friend Thomas Farley told Fox News.\nKaisen’s work for his fellow veterans might not be finished yet. “Your death is not in vain. Through your tragedy, may the bureaucrats change policies to help others that were in your situation,” read one message left on the funeral home’s website, quoted by the Long Island Press.","url":"https://www.breitbart.com/national-security/2016/08/26/neglected-veteran-commits-suicide-parking-lot-long-island-v/"}
