{"authors":["Alexandra Klausner For Dailymail.Com"],"date_download":"2018-10-23 01:19:47","date_modify":"2018-10-23 01:19:47","date_publish":"2016-01-29 15:04:13","description":"Don George of Los Angeles, California is suing the Lancaster store where he bought an e-cigarette earlier this month that allegedly exploded exploded, causing him physical harm.","filename":"data/vaneerConsumption/VeteranDonGeorgeispermanentlyscarredafterecigaretteexploded.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B3D70100000578-0-image-a-27_1454081737753.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422869_Flames-came-shooting-bottom-Veteran-34-permanently-scarred-e-cigarette-exploded-near-face_1540257587.html","title":"Veteran Don George is permanently scarred after e-cigarette exploded","title_page":"Veteran Don George is permanently scarred after e-cigarette exploded | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An Air Force veteran filed a lawsuit on Thursday after he says he was badly burned by an e-cigarette.\nDon George of Los Angeles, California is suing the Lancaster store where he bought an e-cigarette that allegedly exploded, causing him physical harm.\n'The actual flames singed my face,' George, who is working as an air-traffic controller while he gets his MBA, told KTLA.\nGeorge claims he was permanently scarred after he put a new battery in his e-cigarette on January 3.\nLawsuit: Don George (pictured after the accident) of Los Angeles, California is suing the Lancaster store where he bought an e-cigarette that allegedly exploded exploded, causing him permanent scars on his face and arm\nDamage: Don George (pictured left on Thursday and right before the accident) is still getting used to his singed face after his e-cigarette spontaneously caught fire\nWhen the vape didn't work after the battery change, he says he held it up to his ear to listen for his activation - that's when the device combusted.\n'I hit it about three times and boom it exploded in my hands and flames came shooting out the bottom,' said George, who then told KTLA that the e-cigarette burned his shoulder and the carpet in his home.\nGeorge's attorney Gregory Bentley said that there is no federal regulation of e-cigarettes after the cigarette industry fought the FDA.\nBentley claims he has at least 30 cases of people who have had similar problems with e-cigarettes in the last couple of months.\nOther incidents have seen homes and cars worth thousands of dollars destroyed because of malfunctioning devices.\nFaulty battery: 'I hit it about three times and boom it exploded in my hands and flames came shooting out the bottom,' said George, who then added that the e-cigarette burned his shoulder and the carpet in his home\nBattery change: When George's vape (pictured) didn't work after the battery change, he says he held it up to his ear to listen for his activation - that's when the device combusted\nMost e-cigarette accidents occur while the device is being charged after the battery becomes overheated.\nWhile many studies have said that electronic cigarettes are safer than their traditional tobacco counterparts, debate continues about their long-term effects.\nThe UN's World Health Organization released a report two years ago saying that the devices could be gateways to traditional smoking and called for regulations against advertisements that could entice children.\nNever-smokers who tried e-cigarettes were almost three times more likely to smoke cigarettes a year later compared with those who had never had an e-cigarette, a UK study found.\nJust under a third of more than 2,300 students had used e-cigarettes when they were first questioned in 2013.\nA year later, this figure had risen to 38 per cent, the study published in the journal Tobacco Control found.","url":"https://www.dailymail.co.uk/news/article-3422869/Flames-came-shooting-bottom-Veteran-34-permanently-scarred-e-cigarette-exploded-near-face.html"}
