{"authors":[],"date_download":"2018-10-30 20:50:51","date_modify":"2018-10-30 20:50:51","date_publish":"2018-08-07 18:53:00","description":"In March, a Fulton County judge released a young hoodlum named Jayden Myrick over repeated objection...","filename":"data/vaneerConsumption/Veteranjudgeseemedoptimisticyetgullibleinmurdercase.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/09/Videos/4434154.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_torpy-large-fult_2b51aff3d66f4de04c24c5dfab68cf35__1540932651.html","title":"Veteran judge seemed optimistic, yet gullible in murder case","title_page":"Veteran judge seemed optimistic, yet gullible in murder case","title_rss":"NULL","source_domain":"ajc.com","text":"In March, a Fulton County judge released a young hoodlum named Jayden Myrick over repeated objections of prosecutors. In July, he allegedly shot to death a young father during a stickup outside the Capital City Club in Atlanta.\nFor nearly eight months, Fulton Superior Court Judge Doris Downs anguished and deliberated whether to release the teen who was 14 when he robbed a woman at gunpoint. As he turned 17 last August, Myrick was to be transferred from the juvie system to Big Boy Prison and his fate as a full-fledged violent criminal would be sealed. She tried to avoid that but it blew up. Tragically.\nAfter reading a series of transcripts of the court hearings concerning Myrick’s release, two things stand out:\n1) It’s heartening to see a judge still be optimistic about humanity after serving 20-plus years in the meat-grinder that is Fulton County Courts.\n2) It’s troubling to see how gullible and clueless she was in pushing hard to release a clearly troubled young man into a largely phantom program.\nThe harm done by Downs’ miscalculation is dire. She released a proven violent offender who then killed a man named Christian Broder, a restaurant manager, as he waited for an Uber after a wedding reception. Downs’ decision will ripple for years. Rarer will be the judge willing to risk going out on a limb to offer a young person another shot.\n“It’s these kind of cases that make judges tighten up and not give second chances,” said Gino Brogdon, who served a decade as a Fulton County judge and considered himself a tough sentencer. “Sentencing is betting. Betting on the person getting out one day. Betting on human nature, that maybe things will turn out for them if you give them 5 years rather than 15.”\nDowns and even prosecutors bet on Myrick from the start.\nIn April 2015, the teen stuck a gun in a woman’s face near her home. Rather than slam him with an armed robbery charge carrying a minimum of 10 years in prison, his charge was reduced by Downs and attorneys on both sides to robbery and he was sentenced in 2016 to serve 7 years with a chance of parole.\nLast August, he was set to transfer to adult prison to finish his sentence. The law requires judges to consider probation when a juvenile sentenced as an adult turns 17. That’s the only choice other than adult prison. Myrick’s lawyer asked the court for an alternative to adult prison.\nThe prosecutor argued Myrick was bad news. He had pulled an armed robbery, was a Bloods gang leader while locked up and had committed many offenses, including battering another prisoner with soap stuffed in a sock. The victim told the judge last August that the fragility and fleeting vulnerability of her life flashed before her eyes during the crime.\nFulton County Superior Court Judge Doris Downs (RICH ADDICKS/AJC staff) (The Atlanta Journal-Constitution)\nDowns has declined to talk about Myrick’s case. But from court documents, it’s clear Downs didn’t want to toss another young man into the maw.\n“Well, he’s going to get out, that’s the reality,” Downs told the prosecutor. “He can get out now or he can get out in four and a half years.”\nShe reasoned Myrick had a shot at redemption now, but would not once all the badness of adult prison was fully baked in. The clock was ticking before he was to turn 17. She felt she had to do something. Fast. She and a court official discussed several alternatives but he didn’t qualify for them. He wasn’t homeless. Or 18. Or a drug offender. And so on.\nJayden Myrick (2018 Cox Media Group)\nSomehow Downs pulled an organization called Visions Unlimited out of her robe. She talked up the rehabilitation outfit run by a woman named Gwen Sands. She spoke about the fine social services and programs it delivered, and about the organization’s strict, no-nonsense leader.\nA week later, Sands came to court, calling herself a “visionary” and boasting about her program, which reporters for The Atlanta Journal-Constitution Carrie Teegardin and Alan Judd later discovered was merely a husk of its former self.\nAfter a court hearing Aug. 10, with the judge leaning towards leniency, Myrick, who had heard lectures about behaving himself, beat and choked another teen in lockup. A week later, that incident was brought up during a court hearing, but Downs still released him to parole and the Visions Unlimited program after hearing Sands talk about her perfect record in turning youths around.\n﻿In other news:\nIn one exchange, one of them allegedly described racism as normal and not a bad thing.\nNow, that is an inconceivable statement and Downs, a former prosecutor and longtime judge, should have certainly known better. Hitting 50 percent in that field is unbelievable. One hundred percent? That’s an affront to reality.\nSoon after his release, prosecutors spotted Myrick on social media flashing gang signs and posing with a gun. He was arrested. Even after that, in a November hearing deciding if she should release him, Downs spouted the nonsense about Visions Unlimited having a 99 percent success rate.\nIt sounds as if the judge, who had already embarked on this uncertain course, was trying to convince herself of her own actions. Judge Downs warned Myrick repeatedly and more than once mentioned she was taking a risk. In fact, in March as he was being released, again, she noted that the prosecutor “says we’re making the mistake of a lifetime. And I’m hoping we’re right.”\nIt’s not clear why Downs went to the wall for someone who was a marginal, risky character.\nGwinnett County’s DA Danny Porter said to the AJC, “That’s nearly impossible to save him with the resources we’re putting in (the juvenile system and in rehabilitative services) right now. I’m not sure you can save him any way. By the time he takes into gang life and the violent criminal life, that’s a hard kid to save. Once you get a violent crime, a judge needs to think hard about taking a risk with that offender.”\nDowns is no neophyte. She was a Fulton prosecutor who obtained at least one death penalty. But she has butted heads with Fulton District Attorney Paul Howard many times, often about the unyielding stance of his office in pushing cases, which she has argued, clogs the system. In fact, she wanted to run against him a few years ago.\nAshleigh Merchant, an attorney who once served as a Fulton public defender, said “Judge Downs did the drug court before drug court was cool. She has seen amazing rehabilitations.\n“Judge Downs has always had the gumption to do what she thinks is right. She’s been willing to buck the DA’s recommendations. She did her job. She did what she thought was right. You cannot predict behavior.”\nBut my guess is more judges are going to see Jayden Myrick in their crystal ball when they consider giving someone a break.","url":"https://www.ajc.com/news/local/torpy-large-fulton-judge-bad-bet-mercy-will-ripple-for-years/h6800rwczrhLMTfqPh9ShN/"}
