{"authors":[],"date_download":"2018-10-22 21:41:56","date_modify":"2018-10-22 21:41:56","date_publish":"2014-05-07 22:20:31","description":"The secretary told NBC News the department was working to ensure nothing like what allegedly took place in Phoenix happens again.","filename":"data/vaneerConsumption/VeteransAffairsSecShinsekiAngryOverAllegedVAHospitalDeaths.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/427586/140507-eric-shinseki-1759_3dbd9ba6c9b61cfe4a0b129acfb7125c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_va-hospital-scandal_veterans-affairs-sec-shinseki-angry-over-alleged-va-hospital-deaths-n99816_1540244516.html","title":"Veterans Affairs Sec. Shinseki 'Angry' Over Alleged VA Hospital Deaths","title_page":"Veterans Affairs Sec. Shinseki 'Angry' Over Alleged VA Hospital Deaths","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nVeterans Affairs Secretary Eric Shinseki said he was outraged and surprised at allegations of unnecessary deaths at the veterans' hospital in Phoenix, but promised a full investigation.\n\"I am angry,\" he told NBC's Jim Miklaszewski Wednesday.\nShinseki, who is a Vietnam veteran, told NBC News he understood the outrage these claims triggered among veterans and on Capitol Hill.\nUp to 40 patients may have died at the Phoenix hospital, allegedly due to delays in care.\nSeveral hospital whistleblowers claim that in an effort to improve their performance record, administrators ordered thousands of appointment requests be diverted to a secret unofficial list not to be reported. If the patients died, their names would disappear.\nNew allegations of falsified records have also cropped up at VA hospitals in Austin, San Antonio and Fort Collins, Colorado.\nVeterans' groups have expressed their outrage, and the American Legion has even called for Shinseki's resignation.\nThe secretary told NBC News the department was working to ensure nothing like what allegedly took place in Phoenix happens again.\n\"I offer my condolences - to these families - for anyone who's lost a veteran, any unexpected death in one of our facilities,\" Shinseki said. \"What I want veterans to know, all the rest who are watching what's going on, I want them to know that this is a good, quality healthcare system.\"\nThe White House issued a statement saying President Barack Obama \"remains confident in Secretary Shinseki's ability to lead the Department.\"\nShinseki told NBC News he doesn't plan to resign, and he added, \"We're going to do something about it, to get to the bottom of it and to the best of our abilities to assure it never happens again.\"\n—Jim Miklaszewski and Becky Bratu","url":"https://www.nbcnews.com/storyline/va-hospital-scandal/veterans-affairs-sec-shinseki-angry-over-alleged-va-hospital-deaths-n99816"}
