{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-23 01:52:48","date_modify":"2018-10-23 01:52:48","date_publish":"2016-01-28 16:21:44","description":"Teal David fell under the wheels of a vintage tractor being driven by her father, Evan, on a country lane in the seaside village of Aberdaron, North Wales, in June last year","filename":"data/vaneerConsumption/VetkilledhissixyearolddaughterTealDavidintragictractoraccident.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30A84BE200000578-0-image-a-68_1453997693023.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421236_Vet-killed-six-year-old-daughter-tragic-tractor-accident_1540259568.html","title":"Vet killed his six-year-old daughter Teal David in tragic tractor accident","title_page":"Vet killed his six-year-old daughter Teal David in tragic tractor accident | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A heartbroken vet has told how he accidentally killed his six-year-old daughter in a tragic accident on a family holiday.\nTeal David fell under the wheels of a vintage tractor being driven by her father, Evan, on a country lane in June last year.\nMr David told an inquest how he was taking his three children on the tractor ride for a 'treat' on the holiday in the seaside village of Aberdaron, North Wales.\nLittle Teal David tragically died after falling from a vintage tractor which was being driven by her father, Evan\nThe youngster was described as a 'perfect, loving and caring little girl' by her heartbroken father this week\nThe inquest was told that he started to drive the tractor 'very, very slowly' with one of his children sat on his lap.\nMr David, 43, told the inquest that tractor 'jerked' as he drove along a country lane - and Teal tumbled off from the footwell.\nHe said: 'I put my foot on the clutch to slow an she fell off and hit the concrete.\n'I stopped and she didn't come up, whether she was unconscious or what. I panicked and didn't get it out of gear. I drove over her.'\nFighting back tears at the inquest, California-born Mr David said: 'It shouldn't have happened.'\nMr David, who works as a vet, said that the breaks on the 49-year-old Nuffield tractor 'were sticking and would sometimes catch... other than that it was in good order.'\nMr David, of Henley-on-Thames, Oxfordshire, told the inquest they would regularly stay with his parents in the Welsh village.\nThe tractor was later checked by police investigators who said the vehicle had no mechanical defects.\nAn inquest heard the family were visiting Teal's grandparents when the accident took place\nTeal's siblings Sennen and Sky were unhurt in the accident. Their mother Clare was not at the scene at the time in June last year.\nPathologist Dr Mark Lord said Teal died 'virtually immediately' after her chest was crushed by the tractor's large wheel.\nNorth West Wales coroner Dewi Pritchard Jones recorded a conclusion of misadventure.\nHe said: 'Mr David was giving his children a treat of a ride on a tractor. As a child I myself had several rides on tractors.\n'But this entirely innocent and not reckless task led to the entirely unforeseen event of Teal falling off the tractor and suffering injuries that led to her death.'\nHe told Mr David: 'It must have been a terrible experience for you. I can't think of anything worse happening to a father than what you have been through.'\nAfter the Caernarfon inquest, Mr David, who works at a veterinary surgery in Thame, Oxon, described Teal as a 'perfect, loving and caring little girl'.","url":"https://www.dailymail.co.uk/news/article-3421236/Vet-killed-six-year-old-daughter-tragic-tractor-accident.html"}
