{"authors":["Ashley Collman For Dailymail.Com","Jennifer Smith For Dailymail.Com"],"date_download":"2018-10-23 04:15:14","date_modify":"2018-10-23 04:15:14","date_publish":"2017-03-16 15:31:51","description":"Valerie McDaniel, 38, and her boyfriend Leon Jacob, 39, were arrested on Friday in Texas for trying to pay a hitman to kill their former partners","filename":"data/vaneerConsumption/Vetreleasedonbailaftertryingtohaveexkilled.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E558C4400000578-0-image-a-12_1489682702227.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320580_Vet-released-bail-trying-ex-killed_1540268114.html","title":"Vet released on bail 'after trying to have ex killed'","title_page":"Vet released on bail 'after trying to have ex killed' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The ex-husband of a Texas veterinarian accused of trying to hire a hitman to kill him says he's concerned that his wife has been freed on bail.\nValerie McDaniel and her boyfriend Leon Jacob were arrested on Friday for offering to pay an undercover cop $20,000 and two Cartier watches to kill their respective former partners.\nValerie, 48, has since been released on $50,000 while her boyfriend remains behind bars at the Harris County Jail.\nScroll down for video\nValerie McDaniel, left, posted bail Monday afternoon, after she was arrested for allegedly trying to hire a hitman to kill her ex-husband\nMcDaniel, left, and Leon Jacob, right in court on Saturday, allegedly tried to pay an undercover cop $20,000 and two Cartier watches to kill McDaniel's ex-husband and Jacob's ex-girlfriend\n'With regard to Dr. McDaniel's release on bond, we are very concerned given she has little to lose at this point,' an attorney for Valerie's ex-husband Marion 'Mack' McDaniel, said, according to the Houston Chronicle. 'However, we are confident the courts will continue to take the steps necessary to protect Mr. McDaniel, his daughter and their family.'\nIt's still unclear what motivated Dr McDaniel to try and hire a hitman to kill her ex-husband, the father of her daughter.\nOn Wednesday, the attorney said that Mack McDaniel would not be releasing any other public statement. He obtained a protective order against his ex-wife last week.\n'Mr. McDaniel's focus is solely on the emotional well-being and physical safety of his [eight-year-old] daughter,' his attorney said. 'He does not intend to speak publicly about the events but he is thankful for the overwhelming support shown to him and his daughter.'\nMcDaniel (left) and hospital worker Jacob's (right) exes helped police by posing in fake murder photos\nThe two got divorced last year, and she met her current boyfriend through her divorce attorney, Golda Jacob, who is 39-year-old Leon's mother.\nThe two face a possibility of life behind bars for a felony charge of solicitation of capital murder.\nThe Houston Police Department says the boyfriend and girlfriend hired a man - who happened to be an undercover cop - to 'take care' of her ex-husband and his ex-girlfriend.\nPolice even staged the murders with the intended victims' help to see if the pair would pay for them.\nThe former partners posed for photographs pretending to be dead and they were sent to the suspects as proof of their murders.\nJacob's ex-girlfriend pretended to have been kidnapped, gagged and murdered while McDaniel's ex-husband posed as though he'd been shot in a carjacking.\nThe couple was arrested afterwards when they handed over $20,000 cash and offered to also pay with two Cartier watches, Click 2 Houston reports.\nJacob (right) allegedly wanted his former partner killed to stop her from testifying against him in court where he was already facing stalking charges. McDaniel pictured on the left\nJacob allegedly wanted his former partner killed to stop her from testifying against him in court where he was already facing stalking charges filed by her before their break-up.\nShe said he assaulted her in January and continued to contact her until he was eventually arrested on February 6.\nBefore returning to court, he solicited an associate to help him find a hit man. That associate is a confidential informant and told police who asked him to arrange a meeting.\nPolice say McDaniel told the cop she wanted him to 'take care' of her ex-husband\nThey met in an Olive Garden restaurant by the side of the speedway to plot the killing, Harris County District's Attorney's office told DailyMail.com.\nMcDaniel attended it too to ask the man if he would also kill her ex-husband.\nAfter the meeting, crime experts made contact with the intended victims to arrange the staged photographs.\n'The photos were created by seasoned crime-scene veterans to use as proof that the deeds had been done- the first victim murdered in a car jacking gone bad and the second kidnapped, tied up and ready for execution,' Dane Schiller of the District Attorney's Office said.\nNeither of the intended victims has spoken publicly of the attempts on their lives.","url":"https://www.dailymail.co.uk/news/article-4320580/Vet-released-bail-trying-ex-killed.html"}
