{"authors":[],"date_download":"2018-10-30 21:03:52","date_modify":"2018-10-30 21:03:52","date_publish":"2016-12-29 22:16:00","description":"Charles Dean Hughes was cremated when he died in 2001, and his remains were among the items left in a storage unit. He served in Vietnam.","filename":"data/vaneerConsumption/Vettoreceiveproperburialafterremainsfound.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/29/Images/ganationalcemetery.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_vet-receive-proper-burial-after-remains-found__1540933432.html","title":"Vet to receive proper burial after remains found","title_page":"Georgia Marine veteran to receive military burial after remains found","title_rss":"NULL","source_domain":"ajc.com","text":"After his cremated remains were found, a Marine corporal and Vietnam veteran will be buried at the Georgia National Cemetery in Cherokee County, officials said.\nThe situation regarding Charles Dean Hughes, who died in 2001, came to light Dec. 8 when a local American Legion Post member contacted the Cherokee Marshal’s Office, Chief Marshal Ron Hunton said Thursday.\nThe American Legion member, Jim Lindenmayer, said he was contacted by a storage rental company after a relative of the dead veteran did not pay the bill and the contents of the storage unit were removed.\nDespite repeated attempts, Hughes’ relative did not meet with Lindenmayer to retrieve the remains, Hunton said. Lindenmayer contacted a local funeral home and was directed to the Cherokee Marshal’s Office.\nThe burial is scheduled for noon Wednesday at the cemetery in Canton.\n“I’m thankful Mr. Lindenmayer and Mr. (Brian) Poole (of the funeral home) reached out to us and we were able to bring Marine Corporal Hughes home to his military family,” Hunton said.\nHughes was believed to be 54 when he died, according to an obituary in The Atlanta Journal-Constitution. His military service was from 1967 to 1971. Hughes is believed to have lived locally in Hall and Lumpkin counties.\nHughes was a flight engineer with awards that include a National Defense Service Medal, according to material obtained by the marshal’s officials.\nPoole’s Funeral Home of Woodstock is donating services for the burial.","url":"https://www.ajc.com/news/local/vet-receive-proper-burial-after-remains-found/vixo299toZ7UllySVsE1gJ/"}
