{"authors":[],"date_download":"2018-10-22 22:12:54","date_modify":"2018-10-22 22:12:54","date_publish":"2014-05-09 13:11:00","description":"The suit said the \"minimal\" shoe company's medical claims were bare of scientific backing.","filename":"data/vaneerConsumption/VibramFiveFingerShoesGiveRefundsOverAllegedlyBareHealthClaims.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/431551/vibram_75b7022ca358dc9b09b96a5ed55c8b65.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_vibram-fivefinger-shoes-give-refunds-over-allegedly-bare-health-claims-n101301_1540246374.html","title":"Vibram FiveFinger Shoes Give Refunds Over Allegedly Bare Health Claims","title_page":"Vibram FiveFinger Shoes Give Refunds Over Allegedly Bare Health Claims","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThere might be more to squint at about Vibram FiveFinger shoes than how they look as if you're walking around in a pair of tight gloves. Manufacturer Vibram USA Inc. has announced it would offer refunds to buyers to settle a class action lawsuit that said its health benefit claims went too far.\nIt's not live yet, but fivefingerssettlement.com is where buyers will be able to file claims. Once it comes online, valid claims are expected to be able to get between $20 and $50. Proof of purchase isn't required unless buyers submit claims for more than two pairs.\nThe lawsuit asserted that Vibram misrepresented health research to advertise that its shoes, which are designed to mimic barefoot running, improved posture, strengthened muscles and reduced injuries. Were it not for for these claims, the suit filed March 2012 said, consumers wouldn't have snatched up pairs. The shoes sold for $80-$125.\nVibram USA Inc. denied any wrongdoing.","url":"https://www.nbcnews.com/business/consumer/vibram-fivefinger-shoes-give-refunds-over-allegedly-bare-health-claims-n101301"}
