{"authors":["Lucy Mapstone","Joanna Crawley For Mailonline"],"date_download":"2018-10-23 00:26:37","date_modify":"2018-10-23 00:26:37","date_publish":"2016-01-29 13:21:30","description":"Vicky Pattison certainly looks confident while showing off her hard-earned figure in a new photoshoot, drawing attention to her fantastic physique and showing off her sexier side.","filename":"data/vaneerConsumption/VickyPattisonflauntsherincrediblefigureinsexysportswear.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B2550A00000578-0-image-a-28_1454073100824.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422687_I-want-feel-good-lash-Vicky-Pattison-flaunts-incredible-figure-sexy-sportswear-admits-struggle-healthy-lifestyle_1540254397.html","title":"Vicky Pattison flaunts her incredible figure in sexy sportswear","title_page":"Vicky Pattison flaunts her incredible figure in sexy sportswear | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's as famous for her fantastic figure and huge weight loss efforts as she is for her outspoken nature and recent I'm A Celebrity win.\nAnd Vicky Pattison certainly looks confident while showing off her hard-earned figure in a new photoshoot, drawing attention to her fantastic physique and showing off her sexier side.\nThe 28-year-old sizzled in a seriously sexy and sporty cut-out bra top, her ample cleavage highlighted with the strappy design.\nScroll down for video\nStunning: Vicky Pattison looked incredible in a skimpy and very sexy sports bra and high-waisted pants combination as she posed in a new photoshoot\nShe showed off her toned midriff, too, teaming the stylish bra top with a pair of skintight high-waisted white briefs, also revealing a glimpse of her lithe thighs.\nThe sporty look was finished with a pair of black weight-lifting gloves on her hands - complete with a glamorous manicure - and her brunette locks in a damp, messy curly style.\nThe I'm A Celebrity champion oozed a sultry demeanour as she gazed into the camera, her eyes lined with a heavy smoky amount of shading.\nAnother striking photo showed Vicky rocking a more gym-appropriate look, showing off more of her lightly toned tum in a pair of tiny black shorts and a grey crop top.\nShowing what she's got: The former Geordie Shore star, 28, showed off her toned, honed figure in the smoking hot shoot, leaving very little to the imagination\nVicky famously shed three stone over the years, going from a size 16 to a tiny size 6 for her famous weight loss DVD, before going back up to a healthy, lean and shapely size 8.\nAnd she has confessed to having undergone breast enlargement surgery following such drastic yet amazing weight loss, taking her from a 32B to an ample 32D.\nMeanwhile, reality TV star Vicky - who, along with her many other jobs has just launched her brand new on-demand lifestyle and fitness subscription service, Mini V Nutrition - has admitted that losing weight isn't all that easy, despite how well she succeeded.\nShe also added, rather realistically, that she wants to be able to have some blow-out nights while still losing weight.\nPose and pout: Vicky shared a rather busty behind-the-scenes snap as she took part in a sexy shoot on Friday\nHard-earned: Over the years, Vicky has gone from a size 16 to a 6, and to a healthy 8, and is proud to flaunt her wares\n'Getting in shape is hard work!' she confessed to MailOnline, adding that fitting in the exercise while having a busy and active social life is daunting.\n'You've got to drag yourself off to the gym, you've got to get out the car, you've got to get your gym gear on, you've got to get back.\n'Going to the gym can take around two hours of your day really,' she pointed out.\nVicky is now working hard on her brand new on-demand lifestyle and fitness subscription service, Mini V Nutrition, which she says can help out women who are struggling with the weight loss and life balance.\n'So let's make this easier for women... We're just eliminating every single excuse a woman can have for exercising,' she said.\nShe loves a boozy night! Vicky admitted that, while she wants to stay looking amazing, she does want to be able to 'go out on the lash' with friends too - she was seen letting loose at the recent National TV Awards\nEy up: She cut a demure figure at the London-based awards, showing off her stunning figure in a white dress, before kicking back after the ceremony\n'My main problem, and I'm sure women everywhere will be able to identify with this, is number one not having enough time and secondly I get bored. There's nothing worse than being on a diet that eliminates certain food groups or things from your life.\n'It's wanting to have a life as well. I want to look good in my clothes, I want to feel confident but at the same time I want to go out on the lash with my friends.\n'Or I want to have dinner with a boy every so often. As girls we're far too hard on ourselves and there's not enough options out there for women to take a convenient route.'\nIt's no surprise, as Vicky earned a reputation as a party girl during her time on MTV's Geordie Shore.\nCelebrate! Vicky celebrated I'm A Celebrity's amazing win with her jungle co-stars last Wednesday at the awards\nAnd, even now, although she maintains a mostly healthy lifestyle in order to keep her figure in check, she is known for her love of a good night out, rocking a variety of tiny body-skimming dresses while letting loose.\nAt the recent National TV Awards, Vicky celebrated hard when I'm A Celebrity won the Entertainment Programme prize.\nShe was pictured looking gorgeous and demure on the red carpet, only to be then seen a few hours later necking wine and larking about doing funny poses along with her jungle co-stars.\nThe Vicky Pattison Mini V Nutrition on-demand fitness & lifestyle service is available from www.minivnutrition.com starting from £2.99 for lite membership and £3.99 for premium.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422687/I-want-feel-good-lash-Vicky-Pattison-flaunts-incredible-figure-sexy-sportswear-admits-struggle-healthy-lifestyle.html"}
