{"authors":["Sinead Maclaughlin For Daily Mail Australia"],"date_download":"2018-10-22 22:59:43","date_modify":"2018-10-22 22:59:43","date_publish":"2017-03-16 05:17:51","description":"Brooke Hubbard, 18, was left 'shaken and in tears' after a expletive-filled phone call from her boss at a Victorian restaurant in which he calls her names and eventually fires her.","filename":"data/vaneerConsumption/Victoriandinerworkerleftintearsafterangrycall.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E51DEA400000578-0-image-a-16_1489640587702.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318900_Victorian-diner-worker-left-tears-angry-call_1540249183.html","title":"Victorian diner worker left in tears after angry call","title_page":"Victorian diner worker left in tears after angry call | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A young restaurant worker was left 'shaken and in tears' after a expletive-filled phone call from her boss in which he calls her names and eventually fires her.\nBrooke Hubbard, 18, had just returned from her break at the Big Dog Diner in Frankston, Victoria, on Tuesday when she received the shocking phone call.\n'You know what I was saying the other day ... a picture says more than a thousand words,' he can be heard in the footage.\n'Do you know how often people f****ng try to bulls*** me, thinking that I am as dumb as they f****ng are?'\nBrooke Hubbard, 18, was left 'shaken and in tears' after a expletive-filled phone call from her boss in which he calls her names and eventually fires her\nThe cause for the furious phone call came after the manager had tried to phone the diner, but his calls went unanswered.\n'How many times do you think I've rung the diner in the last 45 minutes?' he asked her.\nThe 18-year-old, who had been working at the diner for two years, told Daily Mail Australia that she had returned from her break when she noticed a missed call on her mobile phone.\n'I ignored the first call, as he had asked us not to touch mobile phones - but then he called again.'\nDuring the initial conversation, Ms Hubbard found that the diner phone was off the hook which explained the missed calls, so she contacted her boss again to clarify.\n'He called me a liar and said I had did it [left the phone off the hook] on purpose.'\nIt was here that the 18-year-old begin filming their conversation.\nIn the recording, Ms Hubbard can be heard saying she was now cleaning the diner after returning from her break, but her boss claims he saw her doing nothing on the CCTV.\n'I've called 15 f****ng times and nobody answered,' he says.\n'It's been a real f****ng pleasure knowing you. You're gone! You're out!'\nIn response an upset Brooke says: 'Now? So I don't have a job?'.\nHe then questions why he is paying her she she 'does nothing'.\nIn the recording, Ms Hubbard can be heard saying she was now cleaning the diner after returning from her break, but her boss claims he saw her doing nothing on the CCTV\nMs Hubbard and the other workers were called 'c***s' and the boss tells her she will stay 'low paid' and following the same path as other 'dips***s'\nHis rant continues, calling Ms Hubbard and the other workers 'c***s' and tells her she will stay 'low paid' and following the same path as other 'dips***s'.\nBut the 18-year-old defends herself saying: 'I've literally just come in, I've mopped the floor, I've cleaned out the front, I'm doing the napkins, I've done dishes.'\nEven though the conversation left her shaken, Ms Hubbard managed to finish her shift and left the restaurant just after 11.30pm.\nThere had been three others working that night along with Ms Hubbard, one who overheard the call said she had received a similar one just a few days prior that had left her in tears.\n'He's always had that type of personality,' Ms Hubbard told Daily Mail Australia.\n'It was exhausting working there. In a way it's good what's happened, it's been a real eye opener.'\nDaily Mail Australia has contacted Big Dog Diner for comment\nAfter posting the video online, the 18-year-old's shocking experience has quickly gone viral.\n'I've had so much support from people since the posted the video, it's been really great,' Ms Hubbard said.\nDaily Mail Australia has contacted Big Dog Diner for comment.","url":"https://www.dailymail.co.uk/news/article-4318900/Victorian-diner-worker-left-tears-angry-call.html"}
