{"authors":[],"date_download":"2018-10-22 22:05:54","date_modify":"2018-10-22 22:05:54","date_publish":"2014-05-08 22:37:50","description":"All four members of a family that died in a fire at the Florida home of tennis star James Blake were shot, authorities confirmed on Thursday.","filename":"data/vaneerConsumption/VictimsinDeadlyTampaFireatJamesBlakeHomeWereShot.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/428741/avila-ejo-50714_b39db60115ed6ddb8aca90f0f53d672d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_victims-deadly-tampa-fire-james-blake-home-were-shot-n100846_1540245954.html","title":"Victims in Deadly Tampa Fire at James Blake Home Were Shot","title_page":"Victims in Deadly Tampa Fire at James Blake Home Were Shot","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAll four members of a family that died in a fire at the Florida home of professional tennis player James Blake were shot, authorities confirmed on Thursday evening — and the father had recently bought a lot of fireworks and gasoline.\nDarrin Campbell, his wife Kimberly and their two teenagers are believed to have died in the blaze on Wednesday morning, surrounded by fireworks and gasoline. The medical examiners' office still hasn't made a final determination of the victim's identities.\nAt a press conference Thursday, Col. Donna Lusczynski, with the Hillsborough County Sheriff’s Office, said that all four victims had gunshot wounds, but didn't say where.\nOn Wednesday, officials had said that the victims \"were found with upper-body trauma.\"\nLusczynski also announced Thursday evening that Darrin Campbell had purchased \"an exceedingly large amount of fireworks\" on Saturday, and also purchased \"several cans of gas that same day\" at a local Home Depot.","url":"https://www.nbcnews.com/news/us-news/victims-deadly-tampa-fire-james-blake-home-were-shot-n100846"}
