{"authors":["Lucy Mapstone For Mailonline"],"date_download":"2018-10-23 02:03:43","date_modify":"2018-10-23 02:03:43","date_publish":"2016-01-28 16:47:56","description":"Victoria Beckham opted for a more colourful ensemble while looking forward to spring as she stepped out in London on Thursday.","filename":"data/vaneerConsumption/VictoriaBeckhamshrugsoffwinterinacolourfulprinteddress.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACCE4200000578-0-image-a-13_1454005554218.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421299_Victoria-Beckham-swaps-usual-black-attire-fresh-colourful-printed-dress-attends-art-exhibition_1540260223.html","title":"Victoria Beckham shrugs off winter in a colourful printed dress","title_page":"Victoria Beckham shrugs off winter in a colourful printed dress | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"But Victoria Beckham swapped her trademark black clothing for something a little more colourful while looking forward to spring as she stepped out in London on Thursday.\nThe 41-year-old fashion designer was seen emerging from Sotheby's in the British capital after attending The Nude in the XXth and XXIst Century exhibition.\nNo doubt the pretty brunette got an eyeful of some of the curvaceous nudes on offer at the London art exhibition.\nScroll down for video\nSpring is coming: Victoria Beckham looked gorgeous in colourful dress as she emerged from Sotheby's in London after attending The Nude in the XXth and XXIst Century exhibition on Thursday\nBest selling: Victoria no doubt used her superstar powers to get a belated glimpse into the hugely popular exhibition which wrapped up earlier this month, after opening in November\nShe covered her slender frame in a pretty printed shirt dress that fell down to her mid-calf, her slim waistline accentuated thanks to the fitted middle.\nThe gorgeous garment - a bright and breezy style departure for the star - was decorated with deep blue, orange and pink circular print, that from afar looked like cartoon-esque flowers.\nKeeping it painfully chic and effortless, the leggy star teamed the lovely dress with a pair of deep purple stiletto heels with a high back, adding an aspirational and fashion-forward touch to the footwear.\nSee more of the latest on Victoria Beckham as she steps out in a pretty printed dress\nBig change: The 41-year-old is a huge fan of all-black and monochrome ensembles, so her look on Thursday was a delightful departure from the norm\nA lovely look: She covered her slender frame in a pretty printed shirt dress that fell down to her mid-calf, her slim waistline accentuated thanks to the fitted middle\nHer brunette dresses appeared to have grown longer than ever as they were worn loose and tumbling over her shoulders, which she kept uncovered with a coat, braving the chilly late January weather.\nAnd, of course, the pretty singer-turned-designer wore a pair of her signature oversized sunglasses, shielding much of her face from view.\nShe appeared to have gone along to the prestigious auction space for business, as she carried in her hand a programme from the art exhibition; her phone in the other.\nHolding on: She appeared to have gone along to the prestigious auction space for business, as she carried in her hand a programme from the art exhibition; her phone in the other\nFloral fancy: Her brunette dresses appeared to have grown longer than ever as they were worn loose and tumbling over her shoulders, which she kept uncovered with a coat, braving the chilly late January weather\nVictoria no doubt used her superstar powers to get a belated glimpse at the hugely popular exhibition which wrapped up earlier this month, after opening in November.\nThe Nude in the XX & XXI Century, curated by Jane Neal, exhibits artists throughout time who use the naked body to consider the place of the human form in historic cultural landscapes.\nArtists included in the exhibition include Robert Fry, Marina Abromovic and Armin Boehm.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421299/Victoria-Beckham-swaps-usual-black-attire-fresh-colourful-printed-dress-attends-art-exhibition.html"}
