{"authors":["Julia Pritchard For Mailonline"],"date_download":"2018-10-23 03:08:30","date_modify":"2018-10-23 03:08:30","date_publish":"2017-03-10 12:33:23","description":"The fashion designer, 41, took to her Snapchat on Friday to poke fun at her oldest child, by sharing a candid snap of him having a snooze on a train.","filename":"data/vaneerConsumption/VictoriaBeckhampokesfunatsleepingsonBrooklyn.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22AB4800000578-0-image-a-183_1489148730740.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301124_Victoria-Beckham-pokes-fun-sleeping-son-Brooklyn_1540264110.html","title":"Victoria Beckham pokes fun at sleeping son Brooklyn","title_page":"Victoria Beckham pokes fun at sleeping son Brooklyn | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He recently turned the milestone age of 18, and embarked on a whole range of celebrations with his friends and family.\nBut Brooklyn Beckham's new party lifestyle perhaps began to take its toll on Friday, as he couldn't resist a quick nap while travelling with his mother Victoria.\nThe fashion designer, 41, took to her Instagram to poke fun at her oldest child, by sharing a candid snap of him having a snooze on a train out of London.\nScroll down for video\n'He's a laugh': Brooklyn Beckham's new party lifestyle perhaps began to take its toll on Friday, as he couldn't resist a quick nap while travelling with his mother Victoria\nIn the funny snap, the new adult is seen resting with his head back and eyes closed on his seat as he embarks on the long journey.\nLooking every inch the budding photographer with his retro camera in front of him, the youngster also kept his earphones in to properly zone out during the trip.\nPoking fun at her uninterested company, his mother Victoria then shared the photo to her Instagram story with the playful caption: 'He's a laugh!'\nNot impressed: Poking fun at her uninterested company, his mother Victoria then shared the photo to her Instagram story with the playful caption: 'He's a laugh!'\nThe brunette implied the pair were heading back to Paris for a short stint by sharing another image of Brooklyn with his suitcase, emblazoned with the words 'Au revoir London!'\nLooking typically stylish in an all-black sporty tracksuit, the youngster also displayed his chunky arm sling - which he has had to maintain since his family skiing trip in February.\nBrooklyn had suffered a nasty fall during a snowboarding session early on in their trip in Whistler, Canada, resulting in a broken collar bone.\nThe teen announced the news by uploading a video of himself on Instagram performing several tricks on the slopes, gliding across the very edge of the mountain in a daring effort.\nYet things soon go awry for keen skater Brooklyn, as his final landing saw him lose balance and descend into a severe tumble across the snow.\nHours later after an undoubtedly painful time in hospital, he shared an image of his X-Ray - displaying his collar bone ripped apart to concerned fans, putting him out of action for the majority of the trip.\nClearly looking forward to warmer climes, the 18-year-old went on to post an image of a beach in Los Angeles in light of his injury.\nBring on summer: The 18-year-old went on to post an image of a beach in Los Angeles in light of his injury - sparking rumours he had reunited with his ex Chloe Moretz\nHowever, many fans then took this as a hint that he had reunited with his former flame Chloe Moretz, 20.\nThe photo featured a blonde individual in the foreground, and was captioned 'Can't wait till May'.\nWhile it is hard to identify who is in the photo, Brooklyn's ex Chloe speedily 'liked' the shot and also added a comment with a half moon emoji.\nChloe then added fuel to the fire when fans noticed she had shared her own cryptic photo on Sunday, showing two hands intertwined and captioned with the same half moon emoji she used on Brooklyn's post.\nThe pair, who first began dating last May, could be hinting at a reunion after confirming their split in September - with Brooklyn returning to the UK with his family.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301124/Victoria-Beckham-pokes-fun-sleeping-son-Brooklyn.html"}
