{"authors":["Jason Chester","Julia Pritchard For Mailonline"],"date_download":"2018-10-23 03:44:28","date_modify":"2018-10-23 03:44:28","date_publish":"2017-03-10 13:27:56","description":"The celebrated fashion designer colour blocked with typical élan in a crisp blue dress shirt and sweeping maroon skirt as she sashayed across the picturesque city’s Gare Du Nord station.","filename":"data/vaneerConsumption/VictoriaBeckhamdonssemisheerskirtinParis.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E230E0C00000578-0-image-a-90_1489152576699.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301250_Victoria-Beckham-catches-eye-semi-sheer-skirt_1540266268.html","title":"Victoria Beckham dons semi-sheer skirt in Paris","title_page":"Victoria Beckham dons semi-sheer skirt in Paris | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She enjoyed a light-hearted prank at the expense of her oldest boy as they journeyed to Paris on Friday morning, but it was business as usual for Victoria Beckham following their arrival in the French capital.\nThe celebrated fashion designer colour blocked with typical élan in a crisp blue dress shirt and sweeping maroon skirt as she sashayed across the picturesque city’s Gare Du Nord station.\nWith a subtle sheer detail the bold pleated design ensured Victoria, 42, stood out while making her way outside with 18-year old son Brooklyn and a troupe of burly security guards.\nScroll down for video\nHere they come: Victoria Beckham was joined by oldest son Brooklyn as she arrived in Paris on Friday morning\nThe former Spice Girl continued a rather tasteful colour scheme with a pair of matching leather boots, while obligatory sunglasses shielded her eyes as she ventured towards a waiting car.\nAccessorizing tastefully, Victoria added to her ensemble with a maroon handbag, safely tucked beneath her right arm.\nWalking alongside his stylish mother, Brooklyn looked comparatively casual in a vintage Kappa tracksuit top and skinny jeans.\nLooking good: The celebrated fashion designer colour blocked with typical élan in a crisp blue dress shirt and sweeping maroon skirt as she sashayed across the picturesque city’s Gare Du Nord station\nElegant: With a subtle sheer detail the bold pleated design ensured Victoria, 43, stood out upon her arrival in the French capital\nSide by side: The designer had good company in the form of her oldest boy as she exited the station\nAfter breaking his collar bone while snowboarding, Brooklyn protected his maimed arm with a black sling that easily blended with his sporty top.\nBrooklyn suffered a nasty fall during a snowboarding session early on in their trip to Whistler, Canada.\nAs always the aspiring photographer's trusty camera was slung across on shoulder, while a luxurious Louis Vuitton travel bag was clutched in his right hand.\nYou're surrounded: Mother and son were flanked by security guards following their arrival\nCasual: Walking alongside his stylish mother, Brooklyn looked comparatively casual in a vintage Kappa tracksuit top and skinny jeans\nFinishing touches: Brooklyn completed his look with a baseball cap and suede Chelsea boots\nHe's got baggage: The teenager carried some of his belongings in a luxurious Louis Vuitton travel bag\nOn their way: The trip to Paris may well be a birthday gift to Brooklyn, who turned 18 on March 4\nLittle more than an hour earlier Victoria took to her Instagram to poke fun at her oldest child by sharing a candid snap of him having a snooze on a train out of London.\nIn the funny snap, the new adult is seen resting with his head back and eyes closed on his seat as he embarks on the long journey.\nLooking every inch the budding photographer with his retro camera in front of him, the youngster also kept his earphones in to properly zone out during the trip.\nFeeling better: The youngster also displayed his chunky arm sling - which he has had to maintain since his family skiing trip in February\nPainful: Brooklyn had suffered a nasty fall during a snowboarding session early on in their trip in Whistler, Canada, resulting in a broken collar bone\nBonjour! Mother and son were arriving in Paris just days after its biannual Fashion Week derw to a close\nFlying visit? It is not clear how long Victoria and Brooklyn are staying in Paris for\nTop mum: Victoria had suggested the pair were heading back to Paris for a short stint by sharing an image of Brooklyn with his suitcase, emblazoned with the words 'Au revoir London!'\nPoking fun at her uninterested company, his mother Victoria then shared the photo to her Instagram story with the playful caption: 'He's a laugh!'\nThe brunette implied the pair were heading back to Paris for a short stint by sharing another image of Brooklyn with his suitcase, emblazoned with the words 'Au revoir London!'\nThe teen announced the news by uploading a video of himself on Instagram performing several tricks on the slopes, gliding across the very edge of the mountain in a daring effort.\nHint of a smile: Victoria seemed relaxed as she later stepped out in Paris alone\nStomping the streets: The former Spice Girl looked as stylish as ever for her trip to Paris, keeping to a tasteful burgundy colour scheme\nVB: The busy mother-of-four was seen on her phone as she did a spot of shopping in the French capital\nShopping spree: Victoria was seen looking at the handbags in a boutique while in Paris\nParisian flavour: The designer appeared to be enjoying the shops on offer in the capital\nGoing solo: She stepped out without Brookyln as she did a spot of shopping in the capital\nCovering up: Victoria wore her obligatory sunglasses as she enjoyed an afternoon in Paris\nYet things soon go awry for keen skater Brooklyn, as his final landing saw him lose balance and descend into a severe tumble across the snow.\nHours later after an undoubtedly painful time in hospital, he shared an image of his X-Ray - displaying his collar bone ripped apart to concerned fans, putting him out of action for the majority of the trip.\nClearly looking forward to warmer climes, the 18-year-old went on to post an image of a beach in Los Angeles in light of his injury.\nHowever, many fans then took this as a hint that he had reunited with his former flame Chloe Moretz, 20.\nThe photo featured a blonde individual in the foreground, and was captioned 'Can't wait till May'.\n'He's a laugh': Brooklyn's new party lifestyle perhaps began to take its toll on Friday, as he couldn't resist a quick nap while travelling with his mother Victoria\nNot impressed: Poking fun at her uninterested company, Victoria then shared the photo to her Instagram story with the playful caption: 'He's a laugh!'\nWhile it is hard to identify who is in the photo, Brooklyn's ex Chloe speedily 'liked' the shot and also added a comment with a half moon emoji.\nChloe then added fuel to the fire when fans noticed she had shared her own cryptic photo on Sunday, showing two hands intertwined and captioned with the same half moon emoji she used on Brooklyn's post.\nThe pair, who first began dating last May, could be hinting at a reunion after confirming their split in September - with Brooklyn returning to the UK with his family.\nBring on summer: The 18-year-old went on to post an image of a beach in Los Angeles in light of his injury - sparking rumours he had reunited with his ex Chloe Moretz","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301250/Victoria-Beckham-catches-eye-semi-sheer-skirt.html"}
