{"authors":["Caroline May"],"date_download":"2018-10-30 22:16:21","date_modify":"2018-10-30 22:16:21","date_publish":"2015-07-14 22:19:48","description":"Senate Judiciary Committee Chairman Chuck Grassley has invited the family members of victims of illegal immigrant crimes to testify.","filename":"data/vaneerConsumption/VictimsOfIllegalImmigrantCrimeToTestifyBeforeCongress.json","image_url":"https://media.breitbart.com/media/2015/07/Steinle-Parents-713-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_14__1540937781.html","title":"Victims Of Illegal Immigrant Crime To Testify Before Congress","title_page":"Victims Of Illegal Immigrant Crime To Testify Before Congress | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Senate Judiciary Committee Chairman Chuck Grassley (R-IA) says he has invited the family members of victims of illegal immigrant crimes to testify before Congress.\nAccording to the Iowa lawmaker, the hearing will examine the breakdown of immigration enforcement under the Obama administration and the repercussions of lax immigration enforcement — specifically the impact on families victimized by illegal immigrant crime.\n“Congress has a constitutional responsibility to conduct oversight of the executive branch of government to make sure the laws are being faithfully executed and carried out as intended. Little oversight has been done by the previous majority to ensure the administration is exercising sound judgment and acting within the immigration laws. It’s clear they have taken far too much liberty and are essentially trying to write the laws themselves,” Grassley said in a statement.\nThe hearing will be next Tuesday. In addition to victimized families Grassley says he has also invited the Director of Immigration and Customs Enforcement Sarah Saldana, and the Director of Citizenship and Immigration Services Leon Rodriguez to testify.\n“This hearing is intended to highlight how misguided the Obama administration’s lax enforcement policies are and how these policies are putting Americans in harm’s way,” he said.\nThe hearing comes on the heels of the recent murder of a young woman in the sanctuary city of San Francisco, allegedly by an illegal immigrant with a long rap sheet and multiple deportations.","url":"https://www.breitbart.com/politics/2015/07/14/victims-of-illegal-immigrant-crime-to-testify-before-congress/"}
