{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:55:12","date_modify":"2018-10-30 20:55:12","date_publish":"2015-11-05 21:19:11","description":"Byron Price says he now views concealed carry \"differently\" and wants to get a permit to carry a gun.","filename":"data/vaneerConsumption/VictiminUCMassStabbingNowSupportsConcealedCarry.json","image_url":"https://media.breitbart.com/media/2015/11/Byron-Price-Facebook.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_11_05__1540932912.html","title":"Victim in UC Mass Stabbing Now Supports Concealed Carry","title_page":"Victim in UC Mass Stabbing Now Supports Concealed Carry","title_rss":"NULL","source_domain":"breitbart.com","text":"Byron Price, the construction worker who intervened to save a student under attack at University of California Merced on November 4, says he now views concealed carry “differently” and wants to get a permit to carry a gun.\nBreitbart News previously reported that Merced Couty Sheriff Vern Warnke identified Wednesday’s mass stabber as 18-year-old Faisal Mohammad, a freshman from Santa Clara. Warnke also said that if hadn’t been for Bryon Price’s intervention, Mohammad’s first stabbing victim might have been killed.\nAccording to Your Valley Central, Price was able to drive himself home from the hospital hours after being stabbed near his waistline–but he drove with “nine staples” holding the wounds together.\nPrice was on campus for a remodeling project and came into contact with the mass stabber while investigating noises. As it turned out, the noises were tied to Mohammed attacking his first victim.\nPrice said, “I went to open the door–to break it up and see if everybody was okay–and they all screamed ‘run’ when I opened the door.” The next thing Price knew was that a “suspect wearing a black hooded-sweatshirt comes charging at him with a butcher knife.”\nPrice said he kept kicking at Mohammad to keep him from getting close enough to stab into an organ, yet even at a distance the mass stabber was able to slit portions of Price’s waistline.\nLooking back on the experience, Price said, “He now thinks differently about having a concealed weapon” and he “wishes he had one while…[the mass stabbing] unfolded.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2015/11/05/victim-uc-merced-mass-stabbing-flip-flops-now-supports-concealed-carry/"}
