{"authors":["Rebecca Davison For Mailonline"],"date_download":"2018-10-23 01:54:58","date_modify":"2018-10-23 01:54:58","date_publish":"2017-04-26 12:40:21","description":"She's known for her love of the bikini and Swedish model and socialite Victoria Silvstedt flaunted her impressive figure when she headed out on Tuesday night.","filename":"data/vaneerConsumption/VictoriaSilvstedtwearsgoldcoordinNewYork.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F6CFB00000578-0-image-a-37_1493208335298.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447446_Victoria-Silvstedt-wears-gold-ord-New-York_1540259698.html","title":"Victoria Silvstedt wears gold co-ord in New York","title_page":"Victoria Silvstedt wears gold co-ord in New York | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's known for her love of the bikini and Swedish model and socialite Victoria Silvstedt flaunted her impressive figure when she headed out on Tuesday night.\nThe 42-year-old showed off her abs at the New Yorker's For Children's charity gala, held at the Mandarin Oriental.\nLooking younger than her years, she wore a gold knitted bralet which she teamed with a matching pencil skirt as she posed on the red carpet.\nScroll down for video\nGold and Silv-stedt! Socialite Victoria showed off her impressive abs in a metallic knitted bra top and matching fitted pencil skirt at charity event in NY on Tuesday night\nLooking good: The 42-year-old showed off her abs at the New Yorker's For Children's charity gala, held at the Mandarin Oriental\nHer blonde locks were perfectly blow-dried as they cascaded down past her shoulders.\nLarge chandelier earrings added a further touch of glamour to her ensemble, as she walked tall in a pair of nude studded Valentino heels.\nVictoria appeared in high spirits as she was pictured heading to the venue.\nWalking tall: Victoria appeared in high spirits as she was pictured heading to the venue\nWith a huge smile on her face, she concealed her outfit with a beige coloured trench coat which complemented her golden tan.\nShe carried a clutch bag in her hand, as well as a silver and grey silk scarf for a touch of added class.\nVictoria represented her country in the Miss World pageant in 1993 but admits her career hasn't always been an easy ride.\nSpeaking to Female First previously, Victoria previously said: ‘I started very young to model in Paris when I was 18.\nShe said: 'I remember like starving myself to fit into the clothes and it was an amazing experience but you know I did shows for Valentino, Chanel, so it was really prestigious.\n‘But it never felt like it was my thing, I'm not like a runway skinny model, I'm more curvy. It was torture, I put myself through starvation, you know torturing myself.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447446/Victoria-Silvstedt-wears-gold-ord-New-York.html"}
