{"authors":["Lauren Sharkey"],"date_download":"2018-10-31 01:46:27","date_modify":"2018-10-31 01:46:27","date_publish":"2018-09-14 13:02:23","description":"Knowing the ins and outs of a celebrity's life is something most of us — OK, maybe all of us — love. So when a super famous person divulges the mundane details of their everyday lives, the world laps it up. A new interview revealing exactly what…","filename":"data/vaneerConsumption/VictoriaBeckhamsDowntimeSoundsFarLessGlamThanYoudImagine.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/4532b963-9dfb-4f6f-be68-38af9d638171-vb.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_victoria-beckhams-downtime-sounds-far-less-glam-than-youd-imagine-11916795_1540950387.html","title":"Victoria Beckham's Downtime Sounds Far Less Glam Than You'd Imagine","title_page":"Victoria Beckham's Downtime Sounds Far Less Glam Than You'd Imagine","title_rss":"NULL","source_domain":"bustle.com","text":"Knowing the ins and outs of a celebrity's life is something most of us — OK, maybe all of us — love. So when a super famous person divulges the mundane details of their everyday lives, the world laps it up. A new interview revealing exactly what Victoria Beckham does in her downtime has caused this precise reaction. Well, from me anyway.\nWhile I've always been a fan of Beckham (especially for her constant refusal to smile in public), the fashion designer's recent Vogue video amped up my obsession. Proving that she's funny and down-to-earth in equal measure, I and many others couldn't wait to hear more from her.\nSeeing as the 44-year-old is returning her fashion brand to London this month, the Evening Standard felt it was a good time to ask Beckham all about her London loves and memories. And surprisingly, she revealed a lot about herself.\nWhen asked where she went to let her hair down, Beckham joked that she doesn't, telling the magazine: \"I'm a robot! If I do, then it's usually at someone's house with good wine.\" A woman after my own heart, I see. She also proved that her time in America hasn't changed her drinking habits, saying that the first thing she does when she returns to the UK is \"put the kettle on for a proper cup of tea.\"\nIf you're obsessed with VB and want to see her IRL, she also opened up about the places she frequents in the capital. Admitting that she's \"not much of a pub person,\" the chief member of the coolest family around said that her favourite is The Cow in Westbourne Park. \"I like the atmosphere,\" she commented. Duly noted, VB.\nClarette — a restaurant and wine bar in Marylebone — is another one of Beckham's favourite haunts along with Italian restaurant Riva in Barnes. Apparently, the entire Beckham family regularly go to the latter so keep a look out.\nOther interesting revelations from the designer included her crystal collection (\"I have too many to count,\" she told the magazine), her passion for more cycle lanes, and the fact that she would totally buy Buckingham Palace if she could. Obviously.\nI don't know what else I was expecting but, aside from being invited to royal weddings and holidaying with Elton John, her life just seems so normal. Maybe I was looking for talk of dressing up in her former stage outfits or singing lessons or some sign that the Spice Girls were still alive in her.\nHowever, Beckham clearly forgot to mention her other favourite pastime: bizarre morning stretches. The designer's Instagram is full of those leg-up positions that clearly took years of work to perfect. Perhaps her time in the Spice Girls really did help after all.\nBeckham is currently in London preparing for her brand's 10th anniversary show on September 16. As soon as she takes her bow, she will rush off to her Dover Street store and take on a brand new profession: that of a humble sales assistant.\nFrom 3 p.m. sharp, the star will be behind the till selling her limited edition T-shirt which features her legs (what else?) spilling out of a giant Victoria Beckham carrier bag. The £115 design is available online but clicking \"buy\" is nowhere near as much fun as getting to chat to the designer in the flesh, don't you think?","url":"https://www.bustle.com/p/victoria-beckhams-downtime-sounds-far-less-glam-than-youd-imagine-11916795"}
