{"authors":[],"date_download":"2018-10-30 18:47:37","date_modify":"2018-10-30 18:47:37","date_publish":"2016-12-14 14:56:00","description":"DeKalb County CEO Burrell Ellis returned Wednesday as the county's leader for the remaining days until his term expires at the end of 2016.","filename":"data/vaneerConsumption/VictoriousDeKalbCEOBurrellEllistakescharge.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/14/Images/newsEngin.17138121_ellis.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_v_fc20a8f5280ae3e38cba17a572131666__1540925257.html","title":"Victorious DeKalb CEO Burrell Ellis takes charge","title_page":"Top elected official in one Georgia county back in office for 3 weeks","title_rss":"NULL","source_domain":"ajc.com","text":"A triumphant DeKalb County CEO Burrell Ellis retook his place atop the county’s government Wednesday for the remainder of his dwindling term that expires at the end of the year.\nEllis, speaking to a crowd of supporters and media outside county government headquarters in Decatur, said he felt vindicated that the Georgia Supreme Court overturned his convictions for attempted extortion and perjury.\nEllis had been suspended from office since July 2013 — most of his second term — while the charges were pending. He was reinstated as a result of the high court’s Nov. 30 ruling.\nHe pledged to work hard during his few days in office to prepare for CEO-elect Mike Thurmond to take over in January.\n\"We’re going to make you proud of this county,\" Ellis said. \"Why are we here? We’re here to finish the job we started. We said that we would make the citizens’ priorities the priorities of this county government, and we’re going to finish the job.\"\nAs a result of his reinstatement, Ellis will receive $222,556 in back pay, according to the county. His pay had been withheld since his conviction 17 months ago.\nEllis replaced Interim DeKalb CEO Lee May, who had been appointed by Gov. Nathan Deal for the job after Ellis was indicted.\nEllis said he doesn’t plan to fire anyone, though several employees have taken vacation or moved on to other county jobs.\nEllis served an eight-month prison sentence while the Supreme Court considered his appeal.\nA jury found Ellis guilty in July 2015 of trying to shake down a county contractor for campaign contributions and lying under oath about his role in government purchasing. The Supreme Court threw out the verdicts Nov. 30, finding that Ellis was denied a fair trial because he the judge didn’t allow him to solicit testimony from contractors who didn’t feel pressured to make political donations.\nIncoming DeKalb District Attorney Sherry Boston will have to consider whether to bring the case against Ellis to a retrial.\nPlease read the full story on MyAJC.com.","url":"https://www.ajc.com/news/local-govt--politics/victorious-dekalb-ceo-burrell-ellis-takes-charge/exaUgTMDrLyFhklB950yEK/"}
