{"authors":["Jennifer Russell For Daily Mail Australia"],"date_download":"2018-10-22 23:27:25","date_modify":"2018-10-22 23:27:25","date_publish":"2016-01-11 05:55:30","description":"Men in Victoria who rape children under the age of 12 are less likely to do jail time than those convicted of raping adults, statistics from the Sentencing Advisory Council reveal.","filename":"data/vaneerConsumption/Victoriamenwhorapechildrenunder12arelesslikelytospendtimeinjail.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/05/300542DA00000578-0-image-a-97_1452491741788.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393329_Men-rape-children-12-likely-spend-time-jail-convicted-raping-adult-women_1540250845.html","title":"Victoria men who rape children under 12 are less likely to spend time in jail","title_page":"Victoria men who rape children under 12 are less likely to spend time in jail | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Whereas during the same time, 91 per cent of convicted men were jailed for rape of an adult\nMen who rape children under the age of 12 are less likely to do jail time than those convicted of raping adults.\nThe statistics from Victoria's Sentencing Advisory Council have been revealed as the Court of Appeal and the state's Attorney-General carry out a review of baseline sentencing to ensure consistency.\nThe data concludes that between July 2009 and June 2014, 72 men were convicted in Victoria of sexually penetrating a child under the age of 12.\nMen who rape children under the age of 12 are less likely to do jail time than those convicted of raping adults (stock image)\nThe data concludes that between July 2009 and June 2014, 72 men were convicted in Victoria of sexually penetrating a child under the age of 12 (stock image)\nOf the 72 men, 53 (74 per cent) were jailed for a median length of time of four years.\nWhereas between the same time period, 211 men in Victoria were convicted of raping an adult of which 91 per cent - 193 people - were jailed.\nThe median jail time served for this offence was five years.\nBoth offences carry a maximum penalty of 25 years' in jail and/or a fine of 3000 penalty units.\nWithin the rape of a child younger than 12 category, the remainder of offenders served wholly suspended sentences (13 per cent), partially suspended sentences (three per cent), or community-correction orders (three per cent).\nThe other seven per cent either had their charges adjourned, received a youth justice centre order or a residential treatment order.\nThe advisory council will submit its findings to the Attorney-General Martin Pakula in April, and the public are welcome to include their views on baseline sentencing, which was brought in in 2014, before January 29.\nThe law review was announced in November by Mr Pakula who said it needed 'urgent attention' as the sentencing provisions are 'unworkable'.\nThe advisory council will submit its findings to the Attorney-General Martin Pakula (pictured) in April, and the public are welcome to include their views on baseline sentencing, which was brought in in 2014, before January 29\nBoth offences carry a maximum penalty of 25 years' in jail and/or a fine of 3000 penalty units","url":"https://www.dailymail.co.uk/news/article-3393329/Men-rape-children-12-likely-spend-time-jail-convicted-raping-adult-women.html"}
