{"authors":["Hannah Parry For Dailymail.Com"],"date_download":"2018-10-22 22:07:39","date_modify":"2018-10-22 22:07:39","date_publish":"2017-03-10 00:20:59","description":"Home surveillance footage shows four-year-old Madison Gardner getting out of her mom's car and running up the front stairs of her Ohio house to open the door.","filename":"data/vaneerConsumption/VideoshowsOhiogirlalmostbeingblownawayinwinds.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1EFD8400000578-0-image-a-20_1489105294686.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299462_Video-shows-girl-blown-away-heavy-winds_1540246059.html","title":"Video shows Ohio girl almost being blown away in winds","title_page":"Video shows Ohio girl almost being blown away in winds | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A little girl in Ohio was almost blown away when she tried to open her own front door during strong winds which whipped through the state on Wednesday.\nHome surveillance footage shows four-year-old Madison Gardner getting out of her mom's car and running up the front stairs of her house to open the door.\nBut as soon as she manages to open the door, the wind catches it sending them both flying through the air.\nMadison, who was not hurt in the incident, held on for dear life as her mom Brittany Gardner was seen running up the driveway to help her.\n'All I hear is 'mommm!' So I looked back and she's pinned between the house and the glass door,' she wrote on Facebok. 'She is okay and laughing along with it!'\n'She was scared at first then was laughing away at it. She held on until I took her off the handle,' Gardner told KFor.\nThe video, set to Frank Sinatra's 'Come Fly with Me', was posted on Facebook yesterday and has quickly gone viral with more than 124,000 views.\nMadison Gardner was almost blown away when she tried to open her own front door during strong winds which whipped through the state on Wednesday\nMadison was seen on surveillance footage running up the front stairs of her house to open the door\nBut as soon as she manages to open the door, the wind catches it sending them both flying through the air","url":"https://www.dailymail.co.uk/news/article-4299462/Video-shows-girl-blown-away-heavy-winds.html"}
