{"authors":["Stephanie Linning For Mailonline"],"date_download":"2018-10-23 04:48:23","date_modify":"2018-10-23 04:48:23","date_publish":"2016-01-28 20:59:33","description":"The 40-second clip, which appears to have been filmed in a home somewhere in the UK, has been viewed more than 500,000 times since it was uploaded to YouTube.","filename":"data/vaneerConsumption/Videoshowsmanfallheadfirstontoeggwhiletryingtostandonit.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD36A100000578-0-image-a-19_1454011924865.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421441_He-really-got-egg-face-Hilarious-moment-man-falls-head-egg-trying-stand-without-cracking-shell_1540270103.html","title":"Video shows man fall head first on to egg while trying to stand on it","title_page":"Video shows man fall head first on to egg while trying to stand on it | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This entertainer made sure he was being filmed as he prepared to show off his latest party trick.\nHe carefully placed an egg on the floor and gently positioned his foot on top. The plan was to defy the laws of gravity - or at least appear to - and stand on the egg without it breaking.\nBut the party trick went south and the performer, identified only as Tony, was left with egg on his face after he lost his balance and fell head first into his prop.\nThe hilarious moment was caught on camera by a woman who bursts into laughter as Tony looks up to find yolk smeared across the floor.\nThe 40-second clip, which appears to have been filmed in a home somewhere in the UK, has been viewed more than 500,000 times since it was uploaded to YouTube.\nThe camerawoman introduces the trick, saying 'Tony is going to stand on an egg', as he tries to position his foot in just the right place.\nHe is heard breathing heavily with concentration as he carefully manoeuvres the egg.\nParty trick: The man, identified only as Tony, positions the egg beneath his foot, left, but loses his balance\nHowever all the hard work goes to waste when Tony slips and falls to the floor, smashing the egg with his forehead.\nThe blunder sends the woman into fits of laughter while Tony appears astonished that the trick didn't work.\nThe woman tries to put on a straight face to ask Tony if he is bleeding. But she soon starts giggling again.\nAnother man in the room suggests Tony tries the trick again just as the video cuts out.\nScrambled: He falls face first into his prop, left, and lifts up his head to find yolk smeared across the floor","url":"https://www.dailymail.co.uk/news/article-3421441/He-really-got-egg-face-Hilarious-moment-man-falls-head-egg-trying-stand-without-cracking-shell.html"}
