{"authors":["Kavitha George"],"date_download":"2018-10-31 01:52:43","date_modify":"2018-10-31 01:52:43","date_publish":"2018-09-06 07:23:46","description":"The White House daily press briefings are happening less often, and the media is taking notice. To poke fun at the infrequency of the White House's pressers amid its latest scandals, Late Night host Seth Meyers \"asked\" Press Secretary Sarah Sanders…","filename":"data/vaneerConsumption/VideoOfSethMeyersAskingSarahSandersQuestionsMakesTheWhiteHouseLookSoChaotic.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/ef031a51-39fe-4e8a-9bd5-e2ff1eec575b-screen-shot-2018-09-05-at-103147-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_video-of-seth-meyers-asking-sarah-sanders-questions-makes-the-white-house-look-so-chaotic-11770645_1540950763.html","title":"Video Of Seth Meyers \"Asking\" Sarah Sanders Questions Makes The White House Look So Chaotic","title_page":"Video Of Seth Meyers \"Asking\" Sarah Sanders Questions Makes The White House Look So Chaotic","title_rss":"NULL","source_domain":"bustle.com","text":"The White House daily press briefings are happening less often, and the media is taking notice. To poke fun at the infrequency of the White House's pressers amid its latest scandals, Late Night host Seth Meyers \"asked\" Press Secretary Sarah Sanders questions using some carefully spliced clips of her speaking at the briefing podium. And the whole ordeal highlighted just how much chaos must be going on in D.C. right about now.\n\"Sarah Huckabee Sanders hasn’t been holding many press briefings lately, so we decided to hold one of our own,\" he began. Then, in a mockup of the briefing room Meyers sat with a group of \"journalists\" and began firing questions toward an offscreen lectern. \"Who do you think you'll be working for by this time next year?\" he asked.\nThe screen immediately cut to a clip of Sanders in the actual White House briefing room, where she's heard saying, \"President Mike Pence.\" Meyers continued, probing the imaginary press secretary on everything from her own job skills, to the president's habits, to vampires.\n\"What’s the rarest thing in the entire universe?\" Meyers asked.\n\"A question that I could answer,\" Sanders \"replied.\"\n\"Where does Donald Trump see himself in five years?\" Meyers pressed.\n\"Prison,\" Sanders said after a smash cut.\n“Let’s get serious,\" Meyers said with a laugh, halfway through. What does President Trump think is the most romantic thing to do on a first date?”\n\"Sign an NDA,\" Sanders countered off-screen.\nFinally Meyers had just one question left. \"Secretary Sanders, I have a policy question. Can vampires enter any home, or do they have to be invited in?\" Repeating a phrase she has often used when asked about the president's legal trouble, a clip of Sanders shows her saying, \"I would refer you to Rudy Giuliani for all questions on that matter.\"\nWhile Meyers' farcical press briefing served to highlight recent White House chaos, it also drew attention to the infrequency with which Sanders addresses the public. Though her appearances are still referred to as \"daily briefings\" on C-SPAN, an ABC News analysis found that in the months of June, July, and August of 2018, Sanders spent just under four hours behind the podium. According to Politico, July was the lowest of any month in the Trump presidency, during which Sanders spent just 56 minutes answering questions from reporters. And that's unusual when you compare it to former press secretaries' time behind the podium during the previous two presidential administrations.\nAsked about the disappearing briefings, especially in a time in which the media is so vocally demanding accountability from the administration, Sanders told ABC that the president's frequent Twitter activity was an example of the administration's daily interaction with the media. \"President Trump directly engages and is more accessible to the press than any president before him.\" She continued, \"We are available every day to answer questions from members of the media - we often do that through in-person meetings, on-camera interviews, email, phone calls and press briefings.\"","url":"https://www.bustle.com/p/video-of-seth-meyers-asking-sarah-sanders-questions-makes-the-white-house-look-so-chaotic-11770645"}
