{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-23 04:15:21","date_modify":"2018-10-23 04:15:21","date_publish":"2017-03-16 15:35:17","description":"Dramatic footage shows the woman battling to survive as a raging torrent of flood water thick with debris ripped through a valley in the district of Punta Hermosa, south of captial city Lima.","filename":"data/vaneerConsumption/VideoshowswomanfightingtosurvivemudslideinPeru.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E55379D00000578-0-image-a-235_1489678380340.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320728_Footage-shows-woman-fighting-survive-mudslide-Peru_1540268121.html","title":"Video shows woman fighting to survive mudslide in Peru","title_page":"Video shows woman fighting to survive mudslide in Peru | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the dramatic moment a young woman caked in brown sludge fought to escape being swept away in a devastating mudslide in Peru.\nFootage shows the woman battling to survive as a raging torrent of flood water thick with debris ripped through a valley in the district of Punta Hermosa, south of captial city Lima.\nTerrified onlookers shouted to try to get her attention but were powerless to intervene as she was carried out towards the heaving brown rapids.\nThe shocking video emerged after some of the the heaviest rains and hottest temperatures in two decades have battered Peru over the past month as weather linked to El Nino caused flooding and landslides that blocked the country's central highway and forced hundreds from their homes.\nDramatic footage shows a young woman caked in brown sludge trying desperately to escape being swept away in a devastating mudslide in Peru\nFootage shows the woman battling to survive as a raging torrent of flood water thick with debris ripped through a valley in the district of Punta Hermosa, south of captial city Lima\nAt one point in the clip, the woman waves to acknowledge she is safe only to be dragged back under one of dozens of wooden pallets swirling in the mudslide.\nA man filming shouts 'somebody's down there' to rescuers after losing sight of the woman.\nBut incredibly, she avoids being dragged under or crushed and reappears, desperately clawing her way out of the water before stepping over floating planks of wood to the shore.\nAs she reaches the banks of the river, the terrified woman collapses to the ground before rescuers rush in to help her.\nWhile the woman is dragged to safety, farm animals are also seen among the debris and torrents of mud, including a cow and what appears to be a piglet.\nIt is not known when exactly the video was captured.\nIt comes after a separate video emerged showing the Peruvian army dramatically rescuing stranded schoolchildren with a helicopter.\nAt one point in the clip, the woman waves to acknowledge she is safe only to be dragged back under one of dozens of wooden pallets swirling in the mudslide\nIncredibly, she avoids being dragged under or crushed and reappears, desperately clawing her way out of the water before stepping over floating planks of wood to the shore\nAs she reaches the banks of the river, the terrified woman collapses to the ground before rescuers rush in to help her. A cow was also caught up in the flood and could be seen trying to make its way out of the water\nA video shows the moment the youngsters were pulled from the water by troops in an Mi-171 chopper.\nThe army at first rescued 72 people in the district of Pacora, among them 35 children who lived in the villages of La Junta Santa Isabel and Senor de Luren.\nIn total, over the course of various missions, more than 200 people - 123 of them children - had to be rescued after they became cut off from dry land.\nIn the video an army officer can be seen up to his waist in water, carrying a little boy over his shoulders.\nHe can be seen struggling towards the waiting helicopter, which hovers just over the dirty water.\nOther soldiers can be seen helping the youngsters get into the helicopter which later flew them to safety.\nThe Peruvian Ministry of Defence confirmed they had rescued 210 people who had been isolated in their villages after La Leche river overflowed.\nIt comes after a separate video emerged showing the Peruvian army dramatically rescuing stranded schoolchildren with a helicopter\nA video shows the moment the youngsters were pulled from the water by troops in an Mi-171 chopper\nThe army at first rescued 72 people in the district of Pacora, among them 35 children who lived in the villages of La Junta Santa Isabel and Senor de Luren\nEight villages were cut off and more than 30 houses collapsed due to the extreme weather conditions.\nThe flood was caused by heavy rains over just a few hours in the region of Lambayeque, north-western Peru.\nThe Ministry of Defence said the remainder were saved from the neighbouring district of Jayaca.\nThe government department shared a video of the dramatic rescue effort on social media.\nMeanwhile at least 15 people were killed when a bus plunged into a ravine in central Peru during heavy rain, authorities said Sunday.\nThe accident took place Saturday in Yauya district, a remote part of the Ancash region in central Peru, north of Lima.\nFifteen people have been confirmed dead, and the bus was carrying 22, so the toll could rise, police said. Rain and poor visibility were impeding recovery efforts, they said.\nTraffic accidents are common and often deadly in this country of 30 million, which rises from coastal desert to the towering Andes and encompasses tropical Amazon basin lowlands.\nEarlier this month Peru's weather agency, Senamhi, put the country on alert for even more intense rains the rest of the week after downpours overwhelmed towns along the northern coast and in the central Andes and Amazon.\nIn total, over the course of various missions, more than 200 people - 123 of them children - had to be rescued after they became cut off from dry land\nOther soldiers can be seen helping the youngsters get into the helicopter which later flew them to safety\nEight villages were cut off and more than 30 houses collapsed due to the extreme weather conditions\n'We haven't seen this volume of rain since 1997' during the last strong El Nino phenomenon, Agriculture Minister Juan Manuel Benites said.\nEl Nino is a warming of sea-surface temperatures in the Pacific that can intensify rains and cause drought.\nTemperatures in several seaside and jungle towns have also reached 20-year highs, said Nelson Quispe, a Senamhi official.\nSeveral major rivers already carrying twice as much water as usual threatened to wash over shantytowns built in flood zones along Peru's coast.\nThis season's El Nino has already left 5,000 homeless and impacted an additional 80,000 people, according to Indeci.\nThe disaster will likely squeeze food prices and could stoke inflation that is already near a four-year high. News channel Canal N reported shortages of some products in wholesale markets.\nThe government deployed mobile clinics after floods shuttered some hospitals. The education minister said officials were evaluating pushing back the start of the school season in some areas.","url":"https://www.dailymail.co.uk/news/article-4320728/Footage-shows-woman-fighting-survive-mudslide-Peru.html"}
