{"authors":["Stephanie Linning","Anthony Joseph For Mailonline"],"date_download":"2018-10-23 02:41:38","date_modify":"2018-10-23 02:41:38","date_publish":"2016-01-11 15:06:48","description":"A brunette woman in a white strapless dress is seen violently kicking and punching another female reveller outside the shop on Belmont Street, in Aberdeen city centre.","filename":"data/vaneerConsumption/VideoshowshalfnakedwomanfightinganotherAberdeenfemaleoutsidekebabshop.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300B4D5E00000578-0-image-a-24_1452524706952.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393723_Shocking-video-shows-half-naked-woman-fighting-female-reveller-outside-kebab-shop-Aberdeen_1540262498.html","title":"Video shows half-naked woman fighting another Aberdeen female outside kebab shop","title_page":"Video shows half-naked woman fighting another Aberdeen female outside kebab shop | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This shocking video shows two young women brawling on a street outside a kebab shop.\nA brunette woman in a white strapless dress is seen violently kicking and punching another reveller outside the shop on Belmont Street, in Aberdeen city centre.\nFriends step in to try and separate the pair as they grapple on the ground before the blonde woman scrambles free.\nBut the brunette woman refuses to give up and launches herself again at her opponent, revealing her bare bottom in process.\nScroll down for video\nBrawl: A young woman in a white dress was seen punching (left) another female reveller and pulling her hair\nTwo men and two women, all aged 19, have been arrested and charged in connection to the incident, a Police Scotland spokesman said.\nThe fight, which is believed to have taken place at the end of December, was captured on a mobile phone and later uploaded to Facebook.\nThe brunette woman later posted on the social networking site, writing: 'Wow yes the video is going round on Facebook you don't need to tag me I've seen it a*** is oot aye get over it.\n'I shouldnt have went comando. I dont care anyway so f*** off this video also wasnt last night but a week before new years [sic].'\nThe clip shows the women tussling on the ground, with the brunette woman kicking her high-heeled shoes out at her opponent as she viciously tugs at her long blonde hair.\nRacy: At one point the woman launched herself at her opponent, revealing her bare bottom (pictured)\nThe blonde woman, who is dressed in a white strap top and colourful trousers, tries to hit back as the brunette woman continues to lash out.\nOnlookers are heard shrieking as a number of other women try to pull the pair apart.\nAt one point, the top the brunette woman's dress is pulled down, exposing her black strapless bra.\nThe blonde woman breaks free from the hold and shuffles along the road towards the pavement.\nBut the woman in the white dress appears determined to continue the fight and crawls after her opponent. As she does so, her dress rides up and reveals her bare bottom.\nVicious: The woman in the white dress grabs a chunk of the woman's hair, left, and pulls her to the ground, right\nShe continues to slap the blonde woman before turning on a brunette woman trying to hold her back.\nThere is a pause in the fighting as the two women separate before the brunette reveller throws herself at the blonde woman, grabbing her hair with one hand as she thumps the top of her head with the other.\nShe yanks on the woman's hair and the pair fall to the ground where they are seen continuing to fight before the video cuts out.\nA Police Scotland spokeswoman said: 'Police were called to a disturbance at the Windmill Brae area of Aberdeen on 27 December, 2015.","url":"https://www.dailymail.co.uk/news/article-3393723/Shocking-video-shows-half-naked-woman-fighting-female-reveller-outside-kebab-shop-Aberdeen.html"}
