{"authors":["Aimee Brannen For Mailonline"],"date_download":"2018-10-23 00:18:12","date_modify":"2018-10-23 00:18:12","date_publish":"2016-01-11 09:15:01","description":"Jacqueline Sloan Ziegler, from Georgia, posted a cute video of the eager pooch on Facebook and it's now gone viral with nearly seven million views and more than 150,000 shares in just a few days.","filename":"data/vaneerConsumption/Videoshowsarescuepitbulldogtrytocopyalittlegirlscartwheel.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/10/16/2FFE74A200000578-0-image-a-16_1452444072727.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3392690_Rescue-pit-bull-tries-copy-little-girl-s-cartwheel_1540253892.html","title":"Video shows a rescue pit bull dog try to copy a little girl's cartwheel","title_page":"Video shows a rescue pit bull dog try to copy a little girl's cartwheel | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They say you can't teach an old dog tricks but one clever rescue hound proved that theory wrong when he tried to copy a little girl cartwheeling.\nJacqueline Sloan Ziegler, from Georgia, posted the heart-warming video to Facebook and it's now gone viral with nearly seven million views and more than 150,000 shares in just a few days.\nIt shows a little girl called Kailyn showing off her cartwheeling skills, with 18-month-old dog Oakland, who was rescued by the family last year, rushing to try and copy her moves.\nScroll down for video\nAfter watching Kailyn cartwheeling across the living room, Oakland prepares to try and do the same. Jacqueline Sloan Ziegler from Georgia posted the incredible video to Facebook and it's now gone viral with nearly 7 million views and more than 150,000 shares in just a few days\nDressed in a red jumper, the intelligent canine can be seen observing Kailyn who performs a series of elegant cartwheels before running and dipping his head down to the floor, before flipping himself over and then standing up again.\nOne might think it could have been a fluke, but the brown and white American pit bull recreates the move for a second time, to the amazement of his family.\nThe video has delighted the many people that have viewed it - with some calling for Oakland's incredible skills to be featured on the Ellen DeGeneres Show.\nThe brown and white American pit bull dips his head down onto the floor, before flipping himself over and standing up - to the amazement of his family who were videoing the moment\nHe is then shown trying to do a cartwheel for a second time - leaving Kailyn equally delighted, and she can be seen lying on the carpet next to him an rolling around on her back\nAndi Orear said: 'That is the cutest and funniest thing!'\nEmily Collins said: 'How precious! I giggle every time.'\nRebecca Yeager Corte added: 'This is so adorable!'\nJacqueline has now created a Facebook page for Oakland, saying she wants to raise awareness of his breed to help build dogs like him a more 'positive name'.","url":"https://www.dailymail.co.uk/femail/article-3392690/Rescue-pit-bull-tries-copy-little-girl-s-cartwheel.html"}
