{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 20:03:16","date_modify":"2018-10-30 20:03:16","date_publish":"2016-08-18 16:00:38","description":"There may be few things nerdier in cocktails these days than an ice program.","filename":"data/vaneerConsumption/VIDEOTheartofcraftingiceatJapanesecocktailloungeHimitsu.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/08/16/Images/WPIMAGE_cmgajcfoodandmore_10259.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_vi_7d0b71c5fb0c1ab533bfcb7862af8799__1540929796.html","title":"VIDEO: The art of crafting ice at Japanese cocktail lounge Himitsu","title_page":"VIDEO: The art of crafting ice at Japanese cocktail lounge Himitsu","title_rss":"NULL","source_domain":"ajc.com","text":"There may be few things nerdier in cocktails these days than an ice program. Yes, we’ve heard it all before: “how pretentious,” “who cares about ice,” “those darn hipsters and their ridiculous trends.” Even we have to admit some trends deserve a swift kick in the rear on their way out the front door. But, considering one of the main elements of a cocktail is water whether through shaking, rocks in your drink or chilling of a glass, you may want to rethink your stance on “quality ice.”\nHidden behind an unmarked door in the courtyard of One Buckhead Plaza lies a 65-seat cocktail bar like no other in Atlanta. We’re talking invite-only, \"Mission Impossible\" retinal scanners, a dark antechamber leading to a dimly lit room full of copper, wood, custom artwork and chandeliers all conceptualized by ultra-luxe, British designer Tom Dixon. Welcome to Himitsu--Atlanta’s secret Japanese-inspired cocktail lounge.\nIn Japan, the art of crafting a drink is serious business and has been for nearly a century. Marked by precision, solitude, civility, consistency and efficiency, creating cocktails is a form of artistic expression, and that includes the ice in the drink.\nBar manager Ben Yabrow sat down with us to discuss the highly-curated ice program at Himitsu and why the quality, clarity and even the shape of drink ice should be of concern if you’re truly into sipping cocktails properly.\n“We receive about 300 pounds of ice a week from a company that makes sculptures. This is some of the highest quality ice you can get. It’s dense and incredibly clear,” Yabrow said. “We use band- and chainsaws to cut it down to manageable sizes before shaping cubes or spears for drinks by hand or with various presses we have in the refrigerators behind the bar.”\nFor instance, spears of ice are used for Collins or highballs, spheres for double rocks glasses and smaller cubes for single spirits over 120-proof since those need to dilute more rapidly.\nWhile some impurities in water lead to cloudy or “dirty” ice, most murkiness occurs when gas becomes trapped as water freezes, creating air pockets. Air pockets cause ice to melt faster, which when one is sipping whiskey on the rocks leads to a soggy glass of brown water.\nThe company Himitsu uses to source its ice have a machine that keeps the water moving as it freezes so none of that pesky gas gets trapped, but rather, evaporates as it freezes, giving the ice glass-like clarity. This ice is so clear that, when placed in a glass, it renders itself nearly invisible.\nAnd, talk about keeping your drink cool--the denser the ice, the colder it is.\n“Our ice typically comes in on a Thursday and takes about half a day to break down. Beyond the ice presses, we also have a Hoshizaki ice machine that makes 1-by-1- inch cubes for people who order high-proof whiskey on the rocks or 2-by-2-inch cubes for specific cocktails and spears for drinks in a Collins or highball glass. Ice shape is important as it is not only aesthetic but serves a purpose for each cocktail,” Yabrow explained.\nHimitsu has both a 65- and 80-millimeter copper alloy press for making ice spheres, but Yabrow admits he enjoys shaping these spheres for cocktails by hand just as they do in Japan.\n“The fastest melting point for ice are the corners, so a sphere usually melts much more slowly than a cube. For guests, it’s almost hypnotic to watch as the ice transforms from a square block to a perfectly round ball of ice. It takes time, patience and specific tools and techniques, but the end result is beautiful,” Yabrow said.\nThose tools include a three-pronged ice pick, special carving knives and cool water. As Yabrow chips away at the ice, he quickly gets into a rhythm of constantly rotating the block to form the sphere. Once he is satisfied with its size and shape, he takes a knife to whittle down the jagged edges before smoothing the ice ball under cool water.\nIt is indeed hypnotic to watch.\n“Guests know what they’re getting when they come to Himitsu--right down to the ice. They appreciate every aspect of the artistry and science which go into making our drinks.”\nNote: Himitsu is currently closed for minor renovations but plans to reopen in early September.\nWatch Himitsu’s Ben Yabrow create an ice sphere by hand.\nHimitsu, One Buckhead Plaza, 3050 Peachtree Road NW, Atlanta. 404-257-6693, puraibeto.com/himitsu.\nGo here to read more of our coverage of the Atlanta bar scene\nMake a rum run for these 5 cocktails at Atlanta bars\nOne Eared Stag mixes it up behind the bar with themed cocktail menus\n4 cocktail books to quench your summer reading thirst\nAria’s revamped cocktail program\nClick here to read the AJC’s Ultimate Guide to Brunch in Atlanta\nClick here to read about dining in Atlanta around the clock\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook , following @ATLDiningNews on Twitter.","url":"https://www.ajc.com/blog/atlanta-restaurants/video-the-art-crafting-ice-japanese-cocktail-lounge-himitsu/gegiCFlFSSobzh0l8vOvdI/"}
