{"authors":["Sophie Williams For Mailonline"],"date_download":"2018-10-23 02:03:00","date_modify":"2018-10-23 02:03:00","date_publish":"2016-01-11 13:43:07","description":"Video footage has emerged of teenage bullies in China whipping a young boy and throwing him into a paddy field. Police arrested five suspects on January 6.","filename":"data/vaneerConsumption/VideoshowsChineseteenbullieswhippingboybeforebindinghishandsandfeet.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300A80AA00000578-0-image-a-7_1452518482122.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3393632_Horrific-moment-teenage-bullies-savagely-whip-12-year-old-binding-hands-feet-throwing-rice-field_1540260180.html","title":"Video shows Chinese teen bullies whipping boy before binding his hands and feet","title_page":"Video shows Chinese teen bullies whipping boy before binding his hands and feet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A shocking video has emerged of teenage bullies brutally attacking a boy before dumping him in a rice field in Lingshan County, Guangxi province.\nThe police were informed of the case on January 6, and arrested five suspects, the People's Daily Online reports.\nOne of the bullies said the victim, who is reportedly 12 years old, had stolen his mobile phone.\nBullies: The gang abducted the boy and brought him to the edge of town where they started beating him\nTerrified: The 12-year-old boy, who remains unidentified, was tied up by his hands and legs during the ordeal\nThe video which was uploaded online was filmed by one of the bullies.\nThe horrifying footage shows the young boy initially forced to sit on the floor while one teenager whips him with a stick and another films the ordeal on his mobile phone.\nThe group then go one step further tying his hands and legs together making sure the boy cannot escape.\nThey then throw the child into a rice field full of water.\nLocal police launched an investigation into the case on January 6 and arrested five suspects on the same day.\nTwo of the suspects were revealed as having the surnames of Huang and Zhang.\nHuang who is 18 years old and Zhang who is 16 have been detained on suspicion of illegal imprisonment.\nThe remaining three were younger than 18 and were not detained due to their ages.\nVideo footage: The whole ordeal was filmed by one of the bullies and later posted online\nPolice later arrested five suspects and detained two on suspicion of illegal imprisonment\nShocking: One of the bullies later threw the young boy into a rice field which was full of water\nHuang told police that the boy had taken his mobile phone and so he went to find him along with four of his friends.\nHe says the boy confessed to stealing the phone but it had then been taken from him by someone else. The boy said he was unable to compensate Huang for the phone.\nThe boy lives with his uncle as his father passed away and his mother left him.\nUpon learning that he wouldn't be compensated, Huang and his friends abducted the boy and drove him to the edge of town to teach him a lesson.\nThe boy sustained minor injuries and received hospital treatment.","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3393632/Horrific-moment-teenage-bullies-savagely-whip-12-year-old-binding-hands-feet-throwing-rice-field.html"}
