{"authors":[],"date_download":"2018-10-30 20:28:16","date_modify":"2018-10-30 20:28:16","date_publish":"2015-11-21 01:02:03","description":"Covington police believe they’ve found a video to identify the couple suspected in the death of a 65-year-old woman outside a Newton County Wal-Mart this week.","filename":"data/vaneerConsumption/VideoofcouplesuspectedinWalMartshoppers.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_covington-v_5417799db023456cfbc3df10e3274a37__1540931296.html","title":"Video of couple suspected in Wal-Mart shopper’s...","title_page":"Covington PD: Video of couple suspected in Wal-Mart shopper’s...","title_rss":"NULL","source_domain":"ajc.com","text":"Covington police believe they’ve found a video to identify the couple suspected in the death of a 65-year-old woman outside a Newton County Wal-Mart this week.\nThe couple in the video at the counter of a Wal-Mart in Walterboro, S.C., closely resembles the description of the couple who committed the strong-arm robbery in Covington on Monday that killed Marsha Johnson, said Allan Seebaran, intelligence officer for Covington police.\n“The clothing of the male was the same as our suspect,” Seebaran said in an email Friday. “The mannerism, such as the way he walked, matched our suspect. The distinctive white sneakers the male was wearing matched the sneakers our male suspect wore.\n“They were driving the same color, make, model vehicle.”\nThey are asking the public for help in identifying the couple.\nPolice believe the man who struggled with Marsha Johnson before running over the woman Monday night outside the Wal-Mart at 10300 Industrial Blvd. also fled to Tennessee with a female who was in the vehicle.\nJohnson, who police said fell to the ground as the man grabbed her purse and then was run over multiple times, died later at Newton Medical Center.\nCovington detectives were in Chattanooga on Thursday distributing sketches of the couple suspected in the killing.\nCapt. Craig Treadwell said the victim’s Visa card had been found in a walkway of the Koch plant, leaving detectives to speculate that either the couple worked at the plant or had a friend or relative who did.\n“No one has been named a suspect,” Treadwell said at a news conference Thursday in Covington. “That is why we are in Tennessee distributing the fliers. We feel somebody there will know them or know somebody who knows them.”\nThe bank card is one of the department’s strongest leads at this time despite authorities running down numerous tips about the man and woman, who are also suspected in a violent purse-snatching in St. George, S.C., Treadwell said.\nA week ago, a 75-year-old woman was walking into a Family Dollar store in St. George when she was approached by a woman who pointed a handgun at her head and grabbed her purse, police said.\nPolice also have announced a $10,000 reward for information leading to the arrest and conviction of Johnson’s killers.","url":"https://www.ajc.com/news/crime--law/covington-video-couple-suspected-wal-mart-shopper-death/AEVb4y7b8fMmNDfIVcsf2N/"}
