{"authors":["Ryan O'Hare For Mailonline"],"date_download":"2018-10-23 03:26:35","date_modify":"2018-10-23 03:26:35","date_publish":"2016-01-29 18:21:33","description":"A man in Wisconsin has uploaded a video showing him generating sparks from his fingertips. The footage was filmed at Lake Monona and shows the man placing his hands into the electrically charged air.","filename":"data/vaneerConsumption/VideocapturesamanappearingtofireelectricityfromhisfingertipsinMIDAIR.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4C01E00000578-0-image-a-3_1454091604437.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3422591_The-real-life-Electro-Video-captures-man-appearing-fire-electricity-fingertips-MID-AIR_1540265195.html","title":"Video captures a man appearing to fire electricity from his fingertips in MID-AIR","title_page":"Video captures a man appearing to fire electricity from his fingertips in MID-AIR  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Harnessing lightning and firing balls of electricity are usually reserved for superheroes, but a man in Wisconsin has uploaded a video that appears to show him generating sparks from his fingertips in mid-air.\nThe footage was filmed at Lake Monona and shows the man placing his hands in the air.\nSparks of electricity and flashes of light appear on his hands, reminiscent of Electro in The Amazing Spiderman 2, as the current disrupts the electrons in the cold air.\nScroll down for video\nA man in Wisconsin has uploaded a video that appears to show him generating sparks from his fingertips in mid-air. The footage (screenshot shown above) was filmed at Lake Monona\nProfessor Manu Haddad, a high voltage engineer from Cardiff University, told MailOnline that the eerie phenomenon is down to charges in the air.\n‘The molecules in air get ionized. You have an electron and because of the field it hits... it releases other electrons. So molecules lose or gain electrons,’ he said.\n‘Once you have a high sufficient field, you have ionisation, and this creates the effect that you see.'\nWHY THE SPARKS? The sparks seen in the video are the result of ionisation of the air. There were likely storm clouds overhead which created charge in the air. The fingers are sharp points which jutting out into the atmosphere, interact with the field and create channels like miniature lightning rods. High-pitched crackling can be heard in the video, which is ionisation of the air around the fingertips. In essence, the streamers are trying to reach upwards and discharge, like a lightning strike from the ground up.\nThe fingers are sharp points which jutting out into the atmosphere and interact with the field, creating channels.\nProfessor Haddad explained: ‘The [electrical] field is distributed around the fingers in a certain way, and there is an area, or channel, which is the highest field.\n'Along that field you create the streamer and that’s what we see – a channel of ionised air.’\nHigh-pitched crackling can be heard in the video, which is ionisation of the air molecules around the man's fingertips.\nIn essence, the 'streamers' are trying to reach upwards and discharge, like a lightning strike from the ground up.\nAs the people are near a frozen lake, they are probably likely the tallest objects around, and so interact more strongly with the field.\n‘That discharge is practically trying to create something that will meet the discharge coming from the cloud,’ explained Professor Haddad.\nSparks of electricity and flashes of light appear on his hands, reminiscent of Electro in The Amazing Spiderman 2 (pictured), as the disrupts the electrons in the cold air\nHigh-pitched crackling can be heard in the video, which is ionisation of the air molecules around the man's fingertips. In essence, the 'streamers' are trying to reach upwards and discharge, like a lightning strike from the ground up. Pictured is a stock image of a lightning storm in Wisconsin\nThe phenomenon in the video is the same as St Elmo’s Fire - the bright blue or violet glow reported by sailors as on the masts of their ships.\nAs the mast is the highest part of the ship, from a relatively flat sea, it results in the same pattern of ionisation in charged air – such as under electrical storm clouds.\nSt Elmo is the patron saint of sailors and so seeing the ‘fire’ was meant to be a good omen.\nAccording to Professor Haddad, it is the same principle behind lightning rods on buildings, because lightning ‘prefers’ sharp edges, rather than a flat roof, as the rod is where the electric field is highest.\n‘If you are sitting under a cloud, which is possibly going to create a lightning strike, the reason you have that discharge at the finger is because the sharp edge will enhance or augment the value of the electric field. The sharper the edge, the more it gets a high field around it.’\nHe concluded: ‘At the stage we see [in the video], it’s not dangerous. But if it gets bigger, if you’re up in a mountain say, then you could attract lightening. And that is death.’\n‘It’s very dangerous if that discharge develops into lightning.’","url":"https://www.dailymail.co.uk/sciencetech/article-3422591/The-real-life-Electro-Video-captures-man-appearing-fire-electricity-fingertips-MID-AIR.html"}
