{"authors":["Brad Witter"],"date_download":"2018-10-31 01:40:01","date_modify":"2018-10-31 01:40:01","date_publish":"2018-09-01 17:40:39","description":"He bared his heart for the Queen of Soul, and the video of Stevie Wonder's performance at Aretha Franklin's funeral showed an unforgettably moving remembrance of his dear friend. On Friday, Aug. 31, Wonder first performed a mournful version of “The…","filename":"data/vaneerConsumption/VideoOfStevieWondersPerformanceAtArethaFranklinsFuneralShowsHowMuchLoveHeHadForHisDearFriend.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/1/0bd8f639-f3e1-4c23-b8a5-2dfada0ae21f-getty-1025624272.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_video-of-stevie-wonders-performance-at-aretha-franklins-funeral-shows-how-much-love-he-had-for-his-dear-friend-11477647_1540950001.html","title":"Video Of Stevie Wonder's Performance At Aretha Franklin's Funeral Shows How Much Love He Had For His Dear Friend","title_page":"Video Of Stevie Wonder's Performance At Aretha Franklin's Funeral Shows How Much Love He Had For His Dear Friend","title_rss":"NULL","source_domain":"bustle.com","text":"He bared his heart for the Queen of Soul, and the video of Stevie Wonder's performance at Aretha Franklin's funeral showed an unforgettably moving remembrance of his dear friend. On Friday, Aug. 31, Wonder first performed a mournful version of “The Lord’s Prayer” on the harmonica before later shaking the rafters of Detroit’s Greater Grace Temple with a powerful rendition of his beloved 1976 hit “As.”\nBetween his performances, Wonder also paid tribute to Franklin, who died on Aug. 16 at age 76 after battling pancreatic cancer, with a brief but touching eulogy, saying:\n“Without God’s goodness and greatness, we would have never known the Queen of Soul. We would have never known the joy that she brought to us, we’d have never known someone who could express in song the pain that we felt. And yes, the reason that we are here today is because of love, because of how much we love this woman.”\nThe 25-time Grammy winner also urged mourners to share that love, which he called \"the greatest gift we've been given in life itself,\" at Franklin's star-studded homegoing service. Added Wonder, \"What needs to happen today, not only in this nation but also throughout the world, is that we need to make love great again, because black lives do matter, because all lives do matter, and if we love God, then we know truly that it is our love that will make all things matter.”\nGlobal News on YouTube\nHe ended his speech by noting that he hopes to collaborate with Franklin in heaven someday, before sitting at an electric piano and saying he wanted \"to sing a song to Aretha that I know we all feel and I know we all want to express.” That's when Wonder closed the ceremony by performing \"As,\" off of his 1976 album Song in the Key of Life, backed by a choir and other performers, including Jenifer Lewis, as attendees exited the venue.\nIn Franklin's final days, Wonder flew from Los Angeles to her bedside at her Detroit home — an emotional goodbye that he recounted while appearing on CBS This Morning on Aug. 17.\nScott Olson/Getty Images News/Getty Images\n\"She wasn't able to speak back, but her family felt that she could hear me, and so I just said all the things that I've always said and told her to say hello to my sister that I lost this year as well,\" a choked-up Wonder said, referring to the May death of his sister, Renee Hardaway.\nRevealing that he and Franklin \"talked about doing some music, as recent as two months ago\" and planned to perform a song he wrote called \"The Future,\" Wonder also reflected on CBS This Morning how the \"incredible singer\" touched every genre and influenced every singer.\nKevin Winter/Getty Images Entertainment/Getty Images\n\"She was just consistently a great human being, and she always — even with whatever turmoil may have been happening in her life, even through her illness — she did not put that on anybody else,\" added Wonder, who said he remember first hearing Franklin sing at her father's church when he was a young boy. \"She believed, I think that most of all she was doing God's work, and she was. She brought joy to others' lives, and she will — her voice and the essence of her will long live all of us that are here right now.\"\nAmong the many others attendees at the hours-long ceremony that included speeches, hymns, and performances of some of Franklin's most beloved hits were: former President Bill Clinton and former Secretary of State Hillary Clinton, Ariana Grande, Jennifer Hudson, Tyler Perry, Chaka Khan, Cicely Tyson, Faith Hill, Gladys Knight, Smokey Robinson, former Attorney General Eric Holder, the Revs. Jesse Jackson and Al Sharpton, Shirley Caesar, and Yolanda Adams, among many other.\nKris Connor/Getty Images Entertainment/Getty Images\nAccording to the New York Times, there was also an entire wall inside the church filled with floral displays from celebrities, including Barbra Streisand, Elton John, Rod Stewart, Mariah Carey, Tony Bennett, Don King, Diana Ross and the family of James Brown.\nWonder's performance — and the ceremony as a whole — were moving tributes fit for the Queen.","url":"https://www.bustle.com/p/video-of-stevie-wonders-performance-at-aretha-franklins-funeral-shows-how-much-love-he-had-for-his-dear-friend-11477647"}
