{"authors":["Monica Hunter-Hart"],"date_download":"2018-10-31 01:46:29","date_modify":"2018-10-31 01:46:29","date_publish":"2018-09-14 12:32:15","description":"Hurricane Florence made landfall in North Carolina on Friday morning and is already wreaking devastation. Incredibly, a livestream camera on a tower 34 miles off the coast captured the storm closing in on Thursday. Thousands of people have flocked…","filename":"data/vaneerConsumption/VideoOfAFlagInHurricaneFlorenceShowsHowPowerfulThisStormIsGetting.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/1d90c10f-468a-403a-aef6-14258fcf5074-getty-1033059888.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_video-of-a-flag-in-hurricane-florence-shows-how-powerful-this-storm-is-getting-11917151_1540950389.html","title":"Video Of A Flag In Hurricane Florence Shows How Powerful This Storm Is Getting","title_page":"Video Of A Flag In Hurricane Florence Shows How Powerful This Storm Is Getting","title_rss":"NULL","source_domain":"bustle.com","text":"Hurricane Florence made landfall in North Carolina on Friday morning and is already wreaking devastation. Incredibly, a livestream camera on a tower 34 miles off the coast captured the storm closing in on Thursday. Thousands of people have flocked to the stream, especially to watch the intense video of Hurricane Florence ripping a flag to shreds.\nWinds from Florence are blowing with the force of a tropical storm as far as 195 miles from its center, according to Sacramento's KRCA. They're very dangerous, but The New York Times reports that they may not even be the biggest threat. That seems likely to be the rain, which by Friday morning had caused a storm surge of seven feet on North Carolina's Emerald Isle. The hurricane could bring as much as 40 inches of rain and will likely cause significant flooding inland, per the Times.\nTo see these developments in real time, many people have been watching a livecam powered by Explore.com that's attached to Frying Pan Tower off North Carolina's coast. Tower workers prepared for Florence by using wind turbines to fill up the backup battery bank, but nevertheless, the storm had knocked the cameras out of commission as of 8 a.m. ET on Friday. \"The Frying Pan cameras are offline due to Hurricane Florence,\" a message on the website read. \"Please standby while we troubleshoot the issue.\" But PressTV had already captured footage of the flag and turned it into a time lapse that shows the flag coming apart.\nBTMG on YouTube\nAccording to Explore.com, Frying Pan Tower was built in the '60s to alert sailors to the fact that shallow waters were nearby. GPS technology has since made that job irrelevant, but the tower is now used as a bed-and-breakfast and the host of several live cams that provide a glimpse into the ecosystem of the Atlantic Ocean, including the cam with the view of the flag and an underwater shark cam.\nSome viewers were evidently upset by the footage of the ripped flag on Thursday and blamed the incident on Frying Pan Tower. Owner Richard Neal responded with a Facebook post reading:\nHey folks, the last time we were out we put up a new flag. With respect, we will retire and replace it next trip. We see the tears and know that good men and women fought for America and are honored to fly old glory! Please understand, this is a hurricane. We are not on the tower and can't go outside and replace it yet. Be safe and smart, Richard\nHe announced shortly afterward that the company Flag and Banner had decided to sponsor the tower with a new set of flags. Meanwhile, the flag's Twitter account has been posting a flood of messages.\nThe water around Frying Pan Tower is 50 feet deep, according to Atlas Obscura, but the storm may cause it to swell much higher. Be sure to follow the latest evacuation advice, or, if you're staying in the area, stock up on supplies and read about how to keep yourself safe. If you're stuck in the storm and in danger, use the free app CrowdSource Rescue to get connected with emergency workers.","url":"https://www.bustle.com/p/video-of-a-flag-in-hurricane-florence-shows-how-powerful-this-storm-is-getting-11917151"}
