{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-23 02:42:49","date_modify":"2018-10-23 02:42:49","date_publish":"2016-01-28 17:42:55","description":"The video was posted online where it quickly went viral, but little other information has been released alongside the clip and the location of the accident is unknown.","filename":"data/vaneerConsumption/Videoshowswomaninaburqawalksintoalamppostbutiseverythingasitseems.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC426700000578-0-image-a-125_1453999571397.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421282_Unfortunate-moment-woman-burqa-walks-lamppost-seems_1540262569.html","title":"Video shows woman in a burqa walks into a lamppost... but is everything as it seems?","title_page":"Video shows woman in a burqa walks into a lamppost... but is everything as it seems? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the moment a woman wearing a burqa appeared to nearly knock herself out after walking face-first into a lamppost.\nThe video, which emerged online, has quickly gone viral.\nIt shows the accident and the lady falling to the ground in very dramatic fashion.\nBut little other information has been released alongside the clip and the location of the accident is unknown, prompting some online viewers to question its authenticity.\nWatch out! A woman walks across the road with her friend before crashing face-first into a pole\nThe four-second footage shows the woman walking across a road with her friend.\nWithout paying attention to where she is going she bumps straight into the post before stumbling backwards.\nShe then hits the ground hard as her friend quickly turns around and goes to her aid.\nIt is at this point that the footage concludes.\nSince appearing online numerous people have claimed the video is fake or staged.\nOuch! The woman hits the pole hard before falling backwards and landing on the ground in a heap\nOne reason for this is the fact that it seems peculiar that the video maker would be filming over his shoulder in such a way.\nOther people have claimed that the footage may be part of a comedy sketch for a TV show.","url":"https://www.dailymail.co.uk/news/article-3421282/Unfortunate-moment-woman-burqa-walks-lamppost-seems.html"}
