{"authors":["Angela Chen"],"date_download":"2018-10-31 01:42:08","date_modify":"2018-10-31 01:42:08","date_publish":"2018-08-28 04:22:19","description":"After days of silence, the president has finally decided to talk on camera about the passing of John McCain. Video of Trump speaking at a White House dinner for evangelical leaders shows the president briefly recognizing the late Arizona senator's…","filename":"data/vaneerConsumption/VideoOfTrumpSpeakingAboutJohnMcCainShowsPOTUSBrieflyRecognizingEverythingHesDone.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/be52641e-a3f0-4be8-81aa-992d760f8d74-getty-1024541870.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_video-of-trump-speaking-about-john-mccain-shows-potus-briefly-recognizing-everything-hes-done-10258692_1540950128.html","title":"Video Of Trump Speaking About John McCain Shows POTUS Briefly Recognizing \"Everything\" He's Done","title_page":"Video Of Trump Speaking About John McCain Shows POTUS Briefly Recognizing \"Everything\" He's Done","title_rss":"NULL","source_domain":"bustle.com","text":"After days of silence, the president has finally decided to talk on camera about the passing of John McCain. Video of Trump speaking at a White House dinner for evangelical leaders shows the president briefly recognizing the late Arizona senator's legacy. Aside from a short remark on his appreciation for \"everything\" the senator has done for the country, though, Trump didn't elaborate or go into the details of McCain's service.\nOn Monday night, as he met with evangelical leaders in the State Dining Room, Trump spoke about those killed in the Jacksonville, Florida shooting, offering prayers to those affected, the AP reported. Right after, Trump switched to the subject of McCain and said, \"Our hearts and prayers are going to the family of Senator John McCain. There's going to be a lot of activity over the next number of days. And we very much appreciate everything that Senator McCain has done for our country.\"\nTrump's recognition of McCain is the first publicly spoken comment about the 81-year-old Vietnam War veteran since it was announced on Friday that he would be stopping his brain cancer treatments. On Saturday, McCain's office released a statement announcing that he had passed away.\nTrump's adversarial relationship with McCain has made headlines for years. The president often derided McCain for voting against a move in the Senate last year to replace the Affordable Care Act. Trump also insulted McCain's time in Vietnam as a prisoner of war. In 2015, Trump said, \"He’s a war hero because he was captured. I like people that weren’t captured.”\nMcCain, who was diagnosed about a year ago, has been critical of Trump's policies and decisions despite his deterioration. He was vocal in the aftermath of Trump's controversial summit performance with Russian President Vladimir Putin, calling it a \"tragic mistake,\" according to the AP.\nFor most of Monday, the president stayed mum as the rest of the nation's capitol honored the late senator. According to CNN, Trump finally issued a statement after being urged by senior aides throughout the weekend and Monday, offering short acknowledgements of McCain's service.\n“Despite our differences on policy and politics, I respect Senator John McCain’s service to our country and, in his honor, have signed a proclamation to fly the flag of the United States at half-staff until the day of his interment,” Trump said in the statement, according to The Huffington Post.\nTrump's comment during the White House dinner on Monday night is all the more noteworthy because of the days leading up to it. On Friday, while he was giving a speech at a Republican party dinner in Ohio, Trump failed to mention McCain during his speech, despite the news of the senator's decision to discontinue cancer treatment breaking earlier the same day.\nThe White House did not allude to McCain or release any sort of statement that day either, according to the New Jersey Herald via the AP.\nIt's unclear whether Trump will say anything more; his Monday evening statement on McCain came after a long day of avoiding media questions and dealing with flag status controversy. At this point, his passing remarks on McCain's service might be the most the public will see out of him.","url":"https://www.bustle.com/p/video-of-trump-speaking-about-john-mccain-shows-potus-briefly-recognizing-everything-hes-done-10258692"}
