{"authors":["Lauren Holter"],"date_download":"2018-10-31 01:50:37","date_modify":"2018-10-31 01:50:37","date_publish":"2018-09-06 12:47:28","description":"The Democratic senator from California has led the charge in pressing President Donald Trump's latest Supreme Court nominee on abortion, as well as the FBI probe into the 2016 Trump campaign. Video of Kamala Harris' Mueller questions for Brett…","filename":"data/vaneerConsumption/VideoOfKamalaHarrisMuellerQuestionsForKavanaughWillRaiseSomeEyebrows.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/7ed440b8-4f5d-4940-a700-ebe7218e90e7-kavanaugh-kamala.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_video-of-kamala-harris-mueller-questions-for-kavanaugh-will-raise-some-eyebrows-11771441_1540950637.html","title":"Video Of Kamala Harris' Mueller Questions For Kavanaugh Will Raise Some Eyebrows","title_page":"Video Of Kamala Harris' Mueller Questions For Kavanaugh Will Raise Some Eyebrows","title_rss":"NULL","source_domain":"bustle.com","text":"The Democratic senator from California has led the charge in pressing President Donald Trump's latest Supreme Court nominee on abortion, as well as the FBI probe into the 2016 Trump campaign. Video of Kamala Harris' Mueller questions for Brett Kavanaugh during the second day of his confirmation hearing raises further questions about how the justice would handle a case involving presidential immunity if one ever reached the high Court.\nChip Somodevilla/Getty Images News/Getty Images / Zach Gibson/Getty Images News/Getty Images\n\"Have you discussed Mueller or his investigation with anyone at Kasowitz, Benson, & Torres, the law firm founded by Marc Kasowitz, President Trump's personal lawyer?\" Harris asked Kavanaugh during Wednesday's proceedings. After a lot of back and forth in which Kavanaugh repeatedly asked if Harris was referring to a specific person, he ultimately didn't answer the question.\n\"I think you're thinking of someone and you don't want to tell us,\" Harris asserted before Sen. Mike Lee (R-UT) objected to her line of questioning on the grounds that D.C. is full of law firms and law firms are full of people. Once Harris was allowed to resume her questioning, Kavanaugh said he had discussions with fellow judges about the Mueller investigation, but claimed that he couldn't answer her initial question without looking at a list of everyone who works at Kasowitz's firm.\nAs a former prosecutor and attorney general, Harris is no stranger to questioning witnesses or government appointees. When Kavanaugh claimed he couldn't remember speaking to anyone from Kasowitz, Benson, & Torres, she responded:\n\"You have an impeccable memory. You've been speaking for almost eight hours, I think more, with this committee about all sorts of things you remember. How can you not remember whether or not you had a conversation about Robert Mueller or his investigation with anyone at that law firm?\"\nStill, Kavanaugh didn't provide a solid answer.\nAlthough Harris refused to explain if she was speaking about a specific person Kavanaugh may have spoken with, it was clear she was trying to determine whether Kavanaugh had any relationship with Kasowitz, who previously represented the president in the Mueller probe and now represents him in a defamation lawsuit, per Politico.\nA Democratic aid told Politico Wednesday night that some Democrats \"have reason to believe that a conversation happened and are continuing to pursue it.\" But as Politico notes, Harris would likely face criticisms that she was playing a \"game of gotcha\" with Kavanaugh if evidence of a conversation were ever discovered.\nSen. Dianne Feinstein (D-CA), the judiciary committee’s ranking member, had related questions for Kavanaugh about whether a president should be immune from a criminal investigation, but the justice also dodged her questions. When the senator specifically asked if a sitting president would be required to respond to a subpoena, Bloomberg News' Sahil Kapur reports that Kavanaugh responded:\n\"That's a hypothetical question about what would be an elaboration or a difference from US v. Nixon's precise holding... I can't give you an answer on that hypothetical question.\"\nAt the end of the day, the senators hadn't received any real answers about Kavanaugh's views on presidential immunity or the ability for a president to pardon himself.","url":"https://www.bustle.com/p/video-of-kamala-harris-mueller-questions-for-kavanaugh-will-raise-some-eyebrows-11771441"}
