{"authors":["Myriah Towner For Dailymail.Com"],"date_download":"2018-10-23 02:57:30","date_modify":"2018-10-23 02:57:30","date_publish":"2016-01-29 17:44:56","description":"U.S. Army Staff Sergeant Doug Francis had an emotional reunion as his loved ones gathered at Port Columbus International Airport to welcome him home on Wednesday.","filename":"data/vaneerConsumption/VideoshowsUSArmysoldierreturninghomefromIraqreunitedwithdaughter.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B49BF300000578-0-image-a-95_1454090444789.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423144_Heart-warming-moment-soldier-returning-home-Iraq-reunited-daughter_1540263450.html","title":"Video shows U.S. Army soldier returning home from Iraq reunited with daughter","title_page":"Video shows U.S. Army soldier returning home from Iraq reunited with daughter | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the heart-warming moment a U.S. Army soldier returning home to Ohio from Iraq was reunited with his daughter.\nStaff Sergeant Doug Francis of Amanda had an emotional reunion as his loved ones and some of his fellow soldiers from the National Guard gathered at Port Columbus International Airport to welcome him home on Wednesday.\nDuring the special occasion, Francis' daughter, Raven, is seen running and leaping into his arms as they embrace a year after he was sent overseas on deployment, according to WCMH.\nScroll down for video\nThis is the heart-warming moment U.S. Army Staff Sergeant Doug Francis returning home to Ohio from Iraq was reunited with his daughter on Wednesday\nFranics had an emotional reunion as his loved ones and some of his fellow soldiers from the National Guard gathered at Port Columbus International Airport to welcome him home\nThe emotional reunion was captured on video and shows loved ones holding signs and American flags at the airport before Raven runs and embraces her father as she bursts into tears.\nWhile they are hugging, her father can be heard saying 'you've gotten so big' before she tells him that she has missed him.\nAs he puts her down he tells her 'you're gonna make me cry' before kissing her on the head.\n'I couldn't even say in words how proud I am of him, I'm honored to be his daughter,' Raven told WCMH.\nThe emotional reunion was captured on video and shows loved ones holding signs and American flags at the airport before his daughter Raven (pictured) runs and embraces her father as she bursts into tears\nDuring the special occasion, Francis' daughter, Raven, is seen leaping into her father's arms as they embrace a year after he was sent overseas on deployment\nFrancis pictured as he embraces loved ones. His relatives said he has been on several deployments including Operation Desert Shield/Desert Storm\nSgt. Francis was the last of his National Guard unit to leave Iraq following his deployment\nFrancis, who relatives said has been on several deployments including Operation Desert Shield/Desert Storm, was the last of his National Guard unit to leave Iraq, according to the station.\n'You look around this is why I do it. Right here,' he told WCMH. He added, 'it's been a year without... in a really harsh place.'\nDuring his recent deployment, the solider missed his daughter's college graduation but she said that he was there in spirit. She also noted that he is the 'reason I got through college.'\nFollowing the touching moment, Wendy Booth, Francis' cousin, said she wanted to honor him.\n'I would like to see him recognized for his amazing courage and huge heart,' she told WCMH.\nFrancis told the station that for the next month that he has off he plans to spend it with his family.\n'You look around this is why I do it. Right here,' he said during the reunion. He added, 'it's been a year without... in a really harsh place'","url":"https://www.dailymail.co.uk/news/article-3423144/Heart-warming-moment-soldier-returning-home-Iraq-reunited-daughter.html"}
