{"authors":["Meghan Demaria"],"date_download":"2018-10-31 01:42:13","date_modify":"2018-10-31 01:42:13","date_publish":"2018-08-28 02:18:39","description":"Carrie Underwood has been laying fairly low since announcing earlier this month that she's pregnant with her second child. But Underwood (and her growing bump) made an appearance at a Keith Urban concert this weekend, and fans couldn't get enough of…","filename":"data/vaneerConsumption/VideoOfCarrieUnderwoodsSurprisePerformanceWithKeithUrbanWillMakeYouWantToSingAlong.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/62187641-9a61-4558-802c-0cd069f4dc5d-getty-946715430.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_video-of-carrie-underwoods-surprise-performance-with-keith-urban-will-make-you-want-to-sing-along-10257863_1540950133.html","title":"Video Of Carrie Underwood's Surprise Performance With Keith Urban Will Make You Want To Sing Along","title_page":"Video Of Carrie Underwood's Surprise Performance With Keith Urban Will Make You Want To Sing Along","title_rss":"NULL","source_domain":"bustle.com","text":"Carrie Underwood has been laying fairly low since announcing earlier this month that she's pregnant with her second child. But Underwood (and her growing bump) made an appearance at a Keith Urban concert this weekend, and fans couldn't get enough of the surprise duet. Carrie Underwood sang \"The Fighter\" with Keith Urban on Friday night in Nashville, and her joy during the performance is clear from the fan-posted photos and videos.\nDuring Urban's concert at the Bridgestone Arena, Underwood appeared onstage to perform her half of their 2016 duet \"The Fighter.\" The award-winning song — it won \"Collaborative Video of the Year\" at the CMT Music Awards and \"Vocal Event of the Year\" at the Academy of Country Music Awards — is impossible not to dance to, and it looks like performing the upbeat tune hasn't gotten old for the two of them.\nBased on the video Underwood shared on Instagram, it looks like her appearance wasn't announced beforehand — she just walked onstage after Urban had started singing the song. Underwood wrote in her Instagram post,\n\"Will it ever suck getting to sing with @keithurban ??? No. The answer is no. 😊😝🤓 Such an incredible and LOUD crowd at the @bridgestonearenaofficial tonight!!! I know you guys all had a blast! Thanks for having me up there with ya' KU!\"\nThe surprise appearance is one of Underwood's first performances since she announced her pregnancy on August 8. She shared a photo of her baby bump in an Instagram post on August 10, but the bump was on full view during the concert this weekend.\nUnderwood wasn't the only surprise guest at Urban's Nashville show, either. Reese Witherspoon and Nicole Kidman had a mini Big Little Lies reunion at the show, even taking a selfie with Urban on stage during the concert. Urban shared a photo of the two actors backstage with him on his own Instagram account, and it looks like Witherspoon is just as supportive of his endeavors as his wife is.\nFans were thrilled to see Underwood, as well as Witherspoon and Kidman, at the Nashville concert.\nSuzanne Jarvis on YouTube\nAnd for fans who aren't based in Nashville, there will be plenty more occasions to see Underwood perform live next year. Her \"Cry Pretty Tour 360\" will kick off in May 2019 and run through the end of October 2019. There are tour dates all over the country, as well as in Canada, including one at the Bridgestone Arena. Who knows — maybe Underwood will bring a special guest on stage during that Nashville show, too.\nStill, considering the tour is almost a year away, the weekend's events were pretty exciting for unsuspecting country music fans. The concertgoers on Friday had no idea they'd get to see Underwood perform long before her next tour, or that they'd get an up close and personal peek at her growing baby bump. Underwood's family is growing, but she's still making time for what she loves, and her fans definitely appreciated the surprise performance.","url":"https://www.bustle.com/p/video-of-carrie-underwoods-surprise-performance-with-keith-urban-will-make-you-want-to-sing-along-10257863"}
