{"authors":["William Bigelow"],"date_download":"2018-10-30 20:02:05","date_modify":"2018-10-30 20:02:05","date_publish":"2015-10-20 04:16:07","description":"Two Cleveland daycare workers have been charged with child endangerment after a video surfaced of a 2-year-old being repeatedly beaten.","filename":"data/vaneerConsumption/VideoDaycareWorkerBeats2YearOldWhileAnotherWorkerWatches.json","image_url":"https://media.breitbart.com/media/2015/10/cleveland-daycare-workers-charged-with-child-endangerment-screenshot.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_19__1540929725.html","title":"Video: Daycare Worker Beats 2-Year-Old While Another Worker Watches","title_page":"Video: Daycare Worker Beats 2-Year-Old While Another Worker Watches | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Two Cleveland daycare workers, aged 49 and 34, have been charged with child endangerment after a video surfaced of the older woman repeatedly beating a two-year-old while the younger woman watched.\nFOX8 reported on surveillance video that revealed Amari Lamb, 2, toddling toward Melissa Tate, 49, who seized him and whipped him on his leg with a plastic back scratcher while he tried to get loose. She shoved him to the floor and hit him again. Then, 10 minutes later, grabbed him, hurled him on a changing table, and hit him again. Tate hit the child at least 22 times.\nPolice reported that Tonya James, 34, observed Tate and “did not stop or report the abuse.”\nPolice said Tate’s actions followed Amari striking another child in the head with a large toy.\nAmari, with welts and bruises on his legs, was taken by his mother Ryane and his grandmother to the hospital; they called police and filed a report.\nOctavia Manuel, the Cedar Early Learning Center’s administrator and licensed school counselor, saw the video the next day and immediately fired the two women. But she told police that Tate was not malicious, that she “acted as an older grandmother may have.” She told FOX8 that Tate cried and expressed regret when she was fired.\nOther footage in the video revealed James hitting an 18-month-old girl with a plastic bat.","url":"https://www.breitbart.com/politics/2015/10/19/video-daycare-worker-beats-2-year-old-another-worker-watches/"}
