{"authors":["Bob Price"],"date_download":"2018-10-30 19:43:15","date_modify":"2018-10-30 19:43:15","date_publish":"2015-08-10 10:02:46","description":"At the end of what was supposed to be a non-violent rally supporting the life of Sandra Bland, a violent confrontation broke out between some of the protesters and Waller County Sheriff’s Office deputies. A small group of people barged into the lobby of the sheriff’s office and began shouting and pounding on windows and doors, according to officials. The group had to be forcibly removed by deputies. |","filename":"data/vaneerConsumption/VideoBlackLivesMatterProtestTurnsViolentinTexas.json","image_url":"https://media.breitbart.com/media/2015/08/Breaking-open-front-door-of-Sheriffs-Office.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_08_10__1540928595.html","title":"Video — #BlackLivesMatter Protest Turns Violent in Texas","title_page":"Video -- #BlackLivesMatter Protest Turns Violent in Texas","title_rss":"NULL","source_domain":"breitbart.com","text":"WALLER COUNTY, Texas – At the end of what was supposed to be a non-violent rally supporting the life of Sandra Bland, and others killed or who died in connection to a law enforcement encounter, a violent confrontation broke out between some of the protesters and Waller County Sheriff’s Office deputies. A small group of people with the #BlackLivesMatter rally barged into the lobby of the sheriff’s office and began shouting and pounding on windows and doors, according to officials. The group had to be forcibly removed by deputies.\nA group of about 300 people #BlackLivesMatter protesters gathered in the parking lot to memorialize the life of Sandra Bland who committed suicide after being arrested by a Texas Department of Public Safety trooper. Bland allegedly assaulted the trooper after he forcibly removed her from the car. He had stopped her for running a stop sign and changing lanes without signaling, although he did not mention the stop sign violation to Bland. At the end of the rally a violent confrontation occurred between law enforcement and some of the protesters.\nIn an exclusive phone interview with Waller County Sheriff Glenn Smith, Breitbart Texas learned that a group of protesters stormed into the lobby of his office after the main rally had ended. Smith told this writer the small foyer was filled beyond capacity by the protesters and they were pounding on windows and shouting so loudly that his 9-1-1 dispatchers were unable to hear phone calls.\nSmith said his deputies came into the room and ordered the group to leave the building. He said it was so loud they probably were unable to hear the orders from deputies. He said the deputies then forced the group out of the room and secured the doors. They then discovered that some people were still inside the room.\nRather than re-opening the doors, Smith said his deputies took the handful of people through the office and let them out through a side door.\nIn the meantime, protesters outside believed the people inside were being detained or arrested and started trying to figure out how to get them out. As the video below begins, some of the group are shouting at the crowd to get back. The crowd begins chanting loudly, “Let them out! Let them out!”\nAfter a few seconds a group charges the door and begins pounding on the glass and attempting to open the doors. Apparently fearing the crowd would break down the doors or break the glass, the deputies charged back out of the entryway and forcibly moved the crowd back. The people quickly scattered as deputies and Hempstead police officers took very aggressive positions outside the door.\nThe crowd eventually learned that the other people had been released and the situation de-escalated.\nSmith told this writer in a phone interview that four of his deputies were injured including his chief deputy who was knocked to the ground when he was struck in the head by a full water bottle. Water bottles can be seen in the video strewn across the walkway in front of the office. Other deputies received minor facial injuries.\nBrandon Mack, a witness who was sitting inside the entrance to the sheriff’s office, told this writer a different version of events than what was disclosed by the sheriff. Mack was one of the people who was still inside and he did confirm that the people who remained inside were never detained, but were “forcibly escorted” out another door.\nMack told this writer in the video above that he never heard any orders to vacate the lobby. He said he was sitting inside when the activists came inside chanting. He admitted the protesters were chanting very loudly. This could explain why he was unable to hear the deputies order them to vacate the lobby. Sheriff Smith told Breitbart Texas his men ordered the protesters to leave.\n“They were simply just going inside chanting ‘Sandy speaks! Sandy speaks!’ to say her name inside the Waller County jail when, all of a sudden, the officers came out and pushed people outside.”\nMack claimed that no one from the group was acting inappropriately. Sheriff Smith told this writer protesters were banging on windows and doors very loudly as well as chanting loudly.\n“No one was provoking the officers,” Mack explained. “They (the officers) were merely pushing people outside. They pushed me all the way to the door, and I couldn’t even get out. They had to forcibly take us outside through the back part of the jail. We did nothing wrong but assert our humanity and assert who we are. We were asking questions of what happened to Sandra Bland.”\nHe told Breitbart Texas they were not questioned by police, but were simply taken to another exit. This writer asked Mack why he thought the officers came out so aggressively. “The reason was because people were chanting very loudly, of course, and I guess they were just tired of us going inside and chanting.”\nSmith told Breitbart Texas he has no problems with people expressing their first amendment rights. He said they have been dealing with protesters for 27 days.\nOn Saturday, this writer observed a militant group of protesters enter the sheriff’s office after protesting outside. Smith met with them and spoke to them personally for about 10-15 minutes. While the exchange of questions and answers might have been uncomfortable for Smith, he patiently answered as many questions as they wanted to ask. That video will be the subject of a future Breitbart Texas article on this continuing story.\nBob Price is a senior political news contributor for Breitbart Texas and a member of the original Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.","url":"https://www.breitbart.com/border/2015/08/10/peaceful-rally-for-sandra-bland-turns-into-violent-confrontation-with-deputies/"}
