{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 00:54:41","date_modify":"2018-10-23 00:54:41","date_publish":"2016-01-11 11:05:19","description":"Staff at Emmen Zoo in The Netherlands fled in terror after an African white rhino almost smashed its way through a crate it was being transferred to a new park in.","filename":"data/vaneerConsumption/VideoshowsazookeeperfleeafterrhinobreaksthroughcageatEmmenZoo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3007BF6800000578-0-image-a-30_1452510198270.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393661_The-terrifying-moment-zookeeper-flees-life-rhino-breaks-cage-Dutch-zoo_1540256081.html","title":"Video shows a zookeeper flee after rhino breaks through cage at Emmen Zoo","title_page":"Video shows a  zookeeper flee after rhino breaks through cage at Emmen Zoo | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the terrifying moment a zoo keeper flees for his life after a rhinoceros breaks through a cage in an escape attempt.\nStaff at Emmen Zoo, in The Netherlands, were putting the African white rhino into a mobile crate when it charged into the end of the box, knocking out a metal bar and causing the workers to scatter.\nIt then thrashed around in a desperate effort to get out, but could not fit through the remaining bars, despite the damage it had already caused.\nThe staff at Emmen Zoo in The Netherlands, pictured, use a mobile cage to transport the rhino\nThe keeper nearest the cage flees in terror as the creature bursts through the metal bars in front of him\nHe sprints to the other side of the yard as the rhino thrashes around and tries to move past the bars\nDespite the damage it has caused, the rhino cannot quite manage to get out of the crate to freedom\nThe keepers gather at the opposite end of the yard by a metal gate while waiting to see if the rhino gets out\nA video posted on YouTube shows shocked keepers running to the other end of their yard and cowering by a metal gate, waiting to see if the rhino got out.\nBut eventually the best was soothed and they were able to secure the crate and was moved to a new facility a short distance down the road.\nWhen the time comes to unload the rhino into its new home, the keepers are in a much better position, able to let it into its new enclosure via an electronic door, with a safe distance and a wall standing between them.\nIt comes almost exactly a year after another white rhino great escape, when three of the beasts, including a young female called Rihanna, sneaked past a sleeping security guard and an open gate at Ramat Gan Safari Park in Tel Aviv, Israel.\nEventually the beast is soothed and the keepers are able to secure it back in the crate ready for transport\nIt is taken to a new zoo just down the road and the keepers are now a safe distance away from the beast\nThis time the rhino is put into its enclosure using an electronic door, guaranteeing safety for the keepers\nAlthough it is a little suspicious of its new home at first, the African white rhino soon settles in\nAlthough another employee ran after them, it was too late to stop them escaping into the park, although no customers were around.\nThey were returned to their enclosure after around 10 minutes and the security guard lost his job.\nAfrican white rhinos are the largest known species of the creature but there are thought to be only around 20,000 left in the world.\nPoachers hunt white rhinos for their horns, which can fetch tens of thousands of dollars per kg because they are believed to have medicinal properties despite a lack of scientific evidence.\nThis rhino was being moved because Emmen Zoo shut on January 1 after 80 years, with a new, bigger zoo called Wildlands due to open to the public on March 25.\nAlong with the rhinos, the zoo features a variety of animals including elephants, lemurs, pythons, lions, hippopotamuses, camels, polar bears and penguins.","url":"https://www.dailymail.co.uk/news/article-3393661/The-terrifying-moment-zookeeper-flees-life-rhino-breaks-cage-Dutch-zoo.html"}
