{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 19:34:01","date_modify":"2018-10-30 19:34:01","date_publish":"2018-07-13 01:06:00","description":"Ohio developers announced plans last Thursday to open a sprawling $2 billion theme park that would be four times the size of Disneyland.","filename":"data/vaneerConsumption/VIDEOOhiotoGet2BillionThemeParkFourTimestheSizeofDisneyland.json","image_url":"https://media.breitbart.com/media/2018/07/planet-oasis-2b-theme-park-ohio-youtube.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2018_07_12__1540928041.html","title":"VIDEO: Ohio to Get $2 Billion Theme Park Four Times the Size of Disneyland","title_page":"VIDEO: Ohio to Get $2 Billion Theme Park Four Times the Size of Disneyland","title_rss":"NULL","source_domain":"breitbart.com","text":"Ohio developers announced plans last Thursday to open a sprawling $2 billion theme park and entertainment complex outside of Columbus so massive that it would be four times the size of Disneyland.\nThe planned development, a 350-acre park called “Planet Oasis,” would include activities such as an indoor waterpark, BMX racing, and an area for indoor skydiving, according to a video highlighting the amenities of the development. The theme park development would also include hotels, restaurants, and a conference center.\nDevelopers say Planet Oasis would be located in Ohio’s Delaware County along Interstate 71.\nThe proposed 350-acre park would be larger than the Disneyland theme park in California by 265 acres, Cleveland 19 News reported.\nBlue Horseshoe Ventures CEO David Glimcher said that he envisions the park as “an escape from everyday life.”\nGlimcher added that the project is expected to boost the area’s economy, bringing nearly 15,000 jobs to the area.\nConstruction on the proposed theme park is expected to begin in December, and the first phase of the park is scheduled to open in 2019.","url":"https://www.breitbart.com/video/2018/07/12/ohio-2b-theme-park-4x-disneyland/"}
