{"authors":["Belinda Grant Geary","Lucy Thackray For Daily Mail Australia"],"date_download":"2018-10-23 00:49:28","date_modify":"2018-10-23 00:49:28","date_publish":"2016-01-28 14:52:38","description":"The moment two Melbourne teens were killed in a high-speed street race has been captured in chilling CCTV footage, with video showing their car explode on impact after it plunged off a bridge.","filename":"data/vaneerConsumption/VideoshowsIvanaClonaridisandHarleyChurchilldieindragracingcarcrash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB306B00000578-0-image-a-2_1453994604671.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421049_Chilling-footage-shows-moment-Melbourne-teens-Ivana-Clonaridis-Harley-Churchill-died-fiery-crash-drag-race-gone-wrong_1540255768.html","title":"Video shows Ivana Clonaridis and Harley Churchill die in 'drag racing' car crash","title_page":"Video shows Ivana Clonaridis and Harley Churchill die in 'drag racing' car crash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The moment two teens were killed in a high-speed street race has been captured in chilling CCTV footage, with video showing their car explode on impact after it plunged off a bridge.\nIvana Clonaridis and Harley Churchill, both aged 19, are believed to have been returning from a 'hoon party' at around 1.30 am on Wednesday when a silver Ford Falcon with Green P-Plates 'baited' them into an illegal drag race in Keilor East, north west of Melbourne.\nThe pair died in a fiery crash when their vehicle careered off the EJ Whitten Bridge, with security footage showing their blue Holden utility truck bursting into flames and a flash of light and black smoke immediately filled the air.\nPolice are still searching for the other people involved in the deadly street race after the driver of the Ford Falcon allegedly fled the scene.\nScroll down for video\nThe moment two teens were killed in a high-speed street race has been captured in chilling CCTV footage, with video showing their car explode on impact after it plunged off a bridge\nIvana Clonaridis(left) and Harley Churchill(right) are believed to have been returning from a 'hoon party' at when a silver Ford Falcon 'baited' them into an illegal drag race\nMr Churchill was driving his blue Holden utility truck at around 160 kilometres per hour when he lost control and crashed through the barrier beside the E J Whitten Bridge\n'Words could never describe the pain of losing you. I'm so blessed to have you as my best friend and you will be with me always,' one friend wrote\nPolice believe Mr Churchill was driving his car at around 160 kilometres per hour when he lost control and crashed through the barrier beside bridge on the Western Ring Road.\nThe car exploded on impact 100 metres from the road and 15 metres below it, killing both passengers instantly.\nGrieving friends and family who have been struck with the 'horrible reality of street racing' took to social media to honour the duo, with some saying that they had pleaded with the young drivers to be safe on the road.\n'Waking up to find out your [sic] gone forever is the biggest shock I think I've had so far,' Mr Churchill's former partner wrote on Facebook.\n'Harley I told you not to drive silly, I always told you not to speed.'\nMr Churchill, whose profile picture was of the blue car involved in the fatal crash, was remembered for his 'humour, kindness and honesty'.\n'Harley was a young man with a beautiful soul. His love was his family and friends,' his cousin Sammy Crockett wrote.\n'Having grown up with Harley I can tell you this - He loved to make everyone laugh, even in the darkest days. He was kind, cheeky, compassionate and an all round great mate,'\n'Having grown up with Harley I can tell you this - He loved to make everyone laugh, even in the darkest days,' his cousin said\nMr Churchill was believed to have been driving his blue Holden utility truck at around 160 kilometres per hour\nThe car exploded on impact 100 metres from the road and 15 metres below it, killing both passengers instantly\nGrieving friends and family who have been struck with the 'horrible reality of street racing' took to social media to honour the duo, with some saying that they had pleaded with the young drivers to be safe on the road.\nMs Crockett said her family, who have asked others to make sure they 'take care on the roads', will not 'speculate' on the fiery accident's cause.\n'We have no facts on the accident and are not willing to speculate. We are still waiting on the official police report,' she said on Wednesday night.\nShe said the family are 'heartbroken' by the tragedy which has not only affected her own family, but another's.\nMs Clonaridis, also an outspoken car lover who had posted several pictures of her new black Ford online, has been remembered as a 'beautiful soul' who always made her family 'proud'.\n'Words could never describe the pain of losing you. I'm so blessed to have you as my best friend and you will be with me always,' one friend wrote.\n'Everyone loved you so much darling and will forever cherish the memories they shared with you.'\nMs Clonaridis has been remembered as a 'beautiful soul' who always made her family 'proud'\nMs Clonaridis was also an outspoken car lover who had posted several pictures of her new black Ford online\nThe teenage car enthusiast had only just bought a new car in the last three weeks and had posted an image of her old, beaten and damaged vehicle to Facebook when asked why she upgraded\nOthers spoke about her love of car's and how they had only just seen her hours before the accident.\n'It was just last night you come up to me and asked me for a lighter then we got talking about your new car, you will be sadly missed,' one man wrote.\nAnother said: 'It was only 2 weeks ago that I drove over to your house to visit you and you told me about how you were getting a new car and you were so exited, you couldn't stop smiling the entire time.'\nHer mother posted a touching tribute, asking what she is to do without her 'baby'.\n'I don't want her to be with the Angels, I want her home she was my angel,' she wrote.\nThe teenage car enthusiast had only just bought a new car in the last three weeks and had posted an image of her old, beaten and damaged vehicle to Facebook when asked why she upgraded.\nThe bumper bar was crumpled in and the bonnet dented after what appears to have been an accident.\nSome mourners have posted images from the crash site, where both family members and friends have visited to lay flowers and pay their respects.\nWitnesses said they saw the sedan and Mr Churchill's utility truck travelling at high speed along the Western Ring Road before the teenager lost control and crashed off the side of the bridge\nThe blackened wreck was assessed by police on Wednesday following the fatal crash\nIt is not yet known if the silver car involved in the drag race came into contact with the utility truck before it lost control\nIn the hours before the crash it is believed the two had participated in an industrial estate 'hoon party' at Campbellfield, around 16 kilometres from the E J Whitten Bridge.\nPolice responded to the event, known as the Northern Skids, after receiving reports that up to 100 cars were doing burnouts and speeding around the streets.\nPolice believe the Ford involved in the high-speed drag race had been at the event and moved on to 'baiting' other drivers once officers dispersed the crowds.\nWitnesses said they saw the sedan and Mr Churchill's utility truck travelling at high speed along the Western Ring Road before the teenager lost control and crashed off the side of the bridge.\nPolice responded to the event, known as the Northern Skids, after receiving reports that up to 100 cars were doing burnouts and speeding around the streets\n'This is just a classic case of testosterone, adrenaline, young fellows and fast cars. It's just a dreadful mix,' major collisions investigator Detective Inspector Bernie Rankin said\nMajor collisions investigator Detective Inspector Bernie Rankin said the cars were side by side and travelling around 160 kilometres per hour before the utility truck careered through the barrier.\n'This is just a classic case of testosterone, adrenaline, young fellows and fast cars. It's just a dreadful mix,' he told reporters at the scene.\nA witness who was driving to work told 3AW the cars gave him a 'fright' as they sped past him, before he saw the car smash though the railing and explode in flames.\n'As I drove on further, after I gathered myself I've seen the other car on the side of the road pulled up with his hazard lights and on his phone, so I dare say they knew each other,' he told 3AW.\nPolice are trying to locate the silver 20030-2004 Ford sedan with green P-plates to establish if there was contact between the vehicles before the crash.\n'This vehicle was seen encouraging other vehicles to get involved in a drag race,' Inspector Rankin said.","url":"https://www.dailymail.co.uk/news/article-3421049/Chilling-footage-shows-moment-Melbourne-teens-Ivana-Clonaridis-Harley-Churchill-died-fiery-crash-drag-race-gone-wrong.html"}
