{"authors":[],"date_download":"2018-10-22 21:20:02","date_modify":"2018-10-22 21:20:02","date_publish":"2014-06-04 22:44:07","description":"The families made the videos public in the wake of the rescue of Army Sgt. Bowe Bergdahl.","filename":"data/vaneerConsumption/VideosShowingMissingCoupleHeldinAfghanistanMadePublic.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/488326/140604-missing-couple-jms-1854_be821f0b9a24ad56ffa03e3e2d53d943.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_videos-showing-missing-couple-held-afghanistan-made-public-n122946_1540243202.html","title":"Videos Showing Missing Couple Held in Afghanistan Made Public","title_page":"Videos Showing Missing Couple Held in Afghanistan Made Public","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA pregnant American woman and her Canadian husband who disappeared in Afghanistan in late 2012 can be seen asking the U.S. government for help in undated videos obtained by The Associated Press.\nThe videos were emailed to the woman's father last July and September by an Afghan man who identified himself as having ties to the Taliban. They were later provided exclusively to the AP, which published the footage Wednesday.\nIn one video, Caitlan Coleman, dressed in a black garment that shows only her face, asks the U.S. government to help free her and her husband, Joshua Boyle, from their Taliban captors.\n\"I am a prisoner of the Taliban, my husband and I here,\" Coleman says in English. She sits next to Boyle, who has a dark beard, in an unknown location.\nThe couple's child, who would be roughly 18 months old, is not shown in the videos. The families told the AP they do not have information about the name or gender of the child.\nU.S. law enforcement officials investigating the couple's disappearance consider the videos authentic but say they carry limited investigative value since it isn't clear when or where they were made, according to the AP.\nThe families made the videos public in the wake of the rescue of Army Sgt. Bowe Bergdahl, who was released from Taliban custody in exchange for the release of five Taliban suspects at Guantanamo Bay.\nThe families say they are disappointed their children and grandchild were not freed as part of the same deal, the Associated Press reported.\n“It would be no more appropriate to have our government turn their backs on their citizens than to turn their backs on those who serve,” Patrick Boyle, the man’s father, told the AP.","url":"https://www.nbcnews.com/news/us-news/videos-showing-missing-couple-held-afghanistan-made-public-n122946"}
