{"authors":["Dave Burke For Mailonline"],"date_download":"2018-10-23 02:52:41","date_modify":"2018-10-23 02:52:41","date_publish":"2017-04-26 14:12:24","description":"Dashcam footage from the deputy's car shows the vehicle strike the motorcycle, which was being driven by Robert Lee Clark, Jr.","filename":"data/vaneerConsumption/VideoshowsmomentSouthCarolinaofficerkilledbiker.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F9FD39900000578-0-image-a-8_1493212321673.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447506_Video-shows-moment-South-Carolina-officer-killed-biker_1540263161.html","title":"Video shows moment South Carolina officer killed biker","title_page":"Video shows moment South Carolina officer killed biker | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A deputy has been suspended after a motorcyclist was killed during a chase, in which the law enforcer twice crashed into the bike, sending the rider to his death.\nDashcam footage from the deputy's car shows the vehicle strike the motorcycle, which was being driven by Robert Lee Clark, Jr.\nThe 30-year-old died at the scene of the collision in Berkeley County in South Carolina.\nDeputy James Vansant's cruiser was travelling at speeds of around 90mph before the crash, and the sheriff's office has said Mr Clark died because the bike was in the wrong gear, RT reports.\nThe motorcyclist died after the collision following a five minute, eight mile police chase\nRobert Lee Clark, Jr died at the scene of the collision involving a deputy's SUV\nA five-minute video of the chase, posted on YouTube by the Berkeley County Sheriff's Office, shows the motorbike speeding away from Vansant's SUV.\nBosses say the collision was not deliberate, and the motorcyclist can be seen braking before the crash.\nClark, who was wanted for speeding, was not wearing a helmet when he crashed, it has emerged.\nClark was chased after deputy James Vansant spotted his motorcycle speeding\nOfficers found cannabis on his person after the crash, which happened last Wednesday.\nA statement from the department said Vansant has been placed on administrative leave while an internal investigation is carried out.\nVansant said he was looking for speeding vehicles when he saw Clark's motorcycle doing 66mph in a 45mph zone.\nThe eight-mile chase saw the motorbike reach speeds of up to 111mph.","url":"https://www.dailymail.co.uk/news/article-4447506/Video-shows-moment-South-Carolina-officer-killed-biker.html"}
