{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-23 01:53:25","date_modify":"2018-10-23 01:53:25","date_publish":"2016-01-29 16:02:36","description":"The shocking video shows a man from Leeds, West Yorkshire, launching a foul-mouthed rant at his pet dog, and poking him forcefully with a hammer, before slamming the boot on him.","filename":"data/vaneerConsumption/VideoshowsmanscreamingatEnglishbullterrierandpokingitwithahammer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B329BA00000578-0-image-a-103_1454081777068.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423010_Shocking-video-shows-man-screaming-English-bull-terrier-poking-hammer-poor-pup-cowers-car-boot_1540259605.html","title":"Video shows man screaming at English bull terrier and poking it with a hammer","title_page":"Video shows man screaming at English bull terrier and poking it with a hammer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the shocking moment a man is caught on camera abusing his dog in the boot of a car before shutting him in.\nThe man, from Leeds, West Yorkshire, was seen launching a foul-mouthed rant at the English bull terrier, while poking him forcefully with a hammer.\nIn the video, he can be heard shouting 'get out' to the dog, named Denver, who is sat in the boot before then telling him to 'die'.\nThe man, from Leeds, West Yorkshire, was seen launching a foul-mouthed rant at the English bull terrier\nPaul Anthony Archer, 50, of Glensdale Road, appeared before Leeds Magistrates' Court yesterday.\nHe admitted failing to meet the needs of the dog by failing to allow him to exhibit normal behaviour and has now been disqualified from keeping animals for five years.\nRSPCA inspector Gemma Fowler said: 'Watching the footage, it's clear that Denver is frightened of the way his owner is behaving towards him.\n'Mr Archer wants him to get out of the car, and is becoming increasingly angry and violent because he is refusing to do so, finally slamming the boot closed on him and shouting at him to 'die'.\nThe video shows the man poking the dog forcefully with a hammer, before slamming the boot on him\n'We all get angry sometimes, but Mr Archer's behaviour towards Denver is totally unacceptable.'\nIn mitigation, the court heard that the defendant was cleaning the car when Denver jumped in and broke the screen on an iPad on one of the car seats.\nMr Archer was also sentenced to a 12-month community order with rehabilitation for his unresolved aggressive manner, and ordered to pay £750 costs.\nHe was deprived of Denver who will now be rehomed by the RSPCA.\nMr Archer was sentenced to a 12-month community order with rehabilitation for his unresolved aggressive manner\nRSPCA inspector Fowler said: 'Denver is a smashing dog with a great personality and happily he will now be able to go to the kind of home he deserves.\n'I'd like to say thank you to the person who filmed and sent this footage to us, without which we wouldn't have had a case. They have changed this dog's life.'\nThe footage was sent into the RSPCA anonymously.","url":"https://www.dailymail.co.uk/news/article-3423010/Shocking-video-shows-man-screaming-English-bull-terrier-poking-hammer-poor-pup-cowers-car-boot.html"}
