{"authors":[],"date_download":"2018-10-22 22:10:34","date_modify":"2018-10-22 22:10:34","date_publish":"2014-06-09 08:40:26","description":"Nguyen Duc Kien, founder of Asia Commercial Bank, was found guilty of a litany of crimes and sentenced to 30 years.","filename":"data/vaneerConsumption/VietnamTycoonNguyenDucKienJailedfor30YearsOverFraud.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/495801/140609-vietnam-banker-430a_8d3c962541af29136a73ee2dfc5fc78a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_vietnam-tycoon-nguyen-duc-kien-jailed-30-years-over-fraud-n126001_1540246234.html","title":"Vietnam Tycoon Nguyen Duc Kien Jailed for 30 Years Over Fraud","title_page":"Vietnam Tycoon Nguyen Duc Kien Jailed for 30 Years Over Fraud","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"The defendants' activities manipulated the domestic financial and money markets, badly affecting the monetary and fiscal policies within the country,\" the court said in its verdict.\nVietnam's communist government says it is in the midst of a shake-up to strengthen its beleaguered banking and financial systems after a series of scandals that went undetected during boom growth of 2003-2007, when the sector saw seemingly unrestrained expansion.\nLax oversight and a spree of easy lending, much to state-run firms, has left Vietnam with high levels of non-performing loans that independent economists say could shackle growth for years without aggressive counter-measures.\nKien, once owner of former Vietnamese soccer league champions Hanoi ACB, was found to have illegally traded gold and stocks totalling 21.5 trillion dong ($1 billion) and of evading 25 billion dong in tax through his six investment companies.\nThe court said the defendants exploited loopholes and loose regulations by using fake documents and manipulating data on credit growth, profits and equities values.\n- Reuters","url":"https://www.nbcnews.com/news/world/vietnam-tycoon-nguyen-duc-kien-jailed-30-years-over-fraud-n126001"}
