{"authors":[],"date_download":"2018-10-30 01:07:45","date_modify":"2018-10-30 01:07:45","date_publish":"2018-07-13 14:13:49","description":"Vietnamese religious minorities face persecution in the communist country. It's opened up economically. Time for more religious freedom.","filename":"data/vaneerConsumption/VietnameseReligiousMinoritiesContinuetoFacePersecution.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/Vietnam-Religion.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861665.html","title":"Vietnamese Religious Minorities Continue to Face Persecution","title_page":"Vietnamese Religious Minorities Continue to Face PersecutionThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"On Wednesday, July 11th, the United States Embassy in Vietnam issued a statement criticizing a decision by a Vietnamese appeals court to continue to detain three human rights activists for “propaganda against the State.” These activists were not part of some vast effort to topple the Communist regime in Vietnam, but rather, took issue with various government abuses of human rights and other policies, and for this, they have been imprisoned.\nVietnam today isn’t the same country it was when the last helicopter left Saigon. While our other Asian cold war enemy, North Korea, remained stagnant and highly repressive until recently, Vietnam has actually improved, both economically and in the realm of freedom in the decades since the war. Vietnam has touted improvements in the area of human rights and civil liberties in recent years, attempting to distinguish itself from the nightmare years of the early Communist regime.\nInterestingly enough, the constitution of Vietnam, just like the US constitution, guarantees religious freedom, per a 2013 update. While this commitment looks good on paper, religious freedom in practice is lacking.\nMuch of the widescale and violent discrimination against religious groups in Vietnam comes from both the provincial and local level. While the national government is not as harsh as the many of the localized entities, they still regularly persecute breakaway Buddhist groups and religious dissenters. A report released by the United States Commission on International Religious Freedom highlights this ongoing problem.\nWhile we are not seeing widescale religious violence as is found in places like Nigeria, we are seeing faith groups regularly harassed, imprisoned, and tortured by local governments and extrajudicial groups acting on behalf of the government. Groups that are subject to this persecution include local religions such as Caodaism, offshoot Buddhist groups, and Christian groups.\nIn 2017 Hoa Hao Buddhists in An Giang, in Southwest Vietnam, were consistently harassed, placed under house arrest, and assaulted by local police forces. In a similar ongoing case, members of the Khmer Krom religious and ethnic group in the Tra Vinh Province regularly have their property confiscated and their temples destroyed.\nMembers of the Duong Van Minh religion, which combines elements of Christianity and traditional Hmong practices, regularly have their religious funeral sheds destroyed by the government and are arrested and assaulted when they try to protect these sacred sites.\nMontagnards, an ethnic group that resides in Vietnam’s central highlands, and that is majority Christian, are also regularly persecuted by the state. Members of the group are regularly prevented from holding religious ceremonies and harassed and interrogated by police for their evangelism, which is seen as a threat to the Communist order. Montagnards have also had their land confiscated by the government, and many have sought asylum in Cambodia and elsewhere to escape oppression.\nIn addition to these instances of discrimination, the government and it’s supporters have targeted members of religious communities that criticize action taken by the government. In October of 2017, members of a pro-government mob harassed Catholic priests who were critical of the government response to an environmental crisis. A similar group also harassed another Catholic priest for Facebook posts critical of the government.\nAll of these instances were laid out in the report put together by USCIRF, which sent the Vietnamese government into a scramble. In response, a representative of Vietnam’s foreign ministry stated that “Vietnam has spared no effort in completing its legal system and policy on religion and belief.”\nWhile the representative is correct in saying that progress has been made on religious freedom, she underplayed the existence of ongoing discrimination. The United States has at times been highly critical of Vietnam’s religious persecution. From 2004 to 2006, Vietnam was listed as a “Country of Particular Concern” (CPC), on religious freedom. The USCIRF has recommended this designation every year since 2002, but only during two years did the State Department actually designate the country as such.\nDue to this designation, the United States and Vietnam moved to create an agreement that would improve religious liberty in the country so that Vietnam may be removed from that list. And the designation was removed only two years after Vietnam made slight changes to improve the situation. In the last decade, progress has continued at a snail’s pace.\nWhile there have certainly been improvements for religious freedom in Vietnam, people are still being harassed, imprisoned, assaulted, and even killed for their religious beliefs. A nudge from the State Department, such as a CPC designation, could speed up the process in the true realization of religious freedom in Vietnam.\nThis article is part of an ongoing series on religious freedom around the world. Articles have also been published on Indonesia and Nigeria.","url":"https://spectator.org/vietnamese-religious-minorities-continue-to-face-persecution/"}
