{"authors":["Associated Press"],"date_download":"2018-10-22 23:16:22","date_modify":"2018-10-22 23:16:22","date_publish":"2016-01-28 11:56:30","description":"WASHINGTON (AP) — It's one thing to attack Donald Trump when he's standing on the presidential debate stage. But what about when he's not? It's a complicated...","filename":"data/vaneerConsumption/ViewersGuideTrumpdramaclosingargumentsbeforeIowa.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:903a99cfe55c49f3b65bbcc97ca786b9-4vVdYopwYQ7f641721b07acd5ff5-359_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420541_Viewers-Guide-Trump-drama-closing-arguments-Iowa_1540250182.html","title":"Viewer's Guide: Trump drama, closing arguments before Iowa","title_page":"Viewer's Guide: Trump drama, closing arguments before Iowa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Viewer's Guide: Trump drama, closing arguments before Iowa\nWASHINGTON (AP) — It's one thing to attack Donald Trump when he's standing on the presidential debate stage. But what about when he's not?\nIt's a complicated question for the seven presidential candidates in the seventh prime time Republican presidential debate, who expect a no-show from the front-runner who has eclipsed the contest for months — on the brink of Monday's Iowa caucuses.\nTrump has declared that because of what he calls unfair treatment by the network hosting the debate, Fox News Channel, he'll have his own event at the very same time about two miles away at Drake University.\nRepublican presidential candidate, Sen. Ted Cruz, R-Texas, speaks Wednesday, Jan. 27, 2016, in West Des Moines, Iowa. (AP Photo/Paul Sancya)\nHis absence puts the rivals in a tough position while opening potential opportunity — do they go after him and give him even more attention? Or ignore him and fill the vacuum with their best possible closing arguments, grabbing attention that's been tough to come by when Trump and his big personality fill the air time? Florida Sen. Marco Rubio, who is in third place in Iowa, tested a new line Wednesday, calling the debate drama a \"sideshow\" and the election choices, \"serious.\"\nAlso in a delicate spot is the network, which has engaged in a fraught relationship with Trump for months after he tangled with moderator Megyn Kelly in the first debate in August. Fox News Channel has refused to remove Kelly from the question panel and issued a sarcastic statement mocking Trump for demanding they do so. The standoff poses a challenge for the network, which is popular with conservatives, over how it handles its relationship with the GOP presidential front-runner in real time — especially in his absence.\nThe main debate stage will once again feature Rand Paul, who was bumped to the undercard debate last time. Also appearing: Sen. Ted Cruz, Ohio Gov. John Kasich, New Jersey Gov. Chris Christie, former Florida Gov. Jeb Bush, Rubio and retired neurosurgeon Ben Carson.\nHere are some things to watch for during the debate:\n___\nTRUMP, OBVIOUSLY\nTrump's debate boycott tests whether any word or action by the billionaire can dent his support among a core of conservative voters who want a change in Washington. Trump has predicted that Iowans won't care whether he attends the debate, and even if he did, he wouldn't be talking to the nation anyway. He'd be speaking to Iowans who will caucus Monday, using every moment to win the contest at hand. \"Being second is terrible,\" he has said. Another advantage to holding his own event: no moderators or rivals to challenge him.\nCRUZ\nThe Texas senator and national debate champion held his own against Trump in past debates as the two have competed for the lead in Iowa. Without Trump on the stage, does Cruz adopt the posture of the de facto debate leader? That could risk looking presumptuous when a sizable percentage of Iowans say they could change their minds about whom they support. Cruz has been testing some humor, with an edge. \"Apparently, Megyn Kelly is really, really scary, and Donald is a fragile soul,\" Cruz said. \"If she asks him mean questions, I mean, his hair might stand on end.\"\nTHE MODERATORS\nLook for someone on the panel of moderators to acknowledge the elephant that's not in the room. But whether moderators will spend more time than that on Trump, who has spent months in a spat with Kelly over what he says is unfair treatment, is a delicate question. Late Wednesday, Trump tweeted that it was Fox's mocking press release that inspired him to skip the debate, more so than Kelly. She has been adamant about playing the dispute straight, and has the firm backing of news executives.\nTHE OTHER CANDIDATES\nJump ball!\nThe debate gives the field-minus-Trump more of a chance to make the most powerful closing arguments possible in the final face to face, televised meeting before the caucuses. Candidates such as Ohio Gov. John Kasich, who is looking past Iowa for a strong finish in next-up New Hampshire, have had little speaking time in past debates. The opportunity also is ripe for Rubio, who is seeking a strong finish in Iowa to claim the establishment mantle if outsiders Trump or Cruz falter. Look, too, for Bush to try to make gains.\n___\nFollow Laurie Kellman on Twitter at http://www.twitter.com/APLaurieKellman","url":"https://www.dailymail.co.uk/wires/ap/article-3420541/Viewers-Guide-Trump-drama-closing-arguments-Iowa.html"}
