{"authors":["Andrew Bullock For Mailonline"],"date_download":"2018-10-23 00:40:06","date_modify":"2018-10-23 00:40:06","date_publish":"2017-03-16 10:10:08","description":"The backlash continues for ITV's The Nightly Show. Wednesday night's episode saw viewers twig that guest host Davina McCall's on-set family photo had big red dots plastered over the faces.","filename":"data/vaneerConsumption/ViewersleftperplexedaboutDavinaMcCallsfamilyphoto.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E54064D00000578-0-image-a-66_1489666631083.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319534_Viewers-left-perplexed-Davina-McCall-s-family-photo_1540255206.html","title":"Viewers left perplexed about Davina McCall's family photo","title_page":"Viewers left perplexed about Davina McCall's family photo | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The backlash continues to escalate for ITV's The Nightly Show.\nThis time, Wednesday night's episode saw viewers twig that guest host Davina McCall's on-set family photo of her husband and children had big red dots plastered over the kids' faces.\nAs each new host appears on the series (week one was David Walliams, week two was John Bishop) they decorate the set with items of their own memorabilia.\nScroll down for video\n'What's the point?' Viewers are left perplexed as to why Davina McCall has a framed family photo on The Nightly Show with half of the faces blurred out\nAnd Davina's framed photo sat pride of place on the hosting desk - but looked somewhat ridiculous with her three childrens' faces marked and consequently not visible.\nTwitter users went online to question this.\nAlthough some understood that the 49-year-old host didn't want to plaster her offsprings' faces onto national TV, it begged the question of why she'd bothered bringing a photo at all.\nTaking people into her bedroom: Davina McCall, 49, faked an orgasm live on air after discussing how hackers could control people's sex toys on The Nightly Show on Wednesday\n'On #thenightlyshow Davina has a fam picture on the desk, with red dots over her kids faces. I get why, but surely just not have the photo?' one person tweeted.\n'What's the point of Davina's family photo on #TheNightlyShow? There's red dots all over it!' another typed.\n'Why are the faces in the picture next to Davina blocked out? #thenightlyshow,' asked somone else.\nDavina's week seems to have gotten worse, despite getting off to a positive start on the much-criticised series.\nShe faced some backlash for being 'wooden' when it came to her auto-cue reading abilities on Tuesday.\nBut Davina was certainly animated on Wednesday as she tried to entertain the dwindling audience by faking an orgasm on The Nightly Show.\nThe TV presenter was discussing how hackers have the ability to take over people's smart phone controlled sex toys, before a buzzer sounded and she began embarrassingly performing the raunchy deed.\nHot under the collar: After discussing the plight of sex toys, a buzzer sounded and Davina began jumping around in her chair while trying to emulate an orgasm\nHer racy behaviour somewhat jarred with her ladylike look, with the star wearing a pink blazer and pussybow blouse.\nDuring the skit, Davina gurned and squirmed as she attempted to re-create an 'The Big O - while her audience were left in hysterics.\nDavina's cringeworthy display comes after she was subjected to harsher critique as she helmed the American-style talk show on Tuesday, which featured guests David Baddiel and Sara Cox.\nLooks can be deceiving: While the star looked ladylike in pink with a structured blazer, printed top and dangling black bow-tie - her actions were anything but refined\nThe issue seemed mostly to revolve around her auto-cue reading ability.\n'Rubbish presenting by Davina McCall tonight... clearly reading off the auto-cue,' someone posted to Twitter, getting the ball rolling on the nightly viewer tirade.\n'Davina McCall reading the auto-queue like a 6 year old read Biff, Chip & Kipper!' came a second moaning tweeter.\n'Fair enough reading off an auto-cue but be a little more subtle Davina McCall,' another posted.\nAnother disgruntled (and sexist) commentator wrote: 'Jesus Christ Davina McCall is dreadful at presenting #TheNightlyShow - It needs a funny guy to present it. And not John Bishop.'\nHere we go again: Davina McCall started to face the same backlash her predecessor presenters John Bishop and David Walliams had faced over the previous fortnight, as she hosted The Nightly Show for a second night\nA pleasant surprise: Davina quit Twitter for a week while she hosted ITV's Nightly Show fearing a deluge of mean tweets only for viewers to flood her Twitter feed with praise\n'Oh my god just bring back the News At Ten!' came another tweet, followed by: 'I just can't abide by the cringe of Davina this week!'\nAnother said the 49-year-old TV pro 'was looking lost'.\nThere was still a smattering of positive feedback, with one person writing 'I actually really like The Nightly Show with Davina' and another typing: '@ThisisDavina has really turned the #TheNightlyShow arround. Until this week it's been dire but Davina is amazing.'\nHarsh: 'Fair enough reading off an auto-cue but be a little more subtle Davina McCall,' someone posted\nDavina therefore decided to quit Twitter for a week when she hosted the show, expecting a deluge of mean-spirited tweets.\nAnd although this seems to now have happened, her debut on Monday was mostly declared a success.\nHaving previously informed her Twitter followers that she would be off the site until Saturday because of her hosting gig - and told the haters to 'fill yer boots' - the reaction was quite the opposite with viewers flooding her Twitter feed with praise for her comedic presenting skills.\nTaking precautions: Davina informed her followers that she was leaving Twitter so they could 'fill yer boots' and criticise her on the social media site only for the opposite to happen\nFans: Tweets came flooding in to declare her hosting gig a great success\n'Best show yet': The Twitter users declared that Davina was a better host than David Walliams and John Bishop\nFalling flat: After high praise from fans the night before, Davina was subject to harsher critique as she helmed the American-style talk show on Tuesday\nAuto-boo! The issue seemed mostly to revolve around her auto-cue reading ability\nOne wrote: 'Not watched a single episode of this new ITV Nightly Show, until now - get Davina on it every night and I'm sold!'\nThe veteran presenter displayed her skills on her first episode which saw her interviewing Boy George and The Replacement actress Vicky McClure.\nDavina filled the show with references to her wild youth spent falling in and out of night clubs and added in jokes about vibrators and her married sex life, or lack thereof.\nShe made it clear from the beginning that the show would be a sweary one.\n'It's 10pm,' the fitness fan announced, 'so I'm going to say f*** and b*****ks as much as I like.'\nOn the sofa: The second of Davina's The Nightly Show episodes featured guests David Baddiel and Sara Cox\nStill got the moves: Viewers were delighted by Davina's foul-mouthed appearance and jokes about her married sex life, or lack thereof, the night before\nHer success came just days after former GBBO presenters Mel and Sue got 'cold feet' about hosting the beleaguered show.\nAn ITV insider told The Sun: 'It looked as though it was all but finalised, but they never quite signed on the dotted line.\n'Unfortunately the talks collapsed when they decided they couldn’t possibly make their diaries fit with ITV and have had to turn down the offer.'\nThe positive reaction must be all the sweeter for Davina after her own BBC chat show, called Davina, was axed after just eight episodes a decade ago.\nA long wait: The initial positive reaction must have been all the sweeter for Davina after her own chat show, Davina, was axed by the BBC after just eight episodes a decade ago","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319534/Viewers-left-perplexed-Davina-McCall-s-family-photo.html"}
