{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 04:31:55","date_modify":"2018-10-23 04:31:55","date_publish":"2017-04-26 16:08:57","description":"The village of East Bergholt in Suffolk is considering trying to defect to Colchester Borough Council in Essex to protect itself against a new housing development.","filename":"data/vaneerConsumption/VillagefamousinConstableartcouldleaveSuffolk.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA07B2900000578-0-image-a-48_1493219877231.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448140_Village-famous-Constable-art-leave-Suffolk_1540269115.html","title":"Village famous in Constable art 'could leave Suffolk'","title_page":"Village famous in Constable art 'could leave Suffolk' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A picturesque village 'under siege' from builders is set to try to leave Suffolk and become part of Essex in a dramatic bid to prevent .\nDevelopers are planning to build a further 144 houses in East Bergholt, which protestors say would have a 'devastating impact' on the picturesque hamlet, which had a population of just 2,765 in the 2011 census.\nHistoric East Bergholt sits in the Stour Valley landscape made famous by Romantic painter John Constable, one of the country's most celebrated artists.\nBut now the 'furious' parish council is seriously considering breaking free from Babergh District Council and joining Colchester Borough Council.\nThe village of East Bergholt, pictured, in Suffolk is considering trying to leave the county and become part of Essex to avoid a new housing development\nPlans are in place to build 144 new homes in the village, which would have a 'devastating impact' on the area, pictured, according to residents\nEast Bergholt landmarks including Willy Lott's Cottage have been made famous around the world thanks to the art of John Constable, who used the building in The Hay Wain, pictured\nIt would mean Suffolk would lose the sights of Flatford Mill and Willy Lott's Cottage, well known around the world.\nBoth were painted by Constable, who was born in East Bergholt in 1776 and died in 1837.\nThe bombshell scheme was suggested at East Bergholt Parish Council's annual meeting.\nCouncil chairman Cllr Paul Ireland said: 'It would be a real wrench to leave Suffolk.\n'But the decision we would have to make is whether it is better to be in Suffolk, and have a lot of houses built against our wishes, or to be in Essex and have better protection?'\nConstable also made Flatford Mill world famous in this titular painting, pictured, and if the village were to move counties, Suffolk would lose a claim to fame\nHe said: 'We have a Colchester postcode and an Essex address already.'\nCllr Ireland said he will ask the council to set up a working party to explore the possibility of defecting to Colchester Borough Council.\n'If you look at Dedham [in Essex] there are no 'no to 144 houses' signs.\n'Colchester seems to place more value on protecting heritage assets,' he said.\nCllr Ireland also insisted that the world-famous attractions immortalised by Constable, the region's most hallowed son, should be protected from housing for ever.\nParish council chairman Paul Ireland, right, and action group leader Peter Dent, left, have been battling the plans for the homes but say Suffolk's Babergh District Council is not offering enough protection\nThe entire area is coming under increasing pressure because Babergh District has recently been judged to have less than five years of housing land supply.\nThat means local planning control is overruled in presumption of national policy.\nPeter Dent, chairman of the East Bergholt action group, said: 'There's such an ongoing battle with Babergh and the planning department there are 101 reasons [we should leave Babergh].\n'Babergh is fully intent, I'm absolutely certain, on approving the applications being reheard for a second time.\n'It's been a constant war against the planning department for however long.'\nMr Dent added: '[Moving to Colchester] might take time but so what?\n'Colchester appears to have sympathy for areas of outstanding natural beauty and heritage sites.'\nA Babergh District Council spokesman said they do listen to the people of East Bergholt, as shown by chief executive Arthur Charvonia attending the annual meeting.\nSuffolk's borders have remained largely unchanged for decades.\nThe last major movement in 1974 saw six villages lost to Norfolk under the Local Government Act 1971.\nVillages, parishes and districts can be moved from one county to another by acts of parliament and Boundary Commission reviews.\nThe parish council is considering trying to leave Suffolk and Babergh District Council and move its boundary into Essex as part of Colchester District Council\nThey want East Bergholt, pictured, to 'defect' to Colchester Borough Council because it 'seems to place more value on protecting heritage assets'\nThe latest review will report in 2018.\nOne of the biggest changes is likely to see the Cambridgeshire villages of Melbourn, Bassingbourn and the Mordens join Hertfordshire and in the process changing their local planning authority.\nBut the key driver for boundary changes is reflecting population changes and maintaining equal parliamentary constituencies.\nThe Commission is highly unlikely to accept East Bergholt's arguments over housing policy concerns.","url":"https://www.dailymail.co.uk/news/article-4448140/Village-famous-Constable-art-leave-Suffolk.html"}
