{"authors":["Associated Press"],"date_download":"2018-10-23 01:23:48","date_modify":"2018-10-23 01:23:48","date_publish":"2016-01-11 12:13:40","description":"Evoking memories of Operation Desert Storm during the Gulf War, an American board member at Aston Villa recently urged fans of the Premier League's last-plac...","filename":"data/vaneerConsumption/VillawellonwaytojoininglistoffallenEnglishgiants.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393782_Villa-way-joining-list-fallen-English-giants_1540257828.html","title":"Villa well on way to joining list of fallen English giants","title_page":"Villa well on way to joining list of fallen English giants | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Villa well on way to joining list of fallen English giants\nEvoking memories of Operation Desert Storm during the Gulf War, an American board member at Aston Villa recently urged fans of the Premier League's last-place club not to give up hope in its increasingly desperate bid to escape relegation.\n\"We were standing next to minefields separating Saudi Arabia and Kuwait,\" Gen. Charles C. Krulak, a former Commandant of the Marine Corps, recounted in British newspaper The Sun. \"There were trenches filled with gas, massive artillery ready to rain down on us and the threat of chemical attack.\n\"My next-in-command looked at me and said, 'How are we gonna get through this?' I said, 'We're gonna do it, we're gonna go through this like a knife through butter.' It's easy to give up, but you can't do that.\"\nThis particular call to arms, however, looks to be in vain.\nVilla, a seven-time English champion and European Cup winner in 1982, is an odds-on favorite to lose its unbroken status as a Premier League club. Winless since the opening day of the season on Aug. 8, the biggest team from central England — boasting famous fans in Prince William and British Prime Minister David Cameron — heads into a home match against Crystal Palace on Tuesday 11 points from safety with 18 games remaining, and in turmoil on and off the field.\nTwo weeks ago, disgruntled supporters chanted, \"You're not fit to wear the shirt,\" as Villa players prepared to leave the stadium in Sunderland after a 3-1 loss to the league's next-to-last team.\nOn Saturday, the atmosphere became more heated, with players requiring a police escort to get on the team bus as angry Villa fans vented their fury following a humiliating 1-1 draw at fourth-tier club Wycombe in the FA Cup.\nHow has it come to this? How has a team that finished sixth in the Premier League for three straight seasons in 2008-10 and has long been one of the most celebrated clubs in English soccer fallen this far?\nIt's a story of inertia and apathy in the boardroom, of strategic failures in recruitment, and of a squad that has been regularly stripped of its best players. The people in key positions at the club appear to be either unsuited to the task, not up to it, or simply don't want to be there.\nRandy Lerner, the former owner of the Cleveland Browns, bought Villa in 2006 for $104 million but has been looking to sell the club since May 2014, saying he was drained by the \"week-in, week-out battles.\"\nVilla's current manager is Remi Garde, hired in November as its sixth coach since 2010. Garde is a Frenchman with no previous coaching experience in England. Thrust immediately into a relegation dogfight, he has yet to win a game after 10 in charge. It sums up Villa's plight that in welcoming Garde to Villa Park, the club misspelt his name, saying on Twitter: (hashtag)WelcomeRemy.\nVilla has an American chief executive, Tom Fox, whose background is mainly in marketing and who risked intensifying fan ire by saying last week that the club was \"making progress\" because it has \"generated more revenue on both our shirt and kit deals and in our ability to control costs.\"\nFox arrived from Arsenal, as did newly hired sporting director Hendrik Almstadt, who brought with him the risky transfer strategy of buying young to get better value-for-money signings so they can be sold for a profit. The so-called \"Moneyball\" policy has been a disaster so far. Thirteen players — many unproven youngsters from overseas — joined last offseason for 50 million pounds ($72.5 million), but for a reported net spend of only 7 million pounds ($10 million) as Villa used the cash recouped from selling Belgium striker Christian Benteke and England midfielder Fabian Delph — its two best players.\nGarde has the January transfer window to work a miracle, but which potential savior wants to join a club destined for relegation? Garde may just have to work with the current set of players, who have proven this season they are simply not good enough.\nSince the departure of manager Martin O'Neill in 2010, Villa has been on the slide and only narrowly avoided relegation the last three seasons. A late-season surge under Tim Sherwood, Garde's predecessor, saw Villa escape the drop and reach the FA Cup final, where the team lost 4-0 to Arsenal at Wembley Stadium.\nVilla hasn't recovered from that loss, and is set to lose its top-flight status just when Premier League teams are about to carve up a record 9 billion pounds ($13 billion) from domestic and overseas TV deals over the next three years. The timing couldn't be worse and there's no telling when Villa will recover.\nOnce upon a time, Leeds, Nottingham Forest and Coventry were established top-division teams. Relegation led to financial problems and they've been unable to rebound. Could Villa be next?","url":"https://www.dailymail.co.uk/wires/ap/article-3393782/Villa-way-joining-list-fallen-English-giants.html"}
