{"authors":[],"date_download":"2018-10-22 20:28:52","date_modify":"2018-10-22 20:28:52","date_publish":"2014-06-01 21:17:50","description":"The month of June started off violent in Chicago with 10 people shot in less than four hours overnight.","filename":"data/vaneerConsumption/ViolentStarttoJune10Shotin4HoursinChicago.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_22/480346/140601-chicago-violence-jms-1547_3f3616c9266c46269241feb5ab0c0da5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_violent-start-june-10-shot-4-hours-chicago-n119836_1540240132.html","title":"Violent Start to June: 10 Shot in 4 Hours in Chicago","title_page":" Violent Start to June: 10 Shot in 4 Hours in Chicago","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFROM NBC CHICAGO\nThe month of June started off violent in Chicago with 10 people shot in less than four hours overnight.\nThe latest shooting took place around 3:45 a.m. in the 1900 block of North Tripp Avenue where police said a 26-year-old man was shot in the back of the head.\nThe man was driving on the block when a dark-colored SUV pulled behind his vehicle and opened fire before fleeing eastbound from the scene.\nThe man was taken to John H. Stroger Jr. Hospital of Cook County where he was listed in stable condition.\nJust before 3 a.m., a 49-year-old woman was shot in the city’s Little Village neighborhood.\nThe woman was standing with a group near the intersection of Washtenaw Avenue and 24th Street when a man approached on foot and fired into the group, striking her in the abdomen, according to authorities.\nThe woman was taken in critical condition to Mount Sinai Hospital, said Chicago Police News Affairs Officer Jose Estrada.\nAround 12:30 a.m., a man was killed and five women were injured in a shooting in the city’s South Austin neighborhood.\nPolice said a group was standing on a corner in the 500 block of North Lavergne when someone came out of an alley and opened fire.\nA 17-year-old man was shot in the back and was pronounced dead at Mount Sinai Hospital, according to police and the Cook County Medical Examiner’s office.\nA 17-year-old woman and a 14-year-old girl were both shot in the buttocks and listed in stable condition at Mount Sinai Hospital, police said.\nA 22-year-old woman suffered a wound to her back from bullet fragments and was taken in stable condition to West Suburban Medical Center. A 19-year-old woman was also being treated at West Suburban Medical Center for a wound to the arm.\nA 19-year-old woman was shot in the thigh and taken to Stroger Hospital, police said.\nJust after midnight, police said two people were shot in the 4300 block of Cermak Road.\nThe two were shot while standing in a group outside. Police said someone came from an alley and fired into the group.\nA 28-year-old woman was shot in the shoulder and taken in serious condition to Mount Sinai Hospital. An 18-year-old man was shot in the thigh and transported himself to Mount Sinai Hospital in stable condition.\nAccording to the Chicago Tribune, the group was shooting a music video for rapper Lil Kemo.\nAt least three people have been killed and 10 others shot across the city since Friday.\nAround 10:15 p.m. Saturday a 33-year-old man was shot in the leg and arm in the 2600 block of East 83rd Street. The man was walking with a friend when someone approached them on foot and fired at them. He was taken to Advocate Christ Medical Center in critical condition, police said.\nAround 10:30 p.m., a 16-year-old boy was killed in a shooting in the 3800 block of North St. Louis Avenue. The teen was walking with a group when shots were fired from a light-colored vehicle, striking the teen in the chest. He was pronounced dead at Illinois Masonic Medical Center.\nFifteen minutes earlier, a 35-year-old man was shot in the 1800 block of South Racine Avenue in the city’s Pilsen neighborhood. He took himself to Stroger Hospital with a wound to the buttocks and was listed in stable condition.\nAround 9:20 p.m. a man walked into Holy Cross Hospital with a graze wound to his ankle. The man told police he had been shot in the 7900 block of South Paulina Street in the Gresham neighborhood but no crime scene was found, Estrada said.\nAround 7:40 p.m. two people were shot in the 7900 block of South Champlain Avenue. A 23-year-old man was taken to Advocate Christ Medical Center in stable condition with a wound to the leg and 25-year-old woman refused treatment for a graze wound to the top of her foot.\nTen minutes earlier, a 26-year-old man was shot in the 7100 block of South Seeley Avenue. The man was standing in an alley when he heard shots and felt pain, police said. He was taken to Holy Cross Hospital in good condition with a wound to his shoulder.\nAround 4:15 p.m., police said a 24-year-old man was shot while standing in the 8500 block of South Marquette Road. He was taken to Advocate Christ Medical Center in critical condition.\nAt 3:19 p.m. a 21-year-old man was fatally shot in the 700 block of East 87th Street. The man suffered multiple gunshot wounds to the body and was pronounced at the scene, police said.\nEarlier Saturday, around 1:15 a.m., a 21-year-old woman was shot while walking with a group in the 2000 block of West 68th Street. Police said shots were fired from a passing black car and the woman was driven to Holy Cross Hospital by a friend where she was listed in good condition.\nAt least one person was killed and two others wounded Friday.\nPolice said the city has seen a 7 percent increase in shootings compared to 2013 and an 11 percent increase in shooting victims.\nThe year so far, however, is tied with 2013 for the fewest murders in the first five months of the year since 1963.","url":"https://www.nbcnews.com/news/us-news/violent-start-june-10-shot-4-hours-chicago-n119836"}
