{"authors":["John Hayward"],"date_download":"2018-10-30 20:55:59","date_modify":"2018-10-30 20:55:59","date_publish":"2018-08-01 21:43:13","description":"Frustration boils over into violence as the results of Zimbabwe's first post-Mugabe presidential election are kept under wraps.","filename":"data/vaneerConsumption/ViolenceinZimbabweasPresidentialElectionResultsDelayed.json","image_url":"https://media.breitbart.com/media/2018/08/wi/ap/01/fd6970_zimbabwe-elections-73669-opposition-mdc-party-supporters-protest-in-streets-e1533159157786.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_08_01__1540932959.html","title":"Violence in Zimbabwe as Presidential Election Results Delayed","title_page":"Violence in Zimbabwe as Presidential Election Results Delayed","title_rss":"NULL","source_domain":"breitbart.com","text":"The air of cautious optimism surrounding Zimbabwe’s first presidential election since the fall of dictator Robert Mugabe was shattered with violence on Wednesday as allegations of vote rigging flew, property was vandalized, riot police and military forces were deployed, and gunshots rang out in the streets of the capital.\nFrustration mounted and supporters of the opposition grew restless when the results of parliamentary elections were announced early on Wednesday and the ruling ZANU-PF party claimed a sweeping two-thirds majority in the legislature.\nElection officials said votes were still being counted in the close race between incumbent interim President Emmerson Mnangagwa of ZANU-PF and challenger Nelson Chamisa of the Movement for Democratic Change (MDC). The Zimbabwe Election Commission said on Wednesday that it will be at least another day before it can announce when the election results will be announced. European Union observers expressed concern over how long it was taking the ZEC to tabulate the results.\nChamisa, who previously alleged voter suppression and confidently predicted he would prevail in a fair tally of the votes, charged that the lopsided ZANU-PF victory in parliament was publicized early to pave the way for Mnangagwa to steal the election.\nInternational observers did not back up all of Chamisa’s allegations, but they did report “misuse of state resources, instances of coercion and intimidation, partisan behavior by traditional leaders, and overt bias in state media.” It seemed as if the international community was crossing its fingers and hoping that a relatively clean election by the very low standards of Zimbabwean politics would be good enough to keep the peace.\nThere were soon reports of violence in the streets, with MDC supporters burning tires and assaulting riot police. Peaceful demonstrators said in turn that they were beaten by soldiers deployed to reinforce the police. Reports were made of soldiers using whips to disperse protesters.\nThe first fatality was reported in the early afternoon when the Zimbabwean army opened fire on protesters and hit a man in the stomach. As many as three deaths were reported at the time of this writing. Fortunately, unrest appears to be largely confined to the streets of Harare while rural Zimbabwe reportedly remains calm.\nMnangagwa issued a statement blaming the MDC for the violence, accusing Chamisa of stirring up chaos to “disrupt the electoral process.”\n“We are seriously meant to wonder what this means. Are we at war?” a Chamisa spokesman responded.\nThe U.S. Embassy in Harare condemned the use of military force against protesters and urged the leaders of all parties to call for calm.\n“Zimbabwe has a historic opportunity to move the country towards a brighter future for all its citizens. Violence cannot be a part of that process,” the embassy said.\nMnangagwa issued a call for “patience and maturity” on Twitter:\nAt this crucial time, I call on everyone to desist from provocative declarations and statements. We must all demonstrate patience and maturity, and act in a way that puts our people and their safety first. Now is the time for responsibility and above all, peace — President of Zimbabwe (@edmnangagwa) August 1, 2018\nOn the other hand, Human Rights Watch caught a victorious ZANU-PF parliamentarian grumbling that police should “shoot to kill all idiots protesting in Harare.”\n“On Wednesday, the ‘New Zimbabwe’ disappeared in a puff of teargas and a hail of live ammunition, as soldiers attacked civilians and tanks rolled through the streets of Harare city center,” South Africa’s Mail and Guardian mournfully declared.\nThe Mail and Guardian castigated international observers for setting their standards much too low for election irregularities and accused the opposition of youthful overconfidence in the integrity of the vote, which had the double effect of prodding MDC supporters to see anything but a Chamisa victory as illegitimate.\n“There were 250 000-plus irregular entries on the voters roll; the design of the ballot paper was manipulated to give Mnangagwa extra prominence; the Zimbabwe Electoral Commission appeared biased in favour of the ruling party; the army was brought in to help transport ballot boxes; and state media did not even pretend to be nonpartisan,” the M&G noted, listing irregularities the international community was far too willing to ignore or downplay in its eagerness to certify a credible post-Mugabe election.","url":"https://www.breitbart.com/national-security/2018/08/01/violence-zimbabwe-presidential-election-results-delayed/"}
