{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:34:35","date_modify":"2018-10-30 20:34:35","date_publish":"2015-10-07 11:18:55","description":"The first scientific study on violence in German migrant centres has revealed conflict is part of “every day life” and is likely to increase.","filename":"data/vaneerConsumption/ViolenceInGermanMigrantCentresEveryDayLifeWillIncrease.json","image_url":"https://media.breitbart.com/media/2015/10/Screen-Shot-2015-10-07-at-11.57.46.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_10_07__1540931675.html","title":"Violence In German Migrant Centres 'Every Day Life,' Will Increase","title_page":"Study: Violence In German Migrant Centres 'Every Day Life,' Will Increase","title_rss":"NULL","source_domain":"breitbart.com","text":"The first comprehensive social and scientific study on violence in migrant centres in Germany has revealed that conflict is part of “everyday life” for inhabitants and is likely to increase. The “ultimate and primary cause” was ethnic and religious tensions, researchers said.\nResearcher also identified widespread drug and alcohol use as contributing to domestic violence, which was identified in every facility investigated.\n“Violent behaviour and aggressive verbal confrontations, threats or insults and serious damage to property were very commonly reported, indicating they are part of everyday life in the hired accommodation,” wrote researchers, who interviewed home managers, employees and randomly selected residents in almost all collective accommodation in Brandenburg.\nThe research, commissioned by Brandenburg Ministry of Interior, warned that the likelihood of altercations increasing in number and frequency is very high. This is due, they said, to the rapidly growing occupancy density of the homes and the fact that migrants have little employment opportunities and are increasingly diverse in their regions and ethnic origin.\nIn all homes investigated by the study there had been domestic violence, too. Often alcohol and drug use had acted as a “conflict accelerator,” researchers said.\nSince 2010, Saxony police investigated a total of 1630 crimes in migrant centres, and in the first six-month of this year alone there were ten killings in Saxony migrant homes. The data gathered by Germany language paper Die Welt counted 164 severe incidences of serious bodily harm between January and June and 184 “lesser” bodily harm, which bizarrely included rapes.\nJust yesterday, in a single day, around three hundred migrants brawled in a migrant centre in Braunschweig; Algerians fought Syrians in violence purportedly sparked by a theft. There was also a brawl in Hamburg where iron bars were used as weapons, and a rapid police response only narrowly averted another mass brawl in Oisterwijk.\nWhen asked about the causation of the brawls, almost all the residents and carers interviewed traced them back to a lack of understanding or tolerance for cultural difference. “Again and again what was named was hatred between different nationalities or religions as the ultimate cause,” the researchers write.\nHarald Olschok, chief executive of the Federation of Security Management, who provide security services to migrant centres, told Die Welt: “A particularly high potential for conflict arises in close occupation of mainly young men from different countries and different religions.”","url":"https://www.breitbart.com/europe/2015/10/07/study-violence-in-german-migrant-centres-part-of-everyday-life/"}
