{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:51:40","date_modify":"2018-10-30 21:51:40","date_publish":"2015-12-22 19:37:44","description":"Virginia AG Ends Concealed Carry Reciprocity With 25 States For Lack Of Gun Control","filename":"data/vaneerConsumption/VirginiaAGEndsConcealedReciprocitywith25StatesforLackofGunControl.json","image_url":"https://media.breitbart.com/media/2015/02/concealed-carry-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_22__1540936300.html","title":"Virginia AG Ends Concealed Reciprocity with 25 States for Lack of Gun Control","title_page":"Virginia AG Ends Concealed Reciprocity with 25 States for Lack of Gun Control | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On December 22 Virginia Attorney General Mark R. Herring (D) announced that he was ending reciprocity with 25 states for their lack of gun control.\nHerring claims the 25 states are “comparatively lax” when it comes to gun control laws–especially laws tied to expanding gun control to cover domestic violence and issues currently being pushed to ban gun ownership.\nThe 25 states are: “Alaska, Arizona, Arkansas, Delaware, Florida, Idaho, Indiana, Kansas, Kentucky, Louisiana, Minnesota, Mississippi, Montana, Nebraska, New Mexico, North Dakota, North Carolina, Ohio, Pennsylvania, South Carolina, South Dakota, Tennessee, Washington, Wisconsin and Wyoming.”\nAccording to The Washington Post, Herring said of out-of-state concealed permit holders, “While you are here, you are subject to the commonwealth’s gun laws.” In light of this, the states being cut by Herring are those which have not attached as many conditions and prohibition to their concealed carry permits. Herring contends that concealed carry “should be extended only to those who have gone through a process to prove a level of competency and responsibility.”\nIn doing this, Herring ignores the undeniable fact that concealed carry permit holders are among the most law-abiding citizens in the nation. But Republicans in Virginia say Herring’s actions are not really based on empirical evidence to begin with. Rather, they say this is just another example of Herring limiting the exercise of liberty of Virginians for the sake of implementing his political agenda.\nEnding reciprocity with 25 states does limit the exercise of Virginian’s liberty because numerous states have rules that prevent them from recognizing the concealed carry permits of states that refuse to recognize theirs in return. Because of this, once Herring ends reciprocity with Florida, Louisiana, North Dakota, Pennsylvania, South Carolina, and Wyoming, the concealed carry licenses of Virginians will no longer be honored in those states.\nVirginia House Speaker William J. Howell (R-Stafford), reacted to Herring’s announcement by saying, “Unfortunately, I have little doubt as to his true motivations. Mark Herring consistently seeks to interpret and apply the law of the commonwealth through the lens of his own personal, political opinions. He is damaging the integrity of the office he holds.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/12/22/virginia-ag-ends-concealed-reciprocity-25-states-lack-gun-control/"}
