{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:26:16","date_modify":"2018-10-30 18:26:16","date_publish":"2016-03-08 01:26:26","description":"The GOP-led Virginia assembly voted to eliminate taxpayer funding from the state’s Planned Parenthood clinics and redirect it to other health care facilities. |","filename":"data/vaneerConsumption/VirginiaGeneralAssemblyVotestoSendPlannedParenthoodFundingtoOtherHealthCareCenters.json","image_url":"https://media.breitbart.com/media/2015/09/texas-rally-to-defund-planned-parenthood-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_07__1540923976.html","title":"Virginia General Assembly Votes to Send Planned Parenthood Funding to Other Health Care Centers","title_page":"Virginia General Assembly Votes to Send Planned Parenthood Funding to Other Health Care Centers | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The GOP-led Virginia assembly voted to eliminate taxpayer funding from the state’s Planned Parenthood clinics and redirect it to other health care facilities.\nHouse Bill 1090 passed Monday in the state Senate, 21-19. The bill had already been approved by the House of Delegates last month, 64-35.\n“This bill is a purely political attack on Virginia women and families,” said Tarina Keene, executive director of NARAL Pro-Choice Virginia – a political lobbying group for the abortion industry. “Regardless of how we feel personally about abortion, I hope we can all agree that Virginia women deserve access to safe, high-quality, and comprehensive medical care – the kind provided every single day by Virginia’s Planned Parenthood health centers.”\n“Women make up more than half of Virginia’s population, yet over and over again we see women’s health dismissed, demeaned, and attacked,” Keene continued. “Virginia’s anti-women Delegates have once again made it clear that they would rather play political games with women’s health than ensure that 51% of Virginians can access the birth control, family planning, and lifesaving cancer screenings they need.”\nThe bill’s summary states the measure:\nProhibits the Department of Health from spending any funds on an abortion that is not qualified for matching funds under the Medicaid program or providing any grants or other funds to any entity other than a licensed hospital that performs such abortions. The bill also prioritizes the types of entities that the Department of Health contract with or provide grants to for family planning services.\nAccording to NBC29, Gov. Terry McAuliffe (D) is expected to veto the legislation.\n“What this bill does is it takes good funds and puts them towards other great organizations that do full, comprehensive health care for women,” said Victoria Cobb, the president of the Virginia Family Foundation. “There’s 140 federally-qualified health centers that provide much more comprehensive care and is a better use of our tax dollars.”\nThe same model of eliminating Planned Parenthood’s taxpayer funding and redirecting it to other health care centers that offer more services without performing abortions is being used at the federal level and by other states.\nThe efforts to defund Planned Parenthood come in the wake of a series of undercover videos that exposed the abortion business’ apparent practices of selling the body parts of aborted babies and altering the position of babies during abortions in order to harvest the most intact organs.\nPlanned Parenthood is currently under congressional investigation.","url":"https://www.breitbart.com/politics/2016/03/07/virginia-general-assembly-votes-to-send-planned-parenthood-funding-to-other-health-care-centers/"}
