{"authors":["Associated Press","Snejana Farberov For Dailymail.Com"],"date_download":"2018-10-23 02:48:08","date_modify":"2018-10-23 02:48:08","date_publish":"2016-01-11 15:14:43","description":"A domestic dispute between a couple in Norfolk, Virginia, resulted in the fatal shooting of a K-9 officer named Krijger, who was struck by a bullet when a suspect opened fire on police.","filename":"data/vaneerConsumption/Virginiapolicedogshotdeadduringstandoffwithgunshopsalesman.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300D1C0200000578-0-image-a-6_1452532755206.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394058_Norfolk-police-dog-killed-standoff-home_1540262888.html","title":"Virginia police dog shot dead during standoff with gun shop salesman","title_page":"Virginia police dog shot dead during standoff with gun shop salesman | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Virginia police dog was gunned down in the line of duty during a seven-hour standoff with an armed suspect who was then shot by responding officers.\nNorfolk police were called to a residence in the 1100 block of Land Street to investigate a report of a domestic dispute at around 6pm Sunday. A woman escaped from the home while her husband, identified as 58-year-old Keith Richardson, remained barricaded inside with a gun.\nAccording to a press release, Richardson refused orders to put the firearm down and surrender.\nScroll down for video\nRest in peace: A Virginia police dog named Krijger was shot dead during a standoff with an armed suspect in Norfolk\nA gun shop salesman identified as 58-year-old Keith Richardson barricaded himself inside his house on Land Street in Norfolk after a dispute with his wife, sparking a seven-hour standoff with police\nPolice say after the armed man shot the K-9 officer, cops returned fire, wounding the suspect\nAfter seven hours of failed negotiations, the armed man emerged from the residence brandishing a gun and opened fire, striking a K-9 dog named Krijger, according to officials.\nOfficers returned fire and shot Richardson, a salesman at a local gun shop, who was taken to Sentara Norfolk General Hospital with serious injuries, reported the stationWAVY.\nKrijger, a Belgian Malinois whose name means 'Warrior' in Dutch, was rushed to a veterinary clinic where he was later pronounced dead.\nThe four-legged officer was four years old and had been with the Norfolk PD's K-9 unit for three years.\n'Krijger was a dedicated and loyal member of the K9 Unit and will be missed by his handler and the men and women of the Norfolk Police Department,' police said in a statement Monday.\nPolice say they have obtained warrants charging Richardson with abduction, robbery and weapon counts.","url":"https://www.dailymail.co.uk/news/article-3394058/Norfolk-police-dog-killed-standoff-home.html"}
