{"authors":[],"date_download":"2018-10-22 22:06:28","date_modify":"2018-10-22 22:06:28","date_publish":"2014-06-02 00:47:14","description":"For SpaceShipTwo's future passengers, going on a zero-G airplane flight is a way to get their \"space legs\" before they fly to the final frontier.","filename":"data/vaneerConsumption/VirginGalacticSpaceTouristsShedPoundsandFearsonZeroGFlight.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/451971/140503-zerog-vg-on-scene1_5f74eac67fa28c8f2cec1b7add748100.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_virgin-voyage_virgin-galactic-space-tourists-shed-pounds-fears-zero-g-flight-n119951_1540245988.html","title":"Virgin Galactic Space Tourists Shed Pounds (and Fears) on Zero-G Flight","title_page":"Virgin Galactic Space Tourists Shed Pounds (and Fears) on Zero-G Flight","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNEWARK, N.J. — Flying on a zero-gravity airplane makes anyone feel like an astronaut — and for Virgin Galactic's future space tourists, there's the chance to prepare for the even bigger doses of weightlessness ahead. But Sally Akridge had a special perk in mind as she prepared for her encounter with zero-G.\n\"It's a woman's dream to feel weightless,\" she said. \"What is it? 'You could never be rich enough, or thin enough'? Well, this is my opportunity to feel weightless. Thin!\"\nAt the same time, there's a bit of trepidation. Most people who go into zero-G experience a sense of disorientation and even nausea — a phenomenon known as \"space motion sickness.\" Anti-nausea medications can help. But as much as New Zealand entrepreneur Derek Handley was looking forward to the flight, he had a nagging worry about how he'd feel afterward.\n\"Hopefully I'm still as smiley and happy ... and not throwing up all over myself,\" he said.\nA foretaste of space\nAkridge and Handley were among several space tourists who signed up for a ride on Zero Gravity Corp.'s modified Boeing 727 jet in Newark, to get a foretaste of the experience they're expecting aboard Virgin Galactic's SpaceShipTwo rocket plane.\nMore than 700 people have signed up for Virgin Galactic's suborbital space rides, with tickets currently going for $250,000 a seat. Those trips promise several minutes of weightlessness, plus a stunning view of the curving Earth beneath the black sky of space.\nA trip on Zero G Corp.'s G-Force One doesn't give you the view, and the feeling of weightlessness comes in short shots lasting only 30 seconds at a time — but then again, the $4,950 price tag isn't as steep. Think of it as a dress rehearsal for spaceflight.\n\"When we're up for Virgin Galactic, I don't want to be spending the time trying to figure out how to get my feet down, or how to move,\" said Chandra Jessee, an activist and venture investor.\nThe principle behind a zero-G airplane flight is simple, and you can feel it when your car zooms over the crest of a steep hill. If you're in a vehicle that follows a parabolic arc, it's as if you're in free fall. For a brief time, you feel a floating sensation, followed by a lurch as the free-fall arc ends.\nAn airplane that takes a parabolic trajectory gives you a similar zero-G feeling, followed by a karma-balancing period of high-G. During the 30 seconds of weightlessness, you can float around and pretend you're Superman. But when you drop to the floor and feel 1.8 times heavier than usual, you have to look up at the ceiling and try not to feel sick. All those points are covered in Zero G's training sessions before you fly.","url":"https://www.nbcnews.com/storyline/virgin-voyage/virgin-galactic-space-tourists-shed-pounds-fears-zero-g-flight-n119951"}
