{"authors":["Anneta Konstantinides For Dailymail.Com"],"date_download":"2018-10-23 02:25:02","date_modify":"2018-10-23 02:25:02","date_publish":"2016-01-11 14:39:35","description":"Lynn Craig returned home to Roanoke, Virginia in September 2005, nearly six months after he wrote the letter to parents Edith and David Craig, who never knew it was even missing.","filename":"data/vaneerConsumption/VirginiacouplereceivelettersonsentfromIraq11YEARSago.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300B138D00000578-0-image-a-12_1452523114359.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394021_Parents-receive-letter-son-sent-Iraq-11-years-ago_1540261502.html","title":"Virginia couple receive letter son sent from Iraq 11 YEARS ago","title_page":"Virginia couple receive letter son sent from Iraq 11 YEARS ago | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"David and Edith Craig had no idea a letter of his ever went missing\nA Virginia couple received a surprise in their mailbox when they found a letter that their son had sent from Iraq - nearly 11 years ago.\nDavid and Edith Craig's son Lynn had returned home to Roanoke in September 2005, but the note was from his very second month in the war zone.\nThe March 2005 letter was postmarked in North Carolina just a week ago. But the Craigs were shocked when they saw 'free mail combat zone' stamped on the envelope.\nDavid and Edith Craig received a surprise in their mailbox this weekend when they found a letter their son Lynn (pictured all together) had sent them from Iraq - 11 years after he had already returned home to Roanoke\nLynn wrote the letter in March 2005, just a month after entering the war zone. A lance corporal at the time, Lynn wrote to his father about repairing generators and Humvees on the platoon\nEven after more than a decade, the letter still nearly brought Edith to tears.\n'I almost cried of course,' she told The Roanoke Times. 'I'm a mom and he's my baby. He's 40 years old, but he's still my baby.'\nDespite its remarkable journey, the contents of the letter are fairly ordinary. A lance corporal at the time, Lynn wrote to his father he was one of the 'go-to guys for things being fixed' in his platoon.\nHe discussed repairing generators, forklifts and Humvees and had bonded with his first sergeant over cars, a passion he and David shared.\nEdith said her son had dreamed of going into the military since he was a boy, wearing the fatigues his mother bought and altered for him long before he enlisted.\n'That's all he wore for years, was fatigues,' she said.\nLynn joined the Marine Corps Reserve before going on active duty for four years. He currently works at Volvo Trucks and remains in the Reserve as a staff sergeant\nLynn joined the Marine Corps Reserve before going on active duty for four years. He currently works at Volvo Trucks and remains in the Reserve as a staff sergeant.\nHe didn't even know his letter was ever missing, and had just as much of a clue as his parents as to what he had written inside all those years ago.\nThe letter came inside an envelope that had already been sliced open, and the Craigs said they'd love to find out 'the stories' of where the note has been in the last decade.\nBut that will likely never happen, according to a US Postal Service spokesman, who told the paper it is 'very, very rare' for a letter to go missing for so long.\nAs for now the Craigs are just happy they got the letter at all.\n'It's wonderful to go back 10 years and know that he was okay,' Edith said.\nAnd it was even sweeter to see the final line Lynn had written his parents, knowing now that it had come true.\n'You'll probably hear from me,' he wrote, 'before you get this.'","url":"https://www.dailymail.co.uk/news/article-3394021/Parents-receive-letter-son-sent-Iraq-11-years-ago.html"}
