{"authors":["Katie Mchugh"],"date_download":"2018-10-30 21:40:37","date_modify":"2018-10-30 21:40:37","date_publish":"2016-06-03 12:36:40","description":"Terry McAuliffe previously claimed only felons who completed their sentences and were no longer on parole could have their voting rights restored. | Politics","filename":"data/vaneerConsumption/VirginiaGovTerryMcAuliffeMistakenlyGrantedVotingRightstoHighProfileKillersStillServingTime.json","image_url":"https://media.breitbart.com/media/2016/04/GettyImages-513148692.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_03__1540935637.html","title":"Virginia Gov. Terry McAuliffe 'Mistakenly' Granted Voting Rights to High-Profile Killers Still Serving Time","title_page":"Virginia Gov. Terry McAuliffe 'Mistakenly' Granted Voting Rights to High-Profile Killers Still Serving Time | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Virginia Gov. Terry McAuliffe’s sweeping order to grant all felons voting rights just months before the presidential election will allow some felons who are still in prison or on supervised release to vote.\nMcAuliffe previously claimed only felons who completed their sentences and were no longer on parole could have their voting rights restored.\nThe Washington Post reveals that several high-profile killers or attackers were “mistakenly” given voting rights:\nRonald R. Cloud, 68, was in prison in West Virginia for sexual assaults involving a child when he pleaded guilty in 2014 to the murder of a Fauquier County man in a three-decade-old cold case. Daniel Harmon-Wright, 36, was a Culpepper police officer when he shot a Sunday school teacher in her Jeep as the vehicle drove away. […] In addition to Cloud and ­Harmon-Wright, they discovered Cecil Leonard Hopkins, 51, who strangled his girlfriend and pleaded guilty to voluntary manslaughter. He is living in Maryland under supervised probation. Two others — Virgil J. Dantic, 77, and Frank P. Ferrara, 52 — are serving time in Virginia prisons for sex crimes, records show.\nSome, such as Cloud and Harmon-Wright, do not even live in Virginia. McAuliffe’s administration says it corrected the mistakes once the Post brought them to its attention, blaming database errors.\nBut Virginia has repeatedly rebuffed prosecutors asking for the list of the 206,000 felons now eligible to vote, denying Freedom of Information Act requests from officials seeking to correct more possible errors. Many cases deserve individual reviews, one prosecutor said, pointing to the case of a felon confined to a mental hospital who perpetrated two stabbing attacks.\nState Del. Robert B. Bell ­(R-Albemarle), a vocal critic of McAuliffe, said the glaring errors highlight the irresponsibility of the move: “This exceeds our worst fears. He did not even comply with his own very, very modest restrictions. At least if you’re going to do it, do it right.”\nMcAuliffe’s order does more than grant felons the right to vote: It allows them to serve on juries, work as notaries, and run for office. It makes no exceptions — every felon from murderers, to rapists, to kidnappers, to child abusers, to burglars, and so forth has been giving the same rights as lifelong, law-abiding citizens.","url":"https://www.breitbart.com/politics/2016/06/03/virginia-gov-terry-mcauliffe-mistakenly-granted-voting-rights-to-high-profile-killers-still-serving-time/"}
