{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:12:50","date_modify":"2018-10-31 00:12:50","date_publish":"2016-10-05 08:00:00","description":"Andrew Naylor was working at a digital advertising firm in Silicon Valley when the “a-ha” moment struck. It was 2008, and money—more than $83 million—was","filename":"data/vaneerConsumption/Virtuallandlordunlockscampaignwebsitesforafee.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/VirtualLandlord-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944770.html","title":"Virtual landlord unlocks campaign websites-for a fee","title_page":"Virtual landlord unlocks campaign websites—for a fee | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Andrew Naylor was working at a digital advertising firm in Silicon Valley when the “a-ha” moment struck.\nIt was 2008, and money—more than $83 million—was gushing into the advertising world as Californians prepared to vote on Prop. 8, the measure to limit marriage to heterosexual couples (later ruled unconstitutional.)\n“I saw what was happening with politics in California and everything was just huge. The amount of money both sides were spending, for and against, on online advertising and television ads was just incredible,” said Naylor, who lives in Menlo Park. And it opened his eyes to a potential ballot prop campaign bonanza: domain names.\nThose names—essentially a website’s address—have long been a hot commodity, as speculators have bought up dot-com labels with commercial appeal and sold the hottest among them for millions. Naylor, a systems administrator with a business degree, had bought up thousands of web addresses, many wine-related, and sold one for a five-figure sum. After watching the Prop. 8 blitz, he started buying addresses with combinations of yes and no on propositions 1 to 100.\nAnd that’s how Naylor became a virtual landlord of more than 1,000 campaign domain names—and a dominant player in California’s marketplace for political web addresses.\nHe says he cares more about tech than politics. But California’s system of direct democracy offers plenty of opportunity to foster an election-year business at the intersection of the two. With 17 measures on the statewide ballot this November, and campaigns seeking web sites for and against each one, there is demand for at least 34 domain names this year. Naylor is doing business with 12 campaigns, including those to legalize marijuana, extend income taxes, raise cigarette taxes and repeal the death penalty.\n“I was buying them up before (Naylor) got into it. And then all of a sudden I was like, ‘Who is this bidding against me?’” said Dan Schluer, who owns a competing business in campaign domains based in San Bernardino County. “(Now) he has a much more extensive portfolio than I do.”\nNaylor doesn’t buy domains that involve the names of specific politicians—only those that could be used for ballot measure campaigns. That’s because federal law is stricter when it comes to commercial use of domain names based on real people. Domain names that use proposition numbers don’t face the same limits, said Enrico Schaefer, an expert in internet law with the Traverse Legal firm.\n“There is no cyber-squatting issue there because typically there is no trademark in those words,” Schaefer said\nNaylor sees himself almost like a collector who stores a library of web addresses available for the long haul. His model is to lease, rather than sell, his ballot measure domain names—that way he retains ownership the next time the numbers are used. He says he charges an average of about $300 a month, with most campaigns renting them for five months, from when the state assigns proposition numbers in early July through the end of November.\n“The secretary of state releases the numbers and then my phone starts ringing,” Naylor said.\nHis website gives a sense of the sweep of his holdings. For Proposition 51, for example, Naylor owns YesOn51.com, YesOn51.org, YesOnProp51.com, YesOnProp51.org. He also owns the corresponding “No” addresses.\nCampaigns backed by millions of dollars typically don’t blink over the cost of renting domain names, viewing it as a part of the cost of doing business, Naylor said. Many ask if they can also buy up the addresses their opponents might want. Naylor says he won’t do that.\n“I have this sense of fairness—I’d rather they be available to both sides than the one who’s the highest bidder,” Naylor said.\nStill, for campaigns with less money, coming up with a web site can become a puzzle. The campaign for Proposition 58, which seeks to remove limits on bilingual education, opted for supportprop58.com after discovering that Naylor already owned YesOnProp58.com. By California standards, it’s a low-budget campaign, having raised about $1.1 million.\n“We don’t have money to spend on extra things like buying a domain name,” said campaign spokeswoman Robin Swanson. “That might mean we have to do more social media promoting supportprop58.com so people go to the right web site.”\nAnother relatively low-budget campaign, supporting Proposition 67 to ban plastic bags, also opted to work around the domain name hustle. It chose cayeson67.com after discovering that YesOnProp67.com, YesOnProp67.org, YesOn67.org and YesOn67.com were taken—three of them by Naylor.\n“I thought our name was stupid. So I asked about it and I was told that the ones we wanted (cost too much money),” said Steve Maviglio, a consultant working on the campaign. “It’s the wild west. The first one in line gets the best names and people have made a business out of that. So God bless their forward thinking.”","url":"https://calmatters.org/articles/virtual-landlord-unlocks-campaign-websitesfor-a-fee/"}
