{"authors":[],"date_download":"2018-10-22 22:23:44","date_modify":"2018-10-22 22:23:44","date_publish":"2014-06-09 17:54:33","description":"A New Hampshire police department is back online after being hit with an insidious \"ransomware\" virus that locks up computer files until victims fork over cash.","filename":"data/vaneerConsumption/VirusWipesOutNewHampshirePoliceDepartmentsComputers.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_21/452046/140519-hacker-jsw-1p_d916629fee77e5810a71e05d7147d41e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_security_virus-wipes-out-new-hampshire-police-departments-computers-n126466_1540247024.html","title":"Virus Wipes Out New Hampshire Police Department's Computers","title_page":"Virus Wipes Out New Hampshire Police Department's Computers","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe police in a quiet New Hampshire town are back online after being hit with a virtual “stick-up” that seized the department’s files and demanded cash.\n\"We're 100% operational now, and life is back to normal,\" Todd Selig, the town administrator of Durham, New Hampshire, told NBC News. \"But it was quite a weekend.\"\nDurham staffers believe the virus in question is \"Cryptowall,\" the latest piece of so-called ransomware, or a variant.\nThe malware, which encrypts a victim's computer files and effectively holds them hostage, has been spreading to businesses and consumers alike.\nNetworking giant Cisco published a blog post about Cryptowall last week, a few days after federal agents arrested people connected to the similar \"CryptoLocker\" malware. Cybercrime costs businesses around $445 billion a year, according to a Monday report that was sponsored by McAfee.\nFor the Durham police the problem began the evening of June 5, when an officer received what appeared to be a legitimate message from a known contact. The officer clicked a link in the email, Selig said, and unwittingly downloaded the malware.\nBy the next morning, \"there were widespread challenges to the department's ability to access files,\" Selig said. The town's manager of information technology, Luke Vincent, took all of the department's computers offline and the virus was isolated by Friday night.\nVincent told the department that the virus was likely Cryptowall or a similar piece of ransomware, and he advised them not to open a file with \"instructions\" -- which typically demand money in exchange for unlocking the inaccessible files.\n\"That was fine with us, because we just weren't going to play the ransom game,\" Selig said. \"We looked at this as a criminal action, and we knew going in that we had a backup of all of our data.\"\nA security expert said Selig and his colleagues did exactly what they should have.\n\"When we give ransom, we’re helping fund the criminals,\" Domingo Guerra, the co-founder and president of mobile app risk management service Appthority, told NBC News.\nWhat's more, Guerra said, there's no guarantee that the attackers will keep their word and unlock files after receiving the cash. They may simply leave your files inaccessible, or demand even more money.\nInstead, Guerra said, victims of Cryptowall and similar attacks should report the incident to the FBI. Then, they should try to install anti-malware or anti-virus software to scan the infected computer. As always, it's smart to change passwords immediately after such an attack, he said.\nRansomware like Cryptowall is spreading especially quickly on mobile devices, Guerra added, \"because the criminals go where the users are. It's important to remain diligent on any device.\"\nThat's the lesson that the town of Durham is taking away from its own Cryptowall nightmare, Selig said.\n\"No one did badly here -- we’re dealing with technology that’s quite sneaky -- but we will be giving a lot of thought as to what things we might want to enhance within our security systems,\" Selig said. \"This got past our strong anti-virus technology, and we want to be stronger the second time.\"\nThe ordeal has cost the town of Durham about $2,000 to $3,000, Selig estimates. He's pleased with the department's response, noting that the town of 14,600 employs only 21 police officers and one full-time technical staffer.\n\"We're not the NYPD with thousands of employees,\" Selig said. \"But we contained this within 48 hours. It was a valuable lesson to stay focused on technology, even if it isn't the main focus of your business.\"","url":"https://www.nbcnews.com/tech/security/virus-wipes-out-new-hampshire-police-departments-computers-n126466"}
