{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 23:29:22","date_modify":"2018-10-30 23:29:22","date_publish":"2016-12-06 00:00:00","description":null,"filename":"data/vaneerConsumption/VisaandMasterCardaredelayingtheEMVshiftforgasstations.json","image_url":"https://amp.businessinsider.com/images/5847236fba6eb6771b8b7a19-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_visa-and-mastercard-are-delaying-the-emv-shift-for-gas-stations-2016-12_1540942162.html","title":"Visa and MasterCard are delaying the EMV shift for gas stations","title_page":"    Visa and MasterCard are delaying the EMV shift for gas stations - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence This story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nThe US EMV migration is set to occur in several stages, and the first shift occurred for retailers in October 2015.\nFor gas stations, that deadline was supposed to be set for October 2017. But last week, Visa and MasterCard shifted the deadline for gas stations back to October 2020, giving their fuel clients three additional years to upgrade their pumps, according to Bloomberg.\nIt's unlikely the migration would have been completed by the deadline. Visa and MasterCard likely opted to push the deadline for this reason. The upgrade is expected to cost the industry roughly $4 billion, because fuel pumps often need to be replaced in their entirety in order to upgrade to EMV. That expense, which gas station owners have complained about, combined with insufficient supply of hardware or software, meant the migration would have been incomplete by 2017. Shifting liability back in light of that could appeal to gas station owners.\nBut the could spike already-high US card fraud.\nEMV had the potential to reduce card fraud at gas stations, which is relatively significant. Visa's EMV-enabled merchants saw a 43% decline in counterfeit fraud. It's likely the fraud-reducing potential of EMV would carry over to gas stations, which currently see about $250 billion in fraud annually, according to Bloomberg. Those declines would lead to cost savings for station operators as well as payment players.\nVisa's EMV-enabled merchants saw a 43% decline in counterfeit fraud. It's likely the fraud-reducing potential of EMV would carry over to gas stations, which currently see about $250 billion in fraud annually, according to Bloomberg. Those declines would lead to cost savings for station operators as well as payment players. Delaying the deadline will increase the share of fraud at gas stations. Right now, gas station skimming fraud comprises just 1.3% of total US card fraud, according to Krebs on Security. But it's already on the rise— in Arizona, for example, select stations saw more skimming in August 2016 than they did for 2015 at large. As other payment channels become more secure, it's likely fuel pumps will become an even larger target for fraudsters, who tend to flock to the weakest channels. That could lead to a spike in skimming over the next three years","url":"https://www.businessinsider.com/visa-and-mastercard-are-delaying-the-emv-shift-for-gas-stations-2016-12"}
