{"authors":["Richard Davenport"],"date_download":"2018-10-30 17:50:40","date_modify":"2018-10-30 17:50:40","date_publish":"2018-10-30 00:00:00","description":"Offensive lineman Dylan Rathcke arrived in Fayetteville on Friday and left Sunday with a scholarship offer and Arkansas in his top two.","filename":"data/vaneerConsumption/VisitimpressesRathckeArkansasinhistop2.json","image_url":"https://media.arkansasonline.com/img/photos/2018/10/30/Dylan_Rathcke_t600.jpeg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30__1540921840.html","title":"Visit impresses Rathcke; Arkansas in his top 2","title_page":"Visit impresses Rathcke; Arkansas in his top 2","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Offensive lineman Dylan Rathcke arrived in Fayetteville on Friday and left Sunday with a scholarship offer and Arkansas in his top two.\n“I definitely liked it,” Rathcke said. “It was a lot different than what I expected. I really didn’t know what to expect going up there because we’ve never been to Arkansas.”\nRathcke, 6-5, 290 pounds, 5.27 seconds in the 40-yard dash of University Lab in Baton Rouge, has 13 other scholarship offers from schools such as Kentucky, Louisville, Colorado State and Tulane.\nHe lists Arkansas and Kentucky as his top schools.\n“I love the coaches. They seem like great people and I love the atmosphere,” he said of Arkansas. “All the fans. They seem like great people, too.”\nRathcke met with coach Chad Morris and offensive line coach Dustin Fry before the game and learned of his offer.\n“We sat down for a while,” Rathcke said. “He talked about what his plans were with Arkansas and how he felt it was a family place and they bettered the players not only on the football field, but off the field. He explained everything about the offer.”\nHe and his parents didn’t know what to expect prior to the visit and left highly impressed.\n“It kind of blew us away,” Rathcke said. “All the people there and the facilities are extremely nice. Even the city and the state in general was extremely beautiful.”\nRathcke plans to make an unofficial visit to Kentucky this weekend and an official visit after the season. He and Fry are working on an official visit to Arkansas.\n“We’re thinking about the LSU game,” he said.\nHis parents liked what they experienced in Fayetteville.\n“They definitely loved it,” Rathcke said. “They were blown away by it. They really loved it. They think it’s a great school.”","url":"https://www.arkansasonline.com/news/2018/oct/30/visit-impresses-offer-extended-hogs-top-2/"}
