{"authors":[],"date_download":"2018-10-30 18:15:13","date_modify":"2018-10-30 18:15:13","date_publish":"2016-08-15 15:55:00","description":"Before he took his life in 1986, Eddie Owens Martin would worry at times about what would become of Pasaquan, the magical art environment he had fashioned on a remote former farmstead over his last 30 years.","filename":"data/vaneerConsumption/VisionaryGeorgiansartenvironmentgetsavibrantrestoration.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/08/15/Images/photos.medleyphoto.10973590.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_visionary-georgi_fd669e7dffe3e20f4418bcd69a68934e__1540923313.html","title":"Visionary Georgian's art environment gets a vibrant restoration","title_page":"Visionary Georgian's art environment gets a vibrant restoration","title_rss":"NULL","source_domain":"ajc.com","text":"Before he took his life in 1986, Eddie Owens Martin would worry at times about what would become of Pasaquan, the magical art environment he had fashioned on a remote former farmstead over his last 30 years.\nMartin was a guru with no followers, a visionary art trailblazer with few in the art establishment on his trail. He earned a living as a fortune-teller, the proceeds from which he pumped into his handmade wonderland of Technicolor-hued structures, totems and masonry fences, decorated walkways and commanding concrete sculptures.\nWorking under the name St. EOM, Martin liberally borrowed motifs from a panoply of exotic cultures, transforming his south Georgia parcel between Columbus and Plains into what his biographer Tom Patterson later termed “a sort of mock pre-Columbian psychedelic wonderland.”\nLittle could Martin have imagined Pasaquan today, radiating life and saturated in intense pigments as it prepares for its grand reopening on Oct. 22. This turn of events follows a stunning multimillion-dollar revival that spanned more than two years and involved a consortium of the country’s top art restoration experts.\nRead more about Eddie Owens Martin and the restoration of Pasaquan, see video of Martin and his creation and view many more photos of the restored environment in out special digital presentation.","url":"https://www.ajc.com/lifestyles/visionary-georgian-art-environment-gets-vibrant-restoration/HfeKH40SjCcCeivw7IVWOM/"}
