{"authors":[],"date_download":"2018-10-30 21:00:08","date_modify":"2018-10-30 21:00:08","date_publish":"2015-08-21 11:26:10","description":"It was to be a two-year stint in the states for Helen Gilligan, a pretty and petite 22-year-old year-old Limerick girl who wanted to experience something other than a gray, medieval city.","filename":"data/vaneerConsumption/VisittoIrelandwithmomisatripthroughthepastinhermind.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/08/21/Images/photos.medleyphoto.7973624.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_bill-torpy-large_1b6a7c7741bd2c4337956770d0f78e27__1540933208.html","title":"Visit to Ireland with mom is a trip through the past in her mind","title_page":"Visit to Ireland with mom is a trip through the past in her mind","title_rss":"NULL","source_domain":"ajc.com","text":"It was to be a two-year stint in the states for Helen Gilligan, a pretty and petite 22-year-old year-old Limerick girl who wanted to experience something other than a gray, medieval city.\nA brother had earlier immigrated to the States and was drafted, so Helen volunteered to go live with her aunt in Chicago to keep her company during her brother’s stint as a soldier. It’d be an adventure, she figured, and a big group gathered at her home to see her off before she she sailed to the U.S.\nIt’s funny how these things work. A few years later she met a Chicago guy (my dad), had five kids and became entrenched in the city’s South Side where Irish immigrants arrived by the thousand. Trips back home (“home” is understood to be Ireland) became infrequent for many years as everyday life got in the way.\nIn later years, she returned to Ireland more frequently as she increasingly reminisced on the glorious years of her youth. Time has a way of coloring the gray. The Limerick of the 1930s, 1940s and early 1950s is not remembered as the desperately poor place Frank McCourt described in his best-selling “Angela’s Ashes.” Instead, over time those years have become a joyous period.\n“I remember picnics and gallivanting with friends,” she told me years ago when I wrote about McCourt’s book.\nBut the picnics and gallivanting were not enough to keep most of the Gilligans in Limerick; seven of the eight surviving siblings emigrated to Chicago, where they often gathered and sang melancholy songs late at night about the land they left behind.\nThis month, Helen and I returned on what will almost certainly be her last visit home.\nIn recent years, she has become frail (but still spry) and progressing dementia sometimes makes her memory as foggy as a winter morning on the Irish coast. For months, she had repeatedly — and defiantly — insisted she was going to travel alone to Ireland this year, as she had often done in the past. Such a trip these days would have ended in international disaster, so I and my brother Brian signed up for escort duty.\nLimerick, to be certain, is an unusual place to grow up, a land where history bleeds from the ancient limestone walls that line many streets.\n‘They got a fair trial and were executed’\nThe city’s old section is a fortified island on the Shannon River first settled by the Vikings. The Gilligans have lived there for perhaps 150 years in a house called Peter’s Cell that was already old when Christopher Columbus was born. It is a nunnery and was built next to massive city walls that were attacked by Cromwell and the Williamites, among others. The 800-year-old St. Mary’s Cathedral, with a peephole for lepers to glimpse the Mass from outside, is around the corner, as is the equally ancient King John’s Castle. We’re talking old here.\nBut the history is not all ancient.\nHer father, Willie Gilligan “was a tough, hot-headed guy, a real IRA man,” an old fellow named Tommy Ryan once told me. The two spent time in prison together for their Irish Republican Army activities. Granddad was arrested at the family home and was in prison when his oldest son, my Uncle Joe, was born in 1921. Joe, 94, still lives there.\nGranddad’s cousin was suspected of being the informer who turned him in. He was subsequently executed by the IRA.\n“They got a fair trial and were executed on the Shannon [River],” Ryan explained matter-of-factly the IRA protocol for dispatching snitches. “They got a priest if they were Catholic.”\nThe cousin’s family asked if he could be buried in the family plot. My grandmother refused. She said granddad would dig him up. Needless to say, family relations remained strained.\n‘Stab City’: Limerick was always tough\nWhile violence is embedded in local lore, religion permeated all aspects of life. At least past life. Priests were like royalty, nuns were ubiquitous and the eyes of saintly figures in old spooky religious pictures follow you around when visiting old people’s houses.\nAs a 12-year-old, my mother was told to walk to the convent, collect a girl and deliver her to the orphanage. The idea was the orphan would be more relaxed by the presence of another child. Years later, while home on holiday in the 1950s, she returned with two Irish orphans to America for adoption, a scene right out of the movie “Philomena.” She still has the Chicago newspaper clippings with photos of her leaving the airplane with bewildered children.\nBut the Limerick of her youth, the one that remains in her mind, was one of dances, sing-alongs, rowing races and picnics in graveyards. It was the one we visited, the one populated by pleasant phantoms of her past.\nThings have changed, of course, as they have everywhere. Most of the ancient structures remain, but the institutions have changed. Nuns are largely a memory, priests have become rare, fear of crime has descended on the old neighborhood and Limerick fights to shake off the moniker “Stab City.” (I must note the place has always been tough, I got in a fist fight with a Tinker kid when I was 12. And, in all fairness, the city has done a good job with river-walks, museums and has a downtown that bustles on summer days.)\nThey were God's people\nThe trip would be similar to the vacations of my early youth, although turned around — this time it was me coaxing her into taking naps or eating just a little bit more. I’ve noticed that she views the world with innocent wonder, her mind picking up little details that pass unnoticed by me; an exceptionally green field, a ruined abbey, a playful horse.\n“Look at that cloud,” she noted. “It looks like a salmon.”\nAnd darned if it didn’t.\nIn recent years, she talks more and more about her youth as those memories crowd out more recent events. As we drove the streets of the Limerick or walked its lanes she recalled, often with great detail, neighbors and relatives who lived in houses 70 years ago, retrieving precise memories from the same brain that cannot remember plans made an hour earlier at lunch.\nThe characters of her stories are often colorful, accompanied by long-ago quotes in the lilting workingclass patter of Lim’rick folks. They were folks who would do anything for you, who would share their meager resources, who’d raise you up when you were feeling down. They were God’s people.\nAnd now they are largely ghosts, spirits that inhabit the ever-looping video that plays in her head. And, I must admit, I enjoyed visiting with them.","url":"https://www.ajc.com/news/local/bill-torpy-large-trip-through-the-irish-mists-mom-mind/nLu79z6q31X3UNOjDGL7pK/"}
