{"authors":["Matthew Boyle"],"date_download":"2018-10-30 19:32:16","date_modify":"2018-10-30 19:32:16","date_publish":"2015-02-12 23:31:24","description":"The Senate Judiciary Committee has delayed consideration of Loretta Lynch to replace Eric Holder as Attorney General. Committee member Sen. David Vitter says he wants to dig into Lynch's role in the federal prosecution of HSBC in 2012. |","filename":"data/vaneerConsumption/VitterHolduponHolderReplacementLorettaLynchOverHSBCPersecution.json","image_url":"https://media.breitbart.com/media/2015/01/David-Vitter-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_12__1540927936.html","title":"Vitter: Holdup on Holder Replacement Loretta Lynch Over HSBC Persecution","title_page":"Vitter: Holdup on Holder Replacement Loretta Lynch Over HSBC Persecution | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Republicans in the U.S. Senate Judiciary Committee have stalled the nomination of U.S. attorney Loretta Lynch to replace Eric Holder as President Barack Obama’s Attorney General, and Sen. David Vitter (R-LA)—a member of the committee—says it’s because of her role in not bringing criminal charges in a white collar crime scandal.\nIn December 2012, ABC News’s Brian Ross, Matthew Mosk and Carlos Boettcher reported that HSBC Bank “will avoid a potentially crippling criminal prosecution for its role in moving cash for known terror groups, Mexican drug cartels, and rogue governments such as Iran” because Justice Department officials instead agreed to assess a $2 billion settlement against the bank.\nLynch, the U.S. Attorney for the Eastern District of New York, is quoted in that article as saying HSBC didn’t act on”numerous red flags and warnings about the money laundering risks.”\nHSBC, she said, “routinely did business with entities on the U.S. sanctions list” adding that the bank engaged in “evading U.S. prohibitions on such transactions by disguising the source of the funds so the payments would go through.”\nNonetheless, nobody went to prison or even faced a criminal trial in the money laundering case, due to Lynch’s and others’ efforts. HSBC got off by making a payment to the government.\n“Announcement of the immense fine was overshadowed Tuesday by efforts to explain why, in one of the clearest cases of criminal money laundering in recent memory, no one would be facing jail time. Criminal conviction on money laundering violations would have also forcibly prevented HSBC from doing business in the United States,” Ross, Mosk and Boettcher wrote.\nVitter, a hardline conservative, said in his statement on Thursday that this is very troubling and that members of the Senate Judiciary Committee, and the full Senate, need to know everything that happened with HSBC’s case and Lynch’s role in all of it before they can vote on her nomination.\n“If Loretta Lynch and DOJ swept under the rug a serious money laundering scheme involving Mexican drug cartels and terrorist organizations, we need to know a heck of a lot more about it,” Vitter said. “This is especially true since American citizens may be completely unaware that their identities – including names and social security numbers – were compromised in this fraud,” Vitter added. “A simple monetary fine is the equivalent of a slap on the wrist, and would cast serious doubt on Ms. Lynch’s capacity to serve as our top law enforcement official.”\nHSBC has come back under massive public scrutiny with a whole new element to the scandal emerging last week, according to the UK’s Guardian Newspaper.\n“The US government will come under intense pressure this week to explain what action it took after receiving a massive cache of leaked data that revealed how the Swiss banking arm of HSBC, the world’s second-largest bank, helped wealthy customers conceal billions of dollars of assets,” the Guardian’s Paul Lewis wrote on Sunday. Adding:\nThe leaked files, which reveal how HSBC advised some clients on how to circumvent domestic tax authorities, were obtained through an international collaboration of news outlets, including the Guardian, the French daily Le Monde, CBS 60 Minutes and the Washington-based International Consortium of Investigative Journalists. The files reveal how HSBC’s Swiss private bank colluded with some clients to conceal undeclared ‘black’ accounts from domestic tax authorities across the world and provided services to international criminals and other high-risk individuals.\nLater in the article, Lewis noted bipartisan outrage at Lynch’s and DOJ’s decision to not prosecute HSBC officials when the first element of this scandal broke a few years ago.\n“At the time, the HSBC settlement was heavily criticised by both Republicans and Democrats for allowing the bank to escape criminal indictments and keep the charter which enables it to operate in the US,” Lewis wrote. “Lynch and other senior DOJ officials defended the deal, pointing out it committed HSBC to a five-year plan to stamp out money laundering and other illicit practices, an ongoing process that is being overseen by an independent, court-appointed monitor.”\nBut with this—along with Lynch’s outspoken support for President Obama’s executive amnesty, which most members of Congress (even many Democrats) view as unconstitutional, what happens moving forward remains to be seen.\nDemocrats expressed outrage at Vitter’s delay on Thursday, as Lynch had been expected to clear the Senate Judiciary Committee this week. Sen. Dianne Feinstein, for instance, complained that it seemed prejudicial against Lynch compared to other nominees.\n“Clearly she’s been treated differently, and I guess that’s what I object to, because there are sensitivities,” Feinstein said.\nDemocrats could have cleared Lynch’s nomination in the lame duck session of Congress without any problems, but chose not to. Specifically, Democrats cited at the end of last Congress other priorities for their final days of holding the U.S. Senate majority for the reason they didn’t move Lynch’s nomination in the lame duck session.\n“Sen. Patrick Leahy of Vermont, the Democrat who chairs the Senate Judiciary Committee that will consider the nomination, is not making Lynch’s confirmation his top priority in the remainder of the year,” Politico wrote last November, for instance. “Instead, Leahy is pushing hard to enact the USA Freedom Act, a sweeping overhaul of domestic surveillance programs that proponents fear would die next year if it doesn’t pass while Democrats control the Senate.”","url":"https://www.breitbart.com/politics/2015/02/12/vitter-holdup-on-holder-replacement-loretta-lynch-over-hsbc-persecution/"}
