{"authors":["William Bigelow"],"date_download":"2018-10-30 21:28:54","date_modify":"2018-10-30 21:28:54","date_publish":"2015-07-08 18:46:25","description":"As of July 1, 2014, the Census counted 14.99 million Latinos and 14.92 million whites, making California the second state in which Latinos outnumber whites, after New Mexico. Laura Hill, from the Public Policy Institute of California, told the Sacramento Bee, “What’s mostly going is the difference in birth rates in Latinos and non-Hispanic whites.” |","filename":"data/vaneerConsumption/VivaCaliforniaLatinosNowOutnumberWhites.json","image_url":"https://media.breitbart.com/media/2015/07/Luchador-David-McNew-Getty-1024x769.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_07_08__1540934934.html","title":"¡Viva California! Latinos Now Outnumber Whites","title_page":"¡Viva California! Latinos Now Outnumber Whites | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The newest data released by the U.S. Census show that Latinos in California outnumber whites, according to the Los Angeles Times.\nAs of July 1, 2014, the Census counted 14.99 million Latinos and 14.92 million whites, making California the second state in which Latinos outnumber whites, after New Mexico. Laura Hill, from the Public Policy Institute of California, told the Sacramento Bee, “What’s mostly going is the difference in birth rates in Latinos and non-Hispanic whites.”\nRobert Suro, director of the Tomas Rivera Policy Institute, had another reason for the demographic shift, telling the Bee that white flight was a factor. He said, “Somebody who doesn’t want to live in an intensely multicultural area has left coastal California by now. Most of them were non-Hispanic whites. Most of them were older adults.”\nCalifornia Governor Jerry Brown’s budget, released in January 2014, had estimated Latinos to comprise 39% of the state’s population, according to Pew Research. Latinos make up 47% of New Mexico’s population. California has more Latinos than any other state.\nIn both California and New Mexico, Latinos represent a plurality of the population, but not a majority. Pew also reported that California’s demographers estimated some of the various ethnicities of the state by mid-2014; 39% Latino, 38.8% white, 13% Asian-American or Pacific Islander, 5.8% black, and less than 1% Native American.\nThose estimates marked a radical change from 2000, when the demographics reflected 46.6% white Californians, 32.3% Latino, 11.1% Asian-American or Pacific Islander, 6.4% black and roughly 1% Native American. Ten years before that, 57.4% white, 25.4% Latino, 9.2% Asian-American or Pacific Islander, 7.1% black, and about 1% Native American.\nThe last time Latinos comprised the largest racial or ethnic group in California was in 1850, when California became a state.\nThe third state in which Latinos outnumber whites may well be Texas. According to Pew, using data from U.S. Census Bureau’s American Community Survey, in 2012 10 million Latinos (38.2%) and 11.6 million whites (44.4%) lived in Texas. In 2000, Latinos comprised 31.9% of the population of Texas; whites made up 52.4%. That demographic shift indicates that Latinos’ population is growing faster than whites.\nNo other states come close to a Latino plurality. In Florida the ratio is 56.8% white, 23.2% Latino; in Arizona, 56.9% white, 30.2% Latino; and in Nevada, 52.8% white, 27.3% Latino.","url":"https://www.breitbart.com/local/2015/07/08/viva-california-latinos-now-outnumber-whites/"}
