{"authors":[],"date_download":"2018-10-22 22:10:06","date_modify":"2018-10-22 22:10:06","date_publish":"2014-05-09 12:19:06","description":"The Russian leader earlier paid tribute to \"Sevastopol’s defenders,\" referring to Crimean fighters against the Nazis in World War II.","filename":"data/vaneerConsumption/VladimirPutinVisitsCrimeaonRussiasWWIIVictoryDayCelebrations.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/431511/140509-crimea-russia-putin-mn-905_0c184bb54edc98a18af277c5bbc8b633.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_vladimir-putin-visits-crimea-russias-wwii-victory-day-celebrations-n101211_1540246206.html","title":"Vladimir Putin Visits Crimea on Russia's WWII Victory Day Celebrations","title_page":"Vladimir Putin Visits Crimea on Russia's WWII Victory Day Celebrations","title_rss":"NULL","source_domain":"nbcnews.com","text":"The Russian leader told veterans at the parade in Crimea's largest city Sevastapol that the region was \"returned to its home country thanks to their great moral contribution.\"\n\"There is a lot of work ahead but we will overcome all difficulties because we are together, which means we have become stronger,\" he added.\nPutin watched a procession of Russian ships and a flyby by its jets, mirroring the day's main celebrations in Moscow's Red Square.\nUkraine's Foreign Ministry immediately condemned the visit as an escalation of tensions in the region, and NATO labeled it \"inappropriate.\"\nCrimea has gone in and out of Russian and Ukrainian ownership, but for a large part of the 20th century it was a key Soviet port used by its imperious Black Sea Fleet, which still docks there today.\nGerman Chancellor Angela Merkel said on Wednesday that it would be a pity if Putin used the anniversary to visit Crimea.\nA smaller parade also took place ineastern Ukraine, where armed pro-Russian groups have seized buildings and are holding a referendum to join Russia this weekend.\n- Alexander Smith","url":"https://www.nbcnews.com/storyline/ukraine-crisis/vladimir-putin-visits-crimea-russias-wwii-victory-day-celebrations-n101211"}
