{"authors":[],"date_download":"2018-10-30 01:23:05","date_modify":"2018-10-30 01:23:05","date_publish":"2016-03-21 08:00:00","description":null,"filename":"data/vaneerConsumption/VladimirBukovskyonArmandoValladares.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/03/Screen20Shot202016-03-2120at2012.59.0620AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862585.html","title":"Vladimir Bukovsky on Armando Valladares","title_page":"Vladimir Bukovsky on Armando ValladaresThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"This review of Armando Valladares’s ‘Against All Hope: The Prison Memoirs of Armando Valladares’ (Knopf) appeared in our December 1986 issue.\nA few years ago in Caracas, Venezuela, as part of our activities with Resistance International, I attended a series of hearings with Armando Valladares on political repression in Nicaragua. After three days of testimony about persecution of several groups—including lawyers, trade- unionists, human rights activists, Jews—we became particularly concerned with the plight of the Miskito Indians. It seemed clear to us that the Sandinista policy toward them amounted to nothing less than genocide.\nAlthough the local press paid some attention to the hearings, the world media ignored them, focusing instead on a conference of Latin American Ministers of Finance a few blocks away. Fernando Arrabal, the Spanish playwright, suggested that we hold a small peaceful demonstration at the financial conference in hopes of attracting the media’s attention, if only briefly, to the Indians’ plight.\nA group of us “borrowed” a sheet from our hotel, scribbled a slogan on it, and after smuggling it into the conference under someone’s clothes, unfurled it in front of the ministers and the television cameras as Adriana Guillen, a spokesman for the Miskitos, presented their case.\nThe event lasted no longer than a minute, but the local police and security guards, apparently insulted by our little publicity stunt, surrounded us when we tried to leave the building. In much confusion we were taken from the conference room to some sort of guardhouse, where the turmoil and hostility escalated as a series of police officials arrived, each one of higher rank than the last.\nFinally the door swung open and the chief of police himself entered the room. Shifting a fiery gaze from prisoner to prisoner, he spoke rapidly and threateningly in Spanish. Suddenly I heard Valladares’s voice resounding in complete silence.\n“I am Armando Valladares. I have spent twenty-two years in Castro’s jails. Would you arrest me?”\nValladares spoke quietly, but there was so much dignity and force in his voice, so much implacable will in his words, that the chief merely looked at him sheepishly, and I knew then that the incident was over.\nValladares’s twenty-two years of torment and triumph are now condensed for us in these 380 pages. Against All Hope is a rather dispassionate account. Indeed, at first the reader might be surprised by the aloofness with which Valladares describes his ordeal. Detail takes precedence over emotion. But eventually it comes to mind that this is not a book in any usual sense; it is rather a testimony, an indictment, a history of the Cuban “revolution” viewed from its dungeons. (And how is a socialist revolution seen more clearly than from its “sewage system”?)\nUnderstood this way, the tone of Against All Hope is not at all surprising. To endure the regular beatings, the hunger, the humiliation and psychological “experimentation” to which a revolution subjects its unrepentant enemies, you must learn to be estranged, to watch yourself from a distance. How then do you describe the regular beatings with truncheons, chains, and bayonets; beatings so brutal that your friends are often left bleeding, mutilated, or murdered? How to describe being locked in solitary for a year, naked and hungry, awakened each morning with a bucketful of human excrement thrown from above? Since no bath was allowed and no water provided, a crust of filth and fungus would cover your body until after many months “this crust could be peeled off like a scab or like the rind of a fruit.”\nThis was the kind of treatment meted out routinely to Valladares and his colleagues. But it was something they got used to. At La Cabaña, executions were performed by young conscripts for five pesos and three days leave apiece. The leader of the executioners was an American, Herman F. Marks, who “had a dog he took with him to the executions so the dog could lap up the dead men’s blood.” (Mr. Marks, by the way, now reportedly lives in the United States. Why hasn’t the Justice Department gone after him?) At Bonita prison, there were the “drawer cells” and “biological experiments,” the latter overseen by Soviet, Czech, and East German “doctors.” I am much more familiar with such experiments than with the outright terror of the newly victorious revolution:\nThey did not try to kill us quickly; that would have been too generous a gesture to have hoped for from those sadists. Their object was to force us, by means of terror and torture, into the Political Rehabilitation Program. To do that, they were slowly and inexorably destroying us. They would take us to the very brink of death and keep us there, without letting us cross it.\nIndeed, under the encouraging influence of the Soviet Union (or perhaps due to Cuba’s smaller size), the “revolutionary process” in Cuba covered in twenty-seven years what the Soviet Union has achieved in seventy. Within a single generation Cuba advanced from “revolutionary justice” to “socialist legality,” from the “liquidation of class enemies” to “political rehabilitation.” The result is truly paradoxical: the same people who would have been happily shot at the revolution’s beginning were not allowed to die a few years later, even if they went on a hunger strike.\nThe confusion created by the hasty pace of Cuban history is duly reflected in the composition of the prison population; different stages of “class struggle” and purges, as well as different periods of popular resistance, almost coincided. It is as if in Soviet prisons today one could come across White Army officers, old revolutionaries, Trotskyists, and peasant guerrillas serving alongside modern-day dissidents and Jews seeking emigration to Israel. A large number of Castro’s prisoners are his former comrades-in-arms who “deviated” from his course at one or another turning point, while their cell-mates could be anybody from former Batista pilots to members of the current intellectual opposition. But perhaps this is as it should be in a country where the supreme leader combines in himself Lenin and Stalin, Khrushchev and Brezhnev. What might be interesting for a historian, however, is usually quite painful for contemporaries. Valladares and his friends had to endure the same set of sufferings as three generations of Russians.\nFor all its dispassionate detail, Against All Hope is not just a catalogue of horrors and tortures. It is, above all, a powerful testimony to the strength of the human spirit. At the time of his arrest in 1960, Valladares was a 23-year-old clerk at a postal savings bank in Havana. He was not politically involved, but he had “frequently spoken out against Communism as a political system because it went against my religious beliefs and some of my more idealistic notions of the world.” “And I was very naive,” he writes. “It never occurred to me that because I expressed my opinions, because I spoke out against Marxism, they would drag me off to jail. Moreover, the government still hadn’t declared itself Marxist. Castro would do that only some months later.”\nThis naïveté, we should add, was shared at the time by the most sophisticated political observers. But while Castro and his admirers were vehemently denying any connection between the new Cuban regime and Communist ideology, thousands had already been thrown into jails for criticizing Marxism. Even many years later, numerous sympathizers and apologists for Fidel would still blame American “overreaction” for “pushing him into Soviet hands” — a myth which can hardly be explained by a simple naïveté.\nThe real turning point in Armando’s spiritual development came in La Cabaña, during the nightly executions:\nWhen I heard the discharges of the rifles, I would be seized with horror, and I embraced Christ in desperation.… He served to give my life, and my death if it came to that, ethical meaning. Both my life and my death would be dignified by my belief in Him. It was at that moment, I am sure, and not before, that Christianity became, more than a religious faith, a way of life for me. Because of my situation, it seemed my life would necessarily be a life of resistance, but I would be sustained in it by a soul filled with love and hope. Those cries of the executed patriots — “Long live Christ the King! Down with Communism!” — had awakened me to a new life as they echoed through the two-hundred-year-old moats of the fortress.\nValladares became one of the plantados, the diehards who would not join the Rehabilitation Program under any circumstances. That, of course, was a direct challenge to the regime and therefore meant even more torture, beatings, degradation, and murder. Some were forced to pull weeds with their teeth and to eat dirt, others were beaten to death or killed with bayonets, or submerged in ditches filled with human excrement. “But in step with the insane fury of the soldiers, a deep consciousness was growing inside us, an inflexible determination to resist, not to give in. We grew harder and harder, convinced that we were a symbol of resistance for the entire country.”\nIndeed they were. In a time of ultimate crisis a nation needs a symbol to survive. A sense of enormous responsibility for your nation becomes much stronger than a craving for your personal life. Those who have never lived through such an experience may see the struggle as senseless fanaticism, as a death wish, or as simple masochism.\nWhat is the point of token resistance by a couple of hundred when millions have already accepted their fate? What is the point in being starved and beaten just for the refusal to be dressed in a blue uniform instead of a green? But dictators and conquerors do see the point. As long as there is a symbol, the nation is not conquered. A shot in the back is not a solution, for symbols are immortal.\nEven the hardest of tests, like the imprisonment of his father, failed to break Armando’s will. Confined to a wheelchair, asthmatic and starving, denied medical treatment unless he accepted political rehabilitation, Valladares suddenly discovered a new weapon: poetry. Smuggled out of prison on tiny scraps of paper, his words continued the struggle, even though he himself could no longer walk. And no matter how hard his captors tried to isolate him, to cut off his lifeline, the scraps of paper invariably arrived in Miami, where his wife Martha lived. His first collection of poetry, From My Wheelchair, increased the public pressure from abroad that finally forced Castro to release him.\nNo hatred or bitterness disturbs his dispassionate account because those who are not broken only pity their tormentors. Yet Against All Hope is an indictment nevertheless. It is an indictment of the world’s complicity and indifference, an indictment of the Western sympathizers with the “charismatic revolutionary leader” Fidel Castro, who silenced the screams of the tortured. Thanks to them, the names of La Cabaña and Boniato, Isla de Piños and Combinado del Este are not known to the world, as Auschwitz and Bitburg are. It is an indictment also of the U.N. Human Rights Commission, which answered with silence all the appeals addressed to them by the Cuban political prisoners. It is an indictment of Monsignor Cesar Zacchi, the Vatican’s ambassador to Cuba, and of Pierr Schori, secretary of the Swedish Social Democratic party, of all the advocates of “quiet diplomacy” and the architects of the silence that surrounds the crimes of Communism — in the words of Valladares, “the silence of complicity.”","url":"https://spectator.org/65837_vladimir-bukovsky-armando-valladares/"}
