{"authors":[],"date_download":"2018-10-22 22:17:39","date_modify":"2018-10-22 22:17:39","date_publish":"2014-06-06 23:39:32","description":"Vodafone says that several countries demand direct access to its networks without warrant or prior notice.","filename":"data/vaneerConsumption/VodafoneReportDetailsExtentofGovernmentSnooping.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/493696/140606-tech-vodafone_surveillance-_2da606d54089e048a55c7b8625ab75c8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_security_vodafone-report-details-extent-government-snooping-n124996_1540246659.html","title":"Vodafone Report Details Extent of Government Snooping","title_page":"Vodafone Report Details Extent of Government Snooping","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGovernment snooping into phone networks is extensive worldwide, one of the world's largest cellphone companies revealed Friday, saying that several countries demand direct access to its networks without warrant or prior notice.\nThe detailed report from Vodafone, which covers the 29 countries in which it operates in Europe, Africa and Asia, provides the most comprehensive look to date at how governments monitor mobile phone communications. It amounts to a call for a debate on the issue as businesses increasingly worry about being seen as worthy of trust.\nWiretapping of phones and accessing of call records for law-enforcement purposes is a decades-old and accepted practice even in the most open democracies. With backing from courts, police can request cooperation from phone companies, a valuable tool for the pursuit of criminals.\nBut the most explosive revelation in Vodafone's report is that in six countries, authorities require direct access to an operator's network — bypassing legal niceties like warrants and eliminating the need to get case-by-case cooperation from phone-company employees. It did not name the countries for legal reasons and to safeguard employees working there.\n\"In those countries, Vodafone will not receive any form of demand for lawful interception access as the relevant agencies and authorities already have permanent access to customer communications via their own direct link,\" the report said.\nVodafone's report comes one year after documents leaked by former NSA systems analyst Edward Snowden revealed that the U.S. and other countries' intelligence agencies routinely and indiscriminately gather and store huge amounts of data from phone calls and Internet communications.\nThe revelations have focused particular attention on the role of Western technology and telecommunications firms, which stand accused of facilitating the mass surveillance by giving spies unrestricted access to their networks. Several Silicon Valley companies have since attempted to restore consumers' trust by publishing data on government surveillance.","url":"https://www.nbcnews.com/tech/security/vodafone-report-details-extent-government-snooping-n124996"}
