{"authors":[],"date_download":"2018-10-30 01:24:09","date_modify":"2018-10-30 01:24:09","date_publish":"2014-07-10 08:00:00","description":null,"filename":"data/vaneerConsumption/VodkaisColorlessOdorlessFlavorlessandAmazing.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/07/Screen20Shot202014-07-0920at201.22.5520PM_2.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862649.html","title":"Vodka is Colorless, Odorless, Flavorless, and Amazing","title_page":"Vodka is Colorless, Odorless, Flavorless, and AmazingThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"October 4 is National Vodka Day, but no one knows precisely when, where, or even why vodka was first made. (Even National​VodkaDay.com admits that “we have not found the origins of why, but it works for us. No harm celebrating responsibly on other days as well.”) It depends on your definition of vodka.\nWe can go as far back as the eighth century A.D., when alchemist Jabir ibn Hayyan, known to the West as Geber, invented the alembic to capture vapor from heated wine, which he described as “of little use, but of great importance to science.” (If only he had placed it in a frosted glass bottle and had beautiful women sell it at the local taverns!) In the fourteenth century, the Italians were drinking aqua vitae, which supposedly they learned to make from alchemists in southern France, who, in turn, had studied the methods of the Arabs. In any event the Italians brought their product to Moscow, and around 1430 a Russian monk named Isidore supposedly turned this into vodka.\nThat liquid nowhere near resembled the neutral grain spirits we drink today. It smelled bad, tasted worse, and was more medicinal in nature, probably best applied topically than ingested. (Even in more recent times, a friend reports that when she fell sick in Tashkent the local doctor told her to take some vodka…and rub it on her chest.) But over the centuries, distillation methods improved, and vodka—the word most likely a diminutive of the Russian word for water, воды, or, in the Roman alphabet, voda—became the drink of choice in the Russian Empire.\nBut far from being used to “celebrate responsibly,” all levels of society abused it heavily. In the 1690s, for instance, Peter the Great founded his All Drunken, All-Jesting Assembly, which devoted itself to mocking the Orthodox church. The czar also invented the “penalty shot,” described in Ria Novosti as “a shot of vodka that those who arrived late for a feast were forced to drink. In fact, when he organised feasts, the penalty shot came in the form of a 1.5-litre goblet named the Big Eagle.” Peter proved less tolerant outside his court, however, forcing those caught publicly intoxicated to wear a fifteen-pound medal of shame for a week.\nBy the nineteenth century, vodka had become the principal source of tax revenue for the Russian government, as much as 46 percent of the budget. Alcoholism ran rampant. One estimate tallied two hundred thousand vodka-related deaths per year. A burgeoning temperance movement included Anton Chekhov and Leo Tolstoy. The government found itself in an untenable position: in need of the money from vodka sales but dealing with a degenerating society. A solution came in the form of the Guardianship of Public Sobriety in 1895 and the State Vodka Monopoly, created a year later. Both were total disasters.\nIn The Alcoholic Empire: Vodka and Politics in Late Imperial Russia, author Patricia Herlihy explains how “the state attempted to confine the sale of alcoholic beverages to government-run stores where no food was served. After purchases in the state-controlled store, drinkers downed vodka on the street and smuggled vodka into traktirs (cheap eating establishments).” Worse, these regulated stores couldn’t halt an ever-growing black market of watered-down or poison-infused vodkas. The guardianship, meanwhile, emphasized moderation rather than abstinence. Herlihy quotes the welfare institution’s official goals as: “to create intelligent entertainment which might attract and raise the spiritual level of the population, widen its horizons, give it healthy nourishment, and care for its bodily health.” The author, a professor of Russian and Soviet history and a vodka expert as well, adds that “the irony of the state’s being the sole purveyor of alcohol while piously proclaiming moderation in drink was not lost on contemporaries.”\nBut one good thing did come from this mess: a vodka of unprecedented purity using fresh ingredients distilled by a former serf named Pyotr Smirnov. He began in 1864, and by 1872, writes Linda Himelstein in The King of Vodka, “Smirnov employed more than sixty workers and oversaw three managers. He produced up to 100,000 pails of alcoholic drinks and grossed 600,000 rubles annually, or the equivalent of almost $7 million in today’s dollars.”\nIn 1876 the rising distiller brought his vodkas to the Centennial Exhibition in Philadelphia, where they won medals. Himelstein cites the New York Times’s coverage, which pays prescient attention to packaging: “The first thing that strikes one is the variety of wines, brandies, and liqueurs Russia must make and drink. Here is vodki in every imaginable kind of bottle. When people travel for months in temperatures below zero such elegant bottles must be very comforting.”\nTen years later Smirnov received the official endorsement of Czar Alexander III, immediately changing the labels on his bottles to note the distinction. In 1893 Smirnov returned to America, this time to the Chicago World’s Fair where, again, his bottles won honors. Smirnov ran ads not only touting his vodka’s purity but also attacking counterfeit distillers. Supposedly he even launched a word-of-mouth campaign, in which paid individuals went into the city’s bars and loudly demanded Smirnov vodka.\nFive years later Smirnov died of a stroke. He was, at the time, one of the richest men in Russia, worth the equivalent of $132 million today. But between family infighting and the newly imposed imperial monopoly, it was only a matter of time before his empire started to crumble. Then came a series of calamities: the workers’ strike of 1905, followed by outright prohibition in 1914, the catastrophic Great War, and the Bolshevik Revolution. Prohibition ended in 1925, but the Smirnov distillery now fell under the control of the Soviets, who targeted the Smirnov family for persecution.\nOnly one of Smirnov’s sons, Vladimir, managed to escape the USSR. He eventually opened a small distillery in Paris under the company name Pierre Smirnoff Fils before moving down to Nice to settle within the Russian exile community there. Unfortunately, notes Himelstein, “his vodka business was sputtering—France was not taken by the taste of the colorless spirit, preferring its own wines and cognacs, nor did it seem that the rest of Europe had a thirst for vodka either.” Smirnov should have moved to London, where vodka was gaining popularity. As one liquor wholesaler named Mrs. “Temperance” Fisher told the press in 1926: “I think there must be a large number of Russians in London because I sell so much vodka here. Englishmen are beginning to acquire a taste for it, too. Just at first it sometimes puts them under the table.”\nNor was America clamoring for the spirit. Though Smirnov introduced his vodka to America in 1876 and again in 1893, it didn’t catch on outside of ethnic enclaves. During the colonial era, the Triangular Trade—slaves from Africa to the Caribbean; sugar and molasses from the Caribbean to the American colonies; rum from the American colonies to Britain—transformed rum into the dominant spirit of the era. “By 1770,” notes Wayne Curtis in And a Bottle of Rum: A History of the New World in Ten Cocktails, “the North American colonists were importing some 6.5 million gallons of molasses from the islands, which was distilled into about 5 million gallons of rum.” According to some estimates, by the late 1700s, this amounted to five shots of rum per day for the average American over age fifteen.\nBut with the onset of taxes, embargoes, and the War of Independence, rum consumption declined. Curtis mentions Sam Adams, who ran the following advertisement: “It is to be hoped, that the Gentlemen of the Town will endeavor to bring our own October Beer into Fashion again, by that most prevailing Motive, Example, so that we may no longer be beholden to Foreigners for a Credible Liquor, which may be as successfully manufactured in this Country.”\nWith an abundance of grain, the American farmer was more than willing to set the example. As Max Watman points out in Chasing the White Dog: An Amateur Outlaw’s Adventures in Moonshine: “It’s easier to transport grain that is stored as whiskey than it is to transport the raw product. Second, grain spoils, whiskey doesn’t. Third, whiskey is always worth more than the grain that went into making it.” By 1860, Watman writes, “the liquor business was booming. The nation produced almost 90 million gallons of spirits each year. Whiskey was cheap—24 cents a gallon in New York, 14 cents a gallon in Ohio—and none of it was taxed.”\nIn 1862 publishing house Dick & Fitzgerald issued bartender Jerry Thomas’s cocktail guide, How to Mix Drinks, or The Bon Vivant’s Companion, the first book of its kind published in America. “We simply contend that a relish for ‘social drinks’ is universal,” Thomas writes in the preface, “that those drinks exist in greater variety in the United States than in any other country in the world; and that he, therefore, who proposes to impart to these drinks not only the most palatable but the most wholesome characteristics of which they may be made susceptible, is a genuine public benefactor.” Thomas, who had joined the Gold Rush at age nineteen, calls the cocktail “a modern invention, and is generally used on fishing and other sporting parties, although some patients insist that it is good in the morning as a tonic.” The book contains 463 entries, including the Whiskey Cocktail, Gin Sour, and Crème de Nymphe, also known as a Lady’s Cream. Not a single recipe contains vodka. Nevertheless, we have arrived at the dawn of the Golden Age of Drinking (a phrase coined by H. L. Mencken).\nBut just as in Russia, America faced a battle over alcohol, culminating in 1920 in the Eighteenth Amendment, making Prohibition the law of the land. It lasted thirteen years and failed miserably. Oklahoma’s favorite son, laconic cowboy Will Rogers, famously said, “Prohibition is better than no liquor at all.” Bootleggers thrived, and booze continued to flow—some of it lethal. When the Twenty-First Amendment finally reversed the ban, drinking culture had changed. “Serious imbibers who recalled the stylish cocktails served up prior to Prohibition were disheartened by unschooled hordes that filled the new bars to overflowing,” writes Curtis. The new crowd “saw drink as a mere intoxicant rather than a centerpiece to a social ritual.”\nThe stage was set.\nEditor’s Note: This piece is excerpted from Victorino Matus’s new book, Vodka: How a Colorless, Odorless, Flavorless Spirit Conquered America. Reprinted by permission of Lyons Press.","url":"https://spectator.org/59908_vodka-colorless-odorless-flavorless-and-amazing/"}
