{"authors":["Edwin Mora"],"date_download":"2018-10-30 18:47:05","date_modify":"2018-10-30 18:47:05","date_publish":"2017-04-10 13:44:41","description":"Muslim extremists murdered a Vogue cover model in Bangladesh for not wearing Islamic clothing, alleged the victim’s family.","filename":"data/vaneerConsumption/VogueModelKilledforRefusingtoWearIslamicGarments.json","image_url":"https://media.breitbart.com/media/2017/04/Raudha-Athif-instagram.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_04_10__1540925225.html","title":"'Vogue' Model Killed for Refusing to Wear Islamic Garments","title_page":"Bangladesh Family: 'Vogue' Model Killed for Refusing to Wear Islamic Garments","title_rss":"NULL","source_domain":"breitbart.com","text":"Muslim extremists murdered a Vogue cover model in Bangladesh for not wearing Islamic clothing, the victim’s family alleged after the authorities ruled the late 21-year-old’s death a suicide.\n“We primarily suspect it is a suicide case,” Zillur Rahman, officer-in-charge of Shah Makhdum Police Station, told the Daily Star from India, referring to Raudha Athif, the young model from Maldives.\nDaily Mail reports, “An autopsy report carried out in Bangladesh ruled her death a suicide before her burial on Saturday. But her brother has since insisted that Raudha, who was Muslim, was murdered and that her death was made to look like a suicide.”\nRaudha’s father and brother have dismissed the suggestion that she took her own life.\nThe Rajshahi Medical College Hospital conducted the autopsy after Bangladeshi authorities reportedly recovered Raudha’s body around midday last week, reveals the Daily Star.\nHer classmates reportedly found Raudha, a second-year student at the Islami Bank Medical College in Rajshahi city, hanged in her dorm room last Wednesday.\nMohamed Athif, the victim’s father, is among the family members who have rebuked the autopsy report’s conclusion that the model took her life. Rayyan Athif, Raudha’s 18-year-old brother, has also echoed his father’s doubts.\n“There have been a series of murders in Bangladesh which have been staged to look like suicides and Islamic extremists have been suspected to be behind these atrocities,” Rayyan Athif, 18, told the Sun.\n“Her style of clothing was branded as ‘immodest’ and ‘un-Islamic’ even though she adhered to the dress code in the college premises by wearing a veil covering her face,” he added. “But she was criticized for wearing jeans and was repeatedly told she couldn’t wear it at the Muslim college – which has a lot of extremist connections and support.”\nLaw enforcement from her native Maldives reportedly met with Bangladesh’s Rajshahi Metropolitan Police (RMP) and medical college to discuss the young victim’s controversial death.\nAmin Hossain, the assistant commissioner of RMP detective branch, is quoted by the Dhaka Tribune as saying there was a “50 percent chance that she did not commit suicide.”\nMahmuda Begum, the superintendent at the female-only hostel where the young college student’s body was discovered, added that the victim “always looked happy” and that it was “hard to believe she would commit suicide”\n“The model’s first major breakthrough was a stunning image taken by photographer Sotti, called ‘Maldivian Girl With Aqua Blue Eyes,’ which was praised by the former president of the Maldives over social media,” notes Daily Mail.\nIt adds, “The picture made her an internet sensation in 2014. Her fame grew and she eventually landed on the cover of Vogue India in October last year.”","url":"https://www.breitbart.com/national-security/2017/04/10/bangladesh-family-vogue-model-killed-refusing-wear-islamic-garments/"}
