{"authors":["Olivier Laurent","Photo Editor Focusing On France","Africa","Middle East"],"date_download":"2018-10-21 03:05:21","date_modify":"2018-10-21 03:05:21","date_publish":"2018-09-03 09:00:37","description":"Voices of African Photography is a 10-part series presented in partnership with Everyday Africa and the African Photojournalism Database to highlight the work of 10 African photographers","filename":"data/vaneerConsumption/VoicesofAfricanphotographyReclaimingtheblackbody.json","image_url":"https://www.washingtonpost.com/resizer/t7Mc_DaMRncxP7F3ws596PmV07c=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2XBXTMWQCEZ2PLM6MRJYEVYD6M.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_09_03__1540091121.html","title":"Voices of African photography: Reclaiming the black body","title_page":"Voices of African photography: Reclaiming the black body - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"From the series “Consumption of the Black Model.” (Yagazie Emezi)\nVoices of African Photography is a 10-part series presented in partnership with the African Photojournalism Database, a joint project of Everyday Africa and World Press Photo, to highlight the work of 10 African photographers and photojournalists.\nYagazie Emezi, one of the most enthralling new voices of African photography, came to embrace the medium out of necessity. Just a few years ago, the Nigerian native, moving to Lagos from a small but overpopulated town, was struggling to find a job, sleeping on couches and in friends’ homes.\n“I was emotionally extinguished and out of money,” she said.\nDuring that time, she was taking photographs with her phone of her new surroundings with a never-ending eagerness to share her experiences on social media. “Capturing my new environment had become second nature, and although I had often been prodded in the direction of photography since my move to Lagos, I had not followed through, mainly because I had no idea where to start … until I was down to my last few pennies.”\nHer shift to professional photography started in 2015 when she was hired to shoot backstage at the Lagos Fashion Week. “From there, it was from one referral to another and the work and opportunities carried,” she said.\nSince those early days, Emezi’s work has been published in Vogue, Time and the New York Times, and has been recognized with a Getty Images Creative Bursary Award. Deeply rooted in portraiture, her personal projects often address how we perceive our bodies and those of others. In “The Beauties of West Point,” Emezi photographs women who don’t aspire to conform to beauty standards, instead choosing to wear what they love in a bid to reclaim their images against enforced global standards. That concept is echoed in the Nigerian photographer’s ongoing series “Process of Re-Learning Bodies,” in which she examines how we are affected by and react to our own scarred bodies.\n“When I started, the majority of my images were taken with a Blackberry and an iPhone 4, so pointing my lens at someone often meant getting as close as possible,” she told In Sight. “In Nigeria as with a lot of other places, you really can’t do that without explaining yourself first. I did a lot of portraiture because of this and I still do. I had done a bit of street photography in Lagos, but I personally preferred the intimacy of acknowledging and being acknowledged directly by others.”\nThese relationships form an important part of her work and they are informed, she said, by her curiosity, which often leads her to new project ideas. “A lot of my work draws from nostalgia of home,” she added. “It could be a face, a sound or even the smell of someone’s sweat that becomes nostalgic, and then I linger. In a way, I suppose that I look for elements of home.”\nToday, Emezi is a notable voice in African photography. But that didn’t come easy.\n“I believe that getting noticed on a global scale is dependent on certain industry gatekeepers and the stories (and their storytellers) they deem as valuable enough to elevate, outside of the very necessary relevance of certain stories,” she said.\nDuring her early years in photography, Emezi was fortunate, she said, to be surrounded by a small but strong network of photographers, writers and other creatives “that in one way or another have contributed to ensuring my ability to keep working.” She added that having ownership of her own personal platform also helped her amplify her narratives. “Social media and technology has played a very strong role for a lot of artists of color, including myself, to create spaces where people can view more diverse stories.”\nBut that doesn’t absolve the role gatekeepers, such as The Washington Post, play in crafting the narrative. “A lot of ‘othering’ still takes place,” Emezi said. “There are those with access and those without. And with that comes the idea that those without remain ignorant to how the industry works and how it can be made better.”\nThe result is that while international platforms share and give access to a diverse network of underrepresented photographers, “they remain the fixed authority, with little exchange,” she said. “They give, yes, but do they also receive? Does being a minority warrant not being an authority in the work? I believe that a lot more minds in our industry need to be expanded in order for us to not only see more works represented, but to also truly listen to these voices and what they have to say about the photography spaces they are occupying.”\nHer latest project, “Consumption of the Black Model,” addresses this problem.\n“Often times, intentionally or unintentionally, the black body becomes a canvas to project fetishized narratives,” she wrote on her website. “With our minds and our cameras, we are capable of not just documenting the people, environments and events around us; we are also capable of creating stories using people to push a narrative in spaces where we don’t often see ourselves represented.”\nThe next installment of Voices of African Photography will be published Sept. 17.\nFrom the series “Consumption of the Black Model.” (Yagazie Emezi)\nFrom the series “Consumption of the Black Model.” (Yagazie Emezi)\nFrom the series “Consumption of the Black Model.” (Yagazie Emezi)\nFrom the series “Re-Learning Bodies.” (Yagazie Emezi)\nFrom the series “Re-Learning Bodies.” (Yagazie Emezi)\nFrom the series “Re-Learning Bodies.” (Yagazie Emezi)\nFrom the series “Re-Learning Bodies.” (Yagazie Emezi)\nFrom the series “Re-Learning Bodies.” (Yagazie Emezi)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nLooking everyday at everything everywhere\nThis Instagram account is putting the spotlight on animal extinction\nArtist Omar Victor Diop’s work ‘recasts history and the global politics of black resistance’","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/09/03/voices-of-african-photography-reclaiming-the-black-body/"}
