{"authors":["Jay Akbar For Mailonline"],"date_download":"2018-10-23 01:23:54","date_modify":"2018-10-23 01:23:54","date_publish":"2016-01-11 12:12:17","description":"Volkswagen CEO Matthias Mueller (centre) has defended the company in the face of a worldwide emissions scandal and massive potential fines, and vowed to win back the public's trust","filename":"data/vaneerConsumption/VolkswagenCEOMatthiasMuellerdefendsVWoveremissionsscandal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/300220C200000578-0-image-a-37_1452513007268.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393673_We-not-criminal-brand-Volkswagen-CEO-defends-fire-company-emissions-scandal_1540257834.html","title":"Volkswagen CEO Matthias Mueller defends VW over emissions scandal","title_page":"Volkswagen CEO Matthias Mueller defends VW  over emissions scandal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Car giant's sales have fallen since scandal first broke in September 2015\nVolkswagen's CEO has defended the company in the face of a worldwide emissions scandal and massive potential fines.\n'We are not a criminal brand or group,' Matthias Mueller said at the Detroit auto show, ahead of his meeting with the Environment Protection Agency (EPA) on Wednesday.\nHe is to propose a fix for the 580,000 U.S. vehicles that were fitted with a device that cheated emissions tests.\nScroll down for videos\nVolkswagen's CEO Matthias Mueller (centre) has defended the company in the face of a worldwide emissions scandal and massive potential fines\nHe is to propose a fix for the 580,000 U.S. vehicles (file photo of VW car) that were fitted with a device that cheated emissions tests\nThe EPA has been unhappy with VW's handling of the scandal after it emerged the car giant installed the cheating software on 11million diesel cars worldwide.\nWhile German authorities have already approved a fix for most European cars, U.S. regulators have withheld approval because American standards on nitrogen oxide emissions are more strict.\n'We will offer some solutions and then we will see what the reaction will be,' Mueller said in his first public appearance before the U.S. media since the scandal broke.\nDespite a huge fall in sales, Mueller said VW would push ahead on plans to expands its only U.S. factory in Tennessee. He said the $900million expansion will create around 2,000 new jobs.\nHe vowed to win back the public's trust following the scandal but refused to acknowledge the U.S. Justice Department's criminal probe into the company's actions.\n'We haven't been that [a criminal brand]. We have made a huge default, technical default, but there was no intention against customers or authorities.' Mueller said.\nThe EPA has been unhappy with VW's (pictured, CEO Matthias Mueller) handling of the scandal after it emerged the car giant installed the cheating software on 11million diesel cars worldwide\nHe also stopped short of acknowledging that the company lied, saying: 'Whether we did lie or not – that is the issue of the investigation.'\nMueller added the company was working on a compensation plan for diesel vehicle owners through a fund to be overseen by U.S. lawyer Ken Feinberg, who also managed the General Motors ignition-switch victim fund.\nThe company's global sales, which encompasses eight brands including VW, Audi and Porsche, fell two per cent from 2014 to 2015.\nAnd the emissions scandal contributed to a 5.2 per cent global decline in December for the whole of Volkswagen Group, compared to a year earlier.\nThe U.S. Justice Department is suing the German company for up to $46billion for allegedly violating environmental laws - though some legal experts expect the final settlement to be far lower.\nOther countries have also acted. Brazil and South Korea have both imposed fines of well over $10million on VW for cheating on emissions.\nAlthough VW has said 8.5million of the 11million which contained the banned software were sold in Europe, no European national authority has yet ordered any penalties.\nMueller apologized for the scandal but stopped short of acknowledging that the company lied, saying: 'Whether we did lie or not – that is the issue of the investigation (file photo of VW cars)\nMueller added the company was working on a compensation plan for diesel vehicle owners (file photo of VW cars)\nEU sources and lawyers said they would be surprised if the firm received any significant fines within the European Union.\nEU states are said to be reluctant to mete out tough financial penalties because of an unwritten rule that some national interests are sacred.\nAccording to the EU sources, Germany's car industry has traditionally been one of them.\nVW, Europe's biggest motor manufacturer, employs more than 750,000 people in Germany, and has been a symbol of the nation's engineering prowess.","url":"https://www.dailymail.co.uk/news/article-3393673/We-not-criminal-brand-Volkswagen-CEO-defends-fire-company-emissions-scandal.html"}
