{"authors":["Associated Press"],"date_download":"2018-10-23 04:56:48","date_modify":"2018-10-23 04:56:48","date_publish":"2017-03-16 15:59:40","description":"DETROIT (AP) - A judge on Thursday refused to set a bond and release a German Volkswagen executive who was arrested in the company's U.S. emissions scandal...","filename":"data/vaneerConsumption/VolkswagenexecremainsjailedinUSemissionscheatingcase.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320794_Volkswagen-exec-stays-jail-US-emissions-cheating-case_1540270608.html","title":"Volkswagen exec remains jailed in US emissions cheating case","title_page":"Volkswagen exec remains jailed in US emissions cheating case | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"DETROIT (AP) - A judge on Thursday refused to set a bond and release a German Volkswagen executive who was arrested in the company's U.S. emissions scandal while on vacation in Florida.\nOliver Schmidt's attorneys said he was willing to risk $1.6 million in assets, with help from family and friends, to persuade a judge that he would stay in the Detroit area and return for subsequent court hearings. But prosecutors successfully argued that he has no ties to the U.S. and would be out of reach if he flees to Germany, his home country and the headquarters of Volkswagen.\n\"This is a very, very serious case,\" U.S. District Judge Sean Cox said.\nThe decision means Schmidt will remain locked up while his criminal case moves through court. He's one of seven VW employees charged in a scheme to cheat emissions standards on nearly 600,000 diesel vehicles in the U.S. Five others also are German citizens, but they might never appear in a U.S. court because Germany doesn't extradite its citizens.\nSchmidt has pleaded not guilty to charges of conspiracy and fraud. Until 2015, he was the manager of VW's environment and engineering office in suburban Detroit. He's accused of lying to U.S. regulators by saying technical problems - not cheating software - were to blame for the difference in diesel emissions in road and lab tests.\nVolkswagen pleaded guilty last week and has agreed to pay $4.3 billion in criminal and civil penalties, on top of billions more to buy back cars. Cox hasn't ruled yet on the proposed $2.8 billion criminal fine.\nSchmidt apparently didn't know he would be charged. He was arrested in Miami in early January before he could fly back to Germany.\nHis lawyer, David DuMouchel, insisted to the judge that Schmidt has no intention of fleeing the U.S. if granted bail. He said Schmidt was willing to wear an electronic monitor and live in suburban Detroit while helping lawyers translate documents and prepare a defense.\n\"He wants to be here,\" DuMouchel said.\n___\nFollow Ed White at http://twitter.com/edwhiteap","url":"https://www.dailymail.co.uk/wires/ap/article-4320794/Volkswagen-exec-stays-jail-US-emissions-cheating-case.html"}
