{"authors":["Sara Malm For Mailonline"],"date_download":"2018-10-23 00:31:32","date_modify":"2018-10-23 00:31:32","date_publish":"2016-01-28 14:36:39","description":"The tragic story of the 24-year-old Syrian who died after waiting outside the registration centre in Berlin was shared on social media all over the world yesterday - but it has now emerged to be fake.","filename":"data/vaneerConsumption/VolunteerwhoclaimedamigranthaddroppeddeadinBerlinLIED.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/12/30A0C01C00000578-0-image-a-71_1453897831168.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421029_Volunteer-claimed-migrant-dropped-dead-outside-Berlin-registration-centre-waiting-outside-days-admits-LIED-bid-win-sympathy-asylum-seekers_1540254692.html","title":"Volunteer who claimed a migrant had dropped dead in Berlin LIED","title_page":"Volunteer who claimed a migrant had dropped dead in Berlin LIED | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The reports that a Syrian refugee had fallen ill and died after queuing for days outside of an overworked immigration processing office in Berlin, has been unmasked as a lie.\nThe tragic story of a 24-year-old man succumbing to influenza after waiting outside the registration centre in freezing temperatures was shared on social media all over the world yesterday.\nHowever, the volunteer worker who shared the story on social media had made it all up to win sympathy and support for the plight of the migranrs in the German capital, Berlin police reports.\nThe tragic story of the 24-year-old Syrian who died after waiting outside the registration centre in Berlin (pictured) was shared on social media all over the world yesterday - but it has now emerged to be fake\nA German immigration worker named Dirk V., had posted the story about the 24-year-old asylum seeker who had developed influenza while waiting in the queue.\nHe wrote how the Syrian man had became sicker and sicker, before suffering a cardiac arrest. He said he had taken the man into his own house, but it was too late to help him.\nThe notice read: 'We mourn for you. You were 24 years old. You came from Syria. You survived so much. You did not survive LAGeSo.\n'You got fever, chills and then a cardiac arrest. You died last night. We cry for you.'\nLAGeSo is the German acronym for the State Office for Health and Social Affairs where refugees in the capital go to register.\nIn addition, a death notice for the unnamed migrant had also appeared in a local newspaper after being posted on Facebook by Dirk V, and then shared all over the world.\nThe man had developed influenza while waiting in he queue and became more sick before suffering a cardiac arrest\nIn recent days there have been chaotic scenes outside the building as struggling volunteers buckled under the pressure of the sheer numbers of asylum seekers\nAs a result, Berlin police devoted manpower to try to track down Dirk V. including posting a patrol outside his home and ringing repeatedly on his switched off mobile phone.\nBut as people queued to place candles at the place where the young man died, it has now been revealed by police that the entire story was made up.\nThe original Facebook poster was arrested and questioned, and refused to say anything but eventually last night confessed that the entire story had been made up from beginning to end.\nA police spokesman said: 'During the interview, we made it clear to the man that there was no dead asylum seeker.'\nBut despite the fact that the story went round the world, the man has apparently not committed any crime for posting the item on Facebook and then later deleting it.\nLAGeSo is the German acronym for the State Office for Health and Social Affairs, pictured, where refugees in the capital go to register\nGerman police and rescue workers tried at the time to diffuse the situation saying they could find no trace of the man, but could not stop the spread of the story.\nOne charity worker quoted in local media said: 'Who accepts responsibility here? Who has the guilt, the failing management or the political will - who else knows what's going on?'\nThe death was also spread by Moabit Helps (Moabit Hilft), the refugee aid organisation located in the district of the city where the LAGeSo office is located.\nDiana Henniges, a spokeswoman for the group, said the young man was rushed to hospital after collapsing at the site but died of cardiac arrest a short while afterwards.\nShe added: 'The condition of the man was very bad. He was completely destitute, had no insurance and was completely emaciated.\n'He suffered an influenza infection which proved lethal.\n'We have so many people who are sick and we are getting more and more behind with helping them.\n'So many are sick, that we can't help them all.'","url":"https://www.dailymail.co.uk/news/article-3421029/Volunteer-claimed-migrant-dropped-dead-outside-Berlin-registration-centre-waiting-outside-days-admits-LIED-bid-win-sympathy-asylum-seekers.html"}
