{"authors":[],"date_download":"2018-10-21 02:50:30","date_modify":"2018-10-21 02:50:30","date_publish":"2018-08-30 13:27:36","description":"Anchored by The Post’s Tanya Sichynsky, the newsletter will provide tips for stress-free weeknight cooking.","filename":"data/vaneerConsumption/VoraciouslytolaunchVoraciouslyMealPlanofActionnewsletter.json","image_url":"https://www.washingtonpost.com/resizer/D82xMHe7WUVi6avKETsAP_YgNdk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WRHL462NVI3WXMFAYNBLOTQPXY.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_08_30__1540090230.html","title":"Voraciously to launch “Voraciously: Meal Plan of Action” newsletter","title_page":"Voraciously to launch “Voraciously: Meal Plan of Action” newsletter - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Voraciously, a destination from Washington Post Food targeted toward novice cooks, will launch “Voraciously: Meal Plan of Action,” a newsletter focused on meal planning on Sept. 6, 2018. Anchored by The Post’s Tanya Sichynsky, the 12-week series will provide readers with the tools to create stress-free weeknight meals for two.\n“Most novice cooks, and especially young professionals, aren’t cooking for themselves every night of the week and we designed this newsletter with that in mind,” said Sichynsky. “We hope this teaches readers how to better plan for a handful of quick and accessible home-cooked meals and make the most of those leftovers.”\nThe newsletter will highlight one versatile ingredient or dish each week and provide three budget-friendly recipes using that ingredient or dish for weeknight meals and weekday lunches. It will also offer tips for transforming leftovers and making a variety of meals with similar base ingredients.\nThe newsletter will be delivered each Thursday afternoon. Readers can sign up here.","url":"https://www.washingtonpost.com/pr/wp/2018/08/30/voraciously-to-launch-voraciously-meal-plan-of-action-newsletter/"}
