{"authors":["Dan Willis For Mailonline"],"date_download":"2018-10-23 03:59:06","date_modify":"2018-10-23 03:59:06","date_publish":"2017-03-10 13:58:41","description":"Arsene Wenger has never looked as likely to leave Arsenal as he now does. But of the many contenders tipped to take over, who would you like to see replace the Frenchman?","filename":"data/vaneerConsumption/VoteWhoshouldreplaceArseneWengerasArsenalboss.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E19719A00000578-0-image-a-44_1489153565574.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301334_Poll-replace-Arsene-Wenger-Arsenal-boss_1540267146.html","title":"Vote: Who should replace Arsene Wenger as Arsenal boss?","title_page":"Vote: Who should replace Arsene Wenger as Arsenal boss? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Arsene Wenger has never looked as likely to leave as he now does.\nHe could surprise us all and agree another new deal with Arsenal late on, of course, but after publicly stating he could manage elsewhere next season and with the club saying they'll decide this summer whether he stays, the exit door is closer than ever.\nThe 67-year-old has been at Arsenal since 1996 and is very proud of his record of qualifying for the Champions League every season for 20 years.\nArsene Wenger now looks more like leaving Arsenal this summer than ever before\nBut there is also now the unwanted record of them exiting Europe's elite tournament in the last-16 for the past seven years, often suffering big defeats at the hands of Europe's heavyweights. This week's 10-2 aggregate loss to Bayern Munich a prime example.\nA minority of Arsenal fans have wanted to see Wenger replaced for some time, but it seems most others are coming round to the idea that it's time for a new man with new ideas.\nBut who? And would they be available? Bournemouth's Eddie Howe tops the list of a younger Englishman.\nSupport for Wenger to remain as Arsenal boss appears to be at an all-time low\nWhile, Jurgen Klopp, once talked of as a possible Arsenal target is part of the Liverpool furniture now. Across Stanley Park, Ronald Koeman has impressed at Everton.\nAway from the Premier League, Luis Enrique has revealed he is leaving Barcelona this summer, young Thomas Tuchel is developing a good reputation at Borussia Dortmund, while Massimiliano Allegri at Juventus comes with a strong pedigree.\nAtletico Madrid's fearsome boss Diego Simeone would be many people's favourite after transforming Spain into a three-horse race (and reaching two Champions League finals).\nThree strong contenders are Diego Simeone, Massimiliano Allegri and Thomas Tuchel\nWhile Jorge Sampaoli (Sevilla) and Leonardo Jardim (Monaco) are making waves in Spain and France respectively.\nOf the former Arsenal players, the likes of Patrick Vieira (New York City FC), Thierry Henry (Belgium) or Dennis Bergkamp (Ajax) could well be a popular move.\nHave your say now and let us know who you think should replace Wenger at Arsenal if this does end up being the summer he moves on.","url":"https://www.dailymail.co.uk/sport/football/article-4301334/Poll-replace-Arsene-Wenger-Arsenal-boss.html"}
