{"authors":["Associated Press"],"date_download":"2018-10-22 20:11:29","date_modify":"2018-10-22 20:11:29","date_publish":"2016-01-28 00:30:02","description":"Americans' comments on Hillary Clinton's marriage, her handling of her husband's infidelity in the 1990s and whether that's relevant in the 2016 presidential...","filename":"data/vaneerConsumption/VotercommentsonClintonhandlingherhusbandsinfidelity.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419855_Voter-comments-Clinton-handling-husbands-infidelity_1540239089.html","title":"Voter comments on Clinton, handling her husband's infidelity","title_page":"Voter comments on Clinton, handling her husband's infidelity | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Voter comments on Clinton, handling her husband's infidelity\nAmericans' comments on Hillary Clinton's marriage, her handling of her husband's infidelity in the 1990s and whether that's relevant in the 2016 presidential campaign.\n— \"It does have an impact, but should it? It's there for the world to see, and yeah, it's going to have an impact, definitely.\" Don Hartshorn, 82, independent, retired letter carrier in Concord, New Hampshire.\n—\"Enough water's gone under the bridge. You can't tell with those two, it's more of a business relationship. In any other kind of situation, you'd think, 'Dump him.' But with them it seems worth their while to stick it out.\" Thaddeus Stephanak, 44, independent, TV station production coordinator, Merrimack, New Hampshire.\n— \"If she was a man this would never be — this would just never even happen. We wouldn't be like, 'How did they handle an affair and how does that affect the presidency?'\" Sara Provenzale, 40, independent, freelance writer and Spanish teacher in Columbus, Ohio.\n— \"It has been talked about enough. What's it have to do with her?\" Robert Post, 62, independent, Canal Winchester, Ohio.\n—\"People stay with people and people leave people for different reasons. I think that she's an advocate for women. I truly do believe that, regardless of whether she stayed with a husband who cheated on her.\" Hana Barkowitz, 20, Democrat, sophomore at Kent State University in Ohio and president of College Democrats on campus.\n— \"Hillary is Hillary. You gotta separate her from Bill.\" Al Valaitis, 61, retired research scientist, mostly votes Democratic, Dublin, Ohio.\n— \"She hasn't done anything wrong. It's in the past. Everybody has a past.\" Cheyanne Tutt, 22, Democrat, theater student at Ohio State.\n— \"Was their marriage a sham or not? I think it plays to her character, being a part of who she is and personally I don't think that's a good personality to have.\" Richard Remmy, 36, Republican, works in IT, Aurora, Colorado.\n— \"She was obviously involved with it, but I don't really care,\" Scott Harper, 52, Republican, park ranger, Woodland Park, Colorado.\n—\"It's not her responsibility what the White House administration did when her husband was there.\" Janelle Henderson, 44, Democrat, data analysis, Broomfield, Colorado.\n—\"It must have been a terrible time in her life. No one can really judge her because no one was in her shoes at the time.\" Matt Kratochvil, 21, independent, junior at University of Wyoming.\n—\"I feel like it's relevant because a political figure's character is always part of the equation when it comes to elections and who we want to be running our country.\" Andrew Schrader, 31, Republican, hospital administration, Denver.\n—\"That's her business, not mine. She chose to stand by him and that wasn't easy.\" Patti Van Buskirk, 41, Democrat, nonprofit worker, St. Petersburg, Florida.\n—\"How did she handle it back then? I couldn't tell you. I was too young.\" Wesley Loughrie, 25, Republican, model, St. Petersburg, Florida.\n—\"Infidelity in politics, it's like grass in baseball. It goes together.\" Donn Scott, 41, independent, Brandon, Florida.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3419855/Voter-comments-Clinton-handling-husbands-infidelity.html"}
