{"authors":[],"date_download":"2018-10-30 00:58:30","date_modify":"2018-10-30 00:58:30","date_publish":"2018-07-09 16:23:11","description":null,"filename":"data/vaneerConsumption/VoteofNoConfidenceBrewsAgainstTheresaMay.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/800px-Tallinn_Digital_Summit._Arrivals_Theresa_May_37388975951-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861110.html","title":"Vote of No Confidence Brews Against Theresa May","title_page":"Vote of No Confidence Brews Against Theresa MayThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"There is a growing and likely chance that British Prime Minister Theresa May will face a vote of no confidence from members of her own party tonight.\nSuch developments come in the days following the resignations of two cabinet secretaries Boris Johnson (Fmr. Foreign Affairs Secretary) and David Davis (Fmr. Brexit Secretary), and in the weeks and months following what many Conservatives describe as a broken Brexit deal.\nMay, who ascended to the Prime Ministership following the Brexit referendum in 2016, has for two years now worked to negotiate a Brexit deal with the European Union. How Britain would leave the EU was a centerpiece not only to controversy within parliament but within the Conservative party as well.\nEuroskeptic members of her party claim that the deal that she has cultivated is too soft and gives too many concessions to the EU and fails to maintain the integrity of what was agreed by conservatives to be a “hard” Brexit.\nConservative ministers met this past weekend at Chequers to create a cohesive plan on moving forward with Brexit after two years of internal negotiations on what Britain would present Brussels with in the coming talks with the EU. What came out of it was a relatively “soft” Brexit deal; Britain would maintain many economic ties within the EU as well as keeping open borders with Ireland. Details of the Chequers proposal can be found here.\nFast forward less than 48 hours later, Brexiteers across the party have lashed back at the plan, two members of her Cabinet representing the “hard” Brexit faction have resigned, and many are calling for her removal.\nRhetoric of removal is not uncommon, but in the mounting pressure against the Prime Minister, here’s how the Conservative party could likely remove May from Prime Minister in the next 24 hours.\nFirst, in order for a vote of no confidence to be called within the party, 15% of the Conservative Members of Parliament (MP) must write a letter to the chairman of the 1922 Committee expressing their lack of confidence for their party leader.\nThe 1922 Committee is a committee made up of the party establishment and elders that oversee party stability and coherence. Sources from within the party say that the letter threshold is dangerously close to being crossed, if it has not been already.\nSecond, a vote of no confidence is triggered by the Chairman of the 1922 committee once he receives 48 letters calling for the vote (15% of the Conservative Members of Parliament). The vote takes place only among the Conservative MPs.\nThird, if 50%+1 vote “not confident” towards May, she would either resign once or before the new Conservative leader was voted in. Any less than the 50%+1 threshold, May would remain seated as PM.\nSpeculation remains as to who would run in a Conservative leadership election in the event of May’s removal. Rumored candidates include Boris Johnson, Jacob Rees-Mogg, and Michael Grove.","url":"https://spectator.org/vote-of-no-confidence-brews-against-theresa-may/"}
