{"authors":[],"date_download":"2018-10-30 14:11:00","date_modify":"2018-10-30 14:11:00","date_publish":"2018-09-10 16:08:00","description":"Georgians who want to participate in the Nov. 6 general election must be registered to vote by Oct. 9.","filename":"data/vaneerConsumption/VoterregistrationdeadlineisOct9.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/Politics-MyAJC/2018/09/10/Images/newsEngin.22955835_072518-ELX-local-races-10.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_06ac89e6423773b6199a6b075fcfe45f__1540908660.html","title":"Voter registration deadline is Oct. 9","title_page":"Georgia Election 2018: Voter registration deadline is Oct. 9","title_rss":"NULL","source_domain":"ajc.com","text":"There’s still time left to register to vote in November’s election for Georgia governor, Congress and more.\nThe deadline to register to vote is Oct. 9 for Georgians who want to participate in the Nov. 6 general election.\nNearly 84,000 new voters have already registered since the May 22 primary election, bringing the total number of registered Georgia voters to more than 6.8 million, according to the Secretary of State’s Office.\nThey’re eligible to vote in the race for governor between Democrat Stacey Abrams and Republican Brian Kemp. Other races on the ballot are for the U.S. House of Representatives, lieutenant governor, secretary of state, attorney general and seats in the Georgia General Assembly.\nLess than half of registered voters cast ballots in the last three midterm elections.\nTurnout in midterms since 2006 ranged between 42 percent and 45 percent. Turnout in presidential election years is higher, with more than 62 percent of voters participating in recent years.\nTo be eligible to register to vote in Georgia, you must be a citizen, legal resident and more than 17 and a half years old. In addition, you can’t be serving a sentence for conviction of a felony involving moral turpitude or found mentally incompetent by a judge.\nHow to register to vote in Georgia","url":"https://www.ajc.com/news/state--regional-govt--politics/voter-registration-deadline-approaches-for-georgia-election/y4cqU72X1za1PzlM0mSSdO/"}
