{"authors":["Robert Kraychik"],"date_download":"2018-10-30 18:07:38","date_modify":"2018-10-30 18:07:38","date_publish":"2018-08-08 20:22:12","description":"Potential House Speaker Nancy Pelosi described voting for Democrats as giving \"leverage\" to illegal immigrants on Wednesday.","filename":"data/vaneerConsumption/VotingforDemocratsGivesLeveragetoIllegalImmigrants.json","image_url":"https://media.breitbart.com/media/2018/07/Nancy-Pelosi-gavel-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_08__1540922858.html","title":"Voting for Democrats Gives 'Leverage' to Illegal Immigrants","title_page":"Nancy Pelosi: Voting for Democrats Gives 'Leverage' to Illegal Immigrants","title_rss":"NULL","source_domain":"breitbart.com","text":"House Minority Leader Nancy Pelosi (D-CA) described voting for Democrats as giving “leverage” to illegal aliens during a Wednesday press conference in El Paso, TX.\nPelosi is set to become Speaker of the House if Democrats win next year, after losing the position when Republicans won the House in 2010.\nIn her remarks, Pelosi opted against distinguishing between lawful and unlawful immigrants describing amnesty for illegal aliens as “inevitable for America.”\nPartial transcript below:\nPELOSI: I don’t want to be political here. I would say that to the extent that people hear the stories, it’s interesting because there was a recent survey that said if you ask people about their attitudes toward immigration and newcomers to the country, they might have one view. They haven’t thought about it a whole lot except they’re hearing the president, and this and that. But if they know one family, if they know one immigrant family, if they go to school with any immigrant children, or if their children go to school with any immigrant children, if they go to church with immigrants, they have a completely positive view. It changes everything. That’s why I keep talking about public sentiment. And so because this is the right thing to do, I have confidence that we will get where we need to go. But everything is about time, and we want to shorten the distance as your question indicated between what we think is inevitable for America. They think it is inconceivable, but we believe that we can get this done. We are not going to be able to get it done under the Republican leadership in Congress. We believe that we will have leverage when we win in November. And why is that important? Because it gives leverage to every family, to every mom who courageously brought her child across the desert to escape — to escape death, rape, gang violence, and the rest. Because it gives hope, because of the leverage it gives to families who may have followed dad home for a family funeral and now can’t come back into the country. As all of those injustices have to be corrected, there’s a path and that path is greatly brightened by the knowledge that is in this community who sees firsthand simple solutions which make a big difference in people’s lives. And so we’re getting ready for this and it is only to come back to a place that honors our values, recognizes the importance of immigration to the success of America.\nPelosi has advocated for illegal aliens — but has also been the target of their frustration, when amnesty activists believe she is not acting quickly enough. A group of illegal aliens crashed in September of 2017, demanding amnesty for all illegal immigrants — not just the so-called “Dreamers” — while chanting, “Brown power!” and “Trans lives matter!”\n“Shut down ICE!” Dreamers confront Nancy Pelosi about immigration, negotiations with Trump over DACA. WATCH LIVE: https://t.co/faywo3TzJV pic.twitter.com/jdcYfmJDRe — NBC Bay Area (@nbcbayarea) September 18, 2017\nA clearly shaken Nancy Pelosi mutters “they don’t want the DREAM Act” about pro DACA protesters who interrupt press conference. pic.twitter.com/88kPHlaStg — Scott McGrew (@ScottMcGrew) September 18, 2017\nIn February, Pelosi delivered a speech that lasted more than eight hours on the U.S. House floor, demanding a vote for amnesty for illegal aliens brought to the country as minors, who have been helped by the Obama administration’s Deferred Action for Childhood Arrivals (DACA) program since 2012. (The program was canceled by the Trump administration last year, but remains active thanks to the courts.)\nIn her address, Pelosi described illegal aliens as “more American than Americans.”\n“Illegal immigrants are a blessing, they are doing what the Founding Fathers would wish, they are the best of the best, more American than Americans, reinvigorating, they are fabulous, beautiful, and patriotic, yes, very patriotic,” she said.\nFollow Robert Kraychik on Twitter.","url":"https://www.breitbart.com/politics/2018/08/08/nancy-pelosi-leverage-illegal-aliens/"}
