{"authors":[],"date_download":"2018-10-30 00:50:46","date_modify":"2018-10-30 00:50:46","date_publish":"2014-05-21 15:54:06","description":"Learn the media bias rating of Vox.com. AllSides rates the media bias of hundreds of media outlets, writers, and sources.","filename":"data/vaneerConsumption/Vox.json","image_url":"https://www.allsides.com/sites/default/files/logo-all-sides-20px_1.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/allsides.com/news-source_vox-news-media-bias_1540860646.html","title":"Vox","title_page":"Vox Media Bias | AllSides","title_rss":"NULL","source_domain":"allsides.com","text":"Vox has a Left media bias. In Sept. 2018, the AllSides team conducted an extensive editorial review and decided to shift Vox from a Lean Left to a Left media bias rating.\nThe AllSides team found that Vox consistently writes favorably about Left-leaning policies and never includes a Right-leaning perspective. Articles on Vox.com have tied President Trump to fascism, and its \"Explainers\" section rarely includes Right-leaning opinions or viewpoints. Vox's Explainers only provide one side of an issue, making it seem as if that's all readers need to know, when in reality, Right-leaning individuals might include other facts or make different points about the topic. This prevents readers from getting a holistic understanding of the issues highlighted.\nAllSides noted that Vox often frames news and issues as if the Left perspective is the only perspective, and its hard news articles include commentary that is subjective in nature. One AllSides team member noted Vox \"seems like advocacy outlet for the Democratic Party, showing all the \"news\" you'd like to hear as a Democrat.\"\nPrevious Vox Media Bias Rating\nPrior to Sept. 2018, AllSides rated Vox as Lean Left. A large majority (about 3,700 community members) disagreed with AllSides' media bias rating of Lean Left for Vox. As of April 2017, the number of those who disagreed with Vox's Lean Left media bias rating had grown to 4,362. However, among those who disagreed and rated the source on their own, their answers averaged to a Lean Left rating.\nMore About Vox.com\nVox.com was founded in 2014 by Ezra Klein, a liberal columnist from the left-leaning Washington Post, along with Melissa Bell and Matt Yglesias. Run by the digital media company, Vox Media, Vox.com currently has eight editorial brands including the sports website, SB Nation, and the technology news website, The Verge.\nIn it's founding, Klein hoped to “improve the technology of news” and build an online platform better equipped for making news understandable. Vox.com, therefore, aims to “explain the news” rather than simply report it - a practice some conservatives feel inherently leaves out opposing viewpoints and differing perspectives. For example, the Washington Times and conservative media watchdog groups have heavily criticized Vox.com’s perceived liberal bias. Additionally, the Week and The Federalist accused the website of a progressive worldview. The website's anti-Trump reporting through the 2016 election as well as post-innauguration has also garnered criticism.\nSources:\nVox.com\nWikipedia: Vox.com\nAbout Vox Media","url":"https://www.allsides.com/news-source/vox-news-media-bias"}
