{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 21:44:38","date_modify":"2018-10-30 21:44:38","date_publish":"2016-11-08 06:06:48","description":"Supporters of the Clinton Foundation have argued that there is no evidence of improprieties perpetrated by the Clintons.","filename":"data/vaneerConsumption/VoxsJeffSteinIWasWrongClintonFoundationUsedforPersonalFamilyEnrichment.json","image_url":"https://media.breitbart.com/media/2016/11/clinton-foundation-family-hillary-chelsea-bill-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2016_11_07__1540935878.html","title":"Vox's Jeff Stein: 'I Was Wrong,' Clinton Foundation 'Used for Personal Family Enrichment'","title_page":"Vox's Jeff Stein: 'I Was Wrong,' Clinton Foundation 'Used for Personal Family Enrichment' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"One of the main contentions supporters of the Clinton Foundation use to excuse the many improprieties the Clintons have perpetrated with their “charity” is that there is no evidence they used the organization for personal enrichment. But now, even Vox.com’s Jeff Stein has had to admit he was wrong about this.\nOn October 24, the Vox writer posted a long article insisting that all of the criticism of the Bill and Hillary Clinton Foundation misses the mark.\nWhile Stein did find many of the reports from Clintonland to be troubling, he essentially concluded there isn’t any proof that Hillary perpetrated any quid pro quo when she was Obama’s Secretary of State, and it wasn’t clear that the Clintons became multi-millionaires due to their charity.\nBut now, after finding a particular internal email detailing how Chelsea Clinton was paid to campaign for her mother, used foundation resources to fund her big-dollar wedding, and was hiding behind the foundation to avoid taxes, Stein has been forced to admit he was wrong.\nI have written there's 0 evidence the Clinton Fndn was used for personal family enrichment. Looks like I was wrong. https://t.co/uMn3epgLIT pic.twitter.com/NsYxvBAKDI — Jeff Stein (@JStein_Vox) November 6, 2016\nThe message Stein cites came from a recent release by the hacker site WikiLeaks. The information came in an email from Clinton operative Doug Band, sent in January 2012, to Clinton chief John Podesta. In the email, Band asked Podesta to do something about Chelsea’s potentially illegal actions.\n“The investigation into her getting paid for campaigning, using foundation resources for her wedding and life for a decade, taxes on money from her parents…” Band wrote.\nHe concluded writing, “I hope that you will speak to her and end this… Once we go down this road…”\nThe release of this email by Clinton operative Doug Band seemed to be enough for Voxsplainer Stein to admit that maybe the Clintons aren’t just being unfairly attacked. Perhaps they are as crooked as their critics say.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/the-media/2016/11/07/vox-jeff-stein-clinton-foundation-used-personal-enrichment/"}
