{"authors":[],"date_download":"2018-10-22 21:04:15","date_modify":"2018-10-22 21:04:15","date_publish":"2014-06-04 00:18:59","description":"40-year-old Dominic Diorio of Old Bethpage, is charged with third-degree hate crime and aggravated harassment, according to the NYPD.","filename":"data/vaneerConsumption/VStivianosAllegedAttackerChargedWithHateCrime.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/485691/140603-stiviano-1940_0d5fbfac41b7e215b11e598c8f8235fd.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_v-stivianos-alleged-attacker-charged-hate-crime-n121886_1540242255.html","title":"V. Stiviano's Alleged Attacker Charged With Hate Crime","title_page":"V. Stiviano's Alleged Attacker Charged With Hate Crime","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBy NBCNewYork.com\nPolice say they've arrested a man after V. Stiviano, the companion of embattled L.A. Clippers owner Donald Sterling, was allegedly attacked by two men outside a Manhattan hotel Sunday.\nThe suspect, 40-year-old Dominic Diorio of Old Bethpage, is charged with third-degree hate crime and aggravated harassment, according to the NYPD. He's scheduled to be arraigned later Tuesday or early Wednesday.\nIt wasn't immediately clear if he had an attorney. Police haven't indicated whether they've identified another suspect in the attack.\nStiviano's lawyer Mac Nehorary told NBC News Monday that she was leaving a restaurant near the Gansevoort Hotel in the Meatpacking District when two men approached her and “punched her on the right side of her face several times.\"\nCelebrity website RadarOnline.com originally reported the story. According to the website, Stiviano, who has described herself as black and Mexican, was attacked by two white men who hit her and yelled racial slurs at her.\nLast month, Stiviano was also the target of an apparent burglary attempt.\nStiviano gained notoriety after a recorded conversation between her and Sterling was posted online by TMZ Sports in which Sterling can be heard criticizing Stiviano about bringing black friends to Clippers games. He was also heard chastising her for posting a photo on Instagram with Magic Johnson.\nOn Friday, Sterling filed a lawsuit seeking $1 billion in damages from the NBA after being forced to relinquish control of team.\nNBA Commissioner Adam Silver has fined Sterling $2.5 million and sought to ban him for life from the league.\nOn Sunday, Sterling attended a predominantly black church service on an invitation from a pastor who said he should be forgiven.","url":"https://www.nbcnews.com/news/us-news/v-stivianos-alleged-attacker-charged-hate-crime-n121886"}
