{"authors":[],"date_download":"2018-10-30 14:17:05","date_modify":"2018-10-30 14:17:05","date_publish":"2017-01-27 00:00:00","description":null,"filename":"data/vaneerConsumption/Vulgarityonparade.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_01_vulgarity_on_parade_1540909025.html","title":"Vulgarity on parade","title_page":"Vulgarity on parade","title_rss":"NULL","source_domain":"americanthinker.com","text":"Vulgarity on parade\nHundreds of fine columns have been written about the gross vulgarity of the so-called \"women's march\" the day after the inauguration. Hundreds of thousands of women around the country, around the world, showed up in major cites with their silly hats meant to represent vaginas, apparently to call attention to the Access Hollywood tape of Trump many years ago trash-talking about the advantages rich men have with women. To these marching women, those few ill considered words uttered over a few minutes define the man. But the words and signs that defined the march were shocking. The level of crudeness, profanity, disgusting signs, many of which screamed a relentless hatred of men, was shocking! Some of those signs were carried by young children. What were their parents thinking?\nThis was such a depressing display of anger and ignorance, it numbs the skull. When queried about their reason for being there, most had only vague nonsensical reasons: \"equality for all women,\" as if women do not already enjoy equality in America. It would never occur to these women to be activists for the truly oppressed women in the Islamic world. Oh, yes, and abortion. They seem to think Trump will ban it beginning tomorrow. Most distressing was the sheer vulgarity of the marches. Madonna, Ashley Judd, etc. were unrestrained in their coarse, demeaning profanity. The hundreds of handmade posters were despicable and later left on the streets as litter for others to clean up. Who are these women who were so proud to drag their daughters and granddaughters to such a salacious event? Do they actually think this benefits women? The obscene nature of the content that made the news should be off-putting to all women. What did not make the news was worse. But those not-ladies are proud of themselves. Cross them, and be prepared for more crudeness. They were aggressive; some were violent if faced with someone who questioned their cause: mindless anti-Trumpism. Their behavior is a mystery to the women who knew enough to vote for Trump, even if he was not their favored candidate. Now that young men have been so thoroughly emasculated, women have somehow become increasingly scatological – have become so disdainful of men, it is a miracle young men and women ever develop normal male-female relationships. Both boys and girls, young men and women, have for so many years been taught that men should not be men that it is a wonder that boys and men know how to be anywhere, with anyone. Ithaca College is spending a week or two studying how to rid their campus of \"toxic masculinity.\" There were signs for \"Girl Power\" and \"Boys will be (not boys) Human.\" No wonder young women cannot find suitable men to marry. Masculinity is being bred out of a culture that is completely intolerant of men. And of the dwindling number of real men who remain unsullied by political correctness and academia, if they live in a bastion of the left, they have to conceal their masculinity as surely as a conservative college student must keep his politics utterly private. Was there one woman at any of those marches a real man would find attractive? Doubtful. Real men would not want to come within a mile of any of them. There is nothing feminine about those women; they are more masculine than the men they so revile. Our genderless world is not genderless; it has just been turned upside-down.","url":"https://www.americanthinker.com/blog/2017/01/vulgarity_on_parade.html"}
