{"authors":["Press Association"],"date_download":"2018-10-22 22:25:37","date_modify":"2018-10-22 22:25:37","date_publish":"2016-01-28 10:23:20","description":"Elderly people in need of urgent care are \"poorly served\" by the NHS in England, according to a new report. Over-65s were often sent to accident and emergenc...","filename":"data/vaneerConsumption/Vulnerableelderlypoorlyservedbynhs.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-7f1bec1b-e5aa-4010-a89c-f7abaf670a67-2vdWmEltwXfba0ce28e63272c4c8-482_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420481_Vulnerable-elderly-poorly-served-NHS_1540247137.html","title":"Vulnerable elderly 'poorly served' by nhs","title_page":"Vulnerable elderly 'poorly served' by nhs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Vulnerable elderly 'poorly served' by NHS\nElderly people in need of urgent care are \"poorly served\" by the NHS in England, according to a new report.\nOver-65s were often sent to accident and emergency (A&E) departments \"inappropriately\" because of a lack of out-of-hospital services, the NHS Confederation said.\nThe independent Commission on Improving Urgent Care for Older People report said A&E could be a \"bewildering experience\" for some elderly patients and delays in being treated or discharged could \"adversely\" affect them.\nMany elderly people are sent to A&E departments because of a lack of out-of-hospital care services, the NHS Confederation says\nIt said older people accounted for 54% of hospital bed days and 40% of day cases in England, while there were nearly 3.7 million A&E attendances by over-65s in 2013-14.\nThe average length of a hospital stay following emergency admission was 11 days for patients over 85 - twice as long as the average for all ages.\nCommission chairman Dr Mark Newbold said the growth in the elderly population and increase in life-expectancy was not reflected in the current system.\nHe said: \"The 'winter crisis' is a regular occurrence, despite an universal understanding that the solutions lie in the creation of more effective and accessible home and community care that focuses strongly on the maintenance of health and wellbeing.\n\"Without this shift in emphasis, it is difficult to see the situation improving. Older people, who often have one or more chronic health conditions, are particularly poorly served by the present system, which was after all designed when the demographic was very different.\"\nThe report recommended urgent care be more personalised, proactive and co-ordinated.\nThe commission recommended a care co-ordination function be developed to give people a single point of contact, citing an Age UK project in Cornwall in which staff or volunteers helped design care plans and organise social activities and home help for high-risk patients.\nDr Newbold added there should be a greater focus on tailored care.\n\"We have talked too much in the past about integrating the providers of services and not enough about integrating care around people. It is the co-ordination of personal care for individuals that really matters,\" he said.","url":"https://www.dailymail.co.uk/wires/pa/article-3420481/Vulnerable-elderly-poorly-served-NHS.html"}
