{"authors":["Matthew Debord"],"date_download":"2018-10-30 21:04:43","date_modify":"2018-10-30 21:04:43","date_publish":"2016-12-22 00:00:00","description":"Volkswagen, still reeling from its Dieselgate emission-cheating scandal, will expand it lineup of all-electric concept cars.","filename":"data/vaneerConsumption/VWIDDetroitelectricreveal.json","image_url":"https://amp.businessinsider.com/images/585bca00ee14b62b008b4b9f-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_vw-id-detroit-electric-reveal-2016-12_1540933483.html","title":"VW ID Detroit electric reveal","title_page":"    VW ID Detroit electric reveal - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"VW Volkswagen, still reeling from its Dieselgate emission-cheating scandal, will expand it lineup of all-electric concept cars.\nAfter revealing a concept in its new I.D. range at the Paris Motor Show, VW on Thursday teased a new model. The electric vehicle will, according to VW, be able to join the self-driving party if and when it comes to market.\n\"This I.D. concept vehicle will also be able to drive fully autonomously in the future,\" the automaker said in a statement.\n\"Press lightly on the Volkswagen logo, and the electrically retractable steering wheel disappears into the dashboard. While the driver relaxes, laser scanners, ultrasonic and radar sensors and cameras monitor other road users and the surroundings.\"\nVW VW isn't holding back on the hyperbole for the unveiling of the new concept at on one of the auto industry's biggest stages.\n\"The I.D. concept vehicle in Detroit forges links between the legendary origins of the Volkswagen brand and its electrifying future,\" the company said. \"Its overall concept is revolutionary. It combines ample space for travel with a long electric driving range, to usher a new feeling of freedom - with zero emissions - and a new era of mobility.\"\nThe images that VW provided don't show the full vehicle, but they do look cryptically futuristic.\nVW\nAutomakers are currently walking a tricky line, as the dominant narrative in the industry shifts from electric cars, which had defined the conceptual efforts of the past decade, to autonomous mobility and ride-sharing services.\nVW's task is additionally challenging. One of the world's largest automakers had pushed a \"clean diesel\" strategy hard, only to have it collapse when it was caught installing \"defeat devices\" on some vehicles. The scandal left VW struggling to find a new way to define itself, and the carmaker has responded by getting aggressive about EVs and self-driving.\nThe Detroit auto show runs from January 8 to 22, 2017.","url":"https://www.businessinsider.com/vw-id-detroit-electric-reveal-2016-12"}
