{"authors":["Joey Millar For Mailonline"],"date_download":"2018-10-23 02:32:11","date_modify":"2018-10-23 02:32:11","date_publish":"2016-01-29 17:03:56","description":"Wade Cox, 25, was arrested in December after a quantity of drugs was discovered by police stuffed between his buttocks. He idolises one-eyed killer Dale Cregan, who faces life in jail.","filename":"data/vaneerConsumption/WadeCoxwithtattootributetopolicekillerDaleCreganjailedfordrugdealing.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B412F300000578-0-image-a-71_1454083552011.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422991_Father-tattoo-tribute-police-killer-Dale-Cregan-jailed-drug-dealing_1540261931.html","title":"Wade Cox with tattoo tribute to police killer Dale Cregan jailed for drug dealing","title_page":"Wade Cox with tattoo tribute to police killer Dale Cregan jailed for drug dealing  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A shameless father of two who sparked fury by getting a grenade tattoo in a sick tribute to police killer Dale Cregan has been jailed for three years for drug dealing.\nWade Cox, 25, was arrested in December after a quantity of drugs was discovered by police stuffed between his buttocks during a raid on his home in Oldham, Greater Manchester.\nThe fitness addict idolises one-eyed killer Cregan, who brutally killed two policewomen and a father and son with grenades and firearms in 2012.\nCox's mugshot, taken in December after he was arrested for possessing cocaine and heroin with intent to supply and possessing cannabis\nCox's tattoo features a grenade and ID tags featuring the initials of Cregan and his accomplice\nCox, who has a four-year-old boy and a three-year-old girl, was arrested after police stormed his home early in the morning on December 8.\nOfficers, who had to use force to access Cox's bedroom because he was leaning against the door, found diamorphine and cocaine was between his buttocks following a strip-search. They also discovered 1.6g of cocaine, 1.33g of heroin, £1,825 in cash and a small amount of cannabis.\nHe was sentenced after admitting the possession of heroin and cocaine with intent to supply and the possession of cannabis at Minshull Street Crown Court, Manchester.\nPOLICE KILLER DALE CREGAN One-eyed Dale Cregan faces life behind bars for his gun and grenade rampage in 2012 Dale Cregan, from Greater Manchester, is currently serving a life sentence for brutally killing four people, including two policewomen, in 2012 with guns and grenades. Cregan went on the run after murdering Mark Short, 23, in May and his father David, 46, in August. The killer then used a fake 999 call to lure officers Fiona Bone and Nicola Hughes to a house in September, where he killed them by firing 31 bullets and throwing a hand grenade. The gangster admitted the attempted murder of three others in a high profile court case the following year. He was told he would never see release after admitting to the killings, which prompted public outcry and an outpouring of sympathy for the police. His accomplice, Anthony Wilkinson, was jailed for a minimum of 35 years for his part in the gun and grenade murder of David Short.\nCox had previously sparked outrage by showing off his tattoo tribute to Cregan on social media.\nThe sick artwork features features a grenade, the slogan 'Friends have the same enemies' and two ID tags. One of the tags shows the initials DC and AW, a reference to Cregan and his accomplice Anthony Wilkinson, while the other says: 'I love the boys.'\nHe boasted about the tattoos on Facebook in a message which read 'Got the grenade out for the boys'. He also has a picture of Cregan on his Facebook photo gallery.\nWade Cox (posing with his sick grenade tattoo) idiolises police killer Dale Cregan, who faces life behind bars\nCox's lawyer told the court Cox was a loving father with plans to become a personal trainer\nThe court heard Cox had a number of convictions for petty crimes and was also under a suspended sentence order for a dangerous driving offence at the time of his arrest.\nFollowing his sentence, Judge Bernard Lever told Cox: 'I have got no time for drug dealers at all. If you are selling drugs to people on the street and are part of that chain then you know the harm drugs can do to other people's lives, turning them upside down.'\nHowever, he did state that he was keeping the jail sentence 'as short as I can' because of his young children.","url":"https://www.dailymail.co.uk/news/article-3422991/Father-tattoo-tribute-police-killer-Dale-Cregan-jailed-drug-dealing.html"}
