{"authors":[],"date_download":"2018-10-30 18:37:31","date_modify":"2018-10-30 18:37:31","date_publish":"2017-04-27 21:17:00","description":"Tom Forkner, Waffle House co-founder, has died, a month after his partner Joe Rogers Sr. They founded the Gwinnett-based company in DeKalb in 1955.","filename":"data/vaneerConsumption/WaffleHousecofounderdiesat98amonthafterbusinesspartner.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/09/04/Images/photos.medleyphoto.8106745.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_waffle-house-fou_4409c8d9bdc0b56047c0a144a61daaf7__1540924651.html","title":"Waffle House co-founder dies at 98, a month after business partner","title_page":"Waffle House co-founder dies at 98, a month after business partner","title_rss":"NULL","source_domain":"ajc.com","text":"In early March, Waffle House co-founder Joe Rogers Sr. died at age 97, leaving his 98-year-old business partner Tom Forkner behind. In late March, Forkner’s wife of 71 years, Martha, died.\nNow Forkner is gone, the restaurant chain confirmed Thursday. The World War II veteran, great-grandfather and DeKalb County native died at his home in Johns Creek on Wednesday.\n“Tom will be remembered as a man of honesty and integrity,” Waffle House Chairman Joe Rogers Jr. said in a news release. “He and my father never envisioned the company would grow into what it is today, nor how thousands of associates would be positively impacted by the opening of that first restaurant.”\nThe partners, who were neighbors, founded Waffle House in 1955 in Avondale Estates. They had met when Rogers bought a house from Forkner, who was in the real estate business.\nForkner attended John Marshall Law School before he was drafted into the U.S. Army in 1941. He was an intelligence and security officer for the famed Manhattan Project, which produced the first nuclear weapons, in Oak Ridge, Tennessee, Waffle House said.\nHe met his wife there and married her after 90 days of courting in 1945.\nTen years later, on Labor Day, the first Waffle House opened on College Avenue in Avondale Estates. The pair had figured the city needed a 24-hour restaurant.\n“Tom and my father had a handshake deal, and their partnership and friendship continued for more than 60 years,” Joe Rogers Jr. said. “Tom and Joe were great partners.”\nForker stuck with the business side of the company as it grew into a Southern icon, leaving Rogers to customer relations.\n“Joe told me to open a restaurant and he’d show me how to run it,” Forkner once said.\nThe two largely phased themselves out of the day-to-day by the 1970s. That was after they’d opened 400 restaurants.\nThey still spent time at the corporate headquarters in Norcross even in their mid-80s.\nForkner also took up golf. As a senior citizen, he won state and international championships. He was inducted into the Georgia Golf Hall of Fame in 2007.\nWaffle House now has more than 1,900 restaurants across the country.\nA memorial is set for Sunday at 3 p.m. at Norcross First United Methodist Church, 2500 Beaver Ruin Road. In lieu of flowers, Waffle House said contributions may be made to the Giving Kitchen, which helps Atlanta area restaurant workers; the Georgia Junior Golf Association, which helps youth golfers; or the National Multiple Sclerosis Society.","url":"https://www.ajc.com/news/local/waffle-house-founder-dies-month-after-business-partner/ST26EuQ9oaEqgg8o5u6wEO/"}
