{"authors":[],"date_download":"2018-10-22 22:28:46","date_modify":"2018-10-22 22:28:46","date_publish":"2014-06-10 01:36:21","description":"Joe Rogers Jr. filed a lawsuit alleging a conspiracy in which a former housekeeper enlisted the help of local lawyers who conspired against him.","filename":"data/vaneerConsumption/WaffleHouseChairmanClaimsSexTapeShakedown.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_27/498261/140609-waffle-house-jms-2127_345c06aacb40ac44391210fc210fdcd6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_waffle-house-chairman-claims-sex-tape-shakedown-n126966_1540247326.html","title":"Waffle House Chairman Claims Sex Tape Shakedown","title_page":"Waffle House Chairman Claims Sex Tape Shakedown ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIn the telling of Joe Rogers Jr., he’s the victim of extortion, illegally-recorded sex tapes and unscrupulous lawyers.\nOn May 30, Rogers, whose father co-founded the Georgia-based diner chain Waffle House, where Rogers is chairman of the board, filed a lawsuit in Cobb County Superior Court alleging a far-reaching conspiracy in which a former housekeeper, Mye Brindle, enlisted the help of local lawyers who “designed a scheme and conspired to extort money from Rogers,” the complaint says.\nThree lawyers and their firms are identified in the lawsuit, which levels several charges, including invasion of privacy, conspiracy, intentional infliction of emotional distress and negligence. No dollar amount is specified.\nThe attorneys, the lawsuit says, “convinced Brindle to make a video of her sexual encounter with Rogers without his knowledge or consent.”\nThen, David Cohen, a lawyer in Marietta, Ga., sent an “extortion letter” to Rogers, the lawsuit alleges.\nThe letter, which is included in the lawsuit, accuses Rogers of “unwelcome sexual demands and other sexual harassment and abuse toward Ms. Brindle as a condition of employment.” “Numerous” recordings had been made, the letter says, and additional evidence — such as DNA — had also been preserved.\n“It is also clear that Ms. Brindle is not alone in having been subjected to your unlawful predatory sexual conduct,” the letter says, adding that because of their sensitive nature, sexual abuse claims are best “resolved early and outside of public litigation.”\nIn a subsequent meeting, Brindle’s lawyers played a video recording that the lawsuit says did not depict “non-consensual sexual activity.” Later, the lawsuit says, a “false” police report was filed and the lawyers demanded $12 million.\n“Litigation ensued,” the complaint says.\nBrindle could not be reached for this story. Cohen declined to comment.\nA spokesperson for Waffle House referred questions to Rogers' attorney, who did not respond to an interview request.\n—Tim Stelloh","url":"https://www.nbcnews.com/news/us-news/waffle-house-chairman-claims-sex-tape-shakedown-n126966"}
