{"authors":[],"date_download":"2018-10-30 18:32:13","date_modify":"2018-10-30 18:32:13","date_publish":"2017-03-06 22:05:00","description":"Joe Rogers Sr., who co-founded the iconic all-night Waffle House diner in Avondale Estates in 1955, has died. He was 97.","filename":"data/vaneerConsumption/WaffleHousecofounderJoeRogersSrdeadat97.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/06/Images/Joe%20Rogers.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_waffle-house-founder-joe-rogers-dead__1540924333.html","title":"Waffle House co-founder Joe Rogers Sr. dead at 97","title_page":"Waffle House co-founder Joe Rogers Sr. dead at 97","title_rss":"NULL","source_domain":"ajc.com","text":"One day in winter 1937, Joe Rogers and a fellow teenage National Guardsman sneaked away from their windy post on a Mississippi River levee to have a meal in the home of an elderly couple.\nThis wasn’t a fancy dinner. The house was more of a shack. The boys ate turnip greens, fatback and cornbread, and drank coffee from tin cups. But they were tired and hungry — weary young men in need of a break and a hearty bite.\n“I can't recall a better meal,\" Rogers would later say.\nOn Friday, Rogers died, leaving a legacy as a man who lived to feed the tired and hungry, to give the weary a break and a meal as the co-founder of iconic all-night diner chain Waffle House.\nThe Tennessee native, who opened the first of his restaurants in Avondale Estates with partner Tom Forkner in 1955, was 97.\nRead and sign the online guestbook for Joe Rogers Sr.\nHe’s survived by Ruth, his wife of 74 years, as well as four children and many grandchildren. He’s also survived by some 40,000 employees and countless loyal patrons who frequent the Southern staple, a haven for ramblers, travelers, partiers and families.\n“My father genuinely loved every customer who walked into a Waffle House, and customers immediately understood that,” Joe Rogers Jr., chairman of Waffle House, Inc., said in a news release. “The customer always came first for him, and he made sure the customer came first for everyone who worked with him.”\nThe elder Rogers founded Waffle House in 1955 with neighbor Forkner while working for the Toddle House chain. The pair had met when Rogers bought a house from Forkner, who was in the real estate business.\nThey decided Avondale Estates needed a 24-hour restaurant. It launched on Labor Day 1955.\nBy 1961, the duo had four Waffle House locations, and Rogers joined the growing business full-time.\nAlong the way, Rogers maintained a reputation as a champion of customer service. Forkner, who is now 99 years old, was the businessman, Rogers the man behind the counter or strolling between tables chatting with customers.\n“We’re not in the restaurant business,” Rogers said all the time. “We’re in the people business.”\nThe customers were his people.\nSo were the employees.\n\"Most of our waitresses have hard lives,\" he said in a 2004 interview with The Atlanta Journal-Constitution. \"A lot of them have a bunch of kids at home, and maybe their husbands don't have good jobs. We can't solve all their problems, but we can listen to them.\"\nRogers and Forkner phased themselves out of the day-to-day operations in the late 1970s. They still spent time at the corporate headquarters in Norcross even in their mid-80s.\nRogers went in up until a few years ago.\n“Joe and Tom never imagined their company would grow to the 1,900 restaurants we have today,” Joe Rogers Jr. said. “They never envisioned the financial success shared by so many of their associates 61 years later.”\nBut it always seemed to be more about the personal connections for Joe Rogers Sr.\n\"I'm not an executive,” he told the AJC. “I'm a waffle cook.”\nIt all went back to that shack near the river in rural Tennessee.\nHe recalled vividly even more than a half century later how it made him feel in his moment of tiredness and hunger. It made him feel better.\n\"Our job,” he said, “is to make people feel better because they ate with us.\"\nA memorial service is set for Wednesday at 1:30 p.m. at the Georgia Tech Hotel and Conference Center, 800 Spring Street NW in Atlanta. In lieu of flowers, Waffle House said contributions may be made to the Giving Kitchen, which helps Atlanta area restaurant workers, or the Ida Cason Callaway Foundation.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/waffle-house-founder-joe-rogers-dead/jJf5kVMT03hutZpKpvkauL/"}
