{"authors":[],"date_download":"2018-10-30 19:05:37","date_modify":"2018-10-30 19:05:37","date_publish":"2018-09-12 00:00:00","description":"If the forecasts from meteorologists weren’t enough indication of the possible severity of Hur...","filename":"data/vaneerConsumption/WaffleHouseclosesaheadofHurricaneMichael.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/09/12/Videos/4481698.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_hurricane-mic_ecac47b56d508e8bed90e233ceadba11__1540926337.html","title":"Waffle House closes ahead of Hurricane Michael","title_page":"Waffle House closes ahead of Hurricane Michael","title_rss":"NULL","source_domain":"ajc.com","text":"If the forecasts from meteorologists weren’t enough indication of the possible severity of Hurricane Michael in the Panhandle, this alternative tracking method might -- the Waffle House in Panama City is closed.\n>> Read more trending news\nWith more than 1,500 restaurant locations across the Southeast that are typically open 24 hours every day of the year, a closure is a big deal, so much so that emergency officials informally determine how bad a storm is based on the Waffle House Index.\n“If a Waffle House store is open and offering a full menu, the index is green. If it is open but serving from a limited menu, it’s yellow. When the location has been forced to close, the index is red. Because Waffle House is well-prepared for disasters… it’s rare for the index to hit red,” according to the Federal Emergency Management Agency.\nThe Panama City location is expected to reopen after Hurricane Michael passes.\n#HurricaneMichael is legit people. The @WaffleHouse in Panama City Beach, Florida is now closed. pic.twitter.com/qxIfEzM3BI — Mark Arum (@MarkArum) October 9, 2018\nThe Category 4 storm has 140 mph sustained winds and is expected to make landfall Wednesday afternoon.","url":"https://www.ajc.com/news/national/hurricane-michael-waffle-house-panama-city-closes-ahead-storm/Lp6ple97DnX9NvI6GmDymM/"}
