{"authors":["Victoria Woollaston For Mailonline"],"date_download":"2018-10-22 23:28:11","date_modify":"2018-10-22 23:28:11","date_publish":"2016-01-28 12:22:29","description":"The WEpod (pictured), one of a fleet to be rolled out in coming years, will ride back and forth in the central Dutch town of Wageningen.","filename":"data/vaneerConsumption/WageningenbecomesthefirsttowntohavedriverlessWEpodshuttle.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB61A700000578-0-image-a-23_1453996274611.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3420837_Driverless-shuttle-bus-Dutch-public-roads-world-first_1540250891.html","title":"Wageningen becomes the first town to have driverless WEpod shuttle","title_page":"Wageningen becomes the first town to have driverless WEpod shuttle  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An electric, driverless shuttle bus is taking to Dutch public roads for the first time today.\nThe event will involve taxiing six passengers along a 655ft (200 metre) stretch of road in the first trial of its kind worldwide.\nThe WEpod, one of a fleet to be rolled out in coming years, will ride back and forth in the central Dutch town of Wageningen.\nAn electric, driverless shuttle bus is taking to Dutch public roads for the first time today. The event will involve taxiing six passengers along a 655ft (200 metre) stretch of road in the first trial of its kind worldwide. The WEpod, one of a fleet to be rolled out in coming years, will ride in the central Dutch town of Wageningen\nAt 5mph (8km/h), it's not going to set a speed record, 'but an unmanned vehicle has never been used on public roads,' the project's technical director, Jan Willem van der Wiel, said.\nThe WEpod is a self-propelled vehicle without control and without pedals.\nIt runs completely automatically on electricity and inside the shuttle is a six-seater cab with automatic doors and a ramp for wheelchair use.\nWHAT IS THE WEPOD? The WEpod is a self-propelled vehicle without control and without pedals and the vehicle runs completely automatically on electricity. Inside the shuttle is a six-seater cab with automatic doors. It is 9ft tall (2.7 metres) and 6.5ft wide (1.9 metres). The pod's maximum speed is 25mph (40km/h) but when driving on roads its speed will be restricted to 15.5mph (25km/h). The electric drive with a range of about 62 miles (100km).\nThe vehicle is 9ft tall (2.7 metres) and 6.5ft wide (1.9 metres).\nThe pod's maximum speed is 25mph (40km/h) but when driving on roads its speed will be restricted to 15.5mph (25km/h).\nUsing cameras, radar and laser sensors, WEpod collects information about its surroundings.\nOn-board computers combine all data and give commands to the brakes and steering.\nAs a result, the vehicle can respond to other road users and sudden changes.\nAt predetermined points, and if the vehicle is stopped during travel, an operator in a remote 'control room' can check the vehicle and restart it if needed.\nPassengers can also contact the control room from the WEpod.\nSeveral trials of so-called autonomous vehicles are under way in the automotive and technology industries.\nThe vehicle is 9ft tall (2.7 metres) and 6.5ft wide (1.9 metres). The pod's maximum speed is 25mph (40km/h) but when driving on roads its speed will be restricted to 15.5mph (25km/h)\nThe shuttle pilot (passengers pictured) will be expanded in coming months and will eventually be used as public transport along a 4-mile (6km) route\nThese include Tesla's Model S sedan, which can change lanes with minimal driver input, to plans by Google and Daimler to introduce driverless vehicles.\nFord has even tested its own self-driving cars in a variety of conditions, including snow.\n'There are initiatives all over the world, but this is the first time one will operate without a driver, on a public road,' added Iris van Cattenburch of Connekt, a group of companies developing sustainable public transport.\nThe shuttle pilot project will be expanded in coming months and will eventually be used as public transport along a 4-mile (6km) route in the town, she said.\nIn April, the Netherlands will hold the first trial with driverless semi-trucks at Rotterdam port, which autonomous road trains sending cargo from Europe's biggest port, throughout the continent by 2019.","url":"https://www.dailymail.co.uk/sciencetech/article-3420837/Driverless-shuttle-bus-Dutch-public-roads-world-first.html"}
