{"authors":["Simone Amelia For Daily Mail Australia"],"date_download":"2018-10-22 22:36:40","date_modify":"2018-10-22 22:36:40","date_publish":"2017-04-26 05:06:23","description":"The Project host Waleed Aly has revealed how his two young children with wife Dr. Susan Carland - Aisha 13, and Zayd, nine - are prodigies who are both 'high achievers'.","filename":"data/vaneerConsumption/WaleedAlyboaststhathischildrenarehighachievers.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/02/3F9BAA8300000578-0-image-a-57_1493170490433.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4445682_Waleed-Aly-boasts-smart-young-children-are_1540247800.html","title":"Waleed Aly boasts that his children are 'high achievers'","title_page":"Waleed Aly boasts that his children are 'high achievers' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He won the coveted Gold Logie in 2016 for Best Personality On Australian Television.\nAnd while Waleed Aly's career as one of the country's most talked about media presenters goes from strength to strength, it's his family life that takes precedence.\nThe 38-year-old spoke with TV WEEK about how his two children with wife Dr. Susan Carland - Aisha 13, and Zayd, nine - are prodigies who are both 'high achievers'.\nScroll down for video\nSpotlight: While Waleed Aly's career as one of the country's most talked about media presenters goes from strength to strength, it's his family life that takes precedence\nHe explained how both kids have shown exceptional talent, with Zayd 'teaching himself German' and Aisha asking her parents what they should 'do their PhD's on'.\n'It's funny how [Zayd's] passion for sport leads him into other things,' he described.\n'Like, he's started teaching himself German, purely because he likes German soccer players - it's as simple as that,' he added.\nHigh achievers: He explained how both kids have shown exceptional talent, with Zayd 'teaching himself German' and Aisha asking her parents what they should 'do their PhD's on'\n'He's started teaching himself German, purely because he likes German soccer players - it's as simple as that,' he added of his son Zayd, nine\nHis 13-year-old Aisha recently asked her parents what the children should do their Doctor of Philosophy studies on, an endeavour her mother Susan is undertaking.\nWith both parents being academics, he offered their children don't see complex assignments as 'something extra that you do'.\nThe Project co-host also spoke on his popularity with the show's audience and how his strong public opinions often become 'clickbait'.\n'I'm in a chair that makes me a big target,' The Project host described of his position on the news show alongside Carrie Bickmore, Peter Helliar and various panelists\nHe said his position on the news show alongside Carrie Bickmore, Peter Helliar and various panelists makes him a 'big target'.\n'People exaggerate what I do, for good or bad. That's just the nature of it,' he continued.\nNominated for the Gold Logie statuette again this year, the Melbourne-born lawyer opened up about how he deals with viewers' criticism.\nFamily ties: The former head of public affairs for the Islamic Council of Victoria said he and his wife of 15 years, Dr. Susan Carland, treasure their time with their two children most\n'Does it affect me? Yeah, it can change how I'm feeling,' he explained. 'But with any luck it won't change what I'm doing.'\nWaleed missed out on winning his second Gold Logie during Sunday's glittering award ceremony.\nThe honour went to actor Samuel Johnson for his portrayal of Australian music guru Molly Meldrum in a television mini-series.\nNot so lucky: Waleed missed out on winning his second Gold Logie during Sunday's glittering award ceremony","url":"https://www.dailymail.co.uk/tvshowbiz/article-4445682/Waleed-Aly-boasts-smart-young-children-are.html"}
