{"authors":["Andrew Baldock","Press Association"],"date_download":"2018-10-23 04:22:36","date_modify":"2018-10-23 04:22:36","date_publish":"2017-03-16 15:37:48","description":"Victory for Wales in Paris - and an England victory over Ireland - would lift Wales into fourth spot in the world rankings ahead of the crucial draw for the 2019 World Cup, which will take place in May.","filename":"data/vaneerConsumption/WalesinworldtopfourislargeincentivetobeatFrance.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E2B998000000578-0-image-a-127_1489678566672.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-4320632_Wales-world-four-large-incentive-beat-France_1540268556.html","title":"Wales in world top four is large incentive to beat France","title_page":"Wales in world top four is large incentive to beat France | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rob Howley has described the possibility of Wales securing a top four world ranking as 'a large incentive' heading into Saturday's Six Nations finale against France.\nVictory for Wales in Paris - and an England victory over Ireland - would lift Wales into fourth spot ahead of May's 2019 World Cup pool draw.\nSuch a scenario means they would be likely to avoid a so-called pool of death, which they encountered in 2015 after being grouped alongside England and Australia.\nWales beat Ireland last week but even if they win this weekend they cannot win the tournament\nRob Howley believes the chance of making it into the top four is large incentive to beat France\nWALES TEAM TO PLAY FRANCE STARTING XV: L Halfpenny (Toulon); G North (Northampton), J Davies (Scarlets), S Williams (Scarlets), L Williams (Scarlets); D Biggar (Ospreys), R Webb (Ospreys); R Evans (Scarlets), K Owens (Scarlets), T Francis (Exeter), J Ball (Scarlets), A W Jones (Ospreys, capt), S Warburton (Cardiff Blues), J Tipuric (Ospreys), R Moriarty (Gloucester). BENCH : S Baldwin (Ospreys), N Smith (Ospreys), S Lee (Scarlets), L Charteris (Bath), T Faletau (Bath), G Davies (Scarlets), S Davies (Ospreys), J Roberts (Harlequins)\n'We feel in good shape like we did for the Ireland game (which Wales won 22-9), and we are looking for a similar result,' Wales' interim head coach Howley said.\n'We have talked about the opportunity to go fourth in the world, and we are relying on other results to go second in the championship. We are aware of that.\n'We have the opportunity to go into the next World Cup ranked fourth in the world. That is a large incentive for players and the coaches.'\nWales have won their last five encounters against France - their last loss to Les Bleus came in the 2011 World Cup semi-final - and Howley has predictably retained the team that accounted for Ireland.\nFrance, though, pushed England and Ireland close, while also beating Scotland and Italy, and Howley is aware of the threat they will pose.\n'I think that we will go in against a very good France side,' Howley added.\n'They were potentially - having watched the England and Ireland games - unlucky not to come away with more wins, and likewise with ourselves.\nFrance beat Italy 40-18 last time out and Howley acknowledges the threat they will pose\n'One game can be far different to the next, so we need to go out to Paris and perform to the level we have in training.\n'I was really pleased with the impact off the bench (against Ireland). In the course of the championship, it hasn't been good enough, but against Ireland the bench came on and did their job.\n'I keep mentioning about the 23 players - not about the 15 - and just consistently saying the same message to the players.\n'The bench made the difference, and ultimately in international games that is the difference between winning and losing, and thankfully last weekend we were on the right side of that.'\nWales skipper Alun Wyn Jones, who will become the first Welshman to start 100 Tests for his country on Saturday, is braced to face a French team 'of old.'\nAlun Wyn Jones is set to become the first Welshman to start 100 Tests for his country\nKen Owens was also praised by Howley, who called him 'outstanding' during the tournament\n'They have quite a few large men in their pack,' Jones said.\n'They have the off-loading game, and the physicality they have is like a French team of old, if you like - off-loading and physicality with a heavy set-piece.\n'It is a difficult ask, but we are coming off the back of a positive display and we need to back it up now.'\nHowley, meanwhile, paid tribute to Wales hooker Ken Owens, who wins his 50th cap this weekend and is unquestionably a major contender to make this summer's British and Irish Lions tour of New Zealand.\n'He is playing well, isn't he?' Howley said. 'He is outstanding.\n'When you look at a hooker in terms of the set-piece, he is very accurate, he ball-carries well, gets to the gain-line and makes good decisions.\n'He has certainly put his hand up for one of the tours at the end of the season. He gives players confidence around him.\n'He is a great senior player with experience. He leads when he needs to, and is quiet if needs be, too.'","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-4320632/Wales-world-four-large-incentive-beat-France.html"}
