{"authors":["Robert Cottingham For Mailonline"],"date_download":"2018-10-23 02:17:38","date_modify":"2018-10-23 02:17:38","date_publish":"2017-04-26 13:19:38","description":"Wales will be without Neil Taylor for two matches after the defender was handed a suspension for his sending off during the goalless draw against the Republic of Ireland last month.","filename":"data/vaneerConsumption/WalesdefenderNeilTaylorhandedtwogamesuspension.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3EC7365300000578-0-image-a-4_1493209148187.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447568_Wales-defender-Neil-Taylor-handed-two-game-suspension_1540261058.html","title":"Wales defender Neil Taylor handed two-game suspension","title_page":"Wales defender Neil Taylor handed two-game suspension | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Wales will be without Neil Taylor for two crucial World Cup Qualifiers after the defender was handed a suspension for his sending off against Republic of Ireland last month.\nTaylor was dismissed for a reckless lunge on Ireland captain Seamus Coleman which fractured the full-back's leg in two places.\nThe defender was handed an automatic one-match ban for the red card, with a second game added on as extra.\nNeil Taylor reacts after being sent off for a wild lunge on Republic of Ireland's Seamus Coleman\nColeman writhes in pain as Taylor walks off the pitch having been dismissed for the tackle\nAston Villa's Taylor will now miss Wales' next two qualifiers - away at Serbia on June 11 and at home to Austria in September.\nThe challenge left Coleman requiring surgery on his fibula and tibula and the Everton star remains sidelined indefinitely.\nEverton manager Ronald Koeman and captain Phil Jagielka visited the Ireland star in hospital to offer their support.\nColeman was photographed on Wednesday working on his injury rehabilitation at the Toffee's Finch Farm training ground.\nChris Coleman talks with Republic of Ireland manager Martin O'Neil after the goalless draw\nWales manager Chris Coleman revealed that Taylor was devastated and unable to speak in the dressing room after the foul.\nThe game finished in a goalless draw which left Ireland second in Group D level on points with leaders Serbia and four ahead of Wales in third.\nThe top teams from the nine European qualifying groups go through and the eight best runners-up make the play-offs with four of them going on to Russia 2018.\nTaylor will return for the trips to Moldova and Georgia before a potential qualifying decider at home to Ireland in Wales's final match.","url":"https://www.dailymail.co.uk/sport/football/article-4447568/Wales-defender-Neil-Taylor-handed-two-game-suspension.html"}
