{"authors":["Katherine Davison For Daily Mail Australia"],"date_download":"2018-10-22 23:48:38","date_modify":"2018-10-22 23:48:38","date_publish":"2017-03-16 08:05:50","description":"Susan Carland - who is married to TV presenter Waleed Aly - has been named an InStyle & Audi Women of Style award nominee, posing in a black and white portrait for the publication","filename":"data/vaneerConsumption/WaleedAlyswifeSusanCarlandgushesabouteyebrows.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/07/3E52247C00000578-0-image-a-56_1489650328862.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4319116_Waleed-Aly-s-wife-Susan-Carland-gushes-eyebrows_1540252118.html","title":"Waleed Aly's wife Susan Carland gushes about 'eyebrows'","title_page":"Waleed Aly's wife Susan Carland gushes about 'eyebrows' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's already an academic, author and social commentator, and now Dr Susan Carland can add 'style guru' to her lengthy list of achievements.\nThe prominent Australian-born Muslim - who is married to TV presenter Waleed Aly - has been named an InStyle & Audi Women of Style award nominee.\nHer nomination was announced in InStyle magazine, alongside a black and white portrait where she is seen wearing a striped shirt by high-end Australian designer Zimmermann, and jewellery by Georg Jensen.\nDr Susan Carland (pictured) has been named an InStyle & Audi Women of Style award nominee\n'Thanks so much for including me in your excellent Women of Style awards... It was lots of fun shooting this, and your team is a delight and didn't shame me about my caffeine intake once so I love them forever,' Dr Carland wrote in an Instagram post about the shoot.\nShe added: 'Well, for that and the excellent eyebrows they gave me.'\nDr Carland, who was 19 when she converted to Islam and appears publicly and proudly wearing a hijab told InStyle: 'My goal isn't so much to be a trailblazer for my own sake, but to make it easier for the young women who come behind me.'\nShe also shared her words to live by, saying they were to 'live the life of your eulogy, not your resume'\nInStyle April issue, featuring the Women of Style nominees, is on sale from 16 March\nShe also shared her words to live by, saying they were to 'live the life of your eulogy, not your resume.'\nWhen asked what her best advice was, she added: 'If someone else thinks you can do a job, you probably can'.\nEarlier in March, Dr Carland revealed the huge toll 'coming out' as a Muslim took on her – claiming the decision to adopt the hijab was alarming for friends and family.\nIn an interview with Julia Zemiro on ABC's Home Delivery she candidly revealed she was 'terrified' to tell loved ones about her decision to convert to Islam.\n'I was terrified, absolutely terrified about telling people. My family, my mum in particular. And my friends,' she said.\n'I was so worried about telling people, because I didn't know how they'd react.\n'I assumed they would react negatively, and most people did.'\nDr Carland, 38, said the transition was even more confronting for friends and family because she decided to wear the hijab straight away.\nShe said many people still thought she converted to Islam when she met her husband of 14-years, TV presenter Waleed Aly, but said that wasn't true\n'My goal isn't so much to be a trailblazer for my own sake, but to make it easier for the young women who come behind me,' the social commentator has said\n'I think if I just said, 'I'm going to become Muslim but still look the same\" it would have been much easier for people to take,' she said.\nShe said many people still thought she converted to Islam when she met her husband of 14-years, TV presenter Waleed Aly, but said that wasn't true.\n'I think people cannot believe that a woman would choose to become Muslim,' she said.\n'They cannot believe that someone, especially an educated woman, would possibly choose it for herself.'\nInStyle April issue, featuring the Women of Style nominees, is on sale from 16 March","url":"https://www.dailymail.co.uk/femail/article-4319116/Waleed-Aly-s-wife-Susan-Carland-gushes-eyebrows.html"}
