{"authors":["Associated Press"],"date_download":"2018-10-23 04:26:02","date_modify":"2018-10-23 04:26:02","date_publish":"2016-01-28 20:33:03","description":"Walgreens has told blood-testing startup Theranos to stop sending samples collected at the drugstore chain's stores to a testing facility that drew regulator...","filename":"data/vaneerConsumption/WalgreenstellsTheranostostopusinglabunderscrutiny.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421572_Walgreens-tells-Theranos-stop-using-lab-scrutiny_1540268762.html","title":"Walgreens tells Theranos to stop using lab under scrutiny","title_page":"Walgreens tells Theranos to stop using lab under scrutiny | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Walgreens tells Theranos to stop using lab under scrutiny\nWalgreens has told blood-testing startup Theranos to stop sending samples collected at the drugstore chain's stores to a testing facility that drew regulatory scrutiny over possible patient risks.\nThe company said Thursday that it told Theranos to either send tests to a certified lab in the Phoenix area that Theranos runs or to an accredited third-party lab. The decision only affects 40 stores in Arizona and a Palo Alto, California, store, where Walgreens has suspended Theranos laboratory services.\nWalgreens Boots Alliance Inc. runs more than 8,000 U.S. locations as the nation's largest drugstore chain.\nInspectors for the Centers for Medicare and Medicaid Services recently warned the privately held Theranos Inc. that they found five deficiencies at its Newark, California, laboratory, and some \"pose immediate jeopardy to patient safety and health.\"\nTheranos has said the inspection took place last year and doesn't reflect its current practices. The Silicon Valley company also says it is taking corrective steps.\nFounded by CEO Elizabeth Holmes, Theranos has raised millions by pitching its technology as a cheaper, faster way to run dozens of blood tests.","url":"https://www.dailymail.co.uk/wires/ap/article-3421572/Walgreens-tells-Theranos-stop-using-lab-scrutiny.html"}
