{"authors":["Business Insider"],"date_download":"2018-10-30 22:45:59","date_modify":"2018-10-30 22:45:59","date_publish":"2016-12-12 00:00:00","description":"Finance Insider is Business Insider's midday summary of the top stories of the past 24 hours.","filename":"data/vaneerConsumption/WallStreetsbiggeststoriesDecember12.json","image_url":"https://amp.businessinsider.com/images/57a8b6ccce38f234008b551e-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-streets-biggest-stories-december-12-2016-12_1540939559.html","title":"Wall Street's biggest stories: December 12","title_page":"    Wall Street's biggest stories: December 12 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"JPMorgan CEO Jamie Dimon. REUTERS/Dylan Martinez\nWelcome to Finance Insider, Business Insider's summary of the top stories of the past 24 hours.\nDaniel Pinto's eyes lit up.\nEarlier in the day, his boss, JPMorgan CEO Jamie Dimon, said the bank's markets business was heading for a strong finish to the year. Dimon also let slip that Pinto, who runs JPMorgan's giant corporate and investment bank, had put up a chart in an investor-day presentation that \"no one understood, including myself at the time.\"\nWe sat down with the Argentinian to discuss fixed-income trading, technology, and what that hard-to-understand chart really means. He took pleasure in explaining it.\nStocks are on a tear, and the US dollar is rising — all since Donald Trump was elected the 45 th US president. A month after the election, we've taken a closer look at how markets have moved since then as well as some idea of why those moves have happened.\nIn related news, Gary Cohn, Goldman Sachs' COO and president, is set to accept a position in the Trump administration — and it could mean a big payday for him.\nJosh Barro argues that Trump's Gilded Age Cabinet isn't a breach of populist promises — yet. And basic income makes more sense than ever in the Trump era, according to Chris Weller.\nTrump tweeted that the F-35's cost is \"out of control\" — and now the stock of the company that makes it is diving. And former Major League Baseball player Jose Canseco wants Trump to make him Federal Reserve Chair.\nBack on Wall Street, hedge funds are hiring a bunch of Ph.D.'s to build trading machines, but they're missing one crucial element. That's according to Manoj Narang, who is launching a hot new hedge fund, the $1 billion MANA Partners. You can read the entire interview here.\nThe nonprofit that took on Valeant has investigated another hedge fund darling. And Morgan Stanley has handed four top executives expanded responsibilities.\nIn commodities news, oil is going crazy after the first deal in 15 years was sealed between Russia and Saudi Arabia to cut production. The Russian ruble is going nuts, and oil stocks are surging too.\nBusiness Insider has unveiled a series on the future of self driving cars. Here are some of the highlights:","url":"https://www.businessinsider.com/wall-streets-biggest-stories-december-12-2016-12"}
