{"authors":["John Binder"],"date_download":"2018-10-30 19:07:45","date_modify":"2018-10-30 19:07:45","date_publish":"2017-01-25 17:11:28","description":"A leading group advocating for more security along the United States’ borders, says Trump’s promise to build a wall is a “necessity.”","filename":"data/vaneerConsumption/WallonSouthernBorderIsaNecessity.json","image_url":"https://media.breitbart.com/media/2015/01/border_fence_end_AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2017_01_25__1540926465.html","title":"Wall on Southern Border Is a 'Necessity'","title_page":"Immigration Group: Wall on Southern Border Is a 'Necessity'","title_rss":"NULL","source_domain":"breitbart.com","text":"A leading immigration group, advocating for more security along the United States’ borders, says President Donald Trump’s promise to build a wall is a “necessity.”\nThe Federation for American Immigration Reform (FAIR) has released a comprehensive report which found that the US-Mexico Border is still lacking in security and needs a full barrier to complete the job.\n“In 2006, Congress required that a barrier be constructed,” FAIR reports in their research. “But the project was never completed as mandated, and much of the border wall/fence lies in disrepair or is built to subpar standards. With illegal immigration, drug trafficking and human smuggling an ongoing problem, and the threat of terrorism ever increasing, it is critical that a proper security barrier be constructed.”\n“A physical barrier on the southern border is a necessity if our government wishes to meet its obligation to protect the sovereignty and security of the United States of America,” FAIR continues. “Besides helping stem the tide of illegal immigration, it also limits the ability of drug cartels, human traffickers, terrorists and other national security threats to access the United States from Mexico and the rest of Central and South America. Furthermore, a secure border sends the message that prospective immigrants are expected to follow the rule of law.”\nThe report by FAIR not only acknowledged the importance of a border wall for security, but also found that the idea would be a “sound fiscal investment,” saving Americans in the long run a total of $113 billion in costs from widespread illegal immigration.\nEven if the border wall were only to reduce illegal immigration costs to American taxpayers by 5 percent, FAIR found that the construction and maintenance of the border wall would pay for itself within six years.\nCurrently, the barriers along the Southern border “hardly qualifies as a fence or wall,” FAIR notes, citing that “many stretches consist of nothing more than a ‘vehicle barrier’ that fails to slow down foot traffic.”\nTrump has said that the construction of a Southern border wall will begin soon, as it remains one of his top priorities.\nJohn Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.","url":"https://www.breitbart.com/border/2017/01/25/immigration-group-wall-southern-border-necessity/"}
