{"authors":["Business Insider"],"date_download":"2018-10-30 23:35:32","date_modify":"2018-10-30 23:35:32","date_publish":"2016-12-06 00:00:00","description":"Finance Insider is Business Insider's midday summary of the top stories of the past 24 hours.","filename":"data/vaneerConsumption/WallStreetsbiggeststoriesDecember6.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-streets-biggest-stories-december-6-2016-12_1540942532.html","title":"Wall Street's biggest stories: December 6","title_page":"    Wall Street's biggest stories: December 6 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Tasos Katopodis/Getty Images Welcome to Finance Insider, Business Insider's summary of the top stories of the past 24 hours.\nBusiness Insider is currently hosting its annual IGNITION event in New York.\nYou can watch the event live here, with Business Insider CEO Henry Blodget interviewing AT&T CEO Randall Stephenson right now. Here are a couple headlines from the event so far:\nPresident-elect Donald Trump continues to dominate the headlines. Here are the top stories from the past 24 hours:\nIn other news, Wall Street banks are having a great time in trading.\nChipotle is getting slammed after saying it's nervous about hitting its guidance for the year, and an activist investor sent a brutal letter to turn Buffalo Wild Wings franchisees against management.\nLastly, Business Insider is hiring a paid editorial intern for its finance team.\nHere are the top Wall Street headlines at midday\nMark Carney: 'Every technological revolution mercilessly destroys jobs well before the new ones emerge' - Bank of England Governor Mark Carney thinks the jobs market is experiencing \"great disruption\" due to technology, and believes governments and corporations have a duty to help people manage the change.\nCrude oil is losing its OPEC rally - Crude-oil prices were lower Tuesday for the first day since OPEC agreed last Wednesday to limit its production.\nBILL GROSS: The world's growing debt problem is just like the US prison system - Bill Gross, the Janus bond guru and legendary investor, thinks that America has two imprisonment problems.\nVerizon to sell data centers to Equinix for $3.6 billion - Verizon Communications, the No. 1 U.S. wireless carrier, has agreed to sell 29 data centers to Equinix for $3.6 billion.\nThe Supreme Court just dealt a blow to Wall Streeters accused of insider trading - The US Supreme Court, ruling in an insider trading case for the first time in two decades, on Tuesday upheld a Chicago man's conviction in a decision that could make it easier to prosecute people accused of profiting from confidential information.\nGOLDMAN: Here are our biggest fears for 2017 - David Kostin, the chief US equity strategist at Goldman Sachs, thinks there is good news coming in 2017, but investors shouldn't be complacent.\nHow a misunderstanding led to a former CIA programmer getting the top job at Steve Cohen's investment fund - Doug Haynes, president of New York's Point72 Capital Management, didn't have his sights set on a career in the hedge fund business. But that's where he ended up after a call from legendary money manager Steven Cohen in late-2013.\nSouth Korea's president could be forced out of office amidst economic troubles - South Korea's president Park Geun-Hye could soon be out of office amid a corruption and influence-peddling scandal that has been front-and-center for weeks. However, it's unlikely that her exit would immediately smooth things over for Korea's economy.\nEurope's best low-cost airline just got the green light to charge full-steam into America - Late Friday, the US Department of Transportation finalized its decision to grant Norwegian Air International approval to operate flights into the US.","url":"https://www.businessinsider.com/wall-streets-biggest-stories-december-6-2016-12"}
