{"authors":["Business Insider"],"date_download":"2018-10-30 21:17:55","date_modify":"2018-10-30 21:17:55","date_publish":"2016-12-21 00:00:00","description":"Finance Insider is Business Insider's midday summary of the top stories of the past 24 hours.","filename":"data/vaneerConsumption/WallStreetsbiggeststoriesDecember21.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-streets-biggest-stories-december-21-2016-12_1540934275.html","title":"Wall Street's biggest stories: December 21","title_page":"    Wall Street's biggest stories: December 21 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Shutterstock/holbox Welcome to Finance Insider, Business Insider's summary of the top stories of the past 24 hours.\nNew York, London, and Hong Kong used to be the most competitive cities in which to be an investment banker.\nBut as the heart of innovation has shifted toward one industry — technology and, more specifically, the internet — so too have the most exciting jobs for dealmakers. Here's what it means to be a banker in Silicon Valley.\nElsewhere in finance news, Blackstone is winding down its \"big bet\" hedge fund. Goldman Sachs will pay $120 million over attempted ISDAFIX benchmark manipulation. And a former high-flying BlackRock fund manager was sentenced to 12 months in jail for insider dealing.\nBusiness Insider gained exclusive access to the Hudson Yards construction site with our 360 cameras. Check out the view.\nJosh Barro has eight ideas for Democrats to beat Donald Trump on jobs and wages. And Trump's huge investment in infrastructure is less likely to happen than many people realize, according to Linette Lopez.\nIn corporate news, Nike beat on earnings and sales, and FedEx whiffed on earnings. And the Senate just released a massive report on drug pricing — here's what you need to know.\nHere's when US markets are open and closed during each holiday in 2017.\nLastly, here are 75 under-the-radar places everyone should visit in the world.\nHere are the top Wall Street headlines at midday\nGOLDMAN SACHS: The Fed may ruin one of Trump's biggest plans for the economy— President-elect Donald Trump promised on the campaign trail to return the US to 4% gross-domestic-product growth during his presidency.\nInvestors continue to pile into America's hottest investment product— Markets have embraced President-elect Donald Trump's victory, with the Dow flirting with an all-time high of 20,000.\nKRUGMAN: The \"America we knew and loved is gone\"— Paul Krugman, the Nobel-winning economist and liberal New York Times columnist, said Monday that he has lost faith in the future of the United States.\nExisting home sales rise to their best level since the financial crisis— Existing home sales rose more than expected in November, according to the National Association of Realtors.\nTIMELINE: The rise and fall of China's currency - The Chinese yuan has been in a controlled decline since 2014 and is now at multi-year lows against the US dollar.\nHere's the Indian travel company that just went public on the Nasdaq— Indian travel portal Yatra went public on the Nasdaq on Monday, following the footsteps of its main rival MakeMyTrip, which had its initial listing on the tech-heavy exchange in 2010.\nIt's not too late to ride the rally in Japanese stocks— Japan's stock market has outperformed its global peers in a second-half rally that is a reversal from a dismal first half.\n11 things everyone on Wall Street needs to stop wearing ASAP— Like any tribe, Wall Street has its own way of dressing, passed down from executives to managing directors, VPs to associates, and so on.","url":"https://www.businessinsider.com/wall-streets-biggest-stories-december-21-2016-12"}
