{"authors":["Business Insider"],"date_download":"2018-10-30 22:23:49","date_modify":"2018-10-30 22:23:49","date_publish":"2016-12-13 00:00:00","description":"Finance Insider is Business Insider's midday summary of the top stories of the past 24 hours.","filename":"data/vaneerConsumption/WallStreetsbiggeststoriesDecember13.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-streets-biggest-stories-december-13-2016-12_1540938229.html","title":"Wall Street's biggest stories: December 13","title_page":"    Wall Street's biggest stories: December 13 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Microsoft cofounder Bill Gates. Ramin Talaie/Getty Images Welcome to Finance Insider, Business Insider's summary of the top stories of the past 24 hours.\nThe three major stock market indexes hit record highs in trading on Tuesday, with the Dow getting even closer to the 20,000 milestone.\nThere are two factors that would allow this streak of record-setting market days to continue, according to Jonathan Golub, chief equity strategist at RBC Capital Markets. Meanwhile, Bill Gates thinks the stock market is a little pricey.\nOne of the Fed's most controversial charts may become great again in 2017. And here's how a Fed rate hike will impact mortgage payments in 12 major US cities.\nA hot $1 billion hedge fund is building computers to predict how human traders will act. Here's what Point72 President Doug Haynes looks for when hiring young people. A small hedge fund that is killing it on the back of Trump's win just won the backing of a big-name investor.\nAnd a scathing open letter urged activist Bill Ackman to fix Chipotle's \"grave failures.\"\nJPMorgan is not going back to proprietary trading, according to investment bank CEO Daniel Pinto. He also warned against the unintended consequences of cutting trading businesses.\n\"When you start trying to cut costs in this type of business, you don't know when you'll stop,\" he said.\nHere's what it's like to work at Bain & Company, the best workplace of 2017.\nA former Tesla and BMW exec says self-driving cars will start to kill car ownership in just five years. Here are all the coolest bikes and gear at the 2016 New York Motorcycle Show.\nAnd lastly, the Acura NSX is Business Insider's 2016 Car of the Year.\nHere are the top Wall Street headlines at midday\n\"This spot in my heart, in my mind, will be here for a long time\": Gary Cohn says goodbye to Goldman Sachs - President-elect Donald Trump on Monday announced that Goldman Sachs' COO and president, Gary Cohn, would be joining his administration.\nA former Wall Street exec is trying to do to real-estate what technology did to stock trading - Jarred Kessler, a 15-year Wall Street veteran and former head of US equities at financial services firm Cantor Fitzgerald, came up with his big idea when a friend lost his job.\nJapanese beer giant Asahi is buying 5 European beer brands for $7.8bn - Asahi Group Holdings will buy a group of eastern European beer brands from Anheuser-Busch InBev for 7.3 billion euros ($7.8 billion), boosting its presence in the region in the largest international beer deal by a Japanese brewer.\nQatar plans to invest $10 billion in US infrastructure - The head of Qatar's sovereign wealth fund has told US officials it will invest $10 billion in infrastructure projects inside the US, sources said, in an apparent boost to the economic plans of President-elect Donald Trump.\nSeaWorld is opening its first park without its signature killer whales - SeaWorld is planning on launching a new park in Abu Dhabi, according to a release from the company.\n15 of the most luxurious mansions you can rent in Aspen - Aspen, Colorado, with its four surrounding ski areas, has long been a destination for the wealthy.","url":"https://www.businessinsider.com/wall-streets-biggest-stories-december-13-2016-12"}
