{"authors":["Business Insider"],"date_download":"2018-10-31 00:16:08","date_modify":"2018-10-31 00:16:08","date_publish":"2016-12-02 00:00:00","description":"Finance Insider is Business Insider's midday summary of the top stories of the past 24 hours.","filename":"data/vaneerConsumption/WallStreetsbiggeststoriesDecember2.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-streets-biggest-stories-december-2-2016-12_1540944968.html","title":"Wall Street's biggest stories: December 2","title_page":"    Wall Street's biggest stories: December 2 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Stephen Schwarzman, Chairman, CEO and Co-Founder of Blackstone, speaks at the Milken Institute Global Conference in Beverly Hills Thomson Reuters Welcome to Finance Insider, Business Insider's summary of the top stories of the past 24 hours.\nThe US unemployment rate fell to a nine-year low in November as fewer people searched for jobs, according to Friday's jobs report from the Bureau of Labor Statistics.\nThe unemployment rate dropped to 4.6%, while labor-force participation as a share of the working-age population declined to 62.7%, remaining near the lowest level since the 1970s.\nThe jobs report also proved it's still tough for unemployed Americans. In related news, automation and AI is going to decimate middle class jobs, according to Stephen Hawking.\nIn Wall Street news, private-equity giant Blackstone said on Friday that its CEO, Steve Schwarzman, would head a group of business leaders to \"frequently\" advise President-elect Donald Trump on economic matters. The group also includes Blackrock CEO Larry Fink and JPMorgan CEO Jamie Dimon.\nA bunch of Deutsche Bank clients are learning the harsh reality of an age-old rule on Wall Street. And another senior executive is set to leave the bank.\nElsewhere, Goldman Sachs shares have been on a tear since the election. One group of traders is looking forward to a big bump in bonuses. The world's oldest bank could be on the brink of a bailout. And Barclays hosted a two-week accelerator for startups trying to make the world a better place.\nIn investing news, a hedge fund seeded by investing legend Julian Robertson is shutting down. And a hot new commodities hedge fund had a monster November.\nIn other news, the evidence is piling up that president-elect Donald Trump will let AT&T buy Time Warner. Starbucks CEO Howard Schultz is stepping down. And the EpiPen-maker's CEO knows who's responsible for soaring drug costs — and it's not her.\nLastly, here's the real cost of the \"12 days of Christmas.\"\nHere are the top Wall Street headlines at midday\nHere's what Europe's top traders expect from their bonuses this year— Foreign exchange trading is where it is at in Europe.\nHow one Trump voter lost her home to his pick for Treasury secretary— When President-elect Donald Trump named his Treasury secretary, Teena Colebrook felt her heart sink.\nHOWARD SCHULTZ: Starbucks is not \"at odds with Trump or his supporters\"— The outgoing Starbucks CEO, Howard Schultz, struck a conciliatory tone over Donald Trump's victory in the presidential election in an interview Friday morning.\nBARCLAYS: China capital outflows at \"near-record\" levels— Money is flowing out of China again.\nMorgan Stanley thinks the tiny new video tab on the Facebook app will help it steal big money from TV— Facebook has been testing the introduction of a dedicated video tab inside its mobile app among a select group of users over the past year— a move Morgan Stanley analysts predict will help the social network capture a greater share of the TV ad market.\nDEUTSCHE BANK: Cash is entering \"a long winter\" — but don't expect it to die anytime soon— Society is far from becoming totally cashless, and suggestions that cash could be on the brink of extinction in Western society are way off the mark, according to a new report from Deutsche Bank.\nThese 5 crazy-fast electric cars are giving supercars a run for their money— Electric cars are pushing the envelope on their need for speed.","url":"https://www.businessinsider.com/wall-streets-biggest-stories-december-2-2016-12"}
