{"authors":["Rachael Levy"],"date_download":"2018-10-30 21:55:01","date_modify":"2018-10-30 21:55:01","date_publish":"2016-12-16 00:00:00","description":"We've received several versions of the story below, Wall Streeters rough night.","filename":"data/vaneerConsumption/WallStreetholidaypartygonewrong.json","image_url":"https://amp.businessinsider.com/images/585467c2ca7f0c20008b656e-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-street-holiday-party-gone-wrong-2016-12_1540936501.html","title":"Wall Street holiday party gone wrong","title_page":"    Wall Street holiday party gone wrong - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Pablo Blazquez Dominguez/Getty Images It's that time of year again. There's a story being passed around among hedge funders and bankers about a Christmas party on Thursday evening that went awry for one young financier.\nIt's unclear exactly where it originated, but Wall Street is abuzz with rumors over who was involved, with many using their trusty Bloomberg terminal to look up individual profiles and guess at the identity of the unhappy party goer. The exact account below was sent to us by two sources. Here's what went down, according to the story. \"1. Had Christmas party at 21 Club last night 2. Was bombed by 7pm 3. Threw up on the founder of Weeden at 815 4. Woke up in the Bronx with no phone, wallet or recollection of how he got there 5. I guess finds the phone and calls the desk at 915 to see if he should come in 6. Shows up to work in the same suit w HOLES in it 7. Gets sent home\"\nUPDATE: We have confirmed this was not a Weeden & Co. party, and based on the fact that Weeden was founded in 1922, clearly the founder was not in attendance. Additionally, our sources say this party goer isn't a Weeden employee, however it sounds like they had quite a night.","url":"https://www.businessinsider.com/wall-street-holiday-party-gone-wrong-2016-12"}
