{"authors":["Business Insider"],"date_download":"2018-10-30 21:55:22","date_modify":"2018-10-30 21:55:22","date_publish":"2016-12-16 00:00:00","description":"Finance Insider is Business Insider's midday summary of the top stories of the past 24 hours.","filename":"data/vaneerConsumption/WallStreetsbiggeststoriesDecember16.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-streets-biggest-stories-december-16-2016-12_1540936522.html","title":"Wall Street's biggest stories: December 16","title_page":"    Wall Street's biggest stories: December 16 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"JP Morgan CEO Jamie Dimon speaks at a Remain in the EU campaign event attended by Britain's Chancellor of the Exchequer George Osborne (not shown) at JP Morgan's corporate centre in Bournemouth Thomson Reuters Welcome to Finance Insider, Business Insider's summary of the top stories of the past 24 hours.\n2016 has been one for the history books.\nOn Wall Street, the year started off with record low levels of activity — in fact, the first quarter was the worst for equity, debt, loan, and advisory revenues since 2009— and took months to get back on track. Now the year is capping off with bank stocks on a tear since the November 8 election of Donald Trump as president.\nSo where will we go from here? Business Insider spoke with a number of dealmakers about the biggest trends to expect in 2017 — here's what they had to say.\nHere's how the Fed's decision to raise interest rates could impact your life. The US dollar has been on a tear, and that \"will ultimately undermine economic prosperity globally.\" The market's reaction to Donald Trump's election is \"pretty much the mirror image of what he might do.\" And the Trump rally will continue in 2017, according to Pimco.\nThe official GOP biography of Trump's pick for Treasury secretary completely leaves out his 17 years at Goldman Sachs.\nThere has been a board shake-up at Chipotle, and Bill Ackman is happy about it. The $300 generic EpiPen is here. Trivago's IPO fell below expectations. And a small hedge fund that says its reports have led to CEO outings has a new big short.\nAmazon is secretly building an \"Uber for trucking\" app, setting its sights on a massive $800 billion market. Drew Houston turned a lost USB drive into a $10 billion business and learned a lot about life along the way. And Facebook admitted, for the fourth time, that it messed up its measurement metrics.\nAudi has Business Insider's 2016 Infotainment System of the Year.\nLastly, JPMorgan published a list of books you should read, albums you should listen to and places you should visit in 2017.\nHere are the top Wall Street headlines at midday\nDIMON: If you put \"some of my liberal democratic friends\" in charge of Singapore, \"it would still be a backwater\"— JPMorgan CEO Jamie Dimon is a fan of Singapore.\nDonald Trump has China's currency all wrong— The Chinese yuan has been in a controlled decline since the beginning of 2014, falling 15% to 6.9610 per US dollar, as the People's Bank of China uses its not so invisible hand to navigate its economy through a bumpy period.\nDeutsche Bank to pay $37 million to settle charges it misled dark pool investors— A unit of Deutsche Bank will pay $37 million to settle federal and state charges alleging the bank misled its dark pool clients about its order routing services, New York Attorney General Eric Schneiderman said Friday.\nYield-starved investors should be looking at REITs— The low-growth, low-yield global environment of the past few years made it increasingly difficult for investors to find attractive income opportunities.\nWells Fargo says account openings fall in November— Wells Fargo & Co reported another decline in monthly consumer account openings, indicating that the bank is having trouble rebuilding its reputation after a sales scandal.\nJPMORGAN: The biggest risk to stocks is from rising rates, but these 19 will be resilient— The Federal Reserve did the expected this week and raised its benchmark interest rate.","url":"https://www.businessinsider.com/wall-streets-biggest-stories-december-16-2016-12"}
