{"authors":["Business Insider"],"date_download":"2018-10-30 21:28:43","date_modify":"2018-10-30 21:28:43","date_publish":"2016-12-20 00:00:00","description":"Finance Insider is Business Insider's midday summary of the top stories of the past 24 hours.","filename":"data/vaneerConsumption/WallStreetsbiggeststoriesDecember20.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-streets-biggest-stories-december-20-2016-12_1540934923.html","title":"Wall Street's biggest stories: December 20","title_page":"    Wall Street's biggest stories: December 20 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Donald Trump in Alabama. Mark Wallheiser / Stringer Welcome to Finance Insider, Business Insider's summary of the top stories of the past 24 hours.\nWe're closing in on the end of 2016, and that means it's rankings time.\nWall Street banks care a great deal about where they stack up against their rivals. And in the M&A business, there's one clear winner: Goldman Sachs dominated the competition.\nEvercore is set to finish 2016 with Wall Street boutique bank bragging rights. And a 20-person British firm that advises on huge deals made more than $105 million this year.\nIn related news, a US industrial giant just struck a $65 billion deal, and Donald Trump is going to hate it. Botox-maker Allergan just picked up a regenerative medicine company for $2.9 billion. Lloyds is banking on credit card growth with $2.4 billion MBNA buy.\nAnd Facebook has been accused of misleading EU regulators during the $22 billion WhatsApp deal.\nIn markets news, the elusive great rotation from bonds to stocks is finally happening. There are four transitions Goldman Sachs Asset Management will be watching in 2017. Pimco is watching three difficult transitions, meanwhile. And foreign investors are getting ready to go on a US bond buying binge.\nRay Dalio, the founder of Bridgewater Associates, the world's biggest hedge fund firm, says people should expect a major shift under President-elect Donald Trump.\n\"If you haven't read Ayn Rand lately, I suggest that you do,\" he said.\nIn banks news, Citigroup is using Snap Spectacles to help recruit young talent. Investment bank Jefferies just had a killer quarter, with profit jumping four-fold.\nAnd finally, Goldman Sachs has published its annual Christmas crossword. Can you finish it?\nHere are the top Wall Street headlines at midday\nHedge funders charged in $1 billion fraud emailed about fleeing the US, prosecutors say - Employees of a troubled New York hedge fund, Platinum Partners, were arrested Monday on charges of participating in a $1 billion fraud.\nYELLEN: The class of 2016 is entering the strongest job market in nearly a decade - Federal Reserve Chair Janet Yellen on Monday took another victory lap for the US labor market.\nUber lost $800 million in the 3rd quarter - Uber has notched yet another quarter of staggering losses.\nAn economist who predicted a 17,000-point stock-market crash just 10 days ago is suddenly bullish - Harry Dent is bullish.\nTIMELINE: The tumultuous 155-year history of oil prices - Oil has been center stage since late 2014.\nMexican central-bank chief: The Donald Trump \"horror movie\" is about to start - With Donald Trump just a month away from assuming the Oval Office, Agustin Carstens, Mexico's normally staid central-bank chief, has issued a dire warning to his country.\nBlackberry raised its outlook for the year and the stock is popping - Blackberry is bouncing after announcing a stronger than expected third quarter.\nTrump's secretary of state pick could spell trouble for one of Latin America's biggest oil producers - US President-elect Donald Trump's selection of ExxonMobil chief executive Rex Tillerson has been scrutinized for how Tillerson's time at the company may influence his attitude toward US foreign policy — in particular, how the US will approach Russia.\nThis peer-to-peer founder thinks 2017 will be a crunch year for the industry and firms could fail - The founder of a British peer-to-peer lender believes more platforms will go bust in 2017 as poor risk assessment standards come back to haunt businesses.\nPassive investing is not as great as it's made out to be- If the passive management crowd is to be believed, actual stock picking will soon be an anachronism that belongs alongside age-betraying habits such as hard candy and AOL email accounts.","url":"https://www.businessinsider.com/wall-streets-biggest-stories-december-20-2016-12"}
