{"authors":["Portia Crowe"],"date_download":"2018-10-30 21:55:19","date_modify":"2018-10-30 21:55:19","date_publish":"2016-12-16 00:00:00","description":"Much of their responses centered around the incoming Trump administration and what his presidency will mean for the markets.","filename":"data/vaneerConsumption/WallStreetbankeroutlooksfor2017.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_banker-tweets-2016-11_1540936519.html","title":"Wall Street banker outlooks for 2017","title_page":"    Wall Street banker outlooks for 2017 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Wikimedia Commons 2016 has been one for the history books.\nOn Wall Street, the year started off with record low levels of activity — in fact, the first quarter was the worst for equity, debt, loan, and advisory revenues since 2009— and took months to get back on track.\nNow the year is capping off with bank stocks on a tear since the November 8 election of Donald Trump as president.\nSo where will we go from here?\nBusiness Insider spoke with a number of dealmakers, including both equity capital markets and mergers and acquisitions bankers, about the biggest trends to expect in 2017.\nMuch of their responses centered around the incoming Trump administration and what his presidency will mean for the markets. They all said next year is sure to be more active than 2016 has been (of course, it's hard to come by a banker who isn't bullish on his or her own industry).\nOn the IPO side, especially tech IPOs, bankers anticipate an opening up of the window, provided equity markets remain emboldened. Both the S&P and Dow have hit all-time highs multiple times since the election.\nIn M&A, bankers are anticipating that regulatory changes and the possibility of new tax and other policies will boost activity in 2017.\nBelow, in one or two sentences each, is what some of Wall Street's top dealmakers had to say.","url":"https://www.businessinsider.com/banker-tweets-2016-11"}
