{"authors":["Business Insider"],"date_download":"2018-10-30 21:04:55","date_modify":"2018-10-30 21:04:55","date_publish":"2016-12-22 00:00:00","description":"Finance Insider is Business Insider's midday summary of the top stories of the past 24 hours.","filename":"data/vaneerConsumption/WallStreetsbiggeststoriesDecember22.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-streets-biggest-stories-december-22-2016-12_1540933495.html","title":"Wall Street's biggest stories: December 22","title_page":"    Wall Street's biggest stories: December 22 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Welcome to Finance Insider, Business Insider's summary of the top stories of the past 24 hours.\n\"Main Street hasn't been taking its fair share.\"\nThat's according to Jack Bogle, the founder of the $3.5 trillion fund behemoth Vanguard. He's referring to the cost of investing and the portion of investment returns that finds its way to brokers, distributors, and Wall Street at large.\nBusiness Insider caught up with Bogle to talk about the future of the fiduciary rule, index investing, and the shift in power from Wall Street to Main Street.\nA war of words between Wall Street traders just stepped up a notch. In a letter made public on the Securities and Exchange Commission website Thursday, December 22, IEX, America's newest exchange, said it believes that NYSE knows it can charge a premium for speed, and that the most active traders will be forced to pay up.\nThe administration of Donald Trump may be getting ready to crack down on goods coming into the US. The new tariff proposal could be the start of a trade war, and put the economy on a path to \"global recession.\"\nCarl Icahn was named a special adviser in the Trump administration. Trump's transition team has pledged proper oversights and transparency regarding his special advisory role on regulatory issues.\nAnd JPMorgan CEO Jamie Dimon says America's treatment of private-sector businesses is at a \"reset moment,\" following the appointment of several executives to key cabinet positions.\nWall Street's biggest bull for 2017 outlined what would make him turn bearish.\nWe now know how Wall Street banks stack up in dealmaking, and it's not even close.\nFinally, meet the men and women aiming for the title of \"Wall Street's Best Athlete.\"\nHere are the top Wall Street headlines at midday\nAfter meeting with Trump, Boeing CEO says Air Force One will cost less than $4 billion - US President-elect Donald Trump on Wednesday met the CEOs of defense contracting giants Boeing and Lockheed Martin, whose programs he has criticized in recent weeks.\nThe US economy was stronger than previously thought in the third quarter - The US economy grew by 3.5% in the third quarter, stronger than previously reported, according to the Department of Commerce's third estimate released on Thursday. It was the fastest pace in two years.\nPRESENTING: Art Cashin's annual Christmas poem featuring the Cubs, Bob Dylan, and Donald Trump - Legendary New York Stock Exchange floor trader and director of floor operations for UBS Art Cashin just sent out his annual Wall Street Christmas poem.\nOprah says she lost 40 pounds on Weight Watchers and the stock is soaring - Weight Watchers is gaining after the roll out of a new ad campaign featuring claims that media mogul Oprah Winfrey lost 40 pounds on the system.\nSaudi Arabia's national debt has exploded since the oil crash - Saudi Arabia's national debt ballooned during the two years of lower oil prices.\nAmazon and online shopping are creating a huge problem for FedEx - Global shipping giant FedEx posted second quarter earnings for their fiscal year 2017 on Tuesday, beating their revenue target from Wall Street but falling short on profits.","url":"https://www.businessinsider.com/wall-streets-biggest-stories-december-22-2016-12"}
