{"authors":["Business Insider"],"date_download":"2018-10-30 23:10:39","date_modify":"2018-10-30 23:10:39","date_publish":"2016-12-08 00:00:00","description":"Finance Insider is Business Insider's midday summary of the top stories of the past 24 hours.","filename":"data/vaneerConsumption/WallStreetsbiggeststoriesDecember8.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-streets-biggest-stories-december-8-2016-12_1540941039.html","title":"Wall Street's biggest stories: December 8","title_page":"    Wall Street's biggest stories: December 8 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Tasos Katopodis/Getty Images Welcome to Finance Insider, Business Insider's summary of the top stories of the past 24 hours.\nPresident-elect Donald Trump has gotten into a war of words with a union president.\nUnited Steelworkers Local 1999 President Chuck Jones said that Trump had \"lied his a-- off\" over how many jobs were saved at a Carrier plant in Indiana. Trump then fired back, saying Jones had \"done a terrible job representing workers.\" Jones responded, criticizing Trump for not knowing how many \"damn jobs\" were being saved in a heavily promoted deal.\n\"A lot of people just think it's crazy we have the president going on Twitter, going after private citizens,\" T.J. Bray, a Carrier worker who serves as a media representative for USW Local 1999, told Business Insider. \"I really don't have any word for it. Hopefully he can be more presidential.\"\nIn other news, bond markets all over the world are getting demolished after the European Central Bank announced it would extend its quantitative-easing program until at least December 2017 but would scale down its asset purchases to €60 billion a month from €80 billion.\nElsewhere in markets news, Italy's \"No\" vote is the death knell for structural reforms, according to Alliance Bernstein. And one thing will define the winners and losers in markets next year, according to Bank of America Merrill Lynch.\nIn Wall Street news, Credit Suisse just hired analyst Bob Peck to head its internet banking team. The Securities and Exchange Commission may be about to shine a spotlight on one of the hot topics in Wall Street trading. There's a \"prototypical\" hedge fund manager, and if you're not it, you're screwed.\nAnd a new HBO documentary is going behind-the-scenes into Warren Buffett's life.\nBarclays, HSBC, and UBS were allegedly involved in rigging the silver market. And Prince Harry tried out being a trader for a day to raise money for charity.\nA fast-food CEO who says machines are the answer to rising wages is expected to be named Trump's next labor secretary. Chipotle's CEO made a stunning admission about a grave problem plaguing the brand. And Sears is \"set to sink\" as stores close, executives flee, and the CFO admits the brand is falling short.\nIn tech news, one of Amazon's most \"underappreciated\" businesses are already way ahead of Apple and Google\nTake this quiz to see how you'd do on the exam used to rank 15-year-olds worldwide.\nLastly, there's now a $75 million private jet for your inner Texas oil tycoon.\nHere are the top Wall Street headlines at midday\nALBERT EDWARDS: Here's \"one of the scariest charts I have seen for a very long time\" - Albert Edwards is worried, very worried.\nBlackRock to move to New York's trendy Hudson Yards district - BlackRock, the world's largest asset manager, plans to move its headquarters in 2022 from midtown Manhattan to a massive new office tower in the fast-growing Hudson Yards district on the city's far West Side, the developers said on Thursday.\nBarclays bets on investment banking in Brexit UK - Barclays is taking a contrarian bet that Britain's vote to leave the European Union will help it win more investment banking business in its home market, despite the sharp slowdown in deal activity since the referendum.\nSouth Africa is \"headed for a brutal end to the year\" - South Africa just saw a slew of ugly economic data.\nIf this keeps up, Trump won't have to do anything to punish China's economy - China's foreign exchange reserves fell yet again in November, thanks to the unrelenting upward march of the US dollar and the yuan's continued slide down.\nCostco claims it's had a version of Amazon's futuristic grocery store for 20 years - Amazon announced its next big push into brick-and-mortar retail on Monday.\nBain & Company was just named the best workplace of 2017 — step inside its New York office - The stunning views of downtown Manhattan aren't what make Bain & Company the best place to work in the US, but they certainly don't hurt.","url":"https://www.businessinsider.com/wall-streets-biggest-stories-december-8-2016-12"}
