{"authors":["Will Martin"],"date_download":"2018-10-30 23:04:37","date_modify":"2018-10-30 23:04:37","date_publish":"2018-07-24 00:00:00","description":"Deutsche Bank's newly appointed boss Christian Sewing is at the bottom of the pile, alongside Credit Suisse's Tidjane Thiam.","filename":"data/vaneerConsumption/WallStreetsbestCEOs.json","image_url":"https://amp.businessinsider.com/images/5b5720eb88be232e008b45e3-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-street-best-ceos-ranked-2018-7_1540940677.html","title":"Wall Street's best CEOs","title_page":"    Wall Street's best CEOs — as ranked by their employees - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Goldman Sachs' Lloyd Blankfein; Credit Suisse's Tidjane Thiam; and JPMorgan's Jamie Dimon. Reuters; Reuters; Reuters\nIn the lavishly-compensated world of banking, job satisfaction can often take a backseat to how much money one earns. Having a good CEO, however, will always be a major draw for banks and other financial institutions looking to recruit new staff.\nBut which major bank CEOs have the highest levels of approval among their staff? Using data from jobs-ranking website Glassdoor, the Evidence Lab at Swiss bank UBS compiled satisfaction data for the CEOs of most recognizable brands in global finance. The bank has collected more than 56,000 reviews from Glassdoor.\nThe data, featured in a note about the fortunes of struggling German lender Deutsche Bank, shows that bosses at big US banks are much more likely to have the approval of their employees than those at European lenders.\nAt the bottom of the pile were Tidjane Thiam of Credit Suisse and Deutsche Bank's new boss Christian Sewing. Meanwhile the three most-approved CEOs were Morgan Stanley's James Gorman, JPMorgan's Jamie Dimon, and Goldman Sachs' outgoing leader, Lloyd Blankfein.\nUBS did not reveal specific percentages from its analysis, but the three top US executives all scored an approval rating of more than 80% from their staff. Sewing and Thiam hovered at around 60%.\n\"CEO approval for Deutsche Bank ranks almost bottom in the peer group in 2018 and the y/y decrease is the highest,\" UBS said.\n\"We think the skew to the US market where DB runs large IB operations that are being scaled down could partially explain the weak outcome. A similar situation could stand behind Credit Suisse's weak outcome we think.\"\nThe chart below, compiled by the Evidence Lab, shows the approval ratings of CEOs at 10 of the most recognizable names in banking, as well as the industry average of around 75%. It also shows how approval ratings for bosses have changed since this time last year:","url":"https://www.businessinsider.com/wall-street-best-ceos-ranked-2018-7"}
