{"authors":["Business Insider"],"date_download":"2018-10-30 23:28:51","date_modify":"2018-10-30 23:28:51","date_publish":"2016-12-07 00:00:00","description":"Finance Insider is Business Insider's midday summary of the top stories of the past 24 hours.","filename":"data/vaneerConsumption/WallStreetsbiggeststoriesDecember7.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-streets-biggest-stories-december-7-2016-12_1540942131.html","title":"Wall Street's biggest stories: December 7","title_page":"    Wall Street's biggest stories: December 7 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"U.S. President-elect Donald Trump speaks at a USA Thank You Tour event at Crown Coliseum in Fayetteville, North Carolina, U.S., December 6, 2016. Reuters/Shannon Stapleton Welcome to Finance Insider, Business Insider's summary of the top stories of the past 24 hours.\nPresident-elect Donald Trump continues to dominate the headlines. Here are the top stories from the past 24 hours:\nIn Wall Street news, a Deutsche Bank rates trader has been suspended after asking a trading counterparty to join a WhatsApp group. Citigroup is reportedly being investigated for its role in the pound's \"flash crash.\" And one brutal table from McKinsey shows how miserable banking is right now.\nA small and highly-profitable dealmaking firm just claimed bragging rights in the most Wall Street way possible.\nMoody's slashed its outlook for the global asset management industry. Elizabeth Warren is backing a hot investing startup that's taking on Wall Street. Another hedge fund backed by investing legend Julian Robertson is shutting.\nAnd a financier left Wall Street to start a marijuana chocolate company.\nBusiness Insider is currently hosting its annual IGNITION event in New York. You can watch the event live here. Here are a couple headlines from the event so far:\nLastly, here's a guide to dress for your office holiday party without embarrassing yourself\nHere are the top Wall Street headlines at midday\nBank of Canada holds, says \"economic slack remains\"— The Bank of Canada held its key interest rate at 0.50%, as expected, at Wednesday's policy meeting.\nChina's FX reserves tumble to their lowest level since 2011— China's foreign exchange reserves fell far more than expected in November to the lowest level in nearly six years, as authorities struggled to stem capital outflows and shore up the sliding yuan in the face of the relentlessly rising dollar.\nApple supplier Foxconn is in preliminary discussions to expand its US operations— Foxconn, the world's largest contract electronics manufacturer and a major Apple supplier, said on Wednesday that it was in preliminary discussions to expand its operations in the United States.\nMexico just one-upped Canada— Mexico is now exporting more to the US than Canada.\n15 of the best watches to give and get for under $300 right now— An attractive timepiece is an essential part of the modern gentleman's style, whether you're dressed for a busy day of work or a weekend of leisure and levity.","url":"https://www.businessinsider.com/wall-streets-biggest-stories-december-7-2016-12"}
