{"authors":["Wally Hall"],"date_download":"2018-10-30 14:34:30","date_modify":"2018-10-30 14:34:30","date_publish":"2016-10-24 00:00:00","description":"Emails and texts started arriving before the game ended Saturday night on The Plains, and continued through Sunday evening.","filename":"data/vaneerConsumption/WALLYHALLHogsmustblocktackleprotecttheirQB.json","image_url":"https://media.arkansasonline.com/img/photos/2016/10/24/UA_-_AUB_FB_JI_005_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_oct_25__1540910070.html","title":"WALLY HALL: Hogs must block, tackle, protect their QB","title_page":"WALLY HALL: Hogs must block, tackle, protect their QB","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Arkansas quarterback Austin Allen (8) is sacked by Auburn defensive lineman Andrew Williams (79) on Saturday, Oct. 22, 2016, at Jordan-Hare Stadium in Auburn, Ala. - Photo by Jason Ivester\nEmails and texts started arriving before the game ended Saturday night on The Plains, and continued through Sunday evening.\nMost were not feeling the pain of the Arkansas Razorbacks' colossal 56-3 loss to Auburn; no, the fans who wrote were expressing their own frustrations, disappointment and even some anger.\nSome, apparently, were feeling no pain at all.\nOne wanted everyone fired, from the top down.\nMost expressed concern about the program's future, and a few moaned it should have been Arkansas, not Auburn, being coached by Gus Malzahn.\nThere is no need to go into all of the correspondence anymore than it is possible to thoroughly explain the beatdown that was broadcast by ESPN.\nIt seemed logical that the Tigers would test the Razorbacks' perimeter defense.\nAlabama had great success going wide on the ground, Texas A&M had some success doing the same and Auburn, which has as much or more team speed, wasted no time in going wide left.\nTrue freshman Eli Stove was like a secret weapon. Stove had touched the ball five times in the first six games.\nNo one touched him as he swept around left end and sprinted 78 yards for a touchdown. It took 11 seconds for Auburn to score the first of its seven rushing touchdowns. The Tigers also had a 45-yard touchdown pass.\nThe Tigers rushed for 544 yards without a loss until backup quarterback John Franklin took a knee on the final play.\nArkansas' bread and butter is supposed to be the run game, but Auburn's defense turned it into bed and breakfast.\nArkansas rushed 31 times for 25 yards, or an average of 0.8 per carry. The Hogs did have 43 yards in losses.\nThe Tigers, not known for having a defense that sacks much, had four sacks and another eight tackles for lost yardage.\nObviously, Malzahn, his staff and team were prepared for anything and everything the Razorbacks do on offense.\nMalzahn acted like it was another day at the office, but if truth be told this was a game he really wanted and probably needed. Malzahn and Bret Bielema are cordial, but they are not buddies who will get together for an occasional dinner.\nADVERTISEMENT\nMore headlines\nIn fact, Malzahn might have celebrated after the game in his reserved booth at the Waffle House last Saturday night with an extra helping of gravy on his biscuits.\nThis victory should have him completely off the hot seat. It wasn't just a victory, but a quality victory over a ranked opponent from the SEC West.\nMalzahn's two losses this season were to No. 3 Clemson, 19-13, and No. 9 Texas A&M, 29-16.\nArkansas' losses are to No. 1 Alabama, No. 9 Texas A&M and Auburn is now No. 15, but none of the games were really close, especially last Saturday night.\nWhen the Razorbacks' defense wasn't giving up yards, 632 total, the offense was struggling.\nArkansas' deepest offensive penetration was the Auburn 32, but it gets worse when you look at the core numbers. The teams combined for 133 offensive plays; 86 were in Razorbacks territory compared with 47 on Auburn's end of the field.\nThe Hogs ran 13 plays in Tigers territory while Auburn ran 35 plays in Arkansas territory, and twice the Tigers scored without a snap on the Razorbacks' side of the field.\nArkansas' two biggest problems against Auburn, as well as in their two other losses, were blocking and tackling. And if nothing else, they need to find a way to protect quarterback Austin Allen immediately.\nSports on 10/25/2016","url":"https://www.arkansasonline.com/news/2016/oct/25/hogs-must-block-tackle-protect-their-qb/"}
