{"authors":["Portia Crowe","Matt Turner"],"date_download":"2018-10-30 21:00:49","date_modify":"2018-10-30 21:00:49","date_publish":"2016-12-22 00:00:00","description":"Global investment banking revenue was down 14% from the same period last year according to Dealogic.","filename":"data/vaneerConsumption/WallStreetbankingrevenues.json","image_url":"https://amp.businessinsider.com/images/57a8b6ccce38f234008b551e-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-street-banking-revenues-mergers-acquisitions-equity-debt-2016-12_1540933249.html","title":"Wall Street banking revenues","title_page":"    Wall Street banking revenues - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"JPMorgan CEO Jamie Dimon. JPMorgan has pulled in more fees than any other investment bank this year. Reuters JPMorgan is set to finish the year in a dominant position when it comes to Wall Street dealmaking revenues.\nThe US bank has earned the most in fees in global investment banking, US investment banking, debt capital markets, equity capital markets and syndicated loans, according to figures from Dealogic.\nOnly Goldman Sachs stands in the way of a clean sweep: the US investment bank sits atop the ranking for M&A revenues.\nGlobal investment banking revenue stands at $70.5 billion, down 9% from the total for 2015.\nThese league tables are a contentious subject on Wall Street. Banks use them when pitching for new business, and a good ranking means serious bragging rights. But the league table-data can also be sliced up to make a bank's performance look better (by narrowing the field very narrowly, for example).\nThough they're based on estimates, these tables are the broadest possible and a closely-watched indicator of who is up and who is down. Here's how the banks stacked up this time around.","url":"https://www.businessinsider.com/wall-street-banking-revenues-mergers-acquisitions-equity-debt-2016-12"}
