{"authors":["Business Insider"],"date_download":"2018-10-30 21:39:20","date_modify":"2018-10-30 21:39:20","date_publish":"2016-12-19 00:00:00","description":"Finance Insider is Business Insider's midday summary of the top stories of the past 24 hours.","filename":"data/vaneerConsumption/WallStreetsbiggeststoriesDecember19.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-streets-biggest-stories-december-19-2016-12_1540935560.html","title":"Wall Street's biggest stories: December 19","title_page":"    Wall Street's biggest stories: December 19 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"U.S. President-elect Donald Trump speaks during a USA Thank You Tour event in Mobile, Alabama, U.S., December 17, 2016. Reuters/Lucas Jackson Welcome to Finance Insider, Business Insider's summary of the top stories of the past 24 hours.\nThe stock market is set to end the year poles apart from where it started.\n2016 started with the worst first 28-day performance ever for the S&P 500 Index. These days — ever since the US presidential election — it's jumping from new high to new high.\n\"It is a little scary to see such optimism,\" said Randy Frederick, vice president of trading and derivatives at Charles Schwab. In related news, Barron's couldn't find anyone that thinks the stock market will tank in 2017.\nRussia's ambassador to Turkey, Andrey Karlov, was shot by an unidentified gunman while attending a private event at an Ankara art museum on Monday. The Turkish lira is now tumbling in response.\nPresident-elect Donald Trump plans to nominate the founder of the high-speed trading firm Virtu Financial, Vincent Viola, as secretary of the Army. That pick lifted the combined net worth of his top team of officials and advisers to more than $10 billion.\nTrump's pick for budget chief could make one of his biggest campaign promises less likely. And Trump's tax plan could knee-cap a bunch of huge companies.\nOn Wall Street, several New York hedge funders have been arrested and charged with $1 billion fraud. You can read the indictment here.\nOne image epitomizes the changing of the guard at Goldman Sachs. And \"The Big Short\" author Michael Lewis told us what scares him most about Trump and Wall Street.\nLastly, here are the 11 most expensive Champagne bottles money can buy.\nHere are the top Wall Street headlines at midday\nA 627-year-old \"blood miracle\" failed to occur, heralding disaster for 2017 - If you thought 2016 was bad, you might want to gird yourself for an even worse 2017.\nHow a cold call to a billionaire led this founder to sell his company for $225 million - On July 22, 2009, John Gabbert stared at the bank balance for his two-year old startup and took a screenshot.\nDisney is popping after a strong opening weekend for \"Rogue One\" - Disney is getting another \"Star Wars\" bump.\nApple goes to war with EU over $14 billion tax bill: \"A misunderstanding of how corporations operate\" - Apple is going to war with the European Union over its record-breaking $14 billion tax bill — with senior executives claiming that the regulators ignored tax experts and corporate law to maximize the penalty.\nMACQUARIE: It doesn't make any sense that gold is as high as it is - Gold is about to have one of its worst quarters in nearly 35 years, but its price is still significantly higher than it should be right now, and there does not seem to be any real reason why.\n26 thoughtful holiday gifts business travelers will love - If you have a business traveler in your life, chances are you hear a lot about the struggles that come with catching flights, the logistics of getting through security, and the pitfalls of a gate change from terminal A to terminal C. It's not an easy gig.","url":"https://www.businessinsider.com/wall-streets-biggest-stories-december-19-2016-12"}
