{"authors":["Business Insider"],"date_download":"2018-10-30 22:10:40","date_modify":"2018-10-30 22:10:40","date_publish":"2016-12-15 00:00:00","description":"Finance Insider is Business Insider's midday summary of the top stories of the past 24 hours.","filename":"data/vaneerConsumption/WallStreetsbiggeststoriesDecember15.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-streets-biggest-stories-december-15-2016-12_1540937440.html","title":"Wall Street's biggest stories: December 15","title_page":"    Wall Street's biggest stories: December 15 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Chip Somodevilla/Getty Images Welcome to Finance Insider, Business Insider's summary of the top stories of the past 24 hours.\nFinally.\nThe Federal Reserve on Wednesday decided to raise its benchmark interest rate, as expected, and upped its expectation for the number of rate hikes in 2017. Here are the headlines:\nIn other news, Morgan Stanley may be missing out on the big Wall Street rebound, and here's JPMorgan's pitch to top young talent.\nHedge funds have historically marketed themselves as a prestige investment, promising an exclusive group of investors higher returns in exchange for higher fees. The higher returns haven't been there of late, though. Now the high fees are starting to budge, too.\nA conspiracy theory is going around about someone dumping Lockheed Martin stock right before Trump's tweet caused it to tank. Verizon could kill its $4.8 billion deal with Yahoo. John Zimmer, president and co-founder of Lyft, thinks that autonomous cars will lead to human drivers becoming illegal in some US cities.\nLastly, here are 21 bars with the world's most incredible views\nHere are the top Wall Street headlines at midday\n20 state attorneys general are suing 6 generic drugmakers over collusion and price fixing—New York's attorney general — along with the attorneys general of 19 other states — has filed a lawsuit against generic drugmakers for fixing prices and colluding.\nThe Bank of Japan will have to fire up its printing press again— Donald Trump's election night victory has sent shockwaves through bond markets around the world.\nCiti backs foreign exchange blockchain startup Cobalt DL—Citi has made an undisclosed investment in Cobalt DL, a London startup aiming to use the technology behind bitcoin to simplify foreign exchange trading.\nA top anthropologist says the US is flooded with \"bulls---\" jobs that should disappear—There is a job epidemic in America, anthropologist David Graeber says. And not because there are too few jobs, but because there are too many.\nInside the swanky private club where Bill Gates, Eric Schmidt, and Justin Timberlake go to ski—Yellowstone Club, a private ski resort and residential community near Big Sky, Montana, was a pioneer in the members-only space.\nWe tested what might be the best dress shoes out there— There's a good amount of thought that should go into any bigger purchases you make for your closet.","url":"https://www.businessinsider.com/wall-streets-biggest-stories-december-15-2016-12"}
