{"authors":["Business Insider"],"date_download":"2018-10-31 00:24:52","date_modify":"2018-10-31 00:24:52","date_publish":"2016-12-01 00:00:00","description":"Finance Insider is Business Insider's midday summary of the top stories of the past 24 hours.","filename":"data/vaneerConsumption/WallStreetsbiggeststoriesDecember1.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wall-streets-biggest-stories-december-1-2016-12_1540945492.html","title":"Wall Street's biggest stories: December 1","title_page":"    Wall Street's biggest stories: December 1 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"AP / Mary Cybulski Welcome to Finance Insider, Business Insider's summary of the top stories of the past 24 hours.\nFixed income, currencies, and commodities traders are back in the ascendancy on Wall Street.\nThe FICC business is expected to post an increase in 2016 revenue, in contrast to the equities business and investment banking. And according to an annual survey by the Wall Street recruiting firm Options Group, total compensation for FICC workers in the US will be up 5% from last year on average.\nElsewhere on Wall Street, a small hedge fund manager threw shade at Tesla's Elon Musk at a private conference and said the stock is going to zero. Steve Cohen is paying $135 million to settle an insider trading case from his old hedge fund. Hedge fund manager Whitney Tilson thinks Donald Trump conned his supporters.\nAnd Jefferies has \"not been operating at normal levels\" this year, but is well-positioned for 2017, according to CEO Rich Handler.\nIn markets news, bonds are getting demolished. Investors can profit from rising rates using high yield, according to AllianceBernstein. And the OPEC deal is a sign of \"tough economic circumstances.\"\nUS manufacturers crushed expectations in November. The economy continues to grow across much of America, according to the Fed. The central bank also confirmed some of the most troubling trends in Manhattan real estate.\nPreet Bharara, the \"sheriff of Wall Street,\" has met with president-elect Donald Trump, and said he'll continue to serve.Bernie Sanders and Elizabeth Warren scorched Donald Trump's Treasury secretary as \"hypocrisy at its worst.\" Trump's pick for the role, Steven Mnuchin, has made a career out of being lucky, according to Jesse Eisinger.\nA pattern is emerging with Trump's deals to save US manufacturing jobs, according to Matt DeBord. and the Carrier deal shows what Donald Trump understands about the politics of jobs, according to Josh Barro.\nHere's your first look at Rolls-Royce's new SUV. Cadillac has a new race car that looks like the Batmobile.\nLastly, here are 12 gifts the modern gentleman actually wants this year.\nHere are the top Wall Street headlines at midday\nAllergan CEO: \"I worry today that pharma has a false sense of relief or security\" with Trump presidency - Investors betting that Donald Trump is going to lay off the drug industry might be in for a surprise, according to the CEO of Botox maker Allergan.\nBAML: The S&P 500 could soar 400 points - and that may be a terrible thing - Stock market strategists are getting more bullish, and while that may be a good thing in the short-term it could lead to problems down the line.\nSalesforce is on track to become a $100 billion company in 3 years, says analyst - Salesforce is down about 5% over the past two weeks, despite reporting a solid beat-and-raise quarter on November 17.\nNovember auto sales are beating expectations so far, but with one big exception - Most companies have reported sales growth that was better than expected. However, a 14% year-on-year plunge at Fiat Chrysler could weigh on the overall rate for the month, according to Bespoke Investment Group.\nCaterpillar says Wall Street is too bullish on its sales for next year - Caterpillar on Thursday said analysts' consensus estimates for sales and profit next year were \"too optimistic,\" taking into account the challenges it expects.\n21 technology tipping points we will reach by 2030 - From driverless cars to robotic workers, the future is going to be here before you know it.","url":"https://www.businessinsider.com/wall-streets-biggest-stories-december-1-2016-12"}
