{"authors":[],"date_download":"2018-10-30 21:47:59","date_modify":"2018-10-30 21:47:59","date_publish":"2016-12-21 15:28:00","description":"Wal-Mart workers will be heading home a bit early on Christmas Eve this year.","filename":"data/vaneerConsumption/WalmartstorestocloseearlyonChristmasEve.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/21/Images/GettyImages-498622666.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_metro-atlanta-wal-mart-stores-close-early-christmas-eve__1540936079.html","title":"Wal-mart stores to close early on Christmas Eve","title_page":"Wal-mart stores to close early on Christmas Eve","title_rss":"NULL","source_domain":"ajc.com","text":"Wal-Mart workers will be heading home a bit early on Christmas Eve this year.\nOfficials at the discount superstore announced Tuesday that its 11,462 stores across the world would close at 6 p.m. Saturday – two hours earlier than usual.\n“Our associates work hard all year to make this Holiday season special for our customers, and we truly appreciate what they do every day. We also know that getting home on Christmas Eve to spend time with families is important,” Judith McKenna, executive vice president and CEO, said in a statement. “That’s why this year we’ll be closing at 6 p.m. on Christmas Eve.”\nWal-Mart stores will all be closed on Christmas Day.\nDuring the Black Friday shopping frenzy, Wal-Mart was one of the major retailers that continued its extensive Thanksgiving Day hours despite the trend among competitors, including Costco, Dillards and Barnes and Noble, to close their doors on the holiday.\nAccording to a poll from BestBlackFriday.com, nearly 55 percent of Americans do not agree with stores opening on Thanksgiving Day.\nIf you haven’t completed your last-minute shopping, here are some of the local places you can shop on Christmas Eve:\nMall hours for last-minute Christmas shopping in DeKalb\nMall hours for last-minute Christmas shopping in Gwinnett\nMall hours for last-minute Christmas shopping in Fulton\nMall hours for last-minute Christmas shopping in Cobb","url":"https://www.ajc.com/news/metro-atlanta-wal-mart-stores-close-early-christmas-eve/nFIfXX6VMefthfO3wHypjM/"}
