{"authors":["Alex Swoyer"],"date_download":"2018-10-30 18:08:45","date_modify":"2018-10-30 18:08:45","date_publish":"2015-10-21 18:44:13","description":"Rep. Walter Jones Blasts 'Bully' Paul Ryan in House Speaker Race","filename":"data/vaneerConsumption/WalterJonesBlastsBullyPaulRyan.json","image_url":"https://media.breitbart.com/media/2015/10/Rep-Walter-Jones-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_21__1540922925.html","title":"Walter Jones Blasts 'Bully' Paul Ryan","title_page":"EXCLUSIVE: Walter Jones Blasts 'Bully' Paul Ryan","title_rss":"NULL","source_domain":"breitbart.com","text":"Conservative members of the House are pushing back against Rep. Paul Ryan’s (R-WI) demand to nullify the procedural rule put into place by Founding Father and President Thomas Jefferson, which was used by Rep. Mark Meadows (R-NC) and the House Freedom Caucus to oust Rep. John Boehner (R-OH).\nRep. Walter Jones (R-NC) exclusively told Breitbart News that Ryan’s demand for changes to the ‘Motion to vacate the chair’ rule proves he wants complete power and control.\n“Paul Ryan isn’t even Speaker and he is already trying to take away power from members and consolidate it in House leadership. The reason John Boehner had to resign as Speaker is precisely because members are sick and tired of the way he concentrated power within leadership at the expense of members. Paul Ryan’s demands to change the rule to vacate the chair doesn’t solve that problem, it adds to it. This is exactly the kind of approach I don’t want to see in a potential Speaker. It’s one of the many reasons I will not be voting for him for Speaker—in addition to the fact that he has voted for big-government spending bills, bailouts for Wall Street and Detroit, TPA, and is openly in favor of amnesty. I’m supporting Congressman Dan Webster for Speaker because he will finally restore regular order and won’t bully members into voting against their consciences.”\nThe ‘Motion to vacate the chair’ rule boosts the power of a minority in the majority party, because it allows them to force a recall vote against the incumbent House Speaker.\nEvery two years, after each House election, the speaker is formally chosen by all legislators in the House. Each political party proposes a Speaker, and the majority party votes en bloc to give the job to its preferred candidate.\nBut a minority of the majority party can use the ‘motion to vacate’ rule to force an incumbent House Speaker into a recall vote by all House legislators. In theory, an incumbent Speaker can’t win that recall vote if a substantial minority of his or her majority party opposes his reelection. However, the rule doesn’t give veto power to the minority. For example, a GOP Speaker could be re-elected if he or she can win a majority of all House votes by persuading some Democratic legislators to ally with the majority of GOP legislators.\nJones previously made headlines with a letter urging any member who has committed a misdeed that would reflect poorly on the Republican Party to withdraw from running for Speaker of the House. The letter went public before Rep. Kevin McCarthy (R-CA) removed himself from the Speaker race.\nOther conservative House members agree with Jones saying that Ryan’s demand seeks more power for the Speaker of the House.\nRep. Tim Huelskamp (R-KS) said members were “put off” by Ryan’s “list of unmeetable conditions.”\nThe conditions included “his demand to repeal Thomas Jefferson’s motion to vacate the chair, which gives representatives the power to oust a sitting Speaker, as they did with Boehner,” Huelskamp said, the National Review reported.\nAmericans for Limited Government President Rick Manning said, “It is almost obscene that in response to demands that the power of the Speaker be limited, that Paul Ryan is demanding a scepter, crown and throne to take the job. Talk about a guy who just doesn’t get what’s wrong in Washington, D.C.”","url":"https://www.breitbart.com/politics/2015/10/21/exclusive-walter-jones-blasts-bully-paul-ryan/"}
