{"authors":["Kate Darvall For Daily Mail Australia","Australian Associated Press"],"date_download":"2018-10-22 22:20:48","date_modify":"2018-10-22 22:20:48","date_publish":"2017-04-26 04:17:15","description":"A Wangaratta siege has ended in tragedy after a man, 43, and woman, 39, were found dead in their home in a suspected murder-suicide on Tuesday.","filename":"data/vaneerConsumption/Wangarattasiegeendswithamanandwomandead.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F9CBC4500000578-0-image-a-7_1493185792003.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446166_Wangaratta-Victoria-siege-woman-man-dead-murder-suicide_1540246848.html","title":"Wangaratta siege ends with a man and woman dead","title_page":"Wangaratta siege ends with a man and woman dead | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A couple who died in a suspected murder-suicide in Wangaratta, in Victoria's northeast on Tuesday, are believed to be the parents of four young children.\nThe woman, 39, fled the family home with the couple's four young children before she was allegedly gunned down by the man, 43, believed to be her husband.\nThe woman reportedly ran with the children to their next-door neighbour's home after an argument with her husband.\nHe followed his wife and children to the neighbour's house where he allegedly shot her before turning the gun on himself, 9 News reports.\nA single red rose (pictured) was left on a car in the Wangaratta street where the suspected murder-suicide happened\nA stand-off in the Victorian town ended in tragedy when the man and woman were found dead in their Belle Avenue home.\nPolice were called to the house about 12.50pm on Tuesday after reports of a gunshot.\nA witness told police they saw a man with a rifle and telescopic sight chasing a woman before the gunshot sounded.\nTwo adults and six children reportedly left the house unharmed shortly after the shot was fired and sought shelter with the police.\nThe children were believed to be aged between two and nine years old.\nPolice were called to the Wangaratta property about 12.50pm on Tuesday after reports of a gunshot\nPolice cordoned off the area and told neighbours to remain inside their houses with the doors locked during the siege\nA siege ensued with police attempting to make contact with the man holed up in the house with a woman.\nWhen officers entered the property about 5.10pm, they found the pair dead.\nNext door neighbour Miranda Fraser told the Herald Sun she was in shock at learning her friends were caught up in the 'awful tragedy'.\n'My heart breaks for the kids; they have lost mummy and daddy in the worst way possible,' she said.\n'They've just lost mum and dad, I don't know, it's just not right. Four children don't have a mum and dad now.'\nOfficers entered the Wangaratta property about 5.10pm on Tuesday and found the pair dead\nOther neighbours laid flowers and messages at the home where the couple, believed to be husband and wife, lived.\nPolice cordoned off the area and told nearby residents in Belle, Irwin and Garnet avenues and Appin Street to remain inside their homes.\nNearby St Michael's Anglican Church first counsellor Luigi Bonacci said the deaths will have a big impact on the 'tight-knit' neighbourhood.\nPolice cordoned off the area and told nearby residents in Belle, Irwin and Garnet avenues and Appin Street to remain inside their homes\nDo you need support? Readers seeking support and information about suicide prevention can contact Lifeline on 13 11 14. Suicide Call Back Service 1300 659 467. MensLine Australia 1300 78 99 78. National domestic violence helpline: 1800 737 732 or 1800RESPECT. In an emergency call triple-zero.\n'It will be a sad time for everybody and people will be wary about what's happened because where we are is a very tight-knit area, there are a lot of families and young kids,' he told AAP.\n'Everyone seems pretty happy around here. This is not a good thing.'\nMr Bonacci said he did not yet know who was involved because police prevented residents from getting close to the scene.\nPolice said they were not looking for anyone in relation to the shooting.\nWangaratta police were unable to comment further on the case, with the matter referred to the coroner.","url":"https://www.dailymail.co.uk/news/article-4446166/Wangaratta-Victoria-siege-woman-man-dead-murder-suicide.html"}
