{"authors":[],"date_download":"2018-10-30 14:29:29","date_modify":"2018-10-30 14:29:29","date_publish":"2018-08-13 22:19:00","description":"Flats at Ponce City Market announced this week the availability of short-term rentals for fully furnished apartments, in collaboration with Atlanta Luxury Rentals.","filename":"data/vaneerConsumption/WanttosleepatPonceCityMarketShorttermrentalsnowavailable.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/13/Images/PCMS%20flats.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_want-sleep-ponce_cc53147b4e6d04ffb32078cb84b7e4b8__1540909769.html","title":"Want to sleep at Ponce City Market? Short term rentals now available","title_page":"Want to sleep at Ponce City Market? Short term  rentals now available","title_rss":"NULL","source_domain":"ajc.com","text":"Staycation, anyone?\nFlats at Ponce City Market announced this week the availability of short-term rentals for fully furnished apartments, in collaboration with Atlanta Luxury Rentals. Guests can rent studio and one- to three-bedroom apartments from three days to “several months,” a press release said.\nRates for the pet-friendly apartments, ﻿located above the complex’s Central Food Hall and shops, begin at $180 per night. They include original features — the historic landmark was built by Sears, Roebuck & Co. in 1926 — such as brick walls, tall ceilings and steel-frame windows.\nREAD | Free art movement doubles as a city-wide scavenger hunt\nREAD | See the lineup for Atlantic Station’s live music series, karaoke night.\nEach guest’s stay includes a 24-hour personal concierge service, bath products and kitchen appliances such as Keurig Coffee Makers and Vitamix Blenders. Guests also get access to amenities such as valet dry cleaning, two fitness centers and covered parking.\nThe Atlanta Beltline is accessible via private entryway along the building. Apartments can be reserved here.\nLike Intown Atlanta News Now on Facebook | Follow us on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/want-sleep-ponce-city-market-short-term-rentals-now-available/dq6awo8CGzGiTsjH88piRO/"}
