{"authors":[],"date_download":"2018-10-22 20:54:47","date_modify":"2018-10-22 20:54:47","date_publish":"2014-05-02 17:55:00","description":"How the city of Portland, Oregon became a real destination for a proper Cinco de Mayo celebration.","filename":"data/vaneerConsumption/WantaGoodCincodeMayoCelebrationGoToPortlandOregon.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/415571/140502-portland-cinco-de-mayo-816_3144e1ef4be84953bcc63de928890cf8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_want-good-cinco-de-mayo-celebration-go-portland-oregon-n95831_1540241687.html","title":"Want a Good Cinco de Mayo Celebration? Go To Portland, Oregon","title_page":"Want a Good Cinco de Mayo Celebration? Go To Portland, Oregon  ","title_rss":"NULL","source_domain":"nbcnews.com","text":"But the most \"touching\" part of the festival, according to one of its founders Stephanie Lamberson, is the naturalization ceremony that takes place Monday, May 5th. Portland's Mayor Charlie Hales will be there to welcome the city's newest citizens, who come from all corners of the world.\n“That’s something that’s really special and it’s such a nice and sentimental ceremony,” said Lamberson.\nSo how did Portland, Oregon end up synonymous with Cinco de Mayo?\nIt all goes back to 1983, the year that the Portland Guadalajara Sister City Association (PGSCA) was launched. The volunteer-run organization works on international grassroots and community initiatives that benefit Portland and its sister city of Guadalajara, Mexico.\nOver the last 30 years, the PGSCA has organized medical donations for Guadalajara’s AIDS ministry, sponsored a Guadalajara youth softball team and contributed to a fund so Portland's Department of Environmental Services could assist Guadalajara's recovery efforts after a 1993 gas explosion.\nCinco de Mayo was not widely celebrated at that time. But PGSCA board members, many of them Latino, felt that putting on a celebration would not only raise money for their projects, but would also be a good opportunity for homesick residents of Mexican descent to see some of their culture in Portland.","url":"https://www.nbcnews.com/news/latino/want-good-cinco-de-mayo-celebration-go-portland-oregon-n95831"}
