{"authors":["Stephen Matthews For Mailonline"],"date_download":"2018-10-23 03:00:25","date_modify":"2018-10-23 03:00:25","date_publish":"2017-03-16 13:40:53","description":"University of Gothenberg researchers conducted a trial of Equazen on 154 children. Those given the capsules, which cost just 13p each, showed a 64 per cent improvement in their comprehension.","filename":"data/vaneerConsumption/WantasmartchildGivethemfishoilpills.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E547B3400000578-0-image-a-43_1489671632030.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4320310_Want-smart-child-fish-oil-pills_1540263625.html","title":"Want a smart child? Give them fish-oil pills","title_page":"Want a smart child? Give them fish-oil pills | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Every parent wants their child to achieve their dreams.\nAnd now scientists believe they may have found the magic potion to give them a step up in life.\nChildren who consumed fish oil pills significantly improved their ability to read in just three months, a new trial shows.\nPacked full of omega 3 fatty acids, the Swedish study is the first to confirm that these nutrients can benefit all youngsters.\nChildren given fish oil pills significantly improved their ability to read in just three months, a new trial shows\nUniversity of Gothenberg researchers conducted a trial of Equazen on 154 children who were split into two groups.\nHaving previously been shown to be as effective as Ritalin in children with behavioural problems, the capsules a range of fatty acids.\nHalf received three of the pills, which cost just 13p each, of the powerful fish oil tablet, while the rest were given a placebo.\nA series of computerised reading tests were then conducted to measure the ability of the youngsters.\nThose given Equazen showed a 64 per cent improvement in their overall comprehension. While they were five times quicker at decoding jumbled up words, the study showed.\nLead researcher Dr Mats Johnson said: 'We were a bit surprised to see this level of effect in mainstream children. This has not been shown before.'\n'As a scientist, you always want a second study to confirm your findings, but these are very promising results.'\nThe positive effect of the supplement was confirmed when those given the placebo were also given the capsules.\nIn response to the findings, public health nutritionist Dr Emma Derbyshire said: 'It shows that Equazen is having a great effect on reading scores for mainstream children.\n'A child who is a poor reader is likely to show behavioural problems and an inability to focus on learning tasks two years later.\n'Similarly, children who show early signs of behavioural problems are more likely to develop reading problems.'\nThe research is set to be presented to teachers at an education conference in Birmingham later this month.","url":"https://www.dailymail.co.uk/health/article-4320310/Want-smart-child-fish-oil-pills.html"}
