{"authors":["Lisa Ryan For Dailymail.Com"],"date_download":"2018-10-22 21:15:37","date_modify":"2018-10-22 21:15:37","date_publish":"2016-01-28 07:06:26","description":"The Gallup-Healthways Well-Being Index ranked Hawaii as the state where residents have the highest sense of well-being, followed by Alaska and Montana. West Virginia came in last place.","filename":"data/vaneerConsumption/WanttofeelhappyandhealthyMovetoHawaiiAmericasstatesranked.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AC4DAF00000578-0-image-a-5_1454002347157.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3420422_Want-feel-better-Move-Hawaii-Alaska_1540242937.html","title":"Want to feel happy and healthy? Move to Hawaii: America’s states ranked","title_page":"Want to feel happy and healthy? Move to Hawaii: America’s states ranked  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They key to feeling good has been found - in Hawaii.\nIn a ranking of all 50 states based on residents' sense of well-being, Hawaii took the top spot.\nAlaska came in second - and Montana, Colorado and Wyoming rounded out the rest of the top five.\nBut on the other end of the spectrum, West Virginia was found to be the state with the worst sense of well-being.\nIndiana, Ohio, Oklahoma and Kentucky also ranked poorly on the list.\nHawaii, Alaska, Montana, Colorado and Wyoming have been ranked as the top five states where residents feel a strong sense of well-being, while West Virginia, Kentucky and Oklahoma came in the bottom three. The report asked residents questions about their sense of purpose, relationships, health, finances and more\nHOW THEY WORKED IT OUT The ratings stem from questions to residents, including questions about their relationships, sense of community, financial stress, physical health and sense of purpose.\nDan Witters, research director of the Gallup-Healthways Well-Being Index, told the Associated Press: 'Alaska and Hawaii are both beautiful states in their own way but distinctly different.'\nThe results were included in the State of American Well-Being: 2015 State Rankings Report.\nThe report was compiled from a non-specific telephone survey of residents across the country.\nHawaii has held the number one spot in the report five times since 2008.\nMeanwhile, West Virginia has been last in the rankings for the past seven years.\nThe ratings stem from questions to residents, including questions about their relationships, sense of community, financial stress, physical health and sense of purpose.\nDanny Quan, a taxi company owner and driver in Hawaii, told the Associated Press that he has no complaints about life in the island state - especially since he likes the water and surfs a lot.\nHawaii had the top well-being score - and also the top physical rank. Meanwhile, Alaska had the highest financial rank and Montana had the highest community rank\nMr Quan said: Even if you wake up kind of sad or unhappy, you can just come down to the beach.\n'Or just enjoy the mountains, go hiking or something,'\nBut while Hawaii and Alaska got high marks, Hawaii residents said they still worry about money and housing.\nFurthermore, Alaskans had their own problems as well.\nMany responded negatively when asked if they felt good about their appearance.\nThere was also a gap between the number of respondents who had health insurance and those who didn't have a personal doctor to help them stick to a health plan.\nHowever, the report didn't address Alaska's high rate of suicide.\nMr Witters noted that nearly 12.3 per cent of Alaska adults reported that they were diagnosed with depression at some point in their life.\nThat figure was the second lowest in the survey.\nAnd of those surveyed, 6.4 per cent said they were currently being treated for depression.\nOnce again, that figure was second lowest in the country - right behind Hawaii.\nWhile the survey gives Hawaii and Alaska high marks, it's not all sunshine.\nBut while Hawaii and Alaska got high marks, Hawaii residents said they still worry about money and housing. Pictured here, Waikiki Beach in Hawaii\nThe report didn't address Alaska's high rate of suicide, but Alaska (pictured) had the second lowest rate of depression - right behind Hawaii\nOn a national scale, the sense of well-being has largely remained the same from 2014, according to the report.\nThe well-being score for the US was 6.17 in 2015 - compared to 61.6 in 2014.\nThat slight increase can be attributed to a number of positive national wellbeing trends.\nThose trends include an uptick in financial wellbeing, a declined in the number of people who are uninsured, a decline in smoking, an increase in exercise and decline in food and healthcare insecurity, the report noted.\nAnd, American's life evaluation - which is how they rate and perceive their lives - reached its highest levels yet.","url":"https://www.dailymail.co.uk/health/article-3420422/Want-feel-better-Move-Hawaii-Alaska.html"}
