{"authors":[],"date_download":"2018-10-30 14:08:40","date_modify":"2018-10-30 14:08:40","date_publish":"2018-10-30 14:01:20","description":"Six men are wanted on outstanding warrants by the Gwinnett County Sheriff’s Office on charges including aggravated assault on a law enforcement officer, kidnapping and false imprisonment.","filename":"data/vaneerConsumption/WantedinGwinnettKidnappingassaultsuspectssoughtbysheriff.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/wanted%2010-30.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_wanted-gwinnett-_8488a516644c0a8cbc16e54328b9e68a__1540908520.html","title":"Wanted in Gwinnett: Kidnapping, assault suspects sought by sheriff","title_page":"Wanted in Gwinnett: Kidnapping, assault suspects sought by sheriff","title_rss":"NULL","source_domain":"ajc.com","text":"Six men are wanted on outstanding warrants by the Gwinnett County Sheriff’s Office on charges including aggravated assault on a law enforcement officer, kidnapping and false imprisonment.\nThe department regularly releases wanted posters featuring suspects with active warrants for their arrest. The latest poster was released Friday afternoon.\nREAD | Gwinnett man gets 30 years for drug trafficking, gun charges\nThe suspects are:\n• Leonardo Ramos, wanted on charges of kidnapping and battery\n• Avery Ceasar, wanted on a charge of felony probation violation for aggravated battery\n• Darius Devonne Parker, wanted on charges of felony probation violation for possession of cocaine, possession of a firearm during a crime “and more”\n• Christopher Tamark Arnold, wanted on charges of aggravated assault on a law enforcement officer “and more”\n• Antonio Tyrone McClure, wanted on charges of aggravated assault, theft by shoplifting “and more”\n• Christopher Anthony Riley, wanted on charges of felony probation violation for aggravated assault, false imprisonment “and more”\nAnyone who knows the whereabouts of any of these suspects should call the Gwinnett County Sheriff’s Office at 770-619-6655.\nLike Gwinnett County News on Facebook | Follow us on Twitter and Instagram\nStay up to the minute with breaking news on Channel 2 Action News This Morning","url":"https://www.ajc.com/news/local/wanted-gwinnett-kidnapping-assault-suspects-sought-sheriff/1B8sqQWwvDKoFdvE4YoSTI/"}
