{"authors":[],"date_download":"2018-10-30 18:28:06","date_modify":"2018-10-30 18:28:06","date_publish":"2017-03-29 17:49:00","description":"DeKalb County CEO Mike Thurmond and other local leaders launched DeKalb Works, a program that will provide summer jobs to 330 people ages 14-24.","filename":"data/vaneerConsumption/WantasummerjobPaidinternshipsavailableforDeKalbyouths.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/29/Images/3-29-17%20dekalb%20works-cropped.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_w_9955d72bfc5fe5eeaa6d77ab823ef829__1540924086.html","title":"Want a summer job? Paid internships available for DeKalb youths","title_page":"DeKalb Works summer internship program offers jobs for ages 14-24","title_rss":"NULL","source_domain":"ajc.com","text":"To keep young adults off the streets, DeKalb County’s government is offering them summer jobs that pay $9 an hour.\nDeKalb CEO Mike Thurmond launched the DeKalb Works program Wednesday, which will provide six-week internships to 330 people ages 14 to 24.\nJobs are available in manufacturing, telecommunications, construction, logistics and more.\n“We should not allow people with nefarious ideals — people like gang-bangers and pimps — to be the only people recruiting our young folks for work,” said Thurmond, Georgia’s former labor commissioner, at a press conference.\nDeKalb’s 30.7 percent unemployment rate among people between the ages of 16 and 24 is nearly double the national average of 15.8 percent, according to the county.\n“Gangs are out on our streets, recruiting our young people at a very young people at a very young age,” said DeKalb District Attorney Sherry Boston. “We want to expose these youths to opportunities they may not otherwise see.”\nThe program will place applicants with both private and public sector employers from June 5 to July 14.\nThe program costs $250,000 from DeKalb funds and $450,000 in federal money.\nMore information: DeKalb Works","url":"https://www.ajc.com/news/local-govt--politics/want-summer-job-paid-internships-available-for-dekalb-youths/NlN7GHgqHzqBaPoJVAn1KK/"}
