{"authors":[],"date_download":"2018-10-22 20:40:37","date_modify":"2018-10-22 20:40:37","date_publish":"2014-06-02 18:29:16","description":"A San Francisco media consultant being sought by the FBI for allegedly having explosive materials has an active Twitter account.","filename":"data/vaneerConsumption/WantedPRConsultantPostsApparentSuicideNoteTweets.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_22/480611/140601-ryan-kelly-chamberlain-ii-jms-2238_21e16a7f2e5cc21ab1c60fccc6941273.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_wanted-pr-consultant-posts-apparent-suicide-note-tweets-n120516_1540240837.html","title":"Wanted PR Consultant Posts Apparent Suicide Note, Tweets","title_page":"Wanted PR Consultant Posts Apparent Suicide Note, Tweets","title_rss":"NULL","source_domain":"nbcnews.com","text":"In addition, the sources told NBC News that Chamberlin has family in multiple states so they wanted to cast a broad net. The bet is that he is likely still in Northern California.\nAt a Sunday news conference, FBI spokesman Peter Lee said Chamberlain is wanted in connection for allegedly possessing explosives in his Russian Hill apartment on Polk Street, which were found on Saturday.\nTrying to dispell some rumors, Lee said agents did not find any ricin or other chemical or biological threats in the residence. But, Lee said, \"He did possess explosives at his residence.\"\nAn FBI source told NBC Bay Area that crews found a chemical in the apartment that, if not handled correctly, can kill. The person may have bought the chemical -- which is often used in assisted suicide situations -- on the Internet, according to the source.\nThe FBI declined further comment on the intent or motive behind the explosive material in light of the ongoing investigation.\nChamberlain is 6' 3\" tall, weighs 225 lbs and has blue eyes and brown hair, according to Lee. He was last seen south of San Francisco Sunday, driving a white 2008 Nissan Altima with a California or Texas license plates of either 7FQY085 or BX9M042. The FBI also provided a photo of Chamberlain.\nMark Mosher, creative director of San Francisco consulting firm BMWL, told the San Francisco Chroniclethat Chamberlain was hired by almost every local political consulting firm at one point or another. As recently as Friday, he was chiming in on Mosher's Facebook feed about gun control and mental health.\nChamberlain, a Bay Area native, attended the University of Iowa before embarking on a career as a music journalist in Des Moines, according to his online resume. He later moved to San Francisco, and at age 30, made a bid for a spot on the Republican Party County Central Committee in San Francisco, an organization that governs the local party and doles out critical endorsements.\nThe past chair of the San Francisco Republican Party, Howard Epstein, has confirmed Chamberlain served on the Republican Central Committee in San Francisco before switching over to the Democratic Party.\nEpstein said he was absolutely stunned.\n“To have the explosives and all that is just totally mind-boggling to me,” Epstein said. “Well, I’m hoping that he turns himself in. I hope he doesn’t get into any more trouble. I don’t know what he’s thinking. I don’t know what he’s been doing the last few years, what’s going on in his head. I’m just hoping that this all comes out and nobody gets hurt.\"\nDuring the 2012 NFL season, Chamberlain was an independent contractor for The Chronicle and tweeted and posted links to Facebook to boost coverage for the San Francisco 49ers Insider iPad app, according to the Chronicle.\nMost recently, he worked in public relations for several Bay Area tech, apparel and marketing companies.","url":"https://www.nbcnews.com/news/us-news/wanted-pr-consultant-posts-apparent-suicide-note-tweets-n120516"}
