{"authors":[],"date_download":"2018-10-22 22:49:11","date_modify":"2018-10-22 22:49:11","date_publish":"2014-05-12 19:27:19","description":"America's infrastructure—the backbone of the economy—is producing a lot more high-paying jobs than just shovel-ready construction projects, a report says.","filename":"data/vaneerConsumption/WantaGoodPayingJobHittheInfrastructureSuperHighway.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/437181/140512-140512-roadways-1547_b208be6e6c729e5c5b73eec79cb9e8ff.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/better_careers_want-good-paying-job-hit-infrastructure-super-highway-n103491_1540248551.html","title":"Want a Good-Paying Job? Hit the Infrastructure Super Highway","title_page":"Want a Good-Paying Job? Hit the Infrastructure Super Highway","title_rss":"NULL","source_domain":"nbcnews.com","text":"Get the Better newsletter.\nGood paying jobs are hard to find these days.\nAnd America's infrastructure—the backbone of the U.S. economy—is producing a lot more of them than just shovel-ready construction projects, according to an analysis by the Brookings Metropolitan Policy Program.\nMore than 14 million Americans—1 in 10 workers—builds, operates or maintains the roads, bridges, airports, railways and other infrastructure, the study found. The workforce spans 95 occupations and 42 industries. Those workers are paid better than average, according to the Brookings report.\nRoad construction crew works on a roadway in Springfield, Ill., last month. America's infrastructure—the backbone of the economy—is producing a lot more well-paying jobs than just shovel-ready construction projects, according to the Brookings Metropolitan Policy Program. Seth Perlman / AP\nWorkers in lower-paid infrastructure occupations earn 30 percent more than other sectors. And although some 12 percent hold a bachelor's degree or higher, workers generally need less education to qualify for these jobs, according to the report.\nSince the Great Recession there's been a constant desire to find more and better jobs,\" said researcher Joseph Kane who co-authored the Brookings report. \"These are long-term jobs that have a benefit for the country and the economy beyond just the construction of the structures themselves.\"\nWhile construction jobs are the most visible, they make up only 15 percent of the infrastructure workforce, according to the Brooking analysis. America's transportation network, power plants, water systems and other infrastructure are going to need even more workers over the next decade as the nation's aging infrastructure is repaired and replaced.\nDecades of under-funding has left U.S. highways, bridges, airports, power stations, dams and waste treatment plants in need of a major overhaul. The American Society of Civil Engineers, which gives the country a D+ grade on infrastructure, estimates it will take some $3.6 trillion to bring it up to a passing grade.","url":"https://www.nbcnews.com/better/careers/want-good-paying-job-hit-infrastructure-super-highway-n103491"}
