{"authors":["Associated Press"],"date_download":"2018-10-23 05:13:53","date_modify":"2018-10-23 05:13:53","date_publish":"2016-01-28 21:10:10","description":"ANCHORAGE, Alaska (AP) — If you want to improve your sense of well-being, leave the Lower 48. A new report ranking all 50 states based on residents' sense of...","filename":"data/vaneerConsumption/WanttofeelbetterMovetoHawaiiAlaska.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:91a7714db22f4e1a8732a079cc4f3481-2vdWmEltwXfba0ce28e632caec27-878_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421583_Want-feel-better-Move-Hawaii-Alaska_1540271633.html","title":"Want to feel better? Move to Hawaii, Alaska","title_page":"Want to feel better? Move to Hawaii, Alaska | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Want to feel better? Move to Hawaii, Alaska\nANCHORAGE, Alaska (AP) — If you want to improve your sense of well-being, leave the Lower 48.\nA new report ranking all 50 states based on residents' sense of well-being puts Hawaii at No. 1, followed by Alaska, which held the top spot last year.\nHawaii has been No. 1 in the poll five times since 2008.\nIn this photo taken Tuesday Jan. 26, 2016, Danny Quan smiles while sitting at Ala Moana Beach Park in Honolulu. A new study looking at the five elements of a well ordered life, such as financial security, sense of community and purpose, ranks Hawaii just ahead of Alaska. (AP Photo/Audrey McAvoy)\n\"Alaska and Hawaii are both beautiful states in their own way but distinctly different,\" said Dan Witters, research director of the Gallup-Healthways Well-Being Index.\nMontana, Colorado and Wyoming rounded out the rest of the top five in the State of American Well-Being: 2015 State Rankings report, compiled from a non-scientific telephone survey of residents across the country.\nThe survey listed the bottom five as Indiana, Ohio, Oklahoma, Kentucky and West Virginia, which has been last in the rankings for the past seven years. Kentucky has been No. 49 during the same time.\nThe ratings are compiled from questions to residents related to five areas, with a variety of topics:\n— Purpose (with an example question, do you like what you do each day?)\n— Social (do you have loving relationships?)\n— Community (do you like where you live?)\n— Financial (are you managing your economic life to reduce stress?)\n— Physical (how's your health and energy?)\nHawaii hits the mark for Danny Quan, a taxi company owner and driver who said he likes the water and surfs a lot. He said he has no complaints about life in Hawaii.\n\"Even if you wake up kind of sad or unhappy, you can just come down to the beach. Or just enjoy the mountains, go hiking or something,\" Quan said while gazing at the ocean from Ala Moana Beach Park in Honolulu.\nAcross the Pacific Ocean, in Anchorage's expansive and wooded Kincaid Park, Chad Garner was preparing to go geocaching, a game in which players hide items for others to find using GPS coordinates and clues.\nHe was born in Iowa, graduated from the University of Montana and moved to Alaska eight years ago.\n\"I didn't come here for a job or anything like that,\" he said. \"I just wanted to be here.\"\nHe loves the outdoor recreational opportunities that Alaska offers — fishing, country-country skiing, running, fat-tire biking.\nWhile the survey gives Hawaii and Alaska high marks, it's not all sunshine. Hawaii residents said they worry about money and housing.\nAlaskans had their problems, too. They didn't respond well when asked if they felt good about their appearance. And there was a gap between the number who have health insurance and those who don't have a personal doctor to keep them on a health plan.\nThe study didn't touch on Alaska's high rate of suicide, but Witters noted that about 12.3 percent of Alaska adults reported they have been diagnosed with depression at some point in their life, second lowest in the survey. Of those surveyed, 6.4 percent said they were being treated for depression, also second lowest in the nation, just behind Hawaii.\nKent Terada, a respiratory therapist who works three, 12-hour shifts a week, visits the beach in Honolulu every Monday and Tuesday to surf for a few hours, go for a run and grab a bite to eat. Then he finds a shady tree and strums his ukulele.\n\"It's a pretty good life I must say,\" Terada said. \"Am I supposed to be having this much fun? I'm not sure.\"\nAlexis Will, 32, of Fairbanks said exercise is another important factor for Alaskans.\n\"It seems like people here aren't as timid about going out no matter what the weather, and I think that really brings a good sense of self and place to people,\" she said while walking her dog Kronos, a 2-year-old pure bred German Shepherd, in a downtown Anchorage park while in town for a conference. \"You get to see the subtle changes throughout the year, and find the beauty even if it's raining sideways or negative 40.\"\nAsked if she can imagine living in any other state, she laughed. \"I can, and it's never very nice.\"\n___\nOnline:\nThe full report can be found at: http://is.gd/DvHPno\n___\nMcAvoy reported from Honolulu.\nIn this photo taken Tuesday Jan. 26, 2016, Kent Terada shows the shaka or \"hang loose\" sign while sitting at Ala Moana Beach Park in Honolulu. A new study looking at the five elements of a well ordered life, such as financial security, sense of community and purpose, ranks Hawaii just ahead of Alaska. (AP Photo/Audrey McAvoy)\nIn this photo taken Tuesday Jan. 26, 2016, Kent Terada plays an ukulele while sitting at Ala Moana Beach Park n Honolulu. A new study looking at the five elements of a well ordered life, such as financial security, sense of community and purpose, ranks Hawaii just ahead of Alaska. (AP Photo/Audrey McAvoy)\nIn this photo taken Wednesday, Jan. 27, 2016, Chad Garner poses before going geocaching in Kincaid Park in Anchorage, Alaska. Alaska ranked second behind Hawaii in the State of the American Well-Being report from Gallup and Healthways, which was released Thursday. (AP Photo/Mark Thiessen)\nIn this photo taken Wednesday, Jan. 27, 2016, Alexis Will gives a treat to her dog, Kronos, during a walk through a city park in Anchorage, Alaska. Alaska ranked second behind Hawaii in the State of the American Well-Being report from Gallup and Healthways, which was released Thursday. (AP Photo/Mark Thiessen)","url":"https://www.dailymail.co.uk/wires/ap/article-3421583/Want-feel-better-Move-Hawaii-Alaska.html"}
