{"authors":["Peter Devlin For Daily Mail Australia","Australian Associated Press"],"date_download":"2018-10-22 23:49:54","date_modify":"2018-10-22 23:49:54","date_publish":"2017-03-10 04:44:44","description":"Pauline Hanson has fended off claims her West Australian One Nation team is in disarray after candidate Margaret Dodd quit the party on the eve of the state election.","filename":"data/vaneerConsumption/WAOneNationcandidateMargaretDoddquits.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/05/3E2030C600000578-0-image-a-2_1489123768619.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299954_West-Australian-One-Nation-candidate-Margaret-Dodd-quits_1540252194.html","title":"WA One Nation candidate Margaret Dodd quits","title_page":"WA One Nation candidate Margaret Dodd quits | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"One Nation has lost another candidate just a day out from the West Australian state election.\nCandidate for Scarborough Margaret Dodd, mother of murdered teenager Hayley Dodd, quit the party on Friday and will contest the seat as an independent.\nMs Dodd said she could no longer run with the party as it lacked integrity, honesty and transparency.\nWest Australian One Nation candidate Margaret Dodd (pictured) has quit the party\nCandidate for Scarborough Margaret Dodd, mother of murdered teenager Hayley Dodd, quit the party on Friday and will contest the seat as an independent\n'I am of the opinion that this party is more adherent to a dictatorship than an democratic organisation and lacks principles,' she said in a statement.\n'Pauline Hanson One Nation Party in my eyes are not about the WA people and their future, but for personal power for senator Hanson, who will do and say anything to achieve her goal at whatever cost.'\nMs Dodd, who was a member of the party for four weeks, was criticised by One Nation leader Pauline Hanson for speaking out against the preference deal with the Liberals.\nMs Dodd refused to hand out how-to-vote cards with One Nation's directive, instead telling voters to put the Liberals last.\nSenator Hanson said on Friday morning that she no longer wanted Ms Dodd in the party.\nMs Dodd is the fifth candidate to leave the party during the election campaign.\nPauline Hanson has fended off claims her One Nation team is in disarray after Ms Dodd quit the party on Friday.\nThe Queensland senator has invested a lot of time and effort in WA where she hopes to pick up five seats - two in the lower house and three in the upper house.\nBut the One Nation party has been buffeted by accusations of ageism, disloyalty and controversy over the preference swap deal done with the Liberal party.\nMs Dodd refused to hand out the how-to-vote cards on Saturday and has earned the ire of Senator Hanson.\nSenator Hanson (pictured) said on Friday morning that she no longer wanted Ms Dodd in the party\nMs Dodd refused to hand out the how-to-vote cards on Saturday and has earned the ire of Senator Hanson (pictured)\nHayley Dodd was murdered in 1999 at the age of 17. Her body has never been found\n'She had her own agenda. She was using my name to hopefully get into parliament,' Senator Hanson told the Nine Network on Friday.\n'She's not a team player. I'd rather see the back end of her to tell the truth. I don't want her there.'\nSenator Hanson is confident her team is now united, and said there would be no more disunity.\n'There won't because those people have gone,' she said\n'I believe the candidates we have now are very loyal.\n'We have to have a strong team on the floor of parliament because it's going to be a tough job.'\nHowever Ms Dodd criticised Senator Hanson's attempts to silence her, venting frustration on a social media post.\nSenator Hanson shared a video of protesters at her campaign event on Thursday night, saying it was funny she could 'get so many young people off their phones to protest'.\n'Really Pauline, you are sarcastic,' Ms Dodd wrote.\n'They exercise their right of free speech. Pity you do not support your candidates to have the same right.'\nHayley Dodd was murdered in 1999 at the age of 17. Her body has never been found.","url":"https://www.dailymail.co.uk/news/article-4299954/West-Australian-One-Nation-candidate-Margaret-Dodd-quits.html"}
