{"authors":["Pam Key"],"date_download":"2018-10-30 21:50:21","date_modify":"2018-10-30 21:50:21","date_publish":"2016-03-09 20:18:29","description":"Wednesday on MSNBC's \"Andrea Mitchell Reports,\"  Washington Post political reporter Chris Cillizza, said according to exit polls, Democratic presidential |","filename":"data/vaneerConsumption/WaPosCillizzaExitPollingShowingHillarysHonestyProblemWontGoAway.json","image_url":"https://media.breitbart.com/media/2016/03/chrisC-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_03_09__1540936221.html","title":"WaPo’s Cillizza: Exit Polling Showing Hillary's Honesty Problem ‘Won’t Go Away’","title_page":"WaPo’s Cillizza: Exit Polling Showing Hillary's Honesty Problem ‘Won’t Go Away’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Wednesday on MSNBC’s “Andrea Mitchell Reports,” Washington Post political reporter Chris Cillizza, said according to exit polls, Democratic presidential front-runner Hillary Clinton’s questions regarding her honesty and trustworthiness “won’t go away.”\nDiscussing Bernie Sanders’ success against Clinton, Cillizza said, “Well, so he started your interview exactly how he should have, which is talking about trade and how these trade policies have been so bad for the Midwest in particular, he names Missouri, he names Illinois — those are the places he’s going to focus on. What is bad for them broadly is this means the race is going to go a lot longer. He is likely to win Oregon. He is likely to win Washington state. Wisconsin he is more in the game. Pennsylvania, which is the end of April, he is more in the game and could stay in for. It’s going to, I think, make her weaknesses, and that’s with young people as we found many times in exit polling, that’s with people who prize honest and trustworthiness.”\n“He continues to beat her as he did in Michigan. I’m looking at the numbers here, at 80% for people who prize honesty and trustworthiness,” he continued. “Those problems won’t go away, number one, and they’ll be poked at every time we have a race and have exit polling going forward. So, the delegate math is the delegate math, and she is still ahead comfortably so in that regard, but there are problems for her that will get exacerbated.”","url":"https://www.breitbart.com/video/2016/03/09/wapos-cillizza-clinton-could-lose-more-big-states-honesty-problems-wont-go-away/"}
