{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:53:38","date_modify":"2018-10-30 19:53:38","date_publish":"2015-06-30 14:51:31","description":"The Washington Post called out Sen. Chris Murphy (D-CT) for his \"misleading\" school shooting claims since the Sandy Hook massacre.","filename":"data/vaneerConsumption/WaPoCallsOutSenatorMurphyforExaggeratedSchoolShootingClaims.json","image_url":"https://media.breitbart.com/media/2015/06/Chris-Murphy-school-shootings-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_30__1540929218.html","title":"WaPo Calls Out Senator Murphy for Exaggerated School Shooting Claims","title_page":"WaPo Calls Out Senator Murphy for Exaggerated School Shooting Claims | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On June 29, The Washington Post (WaPo) called out gun control Senator Chris Murphy (D-CT) for his “misleading” and exaggerated claims regarding school shootings since the Sandy Hook Elementary School massacre in Newtown, Connecticut.\nAs recently as June 24, Murphy claimed there has been one school shooting a week since the Newtown attack, and he attempted to support this claim by citing a study from Michael Bloomberg-funded Everytown for Gun Safety.\nBy June 2014, Everytown claimed there had been 74 school shootings since Sandy Hook. By December, that figure was at 100, and by June 2015, it was at 126. But WaPo pointed out that Everytown’s study has been discredited along the way.\nFor example, CNN examined the original claim of 74 and found that “only 15 cases were similar to Newtown.” And when Fact Checker analyzed the latest claim–126 school shootings since Sandy Hook–they noticed that 25 of the incidents “were attempted or committed suicides”–i.e., not school shootings at all.\nAnd in December, Breitbart News reported on Everytown’s claim of 100 school shootings by showing that the list of incidents included non-school shootings and shootings that never even occurred. Moreover, the list contained accidental discharges of firearms that were lawfully on campus and of firearms that were on campus unlawfully–but without ill intent.\nBut in a June 24 speech from the Senate floor, Senator Murphy quoted Everytown numbers to claim a school shooting every week since Sandy Hook.\nWhen asked about relying on an error-filled study like Everytown’s to make such claims, Muphy’s spokesman, Chris Harris, said the Senator’s claims were also the result of his own definition of school shootings–a definition that includes “any and all gunfire in or around the classroom.”\nThis standard certainly does not take into account the difference between purposeful and accidental discharges or suicides, attempted suicides, and actual attacks. It does not examine intent at all or consider whether injuries did or did not result.\nSo the WaPo responded by giving Murphy four Pinocchios–their way of saying he told a “whopper.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/06/30/wapo-calls-out-senator-murphy-for-exaggerated-school-shooting-claims/"}
