{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:46:53","date_modify":"2018-10-30 19:46:53","date_publish":"2015-04-03 02:32:39","description":"The Washington Post has taken to investigating a Breitbart report that established President Obama’s National Security Director for Iran, Sahar Nowrouzzadeh, was previously an employee at the alleged pro-Iranian regime lobbying group NIAC (National Iranian American Council). |","filename":"data/vaneerConsumption/WaPoonIranianLobbyLinkedNSCDirectorNothingToSeeHere.json","image_url":"https://media.breitbart.com/media/2015/03/John-Kerry-HaftSeen-1-HR.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_02__1540928813.html","title":"WaPo on Iranian Lobby-Linked NSC Director: Nothing To See Here!","title_page":"WaPo on Iranian Lobby-Linked NSC Director: Nothing To See Here! | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Washington Post has taken to investigating a Breitbart report that established President Obama’s National Security Director for Iran, Sahar Nowrouzzadeh, was previously an employee at the alleged pro-Iranian regime lobbying group NIAC (National Iranian American Council).\nNowrouzzadeh was listed in a White House brief as being one of a select group of officials who took part in a Tuesday night meeting with President Obama on the ongoing Iran nuclear negotiations. It is believed that this was the first time the White House revealed her position as National Security Council Director for Iran.\nWhite House Conference Call/ March 31, 2015\nThe Washington Post spoke with a White House “senior administration official,” who told the D.C. paper that the 31-year-old had worked for the Defense Department and the State Department before moving to the National Security Council.\nIt remains unclear what qualifies the young National Security Council Director for such an esteemed position, but for the fact that she supposedly has received four awards during her short stint in government service. The Post reports: “She’s received awards from Defense, State, the Office of the Director of National Intelligence and the FBI, we were told.”\n“She interned at NIAC for about a year while she was in college, the official said, noting that there are multiple Iran directors at the NSC,” the report adds.\nBreitbart News has found evidence to contradict the narrative pushed by the “senior administration official” that Nowrouzzadeh’s sole capacity at NIAC was that of an intern. In a 2004 document uncovered by Breitbart News, the NSC Iran Director is referred to as a “staff member” of NIAC.\nIn the spirit of transparency, Breitbart News has asked the White House to reveal the names of the other purported Iran directors at the National Security Council.\n“It didn’t take long for conservative media outlets and Israeli press to notice that she once was at the National Iranian American Council, which those media have for years argued was a lobbying group for the Iranian government,” writes the Post’s Al Kamen.\nWhat Kamen does not mention is that many more groups and individuals other than “conservative media outlets” and “Israeli press” worry the NIAC is a shill for the Ayatollah’s regime.\nFor example, Jeffrey Goldberg of The Atlantic, who has established a close relationship with President Obama, has referred to NIAC president Trita Parsi as someone who “does a lot of leg-work for the Iranian regime.”\nIn a Bloomberg article this week, reporter Eli Lake wrote about the close connections between Javad Zarif, who serves as the regime’s foreign minister, and Parsi. Internal documents, unveiled as a result of the National Iranian American Council’s failed defamation lawsuit against an investigative journalist, revealed that Parsi has had a years-long relationship with Zarif. Lake reported that Zarif and Parsi had teamed up in 2003 in hopes to craft a message (which had no basis in reality) that the U.S. had rejected a peace offer that was made by the Iranian regime.\nIn a Thursday article on how the media is reporting on the Iran talks, Reuters seemingly referred to NIAC representatives as “Analysts sympathetic to the Iranian government.”\nPerhaps even more convincingly, Iranian opposition groups almost unanimously see NIAC as an arm of the regime in Washington, D.C.\nNIAC has in the past attempted to shut down discussion by suing its critics. When Voice of America Persian brought on an Iranian dissident journalists who said unfavorable things about the group, NIAC sued the U.S. government-run agency for defamation.\nThe Washington Post spoke to Parsi in hopes to get an answer from critics who have alleged they work side by side with the regime.\n“Just because we don’t want to bomb Iran doesn’t mean we’re in favor of the regime there,” NIAC President Trita Parsi told the Post, implying that opponents of the Iran deal only seek to bomb Tehran.\nNIAC’s actions this week have proved to contradict the remarks implied by Parsi. This week, photos have surfaced showing the NIAC founder engaged in amiable conversation with the Ayatollah’s delegation, which included Zarif and the brother of Iranian President Hassan Rouhani.\nThe pro-Tehran rhetoric espoused by Parsi has become commonplace since the Swedish and Iranian dual citizen became interested in establishing an Iranian-American “advocacy” group in Washington, D.C.\nJust last week, Parsi wrote a puff piece on Iran’s dictator, Ayatollah Ali Khamenei, which positions him as a reformer who is combating the hardliners in his country. In the eyes of Parsi, the man who holds supreme power over the world’s foremost state sponsor of terror, who occasionally yells “Death to America” and is also a proud Holocaust denier, should now be seen as a tolerant, gentle man who is only seeking to protect his country.\nInstead of asking hard-hitting questions about the National Security Council Iran Director’s past employment at the alleged pro-Tehran group, the Post took the answers from NIAC and the “senior administration official” at face value, without following up on any of the assertions made by the aforementioned actors.","url":"https://www.breitbart.com/national-security/2015/04/02/wapo-on-iranian-lobby-linked-nsc-director-nothing-to-see-here/"}
