{"authors":[],"date_download":"2018-10-30 01:08:11","date_modify":"2018-10-30 01:08:11","date_publish":"2014-11-21 00:00:00","description":null,"filename":"data/vaneerConsumption/WaPoClimateFailonMissouri.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_11_wapo_climate_fail_on_missouri_1540861691.html","title":"WaPo Climate Fail on Missouri","title_page":"WaPo Climate Fail on Missouri","title_rss":"NULL","source_domain":"americanthinker.com","text":"Bump shows a chart of November-October average temperatures in Missouri's third climate division since 1896 from NOAA's National Climatic Data Center, and then claims that the “area has gotten about 0.1 degrees warmer each decade for the past century.”\nIn a hit job on Representative Vicky Hartzler, a Republican from Missouri's 4 th District, Philip Bump at the Washington Post attempts to school Hartzler on the effects of climate change in her state. Except his lunge at climate science fails.\nWrong.\nDon't give in to the optical illusion that the high temperature in 2011-2012 provides to any perceived trends. When we use actual statistical tools (something the Washington Post should be encouraging for all journalists and columnists discussing raw scientific data), we find there is no statistically significant trend in these temperatures since records began in 1896, nor is there a significant trend since 1970, nor during the last three decades.\nAt AT we've been down this road before, where amateur science efforts in the mainstream media just blindly fit regression trend lines to climate time series and then babble on about warming. Once more for the novices: if the regression analysis is not statistically significant, it is inappropriate (read: bad science) to claim there is a trend, since we cannot reject the null hypothesis of no trend with any reasonable degree of confidence (typically p<0.05).\nBump then goes on to claim the following in his attack on Hartzler:\nHartzler's district sits just southeast of Kansas City, Mo. Over the past four decades, Kansas City has gotten about half a degree warmer on average every decade. Kansas City is a city, though, and cities experience something called the 'heat island effect.' All that pavement and concrete tends to exacerbate heating trends, and Kansas City is one of the worst in the country in that regard.\nAnd here are the average annual temperatures since records began in 1889 for the Kansas City area direct from the NOAA National Weather Service database.\nWell, that is an inconvenient truth. There is a declining – not increasing – correlation in average temperatures for Kansas City since the 1800s. Of course, Bump just cherry-picked the period since 1975 in the plot for his article.\nAnd with regard to the “heat island effect” and heating trends for Kansas City that Bump is attempting to communicate something about, it is important to note that back in the 1880s, Kansas City had a population of only 56,000. By 1970, the population had increased to 507,000. It is currently down to 467,000. Good luck rationally explaining the complex trends – which actually trend overall towards cooling, not warming – in average annual temperatures for this region using a population related heat island effect argument.\nAnd then Bump adds a discussion about how climate change will lead to massive increases in the number of “95-degree-plus days” over the next few decades. Using Kansas City as an example, here are the number of 95+ days in the Kansas City climate subregion since 1889.\nThere has been absolutely no trend since records began, nor any significant trend since 1970, nor over the last three decades.\nI checked all the other climate sub-regions in Missouri to make sure this wasn't some anomaly. Sure enough, it isn't. In the Columbia area, there is nearly a statistically significant declining trend in the number of 95+ days since records began in 1890, and no sign of any significant trends since 1970 or over the past 30 years. Same story in the St. Louis region: no significant trends since 1890, 1970, or 1984. In the southern part of the state, where the 95+ days are supposed to increase the most, the correlation since 1970 is actually negative toward fewer extreme heat days, not more – and certainly no significant trend over the past three decades.\nAs for average summertime maximum temperature in Missouri's third climate division since 1896: the correlation is one toward cooling, not warming, during the summer. That applies for the rest of the state as well.\nLooks like Rep. Hartzler would be correct to be skeptical about climate change in her state.","url":"https://www.americanthinker.com/blog/2014/11/wapo_climate_fail_on_missouri.html"}
