{"authors":["Alex Swoyer"],"date_download":"2018-10-30 21:28:01","date_modify":"2018-10-30 21:28:01","date_publish":"2015-05-12 14:12:23","description":"Thirty days into Hillary Clinton's presidential bid she still has not done a formal sit-down interview with national press.","filename":"data/vaneerConsumption/WaPoonClintonSilenceSheNeedsMediaFarLessThanRepublicansDo.json","image_url":"https://media.breitbart.com/media/2015/03/hillary-clinton-befuddled-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_12__1540934881.html","title":"WaPo on Clinton Silence: She Needs Media 'Far Less' Than Republicans Do","title_page":"WaPo on Clinton Silence: She Needs Media 'Far Less' Than Republicans Do | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tuesday marks 30 days since Hillary Rodham Clinton kicked off her official presidential bid, but she still has not done a formal sit-down interview with national press, setting a record for the longest-running presidential candidate not to do so, as first reported by Breitbart News.\nThe Washington Post politics blogger, Chris Cillizza, writes that it is fine for Clinton to avoid the media because she does not need name recognition; she already has it.\nCillizza wrote:\nAs I have written before, Clinton needs the media at this point in the campaign far less than someone like Carly Fiorina does. Clinton is not only universally known but also has a huge primary lead and is ahead of all Republican contenders in general election matchups as well.\nBut a recent survey from New Hampshire voters suggests that Clinton’s media silence may be hurting her poll numbers.\nIn a state where Democrats have led Republicans in the past three elections, “Hillary Clinton trails or is in virtual ties with Republicans Jeb Bush, Rand Paul, Scott Walker, Marco Rubio and Ted Cruz, the poll of 706 randomly selected adults shows,” reported WMUR.\nAll six official GOP presidential candidates have appeared on major networks, conducting national interviews and answering reporter questions off the cuff–a stark contrast to the Clinton campaign’s preselected roundtable discussions with voters, and few–if any–reporters.\nFor example, in just eight days since their official campaign launches, both Dr. Ben Carson and Carly Fiorina have tallied hundreds of press questions.\nXavier Underwood, spokesman for Dr. Ben Carson, said that since his official launch in Detroit last Monday, Carson has answered hundreds of reporter questions.\n“More than we can count–hundreds,” Underwood told Breitbart News.\nFiorina has also been on what CNN coined a “media blitz,” introducing herself to voters.\n“Carly has actually answered 322 questions since her announcement on Monday,” said Anna Epstein, spokesperson for Fiorina. “In the last eight days, Carly has been interviewed almost 30 times and answered well over 300 questions.”\nSen. Rand Paul appeared on NBC’s Today Show the morning after he launched his presidential run, answering questions off the cuff from Savannah Guthrie. In addition, Paul, Sen. Ted Cruz, and Sen. Marco Rubio appeared on Fox News with Sean Hannity following their official presidential campaign launches. And Gov. Mike Huckabee joined Megyn Kelly on Fox News the evening of his official launch.","url":"https://www.breitbart.com/politics/2015/05/12/wapo-on-clinton-silence-she-needs-media-far-less-than-republicans-do/"}
