{"authors":["Jerome Hudson"],"date_download":"2018-10-30 18:24:54","date_modify":"2018-10-30 18:24:54","date_publish":"2015-12-29 04:29:50","description":"A Washington Post investigation says that \"white police officers killing unarmed black men\" is less than 4% of all \"fatal police shootings.\"","filename":"data/vaneerConsumption/WaPoWhiteCopsKilledUnarmedBlackMenLessThan4oftheTimein2015.json","image_url":"https://media.breitbart.com/media/2014/12/police-tape-crime-scene-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_12_28__1540923894.html","title":"WaPo: White Cops Killed 'Unarmed Black Men' Less Than 4% of the Time in 2015","title_page":"WaPo: White Cops Killed 'Unarmed Black Men' Less Than 4% of the Time in 2015 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A year-long Washington Post investigation revealed that the high-profile deaths that spark so much media and activist attention — “white police officers killing unarmed black men — represent less than 4 percent of fatal police shootings.”\n“The great majority of people who died at the hands of the police fit at least one of three categories: they were wielding weapons, they were suicidal or mentally troubled, or they ran when officers told them to halt,” the Post’s report found.\nDespite the wall-to-wall press coverage in response to cases that garner a “White Cop Kills Unarmed Black Person” headline, the Washington Post’s study contradicts the prevailing narrative behind the idea that racism is the cause of a disproportionate amount of black people being gunned down by police.\nIn all, the report found that 1 in 10 people killed by police were unarmed.\nMore than 80 percent of the victims were armed with objects that could cause death or severe injuries, ranging from knives to machetes to automobiles.\nOver 75 percent of the fatal police-involved shootings were in direct response to a violent suspect wielding a deadly weapon, according to the Post’s report.","url":"https://www.breitbart.com/the-media/2015/12/28/wapo-white-cops-killed-unarmed-black-men-less-4-time-2015/"}
