{"authors":["Izzy Ferris For The Daily Mail"],"date_download":"2018-10-22 21:35:33","date_modify":"2018-10-22 21:35:33","date_publish":"2016-01-11 00:59:16","description":"Fans watched on in horror as Prince Andrei Bolkonsky was violently stabbed in the side, causing him to collapse on the floor and appear dead, before he made a triumphant return.","filename":"data/vaneerConsumption/WarandPeacesJamesNortonmakesacliffhangingcomeback.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001E10600000578-0-image-a-2_1452475715004.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393172_Alive-War-Peace-heart-throb-makes-cliffhanging-comeback-Prince-Andrei-Bolkonsky-recovers-stabbing-time-witness-birth-child_1540244133.html","title":"War and Peace's James Norton makes a cliffhanging comeback","title_page":"War and Peace's James Norton makes a cliffhanging comeback | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"With his chiselled cheek bones and smouldering good looks, James Norton has quickly become War and Peace’s heartthrob.\nBut women across the country were in for a traumatic watch last night as viewers of the show were led to believe that his character had been killed.\nFans watched on in horror as Prince Andrei Bolkonsky dismounted his horse, picking up the standard, before charging at the French, during the second episode of the programme.\nScroll down for video\nFans watched on in horror as Prince Andrei Bolkonsky dismounted his horse and charged at the French during last night's episode of War and Peace. Viewers were shocked to see him stabbed in the side, appearing dead\nWith viewers believing the young prince was dead, just minutes from the end of the episode he stepped out of a carriage alive and well - arriving just in time for the birth of his child (pictured). However, tragically his wife dies\nJust seconds after his heroic efforts begin, halfway through the episode, the handsome Prince is violently stabbed in the side, causing him to collapse on the floor.\nHis blooded body remains amongst hundreds of dead Russians, with French troops commenting: ‘He looks like a fine young man. Good way to die, carrying the standard.’\nThe young prince’s heartbroken family even receive a letter telling them he is presumed dead, though his name has not yet appeared amongst the deceased.\nBut just minutes from the end of the episode, his sister, Princess Marya Bolkonskaya, spots a horse-drawn carriage arriving at the driveway of their home.\nNikolai Rostov appeared on horseback in the second episode of last night's BBC drama, War and Peace\nPrince Andrei struts his stuff in War and Peace during an episode which saw him almost killed off after heroics\nThe family, and no doubt swooning female viewers, were delighted when the Prince steps out of the carriage very much alive and seemingly uninjured.\nHe arrived just in time for the birth of his child, though tragically his wife, Lise Bolkonsky, passes away during childbirth.\nBased on Leo Tolstoy’s novel, War and Peace, the story is one of love, loss and politics among the Russian aristocracy, all set against a backdrop of the Napoleonic Wars.\nIt is this conflict that provided much of the drama for episode two, which was shown on BBC One last night.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393172/Alive-War-Peace-heart-throb-makes-cliffhanging-comeback-Prince-Andrei-Bolkonsky-recovers-stabbing-time-witness-birth-child.html"}
