{"authors":["Aditi Prakash"],"date_download":"2018-10-23 00:58:41","date_modify":"2018-10-23 00:58:41","date_publish":"2017-03-16 10:35:07","description":"Burnley have the perfect chance to get their first away win in the league and end a five-game winless streak when they face bottom-placed Sunderland on Saturday, Stephen Ward has said.","filename":"data/vaneerConsumption/WardhopesBurnleycanwinfirstPremierLeagueawaygame.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E3371BB00000578-0-image-a-9_1489660057309.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319538_Ward-hopes-Burnley-win-Premier-League-away-game_1540256321.html","title":"Ward hopes Burnley can win first Premier League away game","title_page":"Ward hopes Burnley can win first Premier League away game | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Burnley have the perfect chance to get their first away win in the Premier League and end a five-game winless streak when they face bottom-placed Sunderland on Saturday, defender Stephen Ward has said.\nBurnley, who are 12th in the league, have drawn twice and lost 12 times in 14 away league games this term. Seven of these losses have come by a one-goal margin including their 2-1 loss to Liverpool last weekend.\n'They will be well up for the game and have probably earmarked this one as a game they need to win to give themselves a good chance,' the 31-year-old Ward told the club's website.\nStephen Ward and his Burnley team-mates take on Sunderland away in the league on Saturday\nBurnley will hope to get their first away league win against bottom-placed Sunderland\nThe two sides have met twice this season with Burnley winning at home 4-1 in the league before drawing away from home in the FA Cup and winning the following second leg at home.\n'We performed very well up there in the FA Cup game,' Ward added. 'I feel if we an go with the same attitude, mentality and performance level we had at Anfield last Sunday, we will give ourselves a good chance of picking up something from the game.\n'We have lost a couple on the bounce now and had a couple of draws, so we need to get back to winning ways as soon as possible and hopefully we can do that this Saturday.'","url":"https://www.dailymail.co.uk/sport/football/article-4319538/Ward-hopes-Burnley-win-Premier-League-away-game.html"}
