{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 02:11:35","date_modify":"2018-10-23 02:11:35","date_publish":"2017-04-26 13:08:55","description":"A traffic warden was allegedly spotted putting a ticket on a car in Folkestone, Kent, while the elderly driver was 'slumped over unconscious' inside the vehicle.","filename":"data/vaneerConsumption/WardentriestoticketcarwithUNCONSCIOUSdriver.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9FAF9700000578-0-image-a-22_1493209971046.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447432_Warden-tries-ticket-car-UNCONSCIOUS-driver_1540260695.html","title":"Warden ‘tries to ticket car with UNCONSCIOUS driver’","title_page":"Warden ‘tries to ticket car with UNCONSCIOUS driver’ | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A traffic warden has been spotted putting a parking ticket on a car which had an 'unconscious' elderly man inside.\nA horrified onlooker called an ambulance while the parking attendant continued to write out the fixed penalty notice for stopping on a yellow line.\nSouth East Coast Ambulance Service confirmed they were called to the scene in Folkestone, Kent, to reports of a man 'in need of medical attention'.\nA traffic warden allegedly put a ticket on a car in Folkestone, Kent, while the elderly passenger 'was unconscious inside', pictured\nWitness Raoul-Roman Wilson, 38, said he was walking home when he spotted the 'shocking' scene.\nHe said: 'I was with my daughter and we saw the parking attendant standing about 10 feet away from the car.\n'He was on his device and putting in the details for a ticket.\n'As I got closer I realised there was someone in the car, it was an elderly gentleman, in his 80s I would say.\n'He was barely moving and seemed to be trying to get his hand to open the door. But the traffic warden did nothing.\nWitnesses said the warden, pictured, 'did nothing' to help the man while an onlooker called an ambulance\n'Another man stopped and saw the elderly man in the car and called an ambulance.'\nMr Wilson said the elderly gentleman was nearly completely motionless in the vehicle.\nHe said: 'The man was clearly suffering. He wasn't talking and moving slowly.\n'We were saying to the warden \"why didn't you call an ambulance? Why don't you do something?\" and he said nothing.\n'The ambulance arrived a little while later and once they were given permission, they broke the window and checked on him.\n'I've been thinking about it ever since and I just can't believe he left him.\n'The car was left there for at least half an hour and on double yellows. He was doing his job. No quibbles there.\n'But he could have approached the car and at least looked inside. It's the fact that he didn't do anything.\n'I understand him not letting us break the window but it was still frustrating.'\nA spokesman for the South East Coast Ambulance Service said: 'We were called at around 6pm to reports of a man in need of medical attention in a car near the Guildhall pub.\n'Two ambulances attended the scene and checked him over but he was discharged from our care at the scene.'\nSouth East Coast Ambulance Service said it attended the scene and 'checked over' the man, pictured in the vehicle, but discharged him at the scene. Shepway District Council denied a parking ticket was issued and said the warden 'would not do so in a situation like this'\nPolice also attended the incident following reports of a 'vulnerable man' who appeared to be unresponsive.\nRaoul-Roman added: 'When you see someone has a uniform on - I know he's not a police officer or a firefighter - but there must be a protocol for when an emergency happens. Is he meant to just carry on as normal?'\nA spokesman from Shepway District Council said: 'Traffic enforcement officers are trained to call the appropriate emergency services if they find a driver in difficulty.\n'In this case, the officer had not initially seen the person in the car and by the time he had, an ambulance had already been called.\n'The parking enforcement officer did not issue a parking ticket and would not do so in a situation like this.'","url":"https://www.dailymail.co.uk/news/article-4447432/Warden-tries-ticket-car-UNCONSCIOUS-driver.html"}
