{"authors":["Dennis Lynch","The Real Deal"],"date_download":"2018-10-31 00:10:11","date_modify":"2018-10-31 00:10:11","date_publish":"2018-07-12 00:00:00","description":"Warehouse availability dropped 7.2% in the second-quarter, and it's at the lowest level since the dot com boom.","filename":"data/vaneerConsumption/Warehousesarerunningoutofspace.json","image_url":"https://amp.businessinsider.com/images/5b47abe054400f1a008b48aa-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_warehouses-are-running-out-of-space-2018-7_1540944611.html","title":"Warehouses are running out of space","title_page":"    Warehouses are running out of space - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty\nWarehouse space is at its tightest level since the first dot-com boom, and it's driving tons of business.\nThe second quarter saw availability fall to 7.2 percent, the lowest level since 2000, as demand continues to outpace supply, according to CBRE data first reported by the Wall Street Journal. Availability has now dropped for a record 32 straight quarters.\nExperts largely attribute the fall-off to growing demand for space as e-commerce grows. That's prompting some owners to expand the scope of their operations, including by adding so-called last-mile delivery operations to their properties.\nThe demand is driving prices to record highs, particularly for distribution centers in urban areas. Los Angeles' South Bay submarket, an industrial hub near the Ports of Los Angeles and Long Beach and Los Angeles International Airport, is seeing rental and sale prices for Class B properties rise to Class A levels as tenants and investors jostle to get a foot in the door.\nThe average price per square foot in New York has grown as by as much as 81 percent in some areas. Nationally, industrial sales volume by dollar amount has doubled since 2012, according to data from PwC and the Urban Land Institute.\nThe tight warehouse market has produced strong returns for industrial real estate investment trusts. Last year returns for REITs were 24 percent, higher than the single-digit returns in other sectors.\nBlackstone has taken notice and spent more than $10 billion buying industrial REITs and properties, including a $7.6 billion purchase of Gramercy Property Trust.\nBut not everyone is hot on industrial. Sam Zell, the notorious doomsayer, vulgar septuagenarian, and Equity International founder, thinks that developers are building too much and that it will outpace demand.","url":"https://www.businessinsider.com/warehouses-are-running-out-of-space-2018-7"}
