{"authors":[],"date_download":"2018-10-22 22:59:44","date_modify":"2018-10-22 22:59:44","date_publish":"2014-06-11 13:52:02","description":"“I would never sign any document or make any agreement, agree to any decision, that I did not feel was in the best interests of this country.”","filename":"data/vaneerConsumption/WarIsaDirtyBusinessHagelDefendsBoweBergdahlSwap.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/503191/140611-chuck-hagel-jms-1547_f65914e1b309aab7e68c5085ee4ac7ff.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_war-dirty-business-hagel-defends-bowe-bergdahl-swap-n128356_1540249184.html","title":"'War Is a Dirty Business': Hagel Defends Bowe Bergdahl Swap","title_page":"'War Is a Dirty Business': Hagel Defends Bowe Bergdahl Swap","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDefense Secretary Chuck Hagel told Congress on Wednesday that the trade of five Taliban detainees for Sgt. Bowe Bergdahl represented “our last, best opportunity to free him” and complied with both the law and the fundamental values of the military.\nAs the handoff drew near, American officials were concerned for the soldier's health and were increasingly worried that a leak would derail the deal, Hagel told the House Armed Services Committee.\nSign up for breaking news alerts from NBC News\nHagel made no secret that wars necessitate uncomfortable decisions.\n“War is a dirty business,” he said. “And we don’t like to deal with those realities, but realities they are.”\nDeaths after Bergdahl capture\nMembers of Bergdahl’s platoon have said that as many as eight soldiers died in the search for Bergdahl after he disappeared from his outpost in Afghanistan in June 2009. But Hagel said he had reviewed reports and asked inside the Pentagon and found no connection between the hunt for Bergdahl and combat deaths.\n“In the Army, in all of our reports, I have seen no evidence that directly links any American combat death to the rescue or finding or search of Sgt. Bergdahl,” he said.\nA review by The New York Times pointed out that fighting was intense all over Afghanistan at the time and that insurgents had targeted Paktika province, where Bergdahl was, for years.\nAt the House hearing, the committee chairman, Rep. Buck McKeon, R-Calif., said that the trade had set “a dangerous precedent in negotiating with terrorists.”\n“It reverses longstanding U.S. policy and could incentivize other terrorist organizations, including al Qaeda, to increase their use of kidnappings of U.S. personnel.”\nHagel responds to criticism of trade\nThe trade has been attacked on three fronts: Fellow soldiers have accused Bergdahl of desertion, members of Congress are outraged that they were not told ahead of time, and some critics have said the five Taliban detainees were too dangerous to free.\nHagel, in an opening statement, defended the deal on all three counts.\n“I want to make one fundamental point,” he said. “I would never sign any document or make any agreement, agree to any decision, that I did not feel was in the best interests of this country.”\nOn Bergdahl’s record, Hagel said that questions about the soldier’s conduct before he was captured by the Taliban in 2009 are separate from the military’s determination to recover any American service member held in captivity.\n“This pledge is woven into the fabric of our nation and our military,” he said.\nOn the failure to notify Congress, Hagel said that a Taliban video analyzed by U.S. officials in January showed the Bergdahl’s health was “poor and possibly declining,” and he said that a leak could have torpedoed the deal.\n“The exchange needed to take place quickly, efficiently and quietly,” he said. “We believed this exchange was our last, best opportunity to free him.”\nAnd on the five Taliban detainees, he said that the risk they posed was “substantially mitigated.” He also said that the government had no basis to prosecute them in a civilian or military court.\nTesty exchange\nRep. Jeff Miller, R-Fla., demanded to know why Bergdahl had yet to be returned to the United States. He is recovering at an American military hospital in Germany.\n“You’re trying to tell me,” he said, “that’s he’s being held in Landstuhl, Germany, because of his medical condition?” Miller said.\n“Congressman, I hope you’re not implying anything other than that,” Hagel said. “This isn’t just about a physical situation, Congressman. This guy was held for almost five years in God knows what kind of conditions. … This is not just about can he get on his feet and walk and get to a plane.”\nRepublicans on the committee repeatedly asked whether the administration had “negotiated with terrorists” to get Bergdahl back.\nA Democrat, Rep. Adam Smith of Washington, said that the administration only negotiated with the Taliban, not with the Haqqani network, the militant group that held Bergdahl. Hagel also said repeatedly that the negotiations were conducted through Qatari mediators. The defense secretary said he did not know the exact relationship between the Taliban and the Haqqani network.\nQatar has pledged to monitor the released Taliban detainees for a year. Hagel said he was satisfied that they could be tracked effectively, but he said he could only offer details at a later classified hearing in front of the committee.\nHagel also said that he was “offended and disappointed” by the demonization of Bergdahl’s family in Idaho.\n“No family deserves this,” he said. “I hope there will be sober reflection on people’s conduct regarding this issue and how it relates to the Bergdahl family.”\nMcKeon said that Hagel had made a “very strong case” for the president’s decision, but he noted that negotiations for Bergdahl’s release had begun in January. He said there was no reason Congress shouldn’t have been notified.\n“I don’t think we would have pushed back at all,” he said.","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/war-dirty-business-hagel-defends-bowe-bergdahl-swap-n128356"}
