{"authors":["Associated Press"],"date_download":"2018-10-23 03:19:17","date_modify":"2018-10-23 03:19:17","date_publish":"2016-01-29 18:08:55","description":"DESTNE, Czech Republic (AP) — The Sedivackuv Long, one of the toughest dog sled races in Europe, has been cut short by warm weather. The 20th edition began W...","filename":"data/vaneerConsumption/WarmweathercutsshorttoughCzechdogsledrace.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:13926f70d8d84689ba8c3402304c2584-4PuZeKVXE7cd9005b2c876cfc3a8-971_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422892_Warm-weather-cuts-short-tough-Czech-dogsled-race_1540264757.html","title":"Warm weather cuts short tough Czech dogsled race","title_page":"Warm weather cuts short tough Czech dogsled race | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Warm weather cuts short tough Czech dogsled race\nDESTNE, Czech Republic (AP) — The Sedivackuv Long, one of the toughest dog sled races in Europe, has been cut short by warm weather.\nThe 20th edition began Wednesday with more than 100 mushers and 700 dogs from eight countries competing in what was expected to be deep snow and freezing conditions in the Orlicke Mountains, a range in the northeastern Czech Republic that forms the border with Poland. In the three-day race — part of the European extreme dog sled race series — competitors were expected to cross 240 kilometers (149 miles) and spend one night sleeping out in the snow.\nYet temperatures on the first day of the race were well above zero Celsius (32 degrees Fahrenheit) and things just got worse on Thursday. The course was a soupy mess of slushy ice and fog in the higher elevations, and portions of the lower course had no snow at all after an afternoon rain Thursday washed it away.\nIn this photo taken on Wednesday, Jan. 27, 2016, a musher competes with his dogs during the Sedivackuv Long dog sled race near the village of Destne v Orlickych horach, Czech Republic. The 240 Km (150 miles) race is a multi-day event, but was canceled today, two days early, because of poor snow conditions in the region. (AP Photo/Petr Josek)\nAs a result, the organizers cut the race short Thursday night due to a lack of snow for the first time in 20 years after only 96 kilometers (60 miles).\n\"An entire year of preparations and the work of the team was washed away today by the rain,\" said race organizer Pavel Kucera.\nIn this photo taken on Wednesday, Jan. 27, 2016, a musher competes with his dogs during the Sedivackuv Long dog sled race near the village of Destne v Orlickych horach, Czech Republic. The 240 Km (150 miles) race is a multi-day event, but was canceled today, two days early, because of poor snow conditions in the region. (AP Photo/Petr Josek)\nIn this photo taken on Wednesday, Jan. 27, 2016, dogs wait for the start of the Sedivackuv Long dog sled race near the village of Destne v Orlickych horach, Czech Republic. The 240 Km (150 miles) race is a multi-day event, but was canceled today, two days early, because of poor snow conditions in the region. (AP Photo/Petr Josek)\nIn this photo taken on Wednesday, Jan. 27, 2016, a musher competes during the Sedivackuv Long dog sled race near the village of Destne v Orlickych horach, Czech Republic. The 240 Km (150 miles) race is a multi-day event, but was canceled today, two days early, because of poor snow conditions in the region. (AP Photo/Petr Josek)","url":"https://www.dailymail.co.uk/wires/ap/article-3422892/Warm-weather-cuts-short-tough-Czech-dogsled-race.html"}
