{"authors":["Tom Witherow For The Daily Mail"],"date_download":"2018-10-23 01:15:22","date_modify":"2018-10-23 01:15:22","date_publish":"2017-04-26 11:25:56","description":"One student event in Handsworth, Birmingham, was so overloaded with people that the floor collapsed beneath them and 100 guests crashed into the basement below.","filename":"data/vaneerConsumption/Warningoverdrugfuelledstudentsuperparties.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/13DBD12300000514-0-image-a-45_1493200986783.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447038_Warning-drug-fuelled-student-super-parties_1540257322.html","title":"Warning over drug-fuelled student 'super parties'","title_page":"Warning over drug-fuelled student 'super parties' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A new wave of drug-fuelled student 'super-parties' could result in a 'perfect storm' of mass casualties, officials warned yesterday.\nThe events are organised through social media, and often unofficially sponsored and promoted by drinks companies.\nThey can have bouncers on the door, a DJ and even professional photographers - but authorities say they fear for the safety of the hundreds of students who attend.\nThe drug-fuelled student 'super-parties' are organised through social media, and often unofficially sponsored and promoted by drinks companies (file picture posed by models)\nTerraced houses built for families are the favoured venues for the mini-nightclubs, and as many as 300 people are cramming inside before exits are blocked with sofas and mattresses to muffle noise.\nAlongside the risk of building collapse and fire, students are taking the strongest versions of Ecstasy to flood the country since the 1990s.\nDrug counselling service Lifeline says students, many from 'privileged' backgrounds, are now turning to them for help with problems related to the Class A drug.\nThe 'super-party' phenomenon took off across Britain's universities last year and is now considered the norm for undergraduates, who turn their homes into nightclubs rather than visiting licensed venues.\nOne student event in Handsworth, Birmingham, was so overloaded with people that the floor collapsed beneath them and 100 guests crashed into the basement below. Police said it was a 'miracle' that no-one was seriously injured.\nThere have also been a raft of huge parties that have hit the headlines after police were called out late to shut them down.\nOne notorious bondage-themed party was shut down in Jesmond, Newcastle, after 250 scantily dressed party-goers took over a terraced student house.\nEven after police came to take sound readings and calm the rave down, 100 revellers carried on until 9.30am in the morning.\nThe parties can have bouncers on the door, a DJ and even professional photographers - but authorities say they fear for the safety of students who attend (file picture posed by models)\nPictures show students' attempts to tape mattresses to the wall to sound-proof the event, while a professional bouncer manned the front door.\nPolice said afterwards: 'The music was very loud. It was very noisy, with a large number of people inside.'\nEmergency services, council officials and drug charities in Newcastle came together yesterday to highlight the problems that the super-parties pose.\nThe parties are attracting sponsorship from drinks giants through interaction with student promoters, who spread the word through social media platforms such as Facebook and Snapchat, it was claimed.\nA dating site last year even offered £2,000 towards a house party to the group of female students who arranged the most downloads of its app.\nA student news website called The Tab, which runs in 40 universities across the country, has publicised the events.\nLast October it ran an article headlined 'Inside the biggest house parties across the country this term', featuring student parties in Manchester, Newcastle, York, Bristol and Cardiff.\nThey were rated on the number of people who turned up, their fancy dress themes and the number of visits each received from the police throughout the night.\nStudents are not just taking risks in residential streets. Last month 200 of them held an illegal rave in a festering Newcastle sewer.\nA sound system, petrol generator and lighting were carried through three-feet of water into the area under a bridge next to the River Ouseburn.\nOne notorious bondage-themed party was shut down in Jesmond, Newcastle, after 250 scantily dressed party-goers took over a terraced student house (file picture)\nPolice condemned the party, saying it would have been impossible for emergency services to get to potential casualties.\nThe authorities called yesterday at Newcastle Civic Centre for students at the city's two univesities to call a halt to the potentially disastrous gatherings.\nThey have produced videos pointing out the dangers, which will be posted on social media channels aimed at students.\nNewcastle City Council has had 136 large scale parties reported to it since last September.\nTracy McCann, the council's lead practitioner for anti-social behaviour, said: 'It started at the end of the exam period last year when we began getting calls about very large scale parties with sometimes hundreds of people attending.\n'There were security men on the doors and the exits were being blocked with sofas and mattresses. The parties were being widely promoted on social media.\n'Across the country it has become the way students choose to party. They don't want to spend their money going out to clubs when, in their eyes, they can do it their own way at home.\n'But the dangers from so many factors are obvious and we are acting before we have a mass casualty incident to deal with.'\nJade Makarski, a firefighter with Tyne and Wear Fire Brigade, said it was common for nitrous oxide, or laughing gas to be used at the parties, which is highly explosive.\nShe said: 'If there was a fire it would blow up, it would take out the walls, the floor, the whole thing would come down.\n'The exits are being blocked so that means we can't get inside to get water on the fire which hugely increases the likelihood of fatality.\n'We are also talking about floorboards designed for family use which have tonnes of pressure on them so there is a great danger of collapse.'\nAssistant Chief Fire Officer Alan Robson added: 'These parties are a recipe for disaster, they create a perfect storm.'\nClaire Dean, of Lifeline, said Ecstasy, also known as MDMA, is being supplied at the parties at a strength not seen in Britain since it was first introduced in the early 1990s.\nShe added: 'There has been a huge increase in the use of MDMA in students and it is the strongest that has been available in two decades, there has been a shift in the purity of the drug and it is being mass produced that way.\n'It is a danger to promising student careers, these drugs in the strength we are now seeing have a four-day come down period, these kids are walking around like glass unable to function.\n'At some universities - Newcastle being one of them - the students often come from quite privileged backgrounds so they have loads of money to spend.'","url":"https://www.dailymail.co.uk/news/article-4447038/Warning-drug-fuelled-student-super-parties.html"}
