{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:13:34","date_modify":"2018-10-30 22:13:34","date_publish":"2016-07-01 17:39:49","description":"On June 30 lawmakers declared war on the 2nd Amendment by giving final approval to a body of gun control legislation known as \"gunpocalypse.\"","filename":"data/vaneerConsumption/Waron2ndAmendment.json","image_url":"https://media.breitbart.com/media/2016/01/Come-and-Take-it-Flag.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_07_01__1540937614.html","title":"War on 2nd Amendment","title_page":"California Passes 'Gunpocalypse': War on 2nd Amendment","title_rss":"NULL","source_domain":"breitbart.com","text":"On June 30 lawmakers declared “full-blown war” on the Second Amendment by giving final approval to a body of gun control legislation known as “gunpocalypse.” It now sits on Governor Jerry Brown’s desk.\nMoreover, Brown is scheduled to leave the state on Saturday, so there is a real possibility he could act on the legislation by Friday, July 1.\nBreitbart News previously reported that the legislation includes background checks for ammunition purchases, and a statewide ban on the possession of ammunition magazines larger than the 10-round round magazines that mass shooter Elliot Rodger used to carry out his May 2014 attack near Santa Barbara.\nAccording to the Firearms Policy Coalition, the bills break down this way:\nSB 880: Bans common and constitutionally protected firearms that have magazine locking devices.\nSB 894: Re-victimizes victims by criminalizing the failure to report lost and stolen firearms.\nSB 1235: Now competes with Gavin Newsom’s Safety for All Act/Ammo Ban [by enacting ammunition background checks].\nSB 1446: Confiscation of lawfully acquired, standard capacity ammunition feeding devices.\nAB 857: Forced “Ghost Gun” registration.\nAB 1135: Bans common and constitutionally protected firearms that have magazine locking devices.\nAB 1511: Bans the loaning of firearms.\nAB 1673: Redefines “firearms” to include items that are not firearms.\nAB 1674: Bans buying more than one firearm within a 30-day period.\nAB 1695: Makes some non-violent misdemeanors punishable by prohibitions on owning firearms.\nAB 2607: Dramatically expands who can request a Gun Violence Restraining order.\nIn reality, “gunpocalypse” represents a total shift from the paradigm that holds gun ownership as an unalienable right to a more post-modern view of gun ownership as a privilege bestowed — or revoked — by government in degrees.\nLt. Governor Gavin Newsom has also proposed a competing ballot measure for November that would require background checks for all ammunition purchases in the state.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2016/07/01/gunpocalypse-passes-now-sitting-governor-browns-desk/"}
