{"authors":[],"date_download":"2018-10-30 14:07:20","date_modify":"2018-10-30 14:07:20","date_publish":"2018-10-30 00:01:10","description":null,"filename":"data/vaneerConsumption/WarontheJewsAgain.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/10/BurningBush2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540908440.html","title":"War on the Jews - Again","title_page":"War on the Jews — AgainThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"So: once more the Jews — targets of unreasoning hatred.\n“Unreasoning,” in that the irrationality, like the barbarity, of attacking the Jews should be patent to anyone with half a brain cell switched on.\nThe Jews’ contributions to civilization and civility are of the highest order, taking into account — or not, whichever you like — their crucial participation in the making-known of God to humanity.\nHatred of the Jews — a hatred deep enough to precipitate the Pennsylvania synagogue massacre of last Saturday — seems a constant in human affairs. So deep and bitter a hatred as to call into question the petty policy debates in which humans engage as to the means of preventing 21st century violence.\nThere is first and foremost, in 21st century terms, the question of which — if any — restrictions to place on the ownership and use of which rifles and pistols. There is the question of whether heated political rhetoric, especially if it comes from Fox News or the Trump White House, stirs up violence. The New York Times and the Washington Post specialize in giving a big “Yes!” to the proposition.\nA better idea than reading the newspapers is reading history. The violence of the 21st century — including the unique violence perpetrated against Jews — is a speck on the 20th century’s achievements in that line: two global wars and the temporary triumphs of Nazism and communism. The synagogue gunman in Pennsylvania, Robert Bowers, is a piker compared with any SS oberleutnant whose name you might come across in trying to understand what’s wrong with us.\nWhat’s wrong with us indeed? The trouble with the Third Reich wasn’t loose gun control laws. The trouble wasn’t — obviously — Twitter and Facebook and Jeanine Pirro. Surely the trouble can’t be the Jews. The Jews have offended against human society by doing exactly… what? There is nothing to point to, any more than one can point to the collective offenses of the Irish, apart from their habit of tying up traffic on St. Patrick’s Day.\nWhat about plain old “evil” as the culprit? You can’t perhaps call evil plain, but you can certainly call it old: an inherited encumbrance, known, castigated, for centuries. Could there really, truly be a devil, a master of evil, strewing banana peels along the human pathway, luring folk high and low into wrongdoing — such as hating, not to mention slaughtering, Jews?\nWe formerly, as a culture, as a society, believed in the powers of evil: said to wax greatest at Halloween. The problem we have today with such a belief is its theological aroma. We don’t exactly go for theology in the age of the “nones” — that ever-more-numerous, hard-to-define bloc of folk with only the loosest religious ties, if any at all.\nTheology speaks of matters considerably larger than a “blue” wave or a “red” one at the midterm polling places. It traffics in terms that, come to think of it, have roots in Jewish soil; that go far toward explaining not just what it means to be a Jew, even a lapsed one; rather, what it means to live with special responsibilities in a special place carved out, according to the ancient narrative, from nothingness.\nNothingness! Imagine that! How much more manageable to talk, in a modern, non-theological, way about somethingness. Gun control laws, for example; TV personalities; polls; yard signs; political dollars. The Jews know the difference here, even when not wanting to admit it. Their knowledge of how all of it came to be makes them formidable people, the kind likely to get in the way if left to their own devices.\nThey bring to the table an experience of seeing long ago, in the desert stillness, a bush aflame and of hearing, by report, a voice not of the earth: “I am the Lord thy God, which have brought thee out of the land of Egypt, out of the house of bondage. Thou shalt have no other gods before me.”\nI said the Jews have committed no offenses. Not quite so. Their presence is the offense; the rebuke they pose to other pretensions through their failure to disappear and let people do what they will. That is maybe how they came within Robert Bowers’ gunsight.\nWilliam Murchison is writing a book on 21stcentury moral restoration.\nCOPYRIGHT 2018 CREATORS.COM","url":"https://spectator.org/war-on-the-jews-again/"}
