{"authors":[],"date_download":"2018-10-22 20:57:57","date_modify":"2018-10-22 20:57:57","date_publish":"2014-05-05 14:11:34","description":null,"filename":"data/vaneerConsumption/WarrenBuffettBillGatesSlamHighFrequencyTrading.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/420701/buffgate_a704cb5c1b14eb64b649386265004f84.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_markets_warren-buffett-bill-gates-slam-high-frequency-trading-n97231_1540241877.html","title":"Warren Buffett, Bill Gates Slam High-Frequency Trading","title_page":"Warren Buffett, Bill Gates Slam High-Frequency Trading","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWarren Buffett, his longtime business partner Charlie Munger, and Bill Gates are no fans of high-frequency trading.\nIn a live appearance featuring the three men on CNBC Monday morning, Munger said, \"It's the functional equivalent of letting rats into a grainary\" and \"does the rest of the civilization no good at all.\"\nGates, a Berkshire Hathaway board member and chairman of Microsoft, agreed. \"It doesn't seem like it's much value-added because when you really need the liquidity it's not guaranteed to be there... It seems like a strange sort of profit.\"\nBuffett added, \"It's not a liquidity provider. It may create more volume but that's not the same as being a liquidity provider.\"\nIn addition, \"To the extent that it is front running, I think society has generally been against front running for good reasons... Here they've gained an advantage by figuring out how the system worked and getting there first and that adds nothing\" to economic activity.\nOn the other hand, he said, high-frequency trading isn't costing the average investor a \"penny.\" \"They've never had it so good.\"\nGates also recalled the first time he met Buffett, it was at the prompting of his mother.\n\"It's actually true,\" Gates said. \"My mom was having Kay Graham [of The Washington Post] and Warren over. And I was still sort of maniacal about not doing anything but working at Microsoft ... [but] I agreed to come by.\"","url":"https://www.nbcnews.com/business/markets/warren-buffett-bill-gates-slam-high-frequency-trading-n97231"}
