{"authors":["Associated Press"],"date_download":"2018-10-22 23:54:36","date_modify":"2018-10-22 23:54:36","date_publish":"2017-03-16 08:14:38","description":"OAKLAND, California (AP) - Sure, it's a little strange for Steve Kerr to be talking about how his Golden State Warriors must regain momentum in March.They...","filename":"data/vaneerConsumption/WarriorsaimtoregainmomentumchaseWeststopseed.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/08/wire-227309-1489652082-416_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319214_Warriors-aim-regain-momentum-chase-Wests-seed_1540252476.html","title":"Warriors aim to regain momentum, chase West's top seed","title_page":"Warriors aim to regain momentum, chase West's top seed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"OAKLAND, California (AP) - Sure, it's a little strange for Steve Kerr to be talking about how his Golden State Warriors must regain momentum in March.\nThey are the NBA's top team, after all. Yet having lost three straight and been on the brink of another defeat Tuesday night before rallying to beat the lowly Sixers and end the skid, Golden State realizes nothing is coming easily right now. Nor will it down the home stretch - even for a group which has become accustomed to lopsided wins.\n\"This is how it goes, but it's so foreign to us for the last couple years,\" Kerr said Wednesday. \"I think Cleveland's in a stretch just like us right now ... but the focus is on us right now because nobody's used to us being in this position. That's fine. It's kind of good for us to go through it, through the adversity.\"\nGolden State Warriors' Stephen Curry celebrates a score against the Philadelphia 76ers during the second half of an NBA basketball game Tuesday, March 14, 2017, in Oakland, Calif. Warriors won, 106-104. (AP Photo/Ben Margot)\nDraymond Green took a moment during a second-quarter timeout Tuesday to remind his teammates how hard it's going to be the rest of the way for last year's Finals runner-up, especially having lost five of seven and seeing two-time reigning MVP Stephen Curry miss open 3-pointers he almost always makes. Curry is in a bit of a shooting funk, having gone 26 for 89 from long range in his past eight games.\n\"Just continue to remind guys that we've been in a little bit of a rut. The only way to change that is to grind yourself out, grind your way out of it. Like I said, it's not going to be pretty,\" Green said. \"The shots just aren't going to fall. That's just the way the game works. You don't go into a rut and then come out and hit 20 3s. It just don't work like that.\"\nThe Warriors picked up their defense, finally hit some timely shots and barely held off Philadelphia, 106-104.\n\"If we had lost that game, we'd be in here this morning, everybody would be feeling bad,\" Kerr said. \"It's hard to build momentum from a loss. So you get one win after three straight losses it changes the mood and you get to learn from it and then hopefully you do it again and build the momentum. We haven't had to talk about that a whole lot the last few years. We haven't had to sort of pick up the pieces because we haven't had many lulls. Obviously we're in one now and it's just all about how we respond.\"\nGolden State lost leading scorer Kevin Durant to a sprained knee during its recent road trip, which featured a pair of cross-country flights, one game back in Oakland then a trip to Minnesota and San Antonio for a back-to-back. Eight games, eight cities, 13 days.\nSo who can blame the Warriors for being exhausted and road weary after that grind? Kerr hopes the NBA took note of what was an even more grueling road stretch than most.\nNow, they are home for 11 of the final 16 with the raucous Oracle Arena crowd behind them. And the Warriors need everything they can get from their reliable bench.\nAs much as Golden State worked to adjust to Durant's arrival at the beginning of the season, now it's about figuring out how to endure without KD. He is scheduled to be re-evaluated late this month to determine whether he might return before the end of the regular season or for the playoffs.\n\"It's quite an adjustment for us to be honest to playing without KD,\" center Zaza Pachulia said. \"If you guys remember when we first got together in October, it didn't look this pretty. There were still a lot of miscues and we weren't on the same page, we were trying to figure out. That's what's going on right now, too. Hopefully it's going to come back.\"\nGoing into Thursday's game against Orlando, the Warriors (53-14) held a one-game lead on San Antonio for the top spot in the Western Conference after the Spurs lost at home to Portland on Wednesday.\nFrustrated by his own struggles, Pachulia kicked a chair during the third quarter and scraped his left leg. He's glad it wasn't more serious, noting, \"I think it kind of shows you care about it.\"\nKerr acknowledges he kicked a chair about every month or six weeks during his playing days and appreciates Pachulia's passion.\n\"I just love the personality we have on this team. We really try to get out from this hole and start playing our game,\" Pachulia said. \"Because it's definitely a weird feeling, it's definitely a different feeling. We're not used to this, losing three in a row, four games winning by two points. It's just weird, not fun. It's going to going to be a great feeling once we figure it out and once we start playing good again. That way we're going to recover and take advantage of this kind of slippage we had. ...\n\"I guess we just got spoiled throughout the year. I'll take it because it's a good time for us to toughen up.\"\nGolden State Warriors' Klay Thompson, center, shoots between Philadelphia 76ers' Timothe Luwawu-Cabarrot, left, and Richaun Holmes (22) during the second half of an NBA basketball game Tuesday, March 14, 2017, in Oakland, Calif. Warriors won, 106-104. (AP Photo/Ben Margot)\nPhiladelphia 76ers' Jahlil Okafor, left, Dario Saric (9) and TJ McConnell, right, guard Golden State Warriors' Stephen Curry (30) during the second half of an NBA basketball game Tuesday, March 14, 2017, in Oakland, Calif. Warriors won, 106-104. (AP Photo/Ben Margot)\nPhiladelphia 76ers' Richaun Holmes, left, Dario Saric (9) and TJ McConnell (1) guard Golden State Warriors' Stephen Curry (30) during the second half of an NBA basketball game Tuesday, March 14, 2017, in Oakland, Calif. At right is 76ers' Timothe Luwawu-Cabarrot. Warriors won, 106-104. (AP Photo/Ben Margot)\nPhiladelphia 76ers' Sergio Rodriguez, left, and Golden State Warriors' David West fight for the ball during the first half of an NBA basketball game Tuesday, March 14, 2017, in Oakland, Calif. (AP Photo/Ben Margot)","url":"https://www.dailymail.co.uk/wires/ap/article-4319214/Warriors-aim-regain-momentum-chase-Wests-seed.html"}
