{"authors":["John Hayward"],"date_download":"2018-10-30 18:15:21","date_modify":"2018-10-30 18:15:21","date_publish":"2015-05-26 14:51:46","description":"If any of his friends on the Left bothers to listen to what Buffett says about the minimum wage and welfare, they're likely to be much more upset about his notion of identifying those who are \"willing to work,\" and holding those who are not responsible for their life choices. |","filename":"data/vaneerConsumption/WarrenBuffettExplainsHowa15MinimumWageWouldHurtWorkers.json","image_url":"https://media.breitbart.com/media/2015/03/Buffett-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_26__1540923321.html","title":"Warren Buffett Explains How a $15 Minimum Wage Would Hurt Workers","title_page":"Warren Buffett Explains How a $15 Minimum Wage Would Hurt Workers | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"As Fortune observes, Warren Buffett is one of the Left’s favorite billionaires, but he occasionally says things they don’t want to hear. At such times, liberals politely ignore him and wait for him to say something useful to their cause, at which point the fulsome praise resumes.\nThey prefer not to dwell on such hypocrisies as the energy Buffett devotes to lawfully avoiding the high taxes he philosophically supports, which is no surprise, because hypocrisy is the grease that keeps the gears of socialism turning. Aristocratic privilege is the enticement leftists have always offered to useful industrialists.\nThe Left isn’t going to like what Buffett had to say about the minimum wage in the Wall Street Journal last week. After reviewing the numbers for income inequality (growing, especially during the Obama years, although Buffett tactfully avoids pointing that out) and poverty (static, despite trillions of dollars spent in the War on Poverty), he blows a hole through liberal class-war boilerplate about the rich somehow getting richer off the backs of the poor:\nNo conspiracy lies behind this depressing fact: The poor are most definitely not poor because the rich are rich. Nor are the rich undeserving. Most of them have contributed brilliant innovations or managerial expertise to America’s well-being. We all live far better because of Henry Ford, Steve Jobs, Sam Walton and the like.\nBuffett explains at length that specialization is both the source of our incredible national wealth, and the difficulty some people – and, more disturbingly, some families – encounter when trying to access it. In a pre-industrial age when most of the population could perform most of the available jobs, and failure to perform generally resulted in starvation, there wasn’t much “income inequality” until the wealthiest aristocrats and hereditary royalty were considered. Sociologists regard the evolution of an independent middle class as an important achievement, but it inevitably creates a larger, more distinct underclass as well. “Poverty” was not as compelling a subject when just about everyone was equally poor… and commoners had few opportunities to significantly improve their station.\nWhen liberals set aside their favorite “revolutionary” class-war conspiracy theories and deal with the realities of middle-class specialization, their preferred remedy is demand greater spending on education. Here, too, Buffett commits heresy, and swings into “Bell Curve” territory to boot, gently using a sports metaphor to suggest that some people will always have trouble achieving prosperity no matter how extensively they are educated:\nThe remedy usually proposed for this mismatch is education. Indeed, a top-notch school system available to all is hugely important. But even with the finest educational system in the world, a significant portion of the population will continue, in a nation of great abundance, to earn no more than a bare subsistence. To see why that is true, imagine we lived in a sports-based economy. In such a marketplace, I would be a flop. You could supply me with the world’s best instruction, and I could endlessly strive to improve my skills. But, alas, on the gridiron or basketball court I would never command even a minimum wage. The brutal truth is that an advanced economic system, whether it be geared to physical or mental skills, will leave a great many people behind.\nAnd then he drops the word bomb that should turn most of his liberal admirers ferociously against him, if they can make themselves read and understand what he’s saying:\nIn my mind, the country’s economic policies should have two main objectives. First, we should wish, in our rich society, for every person who is willing to work to receive income that will provide him or her a decent lifestyle. Second, any plan to do that should not distort our market system, the key element required for growth and prosperity.\n“Willing to work? What the heck is that supposed to mean?” welfare-state fetishists will howl, echoing President Obama’s implacable hostility to work requirements for welfare – the most successful policy reform in a generation, and one he couldn’t wait to undo as swiftly as possible. It is a sacred presumption of modern liberalism that nearly everyone is “willing to work,” but no one should really be required to do so. Despite towering evidence to the contrary, the Left does not want to believe there is a demand component to employment. Chronic high unemployment is solely a result of greedy capitalists refusing to offer jobs, or refusing to hire certain people, and not in any meaningful way influenced by the enthusiasm of the unemployed for seeking work.\nLikewise, the struggle of the working poor to make ends meet is deemed to be solely a result of those greedy capitalists refusing to pay a “decent wage,” defined by the Left with increasing political discipline as $15 per hour. That’s the snake oil Buffett came to dump in the sand, but his suggested alternative is also problematic:\nThat second goal [avoiding distortions to the market system] crumbles in the face of any plan to sizably increase the minimum wage. I may wish to have all jobs pay at least $15 an hour. But that minimum would almost certainly reduce employment in a major way, crushing many workers possessing only basic skills. Smaller increases, though obviously welcome, will still leave many hardworking Americans mired in poverty. The better answer is a major and carefully crafted expansion of the Earned Income Tax Credit (EITC), which currently goes to millions of low-income workers. Payments to eligible workers diminish as their earnings increase. But there is no disincentive effect: A gain in wages always produces a gain in overall income. The process is simple: You file a tax return, and the government sends you a check. In essence, the EITC rewards work and provides an incentive for workers to improve their skills. Equally important, it does not distort market forces, thereby maximizing employment.\nHe goes on to outline the fraud and confusion surrounding the EITC, and notes the most obvious problem with using it as a primary supplement to working-poor income: it’s currently delivered as an annual sum at tax time. Buffett suggests remodeling the EITC to become a monthly payment, which should be a fairly simple change to implement, although our massive federal mega-bureaucracy tends to scream like a stuck pig and howl that it’s grievously under-funded whenever its workload is even marginally increased.\nThe more serious problem with Buffett’s suggestion is that the Earned Income Tax Credit is a horrible idea. The income-tax system should not have been corrupted into a dispensary of welfare benefits. It should be entirely concerned with funding the government, in the lightest, simplest, most evenly-distributed manner possible.\nIt currently resembles that ideal in no way, shape, or form. We have a big problem with the public perception that many Americans – 47 percent to quote one famous estimate – have no “skin in the game,” bearing none of the tax burden, and therefore having every reason to support madcap spending programs. The big problem is that so many people within that “47 percent” incorrectly believe themselves to be free riders, when in truth they pay all sorts of hidden taxes, even if their net income tax burden is near zero. Also, there are people who do pay net taxes, but cannot perceive the burden, because it’s all taken painlessly out of their paychecks with mosquito-bite withholding, and their only conscious interaction with the tax system is an annual refund check they perceive as a gift from the State.\nLeaving the minimum wage alone and using the EITC to supplement low-wage income avoids the market distortion Buffett warns against – i.e. labor costs go up, so employers make do with less labor, or raise prices on everything to compensate. However, it merely shifts the burden of the all-encompassing welfare state into the murky waters of general taxation, making it invisible to most of us… and that’s a huge problem.\nWe need to be more conscious of what the State takes from us, and gives to others, not less. Welfare programs need to be clearly identified as such and monitored carefully. The recipients of government “charity” must be clearly aware they are on welfare, and given incentives to achieve self-sufficiency as quickly as possible. It’s certainly true that monthly EITC checks would be far more obvious than dumping an unfunded mandate on employers to provide welfare through absurdly inflated minimum wages, but for both payers and recipients, a permanent subsidy delivered through the tax system is something that can all too easily be ignored as a permanent fact of life.\nI must also confess skepticism that the EITC can ever be reformed from the fraud Buffett mentions, because the bureaucracy has no real incentive to eliminate that fraud. Dramatic cuts in government funding are the one and only way to make bureaucrats take waste and fraud seriously – they won’t take decisive action until that money is coming right out of their hides.\n“There is no perfect system, and some people, of course, are unable or unwilling to work,” Buffett concludes, doubling down on his willing-to-work heresy. “But the goal of the EITC – a livable income for everyone who works – is both appropriate and achievable for a great and prosperous nation. Let’s replace the American Nightmare with an American Promise: America will deliver a decent life for anyone willing to work.”\nI think that premise should be vigorously challenged from the Right. The “American Promise” is a welfare check? Working people should rely on cash subsidies from the government to make ends meet? How about we get government’s boot off the neck of industry, and see what a lightly burdened, unfettered free market – a beast that has not existed within most of our lifetimes – can do to make most of us, including the “working poor,” self-sufficient?\nWithout regulatory meddling and the absolutely insane burden of financing our bloated and corrupt centralized State, most of us should be able to make a decent living – yes, even in the age of technological specialization – without extracting compulsory subsidies from our neighbors. Those who truly can’t make a decent life should enjoy reasonable and compassionate assistance… clearly labeled as such, with a sane definition of “poverty,” and stringent rules to prevent abuse.\nOf course, if any of his friends on the Left bothers to listen to what Buffett says about the minimum wage and welfare, they’re likely to be much more upset about his notion of identifying those who are “willing to work,” and holding those who are not responsible for their life choices.","url":"https://www.breitbart.com/politics/2015/05/26/warren-buffett-explains-how-a-15-minimum-wage-would-hurt-workers/"}
