{"authors":["Associated Press"],"date_download":"2018-10-23 03:11:06","date_modify":"2018-10-23 03:11:06","date_publish":"2016-01-28 18:37:54","description":"OMAHA, Neb. (AP) — Billionaire Warren Buffett has given unnamed individuals and charities more than $32 million worth of Berkshire Hathaway stock since late ...","filename":"data/vaneerConsumption/WarrenBuffetthasgifted32MinstocksinceJuly.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421482_Warren-Buffett-gifted-32M-stock-July_1540264266.html","title":"Warren Buffett has gifted $32M in stock since July","title_page":"Warren Buffett has gifted $32M in stock since July | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Warren Buffett has gifted $32M in stock since July\nOMAHA, Neb. (AP) — Billionaire Warren Buffett has given unnamed individuals and charities more than $32 million worth of Berkshire Hathaway stock since late July.\nThe gifts, disclosed in documents filed with the Securities and Exchange Commission this week, are a relatively small part of Buffett's plan to give most of his $58.3 billion fortune to charity. Most of the 13 gifts were in small chunks of Class B Berkshire stock, though two were worth more than $10 million and one gift was worth $7.9 million.\nThere were no details about who received the 13 gifts, other than most went to unnamed individuals between July and this month. Only two smaller gifts of 100 class B Berkshire shares went to nonprofits.\nBuffett didn't immediately respond to questions Thursday.\nHe has been giving away large blocks of Berkshire stock since 2006, with the biggest share going to the Bill & Melinda Gates Foundation. He also gives Class B Berkshire shares annually to his own foundation and to the foundations run by each of his three children. Last summer's gifts to those five foundations receiving most of his philanthropy were worth roughly $2.8 billion.\nBuffett still holds 308,261 Class A shares and 164,885 Class B shares of Berkshire stock. Buffett has led the Omaha, Nebraska-based conglomerate as chairman and chief executive for more than 50 years.\nBerkshire owns about 90 subsidiaries in an eclectic mix of industries, including insurance, utilities, railroads, manufacturing and retail. The conglomerate also holds significant stakes in Coca-Cola, Wells Fargo, American Express, IBM and other companies.\n___\nFollow Josh Funk online at www.twitter.com/funkwrite\n___\nOnline:","url":"https://www.dailymail.co.uk/wires/ap/article-3421482/Warren-Buffett-gifted-32M-stock-July.html"}
