{"authors":["Associated Press"],"date_download":"2018-10-22 22:11:51","date_modify":"2018-10-22 22:11:51","date_publish":"2016-01-29 09:10:45","description":"BERLIN (AP) — First impressions are important in any culture, and Germany is keen that even refugees from conservative Muslim countries get it right. \"Men an...","filename":"data/vaneerConsumption/WaryofcultureclashGermansteachrefugeestheirrules.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:b0f86bc150f949129318b4872aab3ecc-3bmscybNe842cce83474b5330e57-723_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422379_Wary-culture-clash-Germans-teach-refugees-rules_1540246311.html","title":"Wary of culture clash, Germans teach refugees their rules","title_page":"Wary of culture clash, Germans teach refugees their rules | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Wary of culture clash, Germans teach refugees their rules\nBERLIN (AP) — First impressions are important in any culture, and Germany is keen that even refugees from conservative Muslim countries get it right.\n\"Men and women say hello and goodbye by shaking hands and looking each other in the eyes,\" an online brochure earnestly instructs refugees, many of whom come from places where unrelated men and women are not supposed to touch one another. It also addresses more sensitive issues: \"In Germany, homosexuals are allowed to show their sexual preference in public.\"\nGuides like this one published by public broadcaster Bayerischer Rundfunk have become staple fare in a flurry of German rulebooks designed to prevent culture clashes between residents and refugees. Belittled at first, the guides have gained significance after a series of robberies and sexual assaults during New Year's celebrations in the western city of Cologne.\nPhoto provided by Bayerischer Rundfunk shows a picture of the online brochure published by the German public broadcaster telling newcomers in one pen-and-ink cartoon frame how to welcome each other. Such advice is staple fare in a flurry of guides being released in Germany these days in multiple languages, designed to prevent culture clashes between local residents and migrants. (Bayerischer Rundfunk via AP) MANDATORY CREDIT\nAuthorities have warned against holding all migrants responsible for the actions of a relatively small group of men, described as being of \"Arab or North African\" origin. But the attacks have fed a growing debate over how to integrate the more than 1 million asylum seekers who arrived in the Germany last year.\n\"Germans are strange sometimes,\" explains another illustrated brochure, produced by a regional branch of the Left Party. \"We have quirks, and especially we have rules.\"\nAmong those rules, the guide explains, is the need to separate garbage, arrive on time for appointments and refrain from urinating in public. \"Trees need only rainwater. For everything else there are rest rooms,\" it says.\nThe 30-page brochure, with the English-language title \"Germans be like,\" also explains what's allowed. Women, for example, don't have to wear veils, and fishing is permitted provided one gets a license.\nIt's easy to see how refugees, many of whom come from conservative societies, could experience culture shock in Germany, a country where beer and pork are on every menu and bare skin is flaunted in public. And there has been little discussion in Germany of the possibility that the new arrivals might have positive things to contribute to German culture, a point not lost on the refugees.\nStill, refugees at a communal housing center in Berlin's Wilmersdorf district said they were willing to put aside their judgments.\n\"Their way of thinking, the way of life is different here,\" said Addis, who gave only that name because he feared repercussions for his relatives back home in Eritrea if he was identified as having fled. \"For example, gay marriage is shocking, but we need to adapt and learn to go with it.\"\nThe 35-year-old former social worker said young refugees would find it easier to adapt than older people, and stressed the importance of making German friends.\nOne of the first to publish rules for refugees last October was Hardheim, a small town about 75 kilometers (50 miles) southeast of Frankfurt. At the time, officials were forced to defend themselves against those who declared the guide patronizing, or a waste of public money.\n\"The guidelines aren't meant to bully anyone but to make it easier for citizens and asylum-seekers to live together,\" mayor Volker Rohm told the dpa news agency at the time. The town of 4,600 people had taken in about 1,000 refugees, causing some friction.\n\"Girls and young women feel harassed when approached and asked for their cellphone numbers or Facebook contacts,\" the guide said. \"Please don't do it.\"\nWhile far-right groups in particular have seized on reports of sexual harassment by newly arrived migrants — not all of them true — Germany as a whole was shaken by the scale and nature of the assaults that took place in Cologne and other cities at New Year.\nAlmost 1,000 women have filed criminal complaints over what happened in Cologne, more than half alleging sexual assaults. Authorities have identified 35 suspects, of whom 32 are from North Africa, including some asylum-seekers.\nGermany's integration czar condemned the attacks, but rejected the idea that the assaults were anything other than criminal behavior.\n\"This isn't about cultural misunderstanding but about extreme wrongdoing,\" Aydan Ozoguz said in an email to The Associated Press. \"You can't respond to this with integration courses, but only with punishment and if necessary deportation.\"\nStill, Ozoguz said it was right to place a greater emphasis on gender roles both in integration courses and schools, because sexual violence is a feature of German society too.\nAmong its 14 tips for migrants, Bayrischer Rundfunk noted that \"women are to be respected, no matter what they wear,\" and that \"children must not be hit.\"\nMarkus Huber, a spokesman for the broadcaster, said the guide was produced in consultation with refugees and had been well received by them. The guides, available in German, English and Arabic, have been viewed more than 1.1 million times since October, he said.\nThe guide also notes the dire consequences for those who break some rules.\n\"Conflicts must not be solved with violence,\" it says, since this may land one in jail and also \"have disadvantages in the asylum procedure.\"\nMohammed, a primary school teacher from the Syrian city of Hama now living in Berlin, said he had no doubt most refugees would accept the rules in Germany, especially given the broken countries many had left behind.\n\"In Germany there are many rules, but in the end rules help people,\" said Mohammed, who also feared repercussions for his family if his last name was published. \"Some of the rules are difficult but they help people make society.\"\n___\nGuide for refugees (in English): http://bit.ly/1PNVk7e","url":"https://www.dailymail.co.uk/wires/ap/article-3422379/Wary-culture-clash-Germans-teach-refugees-rules.html"}
