{"authors":[],"date_download":"2018-10-30 14:22:20","date_modify":"2018-10-30 14:22:20","date_publish":"2016-01-21 00:00:00","description":null,"filename":"data/vaneerConsumption/WasElChapoamongthebeneficiariesofObamasFastFurious.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_01_was_el_chapo_among_the_beneficiaries_of_obamas_fast__furious_1540909340.html","title":"Was El Chapo among the beneficiaries of Obama's Fast & Furious?","title_page":"Was El Chapo among the beneficiaries of Obama's Fast & Furious?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Sorry to have to be the bearer of bad news, but the guy responsible for El Chapo being in possession of such a dangerous weapon is the same person currently demonizing the NRA and looking for ways to frustrate the Second Amendment right of law-abiding Americans to keep and bear arms.\nEarlier this month, after eluding police since last summer, in Los Mochis, Mexico, drug lord Joaquín \"El Chapo\" Guzmán was finally apprehended. During a raid of the hideout where the world's most notorious drug lord hid for six months, authorities found a .50 caliber high-powered rifle with a serial number that traced back to none other than Barack Obama, the U.S. Justice Department, and an ATF overseen by former attorney general Eric Holder's \"Fast and Furious\" gun-walking operation.\nDubbed \"Fast and Furious,\" the failed sting operation Obama kept going, which started as \"Operation Wide Receiver\" in 2006 and was abandoned by Bush, involved federal agents allowing licensed firearms dealers in Phoenix-area shops to sell weapons to illegal straw buyers, hoping that after they were sold, authorities could track the arms to Mexican drug cartel leaders like El Chapo and arrest them.\nInstead, the ATF lost track of most of what was sold.\nThe irony is that under the guise of wanting to track guns to Mexico, America's anti-gun evangelist put 2,000 weapons in the hands of criminal drug cartels. In turn, rather than the president's original goal being accomplished, violent chaos ensued when munitions were made available to some very bad people.\nIn 2010, after Obama's guns hit the streets of Mexico, U.S. Border Patrol agent Brian Terry was murdered with a \"Fast and Furious\" weapon. The following year, ICE Agent Jaime Zapata also fell victim.\nFive years later, Nadir Hamid Soofi, one of two armed terrorists, the other being Elton Simpson, showed up at a Garland, Texas Mohammed cartoon contest to avenge Allah's honor with a \"Fast and Furious\" gun. Thankfully, an armed traffic cop killed the two ISIS sympathizers, both of whom arrived at the event wearing body armor, before they could kill any infidels.\nJudging from the events in Garland, Texas, and the fact that thousands of intruders have successfully crossed the border illegally, surely more than a single \"Fast and Furious\" gun has been smuggled from Mexico back into the U.S.\nAnd while purely conjecture, one can't help but wonder whether the \"stolen federal agent's gun\" Juan Francisco López-Sánchez allegedly used to kill Kate Steinle in the sanctuary city of San Francisco might also have a serial number the president would rather keep secret.\nLet's face it: the chance that a 5x-deported illegal felon could happen upon a federal agent's stolen .40 caliber handgun, under a bench, wrapped in a T-shirt, is a whole lot less credible than an illegal border-jumper managing to procure a \"Fast and Furious\" special on one of his round trips.\nBut that's not all. Thanks to \"Fast and Furious\" and a president convinced that law and order are somehow accomplished by treating villains as more trustworthy than the law-abiding, the Mexican people have also suffered greatly.\nFor example, in 2010, 14 teenagers near Ciudad Juárez were murdered at a party, shot by La Línea assassins, who came armed to the festivities with Obama-provided guns. There's also Mexican lawyer Mario González Rodríguez. In 2011, before being murdered with a gun walked over the border and dumped in a shallow grave, Rodríguez was tortured for weeks by members of El Chapo's Sinaloa cartel.\nBeauty queen Maria Susana Flores Gamez was also a victim. Ms. Gamez was used as a human shield during a shootout between cops and drug-runners. The gun found lying next to her corpse belonged to the latter group and was gifted compliments of Eric Holder and Barack Obama, both of whom, to this day, accept zero responsibility for all the bloodshed.\nNow it's 2016, and Americans find out that after five of El Chapo's men were killed in a raid where Guzmán was finally captured, serial numbers on high-powered weapons with Barack Obama's fingerprints all over them were found inside the hideout.\nSo it appears as if the president on a mission to educate the illiterate on gun safety also provided the most notorious and deadly drug lord on the planet with a rifle capable of stopping a car or taking out a helicopter.\nWorse than that, when not working hard to restrict the sale of firearms, Obama, the one who lost track of 1,400, or 70%, of the 2,000 guns he purposely allowed to be walked across the border into Mexico, is reassuring Americans that he can properly vet the 250,000 ISIS-infiltrated refugees he plans on walking into this country.\nJeannie hosts a blog at www.jeannie-ology.com.","url":"https://www.americanthinker.com/blog/2016/01/was_el_chapo_among_the_beneficiaries_of_obamas_fast__furious.html"}
