{"authors":[],"date_download":"2018-10-22 22:28:58","date_modify":"2018-10-22 22:28:58","date_publish":"2014-06-10 08:09:49","description":"At least 42 people were killed in the mudslide in March northeast of Seattle.","filename":"data/vaneerConsumption/WashingtonMudslideFamiliesFileWrongfulDeathDamageClaims.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/498461/140610-oso-mudslide-washington-420a_1f00b20595e99c1851d3b4448154aca5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_deadly-mudslide_washington-mudslide-families-file-wrongful-death-damage-claims-n127096_1540247338.html","title":"Washington Mudslide Families File Wrongful Death, Damage Claims","title_page":"Washington Mudslide Families File Wrongful Death, Damage Claims","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFamilies of those killed in the deadly Washington mudslide in March filed more than a dozen legal complaints, including for wrongful death, against state and county officials Monday, alleging that irresponsible logging contributed to the disaster.\nAt least 42 people died when the colossal slide flattened a rural community in the Stillaguamish Valley, some 50 miles northeast of Seattle.\nTwelve of the new claims against the State of Washington and Snohomish County were for wrongful death, one was for \"outrage and negligent infliction of emotional distress,\" and another for destruction of property.\nSeattle-based attorney Corrie Yackulic, who is bringing 12 of the new claims, alleged that the state of Washington approved logging in a \"groundwater recharge zone\" - an area where rain drains off from the surface - and \"ignored the best available science delineating the recharge zone in favor of much older data.\"\nThis was responsible for the collection of water \"outside its normal course, contributing to the destabilization of the...landslide.\"\nThe other three new claims were filed by another Seattle attorney, Karen Willie, according to the Seattle Times.\nThe newspaper reported that although Yackulic in a previous claim had asked for $3.5 million in compensation for the widow of one of the mudslide victims, Thomas Durnell, the claims filed Monday did not specify any amounts for damage. This would be determined by a jury, the lawyer said.\nState and county authorities now have 60 days to respond to the charges until a lawsuit can begin. In addition to the 42 people confirmed dead by the slide, one person, Kris Regelbrugge, is still missing more than two and a half months after the tragedy.\n- Alexander Smith","url":"https://www.nbcnews.com/storyline/deadly-mudslide/washington-mudslide-families-file-wrongful-death-damage-claims-n127096"}
