{"authors":["Mark Duell For Mailonline","Andy Dolan","Christian Gysin For The Daily Mail"],"date_download":"2018-10-22 21:25:52","date_modify":"2018-10-22 21:25:52","date_publish":"2016-01-29 06:47:27","description":"Susanne Hinte, 48, of Worcester, could make plenty of cash as the ‘lady who tried to claim the £33million on the lottery’, according to the agent who helped boost the public profile of White Dee.","filename":"data/vaneerConsumption/WashedLottoticketwinnerSusanneHintecouldearn1mthisyear.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30AEE22300000578-0-image-a-91_1454048522762.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422264_German-washed-Lotto-ticket-grandmother-Susanne-Hinte-earn-1m-year-says-man-responsible-White-Dee-s-celebrity-career_1540243552.html","title":"Washed Lotto ticket 'winner' Susanne Hinte 'could earn £1m this year'","title_page":"Washed Lotto ticket 'winner' Susanne Hinte 'could earn £1m this year' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The grandmother who said she had accidentally laundered a £33million lottery ticket could still become a millionaire despite the true winner now claiming the jackpot.\nSusanne Hinte was in hiding last night after lottery organiser Camelot said the lucky ticket-holder had finally announced themselves after days of speculation, but wished to remain anonymous.\nThis rules out 48-year-old German grandmother Miss Hinte from Worcester because the Watford-based company does not pay out on damaged tickets until after its six-month claim deadline.\nWho wants to be a millionaire? Susanne Hinte (left), who was in hiding last night, could still make plenty of cash, according to agent Barry Tomes, who helped boost the profile of Benefit Street's White Dee (right, together)\nMs Hinte's photocopied ticket: The draw date has been obliterated by a tear, while the barcode at the bottom and the ticket's ID number have also been ruined. The numbers, however, were still visible\nThe culprit? Miss Hinte poses in front of her washing machine, which she claimed had ruined her winning ticket\nBut she could still make plenty of cash as the ‘lady who tried to claim the £33million on the lottery’, according to the agent who helped boost the public profile of Deirdre ‘White Dee’ Kelly.\nBarry Tomes, who represents the Channel 4 Benefits Street celebrity, claimed Miss Hinte could earn £2,000 in a nightclub this weekend and earn a seven-figure amount over the next few years.\nHe told Daily Star reporter Jerry Lawton: ‘Everyone is talking about her. She has earned herself notoriety. A few years ago that was a bad thing but these days it is a commodity and it is bankable.\nDo you know the identity of the lottery winner? Email lotto@dailymail.co.uk\n‘She could be looking at earning a £1million over the next couple of years. That’s not bad at all. I’ve seen pics of her topless that are doing the rounds so she’ll be offered porn and adult work.\n‘She needs to be handled carefully but she looks like a woman who is up for plenty of things. She will be in demand even though Camelot have said her claim is not valid.’\nTeamwork: Mr Tomes has aided White Dee's rise to fame in the past few years which has seen her appear on Celebrity Big Brother, present a documentary series and release a rap single and weight loss DVD\nUncovered: Miss Hinte sent a lorry driver topless photographs soon after getting in contact with him on an internet dating website - and Mr Tomes said she will be 'offered porn and adult work'\nMr Tomes has aided White Dee's rise to fame in the past few years which has seen her appear on Celebrity Big Brother, present a documentary series and release a rap single and weight loss DVD.\nCOUNTDOWN TO THE BIG WIN January 9 - The draw for the record-breaking Lotto jackpot of £66million is made. Two tickets match the winning numbers of 26, 27, 46, 47, 52 and 58. January 13 - David and Carol Martin, both 54, from Hawick in the Scottish Borders, announced they had one of the winning tickets to the £33,035,323 prize. January 21 - Camelot announce the holder of second ticket bought it in Worcester. Ambleside News is used by TV crews as one shop where customers are checking tickets. January 22 - Susanne Hinte walks into Ambleside News near her home in Warndon, Worcester, and presents a tatty ticket she claims was damaged in a washing machine. January 24 - Ms Hinte's family claim she is the winner but faces agonising 180 day for Camelot to confirm her win. January 28 - Camelot announce a winning ticket holder has come forward and confirm Ms Hinte is not a winner.\nAnd his comments are a clear indication that he feels he could transform the fortunes of Miss Hinte, who has not been seen since Saturday.\nCamelot’s announcement yesterday sparked calls for her to be investigated over her production of a crumpled lottery ticket on which the ‘winning’ numbers were virtually the only information still legible.\nAs neighbours voiced concerns, Camelot left the door open to taking action against anyone who had tried to fraudulently claim the outstanding £33,035,323.\nEarlier this week, it said it would act if it thought someone had ‘intentionally attempted to defraud the National Lottery’. It received hundreds of claims in addition to Miss Hinte’s.\nMiss Hinte, who moved to the UK from her native Germany at 19, was at the centre of the hunt for the winner after it emerged last weekend that the ticket was bought in Worcester.\nShe claimed she laundered the ticket in her jeans after buying it at a newsagent’s near her home in the suburb of Warndon.\nHer past was described last night by the daughter of an ex-boyfriend. Charlotte Payne, 24, lived at Miss Hinte’s home six years ago for around 12 months, when her father was going out with the would-be Lotto winner.\nShop: Miss Hinte claimed to have bought the ticket at Ambleside News in Warndon, Worcester. But Camelot declined an offer from owner Natu Patel (pictured) to be sent the video of her apparently buying the ticket\nVictorious: David and Carol Martin, both 54, from Hawick in the Scottish Borders, announced they had one of the winning tickets to the £33,035,323 prize on January 13\nMiss Payne, from Walsall, West Midlands, said: ‘Susanne had a shiny steel pole in the bedroom … She was quite open about working as a dancer in the past.’\nKey numbers: Camelot received hundreds of claims in addition to Miss Hinte’s from potential 'winners'\nHer father has confirmed he was once in a relationship with Miss Hinte.\nLast night there was no answer at Miss Hinte’s semi-detached home or at the home of her daughter Natasha Douglas, 28.\nA neighbour of Miss Hinte said she hoped the former prison custody officer and barmaid should be investigated for her claim.\nSusan Gormley, 70, said: ‘I didn’t think for one minute that she had won it. I was hoping she had won so she’d move.’\nDozens took to social media calling for Miss Hinte to be investigated.\nMiss Hinte has had court appearances for non-payment of fines, failing to reveal a driver’s identity and failure to pay her TV licence. She is facing two trials in March for theft and motoring offences.\nWest Mercia Police said it could investigate only if it received a complaint from Camelot over a deception allegation.","url":"https://www.dailymail.co.uk/news/article-3422264/German-washed-Lotto-ticket-grandmother-Susanne-Hinte-earn-1m-year-says-man-responsible-White-Dee-s-celebrity-career.html"}
