{"authors":["John Sexton"],"date_download":"2018-10-30 19:53:34","date_modify":"2018-10-30 19:53:34","date_publish":"2015-12-11 01:52:35","description":"WaPo's fact checker looked at recent mass shootings and concluded there is no evidence that stronger gun laws would have prevented them.","filename":"data/vaneerConsumption/WashingtonPostGunLawsWouldNotHavePreventedRecentMassShootings.json","image_url":"https://media.breitbart.com/media/2015/08/Chatanoogo-shooting-scene-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_10__1540929214.html","title":"Washington Post: Gun Laws Would Not Have Prevented Recent Mass Shootings","title_page":"Washington Post: Gun Laws Would Not Have Prevented Recent Mass Shootings | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Washington Post‘s fact checker took a look at recent mass shootings and concluded there is no evidence that stronger gun laws would have prevented any of them.\nGlenn Kessler decided to fact check a statement by Marco Rubio on the red-hot topic of gun control. Last Friday on CBS This Morning, Rubio said, “None of the major shootings that have occurred in this country over the last few months or years that have outraged us, would gun laws have prevented them.” Kessler doesn’t say exactly who suggested he check this claim, but he does note that the colleague who did so assumed that “it was almost certainly incorrect.”\nSince Rubio’s statement was a bit vague, Kessler went back as far as the December 2012 Newtown shooting in Connecticut. Based on a list of mass shootings between then and now maintained by progressive magazine Mother Jones, Kessler assembled a list of 12 shootings and looked at the circumstances of each one in turn.\nWhat he found was no evidence that any proposed gun laws would have stopped any of the mass shootings in question. In most cases, guns used in these killings were purchased legally (though not always by the person who used them).\nKessler does note that Dylann Roof, the racist shooter who killed 9 African Americans at a church service in Charleston, SC, might have been prevented from buying his gun because of prior drug use. However, a clerical error meant that the examiner who approved the purchase was unaware of Roof’s prior misdemeanor.\nAnother shooter, Aaron Alexis, was dissuaded from buying a handgun in Virginia but wound up killing 12 people with a shotgun instead. He had been arrested multiple times but never convicted.\nKessler notes three of the shootings on the list happened in California, the state with some of the most restrictive gun laws in the country. California, for instance, has a law banning high-capacity magazines.\nHe concludes, “It is possible that some gun-control proposals, such as a ban on large-capacity magazines, would reduce the number of dead in a future shooting, though the evidence for that is heavily disputed. But Rubio was speaking in the past, about specific incidents. He earns a rare Geppetto Checkmark.”","url":"https://www.breitbart.com/politics/2015/12/10/washington-post-gun-laws-not-prevented-recent-mass-shootings/"}
