{"authors":[],"date_download":"2018-10-30 01:09:39","date_modify":"2018-10-30 01:09:39","date_publish":"2015-02-19 00:00:00","description":null,"filename":"data/vaneerConsumption/WashingtonvsObama.json","image_url":"https://www.americanthinker.com/images/bucket/2015-02/194135.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_02_washington_vs_obama_comments_1540861779.html","title":"Washington vs. Obama","title_page":"Articles: Washington vs. Obama","title_rss":"NULL","source_domain":"americanthinker.com","text":"Today is the birthday of one of America’s greatest presidents. He is still number one in many people’s minds, considering the undiminished and unmatched greatness he displayed. There is still no higher standard than America’s first, since he shaped the executive office into what it is today. It is interesting to compare how George Washington conducted himself as president versus Barack Hussein Obama. Washington had a unique leadership style. He was courageous, conscientious, honest, and hard working. In his recent book, The Return Of George Washington, Ed Larson writes how Washington was instrumental in the drafting and ratification of the Constitution. Larson noted to American Thinker, “I call him the general contractor of the Constitution. He wanted to move the country forward and would listen to people about the best way to get there.” On the other hand, President Obama is close-minded and appears to be... (Read Full Article)","url":"https://www.americanthinker.com/articles/2015/02/washington_vs_obama_comments.html"}
ght ISIS. Retired Army Lt. Gen. Michael Flynn, the head of the Defense Intelligence Agency, stated, “When we give our military commanders a mission, we should allow them to execute that mission, and not overly constrain them with approved authorities, but then having to come back to the administration for permission. Either we need to review those authorities and those permissions, or we need to change the commanders because we apparently don’t trust them to do the job that we’ve given them to do.”\nNewt Gingrich, who has written a series of three novels about Washington, told American Thinker that to compare President Obama and President Washington, “they are just not in the same league. It is inconceivable that President Obama could learn anything from President Washington. They do not have similar characteristics. Washington always wanted to focus on strategy and the ability to understand what needed to be done. He had an extraordinary sense of values with unimpeachable integrity.”\nUnlike Washington, who put forth that the president should set policy, the current president cannot figure out how to fight the terrorists. At a news conference in August, President Obama stated, “I don't want to put the cart before the horse. We don’t have a strategy yet.” Congressman Tom Rooney does not disagree with President Obama, “The president still hasn’t given us a winning strategy to defeat ISIS. He withdrew from Iraq too quickly, without leaving behind any forces to maintain stability, and that’s turned into a disaster. I am very concerned about the general feeling of detachment we’re seeing from the president.”\nJohn Yoo, a former official at the Department of Justice, and author of Crisis and Command: A History of Executive Power from George Washington to George W. Bush, believes that “Washington saw the presidency on equal footing with Congress. While Congress would take the lead concerning domestic issues, the president would take charge concerning foreign affairs. The president’s main job was to check Congress to prevent it from going too far and to prevent pandering to special interests.”\nWhile Washington desired to govern by consensus, leading him to seek cooperation with the other branches of government, Obama does just the opposite. This is evidenced with President Obama’s now famous quote to Congress, “I've got a pen, and I've got a phone. And I can use that pen to sign executive orders and take executive actions and administrative actions.”\nGingrich wants Americans to understand that Washington had a great passion for the law, seeing the Constitution as liberty against tyranny. “He would have thought what President Obama is doing today is absurd. Washington never moved against the directions of Congress.” Yet, President Obama blatantly challenges the rule of law in the context of ObamaCare, his recess appointments, and his “Dream Act” implementation. President Obama singlehandedly altered the Affordable Care Act over twenty times. The courts decided that his recess appointments were unconstitutional, because the Senate, not the president, decides when they are in session. The president’s attempt at unilaterally overhauling the immigration process was overturned earlier this week by a Texas court. Regarding these blatant actions, Senator Lee commented, “If the president continues to do this and is allowed to get away with it, I fear it will take root within our Constitutional structure. It will be assumed that this is just one of the actions presidents do. We will become closer and closer to the kind of government that is not accountable to the people anymore.”\nWashington did not enjoy partisan politics and unlike the current president tried to be a unifier, not a divider. In this past State of The Union address President Obama made it very clear to the Republican Congress he would only work with them if they agreed to his policies or he would go it alone. Author Ed Larson believes any president should take a lesson from Washington’s Farewell Address, “The alternate domination of one faction over another, sharpened by the spirit of revenge, natural to party dissension, which in different ages and countries has perpetrated the most horrid enormities, is itself a frightful despotism.”\nJohn Yoo best summarized why Washington is one of the greatest presidents: “He was not only the first president, but made fundamental choices about the design of the office. He established the principle of civilian control of the military during the Revolutionary War. He lent his great prestige to the drafting and ratification of the Constitution. He established the independence of the office from Congress as a co-equal branch of government. He favored a unified, energetic executive who should exercise full control of the agencies and federal officers. He established foreign affairs and national security as areas for presidential initiative. His greatest difference from the current president is his establishment of a stable government under law.”\nThe author writes for American Thinker. She has done book reviews, author interviews, and has written a number of national security, political, and foreign policy articles.","url":"https://www.americanthinker.com/articles/2015/02/washington_vs_obama.html"}
