{"authors":["Neil Munro"],"date_download":"2018-10-30 19:09:28","date_modify":"2018-10-30 19:09:28","date_publish":"2018-06-30 05:42:43","description":"The Raises are Welcomed by Employees but not by Investors or Employers","filename":"data/vaneerConsumption/WashPostTruckersRisingWagesAreEconomicThreat.json","image_url":"https://media.breitbart.com/media/2018/04/Glider-Trucks-Getty-Images.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/midterm-election_2018_06_29__1540926568.html","title":"WashPost: Truckers' Rising Wages Are 'Economic Threat'","title_page":"WashPost: Truckers' Rising Wages Are 'Economic Threat' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Rising wages for blue-collar truckers are a threat to the nation’s economy, says Jeff Bezos’ Washington Post.\n“The challenges facing the industry, including trucking companies rapidly raising prices as they raise wages, have special power to affect the entire economy,” writes Heather Long.\nHer article, headlined, “America’s severe trucker shortage could undermine the prosperous economy,” continued:\ndelivery delays are common, and businesses such as Amazon, General Mills and Tyson Foods are raising prices as they pass higher transportation costs along to consumers. On a recent call with investors, a Walmart executive called rising transportation costs the company’s primary “head wind.”\nThe gains for truckers are a novel pain for the investors and employers who have been able to hold down wages for decades because the federal government is trying to grow the economy via cheap-labor legal immigration.\nThe unexpected rise in wages is also a problem for Jeff Bezos, the billionaire owner of the Washington Post whose Amazon retail empire depends on cheap truck transport. His business is already facing higher warehouse costs because the nation’s 800,000 warehouse workers have won a 9.4 percent pay increases since January 2017.\nThe Post‘s author admits that companies are being forced to compete for labor in a good economy, but hides the role played by President Donald Trump who has thwarted intense efforts by business lobbies and bipartisan alliances to import more foreign workers:\nAs the nation faces a historically low level of unemployment, trucking companies are doing what economists have said firms need to do to attract and retain workers: They’re hiking pay significantly, offering bonuses and even recruiting people they previously wouldn’t have considered …\nThe political fight over imported cheap-labor is a see-saw battle.\nCongress has blocked Trump’s pro-American reforms and is trying to preserve the inflow of Central American workers via the nation’s loose asylum laws.\nBut Trump has used his legal authority to curb illegal immigration over the Mexican border, sharply lowered the inflow of workers via the refugee agencies, and has minimized the growth of the guest-worker programs. He has also blocked a business push in Congress for another amnesty of ‘dreamers’ and other illegals, as well as for a huge expansion in the number of guest-workers.\nTrump’s opposition has forced business groups to lower their amnesty goals down to just 1.8 million illegals. House Speaker Paul Ryan pushed that medium-sized amnesty goal in June but was blocked by 112 GOP House legislators.\nThat is a huge change from 2013 when business groups worked with Democratic and GOP Senators to push the “Gang of Eight” cheap-labor-and-amnesty bill. That bill would have delivered roughly 30 million legal immigrants by 2023 and shifted more of the nation’s annual income towards Wall Street.\nWithout more imported workers in Trump’s fast-growing economy, employers are being forced to compete for the current supply of working Americans, sidelined Americans, and the regular inflow of legal immigrants and guest-workers. The Post admitted:\nThere’s only one option right now for most trucking companies: Give substantial raises. Recruiters who show up daily at TDDS [a truck-driving school] are offering jobs that pay $60,000 to $70,000, with full benefits and a $4,000 signing bonus.\nThe Post noted those wages are simply not enough to win enough recruits, partly because trucking is tough career:\nTrucking jobs require people to leave their families for weeks at a time and live in a small “cabin” with a hard bed. Divorces are common, veteran drivers say, and their children forget them. A life on the road is often costly and unhealthy. Drivers sit for hours a day in diesel trucks and pull into truck stops that typically serve greasy hot dogs and chili.\nYet the Post portrayed the long-delayed rise in truckers’ salaries as a threat to employers and investors:\nthe industry simply can’t find a way to move goods as fast and cheaply as they have in the past. This logjam will be especially perilous, economists say, if competition for truckers pushes up prices so quickly that the country faces uncontrolled inflation, which can easily lead to a recession. “This is slowing down the economy already,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group. “If it takes me a week instead of two days to ship products from point A to B, I’m losing potential business.”\nThe newspaper headlined the article “Trucker shortage poses economic threat.”\nThe online headline was “America’s severe trucker shortage could undermine the prosperous economy.”\nFour million Americans turn 18 each year and begin looking for good jobs in the free market — but the government provides green cards to roughly 1 million legal immigrants and temporary work-permits to roughly 3 million foreign workers.\nThe Washington-imposed economic policy of economic growth via mass-immigration shifts wealth from young people towards older people by flooding the market with foreign labor. That process spikes profits and Wall Street values by cutting salaries for manual and skilled labor offered by blue-collar and white-collar employees. The policy also drives up real estate prices, widens wealth-gaps, reduces high-tech investment, increases state and local tax burdens, hurts kids’ schools and college education, pushes Americans away from high-tech careers, and sidelines at least 5 million marginalized Americans and their families, including many who are now struggling with opioid addictions.\nThat cheap-labor economic strategy has stalled wage-growth since the 1960s:\nTrump’s campaign to limit legal and illegal immigration is driving up wages and salaries for Americans in various locations and careers around the country. The beneficiaries include new employees, African-American bakers in Chicago, Latino restaurant workers in Monterey, Calif., disabled people nationwide, high schoolers, resort workers in Hilton Head, construction workers, Superbowl workers, the garment industry, and workers at small businesses, and even Warren Buffett’s railroad workers.\nAddition:\nTruckers’ wages are still below their level in 1990, 1999, and 2002, despite slow growth since 2010, according to Dean Baker, senior economist at the Center for Economic and Policy Research. He wrote:","url":"https://www.breitbart.com/midterm-election/2018/06/29/washpo-rising-trucker-wages-are-economic-threat/"}
