{"authors":[],"date_download":"2018-10-30 14:35:02","date_modify":"2018-10-30 14:35:02","date_publish":"2014-07-11 00:00:00","description":null,"filename":"data/vaneerConsumption/WashPostHeadlineReeksofAntiIsraelBias.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_07_wash_post_headline_reeks_of_antiisrael_bias_1540910102.html","title":"Wash. Post Headline Reeks of Anti-Israel Bias","title_page":"Wash. Post Headline Reeks of Anti-Israel Bias","title_rss":"NULL","source_domain":"americanthinker.com","text":"Wash. Post Headline Reeks of Anti-Israel Bias\nIt’s the biggest, boldest headline on the front page of the July 10 edition of the Washington Post. In huge type, it proclaims: “Israel hits Gaza homes” Below the headline are two smaller-type sub-heads. One, just below the top head, reads: “CHILDREN AND WOMEN KILLED.” The other subhead, in even smaller type, reads: “Netanyahu blames tactics of Hamas.”\nThe clear, lasting impression left with readers is that Israel is deliberately targeting and killing Palestinian civilians in Gaza by attacking their homes. It’s an utter libel. The unexplained Hamas tactics in the smallest-type subhead don’t begin to inform readers that Hamas is using civilians as human shields in an attempt to ward off Israeli counter-attacks. Nor does the headline gives the slightest indication that Israel alerts Gaza residents by phone, leaflets, and other means to get out of the way before striking homes used by Hamas for launchers of rockets aimed at Israeli civilians in southern and central Israel. Even Human Rights Watch, quick to criticize Israel, has condemned Hamas for deliberate attacks on civilians – the opposite of what the Post headline intimates. It’s Hamas that is committing war crimes by targeting civilians in Israel and turning Gaza civilians into human shields. The anti-Israel bias in this front-page headline couldn’t be more odious.","url":"https://www.americanthinker.com/blog/2014/07/wash_post_headline_reeks_of_antiisrael_bias.html"}
