{"authors":[],"date_download":"2018-10-30 14:25:19","date_modify":"2018-10-30 14:25:19","date_publish":"2018-08-20 00:00:00","description":null,"filename":"data/vaneerConsumption/WasMollieTibbettstheVictimofMexicanMachismo.json","image_url":"https://www.americanthinker.com/images/bucket/2018-08/208644.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2018_08_was_mollie_tibbetts_the_victim_of_mexican_machismo_1540909519.html","title":"Was Mollie Tibbetts the Victim of Mexican Machismo?","title_page":"Was Mollie Tibbetts the Victim of Mexican Machismo?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Little did Mollie know, when approached by a 24-year-old illegal Mexican driving a black Chevy Malibu, she probably was being confronted by a cultural inclination that – much like Muslim cultures – considers women inferior to men. Nor is it likely at the time that Mollie realized that the guy following her came from a part of the world where males satisfy sexual appetites any way they see fit.\nRecently, a liberal-leaning American girl named Mollie Tibbetts, totally unaware that the norm that dictates male sexual behavior in Latin and Central American was about to cost her life, went out for an evening run.\nWomen either submit or, in many circumstances, die.\nAnd so, when Mexican illegal Cristhian Bahena Rivera, 24, saw Tibbetts, aged 20, jogging, he did what his culture taught him to do: he \"pursued her in his vehicle.\" A month later, in an Iowa cornfield, Mollie's decaying body was found.\nWith the aid of a Spanish translator following his arrest, Rivera told police that after shadowing the Iowa college student in his car, he \"[l]ater ... parked ... and started running near her.\" Apparently, in Mexico, males stalking females is considered a compliment. Nonetheless, according to Rivera, things changed when, not flattered by the unsolicited attention, Mollie \"grabbed ahold of her phone and said, 'you need to leave me alone. I'm going to call the police.' And then ... took off running.\"\nOn the night of Mollie's death, Rivera likely struggled with the frustration of rejection and the fear that the police would deport him. So, in response, the alleged DREAMer panicked and \"chased [Mollie] down.\" Let's remember: Cristhian Bahena Rivera crossed the U.S. border illegally. Consequently, he was not about to accept \"no\" as an answer from a niña from Iowa.\nRivera told police that after \"blacking out,\" he awoke to find earphones in his lap and Mollie's body in the trunk of his car, bleeding from the head. To cover up the crime, Rivera camouflaged the corpse with corn silk after laying it in a cornfield, where the elements ravaged the girl's body for a month. While Mollie lay decomposing, Rivera continued contributing to the American economy by working illegally on Yarrabee Dairy farm, doing jobs the left says Americans won't do.\nDespite the Mexican illegal claiming on his Facebook page that Guayabillo, Guerrero, Mexico was his home, Cristhian had been milling around small-town Iowa for years. In another chilling account, Rolling Stone magazine reported that a young girl named Bailey Gibson told Mail Online that \"her 17-year-old sister hung out with Rivera a few times and became 'creeped out' by his 'flirty behavior,' and [that] 'she had to keep telling him she wasn't interested'.\"\nIn an interview with Crime Online, a man named Justin said Rivera followed his girlfriend twice \"in the same exact black Malibu\" he drove the night Tibbetts was murdered. Justin said \"Rivera likely followed his girlfriend home and circled around the block in her neighborhood at least two times.\" Crime Online reported that \"around sunset as [Justin's] fiancé[e] made her way home from a grocery store, \"someone driving a black car 'drove past her about six times,' then continued to circle around the neighborhood after she arrived home.\"\nFor the record, in 2016 alone, an estimated seven women a day lost their lives in Mexico to femicide in public locations. Much like Mollie, Mexican women are chased; kidnapped; and, for reasons that sometimes include rebuffing male advances, murdered. Therefore, in light of the vast number of illegals roaming our nation's streets, wouldn't it be in the best interest of America's women to be aware that according to a U.N. Women report, \"14 of the 25 countries with the highest rates of femicide worldwide are located in Latin America\"?\nThat statistic bodes poorly for women like Mollie Tibbetts. Even so, the left continues to grope for a reason to extol the virtues of and make excuses for the culturally diverse practices of people like Cristhian, who migrated illegally to America from a third-world hellhole.\nAccording to a 2017 Global Citizen article, which names a report from Mexico's interior department, the National Women's Institute, and U.N. Women, in Mexico, \"[r]oughly two in five of all homicides against women take place outside of the home ... and unlike homicides of men, women are more likely to be killed without a firearm through means such as strangling and stabbing.\" Mollie died outside her home of \"multiple sharp force injuries.\"\nNotwithstanding all the evidence, Democrats continue to wave hordes of illegal males over the border. Moreover, to downplay liberal culpability in Mollie's murder, a left-wing pundit had the gall to cite \"toxic masculinity,\" rather than lax immigration policies, as the cause for an illegal alien stalking, kidnapping, and then doing God knows what before killing an American girl.\nEven Fox News contributor Geraldo Rivera maintained that Cristhian's illegal status had nothing to do with Mollie Tibbetts ending up dead. The stupidity of Geraldo's premise is comparable to a father insisting that the rapist he invited to sleep in his daughter's bedroom isn't the reason the rapist sleeping in her room raped his daughter.\nWhat open borders Democrats fail to acknowledge is that in Mexico and Central and Latin America, as well as Middle Eastern culture, \"toxic masculinity\" is a culturally accepted norm. Therefore, it stands to reason that importing machismo behavior and discouraging assimilation will continue to encourage illegal men to treat other American women as Cristhian Bahena Rivera treated Mollie Tibbetts.\nJeannie hosts a blog at www.jeannie-ology.com.","url":"https://www.americanthinker.com/articles/2018/08/was_mollie_tibbetts_the_victim_of_mexican_machismo.html"}
