{"authors":["Jeff Poor"],"date_download":"2018-10-30 20:23:57","date_modify":"2018-10-30 20:23:57","date_publish":"2016-01-17 22:46:54","description":"Sunday on CNN's \"Reliable Sources,\" Democratic National Committee chairwoman Rep. Debbie Wasserman Schultz (D-FL) denied her organization was trying to |","filename":"data/vaneerConsumption/WassermanSchultzDeniesDNCIsAttemptingtoLimitDebateExposure.json","image_url":"https://media.breitbart.com/media/2016/01/DWS117.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_17__1540931037.html","title":"Wasserman Schultz Denies DNC Is Attempting to Limit Debate Exposure","title_page":"Wasserman Schultz Denies DNC Is Attempting to Limit Debate Exposure | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sunday on CNN’s “Reliable Sources,” Democratic National Committee chairwoman Rep. Debbie Wasserman Schultz (D-FL) denied her organization was trying to limit exposure to her party’s candidates by having a debate schedule that isn’t designed to maximize viewership.\nWasserman Schultz told host Brian Stelter that in fact those debates are getting higher viewership than ever before.\nTranscript as follows:\nBRIAN STELTER, CNN ANCHOR: Now, tonight, in Charleston, South Carolina, Bernie Sanders, Hillary Clinton, Martin O’Malley will debate each other for just the fourth time this primary season.\nBut you could be forgiven for not knowing that there is a debate tonight, because there’s not a lot of buzz about it. It’s happening during a three-day holiday weekend, and the last one was held on the Saturday before Christmas.\nMeanwhile, their GOP counterparts have already faced off six times. So, let me show you a chart that illustrates the difference. These are the ratings for all the debates so far. The red bars are the ratings for the GOP debates topping out at 25 million viewers, thanks in large part to Donald Trump. The blue bars are the lower- rated Democratic debates.\nEven the FOX Business debate a few days ago, that GOP debate had 11 million viewers, which is higher than the recent Democratic debates.\nNow, Sanders and O’Malley have been vocal about wanting more debates. I’m not so sure Clinton has been quite as vocal. But this morning’s “New York Times” says some Clinton advisers are now regretting that. They’re wishing they had pushed for more debates.\nSo, I wonder, could any more be added to the schedule?\nLet’s ask DNC Chairwoman Debbie Wasserman Schultz. She’s in Charleston at the site of the debate.\nCongresswoman, I know you have said you don’t want an explosion of debates, that there were too many in past cycles. But are you considering adding maybe just one or two more?\nREP. DEBBIE WASSERMAN SCHULTZ (D-FL), DNC CHAIR: Brian, we’re thrilled to be here in Charleston, South Carolina, for our fourth Democratic primary debate over Dr. Martin Luther King weekend.\nAnd you know that this was a very important and specifically appointed reason that we brought our debate here to Charleston, South Carolina, and had it over Martin Luther King weekend. Our main debate partners, the Congressional Black Caucus Institute, as well as the South Carolina Democratic Party, asked us to host the South Carolina debate over the Martin Luther King weekend.\nAnd then, of course, when we had the tragedy of the Emanuel nine happen, it became even more poignant and important. So, we’re very proud to be hosting this debate over Martin Luther King weekend.\nAnd it gives us an opportunity to talk about the issues that are critically important for the African-American community and to helping people reach the middle class, and draw the really stark and clear contrast that we have from the Republican debate in North Charleston, which was blocks from the Mother Emanuel Church, and yet all of their candidates criticize President Obama for having the nerve to suggest and adopt policy that would prevent people who shouldn’t have guns from being able to get them.\nSTELTER: You scheduled it in Charleston. I hear you on that, but why a Sunday night? Sunday night is “Downton Abbey” night. Sunday night is “Madam Detective” night. Sunday night is a terrible time to have a debate, because there are so many great shows on.\nDon’t you think that is going to hurt your ratings? And isn’t it in your interests to have high ratings for these debates?\nWASSERMAN SCHULTZ: We’re very interested in having high ratings for our debates.\nIn fact, we’re very proud that we actually have had record viewership for our Democratic primary debates. In fact, Brian, 58 out of the — our debates have actually bested the viewership of 58 out of the last 61 primary debates in 2008 and 2012.\nIn fact, our first debate beat at least two of the Republican debates. And our last debate, compared to the Republican last debate, was just — just a little bit less than theirs.\nSo, even the debate on the six days before Christmas had almost as high a viewership as our prior debate. We have had a collection of robust viewership that, again, has broken our records for prior debates. And, frankly, we have had, more importantly, a much more substantive and serious discussion, where Americans have a chance, instead of watching the food fight happening on the other side of the aisle, get to hear our candidates talk about how they are going to meet — move our country forward.\nSTELTER: Obviously, it’s in television networks’ interests to have more debates, but it sounds to me like you’re not wiggling at all. There’s no indication that you may add some to the calendar in the next couple of months.\nWASSERMAN SCHULTZ: You know, Brian, it’s really important that we have the candidates have a variety of opportunities to be seen by voters.\nWe have had candidate forums and we will be having additional forums going forward. We have had our debates.\n(CROSSTALK)\nSTELTER: But that is what — but that is what kind of frustrates me.\n(CROSSTALK)\nSTELTER: The Fusion forum earlier this week, the Black and Brown Forum, the ratings were — you couldn’t even see the ratings, they were so low on the Fusion network.\nI feel like your all’s voices aren’t getting heard the way they could be if there were more of these events.\nWASSERMAN SCHULTZ: Well, we believe strongly that a combination of opportunities for voters to see our candidates and make sure that we’re not pulling them off the campaign trail every other day to prepare for a debate.\nWe have an early primary state window for a reason, so voters can get that up-close and personal look, and make sure that, unlike in later primaries, where there’s a big collection on multiple Tuesdays and harder for the candidates to spend that close-up time, that we’re giving those candidates and the voters an opportunity to have that really up-close and personal kick-the-tires time.\nAnd a lot more debates would take away from that. Brian, there’s no number of debates that will satisfy everyone. So, I did my best to make sure, along with my staff and along with our debate partners, to come up with a schedule that we felt was going to allow for the — to maximize the opportunity for voters to see our candidates.\nSTELTER: I agree with you. There’s no amount that would satisfy everyone.\nOn the other hand, your all’s next debate is February 11. It’s after Iowa and New Hampshire. The GOP has two more between now and then. It just seems to me like we’re learning a lot more about those candidates.\nWASSERMAN SCHULTZ: Well, keep in mind, Brian, they have…\nSTELTER: I’m sorry. Go ahead.\nWASSERMAN SCHULTZ: They have a dozen candidates, and we have three.\nSo, I mean, I understand that they have got a reality TV star that is attracting a lot of train wreck, you know, you shouldn’t watch, but you can’t help yourself-type interest.\nYou know, on our side, we’re getting record viewership for our debates. And we have had three up to now, and this is our fourth. And that’s because voters really care about the issues.\nThey really care about hearing how their candidates for president are going to continue to build on the job growth that we have had, the 70 straight months of private sector job growth, how we were able to pull us out of the worst economic crisis, and how we’re going to continually keep moving us forward.\nSTELTER: T-minus…\nWASSERMAN SCHULTZ: On the other side, they like watching, in the same way that they like watching a train wreck.\nSTELTER: T-minus nine hours to Charleston.\nCongresswoman, thank you for being here this morning.\nWASSERMAN SCHULTZ: Looking forward to it. Thank you.","url":"https://www.breitbart.com/politics/2016/01/17/wasserman-schultz-denies-dnc-is-attempting-to-limit-debate-exposure/"}
