{"authors":["Emma Madden"],"date_download":"2018-10-31 01:46:18","date_modify":"2018-10-31 01:46:18","date_publish":"2018-09-11 16:55:14","description":"Friends, which followed the lives of six New Yorkers who could inexplicably afford real estate near Central Park, was a triumph. It became the world's most popular comedy, as well as arguably the most heterosexual. Ross and Rachel's on-again,…","filename":"data/vaneerConsumption/WasThereMoreIncestOnFriendsThanLGBTQContentWhenYouLookCloselyItWasKindaMessedUp.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/7/b67315da-c383-4841-989a-a64b411699e5-08.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_was-there-more-incest-on-friends-than-lgbtq-content-when-you-look-closely-it-was-kinda-messed-up-11788127_1540950378.html","title":"Was There More Incest On 'Friends' Than LGBTQ Content? When You Look Closely, It Was Kinda Messed Up","title_page":"Was There More Incest On 'Friends' Than LGBTQ Content? When You Look Closely, It Was Kinda Messed Up","title_rss":"NULL","source_domain":"bustle.com","text":"Friends, which followed the lives of six New Yorkers who could inexplicably afford real estate near Central Park, was a triumph. It became the world's most popular comedy, as well as arguably the most heterosexual. Ross and Rachel's on-again, off-again relationship kept viewers captivated for 10 seasons, while myself and the rest of the gays screamed \"don't go there, sis\" from the start. Sure, it had Carol and Susan, but it also had sexy cousins, and Ross and Monica cuddling up on the couch every other episode. Now, looking back, was there more incest on Friends than LGBTQ content?\nAn admission: I, like everyone else, loved Friends. It was my comfort place, it was my regular place. I'd come home to it after a day of being bullied at school and dream of having a friendship group like it. I dreamed of it the same way others dreamed of owning Chad Michael Murray flavoured lipgloss. Then when I went to university, I found my friends. I had my people and my comfort, and they were real. Sometime around 2015, I decided to rewatch it. Now that I'd grown up, come out, discovered my own values — I no longer felt comforted by the show, but a little disturbed by it.\nWarner Bros / Comedy Central\nThat's not to say there aren't still great moments. I still laugh at Ross' spray tan and his teeth whitening debacle (basically anything at Ross' expense), but I'm no longer alone in my general grossed out feeling towards the show. Now that we're living in the era of wokeness, UK viewers took a distaste to the show when it came to Netflix back in January. In that month i-D asked \"could friends *be* any more problematic?\" in a piece which derided the show for regularly making homosexuality a joke. The Independent also chastised it for Chandler's gay paranoia storyline, while queer website Them picked up on Friends' rampant transphobia.\nEven its saving graces didn't quite rescue Friends from the pit of problematic. While Carol and Susan (the couple who got together after Carol left Ross for another woman — HA! *eye roll*) were there from the start, you won't see any same sex intimacy on Friends. Ross got to kiss dozens of women throughout the 10 seasons. But Carol and Susan didn't even get an onscreen kiss at their wedding. Seriously, a quick shoulder rub between them might have been the raunchiest and gayest moment in Friends' decade spanning long run.\nFavorite Videos on YouTube\nWhile actual acts of gay intimacy were kept far, far away, Friends certainly didn't hold back on the incest. In fact, incest is far more visible on the show than anything LGBTQ. I'm even in envy of the representation incest got. Sure, it was the butt of many jokes, but at least the acts of — cannot believe I'm typing this — incest were visible. Phoebe gave birth to her brother's triplets (I know not literally, but you know what I mean); a man Rachel dates in season 5 is all over his sister and takes a bath with her; Monica and Ross both have the hots for their cousin; Monica's first kiss was with her brother. And yes, while I'm on the subject of Ross and Monica — Friends' unofficial apostles of incest — who touches their sibling that much?!\nIn a sad way, it makes sense. The '90s were a dark time — Bob Dole's impotence campaign, the macarena, Whoopi Goldberg dating Ted Danson. But let's not forget that in the '90s, and until even more recently than that, first cousin marriages were legal in more states than gay marriages, as Advocate reports. I guess when you think of it like that, Friends really was a reflection of its time.","url":"https://www.bustle.com/p/was-there-more-incest-on-friends-than-lgbtq-content-when-you-look-closely-it-was-kinda-messed-up-11788127"}
