{"authors":["Breitbart Tv"],"date_download":"2018-10-30 18:25:17","date_modify":"2018-10-30 18:25:17","date_publish":"2016-02-24 15:25:02","description":"Earlier this week, Gonzaga University in Spokane, WA announced it had reconsidered its previous decision to not to open Dinesh D'Souza's Young America’s |","filename":"data/vaneerConsumption/WatchLiveGonzagaCavesWontShutPublicOutofDineshDSouzaSpeech.json","image_url":"https://media.breitbart.com/media/2015/07/dinesh-AP1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_24__1540923917.html","title":"Watch Live: Gonzaga Caves, Won’t Shut Public Out of Dinesh D’Souza Speech","title_page":"Watch Live: Gonzaga Caves, Won’t Shut Public Out of Dinesh D’Souza Speech | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Earlier this week, Gonzaga University in Spokane, WA announced it had reconsidered its previous decision to not to open Dinesh D’Souza’s Young America’s Foundation-sponsored lecture to the public.\nStudents informed Young America’s Foundation that an administrator had referred to D’Souza as a “nasty guy,” claimed he contradicted the school’s “social justice mission,” and refused to allow members of the public to attend his lecture.\nA torrent of media coverage alarmed the local community and student leaders worked hard to apply pressure to the school.\nBen Dubois, chair of Gonzaga’s campus conservative club, told YAF: “There was an appeal process straight to our school president. He told us that he was not allowed to state his opinion until we appealed. He had a few concerns about as many students who wanted to go would be able to and thus he came up with a two stage ticketing process where tickets are open to Gonzaga students and faculty first. He overturned the original ruling of the school to keep the event closed to the public.\nDinesh D’Souza will speak at Gonzaga University on February 24 at 10:00 PM as part of Young America’s Foundation’s Wendy P. McCaw Freedom Lecture Series.\nFollow Breitbart.tv on Twitter @BreitbartVideo","url":"https://www.breitbart.com/politics/2016/02/24/watch-live-gonzaga-caves-wont-shut-public-out-of-dinesh-dsouza-speech/"}
