{"authors":["Jerome Hudson"],"date_download":"2018-10-30 20:20:25","date_modify":"2018-10-30 20:20:25","date_publish":"2016-06-17 19:30:44","description":"Video showing pop sensation Justin Bieber taking a fall during a concert in Canada on Thursday night is going viral on social media.","filename":"data/vaneerConsumption/WATCHJustinBieberTakesNastyFallOffStage.json","image_url":"https://media.breitbart.com/media/2016/06/Bieber1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_06_17__1540930825.html","title":"WATCH: Justin Bieber Takes Nasty Fall Off Stage","title_page":"WATCH: Justin Bieber Takes Nasty Fall Off Stage","title_rss":"NULL","source_domain":"breitbart.com","text":"Video showing pop sensation Justin Bieber taking a nasty fall during a concert in Saskatoon, Canada, on Thursday night is going viral on social media.\nThough the Sorry singer has been performing in front of large crowds for nearly a decade, he somehow managed to fall into one of the trap doors on the stage.\nThere is a shortage of footage showing the 22-year-old star taking an unfortunate plunge.\n#JustinBieber took a big tumble at his show last night. Hope he's okay! 😢 A video posted by EntertainmentForBreakfast (@entertainmentforbreakfast) on Jun 17, 2016 at 5:58am PDT\nHere is another video, from a different angle, which shows the singer falling.\n@JustinBieber knows how to make a dramatic exit!! FALLING HARD in his concert in Saskatoon, Canada on Thursday night. Tag the biggest Bieber fan you know! PerezHilton.com/JustinBieber A video posted by Perez Hilton (@theperezhilton) on Jun 17, 2016 at 1:01am PDT\nAfter taking that terrible tumble, Bieber hopped back onstage to the sound of screaming fans.\n“Good thing I’m like a cat and I landed on my feet!” he told the crowd, as seen in the video below. “That scared the sh*t out of me.”\nBieber is currently in the midst of his Purpose World Tour, which kicked off last March in Seattle.\nHe tweeted about Thursday’s performance, but he failed to mention his slip.\nFollow Jerome Hudson on Twitter @jeromeehudson.","url":"https://www.breitbart.com/entertainment/2016/06/17/watch-justin-bieber-takes-nasty-fall-off-stage/"}
