{"authors":["Mary Kate Mcgrath"],"date_download":"2018-10-31 00:02:16","date_modify":"2018-10-31 00:02:16","date_publish":"2018-10-28 17:17:36","description":"Halloweekend is almost over, and the celeb costumes did not disappoint this year. On Saturday, Noah Centineo dressed up as Gaston from Beauty and the Beast, and his costume choice could not be more perfect. According to E!, Centineo rolled up to the…","filename":"data/vaneerConsumption/WatchNoahCentineoRossButlerMadeAllOfYour90sHalloweenDreamsComeTrueVIDEO.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/28/7b3de203-0b1f-4e21-af5d-af9a6e31d56b-getty-1054088980.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_watch-noah-centineo-ross-butler-made-all-of-your-90s-halloween-dreams-come-true-video-13009512_1540944136.html","title":"Watch Noah Centineo & Ross Butler Made All Of Your '90s Halloween Dreams Come True - VIDEO","title_page":"Watch Noah Centineo & Ross Butler Made All Of Your '90s Halloween Dreams Come True — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Halloweekend is almost over, and the celeb costumes did not disappoint this year. On Saturday, Noah Centineo dressed up as Gaston from Beauty and the Beast, and his costume choice could not be more perfect. According to E!, Centineo rolled up to the Casamigos Halloween Party in Los Angeles, and he pulled out all the stops with his costume.\nGaston is the arrogant villain whose love for Belle goes unrequited in the Disney film, and the To All the Boys I've Loved Before star's costume came complete with fake pillow abs and brown boots. A live-action Beauty and the Beast was released in 2017, that also featured Gaston, but it looks like Centineo chose to wear the character's outfit from the original '90s film.\nThe Casamigos Party is hosted by businessman Rande Gerber and his wife Cindy Crawford. According to W Magazine, the spooky event was attended by many notable Hollywood actors including Harry Styles, Zoë Kravitz, Olivia Munn, and Nina Dobrev. The To All the Boys I Loved Before actor spent the night hanging out with his fellow Netflix star, Ross Butler, who was dressed as the superhero Wolverine — the classic comic book version. Butler is best known for his role as Zach Dempsey in 13 Reasons Why, and it looks like he's become close pals with Centineo.\nOn Instagram, Butler shared a video of himself dancing with Centineo to Ludacris' \"Stand Up\", captioning it: \"When Wolverine and Gaston tell you to move, you do whatever you want because you're strong and independent.\"\nCentineo also shared a photo with Butler from the party on Instagram, reposting a picture of holding the 13 Reasons Why actor princess style. The star gave the picture a caption as well, writing:\n\"Everyone's invited to the wedding.\"\nIt's looks like the party was a blast for both stars, and it's not the first time this month that Centineo got into the Halloween spirit. Last week, the star shared a picture of his Waldo costume, writing: \"Waldo’s been in Los Angeles this whole time.\"\nWaldo's signature striped shirt made for a more simple costume than Gaston, but it didn't stop Centineo from taking part in more Halloween events. On Friday, the actor attended Halloween Horror Nights at the Universal Studios. He posted a hilarious picture from the theme park on social media, where he can be seen crouching opposite one of the scary ghouls from the haunted park. The funny caption on the photo read: \"My girlfriend and I had a fight last night.\"\nTommaso Boddi/Getty Images Entertainment/Getty Images\nIt's been an eventful month for Centineo, who booked his first high-profile Hollywood role as the love interest in the Charlie's Angel's reboot. Director Elizabeth Banks confirmed the casting on Twitter, welcoming Centineo on board. The actor will join an all-star cast, including Kristen Stewart, Naomi Scott, Ella Balinska, and Patrick Stewart. According to Variety, the film is slated to premiere in September of 2019.\nIn between the Halloween festivities, Centineo took a moment to acknowledge the major year ahead in his career. He shared a portrait on social media and wrote:\n\"2018 set up 2019 for us. I can't wait for y'all to watch what's coming next. Don't even get me started on 2020\"\nThe star has yet to reveal more casting news, but it seems likely he will take on more major roles in the next year. While fans can hope this will include a To All The Boys I've Loved Before sequel, odds are that could be just one of many projects the actor chooses to take on.\nGiven the busy schedule ahead, it's probably for the best that Centineo got the chance to relax and celebrate Halloween. It's clear that he loves the spooky holiday, and his costume choices were on point. Of all the costumes we've loved before, this Gaston truly might be the best.","url":"https://www.bustle.com/p/watch-noah-centineo-ross-butler-made-all-of-your-90s-halloween-dreams-come-true-video-13009512"}
