{"authors":["Charlie Spiering"],"date_download":"2018-10-30 21:35:19","date_modify":"2018-10-30 21:35:19","date_publish":"2015-12-18 16:24:09","description":"Obama struggled with the phone, first forgetting to reverse the camera and forgetting the passcode and accidentally turning the phone off.","filename":"data/vaneerConsumption/WatchPresidentObamaLeaderOfTheFreeWorldStruggleToUseASmartPhone.json","image_url":"https://media.breitbart.com/media/2015/12/Obama-phone.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_18__1540935319.html","title":"Watch President Obama - Leader Of The Free World - Struggle To Use A Smart Phone","title_page":"Watch President Obama - Leader Of The Free World - Struggle To Use A Smart Phone | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The full episode of President Obama’s appearance in an episode of Running Wild With Bear Grylls aired last night, revealing that the president isn’t very good at using a smartphone.\nAfter Grylls suggested that they take a selfie together in front of a glacier in Alaska, Obama appeared enthusiastic to participate.\n“I got my phone too,” he said proudly, flashing an iPhone.\nBut he struggled with the phone as he raised it up to snap a shot, first forgetting to reverse the camera into selfie mode and then forgetting the passcode and accidentally turning the phone off.\n“Oh c’mon Mr. President, you’ve done it again this is excruciating,” Grylls laughed as Obama continued to struggle with the device.\n“This is a sign that I don’t have a smartphone,” Obama admitted, pointing out that because of Secret Service orders, he wasn’t allowed to have one.\nOnce Obama was finally able to successfully snap a selfie, his finger was clearly in the shot.\nThere was no sign of his widely hailed presidential BlackBerry that was specially designed for his use in the White House when he first took office in 2009.\n“I’m sure my girls are gonna be mortified by my lack of technological prowess,” Obama admitted ruefully to the cameraman after the event. “It’s possible you guys could edit that out. Maybe not.”","url":"https://www.breitbart.com/politics/2015/12/18/watch-president-obama-leader-free-world-struggle-use-smart-phone/"}
