{"authors":[],"date_download":"2018-10-30 21:57:54","date_modify":"2018-10-30 21:57:54","date_publish":"2016-04-19 10:01:00","description":"(Reuters) - Dozens of migrants stranded on Greece's northern border with Macedonia hurled stones at police, a Reuters witness said, after one man living | London / Europe","filename":"data/vaneerConsumption/WATCHMigrantsRiotHurlStonesAtPoliceAndTearDownGreekBorderFence.json","image_url":"https://media.breitbart.com/media/2016/04/Screen-Shot-2016-04-19-at-10.50.53.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_04_19__1540936674.html","title":"WATCH: Migrants Riot, Hurl Stones At Police And Tear Down Greek Border Fence","title_page":"WATCH: Migrants Riot, Hurl Stones At Police And Tear Down Greek Border Fence | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"(Reuters) – Dozens of migrants stranded on Greece’s northern border with Macedonia hurled stones at police, a Reuters witness said, after one man living in the sprawling tent city near the town of Idomeni was injured by a police van.\nPolice fired teargas to break up the crowd.\nSome migrants said the man had fainted as he left his tent and was then hit by the van. A small pool of blood could be seen on the ground. The man was taken to a local hospital and was not seriously hurt, Greek media said.\nIt was not immediately clear what caused the accident.\nMigrants tried to tear down the razor wire fence between the two countries last week but were blocked by Macedonian forces and dozens were wounded when Macedonian police fired teargas and rubber bullets at them.\nA million migrants, many fleeing Syria, Iraq, Afghanistan and other countries in conflict in the Middle East, Asia and Africa have poured into Europe through Greece since last year.\nThose camped at Idomeni are among some 53,000 migrants and refugees stranded in Greece following border closures across the Balkans, the preferred route to western Europe.\nEarlier on Monday, Greek police tried to persuade dozens to leave as they protested on the railway tracks that pass through the camp into Macedonia. Most refused.\nThe tracks have been blocked by the migrants for about a month, forcing trains to re-route through Bulgaria. Wagons loaded with goods have been stranded on the tracks for weeks.\n“The police come every day and ask us to open the railway but this is our final hope,” said a Syrian man who gave his name as Abdul. “If we let them open the rail lines we will be forgotten here.”\n(Reporting by Stoyan Nenov and Fedja Grulovic; Writing by Karolina Tagaris; Editing by Tony Jimenez)","url":"https://www.breitbart.com/europe/2016/04/19/watch-migrants-riot-hurl-stones-at-police-and-tear-down-greek-border-fence/"}
