{"authors":["Jerome Hudson"],"date_download":"2018-10-30 21:46:31","date_modify":"2018-10-30 21:46:31","date_publish":"2016-07-29 20:54:53","description":"One America News Network is airing the explosive documentary film Clinton Cash this Saturday and Sunday at 5 pm EST, making the 105-minute film that exposes the alarming pattern of corruption at the Bill, Hillary, and Chelsea Clinton Foundation available to a wider audience. | Entertainment","filename":"data/vaneerConsumption/WatchClintonCashThisWeekendonOneAmericaNewsNetwork.json","image_url":"https://media.breitbart.com/media/2016/07/CC-OAN.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_07_29__1540935991.html","title":"Watch 'Clinton Cash' This Weekend on One America News Network","title_page":"Watch 'Clinton Cash' This Weekend on One America News Network | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"One America News Network is airing the explosive documentary film Clinton Cash this Saturday and Sunday at 5 pm EST, making the 105-minute film that exposes the alarming pattern of corruption at the Bill, Hillary, and Chelsea Clinton Foundation available to a wider audience.\n“Whether your political views lean to the right or left, there’s nothing worse than politicians that abuse their power for personal gain,” One America News Network President Charles Herring told Breitbart News in an email.\n“Too many times we’ve seen elected officials take a position on an issue that isn’t based on fundamental values or what’s good for the people, but rather what will line their own pockets,” Herring said. “Pay to play arrangements in our government need to be highlighted by media. We’re pleased to bring Clinton Cash to our viewers who can decide for themselves the value of this program.”\nThe motion picture adaptation of the groundbreaking New York Times bestselling book Clinton Cash was directed by M.A. Taylor and was written and produced by Danny Fleutte and Breitbart News Executive Chairman Stephen K. Bannon. The film exposes the record-high speaking fees to Bill Clinton and donations to the Clinton Foundation from foreign contributors, which coincided with favors for those closest to the Clintons and their foundation donors while Hillary Clinton served as Secretary of State.\n“The Clinton Cash documentary has been viewed over 1.6 million times in the first week of its global online premiere and was the #1 trending story on U.S. Facebook during the first three days of the Democratic National Convention,” Fleutte told Breitbart News. “It’s rewarding to see One America News Network recognize the public’s appetite for this documentary film that took thousands of hours of investigative research.”\nOne America News took to social media to promote the airing of Clinton Cash.\nTune in to #OANN Saturday (July 30th) and Sunday (July 31st) at 5pmET for @ClintonCashFilm. pic.twitter.com/URy5Msj7p8 — One America News (@OANN) July 28, 2016\nViewers can watch Clinton Cash on One America News Network on AT&T U-Verse TV channel 208/1208, Verizon FiOS TV channel 116/616, , Frontier Communications ch. 116/616, CenturyLink PRISM TV ch. 208/1208, GCI Cable ch. 64, Consolidated Communications, Duncan Cable, Buckeye CableSystems, GVTC and numerous additional video providers.\nOne America News Network provides national and international news 24 hours a day, seven days a week, offering 21 hours of live news coverage plus two nightly, political talk shows — The Daily Ledger and Tipping Point. Additional information is available at www.oann.com.\nFollow Jerome Hudson on Twitter: @jeromeehudson","url":"https://www.breitbart.com/entertainment/2016/07/29/watch-clinton-cash-weekend-one-america-news-network/"}
