{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 19:36:26","date_modify":"2018-10-30 19:36:26","date_publish":"2015-04-16 21:15:28","description":"J.J. Abrams unveiled the second trailer for Star Wars: Episode VII - The Force Awakens during Thursday's kickoff panel for the Star Wars Celebration in Anaheim |","filename":"data/vaneerConsumption/WATCHNewStarWarsTheForceAwakensTrailer.json","image_url":"https://media.breitbart.com/media/2015/04/han-solo-force-awakens.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_04_16__1540928186.html","title":"WATCH: New 'Star Wars: The Force Awakens' Trailer","title_page":"WATCH: New 'Star Wars: The Force Awakens' Trailer | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"J.J. Abrams unveiled the second trailer for Star Wars: Episode VII – The Force Awakens during Thursday’s kickoff panel for the Star Wars Celebration in Anaheim.\nThe 2-minute clip begins with a monologue from Luke Skywalker about the power of the Force in his family, spoken over the haunting notes of John Williams’ score. Quick shots of Darth Vader’s burned-up helmet, TIE fighters, X-wings, the new laser-hilt lightsaber, stormtrooper John Boyega, and a Millennium Falcon chase sequence fill the screen, before the trailer ends with a goosebumps-inducing first look at some old characters.\n“Chewie,” says a silver-haired Han Solo, standing in what appears to be the hull of the Millennium Falcon. “We’re home.” Cue the Wookie’s signature growl\nThe trailer’s release was timed to the first day of the Star Wars Celebration, a four-day convention on all things Star Wars taking place in Anaheim from April 16-20. Director J.J. Abrams was on hand Thursday morning to kick off the festival along with producer Kathleen Kennedy. The Celebration features panel discussions with original series stars Carrie Fisher, Mark Hamill and Billy Dee Williams, as well as updates on EA’s new Star Wars video game and even a tattoo contest.\nThe Star Wars Celebration will be live-streamed all weekend on StarWars.com.\nStar Wars: Episode VII – The Force Awakens is set to open on December 18. The film reunites original cast members Mark Hamill (Luke Skywalker), Carrie Fisher (Princess Leia), Harrison Ford (Han Solo), Anthony Daniels (C-3PO), Kenny Baker (R2-D2) and Peter Mayhew (Chewbacca), while bringing on newcomers like Oscar Isaac, Daisy Ridley, John Boyega, Lupita Nyong’o and Andy Serkis.\nCheck out the new trailer above.","url":"https://www.breitbart.com/entertainment/2015/04/16/watch-new-star-wars-the-force-awakens-trailer/"}
