{"authors":[],"date_download":"2018-10-30 01:12:24","date_modify":"2018-10-30 01:12:24","date_publish":"2018-08-10 16:02:00","description":"The Perseid meteor shower, which occurs every August due to debris left behind from Comet Swift-Tuttle, is almost here. Here's what you need to know about the August 11-13 shows.","filename":"data/vaneerConsumption/WatchmeteorshowerAugust2018.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/08/Videos/4456916.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_world_perseid-meteor-s_e5d71b281852bf804319f8cf473376d6__1540861944.html","title":"Watch meteor shower August 2018","title_page":"Perseid meteor shower 2018: Watch meteor shower August 2018","title_rss":"NULL","source_domain":"ajc.com","text":"The Perseid meteor shower, which occurs every August due to debris left behind from Comet Swift-Tuttle, is almost here.\n» RELATED: This is the best place to see the Perseid meteor shower in Georgia\nAccording to experts at Space.com, the shower will peak during overnight hours as Aug. 11 turns into Aug. 12 and again overnight Aug. 12-13. While both shows will be magical, the latter may be just a little better, NASA meteor expert Bill Cooke told Space.com.\nAt peak, meteors will race at rates of about 60-70 meteors per hour, up from last year’s rate (40 to 50 per hour), but not as glamorous as it was in 2016, when 150-200 meteors bursted per hour.\n» RELATED: Photos: Perseid meteor shower brightens the night sky\n“This year the moon will be near new moon, it will be a crescent, which means it will set before the Perseid show gets underway after midnight,” Cooke said. “The moon is very favorable for the Perseids this year, and that'll make the Perseids probably the best shower of 2018 for people who want to go out and view it.”\nWhen to see the Perseid meteor shower\nMeteors streak above the Wyoming countryside early Tuesday morning north of Cheyenne in this time-elapsed photo. The past couple nights were the peak of the Perseids Meteor Shower, which run from mid-July through mid-August. The shower, which gets its name from the constellation, Persus, are the remants from the comet Swift-Tuttle, which last past through in 1992 and won't pass by again until the year 2125. (AP Photo/The Wyoming Tribune Eagle, Blaine McCartney) (Blaline McCartney)\nYou’ll be able to catch the popular meteor shower as Earth passes through the path of Comet Swift-Tuttle (July 17 to Aug. 24), but if you want to best views, it’s all about catching it at peak time. And according to Astronomy magazine and NASA’s Bill Cooke: the predawn hours of August 13 will be ideal.\n» RELATED: 9 best places to see the stars —the real ones —around Atlanta\nWhere to see the Perseid meteor shower\n(Photo by Ali Ihsan Ozturk/(Anadolu Agency)/Getty Images) (Anadolu Agency)\nThe Northern Hemisphere down to the mid-southern latitudes is prime real estate for this year’s show, Space.com reported.\nThanks to Active Junky, a sister site of Space.com, even city dwellers can get in on the fun, despite all the light pollution.\n» RELATED: 9 best places to see the stars —the real ones —around Atlanta\nIn Atlanta, Active Junky advises city dwellers in or nearby the bright buildings, traffic and other sources of light pollution, to travel to the following areas:\nStephen C. Foster State Park\n17515 Highway 177\nFargo, GA 31631\nDrive time from metro Atlanta: Four hours and a half hours\nThis Okefenokee Swamp park was voted one of the best spots in the world for star gazing last year by the International Dark Sky Association for its vast skies and minimal light pollution.\nThe remote Georgia park is perfect for viewing all things celestial, including the famed Perseid meteor shower in August.\nMake your reservations at one of the park’s 64 campsites.\nNorth Georgia mountains\nThe beautiful mountains in northeast Georgia make for ideal campgrounds during the Perseid shower.\nSome popular campgrounds near the mountains can be found at Moccasin Creek State Park and Cooper’s Creek Recreational Area.\nMoccasin Creek State Park\n3655 Georgia Hwy197\nClarkesville, GA 30523\nDrive time from metro Atlanta: Less than two hours\nMake reservations at one of Moccasin Creek’s 54 campsites.\n» RELATED: How to see the Milky Way - nearly free and clear - in Georgia\nCooper’s Creek Recreational Area\n6050 Appalachian Hwy\nSuches, GA 30572\nDrive time from metro Atlanta: Approximately two hours\nCampgrounds are first-come, first-serve.\nHere are the best star-gazing locations to catch the Perseid meteor shower in or near the nation’s other biggest cities, according to Active Junky:\nChicago, Illinois\nIndiana Dunes State Park\nSilver Springs State Park\nHeadlands International Dark Sky Park in Mackinaw City, Michigan\nHouston, Texas\nBrazo Bend State Park\nSam Houston National Forest\nHouston Museum of Natural Science\nLos Angeles, California\nAngeles National Forest\nSanta Monica Mountains\nTopanga State Park\nMalibu Creek State Park\nMiami, Florida\nEverglades National Park\nLaBelle, Florida\nLorida, Florida (Kissimmee River public area)\nNew York, New York\nFloyd Bennett Field in Brooklyn\nCarl Schurz Park in the Upper East Side\nJamaica Bay on Ruffle Bar Island\nCedar Point County Park on Long Island\nNorth-South Lake Campground\nPhiladelphia, Pennsylvania\nFrench Creek State Park\nDelaware Water Gap National Recreation Area\nCherry Spring State Park\nSproul State Forest\nHooversville, Pennsylvania\nPhoenix, Arizona\nTres Rios Wetlands\nLake Pleasant\nSun Valley Parkway\nSeattle, Washington\nDash Point State Park\nSalt Water State Park\nKayak Point Park\nMary E. Theler Wetlands Nature Preserve\nWashington, D.C.\nShenandoah National Park, Virginia\nGreenbelt National Park\nBurke Lake Park\nSky Meadow State Park\nRead more at ActiveJunky.com.\nHow to see the Perseid meteor shower\nDark and vast skies are essentially all you need to take in the sights of the Perseid meteor shower.\nWith peaks during overnight hours, you may also want to dress in warm clothes, bring a blanket or lawn chair to sit on, a snack and water and some bug spray.\nIf you want to watch the spectacle from the comfort of your bed, NASA also typically launches a UStream via their NASA TV channel.","url":"https://www.ajc.com/news/world/perseid-meteor-shower-2018-how-and-when-watch-the-sky-best-show-the-year/z38vgMju4GvdpyT8GqWvuN/"}
