{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:07:27","date_modify":"2018-10-30 21:07:27","date_publish":"2016-09-07 14:53:47","description":"San Francisco State University failed to handle a protest against the mayor of Jerusalem during his speech on campus, an investigation found.","filename":"data/vaneerConsumption/WATCHSFStateUniversityPresidentWeFailedStudentsInMishandlingOfJerusalemMayorProtest.json","image_url":"https://media.breitbart.com/media/2016/04/barkat.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_07__1540933647.html","title":"WATCH - SF State University President: We Failed Students In Mishandling Of Jerusalem Mayor Protest","title_page":"WATCH - SF State University President: We Failed Students In Mishandling Of Jerusalem Mayor Protest","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – San Francisco State University failed to properly handle a protest against the mayor of Jerusalem during a speech on campus, an investigation into the incident has found.\nThe protest caused students to fear for their safety, the report concluded.\nThe university’s president said in a statement that much improvement was needed to ensure that students feel safe.\n“The inadequate response prior to, during and following the event falls squarely on the shoulders of San Francisco State University administrators,” Leslie Wong wrote.\n“Ensuring the campus is a safe environment for all students is my top priority for the coming year,” he added.\n“We failed our students — both the event attendees and the protesters — through multiple inactions.”\nThe report also included a five-step protocol for the University police and administration to handle future protests, the student paper, the Golden Gate Express, reported.\nIn April, anti-Israel demonstrators dressed in Arab kaffiyehs and waving Palestinian flags prevented Jerusalem Mayor Nir Barkat from addressing the crowd by chanting into megaphones “from the river to the sea, Palestine will be free,” calls for another “intifada,” “end the occupation now,” and “Israel is an apartheid state.”\nThe protesters, who are part of the campus group the General Union of Palestinian Students, also demanded that Barkat be forced to leave the university.\nVideo footage of the protests was captured by Masha Merkulova, the San Mateo-based founder of Club Z, a Jewish nonprofit organization that educates youth on Israel.\n“They should have prepared for it,” Merkulova said at the time, noting that the SFSU police department knew the school was hosting a guest speaker who would attract protesters. “And instead, they were completely inept.”\nThe controversial incident led to Wong announcing that an investigation would be launched into the acts of the demonstrators. The investigation resulted in the protesters being punished for unauthorized use of amplification, the Express reported.\nThe investigation also found that although some Jewish students from the campus Hillel felt unsafe at the time, they were not in danger, as the protest was ultimately directed at the mayor and not the students.\nAccording to the San Francisco Examiner, the director of student conduct Osvaldo Del Valle, who has since left the university for unknown reasons, ignored three complaints about the protesters filed by Hillel students.","url":"https://www.breitbart.com/middle-east/2016/09/07/sf-state-university-president-we-failed-students-in-mishandling-of-jerusalem-mayor-protest/"}
