{"authors":["Breitbart Tech"],"date_download":"2018-10-30 18:17:26","date_modify":"2018-10-30 18:17:26","date_publish":"2016-06-06 19:54:26","description":"Breitbart Tech editor Milo Yiannopoulos will address students at the University of California, San Diego this evening at 10pm EST.","filename":"data/vaneerConsumption/WATCHMiloYiannopoulosAtUCSanDiego.json","image_url":"https://media.breitbart.com/media/2016/04/milo-light.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/social-justice_2016_06_06__1540923446.html","title":"***WATCH*** Milo Yiannopoulos At UC San Diego","title_page":"***WATCH*** Milo Yiannopoulos At UC San Diego | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Breitbart Tech editor Milo Yiannopoulos will address students at the University of California, San Diego this evening at 10pm EST.\nThe event, hosted by campus magazine The Koala in cooperation with the UCSD College Republicans can be watched live below.\nThe event’s Facebook page reports that tickets for the event have already sold out. The talk will address “chalkings, the plague of political correctness, feminism, trigger warnings, and safe spaces, among many other topics” and will be followed by a Q&A session.\nThis is the last stage of Milo’s “dangerous faggot tour” this semester. The Breitbart senior editor has caused chaos across US campuses, causing a mixture of outrage, therapy sessions for triggered students, and – on a more optimistic note – moves to strengthen free speech protections at a number of universities.\nThe talks have also been beset by protests, the most serious being those at DePaul, where activists stormed the stage and threatened violence, leading to an early cancellation of the event. Protesters at UC Irvine were involved in physical altercations with their critics, while UCLA activists attempted to block access to Milo’s event by forming a human wall in front of the venue.\nWith all the high drama surrounding the tour, it’s little wonder that tonight’s event is sold out.","url":"https://www.breitbart.com/social-justice/2016/06/06/watch-milo-yiannopoulos-uc-san-diego/"}
