{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:03:39","date_modify":"2018-10-30 21:03:39","date_publish":"2016-12-29 15:02:48","description":"Following Secretary of State John Kerry's speech on his vision for peace between Israelis and Palestinians, President-elect Donald Trump said Wednesday that Israel was being treated “very, very unfairly” by the international community, and added that he and the outgoing secretary have \"different views\" on the conflict. | Israel / Middle East","filename":"data/vaneerConsumption/WATCHTrumpIsraelTreatedVeryVeryUnfairlyButComeJanuary20WorldWillBeVeryImpressed.json","image_url":"https://media.breitbart.com/media/2016/12/Trump-Mar-a-Largo-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_12_29__1540933419.html","title":"WATCH: Trump: Israel Treated 'Very, Very Unfairly,' But Come January 20 World Will 'Be Very Impressed'","title_page":"WATCH: Trump: Israel Treated 'Very, Very Unfairly,' But Come January 20 World Will 'Be Very Impressed' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Following Secretary of State John Kerry’s speech on his vision for peace between Israelis and Palestinians, President-elect Donald Trump said Wednesday that Israel was being treated “very, very unfairly” by the international community, and added that he and the outgoing secretary have “different views” on the conflict.\n“We’re going to see what happens after January 20th. I think you’re going to be very impressed,” he added.\nThe President-elect also slammed the United Nations for ignoring countries that are “horrible places that treat people horribly” but “haven’t even been reprimanded” while Israel is “up for 20 reprimands” at the international body.\n“There’s something going on and it’s very unfair to Israel,” he added.\nTrump made his remarks to reporters outside his Mar-a-Lago estate.\nHe avoided answering a question about his stance on settlement construction, instead saying he was “very, very strong on Israel” and that Israel is being treated “very, very unfairly.”\nEarlier in the day, Trump responded to Kerry’s speech – which outlined his vision for a two-state solution wherein current settlement activity was depicted as an obstacle to peace – saying the address “speaks for itself.”\nKerry argued that Israeli settlements were creating an “irreversible one-state reality.”\nBefore the speech, Trump took to Twitter to condemn both Washington and the UN’s treatment of Israel: “[Israel] used to have a great friend in the U.S., but… not anymore. The beginning of the end was the horrible Iran deal, and now this (U.N.)! Stay strong Israel, January 20th is fast approaching!”\n“We cannot continue to let Israel be treated with such total disdain and disrespect,” the president-elect tweeted.\nKerry’s speech and Trump’s response followed the passage of UN Security Resolution 2334 which declares that territory captured in the 1967 defensive war – including the Old City of Jerusalem and the Western Wall – is “occupied Palestinian territory.”\nThe move drew fierce criticism from Israel, with the government of Prime Minister Benjamin Netanyahu accusing the Obama administration of colluding with the Palestinians to push the resolution through, and charging that the US abandoned and ambushed Israel.\nNetanyahu responded to Trump’s tweets, thanking the president-elect for his “warm friendship and your clear-cut support.”\nFollowing the vote, Trump, who had previously called on President Barack Obama to veto the resolution, attacked the UN as useless.\n“The United Nations has such great potential but right now it is just a club for people to get together, talk and have a good time. So sad!” he tweeted","url":"https://www.breitbart.com/middle-east/2016/12/29/trump-israel-treated-unfairly-ill-impress/"}
