{"authors":["Amy Sciarretto"],"date_download":"2018-10-30 22:49:25","date_modify":"2018-10-30 22:49:25","date_publish":"2014-08-14 18:00:01","description":"Thomas Leveritt just delivered a massive and alarmingly loud wake-up call regarding the simple concept of taking care of your skin and protecting it from sun damage. The videographer gathered young men and women to create a video of skin under UV…","filename":"data/vaneerConsumption/WatchWhatSkinLooksLikeUnderUVLightInThisThomasLeverittProducedVideoAboutHiddenSunDamageItAintPretty.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/51da84c1-ba97-4293-8923-2337fe10f9c7.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35758-watch-what-skin-looks-like-under-uv-light-in-this-thomas-leveritt-produced-video-about-hidden-sun_1540939765.html","title":"Watch What Skin Looks Like Under UV Light In This Thomas Leveritt-Produced Video About Hidden Sun Damage - It Ain't Pretty","title_page":"Watch What Skin Looks Like Under UV Light In This Thomas Leveritt-Produced Video About Hidden Sun Damage — It Ain't Pretty","title_rss":"NULL","source_domain":"bustle.com","text":"Thomas Leveritt just delivered a massive and alarmingly loud wake-up call regarding the simple concept of taking care of your skin and protecting it from sun damage. The videographer gathered young men and women to create a video of skin under UV light that makes a rock solid case for the daily use of SPF and the religious, regimented, and routine use of sunscreen. Seriously, it might even make you want to test drive the drinkable version of sunscreen! Do not hit the snooze button on this video — or on taking the necessary steps and actions to prevent sun damage on your delicate and precious epidermis.\nAcccording to Mashable, Leveritt approached random people on the street and asked them to look at their skin under ultraviolet light. He should have offered them sedatives beforehand, since it's just a tad bit jarring.\nLooking at your skin through the harsh and unforgiving lens of an ultraviolet camera and lighting can show you damage and changes that are not visible normally. Think your skin is all nice and glowy? PSYCH! Check out all those sunspots just chillin' underneath the surface!\nThe men, women, and children who participated in this little experiment react with shock, uncomfortable laughs, and goofy but concerned grins when they see how they look. It's fascinating what the naked eye cannot see.\nLeveritt carefully reminds us that the aging process can be sped up through many factors, but he offers the obvious tips to prevent that, like employing sunblock and wearing sunglasses. But he goes further than just telling us what we already know but may be too lazy to implement. He shows us how a slathering of sunblock effectively covers and protects you like a blanket by using the ultraviolet light to reveal what skin looks like with a coating of sunblock.\nThat's all the proof any of us need. I am strict about my SPF and sunscreen usage. I'd be shaking and crying — and not in the good \"I just met One Direction\" way — if I put myself through this visual test. And I already alternate between crazy obsessive and hyper-vigilant when it comes to taking care of my skin.\nI wear SPF 50 daily, even when it's bitter cold and polar vortexin' in winter, since the sun is still out. If I am going to be outside all day in the summer, at a baseball game or at a concert festival or event, I coat myself in the spray-on version of sunblock, from my neck on down. Sure, my hair gets greasy and icky, but that's a small price to pay to protect my skin.\nAnd you will never see me without giant sunnies, as a matter of fashion and function, since the huge shades cover and protect the fragile skin around my eyes. I am proudly apparition in tone and wrinkle-free, and not just because my Italian grandmother had great, oily skin that I inherited. She moisturized and protected herself daily and I follow her lead.\nNo one wants to look radioactive or to resemble '70s era luggage, like Magda from There's Something About Mary or, even worse, like Tan Mom. Crisp, fried, leathery skin isn't pretty at any age. Plus, the increased chance of getting skin cancer from sun exposure is even more of a reason to stock up on SPF-infused products for that face and that body. You've got to protect 'em and it's better to be either pale or sun-kissed but totally protected than dead.\nWatch the video below and you'll never go without SPF again. It's protective armor and it's widely available, so you have no excuses.\nThomas Leveritt on YouTube\nImages: YouTube; Giphy (2)","url":"https://www.bustle.com/articles/35758-watch-what-skin-looks-like-under-uv-light-in-this-thomas-leveritt-produced-video-about-hidden-sun"}
