{"authors":[],"date_download":"2018-10-23 05:38:20","date_modify":"2018-10-23 05:38:20","date_publish":"2016-11-12 00:00:00","description":"Since the Vietnam Veterans Memorial opened, visitors have left hundreds of thousands of items there. Meet the veteran who collects and catalogs them — and finds in them a chance to salvage the past.","filename":"data/vaneerConsumption/WatcherAtTheWallOneVeteranFindsALifelineInAllThatsLeftBehind.json","image_url":"https://media.npr.org/assets/img/2016/11/11/ap_819893943662_wide-b185866d7bbc7daf6cfe9521b3b480769c5741e4.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=501623765_1540273100.html","title":"< Watcher At The Wall: One Veteran Finds A Lifeline In All That's Left Behind","title_page":"StoryCorps: Watcher At The Wall: One Veteran Finds A Lifeline In All That's Left Behind : NPR","title_rss":"NULL","source_domain":"npr.org","text":"SCOTT SIMON, HOST:\nThis Veterans Day weekend, we'll check in with StoryCorps' Military Voices Initiative. They record the stories of military service members and their families. Everyday, visitors to the Vietnam Veterans Memorial in Washington, D.C., leave medals, dog tags and other objects at the wall. And Duery Felton has spent decades helping to identify and care for each one. Duery served in Vietnam himself, and he came to StoryCorps with his friend and fellow Vietnam veteran Rick Weidman to talk about the war and what led him to the wall.\nDUERY FELTON: Going to the wall, I had mixed feelings. But as we were walking about, people will leave things all over the wall, and no one could recognize certain objects there, so I pointed them out. One of the things I immediately recognized was the military hospital pajamas because I wore them a long time. So we decided we were going to make this a collection, and I was asked to come in and assist setting all this up.\nRICK WEIDMAN: They created the job around you. So it's not that you chose to work at that memorial, but it chose you?\nFELTON: It chose me. I really do think that it chose me. There were about 8 million Vietnam-era veterans, and out of that number, I, for some reason, was the one chosen for this. I don't know why, but I've often thought about that.\nWEIDMAN: What was it that kept you coming back?\nFELTON: During Vietnam - and I very seldom speak of this - we had walked into an ambush, and one of my friends had been killed. And I stopped to look at his body, and my sergeant came up to me and said, we have to keep moving forward. And that's why we have medics. The medic will get him. I had to go against everything I've learned growing up, as regards to having feelings for people. In order to survive, I had to learn to detach, and unfortunately not everyone has to learn to reconnect.\nWEIDMAN: There's nothing you can do to help any one of those guys. The only thing you can do is help to understand them better and leave that as a legacy so they're not forgotten, but I don't understand how you do it, Duery. Your strength is what it always has knocked me over. You're the man.\nFELTON: No, Rick, you are. Thank you. Thank you for being my friend.\n(SOUNDBITE OF MUSIC)\nSIMON: That's two Vietnam veterans, Duery Felton and Rick Weidman, in Washington, D.C. Duery was the first curator for the Vietnam Veterans Memorial Collection. He retired in 2014.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=501623765"}
