{"authors":["Breitbart Tv"],"date_download":"2018-10-30 20:48:53","date_modify":"2018-10-30 20:48:53","date_publish":"2016-01-21 19:28:55","description":"(ADULT LANGUAGE WARNING) A YouTube video was uploaded Tuesday of what appears to be a University of Miami medical resident going on a drunken tirade with |","filename":"data/vaneerConsumption/WatchUnivofMiamiMedicalResidentCaughtonCamerainDrunkenUberRage.json","image_url":"https://media.breitbart.com/media/2016/01/Anjali-Ramkissoon-1-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_01_21__1540932533.html","title":"Watch: Univ of Miami Medical Resident Caught on Camera in Drunken Uber Rage","title_page":"Watch: Univ of Miami Medical Resident Caught on Camera in Drunken Uber Rage | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"(ADULT LANGUAGE WARNING)\nA YouTube video was uploaded Tuesday of what appears to be a University of Miami medical resident going on a drunken tirade with an Uber driver has made its way around the internet.\nYouTube user Juan Cinco, who uploaded the video, gave this description of the incident:\nWe were on the phone with this uber driver while he pulled up to our location. Out of nowhere the girl in the video gets in the backseat of his car and won’t get out. We told the driver it was ok, to just cancel our ride, but he did not want to take her anywhere so he kept telling her to get out. Eventually the driver gets out and says he’s calling the cops to get her out of the car. After a couple of minutes of the driver pretending to talk to the cops (im assuming he was pretending because they never showed up at first), the girl decides to reach into the front seat, grab his keys, and start walking away with his keys in her hands…. That’s where the video starts…\nMiami’s Local 10 identified the inebriated girl as second year University of Miami neurology resident Dr. Anjali Ramkissoon.\nIn the video, Ramkissoon can be seen trying to slap the driver. She then tried to kick him in the groin area. The driver shoved her to the ground and tried to get in his car to drive off.\nRamkissoon then jumped in the car and began to berate the driver, once yelling, “Get the f— in the car you piece of f—— disgusting s—!”\nWhen the driver refused to drive the doctor anywhere, she began throwing objects out of the car while he was on the phone.\nJuan Cinco later added Ramkissoon became remorseful once police arrived. “It was only when they put her in the police car that she started crying, apologizing, and claiming that she would lose her medical license (she claimed to be a neurologist) if she got arrested,” Juan Cinco wrote.\nAccording to Juan Cinco, the Uber driver decided to take a cash settlement instead of pressing charges against Ramkissoon for her actions.\nOnce the girl in the video was identified as Dr. Anjali Ramkissoon, The Daily Brit called for “Internet Justice for Anjali N. Ramkissoon.” Her ratings and reviews on her practice’s Facebook page and Vitals.com, a site for rating doctors, have been lampooned by those who have seen the doctor’s tirade.\nA now-deleted press release by the University of Miami listed Ramkissoon as a member of the epilepsy team, while a newsletter from the neurology residency program names Ramkissoon among the class of 2016 with a focus in headaches and sleep medicine.\n(h/t Heavy)\nFollow Breitbart.tv on Twitter @BreitbartVideo","url":"https://www.breitbart.com/video/2016/01/21/watch-univ-of-miami-medical-resident-caught-on-camera-in-drunken-uber-rage/"}
