{"authors":["Chris Tomlinson"],"date_download":"2018-10-30 19:29:21","date_modify":"2018-10-30 19:29:21","date_publish":"2016-11-26 10:58:59","description":"Hundreds of migrants were arrested for rioting in Bulgaria after they were quarantined due to infectious diseases in the camp.","filename":"data/vaneerConsumption/WATCHHundredsArrestedInMassiveMigrantRiot.json","image_url":"https://media.breitbart.com/media/2016/11/rsz_gettyimages-625514202.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_11_26__1540927761.html","title":"WATCH: Hundreds Arrested In Massive Migrant Riot","title_page":"WATCH: Hundreds Arrested In Massive Migrant Riot","title_rss":"NULL","source_domain":"breitbart.com","text":"Hundreds of migrants have been arrested for taking part in a huge riot in Bulgaria after they were quarantined due to the prevalence of infectious diseases in the camp.\nMigrants, mostly from Afghanistan, rioted in the Harmanli migrant camp Thursday causing enormous property damage and injuring up to 20 police officers. Police are said to have arrested up to 400 participants and were not able to restore order until the early hours of Friday morning, reports Der Standard.\nPrime Minister Boyko Borissov said that all the migrants detained for rioting would be sent to different migrant camps where they would be kept under house arrest.\nVideos, including mobile phone footage from the migrants themselves, have emerged showing migrants attacking police, including hurling rocks at officers in riot gear, and setting fires.\nTo counter the violent migrants, police employed water cannons into the late hours of the night. This is the largest riot seen in Bulgaria which has become the new\nThis is the largest riot seen in Bulgaria which has become the new ending point for migrants from the Middle East who can no longer travel on via the Balkan route to Western Europe.\nThe cause of the riot is largely believed to have been in response to a quarantine that was issued on the 3,000 residents of the camp. Local protesters forced the government to introduce the quarantine after claiming that many in the camp were spreading infectious diseases.\nAfter the protest, the government was forced to admit that well over a hundred migrants were suffering from viral infections, skin diseases, and even smallpox.\nIn October, a group of largely Afghan men in the Harmanli camp demanded that the Bulgarian government allow them to continue to travel onward to Western Europe, most likely to Germany. Germany now recognises Afghanistan as a safe country of origin and the Afghani government has agreed to accept all of its citizens returned from Germany.\nCurrently, around 13,000 migrants are stuck in Bulgaria, the poorest country in the European Union, and many more attempt to cross the border from Turkey on a daily basis.\nDue to a lack of funding for border security, some citizens have taken the initiative to patrol the border themselves. Dinko Valev, who, along with his supporters, was present at the riot Thursday night, and has been called a “superhero” by some Bulgarians after reports showed him patrolling the border and capturing migrants on his ATV.","url":"https://www.breitbart.com/europe/2016/11/26/watch-hundreds-arrested-massive-migrant-riot/"}
