{"authors":["Stephen Thompson"],"date_download":"2018-10-22 20:31:18","date_modify":"2018-10-22 20:31:18","date_publish":"2017-03-18 00:00:00","description":"Big Thief's Adrianne Lenker had the capacity Stubb's crowd in the palm of her hand at our showcase.","filename":"data/vaneerConsumption/WatchBigThiefPerformAtNPRMusicsSXSWShowcaseNPR.json","image_url":"https://media.npr.org/assets/img/2017/03/16/photo-mar-15-11-40-40-pm_wide-e979645d05d1ba4a0c4ec7516e3b041b45aa737c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2017_03_18_520060639_big-thief-whispers-then-roars-at-sxsw-2017_1540240278.html","title":"Watch Big Thief Perform At NPR Music's SXSW Showcase : NPR","title_page":"Watch Big Thief Perform At NPR Music's SXSW Showcase : NPR","title_rss":"NULL","source_domain":"npr.org","text":"For Big Thief, fragility and power come inextricably intertwined. Singer and guitarist Adrianne Lenker may let her songs sit and seethe for long stretches, but those slow builds only maximize the catharsis of the big, loud, high-volume bursts of force that follow.\nOnstage at Stubb's BBQ in Austin, Texas — recorded live Wednesday as part of NPR Music's SXSW showcase — Lenker brought a mix of new material and songs from last year's terrific Masterpiece. Throughout the set, Big Thief's sound billowed out in grand waves, matching the large stage and open-air setting, and by the end of \"Masterpiece\" (the band's signature song so far), Lenker was on her back, lost in the intensity of the moment. It felt like just the beginning for a band with a big, bright future.\nSet List\n\"Orange\"\n\"Real Love\"\n\"Vegas\"\n\"Shoulders\"\n\"Paul\"\n\"Shark Smile\"\n\"Parallels\"\n\"Masterpiece\"\n\"Mary\"\nCredits\nProducers: Robin Hilton, Mito Habe-Evans; Director: Colin Marshall; Technical Director: Josh Rogosin; Audio Engineer: Timothy Powell/Metro Mobile; Concert Videographers: Lizzie Chen, Mito Habe-Evans, Nickolai Hammar, Katie Hayes Luke, Kelly West; Editor: Annabel Edwards; Supervising Editor: Niki Walker; Executive Producer: Anya Grundmann; Special Thanks: SXSW, Stubb's BBQ","url":"https://www.npr.org/2017/03/18/520060639/big-thief-whispers-then-roars-at-sxsw-2017"}
