{"authors":["Lucas Nolan"],"date_download":"2018-10-30 18:15:51","date_modify":"2018-10-30 18:15:51","date_publish":"2016-07-28 13:38:07","description":"New York Magazine has released a video documenting their experience following Breitbart Tech editor Milo Yiannopoulos around the RNC.","filename":"data/vaneerConsumption/WATCHNewYorkMagazineJoinsTheMiloTrainAtTheRNC.json","image_url":"https://media.breitbart.com/media/2016/07/milo-640x479-1.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/social-justice_2016_07_28__1540923351.html","title":"WATCH: New York Magazine Joins The Milo Train At The RNC","title_page":"WATCH: New York Magazine Joins The Milo Train At The RNC | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"New York Magazine has released a video documenting their experience following Breitbart Tech editor Milo Yiannopoulos around the RNC.\nIn the video we see Yiannopoulos walking around the RNC, talking to interviewers and fans alike. “This is the problem I have with feminism” Yiannopoulos says to the camera, “It’s turned stars of Hollywood blockbusters into victims, perhaps a subtle reference to Ghostbusters actress Leslie Jones recent Twitter meltdown and Milos subsequent ban from the platform for daring to ridicule the Ghostbusters reboot. Milo has continued to fight the ban but it seems that Twitter is steadfast in their decision to make the ban permanent.\n“We’re never going to eradicate mean comments or bullying on the internet, what you’ve got to do is get a sense of perspective and stop using victimhood and grievance as a sort of currency. It’s pathetic, you’re a star of a Hollywood blockbuster, what are you doing sitting at home pretending to be upset about weirdos on the internet” said the conservative firebrand.\nLater in the video a young reporter is animatedly talking to Milo. He words can’t quite be heard, but Milo asks her, “Am I racist because I don’t like the Ghostbusters movie?” to which the reporter replies “yes because you’re fat shaming and women shaming and race baiting people online, that is why we think you’re racist.”\nMilo’s reaction to this absurdity is simply to walk away, twirling a finger at the side of his head – the international symbol for “crazy.”\nNew York Magazine filmed their video after Milo’s ban from Twitter, and, inevitably, the subject came up, with Milo launching into a verbal evisceration of the social network.\n“This is the moment Twitter declared war on free speech, war on conservatives, declared war on libertarians. And they are going to suffer bitterly as a result for the next couple of years.” Milo says to the New York Magazine camera before the video cuts to Milo occupying the Twitter booth at the RNC, asking the Twitter official manning the booth, “why do you hate conversations”, the Twitter official repeatedly states that they’re not doing interviews but that Milo is welcome to explore the booth before Milo eventually leaves.\n“Twitter is under no obligation as a private company to observe the First Amendment, but it ought to. Why? Because it’s good business, and the companies that don’t go under very quickly. The companies that start censoring their users lose all of the most fun people. There’s no such thing as hate speech. I just don’t believe that people are dumb enough to be turned into racists because somebody said the N-word on the internet. And I don’t believe that by banning kids from saying the word gay in the playground, as was being discussed in the UK last year, that you eradicate homophobia. That’s insane.”\nWatch the full New York Magazine video below.\nLucas Nolan is a Journalism and Media student at Dublin Business School and a regular contributor to Breitbart Tech. He can be contacted via Twitter here: @LucasNolan_","url":"https://www.breitbart.com/social-justice/2016/07/28/new-york-magazine-follows-milo-rnc/"}
