{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:01:52","date_modify":"2018-10-30 21:01:52","date_publish":"2016-08-30 20:22:27","description":"TEL AVIV – Israel supplies Palestinians with guns and other weapons in order to encourage violence and create internal chaos, a new Palestinian libel | Israel / Middle East","filename":"data/vaneerConsumption/WATCHPalestinianLibelIsraelSuppliesPalestinianswithWeaponsandDrugstoCreateInternalChaos.json","image_url":"https://media.breitbart.com/media/2016/08/west-bank-violence.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_08_30__1540933312.html","title":"WATCH - Palestinian Libel: Israel Supplies Palestinians with Weapons and Drugs to Create Internal Chaos","title_page":"WATCH - Palestinian Libel: Israel Supplies Palestinians with Weapons and Drugs to Create Internal Chaos | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Israel supplies Palestinians with guns and other weapons in order to encourage violence and create internal chaos, a new Palestinian libel claims.\n“The Israelis have never ceased their efforts to infiltrate Palestinian society and destroy it. There are two means for the destruction: Weapons, which created the chaos, and drugs,” PLO Executive Committee member Dr. Ahmed Majdalani said on official Palestinian Authority TV.\n“Those are the two dangerous weapons. Weapons have a role in destroying society – weapons that are transferred to gangs that trade in them, transfer them, and sell them have a specific role. They have a specific role and that is the creation of strife and internal pressures,” Majdalani added.\nThe libel follows an uptick in internal strife within Palestinian society, in which proponents of different political factions are at loggerheads, often taking to the streets in rallies and protests.\nIn the interview on PA TV show The State of Politics, aired last Sunday, Majdalani claimed that Israel distributes the weapons in order to cause Palestinians to harm each other and that the moment Palestinians use those weapons against Israel, Israeli authorities confiscate them.\n“When these weapons have a national role in the resistance to the occupation, [Israelis] immediately go and take them away,” he said.\n“The weapons they want us to have [are] for internal use, in other words, within Palestinian society, at weddings, circumcisions. In marches you sometimes see in the streets, these foolish marches, or someone whose child excelled in the matriculation exams brings several people who shoot [guns] and shoot some 1,000 bullets,” he added.\nAccording to Israeli NGO Palestinian Media Watch (PMW) the PA has in the past accused Israel of distributing drugs among Palestinian youth so that they will not be willing or able to fight against Israel.\nIn April, the PA’s official daily Al-Hayat Al-Jadida quoted the district governor of Qalqilya, Rafe’ Rawajbeh, who claimed that Israel “plans to defeat us from within, to cause division between us, and to support the roots of evil, such as the phenomenon of the spreading of drugs,” the report said.\nOn Sunday, Breitbart Jerusalem reported the same newspaper’s accusation that Israel had murdered incarcerated Palestinian terrorist Naim Shawamreh by injecting him with a substance that caused muscular dystrophy while he was serving a life sentence for killing a policeman.\nMuscular dystrophy is a genetic disease and cannot be contracted from external sources.","url":"https://www.breitbart.com/middle-east/2016/08/30/palestinian-libel-israel-supplies-palestinians-with-weapons-and-drugs-to-create-internal-chaos/"}
