{"authors":["Awr Hawkins"],"date_download":"2018-10-30 18:31:27","date_modify":"2018-10-30 18:31:27","date_publish":"2018-07-25 22:28:17","description":"LAPD officers unintentionally killed a Trader Joe's manager, 27-year-old Melyda Corado, during a shootout with Gene Evin Atkins Saturday afternoon. | Local","filename":"data/vaneerConsumption/WATCHLAPDOfficersKillTraderJoesManagerinShootoutwithArmedSuspect.json","image_url":"https://media.breitbart.com/media/2018/07/LAPD-body-cam-trader-joes-shooting.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2018_07_25__1540924287.html","title":"WATCH: LAPD Officers Kill Trader Joe's Manager in Shootout with Armed Suspect","title_page":"WATCH: LAPD Officers Kill Trader Joe's Manager in Shootout with Armed Suspect | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"LAPD officers unintentionally killed a Trader Joe’s manager, 27-year-old Melyda Corado, during a shootout with Gene Evin Atkins on Saturday afternoon.\nFollowing a high-speed chase Atkins crashed just outside the front door of the business, and Corado was coming out of the store in response to the sound of the accident.\nThe Associated Press reported that LAPD released numerous body cam videos showing Atkins allegedly shooting at officers during the high speed chase in Silver Lake. Officers can be heard restraining themselves, saying, “Do not, do not shoot.” But when Atkins exited his vehicle after the crash, allegedly firing at officers, the officers shot back.\nThe officers then took cover behind a concrete wall and bullets could be heard hitting a nearby street sign as Atkins allegedly continued to fire.\nThe front door of the Trader Joe’s opened as police exchanged gunfire with police and it is believed that is was opening for Corado, who turned, went back inside, and collapsed to the floor after being shot.\nLAPD Chief Michael Moore expressed condolences to Corado’s family Tuesday, but he made clear that he believes the officers did the right thing by returning fire.\nLAIST quoted Moore saying, “As chief of police, I believe it’s what they needed to do to defend the people of Los Angeles, defend the people in that store and defend themselves.”\nAtrins was wounded and apprehended. He is being held on an $18.7 million bond.\nAWR Hawkins is an award-winning Second Amendment columnist for Breitbart News, the host of the Breitbart podcast Bullets with AWR Hawkins, and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.","url":"https://www.breitbart.com/local/2018/07/25/watch-lapd-officers-kill-trader-joes-shootout-armed-suspect/"}
