{"authors":["Nuzha Nuseibeh"],"date_download":"2018-10-30 22:24:33","date_modify":"2018-10-30 22:24:33","date_publish":"2014-08-15 18:52:55","description":"If you feel like getting riled up before your weekend starts, be sure to watch Christian rock star Vicky Beeching facing off with Scott Lively, the anti-gay evangelist from Massachusetts, in an epic interview on Britain's Channel 4 network. In case…","filename":"data/vaneerConsumption/WatchMusicianVickyBeechingEpicallySchoolAnAntiGayPastorOnLiveTVVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0963b635-1d8c-4aa8-bebb-5177544b7eae.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35950-watch-musician-vicky-beeching-epically-school-an-anti-gay-pastor-on-live-tv-video_1540938273.html","title":"Watch Musician Vicky Beeching Epically School An Anti-Gay Pastor On Live TV - VIDEO","title_page":"Watch Musician Vicky Beeching Epically School An Anti-Gay Pastor On Live TV – VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"If you feel like getting riled up before your weekend starts, be sure to watch Christian rock star Vicky Beeching facing off with Scott Lively, the anti-gay evangelist from Massachusetts, in an epic interview on Britain's Channel 4 network. In case you missed it, Beeching is an international pop icon who came out as gay in an interview with the Independent only Thursday — a brave move for a publicly (and personally) deeply Christian figure. During the interview, Lively tells her how he \"sympathizes\" with her \"challenge\" but that he's sorry that she's \"given in to the lie that she is a homosexual.\" Can you guess how well that went down?\nA bit of background on Scott Lively: Author of the The Pink Swastika: Homosexuality in the Nazi Party (yes, you read that right, and yes, it asserts that the Nazis were \"entirely controlled by militaristic male homosexuals\"), Lively is an evangelical pastor who was also at one point the state director for the American Family Association in California. He's supported anti-homosexuality legislation in Russia, advocated for conversion therapy and also suggested that President Barack Obama may be gay (while simultaneously arguing that being gay is a mental disorder).\nYah, he's a peach.\nBeeching is, like Lively, extremely Christian. Unlike Lively, this doesn't translate into her being a bigot. As she says at the beginning of the interview, being both religious and gay came with its troubles — \"when I was 13, I was just beside myself, sobbing into my bedroom carpet, saying to God, you've gotta take my life away, I can't handle this, I can't be Christian and gay,\" she says at one point — but this changed after she was diagnosed with a rare auto-immune disease.\nShe came to love both the church and her sexuality: \"What Jesus taught was a radical message of welcome and inclusion and love. I feel certain God loves me just the way I am.\"\nOf course, some people, like Lively, would beg to differ. \"I have a lot of sympathy for Vicky herself, my sister was a lesbian. I was the person she came out to, as a teenager, and I was the person she turned to when lesbianism had almost destroyed her,\" he tells Beeching at the beginning of the interview. “I'm very sorry to hear that she has given in to the lie that she is a homosexual instead of continuing to try to overcome the challenge that is in her life.”\nIn case that wasn't nauseating enough, he also tells her that \"there’s no such thing as a gay person\" and beseeches her to turn to God to help \"overcome your homosexual inclinations.” When she points out how damaging that kind of rhetoric is to a person's psychology, he tells her mournfully: \"You have adopted the thinking of the world —\" \"Like science, you mean?\" she interrupts.\nFinally, he asks her somewhat desperately: “Don’t you care what God thinks, Vicky?\" To which she responds: “I do, and that’s actually why I’m taking this step today — so that young people don’t have to listen to the kind of teaching you peddle, because it damages.”Damn straight. Watch the full interview:\nVicky Beeching on YouTube\nImages: Vicky Beeching/Twitter, Channel 4 News","url":"https://www.bustle.com/articles/35950-watch-musician-vicky-beeching-epically-school-an-anti-gay-pastor-on-live-tv-video"}
