{"authors":["Trent Baker"],"date_download":"2018-10-30 20:24:12","date_modify":"2018-10-30 20:24:12","date_publish":"2016-01-18 02:41:38","description":"During Sunday's Democratic presidential debate on NBC, Democratic presidential candidates Sen. Bernie Sanders (I-VT) and former Secretary of State Hillary |","filename":"data/vaneerConsumption/WatchBernieHillaryDebateGunRights.json","image_url":"https://media.breitbart.com/media/2016/01/hillary-bernie.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_17__1540931052.html","title":"Watch: Bernie, Hillary Debate Gun Rights","title_page":"Watch: Bernie, Hillary Debate Gun Rights | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During Sunday’s Democratic presidential debate on NBC, Democratic presidential candidates Sen. Bernie Sanders (I-VT) and former Secretary of State Hillary Clinton discussed their stances on gun rights.\nSanders maintained his stance that the country needs an instant background check and took sides with President Barack Obama on trying to close gun show loopholes. Clinton brought up Sanders’ past voting with the NRA.\n“I stood up to the gun lobby, and came out and maintained the position that in this country, we should not be selling military-style assault weapons,” Sanders stated. “I have supported, from day one, an instant background check to make certain that people who should not have guns do not have guns. And that includes people with criminal backgrounds; people who are mentally unstable. I support what President Obama is doing in terms of trying to close the gun show loopholes, and I think it should be a federal crime if people act as straw men.”\n“Based on Senator Sanders’ own record that he has voted with the NRA, with the gun lobby numerous times. He voted against the Brady Bill five times. He voted for what we call the Charleston Loophole. He voted for immunity from gun makers and sellers, which the NRA said was the most important piece of gun legislation in 20 years. He voted to let guns go on to Amtrak, guns goes into national parks; he voted against doing research to figure out how we can save lives. Let’s not forget what this is about. 90 people a day die from gun violence that’s 33,000 people a year. One of the most horrific examples, not a block from here, where we had nine people murdered,” Clinton responded.","url":"https://www.breitbart.com/politics/2016/01/17/watch-bernie-hillary-debate-gun-rights/"}
