{"authors":["Jeff Poor"],"date_download":"2018-10-30 19:21:24","date_modify":"2018-10-30 19:21:24","date_publish":"2016-01-11 15:02:22","description":"Monday on MSNBC's \"Morning Joe,\" host Joe Scarborough and former Rep. Harold Ford (D-TN), now a professor at the University of Michigan, debated the |","filename":"data/vaneerConsumption/WatchScarboroughFordSparOverBillClintonBillCosbyComparisons.json","image_url":"https://media.breitbart.com/media/2016/01/MoJo111.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_11__1540927284.html","title":"Watch: Scarborough, Ford Spar Over Bill Clinton-Bill Cosby Comparisons","title_page":"Watch: Scarborough, Ford Spar Over Bill Clinton-Bill Cosby Comparisons | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Monday on MSNBC’s “Morning Joe,” host Joe Scarborough and former Rep. Harold Ford (D-TN), now a professor at the University of Michigan, debated the merits of comparing the allegations of rape aimed at Bill Cosby to the sexual misconduct allegations aim at former President Bill Clinton as his wife Hillary Clinton is running for the Democratic presidential nomination.\nScarborough argues that public sentiment has shifted to give those claiming to have been a victim more of the benefit of the doubt, which changes things when it comes to Bill Clinton.\n“In the age of Cosby, which we are now in, I wonder how the public looks at Bill Cosby and says, ‘This beloved man, who changed American culture as much as any entertainment figure in our lifetime is going to have to be accountable for the way he treated women behind closed doors,'” Scarborough said. “How does a public that has come to that conclusion say the Bill Clinton stuff’s OK, and we’re not even going to examine the person who may have been in charge of what has been called the, quote, sluts and nuts defense wing of the Clinton campaign, where they said, their quote was, ‘Drag a dollar bill through a trailer park and it’s amazing what’ll happen.”\nFord argued the Bill Clinton allegations have been litigated and shouldn’t be revisited.\n“Look, I’m not here to defend anybody’s past in some of these things,” Ford replied. “But the facts are pretty clear. Number one, these matters have been litigated and I believe if the Republican party wants to travel back down that path.”\nScarborough and Ford continued to debate the merits of the arguments, with Scarborough accusing Ford of using distraction.\nExchange as follows:\nSCARBOROUGH: Has Hillary Clinton’s role been litigated? FORD: The issue of Mr. Clinton’s sexual past — SCARBOROUGH: Yeah, yeah: we’re not interested in that. We already said we weren’t. FORD: But Joe, you can’t say you aren’t interested. That’s the content, that’s the core of what we’re talking. SCARBOROUGH: No, no. Harold: I just said The New York Times editorial said — MIKA BRZEZINSKI, CO-HOST “MORNING JOE”: You’re just trying not to talk about it. SCARBOROUGH: No, no, no, no, this is — FORD: The New York Times isn’t — SCARBOROUGH: This is important because — FORD: The New York Times is not always right. SCARBOROUGH: This is what Clinton defenders always do. They try to distract. In a sexual harassment suit, they go: This is just about sex, it’s about sex. No, it’s about sexual harrassment in the workplace. This is not about Bill Clinton’s sexual actions as The New York Times said. FORD: Raising your voice at me doesn’t make this right. Comparing Bill Clinton to Bill Cosby is wrong.\nLater in the segment, Ford and Scarborough traded barbs, with Scarborough accusing Ford of using talking points from former Clinton strategist James Carville and Ford accusing Scarborough of using talking points from Republican presidential front-runner Donald Trump.\nExchange continues as follows:\nFORD: This issue was litigated. If Mrs. Clinton can’t answer these questions you may very well be right. But don’t accuse me of taking anyone’s talking points. I an independent thinker in this. SCARBOROUGH: Of course you are. FORD: And I’m not going to accuse the two of you for taking Donald Trump’s line. Don’t accuse me of taking anyone else’s line. SCARBOROUGH: Harold, you just keep going back to Clinton. FORD: And then the Bill Clinton-Bill Cosby thing is overboard. SCARBOROUGH: Maybe it’s just you just remind me of what James Carville does. FORD: You remind me of what Donald Trump is saying. SCARBOROUGH: Do I remind you of Donald Trump? FORD: What he’s saying. SCARBOROUGH: “Look over dere! Look at the plane over dere! Look over dere! Look over dere! Look at Bill Clinton’s saying. Look over dere!” It’s not over there. It’s right here. This is about about Hillary Clinton. This is about Hillary Clinton, not Bill Clinton’s actions. FORD: And she’s going to have to answer that. SCARBOROUGH: OK, that’s all we’ve been saying. FORD: But don’t accuse me of James Carville, or conflating Bill Cosby with Bill Clinton.\n(h/t Newsbusters)\nFollow Jeff Poor on Twitter @jeff_poor","url":"https://www.breitbart.com/politics/2016/01/11/watch-scarborough-ford-spar-over-bill-clinton-bill-cosby-comparisons/"}
