{"authors":["Simon Kent"],"date_download":"2018-10-30 18:56:49","date_modify":"2018-10-30 18:56:49","date_publish":"2018-07-10 08:12:08","description":"UN Watch has accused global agencies charged with combating racism of failing to act against hatred, incitement and violence against Jews.","filename":"data/vaneerConsumption/WatchdogOverwhelmingEvidenceUNFailstoCombatAntiSemitism.json","image_url":"https://media.breitbart.com/media/2017/11/jewish.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2018_07_10__1540925809.html","title":"Watchdog: 'Overwhelming Evidence' UN Fails to Combat Anti-Semitism","title_page":"Watchdog: 'Overwhelming Evidence' UN Fails to Combat Anti-Semitism | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Geneva-based UN Watch has accused global agencies charged with combating racism of failing to act against hatred, incitement and violence against Jews.\nA report published Monday details the accusation that top UN officials are quick to attack racism and ethnic discrimination all over the world but reluctant to denounce attacks on Jews or the Jewish homeland Israel. Former secretary-general Ban Ki-moon and other senior officials were specifically taken to task for what the report called “softcore Holocaust denial.”\nQuoting “overwhelming evidence over the past decade,” the report claims that leading UN officials and bodies “that should be condemning and combating anti-Semitism are, with limited exceptions, failing to do so.”\nThe 40-page report, titled The United Nations and Antisemitism: 2008-2017 Report Card, was presented in the Knesset in Jerusalem, at a hearing chaired by Yesh Atid chairman MK Yair Lapid.\n“Our report’s findings are disturbing and clear: Key UN agencies, officials and experts are, with limited exceptions, turning a blind eye to escalating antisemitism worldwide,” said Hillel Neuer, director of UN Watch.\nUN Watch called on UN Secretary-General Antonio Guterres “to acknowledge the demonstrable failure of the world body when it comes to antisemitism, and to set forth an action plan that will mobilize key UN stakeholders, and in particular those within its human rights machinery, to exercise their responsibilities to confront bigotry, hate or violence targeting Jews worldwide.”\nThe organization also pointed to the UN’s former High Commissioner for Human Rights Navi Pillay, who served from 2008 to 2014. It said she “was likewise quick to condemn a film perceived as anti-Muslim, as well as ‘malicious’ cartoons by Charlie Hebdo.”\n“Yet in the face of murderous physical attacks against Jews, such as the shooting at a Toulouse Jewish school, Pillay was typically silent. Worse, Pillay and her office repeatedly smeared Jewish organizations as ‘single-issue lobbyists’ for seeking to prevent anti-Semitism from infecting the UN’s 2009 Durban II conference on racism,” UN Watch concluded.\nThe new report follows observations made in February by the United States Ambassador to the United Nations Nikki Haley against the UN Security Council over their anti-Israel bias after she emerged from her first regular monthly meeting at the international body.\n﻿\n“I have to admit; it was a bit strange,” Haley said of the council’s agenda.\nThe former South Carolina governor noted that while it is the UN Security Council’s mission to discuss ways to maintain international peace and security, their meeting on the Middle East failed to address some of the region’s most pressing issues.\nThese include Hezbollah’s illegal buildup of rockets in Lebanon, the money and weapons the Iran regime is supplying to its terrorist entities throughout Latin America and the Middle East, ways to defeat the Islamic State, and how to hold Syrian dictator Bashar al-Assad accountable for the deaths of hundreds of thousands of his countrymen.\n“Instead, the meeting focused on criticizing Israel, the one true democracy in the Middle East,” Haley said.","url":"https://www.breitbart.com/middle-east/2018/07/10/watchdog-overwhelming-evidence-un-fails-to-combat-anti-semitism/"}
