{"authors":["Nick Hallett"],"date_download":"2018-10-30 20:54:12","date_modify":"2018-10-30 20:54:12","date_publish":"2014-11-05 10:53:00","description":"The Prince of Wales has condemned the persecution of Christians in the Middle East and called on Muslim leaders to help end the","filename":"data/vaneerConsumption/WATCHPrinceCharlesCallsonMuslimLeaderstoEndPersecutionofChristians.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_11_05__1540932852.html","title":"WATCH: Prince Charles Calls on Muslim Leaders to End Persecution of Christians","title_page":"WATCH: Prince Charles Calls on Muslim Leaders to End Persecution of Christians | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Prince of Wales has condemned the persecution of Christians in the Middle East and called on Muslim leaders to help end the “indescribable tragedy” in Syria and Iraq. He called on leaders of all faiths to ensure their followers respect people of other religions rather than “remaining silent”.\nSpeaking in a video played at the House of Lords ahead of the publication of a new report that claims that Christians are the “most persecuted religious minority” in the world and that freedom of religion is most under threat in Muslim nations.\nThe Prince added that religion is essential to “our future as a free society”, adding that “horrendous and heart-breaking” events in Syria and Iraq had brought persecution “to the forefront of the world’s news”.\nHe said: “We have learnt with mounting despair of the expulsion of Christians, Muslims and Yazidis from towns and cities that their ancestors have occupied for centuries.\n“Sadly, incidents of violence in Iraq and Syria are not isolated. They are found throughout some, though not all, of the Middle East; in some African nations; and in many countries across Asia.”\nHe also said that it was an “indescribable tragedy” that Christianity is now threatened in an area where Christians have lived for 2,000 years, especially as they had previously live in peace alongside Muslims.\nThe Prince added that people of faith play a “crucial role” in ensuring a free society in Britain and around the world.\nQuoting Pope Francis, the future king said that dialogue with other faiths was not only crucial to peace in the world, but was also a “duty” for Christians. “My own Christian faith has enabled me to speak to, and to listen to, people from other traditions, including Islam,” he added.\n“It is essential that governments honour their duty to uphold the right of people to practise their faith. Article 18 of the Universal Declaration of Human Rights is clear in stating that this right includes the freedom to change one’s religion or belief. Yet even in the West this right is often challenged.\n“Sadly, in many other countries, an absence of freedom to determine one’s own faith is woven into the laws and customs of the nation.”\nHolocaust survivor Dr Martin Stern told the Telegraph: “After World War Two, after the Nazis’ failed attempt to murder my one-year-old sister and myself and I was trying to come to terms with the murder of my father in Buchenwald and his brother in Auschwitz, the thought that Christians might one day be a major persecuted group in the world never entered my head.\n“And so it has turned out.”","url":"https://www.breitbart.com/europe/2014/11/05/prince-charles-calls-on-muslim-leaders-to-end-persecution-of-christians/"}
