{"authors":["Breitbart Tv"],"date_download":"2018-10-30 18:25:24","date_modify":"2018-10-30 18:25:24","date_publish":"2016-02-03 19:17:54","description":"The University of Michigan’s chapter of Young Americans for Freedom will host a debate between New York Times bestselling author and conservative |","filename":"data/vaneerConsumption/WatchDineshDSouzaBillAyersDebateLiveattheUniversityofMichigan.json","image_url":"https://media.breitbart.com/media/2016/02/DSouza23.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_02_03__1540923924.html","title":"Watch: Dinesh D’Souza, Bill Ayers Debate Live at the University of Michigan","title_page":"Watch: Dinesh D’Souza, Bill Ayers Debate Live at the University of Michigan | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The University of Michigan’s chapter of Young Americans for Freedom will host a debate between New York Times bestselling author and conservative commentator Dinesh D’Souza and liberal activist Bill Ayers on February 3 at 6 p.m. EST.\nD’Souza and Ayers will debate the topic, “What’s So Exceptional About America?”\nThe event is sponsored by Young America’s Foundation’s (YAF) Wendy P. McCaw Freedom Lecture Series, the U-M Central Student Government, and the University of Michigan American Culture Department, among others. Past debates between D’Souza and Ayers have engaged millions of viewers and generated headline-making ideological clashes between the two men.\nD’Souza and Ayers debated famously in a YAF-sponsored event at Dartmouth in 2014 and live on Fox News Channel’s “The Kelly File” that year as well. In previous debates, Ayers has declared that he’s “not proud to be an American” and accused the country of “doing horrible things.” like committing genocide. The pair’s tense exchanges in past debates will come to a head as they confront one another over this controversial topic on which their opinions are diametrically opposed.\n“Young Americans for Freedom is excited to host this very high profile event at the University,” said Grant Strobl, chairman of Young Americans for Freedom at the University of Michigan. “On a campus that is often viewed as expressing one ideological viewpoint, we are excited to break the school’s culture of political correctness and have a meaningful debate on policy. We expect a packed house and a lively debate.”\nDean of the University of Michigan College of Literature, Science, and the Arts Dr. Andrew Martin will moderate the debate. The event will held in the University’s Michigan League Ballroom in Ann Arbor, Michigan.\nFollow Breitbart.tv on Twitter @BreitbartVideo","url":"https://www.breitbart.com/video/2016/02/03/watch-dinesh-dsouza-bill-ayers-debate-live-at-the-university-of-michigan/"}
