{"authors":["Kipp Jones"],"date_download":"2018-10-30 18:53:01","date_modify":"2018-10-30 18:53:01","date_publish":"2015-04-27 16:25:53","description":"Days after a dozen Native American actors walked off the set of Adam Sandler’s upcoming Netflix-only comedy western, The Ridiculous Six, video has emerged of the actors expressing concerns the script is disrespectful and offensive to the film’s producers. |","filename":"data/vaneerConsumption/WatchNativeAmericanActorsArgueWithAdamSandlersRidiculousSixProducersBeforeWalkout.json","image_url":"https://media.breitbart.com/media/2015/04/Screen-Shot-2015-04-27-at-12.35.59-PM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_04_27__1540925581.html","title":"Watch: Native American Actors Argue With Adam Sandler's 'Ridiculous Six' Producers Before Walkout","title_page":"Watch: Native American Actors Argue With Adam Sandler's 'Ridiculous Six' Producers Before Walkout | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Days after a dozen Native American actors walked off the set of Adam Sandler’s upcoming Netflix-only comedy western, The Ridiculous Six, video has emerged of the actors expressing concerns the script is disrespectful and offensive to the film’s producers.\nPosted on YouTube by Indian Country Today, a cell phone video captures a person believed to be a producer on the film telling the American Indians they might be better off leaving the set if they are “overly sensitive” about the jokes in the script.\nThe video by Goldie Tom, shows the producer telling actors, who describe parts of the film as “disrespectful”: “if you are overly sensitive about it…you should probably leave… It’s not meant to be disrespectful.”\nOne actor also describes Sandler’s role as an Apache hero as “an insult to start with.”\n“You guys are the good guys.” a woman working on the film then tells the actors. “The people we are really making fun of, honestly, are the other gang members.”\nWatch the confrontation:\nAccording to Indian Country, examples of disrespect included Native women’s names such as Beaver’s Breath and No Bra, an actress portraying an Apache woman squatting and urinating while smoking a peace pipe, and feathers inappropriately positioned on a teepee.\nFormer rapper Vanilla Ice, who is part of the Choctaw tribe, and plays Mark Twain in the film, defended the film over the weekend, telling TMZ: “I don’t think anybody really had any ill feeling or any intent or anything. This movie isn’t Dances With Wolves — it’s a comedy.”\nPer the Hollywood Reporter, the film is a spoof of Western classic The Magnificent Seven and is the first in a four-movie deal between Sandler and Netflix, which was announced back in October.","url":"https://www.breitbart.com/entertainment/2015/04/27/indian-actors-ridiculous-six-walkout-caught-on-video-producer-if-youre-too-sensitive-leave/"}
