{"authors":["James Tapsfield","Political Editor For Mailonline"],"date_download":"2018-10-22 23:54:30","date_modify":"2018-10-22 23:54:30","date_publish":"2017-03-16 08:13:05","description":"The Electoral Commission specifically referred to South Thanet - where Craig Mackinlay defeated Ukip's Nigel Farage -  as it found the party had mis-declared thousands of pounds of spending.","filename":"data/vaneerConsumption/WatchdogcondemnsTorycampaignexpensesdodges.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/0C6B260E00000514-0-image-a-5_1489681111718.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319206_CPS-sent-files-election-expenses-20-Tory-MPs_1540252470.html","title":"Watchdog condemns Tory campaign expenses dodges","title_page":"Watchdog condemns Tory campaign expenses dodges | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Tory election expenses scandal escalated dramatically today as a watchdog found candidates appear to have gained a 'financial advantage' over opponents.\nThe Electoral Commission specifically referred to South Thanet - where Craig Mackinlay defeated Ukip's Nigel Farage - as it found the party had mis-declared thousands of pounds of spending.\nAllocating expenditure to the national campaign meant it did not have to be included within much more restrictive limits for individual candidates.\nThe watchdog's damning verdict will fuel mounting speculation about potential re-runs of elections in seats won by the Tories in 2015.\nUKIP responded today by confirming that it has begun a candidate selection process in South Thanet - where Mr Farage has said he will 'probably' stand again if there is a new poll.\nThe Tory election expenses controversy centres around the use of battlebuses like this one in the 2015 general election\nThe developments follow the news that a dozen police forces have sent files to the Crown Prosecution Service as part of a parallel probe into election spending returns filed by 2015 Tory candidates.\nUp to 20 MPs are thought to be caught up in probes, with at least three known to have been questioned by police.\nThe Commission fined the Tories a record £70,000 for 'numerous failures' in reporting its expenses for the 2015 General Election, and three by-elections in 2014, and referred the party's former treasurer to the police.\nCommission chairman Sir John Holmes said the Tories' failure to follow the rules 'undermined voters' confidence in our democratic processes' and said there was a risk political parties were seeing such fines as 'a cost of doing business'.\nThe Conservatives accepted the fine but their claim that they complied fully with the investigation was questioned by the Commission, which revealed it had to go to court to obtain certain information from the party and criticised its 'unreasonable uncooperative conduct'.\nThe Commission's investigation was launched following Daily Mirror and Channel 4 News allegations that the Tories had incorrectly recorded spending on a 'battle bus' tour which took activists to campaign in key marginal seats.\nThe allegations centred on whether the tour should have been recorded as counting towards individual candidates' spending limits, rather than as part of the larger national spending return.\nPrime Minister Theresa May is braced for the outcome of police investigations into a series of Tory MPs' election campaigns\nThe Commission found no evidence to suggest the party had funded the Battlebus2015 campaign to promote the success of individual candidates.\nBut it said there was a 'clear and inherent risk' that activists on the coaches 'might engage in candidate campaigning' and that 'it is apparent that candidate campaigning did take place' during the tour.\nAmong the seats investigated by the Commission was South Thanet, where Tory Craig Mackinlay narrowly beat former Ukip leader Nigel Farage.\nThe Commission said in its report: 'The inclusion in the party return of what in the Commission's view should have been reported as candidate spending meant that there was a realistic prospect that this enabled its candidates to gain a financial advantage over opponents.\n'In this respect the Commission noted that the Battlebus2015 campaign visited target constituencies and that South Thanet was also a key priority for the party.'\nThe Commission found that the party assumed, but did not expressly discuss, recording the bus tour as national spending.\nDavid Cameron was Conservative leader during the 2015 general election campaign, when the party mis-declared around £275,000 of spending.\nIt has referred Simon Day, who was the party's treasurer until April 2016, to the Metropolitan Police over a potential breach of the Political Parties, Elections and Referendums Act.\nThe watchdog said Mr Day's claim that £63,487-worth of spending on the bus tour had been omitted from the party's spending return as a result of 'human error' was 'not a reasonable excuse'.\nIf Mr Day is found to have 'knowingly or recklessly' falsely declared that the party's 2015 election spending return was complete and correct to his knowledge or belief, he will have committed a criminal offence under the Act, the Commission said.\nSir John said: 'Our investigation uncovered numerous failures by a large, well-resourced and experienced party to ensure that accurate records of spending were maintained and that all of the party's spending was reported correctly.\n'The rules established by Parliament for political parties and their finances are there to ensure transparency and accountability.\nThanet South MP Craig Mackinlay was said to have been interviewed under caution last week. He denies any wrongdoing\n'Where the rules are not followed, it undermines voters' confidence in our democratic processes, which is why political parties need to take their responsibilities under the legislation seriously.'\nHe went on: 'This is the third investigation we have recently concluded where the largest political parties have failed to report up to six-figure sums following major elections, and have been fined as a result.\n'There is a risk that some political parties might come to view the payment of these fines as a cost of doing business; the Commission therefore needs to be able to impose sanctions that are proportionate to the levels of spending now routinely handled by parties and campaigners.'\nCommission chief executive Claire Bassett said the investigation had been 'difficult' and that the watchdog at one point had to obtain a court order to get the Tories to hand over information.\n'It has been quite a protracted investigation and some of that has been because we have had some difficulty in getting information from the party and indeed had to resort to seeking a court order at one point,' she told BBC Radio 4's Today programme.\nMrs May said: 'First of all on the Electoral Commission report, we have complied fully with the Electoral Commission throughout their investigations.\n'They have imposed a fine on the Conservative party and the Conservative party will be meeting that fine, will be paying that fine. In fact there were some issues that the party itself raised with the Electoral Commission through their investigations.\nA Conservative Party spokesman said: 'Political parties of all colours have made reporting mistakes from time to time.\n'The Labour Party and Liberal Democrats both failed to declare sums of money which constituted a larger proportion of their national expenditure in the 2015 general election.\n'Both have been fined by the Electoral Commission, and the Liberal Democrats are also under police investigation.\n'This is the first time the Conservative Party has been fined for a reporting error.\n'We regret that and will continue to keep our internal processes under review to ensure this does not happen again.\nNigel Farage has said he would 'probably' run in any re-run contest for Thanet South if Craig Mackinlay, pictured right with his opponents at the 2015 declaration, is prosecuted\n'Given the range of technical errors made by a number of political parties and campaign groups, there also needs to be a review of how the Electoral Commission's processes and requirements could be clarified or improved.'\nLast night t he CPS said it had received 11 files from police forces relating to spending returns by candidates.\nSPENDING 'SEEMS TO HAVE BEEN UNDERSTATED' IN SOUTH THANET The Tories appear to have understated their campaign spending in the key battleground seat of South Thanet where they successfully fought off the challenge of former Ukip leader Nigel Farage, the Electoral Commission has found. The commission highlighted the role played by a team of national officials based in the constituency during the 2015 general election, including a senior campaigns office, a senior press adviser and two political advisers. Although they are not named in the report, the advisers have previously been reported to include Theresa May's current chief of staff Nick Timothy, who was an adviser to her in the Home Office. The Conservatives argued that they had, unusually, based their national anti-Ukip campaign in the Kent constituency, mirroring the fact that Ukip's national campaign was also there. However, the commission found that a proportion of the party's national spending actually related to the effort to secure the election of the local candidate, Craig Mackinlay, and should have been declared in his election return. 'The commission cannot determine precisely what proportion of spending on the party's team in South Thanet should have been apportioned to Mr Mackinlay's campaign,' it said. 'This is largely as a result of the party failing to keep records sufficient to establish the appropriate apportionment. However, the commission notes that as a consequence of the party reporting these costs, they were missing from Mr Mackinlay's candidate campaign expenses return. 'Consequently it appears that the party understated the spending it incurred on Mr Mackinlay's campaign, and as a result there is doubt as to the accuracy and completeness of his election expenses return.' The spending included £15,641 for rooms in the Royal Harbour Hotel in Ramsgate, which was declared as part of the party's national spending return. The commission also found that the party failed to declare a further £3,809.03 in hotel bills for the Premier Inn in the town. The Conservatives blamed 'simple human error' but the commission said that was not a 'reasonable excuse'.\nThey were from Avon and Somerset, Cumbria, Derbyshire, Devon and Cornwall, Gloucestershire, Greater Manchester, Lincolnshire, Metropolitan, Northamptonshire, Nottinghamshire and West Yorkshire police.\nStaffordshire Police separately confirmed it had sent a file to prosecutors.\nThose allegations centre on the party's battle bus campaign and whether hotel bills declared nationally should have been included on candidates' local spending returns.\nThe CPS announcement came as Channel 4 News revealed a new stage of its investigation into the affair, publishing emails linking senior No 10 aides to the race for Thanet South.\nBreaking tight spending limits on a local constituency campaign carries a maximum penalty of a year in prison and could force the constituency races to be re-run.\nLosing even a handful of by-elections could destroy Theresa May's Commons majority, which is 17.\nThe Conservative Party denies wrongdoing and said it is cooperating with inquiries.\nSome 19 police forces were studying allegations and asked for an extension to the deadline on election offences last year.\nDS Steve Maxfield of Staffordshire Police's fraud and financial investigation unit said: 'A file has been submitted to the Crown Prosecution Service.'\nChannel 4 News last night revealed emails naming Stephen Parkinson, Theresa May's Political Secretary and Chris Brannigan, Director of Government Relations at the Cabinet Office as linked to the Thanet South election.\nThe race was won by Mr Mackinlay, beating Nigel Farage into second place by nearly 3,000 votes.\nThe programme has previously revealed emails linking Nick Timothy, now Mrs May's chief of staff but then a senior Tory staffer, to the same campaign.\nThe senior team were all put up at the Royal Harbour Hotel in Ramsgate, where the Conservative Party racked up a bill of more than £14,000 over the course of the campaign.\nNone of the costs incurred at the Royal Harbour hotel were declared by Mr Mackinlay in his expenses return.\nA Conservative spokesman told Channel 4 News: 'We are cooperating with the ongoing investigations.'\nThe CPS list does not include Kent Police, which is reported to have interviewed Thanet South MP CraigMackinlay under caution last week.\nMr Mackinlay denies any wrong doing.\nSome cases have been investigated and concluded with no further action.\nColchester MP Will Quince announced yesterday he had been investigated and cleared by Essex Police.\nTory chairman Patrick McLoughlin swats Sky News reporter's phone away as he angrily refuses to comment on election expenses scandal\nConservative Party chairman Patrick McLoughlin today shoved a reporter's phone towards the floor to avoid questions about the Tory elections expenses scandal.\nThe angry exchange came as Mr McLoughlin was walking outside Parliament when he was approached by Sky News' Darren McCaffrey who asked questions about today's Electoral Commission report.\nThe Tories have been fined £70,000 by the watchdog for not properly reporting their general election expenses.\nConservative Party chairman Patrick McLoughlin has shoved a reporters phone towards the floor to avoid questions about the Tory elections expenses scandal\nAnd the party faces at least 12 criminal cases which have been handed to prosecutors over allegations the party wrongly declared local campaign expenses on its national return.\nMr McLoughlin insisted to Sky News the party had made a statement and refused to answer any more questions before heading inside Parliament.\nHe pushed McCaffrey's phone toward the floor after the reporter introduced himself as from Sky News.\nUp to 20 Tory MPs are in the firing line after a dozen police forces investigating allegations of general election expenses fraud passed files to prosecutors.\nThe probes, which all relate to Conservatives who won seats in 2015, have seen at least two MPs questioned under police caution.","url":"https://www.dailymail.co.uk/news/article-4319206/CPS-sent-files-election-expenses-20-Tory-MPs.html"}
