{"authors":["Trent Baker"],"date_download":"2018-10-30 20:49:55","date_modify":"2018-10-30 20:49:55","date_publish":"2015-09-28 15:06:14","description":"Watch: Man Sets Fire to Spider at Gas Pump, Inferno Ensues","filename":"data/vaneerConsumption/WatchManSetsFiretoSpideratGasPumpInfernoEnsues.json","image_url":"https://media.breitbart.com/media/2015/09/spider.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_09_28__1540932595.html","title":"Watch: Man Sets Fire to Spider at Gas Pump, Inferno Ensues","title_page":"Watch: Man Sets Fire to Spider at Gas Pump, Inferno Ensues | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A man at a Detroit gas station caused a fire by putting a lighter to what he claims was a spider near his fuel door.\nThe man can be heard on surveillance video at the Center Line station asking, “Is that a spider in there?” The video then shows flames breaking out along the side of the car, the gas pump and the pavement.\nStation clerk Susan Adams said she turned off the pump from inside the station and called the fire department. The man grabbed the fire extinguisher after moving his car and put the fire out before the fire department got to the scene, but the man was not completely honest with Adams with how the fire came about.\n“It shocked me because it was like, ‘So how did it catch on fire,'” recalled Adams. “And when I asked him after everything was done I’m like ‘Well, I know you wasn’t smoking and you wasn’t on the phone.’ So he’s like, ‘Well I have static in my car.’ So, I took it as that because when you have static you’re supposed to get out the car and wipe your hands on your car.”\nThe man apologized the next day for the raucous he caused.\n“He was sorry. He was sorry, he said he didn’t know. It is just one of those things that happen – stupidity,” Adams said.\n(h/t 11Alive)","url":"https://www.breitbart.com/video/2015/09/28/watch-man-sets-fire-to-spider-at-gas-pump-inferno-ensues/"}
