{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 18:46:38","date_modify":"2018-10-30 18:46:38","date_publish":"2015-01-09 20:29:02","description":"The trailer for the controversial new Lifetime show Born in the Wild was released Friday. |","filename":"data/vaneerConsumption/WATCHWomenGiveBirthinaForestforNewLifetimeShowBornintheWild.json","image_url":"https://media.breitbart.com/media/2015/01/Born-in-the-wild.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_01_09__1540925198.html","title":"WATCH: Women Give Birth in a Forest for New Lifetime Show 'Born in the Wild'","title_page":"WATCH: Women Give Birth in a Forest for New Lifetime Show 'Born in the Wild' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The trailer for the controversial new Lifetime show Born in the Wild was released Friday.\nThe show will chronicle the experiences of expecting mothers who decide to birth their children in the wilderness, ostensibly far from any hospitals or medical care.\nIn the 2-minute exclusive preview from Entertainment Weekly, a young expectant mother can be seen heading into a vast forest with her spouse to prepare. Superimposed phrases flash across the screen.\n“No hospital. No medicine. No doctors. No turning back.”\nWATCH TRAILER HERE\nThe show, premiering this spring on the Lifetime channel, had drawn criticism immediately after it was announced. Dr. Ron Jaekle, a maternal-fetal medical specialist at the University of Cincinnati Medical Center, told Entertainment Weekly that giving birth in the wilderness has historically been a very dangerous activity for young mothers.\n“I understand everybody wants to believe we overmedicalize pregnancy and that it’s a natural process,” Jaekle told the outlet. “But it’s a natural process that historically has caused an extraordinary loss of life. There is not a single piece of literature that we had to read growing up that didn’t talk about somebody’s mother or wife dying in childbirth, it was part of the national vocabulary. In the 1900’s, a woman died for every 1,000 babies born in the United States. Today it’s .1 for every 1,000.”\nProducer Yoshi Stone reportedly defended the show onstage at the Television Critics Association press tour in Pasadena on Friday, with a couple from the show at his side.\n“There are heated debates on all sides of it,” Stone said, according to EW. “But the important thing is everybody should be allowed to make their own decisions.”\nStone told the outlet that the show would take certain precautions to protect the safety of those involved: the production excludes first-time mothers, and Stone maintained that participants are offered access to as much medical help as they want. Couples are also not paid to participate; Stone said all of the expectant mothers had decided to pursue birthing in the wild on their own, before Lifetime approached them.\n“Our first child was born in a hospital and this was en experience that we decided we didn’t want to do again,” participating mother Audrey Bird told EW. “For us it wasn’t about going to the middle of nowhere, we live in the middle of nowhere, this was a home birth… birth for me is something very important and I wanted to get it out there that you can have birth anywhere you chose – your hospital, your home, your backyard.”\nThe six-episode first season of Born in the Wild premieres March 3 at 10pm on Lifetime.","url":"https://www.breitbart.com/entertainment/2015/01/09/watch-women-give-birth-in-a-forest-for-new-lifetime-show-born-in-the-wild/"}
