{"authors":["Alicia Lu"],"date_download":"2018-10-30 23:52:16","date_modify":"2018-10-30 23:52:16","date_publish":"2014-08-12 21:56:44","description":"Every August, the Perseid meteor shower shoots across the sky like distant fireworks. This year, the Perseid meteor shower is reaching its peak on Tuesday night and early Wednesday morning. The shooting star display is often considered the most…","filename":"data/vaneerConsumption/WatchThePerseidMeteorShowerOnlineHeresExactlyHow.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/8/cb31d47b-ab5e-41e0-99dc-57603fa8725c-getty-588654558.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35508-watch-the-perseid-meteor-shower-online-heres-exactly-how_1540943536.html","title":"Watch The Perseid Meteor Shower Online: Here's Exactly How","title_page":"Watch The Perseid Meteor Shower Online: Here's Exactly How","title_rss":"NULL","source_domain":"bustle.com","text":"Every August, the Perseid meteor shower shoots across the sky like distant fireworks. This year, the Perseid meteor shower is reaching its peak on Tuesday night and early Wednesday morning. The shooting star display is often considered the most popular of the year, dazzling spectators all across the Northern Hemisphere. This year, there's an unfortunate celestial scheduling conflict, as the supermoon became full on Sunday and might compete with the glow of the Perseid meteor shower. But not to worry — if the supermoon or your brightly lit city won't allow you to fully appreciate the shower, you can still watch it online.\nEvery year, between around July 17 to Aug. 24, Earth passes the orbital path of Comet Swift-Tuttle, a Halley-type comet with an orbital period of 133 years and the parent body of the Perseid meteor shower. As the Earth passes through its path, debris from the comet hit our upper atmosphere at 130,000 miles an hour, creating frictional heating that makes the pieces incandescent and visible from the ground. The shower's peak occurs when the Earth moves through the thickest part of the debris.\nThis year, that's happening Tuesday. If you're looking for a website to watch the shower live online, here's our handy guide.\nThe Slooh Community Observatory\nEthan Miller/Getty Images News/Getty Images\nThe Slooh robotic telescope service regularly broadcasts celestial events, and on Tuesday night starting at 7 p.m. EDT, it'll live stream the Perseid meteor shower from its flagship observatory at The Institute of Astrophysics of the Canary Islands on Mount Teide on the Island of Tenerife.\nNASA\nChristopher Furlong/Getty Images News/Getty Images\nNASA will also be live streaming the shower, starting at 9:30 p.m. EDT, broadcasting the display from the skies over Marshall Space Flight Center in Huntsville, Ala. NASA Meteoroid Environment Office officials will also hold a live web chat and Q&A following the live stream at 11 p.m. EDT.\nSpace.com\nEthan Miller/Getty Images News/Getty Images\nSpace.com will also broadcast Slooh's live stream from its site.","url":"https://www.bustle.com/articles/35508-watch-the-perseid-meteor-shower-online-heres-exactly-how"}
