{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:06:02","date_modify":"2018-10-30 21:06:02","date_publish":"2017-01-01 21:58:51","description":"TEL AVIV - The YouTube sensations known as Diamond and Silk released a new video slamming President Barack Obama and Secretary of State John Kerry for \"stabbing Israel in the back.\" | Israel / Middle East","filename":"data/vaneerConsumption/WATCHDiamondAndSilkSlamObamaKerryForStabbingIsraelInTheBack.json","image_url":"https://media.breitbart.com/media/2016/07/DiamondSilk.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_01_01__1540933562.html","title":"WATCH: Diamond And Silk Slam Obama, Kerry For 'Stabbing Israel In The Back'","title_page":"WATCH: Diamond And Silk Slam Obama, Kerry For 'Stabbing Israel In The Back' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – The YouTube sensations known as Diamond and Silk released a new video slamming President Barack Obama and Secretary of State John Kerry for “stabbing Israel in the back.”\nThe hilarious duo, sisters with the real names of Lynette Hardaway and Rochelle Richardson, rose to fame when they shot videos in ardent support of President-elect Donald Trump during his bid for the Republican nomination.\nTheir latest video, entitled “We Stand With Israel: Kerry and Obama don’t know where they stand,” lambasts Kerry for his address last week on the Israeli-Palestinian conflict.\nIn apparent reference to Kerry’s wife Teresa Heinz, Hardaway said, “Kerry must be slipping in all of that Heinz Ketchup—’cause he trippin’!”\nHardaway continues by attacking Obama for not having Israel’s back and for being “out of touch.”\n“Let me tell you something: Israel is our ally, so that means we have to have their backs! I don’t care if their back is small, and our backs are big, we still got to have their backs — period.”\n“[Obama] was out of touch with this election. He was out of touch with the American people. And now he is out of touch with Israel,” she says.\n“And if he’s not careful, somebody will end up stabbing Israel in the back,” she cries, as Richardson animatedly demonstrates the knife-to-back action. “And we can’t let that happen!”\nTo end, the two sisters declare in unison: “Guess what — We stand with Israel! We will always have their back!”","url":"https://www.breitbart.com/middle-east/2017/01/01/watch-diamond-and-silk-we-stand-with-israel/"}
