{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 18:58:49","date_modify":"2018-10-30 18:58:49","date_publish":"2018-07-28 15:02:57","description":"Israel should insist on a complete Iranian military withdrawal from Syria and must continue to protect and demarcate its borders by shooting down any enemy aircraft that penetrates the Jewish state’s airspace, argued Breitbart Jerusalem Chief Aaron Klein.","filename":"data/vaneerConsumption/WATCHBreitbartsAaronKleinIranMustCompletelyWithdrawfromSyria.json","image_url":"https://media.breitbart.com/media/2017/01/Iran-Revolutionary-Guards.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2018_07_28__1540925929.html","title":"WATCH - Breitbart’s Aaron Klein: Iran Must Completely Withdraw from Syria","title_page":"WATCH – Breitbart’s Aaron Klein: Iran Must Completely Withdraw from Syria | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Israel should insist on a complete Iranian military withdrawal from Syria and must continue to protect and demarcate its borders by countering any enemy aircraft that penetrates the Jewish state’s airspace, argued Breitbart Jerusalem Chief Aaron Klein.\nSpeaking during a televised panel segment on Israel’s i24NEWS (video above), Klein stated:\nOf course Israel should insist on a complete pullout of all Iranian forces inside Syria as should (President) Bashar Assad of Syria if he wants his own country. Iran is not simply problematic 100 kilometers to Israel’s border. If Iran has missile installations 101 kilometers or further, that is an existential threat to the Jewish state. And by the way about Syria. I don’t think that Bashar Assad wants any sort of confrontation with Israel. He’s trying to fight back the rebels in Syria. And if the Syrians are going to respond as they are promising they might want to actually respond by training their own pilots because clearly this Syrian pilot mistakenly entered Israeli territory. And that is something Israel cannot allow. They cannot allow a country at war with the Jewish state even by mistake to send a warplane into Israeli territory. And I remind everybody to connect it back to Iran that this comes a few months after an Iranian drone in February penetrated Israeli airspace and apparently was carrying explosives. So, Israel must demarcate its borders.\nKlein was responding to reports that Prime Minister Benjamin Netanyahu’s government turned down a Russian offer to keep Iranian forces in Syria 100 kilometers (about 62 miles) from the Israeli border. An Israeli official stressed to the news media that Jerusalem is maintaining its demand for a complete Iranian pullout from Syria.\nThe Breitbart Jerusalem chief was also addressing the IDF’s downing of a Syrian fighter jet last Tuesday that had penetrated Israeli airspace in the Golan Heights. Israel’s ambassador to the UN, Danny Danon, revealed the IDF attempted to contact the Syrian pilot before shooting down the enemy aircraft but did not get a response. Danon explained that Israel is a tiny country and does not have the luxury of time to fly out aircraft to escort the Syrian plane before it reaches population zones.\nPrime Minister Benjamin Netanyahu characterized the Syrian warplane’s penetration as “a gross violation of the 1974 Separation of Forces Agreement with Syria.”\n“We will not accept any such penetration of, or spillover into, our territory, neither on the ground nor in the air. Our forces acted appropriately,” Netanyahu said.\nAn unnamed Syrian source vowed that Syria would respond to the shootdown even though it was Syria that had violated Israel’s airspace.\n“You will not have to wait long for a response, but we’ll get there in a few steps, firstly we need to finish all the ongoing military operations in the country,” the source told the Al-Nusra Lebanese website. “The direct response to the Israeli forces will come at an appropriate time. The final step will be thwarting any attempts to remove the Syrian allies from the region.”","url":"https://www.breitbart.com/middle-east/2018/07/28/watch-breitbarts-aaron-klein-iran-must-completely-withdraw-from-syria/"}
