{"authors":["Trent Baker"],"date_download":"2018-10-30 21:29:17","date_modify":"2018-10-30 21:29:17","date_publish":"2016-03-10 16:39:04","description":"On Wednesday, 2015 NBA MVP and Golden State Warriors superstar Steph Curry continued his reign of excellence by nailing a buzzer-beater from beyond |","filename":"data/vaneerConsumption/WatchStephCurryDrainsHalfCourtBuzzerBeaterSprintsStraighttoLockerRoom.json","image_url":"https://media.breitbart.com/media/2016/03/steph-curry.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_03_10__1540934957.html","title":"Watch: Steph Curry Drains Half-Court Buzzer Beater, Sprints Straight to Locker Room","title_page":"Watch: Steph Curry Drains Half-Court Buzzer Beater, Sprints Straight to Locker Room | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Wednesday, 2015 NBA MVP and Golden State Warriors superstar Steph Curry continued his reign of excellence by nailing a buzzer-beater from beyond half-court to give his team a 52-41 lead at halftime.\nRather than celebrating his bank shot with teammates, Curry sprinted straight to the locker room.\n“It was a great exit. That was fantastic,” Warriors Coach Steve Kerr said. “It was like when Bo Jackson ran out of the stadium. I’m glad he came back for the second half. When he shoots it, you know it has a chance. It’s incredible. I’ve never seen anybody that accurate from midcourt. It always looks good, even the ones that miss. He gives it a chance every time.”\nAccording to an official statistics Twitter account for the Warriors, Curry, who this season has already broken his own record for most made three pointers in the regular season, has made four out of eleven of attempts from 40 or more feet.\nOfficially a 55-footer at the buzzer from Stephen Curry. He's 4-of-11 this season from 40+ feet (36.4%) & 13-of-27 (48.1%) from 30+ feet — GSWStats (@gswstats) March 10, 2016\nFollow Trent Baker on Twitter @MagnifiTrent","url":"https://www.breitbart.com/video/2016/03/10/watch-steph-curry-drains-half-court-buzzer-beater-sprints-straight-to-locker-room/"}
