{"authors":["Associated Press"],"date_download":"2018-10-22 22:12:23","date_modify":"2018-10-22 22:12:23","date_publish":"2017-04-26 03:45:19","description":"MANILA, Philippines (AP) - An international human rights watchdog is calling on Southeast Asian leaders to take a stand against the Philippines' war on drugs...","filename":"data/vaneerConsumption/WatchdogsaysASEANmuststandvskillingsinPhilippines.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446150_Watchdog-says-ASEAN-stand-vs-killings-Philippines_1540246343.html","title":"Watchdog says ASEAN must stand vs. killings in Philippines","title_page":"Watchdog says ASEAN must stand vs. killings in Philippines | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MANILA, Philippines (AP) - An international human rights watchdog is calling on Southeast Asian leaders to take a stand against the Philippines' war on drugs that has left thousands dead under President Rodrigo Duterte, the host of this week's regional summit.\nAmnesty International said leaders of the 10-member Association of Southeast Asian Nations must consider whether the killings amount to a serious breach of ASEAN's charter, particularly its pledge to human rights.\nIt said up to 9,000 people have been killed by police or unknown armed persons since July 2016. Officials said not all deaths being reported are drug-related while others were killed in legitimate police operations.\n\"As the death toll mounts, so does evidence of the Philippines authorities' role in the bloodshed,\" said Champa Patel, Amnesty's director for Southeast Asia and the Pacific.\nPatel said the Philippines' chairing the ASEAN summit \"is a scandal, and should prompt the government to make independent and effective investigations into unlawful killings an immediate priority.\"\nIn an open letter to Philippine Justice Secretary Vitaliano Aguirre II, Amnesty International also called on authorities to conduct a prompt and impartial investigation into all drug related killings, and to press criminal charges against suspects, regardless of rank or status.\nPresidential spokesman Ernesto Abella said \"the so-called extrajudicial killings are not state-sanction or state-sponsored.\" He said that police conducting legitimate operations are required to follow protocols and those who breach them are made to answer before the law.\nAbella said that the Philippine Senate had conducted an independent investigation into the charges hurled against Duterte by a self-confessed assassin, and senators found no proof of state-sponsored killings.\nOn Monday, a Filipino lawyer presented documents to the International Criminal Court which he said contain evidence of Duterte's alleged involvement in extrajudicial killings.","url":"https://www.dailymail.co.uk/wires/ap/article-4446150/Watchdog-says-ASEAN-stand-vs-killings-Philippines.html"}
