{"authors":["Aaron Klein"],"date_download":"2018-10-30 21:21:38","date_modify":"2018-10-30 21:21:38","date_publish":"2016-01-29 23:12:56","description":"Several Palestinian required medical treatment when the ceiling of a Gaza City store collapsed due to the number of people standing on the rooftop.","filename":"data/vaneerConsumption/WATCHCeilingCollapsesonPalestiniansDuringFuneralforHamasTerrorTunnelTeam.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_01_29__1540934498.html","title":"WATCH - Ceiling Collapses on Palestinians During Funeral for Hamas Terror Tunnel Team","title_page":"WATCH - Ceiling Collapses on Palestinians During Funeral for Hamas Terror Tunnel Team | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Hamas has been having a difficult two days.\nFirst seven of its fighters were killed two days ago while reconstructing a terror tunnel that collapsed in the northeast section of Gaza City.\nThen on Friday, several Palestinians required medical treatment when the ceiling of a Gaza City store collapsed due to the number of people standing on the rooftop.\nVideo footage of the funeral incident was posted online by the Watania News Agency. A number of people can be seen falling from the roof, a few hitting the below concrete fairly hard as some in the crowd attempted to catch the falling onlookers.\nAt the funeral, senior Hamas official Ismail Haniyeh, the movement’s former prime minister, vowed to continue building tunnels to attack the Jewish state.\n“The Hamas military wing will continue with its preparations both underground and above ground,” Haniyeh declared. “On land and at sea, we will not stop until the liberation of the holy places [in Jerusalem].”\nOn Thursday, Breitbart Jerusalem quoted Hamas sources revealing the jihadists who died in the tunnel were members of a Hamas commando unit tasked with digging a tunnel into Israeli territory.\nThe incident occurred while Hamas forces were inspecting the renovation of a tunnel destroyed by Israel during the 2014 Gaza conflict. The tunnel collapsed due to weather conditions, the Hamas sources said.\nIn November, Breitbart Jerusalem reported Hamas was in the process of building a sophisticated network of tunnels beneath​ the Gaza Strip, according to multiple sources with knowledge of the ​issue.\nThe tunnel infrastructure mirrors ​the network built by Hezbollah in Lebanon. The Iran-sponsored militia is known to have ​dug a vast underground tunnel ​complex replete with war rooms, internal communication lines, ventilation systems, and even missile silos.\nAsked for comment, a spokesperson for the Israel Defense Forces told Breitbart Jerusalem:","url":"https://www.breitbart.com/national-security/2016/01/29/watch-ceiling-collapses-on-palestinians-during-funeral-for-hamas-terror-tunnel-team/"}
