{"authors":[],"date_download":"2018-10-30 21:56:40","date_modify":"2018-10-30 21:56:40","date_publish":"2018-07-11 15:30:00","description":"Cobb Commissioners voted to raise water rates this week as the board continues transferring millions of dollars from the water fund to the general fund to make up funding gaps.","filename":"data/vaneerConsumption/Waterratesgoingup.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBRadio/2018/03/09/Images/ThinkstockPhotos-469045868.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_c_b9920f4b79349cdde06c7abc4be988d4__1540936600.html","title":"Water rates going up","title_page":"Cobb County: Water rates going up","title_rss":"NULL","source_domain":"ajc.com","text":"Cobb Commissioners voted to raise water rates this week as the board continues transferring millions of dollars from the water fund to the general fund to make up funding gaps.\nThe increase will amount to about an extra $4.80 per month per household, according to Stephen McCullers, the director of the water system.\nMcCullers said the agency’s costs have gone up 25 percent since its last rate adjustment in 2012.\n“Expenses have substantially exceeded our revenues,” McCullers said.\nSome neighbors are pushing for the hike so that several parks do not close.\nThe commission agreed to transfer more than $20 million from the water fund last year and is preparing to transfer a similar amount this year. It has been using the water system to subsidize the general fund since the late nineties.\nIn the past, commissioners had expressed a desire to phase out transfers from the water fund to the general fund.\nThey were making progress until they voted to lower the millage rate in 2016, at which point the transfer amount shot back up, said Commissioner JoAnn Birrell.\nBirrell, who voted for that tax cut, voted against the water rate increase Tuesday.\n“As long as we are taking 10 percent of money generated in the water fund and transferring to the general fund, I can’t support an increase,” she said.\nChairman Mike Boyce, and Commissioners Lisa Cupid and Bob Weatherford voted in favor. Commissioner Bob Ott was absent.\nBoyce said he would like to reduce the water fund transfers, but it would likely require an even larger millage rate increase than the one he has proposed.\n“All of us ideally would want to go back to the situation where we paid for everything out of the general fund when we need to and leave the water system alone, but we’re not there right now,” Boyce said. “The reality is we’ve got to pay our bills somehow.”","url":"https://www.ajc.com/news/local-govt--politics/cobb-raises-water-rates-takes-millions-for-general-fund/ax2PMvQbdL5u2WWkzdWNKI/"}
