{"authors":["Liam Heagney For The Irish Daily Mail"],"date_download":"2018-10-22 22:07:02","date_modify":"2018-10-22 22:07:02","date_publish":"2017-03-10 00:18:45","description":"Ireland have lost six of the nine Six Nations matches they played with English official Wayne Barnes in charge, three losses coming in the five Ireland-Wales matches on his watch.","filename":"data/vaneerConsumption/WayneBarnesisnotanantiIrishreferee.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/2531E85E00000578-0-image-a-31_1489105078509.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-4299506_Wayne-Barnes-not-anti-Irish-referee_1540246022.html","title":"Wayne Barnes is not an anti-Irish referee","title_page":"Wayne Barnes is not an anti-Irish referee | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"First things first regarding what could be a Friday night thriller — Wayne Barnes genuinely isn’t an anti-Irish pantomime villain.\nHis results might seem to suggest differently. Ireland have lost six of the nine Six Nations matches they played with the English official in charge, three losses coming in the five Ireland-Wales matches on his watch.\nBut in truth, Ireland have only lost the penalty count twice on those nine occasions, in total conceding 102 penalties to the oppositions’ 116 and suffering just six yellow cards to an opponents’ tally of nine.\nReferee Wayne Barnes is often seen as a pantomime villain within Irish rugby\nThese numbers hardly endorse this week’s prevailing consensus that Barnes’ latest appointment is seemingly bad news for Ireland’s title bid.\nHe was present the last time they came a championship cropper in Cardiff, Ireland falling 12 penalty points behind in as many minutes two years ago following four breakdown infringements. However, the eventual penalty count in that round-four defeat, which ruined a Grand Slam tilt, wound up 13-11 against the Welsh who also endured two yellow cards.\nThat certainly doesn’t suggest anti-Irish bias, so the negative commentary surrounding Barnes has been unwarranted. Instead, Joe Schmidt’s side really must do what assistant Simon Easterby suggested at the start of the week — take the official out of the equation by playing in as disciplined a manner as possible.\nThey were collectively better behaved than the Welsh last month, with just 21 infringements to Wales’ 28. Ireland are five points and two places better off on the table than tonight’s hosts, who uncharacteristically lost two in a row and have seen indiscipline grow from five round-one penalties to 10 in round two and 13 the last day in Scotland.\nThe Englishman takes charge of Ireland's visit to face Wales in Cardiff on Friday night\nFears do exist that a more emotional Wales might now catch Ireland on the hop in the maelstrom of the expected beery Friday night atmosphere.\nHowever, if the outcome comes down to straightforward rugby without being influenced by external factors such as the referee and the crowd, Ireland’s far more industrious back -row and half-back combinations will see this challenge out and take the title race to the final weekend.\nIRELAND TEAM TO FACE WALES Backs: Rob Kearney; Keith Earls, Garry Ringrose, Robbie Henshaw, Simon Zebo; Johnny Sexton, Conor Murray; Forwards: Jack McGrath, Rory Best, Tadhg Furlong, Donnacha Ryan, Devin Toner, CJ Stander, Sean O'Brien, Jamie Heaslip. Replacements: Niall Scannell, Cian Healy, John Ryan, Iain Henderson, Peter O'Mahony, Kieran Marmion, Paddy Jackson, Tommy Bowe\nWales’ selection of an entirely unchanged 23, the first time they have done so from one match to the next since 1998, sent an emphatic message from caretaker boss Rob Howley that the players owe him one after that second-half Scottish cave-in.\nThey surely can’t be as sickly as they were 13 days ago, but neither can it be predicted with confidence their improvement will be enough to get a result.\nTheir back-row, for instance, were off the pace throughout February as Sam Warburton, Justin Tipuric and Ross Moriarty collectively made just a 125-metre gain off 74 carries.\nThose numbers pale in comparison to the Irish trio of CJ Stander, Sean O’Brien and Jamie Heaslip, who accounted for 370 metres off 166 carries.\nThe Irish trio also missed fewer tackles, just four of their 101, in contrast to the Welsh missing 10 of 113, and they were better disciplined, conceding just five penalties to the Welsh back-row’s eight.\nThese are significant numbers and while the excellent Conor Murray will surely be given an invigorating run for his money by impressive rival No9 Rhys Webb, Ireland will expect dominance at out-half where Johnny Sexton’s decisive performance against France left Dan Biggar and his Scottish struggles firmly in the shade.\nThe odds are against Wales then in these likely crucial back-row/half-back battles, but they remain a side that, Murrayfield excepted, doesn’t know when it is beaten.\nBarnes, pictured speaking with Ireland's Peter O'Mahoney during their 2014 game in Dublin\nThat belligerent attitude is why the past two Ireland-Wales Six Nations clashes have topped the tournament’s 2016 and 2015 ball-in-play charts.\nThe action lasted 42 minutes and 53 seconds 13 months ago in Dublin, when the Welsh clawed back a 13-point deficit to lead by three coming down the finishing straight before settling for a draw.\nWALES TEAM TO FACE IRELAND Backs: Leigh Halfpenny; George North; Jonathan Davies; Scott Williams; Liam Williams; Dan Biggar; Rhys Webb. Forwards: Rob Evans; Ken Owens; Tomas Francis; Jake Ball; Alun Wyn Jones; Sam Warburton; Justin Tipuric; Ross Moriarty. Replacements: Scott Baldwin; Nicky Smith; Samson Lee; Luke Charteris; Taulupe Faletau; Gareth Davies; Sam Davies; Jamie Roberts\nIn 2015 they were at it hammer and tongs for 54 seconds longer — the legacy of that game should have been a critical tale about Ireland’s inability to break down the second-half Welsh rear-guard, not the ongoing whingeing about Barnes’ influence at the early first-half breakdown.\nIreland’s attack under Schmidt still has its frustrations. Look at the last match — the outclassed French were only beaten by 10 points.\nSimilar pressure must be turned into additional points tonight, otherwise the door will be left open for Wales to cause an upset and invite England to kill the title race tomorrow against Scotland with a round to spare.\nThat’s an outcome to send a shiver down any Irish spine. They are tipped not to allow it happen.","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-4299506/Wayne-Barnes-not-anti-Irish-referee.html"}
