{"authors":["Andrew Magee For The Daily Mail"],"date_download":"2018-10-22 20:52:53","date_modify":"2018-10-22 20:52:53","date_publish":"2016-01-28 05:00:02","description":"Manchester United earned £395million in revenue in 2014-15 and are set to be football’s biggest earners in the next year. It’s a far cry from when they spent more on cleaning than they got in TV rights.","filename":"data/vaneerConsumption/WayneRooneyspaywouldcovertheannualManUnitedwagebillin1969.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/30A34A0600000578-0-image-a-22_1453942317794.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420267_Wayne-Rooney-earns-260-000-week-Manchester-United-1969-paid-annual-wage-bill-Old-Trafford_1540241573.html","title":"Wayne Rooney's pay would cover the annual Man United wage bill in 1969","title_page":"Wayne Rooney's pay would cover the annual Man United wage bill in 1969 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manchester United earned £395million in revenue in 2014-15 and are set to become football's biggest earners in the next year.\nIt's a far cry from the days when the club spent more on washing and cleaning bills than they earned from TV rights.\nClub accounts from 1969, Sir Matt Busby's final full season as manager, have been released by the Press Association, which show how finances in the game have changed dramatically in the intervening 47 years.\nIn 1969, with Sir Matt Busby as Manchester United boss, the wage bill was £204,028, while current captain Wayne Rooney now earns £260,000-a-week\nThat United side under Busby consisted of players such as Bobby Charlton (left) and Alex Stepney\nUnited, who also had George Best, had a wage bill in 1969 which in today's money equates to around £3million\nTHE OLD TRAFFORD NUMBERS £13,000 -The amount United earned from programme sales in 1969. That's nearly 10 times more than they brought in from TV broadcast deals with the Football League. £1,334 - United's income from broadcasting deals in 1969, when only the BBC and ITV competed for them — compared to last year's £107.7million. £556,878 - Matchday revenue at Old Trafford in 1969. Matchday revenue in 2015 was listed as £90.6million. 35% - United's wage bill in 1969 accounted for about 35 per cent of their total costs. In 2015, wages account for more than 50 per cent of the total. £1,915 - United's annual cost in 1969 for washing and cleaning. United's annual wage costs have increased by around £200million in just over 45 years\nIn 1969 the club's entire wage bill was £204,028. Wayne Rooney could pay that in a week with some to spare from his £260,000-a-week deal.\nAnd with the Premier League's new TV rights deal coming into effect next season United can expect a substantial increase on the £1,334 they received from broadcasting deals in 1969.\nUnited paid out £204,028 in 'wages and bonus' to players such as Denis Law, Sir Bobby Charlton and George Best.\nThat is estimated to equate to around £3million today - which is 1.5 per cent of £203million, the figure listed in United's financial report for 2014-15 under staff costs.\nUnited captain Rooney reportedly earns £260,000 a week, around £13.5million a year.\nIn terms of the amounts of money the club were working with, the Red Devils' total income for 1968-69 was £569,418 (equivalent of around £8.5million today), whereas in 2015 it was £395.2million, with the percentage spent on wages having jumped from about 35 per cent in the older era to just over 50 per cent.\nThe 1969 document features various indicators of just how much finance in football has changed over the years, with the difference in broadcast revenue unsurprisingly marked.\nUnited had 'washing and cleaning' expenses of £1,915 - a figure greater than that listed under 'TV Fees received from League', which stood at £1,334.\nThe document, dated October 23 1969, shows how finance in football has changed since the days of Best\nCharlton, along with Best and Denis Law, were the three stars of that United side under Busby\nUnited's 2015 budget was £395.2million, with the proportion spent on wages more than half\nThe club also made almost 10 times the TV amount through sales of their programmes, with that figure coming in at £13,248.\nThe 1969 television money sum equates to about £20,000 today. In an age of mega-money TV deals, United's broadcast revenue in their 2015 report was £107.7million.\nTheir latest figure for commercial revenue was even bigger - £169.9million.\nAnd while there is no direct comparison that can be made in 1969 on that front, United did have a category under incomings listed as 'Use of Ground, Catering Rights, Advertising, TV Facilities etc', with the total standing at £11,206 (£166,000 in today's money).\nWith regard to matchdays, the total income from gate and programme receipts combined was £556,878 (£8.3million in today's money). United's average league attendance was 51,121.\nUnited's matchday revenue was listed as £90.6million in 2015 after a season in which the average attendance was over 75,000.\nDuncan Drasdo, chief executive of Manchester United Supporters' Trust, told Press Association Sport: 'I wouldn't really criticise the players today (with regard to what they earn) because it is relative to what other clubs are offering.\n'To supporters, of course, the numbers are crazy.\nUnited's matchday revenue was £90.6million in 2015, after a season where average attendance was 75,000\nThe total income from gate and programme receipts combined was £556,878 at Old Trafford in 1969\nThe letter from the United chairman in 1969, L. C. Edwards, commends the club's profit of £65,201\n'But people in other areas of sport and entertainment earn huge amounts of money and I'm not quite sure why footballers get singled out for criticism.\n'If football was still amateur, I think you would still have players playing. Some might not - but I suspect a lot of the best players still would.","url":"https://www.dailymail.co.uk/sport/football/article-3420267/Wayne-Rooney-earns-260-000-week-Manchester-United-1969-paid-annual-wage-bill-Old-Trafford.html"}
