{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-23 00:10:25","date_modify":"2018-10-23 00:10:25","date_publish":"2017-04-26 09:34:09","description":"Syed Zaidi, 41, and his wife Rizwana Kamal, 40, pictured, claimed they were persecuted at home so flew to Britain with their family begging the Home Office to give them food and shelter in Manchester.","filename":"data/vaneerConsumption/WealthyPakistaniasylumseekersjailedsixmonthsapart.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/05/04/17/3F9D196D00000578-0-image-a-2_1493914814453.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446760_Wealthy-Pakistani-asylum-seekers-jailed-six-months-apart_1540253425.html","title":"Wealthy Pakistani asylum seekers jailed six months apart","title_page":"Wealthy Pakistani asylum seekers jailed six months apart | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Wealthy Pakistani asylum seekers with £250,000 in savings who claimed asylum in Britain before taking £40,000-a-year in benefits have been jailed six months apart to prevent their children going into care.\nSyed Zaidi, 41, and his wife Rizwana Kamal, 40, claimed they were being persecuted at home so flew to Britain with their family begging the Home Office to give them food and shelter.\nThe couple, who have three children, were given free accommodation and other welfare payments worth £150,000 over four years at taxpayers expense despite having more than £250,000 saved in seven different bank accounts.\nThey then bought two cars and moved in a Victorian terraced house in Denton, near Manchester, but were prosecuted after a whistleblower called the Home Office.\nIn the dock: Syed Zaidi, 41, and his wife Rizwana Kamal, 40, claimed benefits for four years after claiming asylum despite having £250,000 in the bank\nZaidi and Kamal won the right to stay in the UK in 2012 before claiming benefits until 2016.\nAt Minshull Street Crown Court, Manchester Judge Bernard Lever jailed the couple for ten months jail each.\nBut in an unusual move he delayed locking up Kamal until this week after her husband had been released having served half his sentence. It means their youngsters will not be taken into care at further expense to the taxpayer.\nIt is thought the couple will now have to sell the two cars and help pay back the money.\nBoth were denied taxpayer-funded legal aid due to their savings and represented themselves during their crown court hearings. Both admitted benefit fraud charges.\nThe judge said: 'The public will not tolerate this serious offence, with thousands of pounds of public money being dishonestly claimed by intelligent people such as yourselves. This is a tragic case for you children because you and your husband both graduated university, you had thousands of pounds in the bank and you have claimed hardworking tax payers money.\n'You are intelligent people who graduated university. You came here and had your young children, who I have made sure that they have a loving parent to take care of them so they aren't taken into care in the way I sentenced your husband to his time first, and now you must.\n'This is a serious offence, and I must send the message that you cannot claim thousands of pounds of tax payer money dishonestly when you have thousands of pounds in the bank and immediate custody must follow. I hope this sends a powerful message both to you and anyone else who is in the business of defrauding hard working taxpayers in this country.\n'This is a very sad case and I take no pleasure from it I assure you. You are both very intelligent people. If you have any money going into the accounts that is believed to be dishonestly received then that will be added to the total of money that you dishonestly took from the DSS.'\nCaught: They bought two cars and moved in a Victorian terraced house in Denton, pictured, near Manchester, but were prosecuted after a whistleblower called the Home Office\nIt is thought the couple arrived in the UK on Kamal's student visa. They claimed asylum seekers benefit, child tax and working tax credits and child benefits for their three children - as well as free accommodation because of the asylum seeker status.\nProsecutor John Wilcox told the court that £258,530 was left unaccounted for in the pairs accounts. He added: 'The sum they received in benefits was £150,000. There are also unidentified transfers into some of the bank accounts of the defendants which makes up the sum of £258,530.\n'The defendants have 7 bank accounts between them, and following conviction they were made subject to restriction orders on their funds. They also have two vehicles registers to Mr Zaidi. The figure that they have available to pay back after the sale of the cars if £9,560.07'\nThe court heard the pair had paid back £4,000. Kamal was ordered to pay 5,560 pounds in prosecution costs.\nIn her defence Kamal said: 'The children have been coming home from school upset, and they are all out of character and they are much more attached to me. They have been upset about their dad being away.\n'This has been such a big lesson for ups and it is a big embarrassment for this to have happened. Please don't take me away from my children - they won't be able to cope.'\nZaidi did not comment after the hearing.\nAt their home a neighbour said: 'We've barely seem and hardly know them. They keep themselves to themselves and we never saw them. The amount of money they too the taxpayer for is staggering especially when they asked for a new in the UK.'","url":"https://www.dailymail.co.uk/news/article-4446760/Wealthy-Pakistani-asylum-seekers-jailed-six-months-apart.html"}
