{"authors":["Sara Malm For Mailonline","Afp Reporter"],"date_download":"2018-10-23 01:00:53","date_modify":"2018-10-23 01:00:53","date_publish":"2016-01-11 11:25:09","description":"The French official said the 2015 attacks in Paris 'was nothing', and that terrorists are planning 'simultaneous attacks on the same day in several countries, several places' in Europe in the next year.","filename":"data/vaneerConsumption/WeareheadingtowardsaEuropean911Counterterrorismofficialsays.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/2E6CA91E00000578-0-image-a-48_1452511456942.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393669_We-heading-European-9-11-Counter-terrorism-official-says-terror-groups-plotting-simultaneous-attacks-various-countries-year_1540256453.html","title":"'We are heading towards a European 9/11': Counter-terrorism official says","title_page":"'We are heading towards a European 9/11': Counter-terrorism official says | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Europe is facing its own 9/11 with coordinated simultaneous attacks in several major cities in the coming year, a French counter-terrorism expert warns.\nThe counter-terrorism official said November's attacks in Paris, in which 130 people were killed, and 352 were injured by ISIS jihadists, could be the start of a calculated campaign.\nThe French official, speaking on condition of anonymity, has said: 'Unfortunately, I think 2015 was nothing.\nWarning: The French official said the November attacks in Paris (pictured) 'were nothing', and that terrorists are planning 'simultaneous attacks in several countries in Europe in the next year\n'We are moving towards a European 9/11: simultaneous attacks on the same day in several countries, several places. A very coordinated thing. We know the terrorists are working on this.'\nThe official added that ISIS is recruiting and training Europeans 'with the goal of sending them back to hit their countries of origin'.\n'They have the necessary false documents, the mastery of the language, the sites, the weapons. We stop a lot of them, but it must be recognised that we are overwhelmed. Some will get through - some already have.'\nRecent arrests of jihadists returning from Syria and Iraq have added to concerns, he said.\n'The profiles are changing. We are seeing ultra-radical guys return, very battle-hardened, who should have stayed over there.\nPlanning attacks: The official added that ISIS is recruiting and training Europeans 'with the goal of sending them back to hit their countries of origin'\nThe November 13 attacks, in which 130 people were killed, and 352 were injured by ISIS jihadists, could be the start of a calculated campaign, the official warns\nMore to come: French police are seen in the north of Paris on January 7, after police shot a man dead as he was trying to enter a police station on the anniversary of Charlie Hebdo\n'Before we mostly had guys returning who had made a mistake, who didn't realise that war can be painful. But now, we are seeing guys return who are sticking to their chosen path.'\nFaced with an enemy that is happy to die and maximise civilian casualties, the challenge for France's security forces is to massively speed up response times.\n'There will always be a delay for intervention forces that we have to reduce as much as possible,' Colonel Hubert Bonneau, head of the elite GIGN police, said.\n'In the Bataclan, the killing of 90 people took 20 minutes. It stops when there is the opposition of security forces,' he said, referring to the attack on a Paris concert hall on November 13.\nIt took two-and-a-half hours for police to storm the concert hall as they tried to gather information on the layout of the building and position of the jihadists.\nBonneau said this new type of threat meant there were no classic hostage situations such as in the past.\n'Hostages are just a buffer to slow the progress of security forces. If we don't intervene as quickly as possible there will be more victims. That's the lesson to draw from the attacks of November 13, that will change our mode of intervention.\n'We need to have surgical action, as forceful as possible and as quickly as possible,' he said.\nMultiple, pan-European plots are not new and have been disrupted on several occasions, including one in late August 2010, said Yves Trotignon, a former analyst for France's DGSE intelligence service.\nJean-Baptiste Redde aka Voltuan holds-up a banner that reads, 'We must remember' following a remembrance rally in Paris on Sunday to mark the anniversary of the attacks on the Charlie Hebdo newspaper and a Jewish supermarket in January 7-9 last year, where 17 people were killed\n'At that time, it was still Al-Qaeda,' he said.\n'The teams were due to arrive in western Europe, recover pre-placed material - handguns and assault rifles. It was disrupted by the Americans, who carried out a series of preventative drone strikes in Afghanistan and Pakistan against the guys thought to be mounting the operation.\n'This type of multiple attack is part of the worst-case scenarios for 2016,' said Trotignon.\n'I know that in European capitals, particularly London, specialised services are working on this theory.'\nPolice, military and intelligence services are constantly adapting to the shape-shifting threat, but so are the other side and often more quickly and effectively, the specialists said.\n'It's not just us that learn the lessons, it's the Islamic State as well,' said the counter-terrorism official.\nHe said a key lesson was to stay away from telephones, which have often been a key way to monitor potential attackers.\n'They take lessons from the press investigations, read everything on the subject. They saw that it took two-and-a-half hours to launch the police raid at the Bataclan,' said Trotignon.\nThey also saw that 'the explosives weren't good, that they must be changed, that the guys left too many traces. They learn fast.'\n'If the quality of the attackers improves, we will have a problem,' he said, adding that there was a 'terrible pessimism' among security service professionals for 2016.","url":"https://www.dailymail.co.uk/news/article-3393669/We-heading-European-9-11-Counter-terrorism-official-says-terror-groups-plotting-simultaneous-attacks-various-countries-year.html"}
