{"authors":[],"date_download":"2018-10-22 22:31:38","date_modify":"2018-10-22 22:31:38","date_publish":"2014-05-11 13:02:56","description":"As they stood in line to vote, people in eastern Ukraine said the United States had a double standard in the way it treats the region.","filename":"data/vaneerConsumption/WeAreNotTerroristsUkrainianVotersSpeakOut.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/434736/140511-ukraine-khartsyzk-vote-russia-920a_cde8765fec99dcab4acc31c85fb9e882.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_we-are-not-terrorists-ukrainian-voters-speak-out-n102471_1540247498.html","title":"'We Are Not Terrorists': Ukrainian Voters Speak Out","title_page":"'We Are Not Terrorists': Ukrainian Voters Speak Out","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPeople in the eastern Ukrainian city of Mariupol said the United States had double standards in the way it treated the region as they stood in line to vote Sunday on whether to declare greater autonomy.\n\"Look at us,\" a voter who said her name was Irina told NBC News. \"We are all Ukrainians, and we are here to vote. We are not terrorists.\"\nRegions of eastern Ukraine engulfed by a pro-Russian insurgency were voting whether to split from the rest of the country as the government in Kiev warned that choosing self-rule would spell destruction.\nUkraine's interim leader, Oleksander Turchinov, has said he would not negotiate with \"terrorists,\" a formulation meant to exclude most of the more prominent rebel leaders in the restive eastern region.\nThe United States, meanwhile, has called the move \"illegal\" and \"an attempt to create further division and disorder.\"\nReuters contributed to this report.","url":"https://www.nbcnews.com/storyline/ukraine-crisis/we-are-not-terrorists-ukrainian-voters-speak-out-n102471"}
