{"authors":[],"date_download":"2018-10-22 22:34:30","date_modify":"2018-10-22 22:34:30","date_publish":"2014-05-11 08:45:01","description":"Ballots seek approval to declare sovereign the so-called people's republics in the Donetsk and Luhansk.","filename":"data/vaneerConsumption/WeAreRussiaRestiveEasternUkraineVotesonWhethertoSplitfromCountry.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/434556/140511-ukraine-vote-0628_0decd61fb95b34f913f62441d2a0ae92.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_we-are-russia-restive-eastern-ukraine-votes-whether-split-country-n102411_1540247670.html","title":"'We Are Russia': Restive Eastern Ukraine Votes on Whether to Split from Country","title_page":"'We Are Russia': Restive Eastern Ukraine Votes on Whether to Split from Country","title_rss":"NULL","source_domain":"nbcnews.com","text":"In Donetsk, engineer Natalia Vladimirovna voted for greater autonomy and dismissed Kiev's admonishments after casting her ballot.\n\"I voted against the Nazis in Kiev, which are supported by the U.S. and Europe. I voted for an independent Donbass,\" said the 63-year-old, referring to a largely pro-independence region in eastern Ukraine.\nThe ballots seek approval to declare sovereign the so-called people's republics in the Donetsk and Luhansk regions, where armed pro-Russia insurgents have taken control of government buildings and clashed with Ukrainian troops.\n\"We are Russian. Of course we hope to be united with Russia,\" declared another early morning voter, 55-year-old businesswoman Galina.\nThe government in Kiev, which came to power after the ouster of pro-Moscow President Viktor Yanukovich in February, condemned the vote.\nOn Saturday, acting president Oleksander Turchinov said secession from Ukraine \"would be a step into the abyss for these regions ... Those who stand for self-rule do not understand that it would mean complete destruction of the economy, social programs and life in general for the majority of the population.\"\nThe United States, meanwhile, has called the move \"illegal\" and \"an attempt to create further division and disorder.\"\n\"If these referenda go forward, they will violate international law and the territorial integrity of Ukraine. The United States will not recognize the results of these illegal referenda,\" State Department spokeswoman Jen Psaki said in a statement.\nRebels, who claim successive corrupt and inept leaders have run down the region, have seized government buildings with very little resistance from Kiev. In recent days, however, Ukrainian forces have been striking back, especially in the industrial and shipping center of Mariupol.\nIn the city of Slovyansk, which has seen violent fighting between pro-Russian militants and government forces, exchanged fire with Ukrainian troops on the outskirts of the city overnight.\nRussia denies Western and Ukrainian accusations it has fostered the rebellion, and portrays the Kiev government as hostage to violent anti-Russian nationalists.\n- Reuters, The Associated Press and Becky Bratu in New York City contributed to this report.","url":"https://www.nbcnews.com/storyline/ukraine-crisis/we-are-russia-restive-eastern-ukraine-votes-whether-split-country-n102411"}
