{"authors":["Michelle Toglia"],"date_download":"2018-10-31 01:48:09","date_modify":"2018-10-31 01:48:09","date_publish":"2018-09-11 14:00:56","description":"For the fourth year in a row, sexually transmitted infections (STIs) are at an all-time high in America, according to the Centers for Disease Control and Prevention (CDC). While STIs are nothing to be ashamed of, are manageable if not treatable, and…","filename":"data/vaneerConsumption/WeAsked226WomenToTellUsTheBiggestStigmaThatStillExistsAroundWomensSexualHealth.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/7/6c657d1c-8217-47c7-b768-933711a0f73f-zaeh_bustle_apr2016-618.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_we-asked-226-women-to-tell-us-the-biggest-stigma-that-still-exists-around-womens-sexual-health-11832119_1540950489.html","title":"We Asked 226 Women To Tell Us The Biggest Stigma That Still Exists Around Women's Sexual Health","title_page":"We Asked 226 Women To Tell Us The Biggest Stigma That Still Exists Around Women's Sexual Health","title_rss":"NULL","source_domain":"bustle.com","text":"For the fourth year in a row, sexually transmitted infections (STIs) are at an all-time high in America, according to the Centers for Disease Control and Prevention (CDC). While STIs are nothing to be ashamed of, are manageable if not treatable, and extremely common — one in two sexually active people under the age of 25 will contract an STI — this surge shouldn't be all that surprising.\nWith only 13 states in the U.S. requiring \"medically accurate\" sex ed (and even the ones that do aren't necessarily offering comprehensive programs), the system is failing students early on. When it comes to our doctors, physicians only spend an average of 36 seconds talking about sexual health during checkups, and research shows that oftentimes STI shame prevents people from getting tested. And, with a sex-negative culture continually telling us that women who enjoy sex are \"sluts\" and getting an STI means you're reckless and \"dirty,\" it's really no wonder the number of STI cases aren't slowing down any time soon. The stigma surrounding STIs is alive and well, and it's preventing us from talking about — and prioritizing — our sexual health. And new data shows the silence around our sexual health is causing an imbalance in our relationships, too.\nIn a recent Bustle Trends Group survey of 226 women ages 18 to 34 of different sexual orientations, 54 percent of women say they're \"extremely likely\" to discuss STIs with a new partner, and 21 percent say they wait until they become exclusive with a partner to talk about STIs. But when it comes to long-term relationships, 75 percent of women say they're \"extremely likely\" to discuss it with a partner, which means far too many of us aren't having this important conversation exactly when we need to be — when we're first sleeping with someone new.\nAnd when it comes to STI and pregnancy prevention, the majority of women (57 percent) also feel like they're the one who's more involved — and most (54 percent) wish their partner would do more to help share the responsibility. Only 39 percent of women said their partner was equally involved in STI and/or pregnancy prevention. Considering how many more women than men visit the doctor and get tested for STIs each year, this frustrating reality may come as no surprise.\nAs one survey participant put it, \"[The biggest stigma surrounding sexual health is] that the responsibility of a sexual relationship falls on the woman.\" One said, \"Women still seem to carry the responsibility for STI and pregnancy prevention.\" Another said, \"[I]t's always the woman's responsibility to be on birth control, yet men want control of everything else women do with their bodies.\"\nBut hardly anyone we surveyed felt like they shouldn't be as involved in these discussions as their sexual partners. When it came to birth control, only one percent said they felt like it was their partner's responsibility.\nClearly, there's still deep-rooted embarrassment, discomfort, and inequality surrounding this incredibly important issue. That's why Bustle is bringing you Unashamed, a package that looks at the stigma surrounding women and sexual health, to help you learn more about what STIs really are — and aren't — and how to talk about them.\nTo get the conversation going, we asked survey participants to tell us the biggest stigma that still exists surrounding how we talk about women’s sexual health. In their own words, here's what they said.\nThere's Still So Much Slut-Shaming\nAshley Batz/Bustle\n\"Having a lot of sex or sexual partners is still considered 'slutty,' so people are less likely to talk about the risks, because the blame falls on the women for being too sexually active.\"\n\"Women are shamed about having sex because if they have sex, they’re sluts and if they don’t, they’re prudes.\"\n\"That women being sexual at all means we are 'slutty,' even if it’s just basic health care.\"\n\"Women are still seen as sluts if they have multiple sexual partners, where men are seen as heroes.\"\n\"Women are still 'hoes' or 'sluts' while men are just being.....'men.'\"\n\"Women are not allowed to have sex without being labeled promiscuous, and restrictions on our birth control and its availability reflect that mindset.\"\n\"Slut shaming. Not enough emphasis on health and too much focus on a woman choosing to have sex with whomever she wants as a 'bad thing.'\"\nPeriods Are Still Considered Taboo\nAndrew Zaeh for Bustle\n\"Even in 2018, I still feel like my partner perceives my period as 'dirty,' and he doesn't seem that interested in understanding my approach to tracking my cycle — he doesn't even want to hear it.\"\n\"Period sex.\"\n\"Periods are still not discussed openly.\"\n\"People are still creeped out by periods. It blows my mind.\"\n\"Why should we have to pay extra tax on toiletries we need to function as women?\"\n\"No one likes talking about periods.\"\n\"Periods in general and the misinformation out there, especially for men.\"\nWe Don't Talk About Women As Sexual Beings\nAndrew Zaeh for Bustle\n\"The fact that women are sexual still blows people’s minds, which hurts our ability to feel comfortable asking necessary questions.\"\n\"That [women's sexual health] is not as important as men’s sexual health.\"\n\"I think society is still uncomfortable with women (particularly young women) having sex with whom they like. I feel women aren't trusted to make responsible decisions about their bodies.\"\n\"Women are still shamed for having sex or too much sex while men often get praised for their sexual encounters. That keeps women silent and isolated.\"\n\"That women have sex! For fun! Like men!\"\n\"That women are somehow less clean for having sex (which makes it harder for them to come forward in the early stages of STIs). Not to MENTION the messy feelings around pregnancy/miscarriages/abortion.\"\n\"Women are still stigmatized for anything sexual while men are praised.\"\nSociety Thinks Women Shouldn't Talk About Their Sexual Health\nAshley Batz/Bustle\n\"It feels very damned if you do/damned if you don't. If you talk about it there's this perception that you're over-sexual but if you never talk about it you're repressed or irresponsible.\"\n\"It's lame to ruin the mood with convos about sexual health.\"\n\"That talking about STIs or having them makes you loose or having too much sex, and that it's the woman's role to control sexual health in a partnership.\"\n\"I think we still talk about women's sexual health as either a taboo subject, where we don't really discuss it, or as something that is primarily a woman's responsibility, and not a partner's as well. That it is taboo and shouldn't be spoken of in public.\"\n\"I've found you can't talk about your sexual health without judgement. Good or bad, you know you have to be very careful in deciding who to talk to, sometimes even with doctors. It's still very hush hush, as if women's sex lives are delicate secrets.\"\n\"The fact that we're supposed to keep quiet about our health concerns.\"\n\"Women are expected to be less sexual than men, so women's sexual health is considered an 'inappropriate topic' to many.\"\nThe Stigma Surrounding STIs Is High\nAshley Batz/Bustle\n\"Guys are always SO shocked when I ask them to get tested if they've never been. I don't ask for their number! I get tested every year, but they make me feel guilty for asking the same of them.\"\n\"The stigma surrounding STIs and the potential complications. I’ve recently had to be tested for cervical cancer that may have been caused by HPV. But as soon as HPV is brought up that’s it.\"\n\"That we’re dirty if we’ve had something and that we’re the 'only' one. Not realizing how many people have been through something similar. We need to support each other, not put each other down.\"\n\"Viewing the person as dirty/gross if they have/had an STI.\"\n\"It's hard to admit to having had an STI, there's so many gross assumptions about promiscuity and uncleanliness and whatever.\"\n\"I think women are seen as dirty if they end up with STIs and guys don’t.\"\n\"If you have or have had an STI, it means you sleep around a lot.\"\nThe Way We Talk About Sex & Sexual Health Is Not Inclusive\nAndrew Zaeh for Bustle\n\"I think sexual health conversations are very heteronormative and don’t take queer couples and/or trans partners into account.\"\n\"So many conversations (either with doctors and in the media) about women's health are centered on pregnancy. But these conversations always exclude women with infertility.\"\n\"Wearing condoms! Women think it's a man's responsibility — but that's so heteronormative.\"\n\"We are expected to take care of [our] own sexual health, and the sexual health of men...which doesn't even translate to queer women, trans and NB women, who apparently don't have sex at all.\"\n\"Fat sex health. A lot of birth control doesn't work if you're obese/overweight.\"\nThe Conversation Around Birth Control Is Skewed\nAshley Batz/Bustle\n\"Why are women financially responsible for shouldering the burden of contraceptives?\"\n\"Women are shamed for taking control of their own health and trying to get birth control. A doctor once refused to give me birth control because I wasn’t married to my live-in boyfriend in Nebraska.\"\n\"Birth control (in my experiences) is heavily considered a woman's responsibility.\"\n\"Birth control is seen as a woman's responsibility — if she gets pregnant, it's always solely her fault.\"\n\"That birth control is mostly a woman's responsibility, but at the same time a woman is considered promiscuous for trying to access it.\"\n\"Women are still expected to be in charge of birth control, but also bear the stigma of men's belief women might try to 'trap' them into pregnancy, even if they don't want to take responsibility for themselves.\"\n\"It’s always her fault if she gets pregnant.\"\nLiterally Everything That Has To Do With Sexual Health Feels Stigmatized\nAndrew Zaeh for Bustle\n\"OMG all of it. There is stigma around having sex before marriage, having an orgasm, women asking for protection, masturbation, women enjoying porn, being a slut or being a prude, etc.\"\n\"Why are men in Congress making decisions about what I can and can't do with my body? I can't understand it.\"\n\"The fact that it's still regulated so heavily, little advancements or breakthroughs in this era have been made, and that women still shoulder most of the blame and fault when it takes two to have sex.\"\n\"In some circles sex itself is still seen as a taboo, so getting into the health aspects is a far reach.\"\n\"Masturbation, women enjoying sex, taking birth control to prevent childbirth, abortion, if doctors/health care facilities are safe for women, periods, pregnancy, childbirth.\"\n\"Everything. Women and sex are avoided like the plague.\"\n\"The entire concept of talking about women's sexual health still feels taboo.\"\nIf you're more likely to turn to the internet to find the answer to a sexual health question instead of asking a doctor, friend, or family member (and 65 percent of women in Bustle's survey are), now you clearly know why. Women's sexual health is stigmatized, ignored, and heavily silenced. And now's the perfect time to start talking about it.","url":"https://www.bustle.com/p/we-asked-226-women-to-tell-us-the-biggest-stigma-that-still-exists-around-womens-sexual-health-11832119"}
