{"authors":["Pam Key"],"date_download":"2018-10-30 20:22:03","date_modify":"2018-10-30 20:22:03","date_publish":"2015-10-14 02:17:51","description":"Webb: Obama 's Iran Nuke Deal Put U.S. in 'Position of Weakness, Encouraged Russia'","filename":"data/vaneerConsumption/WebbObamasIranNukeDealPutUSinPositionofWeaknessEncouragedRussia.json","image_url":"https://media.breitbart.com/media/2015/10/webb.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_13__1540930923.html","title":"Webb: Obama 's Iran Nuke Deal Put U.S. in 'Position of Weakness, Encouraged Russia'","title_page":"Webb: Obama 's Iran Nuke Deal Put U.S. in 'Position of Weakness, Encouraged Russia' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tuesday on CNN’s Democratic presidential primary debate former Secretary of the Navy and former Sen. Jim Webb (D-VA) criticized President Barack Obama’s nuclear deal with Iran saying it “acquiescing in Iran” and puts the Untied States in a “position of weakness” which is “why Russia is in Syria right now.”\nIn the clip above, Webb said, “Let’s start with why Russia is in Syria right now. There are three strategic failings that have allowed this to occur. The first was the invasion of Iraq which destabilized ethnic elements in Iraq and empowered Iran, which created huge vacuums. The second was the Arab Spring Libya and in Syria that allowed terrorist movements to move in there. And the third was the recent deal allowing Iran to move forward and eventually acquire a nuclear weapon which sent bad signals, bad body language about whether we’re acquiescing in Iran, becoming a strong piece of the formula in that world.”\nIn the clip below, after receiving blow back from his rival Lincoln Chafee for claiming Russia recent airstrikes in Syria were encouraged by the president’s nuclear deal with Iran, Webb said, “I believe that the signal that we sent to the region when the Iran nuclear deal was concluded was that we are accepting Iran’s greater position in this very important balance of power among our greatest ally, Israel and the Sunnis represented by the Saudi Regime and Iran. It was a position of weakness and I think it encouraged the acts that we’ve seen in the past several weeks.”\nWatch:\nFollow Pam Key on Twitter @pamkeyNEN","url":"https://www.breitbart.com/politics/2015/10/13/webb-obama-s-iran-nuke-deal-put-u-s-in-position-of-weakness-encouraged-russia/"}
