{"authors":[],"date_download":"2018-10-30 20:54:32","date_modify":"2018-10-30 20:54:32","date_publish":"2018-07-09 15:16:00","description":"A wedding guest was shot early Sunday while waiting for an Uber outside a Brookhaven country club.","filename":"data/vaneerConsumption/WeddingguestshotwhilewaitingforUberoutsidecountryclub.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/09/Videos/4434154.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_wedding-gue_703ecf40bc1bbeb4a2d6e169f57a9b69__1540932872.html","title":"Wedding guest shot while waiting for Uber outside country club","title_page":"Police: Wedding guest shot while waiting for Uber outside country club","title_rss":"NULL","source_domain":"ajc.com","text":"A wedding guest was shot early Sunday while waiting for an Uber outside a Brookhaven country club.\nThe man was standing with a group of other guests about 12:15 a.m., waiting for the car service outside the Capital City Country Club, when they approached who they thought was their driver.\nInstead, a passenger exited from the vehicle and demanded their belongings at gunpoint, according to a police report.\nThe group of four turned over their valuables, but police said one man was shot in the stomach when he tried to follow the robber and negotiate with him.\nThe victim was identified by police as Christian Broder, 34, of Washington, D.C.\nA neighbor driving by the intersection of West Brookhaven Drive and Capital City Lane called 911.\nPolice said the man is in critical condition.\n“We heard the gunshot off to our left,” Jaime Griffon told Channel 2 Action News. “And we looked over and it was kind of like this quick pause and people started screaming, ‘Call 911! Someone has been shot!’”\nShe said emergency dispatch walked her through ways to help the man while they waited for medics, and she relayed the information to his friends.\n“Having a cellphone was critical for that moment,\" Griffon said.\nBroder was taken to Piedmont Hospital for treatment. He was in intensive care Monday morning.\nAtlanta police are now searching for the shooter. Victims told officers he was a young man wearing jeans and a gray hooded sweatshirt and drove away in a white Dodge Charger.\n“Investigators are following up on all leads,” Atlanta police spokesman Officer Jarius Daugherty said in a statement.","url":"https://www.ajc.com/news/crime--law/wedding-guest-shot-while-waiting-for-uber-outside-country-club-police-say/LBRiUPxw4vlxKompemQu5L/"}
