{"authors":[],"date_download":"2018-10-30 17:59:42","date_modify":"2018-10-30 17:59:42","date_publish":"2016-03-07 22:22:35","description":"The House and Senate are in recess Wednesday, but committee work continues.Events8 a.m-9 a.m. Veterans for Cannabis Pill Bottle Demonstration – Capitol south wing10 a.","filename":"data/vaneerConsumption/WednesdayattheLegislaturecommitteescommitteescommittees.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_wednesday-the-legislat_79b5ae93f5ac4bdae34d01692d5c3db3__1540922382.html","title":"Wednesday at the Legislature - committees, committees, committees","title_page":"Wednesday at the Legislature — committees, committees, committees","title_rss":"NULL","source_domain":"ajc.com","text":"The House and Senate are in recess Wednesday, but committee work continues.\nEvents\n8 a.m-9 a.m. Veterans for Cannabis Pill Bottle Demonstration – Capitol south wing\n10 a.m.-2 p.m. South Fulton Day, Women in White Women History Month – Capitol south wing\n1 p.m.-5 p.m. White Dress Project, Georgia General Assembly – Capitol Rotunda\nToday’s House committee meetings\n8 a.m. Insurance Committee, Room 606 CLOB — SB 137, dealing with property insurance and the value of property covered against loss by fire; SB 158, known as the “Consumer and Provider Protection Act”; SB 290, clarifying who is not required to be licenses as an insurance agent; SB 302, requiring health insurance carriers to maintain accurate provider directories; SB 347, changing the “Georgia Captive Insurance Company Act”\n9:30 a.m. Judiciary (Non-Civil) Committee, Room 406 CLOB — SB 77 dealing with analysis and collection of DNA; SB 193, change the penalty for family violence battery; SB 278, increase the penalties for pimping and pandering; SB 367, providing comprehensive reform at the Georgia Council Justice Reform (hearing only)\n10 a.m. State Properties Committee, Room 506 CLOB — HR 1563, dedicating the woodshop building on the grounds of Ware State Prison to Kenny Boyett; SR 954, dealing with easements in 16 counties; SR 955, dealing with state-owned properties in eight counties; SB 327, dealing with contracts and a prohibition on using contractors boycotting Israel (hearing only)\n10 a.m. Professional Boards-Commissions Subcommittee, Room 515 CLOB — SB 319, revising the definition of professional counseling; and SB 402, providing for a moratorium on the issuance of new licenses to narcotic treatment programs\n1 p.m. Judiciary Committee (Civil), Fleming Subcommittee Room 515 CLOB — SB 345, dealing with property rights of religious organizations\n1 p.m. Governmental Affairs Committee, Room 406 CLOB\n2 p.m. Small Business Committee, Room 406 CLOB\n2 p.m. Retirement Committee, Room 515 CLOB — SB 335, dealing with permissible investments under the Public Retirement Systems Investment Authority Law; and SB 336, allowing governments in the Georgia Municipal Employee Benefits System to have a plan or join a master plan\n2 p.m. Education Committee, Room 606 CLOB — SB 364, addressing annual teacher, principal and assistant principal evaluations\n3 p.m. Special Rules Committee, Room 515 CLOB — HR 1366 creating a House study committee on a Georgia Abuser Registry; and HR 1345, creating a House study committee on Georgia craft brewery and distillery competitiveness\nSenate committee meetings\n9 a.m. Health & Human Services Committee Room 450 Capitol\n9:30 a.m. Finance Committee, Subcommittee A, Room 125 Capitol\n10:30 a.m. Finance Committee, Subcommittee B, Mezzanine 1 — HB 922, dealing with income tax credits; HB 935, adding certain fulfillment centers to properties eligible for a free-port exemption\n11 a.m. Special Judiciary Committee, Room 125 Capitol — HB 804, creating a fifth judgeship in the superior courts of the Clayton Judicial Circuit; HB 486, dealing with the practice of professional forestry and disclosure of AIDS confidential information; HB 851, dealing with annual audits of financial affairs, books, and records of boards of trustees of county law libraries; HB 1073, dealing with the juvenile code\n11 a.m. Insurance & Labor Committee, 450 Capitol — HB 193, the Life Insurance Consumer Disclosure Model Act; HB 943 dealing with contracts for engineering or architectural work; HB 903 dealing with prevention of fraud and abuse of the Unemployment Trust Fund; HB 904 dealing with labor and industrial relations; HB 784, dealing with advertising and promotional items not exceeding $100; HB 402, encouraging employers to provide work based learning opportunities for students age 16 and older; HB 965, “The Honorable Jimmy Carter Cancer Treatment Access Act”; SR 1091, creating Senate study committee on hearing aids for children; HB 866, exempting from premium taxes multiple employer self-insured health plans; HB 882, dealing with investment of capitol funds; HB 884, relating to health organization with certain total adjusted capital levels\n1 p.m. Public Safety Committee, Room 310 CLOB\n1 p.m. Higher Education Committee, Room 307 CLOB\n3 p.m. Finance Committee, Mezzanine 1","url":"https://www.ajc.com/news/wednesday-the-legislature-committees-committees-committees/gOoKETFFbOHNHeN8cDJQ8I/"}
