{"authors":["Ann Powers"],"date_download":"2018-10-23 01:57:59","date_modify":"2018-10-23 01:57:59","date_publish":"2016-05-02 00:00:00","description":"The music of the singer Anohni, who was previously known as Antony Hegarty, has long explored identity. On her new album Hopelessness, she turns self-examination into explicit, unsparing activism.","filename":"data/vaneerConsumption/WeDontHaveAnythingToLoseALexiconOfAnohnisHopelessness.json","image_url":"https://media.npr.org/assets/img/2016/05/02/anohni2_wide-0290765b6d46b7ff694a924782a4a60331a0b164.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_therecord_2016_05_02_476403721_we-dont-have-anything-to-lose-a-lexicon-of-anohnis-hopelessness_1540259879.html","title":"'We Don't Have Anything To Lose': A Lexicon Of Anohni's 'Hopelessness'","title_page":"'We Don't Have Anything To Lose': A Lexicon Of Anohni's 'Hopelessness' : The Record : NPR","title_rss":"NULL","source_domain":"npr.org","text":"'We Don't Have Anything To Lose': A Lexicon Of Anohni's 'Hopelessness'\nEnlarge this image toggle caption Alice O'Malley/Courtesy of the artist Alice O'Malley/Courtesy of the artist\nWhen writers try to describe the music of the metamorphic torch singer Anohni, they reach for words like \"liminal\" and \"ethereal,\" recognizing that its effect is enchanting, opening up new worlds of identity and consciousness. In The New Yorker, Hua Hsu recently compared her voice to Boy George, Nina Simone and \"what I imagine a radiant, healing crystal sounds like\" — which, setting aside the phrase's whiff of anti-New Age snobbery, is actually quite accurate. Yet in the 16 years she's publicly explored how her epicene expressionism might draw people into the shifting borderlands of the self, Anohni has used her power to transport to create alternate routes into today's harsh realities. She has embraced the challenging role of the political artist with growing force and explicitness, culminating in her new album Hopelessness, a frankly radical denunciation of what Anohni views as the apocalyptic effects of America's policies both at home and abroad.\ntoggle caption Courtesy of the artist\nAs a transgender woman (her eight previous albums were released under her birth name, Antony Hegarty, with the chamber-pop group the Johnsons) Anohni initially gained attention as a particularly graceful exemplar of 21st-century genderqueer liberation. Intimate erotic yearning defined her early career; as she has evolved, she has cast her personal stories within the larger context of marginalized others and the squandered earth itself. On her recordings and in performances grounded in the legacies of radical feminism, Anohni has posed a provocation to her audience: Allow beauty to transport you while remaining aware of the often ugly, humanly generated circumstances from which it defiantly springs. Hopelessness goes further, to tear down the fiction that a separate sphere can exist where beauty triumphs over the evil evident in developments like the growing international refugee crisis, increasingly dramatic shifts in climate, or the emergence of drone strikes as a key element of military policy. As an American citizen, the British-born, California-raised Anohni could no longer pretend that she exists in an art bubble. \"A big part of [the abum] is an examination of my own complicity and my own inability to truly extricate myself from the brokenness of the system that I'm a part of,\" she recently said in a phone conversation from her home in New York. \"It's that chasm, that denial that I wanted to model, an inquiry into and within myself.\"\nThis kind of self-criticism is a core step within the development of the political artist. It's a stance against the passivity of despair, representing the decision to continue to witness and attempt to change, \"as opposed to just pinning a manifesto to my lapel and throwing myself off the building.\" And it's disruptive. To enact it, Anohni has departed the comfort of the seated theater for the sweatier space of the dance club. Working with the producers Daniel Lopatin and Ross Birchard, respectively known as Oneohtrix Point Never and Hudson Mohawke, she's made intelligent dance music her vehicle for oracular activism.\nHeralded by the monumental, devastating singles \"4 Degrees\" (about the earth boiling as the icecaps melt) and \"Drone Bomb Me\" (sung in the voice of a young girl longing for death after her family is killed in a strike), Hopelessness directly confronts the forces Anohni recognizes as doom-bringers: the military-industrial complex, the wealthy and President Obama, who is addressed by name in a Delphic condemnation that comes mid-album. The subject matter on Hopelessness can be grisly — state-sponsored execution, torture, animals expiring in trees — but the music, and Anohni's singing especially, brings the emotional rush of revelation. Like the protest music she cherishes, from Nina Simone's \"Mississippi Goddam\" to the post-Stonewall club hits of artists like Soft Cell and Bronski Beat, Hopelessness explores what Anohni calls \"dancing from the seat of anger and despair.\"\nYouTube\n2016 is turning out to be a glorious year for agitation within popular music. Yet political art — and Hopelessness is rigorously committed to that realm — asks its audience to be familiar with cultural sources and symbolic tools, with a vocabulary that engages with the world and culls from the work of those who have preceded them in the streets, in the pages of scholarship and throughout the history of radically engaged cultural expression, adding their own reference points, expanding and refining it.\nHopelessness, a pop album that is simultaneously an act of dissent, offers one way to explore such a vocabulary. Since the release of \"4 Degrees\" last fall, Anohni has made her frames of reference obvious. Through the music itself and in interviews, she is pointedly and relentlessly repeating herself. This is an activist's strategy as much as an artist's. The ideas and images Anohni continually invokes combine to create a guide to the songs and her performances, grounded in feminism, queer theory, ancient mythologies, an engagement with pop-inspired protest movements of the recent past and a contemporary understanding of late-capitalist class structures. Agree with Anohni's views or don't — Hopelessness is a deeper experience if you know the conceptual building blocks upon which it rests. What follows is a lexicon of Anohni's apocalyptic vision, from its alphabetical beginning to its pop-musical end.\nANNIHILATION\nAnohni has frequently spoken of wishing to \"annihilate\" her body within this project. \"I've always been somewhat uncomfortable on the stage and I've always felt like physically having to negotiate my own presence as a part of presenting work has always been a source of angst for me,\" she says. Dance music, which has often featured voices manipulated within an electronically generated sonic energy field, offered the chance to disappear within a mix the way working with the acoustic Johnsons did not. That said, Anohni assures, \"My voice would remain. It wasn't so much that I personally would be annihilated.\" The symbolic obliteration of her body also shifts the audience's attention away from Anohni as an individual and creates a wider field of empathy for the characters she means to represent.\nANOHNI\nHer name shift seems to support the evidence that Hopelessness comes at a juncture in Anohni's career, but it is partially coincidental; she has never identified as a man, she says, and has used this fluid \"spirit name\" for a while among friends. But the music's grounding in a transgender world view that rejects binary male-female definitions while insisting upon a profound link with nature is central. \"I think the last 50 years of investigation, even just in the research of transgender people in the West experimenting with biology physically, is a revelation of the obvious and direct correlation and intersection between biology and gender expression or biology and identity,\" Anohni says. \"Of course there's a biological foundation for so many aspects of our being ... it's the mind that thinks it's beyond nature, that has this sort of omniscient view over the land.\" Anohni's own life in a body that defies limits others would impose is one source of her empathy with others whose bodies have suffered from the violence of war or the confinement of the prison system in songs like \"Drone Bomb Me\" and \"Execution.\"\nBEATS\nThe \"hard beats\" Hudson Mohawke has built for artists like Kanye West, and the arching soundscapes of Oneohtrix Point Never, gave Anohni a chance to sing harder and with more abandon than she has in the past. \"It is a relief to sing to a synchronized beat, it sent me free in a way, not having to negotiate that aspect of the feel of a song, so you can be like a dolphin jumping in the waves,\" she explains. \"This project was all about Anohni soaring over the music,\" Lopatin adds in an email. Hopelessness is not exactly a club album — several songs are more contemplative or experimental, demanding a quiet listen — but the presence of beats sets its activist mood.\nBODIES\nThe body, someone on Twitter recently quipped, is the new \"other.\" Theorists once used the term \"other\" to refer to people whose full humanity isn't acknowledged by the ruling powers; colonized subjects, for example, or refugees. Saying \"bodies\" instead makes the presence of these outsiders more immediate while keeping the focus on their oppression. Anohni's fierce focus on bodies brings these figures on the edge to the center. Nearly every track on Hopelessness turns on visceral imagery: human heads blown off, sea creatures strangled by plastic bags, the earth itself a chemotherapy patient, sickened by injections. She also imaginatively inhabits the bodies of conflict's victims, and some have criticized her for appropriating these experiences. She believes that her gestures feed true connection. \"There are other lines and bridges of connectivity, more spectral ways that we connect and pour through each other,\" she says. \"Not to disregard or underestimate my privilege as a white person in the world ... yet the feeling persists in me that this is bigger than any one of us.\"\nCHELSEA MANNING\nThe former U.S. soldier now imprisoned for violating the Espionage Act in 2013, after leaking classified material via WikiLeaks, was foremost in Anohni's mind when she recorded her dirge against the sitting president, \"Obama.\" In several interviews, she has said that Manning's conviction strongly contributed to her disillusionment with a president whom she once supported, in part, because he seemed to advocate greater transparency in government. Anohni views Manning as a figure of great moral courage who has been reduced to powerlessness. She also feels connected to the former Bradley Manning as a trans woman. \"I have more in common with another transgender person in Iran than I did with a white American solider,\" Anohni says. Manning, soldier turned protester, is a kindred spirit at home.\nCOMPLICITY\nThe brutal imagery of Hopelessness is put forth as a kind of penance. By immersing herself in depictions of the violent fallout of war and environmental waste, Anohni hoped to face her own part in their unfolding. \"The idea was to model an examination of my own complicity,\" she says, engaging in a form of self-criticism fundamental to radical awakening. \"And honestly not to indulge guilt and shame and hopelessness, but to start to confront that chasm of denial that is preventing me from being able to change my trajectory.\" On songs like \"Crisis,\" she is the one filling mass graves and subjecting Guantanamo detainees to torture. As an American taxpayer, Anohni notes, \"It is me who pays for those drone bombs.\"\nECOCIDE\nEnvironmentalism is a ruling principle for Anohni; \"I can't be separated from nature,\" she says, \"I am one of her faces.\" Discussing Hopelessness, she invokes \"ecocide,\" coined in 2010 by British lawyer Polly Higgins in an attempt to have it added to the U.N.'s list of crimes against peace. This more pointed term underlies jeremiads like \"4 Degrees,\" whose narrator is an American Psycho-style maniac graphically anticipating the suffering of all the goddess's creatures. Anohni's Oscar-nominated song \"Manta Ray,\" not included on Hopelessness, offered a gentler invective; the film it soundtracked is Racing Extinction, a portrait of the left's underground anti-ecocide warriors.\nFEAR\nThroughout Hopelessness, Anohni voices the movement of the psyche through fear into other states: sometimes defiance, sometimes despair. Confronting fear is a common first step in an activist's life, as she abandons the comforts of the familiar. In the past, Anohni says, her music has often traded in home comforts: \"People tend to rely on my voice as a safe place, and I've viewed my voice as something that could help to create more safety,\" she says. \"This was a real departure from that. I was venturing into more complicated and conflicted ways of using the voice.\" Conjuring fear, the songs on Hopelessness suggest that admitting its presence — and that it may be well grounded — may spur action.\nFEMINISM\nIn 2012, Anohni developed the phrase \"future feminism\" to describe two friends and like-minded artists, Johanna Constantine and Kembra Pfahler, whose work struck her as \"frontier, almost feral\" in its establishment of a new vocabulary. Later she formed a collective with them and the sisters Bianca and Sierra Casady to realize the potential of the term. Hopelessness is an outgrowth of Future Feminism — an attempt to recast notions of matriarchy, a world view grounded in the feminine, in ways that fit a time when the essentialism that limited earlier such feminist imaginings has been loosed from its moorings.\nHOPE\nThough the album is called Hopelessness, for Anohni the moment of emerging from its silence, which this music represents, is hopeful. \"Increasingly, as we get older, I feel like we don't have anything to lose anymore,\" she told me. This sense, however, does not lead her to despair. \" When an animal knows it's going to die — an animal in the jaws of [another] animal, it stops crying out. It's succumbs. And so me, hopelessness was a feeling — not a physical reality, except within me or within a person. Like optimism or pessimism that has very little bearing on reality, beyond like a feeling within a person. But it's a feeling that was the starting point of this record.\" The sounds that follow silence can, Hopelessness suggests, break the bonds of the world. In the reaching way she forms her phrases, exploring the most delicate edges of melisma and the areas where one register slides into another, Anohni has developed a vocal style that continually suggests the emergence of something new beneath the notes. The title track of Hopelessness demonstrates how a cry of despair can transform into a call for re-engagement; her mournfulness, the spiritual cry of a motherless child, spins out like a silken thread that becomes a new lifeline. Doubled and tripled in a mix whose rhythms recall South African freedom songs, it deconstructs the process of uplift arising from the ashes of grief.\nINTERCONNECTEDNESS\n\"I don't think that I'm a lone voice. I'm not even interested in being a lone voice,\" Anohni says. Dwelling on the interconnectedness of all beings gives her a sense of community, but also feeds the implication, present throughout Hopelessness, that we are all to blame for the world's mess.\nIn \"Marrow,\" the final song on Hopelessness, Anohni and Lopatin build a bubbly synth roundelay organized around a trilling recitation of place names: Africa, Europe, Brazil, China, Great Britain, more. It's a small world of nations, led by America, destroying their host, the earth: The song's other verses cast the planet as a woman whose bones are being sucked dry. \"What I wanted to try to do with this record was at least draw a circle around a whole system of issues that are codependent and that exacerbate one another, and amplify each other, and climax in ecocide,\" Anohni says. But she also sees the opposition to such destructive forces as more connected than some may think. \"There's a sea of people thinking these thoughts,\" she says. \"All I did was to transfer them into edible pop bites, because people hear music and they experience the context of music in a different way. I wanted to maximize the constructive use of my sphere of influence, which is in music.\"\nKALI\nTo move away from the comfort of her lush earlier music, Anohni called upon a particular divine force: the archetype of the dark mother, known in Hinduism as Kali. \"Kazuo Ono (the Japanese butoh master whose visage graced her album The Crying Light) taught me when he's dancing through the ruins, in Butoh, to aestheticize the unimaginable — the atrocities of World War II. Turn the black light inside each molecule of suffering into a white light, in much the same way that Yoko Ono talks about turning all the hatred she felt she was bombarded with after John Lennon died into love. It's a creative boon — Nina Simone would call it a boon,\" Anohni says of the hostility or tragedy these artists have encountered. She taps into her own sources of it throughout Hopelessness.\nMARTHA WASH\nAnohni's concept of \"annihilating\" her body, of taking the focus away from herself as the music's conduit, she had in mind the great disco and soul singer Martha Wash, who fought for her own image to be used in videos and artworks for many dance hits she performed in the 1980s and 1990s. To Anohni, Wash's erasure from the credits of hits like C+C Music Factory's \"Gonna Make You Sweat\" exemplifies capitalism's hypocrisies, especially about race. \"I wanted to circle that paradigm like a wolf,\" she says. \"In my mind it is one of the fault lines of American and Western pop culture, and as such is a source of tremendous and conflicted power. We reach for and bathe in the expression of women of color, while generally affording women of color the least opportunity in society. [Wash] is institutionally maligned in the day to day, and yet we take refuge in what we project to be her moral authority and her transcendental emotional/spiritual expression.\" Anohni has much more authorial control over her music than Wash did as a vocalist hired by producers. Yet she hopes that her own explorations of vocal disembodiment on Hopelessness contributes to greater acknowledgment of the historical presence, in pop, of women like Wash.\nNAOMI CAMPBELL\nThe supermodel became Anohni's channel in the Nabil-directed video for \"Drone Bomb Me,\" weeping profusely as she performed in the spirit of the song's child victim. As in her performance piece \"Turning,\" which featured thirteen artists — women and transsexuals, all conventionally beautiful — taking turns in the spotlight as Anohni sang. While some might question Anohni's fascination with the feminine ideal, she finds it useful. \"What would be the aspirational body that would best deliver the message of these songs, in the most universal terms, such that they could participate most vigorously in the cultural conversation?\" she says she asked herself. It's a provocative approach, one that forces the viewer to examine other idealized images — including those of war-afflicted children often used in what some have dubbed \"poverty porn.\" In such visual choices, Anohni engages with questions surrounding beauty as a moral force. If a beauty like Campbell's is often cast as frivolous — compared, say, to the poignant image of a starving girl — what happens when the model's face, streaked with tears, seems to transmute into that more acceptably touching image? How and why do we decide which kind of beauty is edifying, and which decadent? The Hudson Mohawke-produced \"Drone Bomb Me,\" a seductively soulful track whose lushness plays startlingly against lyrics about mechanized murder, asks similar questions in sound.\nORACLE\nWhen an interviewer brings up the specter of Cassandra, Greek tragedy's figure of thwarted prophecy, she laughs, saying nearly everyone has invoked that fiery muse. She has problems with that forebear's ultimate defeat. She does agree that Hopelessness mines the oracular.\n\"I've definitely been using the word oracle to describe my theme of trying to create a feminine oracle made up the fabric of many women's faces. That's the idea that we've been developing for the live presentation of the work.\" Anohni finds \"a kind of moral authority\" in the oracular, \"like Nina Simone in \"Mississippi Goddamn\" or Buffy Sainte-Marie on \"Little Wheel Spin and Spin.\" There's always been these kinds of witches who have stepped outside and raised their voices and named an explicit truth with great moral authority. \"\nRAGE\nAnger is an energy embedded within most structures of protest; even nonviolent actions usually incorporate spaces where cathartic reactions against oppression can be voiced. Ahohni focused on the way \"dancing from anger and despair\" became a survival mechanism for gay men in the discos and on the streets during the AIDS crisis of the 1980s and 1990s. \"Rage is a really fun place to dance from,\" she told Brandon Stosuy in Pitchfork. \"Especially if you feel like you're telling the truth.\" The glee in her voice as she intones some of the most vicious details on Hopelessness results from this insight.\nREALITY\nWhen it comes to politics and social change, Anohni is not a relativist. She believes along with William Shakespeare that truth will out when corruption is defeated. \"Reality has been so politicized such that people truly believe, mostly, that there are two versions of reality, a conservative and a liberal version,\" she says. \"In my mind, there's only one version of reality and then those who lie about it. Much as in a court of law.\" This certitude fed Anohni's courage in undertaking an explicitly political, deeply radical and determinedly confrontational project at a time when few popular musicians, even those operating within the mostly progressive environs of the indie or art worlds, dare to do so.\nTROJAN HORSE\nThe classic tale of a weapon disguised as a gift has been one Anohni has continually invoked in describing Hopelessness. And it is that horse: a mighty beast whose wondrousness will draw in those who may find themselves — or at least their comfortable world views — cut down by what emerges from its gut. Her hope is that the delight in the music pushes people, in the best ways, into the battle whose outcome is nothing less than the fate of the world.","url":"https://www.npr.org/sections/therecord/2016/05/02/476403721/we-dont-have-anything-to-lose-a-lexicon-of-anohnis-hopelessness"}
