{"authors":["Michael Cunningham"],"date_download":"2018-10-30 19:16:48","date_modify":"2018-10-30 19:16:48","date_publish":"2018-08-30 20:21:00","description":"Finally, it’s college football Week 1!","filename":"data/vaneerConsumption/WeekendPredictionsAuburnandLSUgodownAlabamarolls.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/31/Videos/4473275.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_mike-check_weekend-pre_afe64bea87923452204d88eb8e23780c__1540927008.html","title":"Weekend Predictions: Auburn and LSU go down, Alabama rolls","title_page":"Weekend Predictions: Auburn and LSU go down, Alabama rolls","title_rss":"NULL","source_domain":"ajc.com","text":"Finally, it’s college football Week 1! Technically, the season started last weekend, which I guess was Week 0? They’d play games in July if they thought they could make money off the sick souls who’d watch, a group that definitely includes me.\nAnyway, in the two FBS games last weekend I liked Colorado State giving 16 points against Hawaii and New Mexico as a four-point underdog vs. Wyoming. I took two ugly loses, but since it was Week 0, they don’t count. My column, my rules.\n» More: Georgia, Clemson to renew rivalry in Atlanta\nThe lesson here is that, while I will be making Weekend Predictions in this space, you should probably not trust them. They are for entertainment purposes only. But you could go against my selections in the AJC college football pick ’em contest and have a pretty good chance of winning.\nThe Colorado State and New Mexico State games highlighted what may be one of my biggest blind spots: watching pretty much any football game that’s on TV. Well there’s that, plus my love for home dogs and advanced metrics. Those biases contributed to my 0-2 start which, again, doesn’t count.\n» Also: How to watch Week 1 college football games\nLuckily there are some interesting games this weekend. Unfortunately, they do not include the local teams. Georgia Tech hosts Alcorn State and Austin Peay visits the Bulldogs in Athens.\nThere are no betting lines for those games, but the metrics favor the Jackets by six touchdowns and the Bulldogs by nearly eight. I favor watching other games.\nGame of the Week\nAuburn (-2) vs. Washington\nThe best college football game in the state (and maybe the country) this weekend features No. 6 Washington against No. 9 Auburn at Mercedes-Benz Stadium. The Tigers jump right into another Schedule of Death, giving coach Gus Malzahn a prime chance to lose right away and get his fans grumbling about that contract extension.\nAuburn’s offense hummed when Malzahn had Nick Marshall at quarterback (third and sixth nationally in efficiency, per Football Outsiders) but not in the three years since (42nd, 31st and 34th). Quarterback Jarrett Stidham had good moments last season, and Malzahn always figures out a run game, but the offensive line will have trouble against Washington’s front.\nThe Tigers should be elite again on defense, but Washington is a big test. Coach Chris Petersen is an offensive wizard, quarterback Jake Browning is great and explosive wide receiver Chico McClatcher has an awesome name. McClatcher also is healthy after two injury-plagued seasons and that makes all the difference for the Huskies, who beat Auburn straight up.\nSEC games of interest\nAlabama (minus-24.5) vs. Louisville\nCue solemn piano music. . . . What if I told you Bobby Petrino would lose 12 games in three seasons with perhaps the best college quarterback ever? Hog Tied: The Bobby Petrino story, on the next “30 for 30.”\nHeisman Trophy winner Lamar Jackson is gone, but defense is the bigger issue for Louisville. The Cardinals were bad on D last season after Petrino replaced coordinator Todd Grantham with Peter Sirmon, whose Mississippi State D was bad in 2016. Petrino replaced Sirmon with Brian VanGorder, whose 2016 Notre Dame defense was so bad he got canned after four games. See where this is headed?\nFull disclosure: I was born a Cardinals fan in Louisville and graduated from the university. Now let me explain why the Cardinals will pull a shocking upset on Saturday in Orlando. Just kidding. Blind, dumb allegiance is not one of my blind spots. The Crimson Tide will cover.\nMiami (minus-3.5) at LSU\nConfession: I love Miami’s Turnover Chain. I can say that now because the Hurricanes faded following a 10-0 start last season. But if they climb near the top of the rankings again this season and resurrect that grating “The U is back!” narrative for the millionth time, then I want that chain melted down and forged into a gold stick I can use to gouge out my eyes.\nThe Hurricanes won’t be quite so good on defense this season, but still good enough to slow LSU’s underwhelming offense. Ed Orgeron replaced coordinator Matt Canada with Steve Ensminger, who looked like a pretty good coach when he had Eric Zeier in Athens but not so much since then. Canes win, but Tigers cover.\nTennessee (plus-9.5) vs. West Virginia\nJeremy Pruitt should make the Volunteers better, assuming his personality doesn’t get in the way. At least Tennessee has a lot of experience with unlikeable coaches. The Mountaineers have a lot of talent, but I don’t trust coach Dana Holgrosen as a big favorite on a neutral field. The Vols cover in a loss.\nOle Miss (plus-2.5) at Texas Tech\nTexas Tech coach Kliff Kingbsury has a name almost as cool as Chico McClatcher. He may also have a decent defense for a change. However, the metrics favor Ole Miss by a touchdown, and I’ve got to take the underdog in that scenario.\nACC games of interest\nVirginia Tech (plus-7) at Florida State\nJimbo Fisher’s 6-6 record in his last season as Seminoles coach wasn’t that bad considering he was forced to start freshman James Blackman at quarterback. New coach Willie Taggart inherits a talented group of offensive players, and the Seminoles should benefit from the wide-open offensive style that worked for Taggart at South Florida.\nVirginia Tech’s offseason was plagued by injuries, transfers, dismissals and academic casualties. That’s too much attrition for the Hokies, who will play enough defense to compete FSU before fading. Take the Noles, give the points.\nNorth Carolina (plus-7) at California\nThe Tar Heels figured to be better in 2018 after injuries contributed to a 3-9 finish last season. Then the NCAA suspended 13 players for selling their team-issued shoes, violating the rule against players making money while everyone makes money off them. UNC will be missing 11 players against Cal but most are backups, so they will still have enough talent to compete. Tar Heels cover.\nWake Forest (minus-6.5) at Tulane\nWake Forest coach Dave Clawson has done a solid job rebuilding the program. The issue this season is that he needs to replace quarterback John Wolford, who was very good as a senior, but likely successor Kendall Hilton is suspended for the first three games. Tulane can score points with QB Jonathan Banks. The Green Wave score enough to cover.\nOther games of interest\nMichigan (pick) at Notre Dame\nEveryone likes to point out that, under coach Jim Harbaugh, Michigan has finished no better than third in the Big Ten East and is 0-3 against Ohio State. They like to do this because Harbaugh is so insufferable. But Harbaugh won’t fall on his face again in a tough road game because ex-Ole Miss QB/five-star prospect Shea Patterson looks to be the real deal. The Wolverines win in South Bend.\nOregon State (plus-38.5) at Ohio State\nThe Buckeyes will be without coach Urban Meyer, who is suspended for the first three games so that Ohio State can pretend to care about domestic violence. Ohio State still will have a roster bursting with talent, while Oregon State will not. But that’s a ton of points to cover with a new QB. The Beavers get in the back door late.","url":"https://www.ajc.com/blog/mike-check/weekend-predictions-auburn-and-lsu-down-alabama-rolls/qMTtaBKyOlPmoZcT9V1N8N/"}
