{"authors":[],"date_download":"2018-10-22 21:26:45","date_modify":"2018-10-22 21:26:45","date_publish":"2014-06-05 13:05:59","description":"The number of Americans filing new claims for unemployment benefits rose last week, but the underlying trend points to a firming labor market.","filename":"data/vaneerConsumption/WeeklyJoblessClaimsRiseButLaborMarketTrendingStronger.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/489271/140605-140605-jobless-0909_40ea1f1da2ae357b8178ccedd759cf99.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/better_careers_weekly-jobless-claims-rise-labor-market-trending-stronger-n123386_1540243605.html","title":"Weekly Jobless Claims Rise, But Labor Market Trending Stronger","title_page":"Weekly Jobless Claims Rise, But Labor Market Trending Stronger","title_rss":"NULL","source_domain":"nbcnews.com","text":"Get the Better newsletter.\nThe number of Americans filing new claims for unemployment benefits rose last week, but the underlying trend continued to point to a firming labor market.\nInitial claims for state unemployment benefits increased 8,000 to a seasonally adjusted 312,000 for the week ended May 31, the Labor Department said on Thursday.\nThe prior week's claims were revised to show 4,000 more applications received than previously reported. Economists polled by Reuters had forecast first-time applications for jobless aid rising to 310,000 last week.\nPeople attend a job fair in Detroit. New claims for unemployment benefits rose last week, but the underlying trend points to a firming labor market. JOSHUA LOTT / Reuters\nWhile jobless claims have been choppy in recent weeks because of problems seasonally adjusting the data around moving holidays such as Easter and Passover, they have continued to suggest the jobs market was strengthening.\nThe four-week moving average for new claims, considered a better measure of underlying labor market conditions as it irons out week-to-week volatility, fell 2,250 to 310,250, the lowest level since June 2007.\nLast week's data has no impact on the government's closely followed employment report for May, which will be released on Friday, as it falls outside the survey period.\nNon-farm payrolls are expected to have increased 218,000, slowing from April's out-sized 288,000 gain, according to a Reuters survey of economists.\nThe claims report showed the number of people still receiving benefits after an initial week of aid declined 20,000 to 2.60 million in the week ended May 24. That was the lowest level since October 2007.\n- Reuters","url":"https://www.nbcnews.com/better/careers/weekly-jobless-claims-rise-labor-market-trending-stronger-n123386"}
