{"authors":["David Dye"],"date_download":"2018-10-22 21:09:25","date_modify":"2018-10-22 21:09:25","date_publish":"2016-08-27 00:00:00","description":"Not every partnership is built to last. From The White Stripes to Sonny & Cher, here are 10 talented, if temporary, musical duos.","filename":"data/vaneerConsumption/WeekendLISTening10GreatDuosWhoCouldntKeepItTogether.json","image_url":"https://media.npr.org/assets/img/2016/08/25/ws-elephant-press1-2-_wide-073ca46391946616c943cfc0f7e54774a502eb9a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_world-cafe_2016_08_27_491400407_weekend-listening-10-great-duos-who-couldnt-keep-it-together_1540242565.html","title":"Weekend LISTening: 10 Great Duos Who Couldn't Keep It Together","title_page":"Weekend LISTening: 10 Great Duos Who Couldn't Keep It Together : World Cafe : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Weekend LISTening: 10 Great Duos Who Couldn't Keep It Together\nEnlarge this image toggle caption Patrick Pantano/Courtesy of the artist Patrick Pantano/Courtesy of the artist\nThis week, World Cafe rebroadcast a 2011 session with The Civil Wars. When we recorded that session, Joy Williams and John Paul White had just released their album Barton Hollow; they'd go on to win four Grammy awards, achieve a gold record and play sold-out concerts. But the duo's success wasn't enough to sustain their partnership, which fell apart in 2014.\nHere are 10 more great duos that, unfortunately, weren't built to last.\nOutKast\nAndre 3000 and Big Boi formed the hip-hop duo OutKast in Atlanta in 1992 and have released six albums together — so far. (Technically, they went on hiatus in 2007 and reunited briefly for a 2014 tour, so there's always the possibility they might record together again.) The 2003 album Speakerboxxx/The Love Below was a high point in the duo's discography.\nYouTube\nThe White Stripes\nThere have been a number of guitar-and-drums duos over the years, but none quite like The White Stripes. Jack White and Meg White met in high school in Detroit and recorded six very successful studio albums before officially breaking up in 2011. Jack continues to perform solo and with The Dead Weather and The Raconteurs.\nYouTube\nRichard and Linda Thompson\nThe dissolution of Richard and Linda Thompson's marriage played out onstage and in the masterpiece that was their sixth and final album as a duo, Shoot Out The Lights. But while they were together, the combination of Linda's voice and Richard's amazing songs and guitar work was a beauty to behold.\nYouTube\nDolly Parton and Porter Wagoner\nThe country star Porter Wagoner helped Dolly Parton get her start: In the early years of her career, she toured with him and appeared weekly on his influential television show. After seven years, despite Wagoner's protests, Parton split off to chase her own stardom.\nYouTube\nThe Louvin Brothers\nIra and Charlie Louvin, among the very best of country's close-harmony brother bands, were a major influence on artists like Gram Parsons and Emmylou Harris. The Louvin Brothers were regulars on the Grand Ole Opry starting in 1955 until Charlie, fed up with his brother's drinking and unpredictable behavior, left Ira in 1963. (Ira died in a head-on automobile collision two years later.)\nYouTube\nIke & Tina Turner\nThe story of Ike and Tina Turner's tumultuous relationship, particularly the brutal abuse Tina endured at her husband's hands, is well known. It's hard not to think about their problems when you watch an old performance — but boy, was Tina a powerhouse.\nYouTube\nEric B. and Rakim\nThe celebrated MC and DJ duo came to prominence in the 1980s, during the \"golden age\" of rap. Rakim's flow and Eric B.'s loops and samples are hip-hop perfection. They broke up in 1992.\nYouTube\nSonny & Cher\nCher and Sonny Bono started singing and recording together in the mid-1960s; one of their first singles, 1965's \"I Got You Babe,\" was a huge worldwide hit. The couple performed together until 1975, when they divorced and broke up the act. In that decade, they sold 40 million albums.\nYouTube\nThe Everly Brothers\nMany British Invasion bands, including The Hollies and The Beatles, revered the massively influential Everly Brothers, as did Simon & Garfunkel. Don and Phil Everly sang sweetly together from 1955 to 1973, when they broke up onstage at Knott's Berry Farm in California. While they temporarily reunited a few times for various recordings and performances, the brothers' relationship remained rocky until Phil's death in 2014.\nYouTube\nSimon & Garfunkel\nAfter defining folk-rock in the 1960s with a series of powerful and best-selling albums, in 1970 Paul Simon and Art Garfunkel broke up — for the first time. There have been numerous reunions since then, but none of them have lasted long, and Simon told NPR earlier this year that getting back together is off the table.","url":"https://www.npr.org/sections/world-cafe/2016/08/27/491400407/weekend-listening-10-great-duos-who-couldnt-keep-it-together"}
