{"authors":[],"date_download":"2018-10-31 00:03:57","date_modify":"2018-10-31 00:03:57","date_publish":"2018-07-07 00:00:00","description":null,"filename":"data/vaneerConsumption/WeeklyCALmatters07072018.json","image_url":"https://calmatters.org/wp-content/uploads/favicon-150x150.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_newsletters__1540944237.html","title":"Weekly CALmatters 07/07/2018","title_page":"Weekly CALmatters 07/07/2018 | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Weekly CALmatters 07/07/2018\nRecent Articles\nBy Antoinette Siu\nDemocratic legislators said today they’ve settled their differences on net neutrality in California, advancing bills that, if passed, would create the most far-reaching internet regulation since the federal government abandoned its Obama-era regulations.\nBy Ben Bradford, Capital Public Radio\nThe California Environmental Quality Control Act is the focus of heated debate, with environmentalists saying it’s a success but critics saying it’s been weaponized to impede housing.\nBy David Gorn\nCalifornia is testing programs to promote healthy living, prevent disease and lower the cost of care for people in Medi-Cal, the publicly funded health system that covers a third of the state’s residents.\nBy Meghan McCarty Carino, KPCC\nMany of us are paying a higher price for an ever-shrinking sliver of California paradise—and losing some of the quintessential perks of life in the Golden State.\nWhatMatters\nBy Dan Morain\nA federal judge upheld California’s sanctuary state law, saying the 10th Amendment doesn’t permit the federal government to force states to help enforce federal law.\nBy Dan Morain\nWhy California’s new privacy legislation will allow consumers to sue over data breaches by business, but not by government.\nBy Dan Morain\nThanks to legislation, the soda industry averted new local taxes, but it could face an initiative that would impose a new statewide tax.\nBy Dan Morain\nCalifornia officials played an integral role in Japanese internment during World War II, as told in a new online exhibit. The gas tax initiative fight revs up.\nCommentary\nBy Dan Walters\nJerry Brown has signed his 16th and final state budget, bragging that he fixed California’s financial mess. But that claim, and his claim of securing the state’s fiscal future, are overblown.\nBy Dan Walters\nThree initiatives that had qualified for the November ballot were dropped last week after their sponsors negotiated deals with the Legislature. Was it extortion? Not in the criminal sense, perhaps, but it was the adroit use of leverage.\nBy Dan Walters\nThe U.S. Supreme Court has declared that compelling non-members of public employee unions to pay dues is unconstitutional. California’s unions are now scrambling to avoid an erosion of their memberships, their revenues and their political clout.\nBy Dan Walters\nCalifornia once had a strong and successful Republican Party but over the last few decades, it has shrunken to a small minority of voters and if ti loses several congressional races this year, Democrats will have achieved total domination.\nResistance State\nBy David Gorn\nA federal judge today ruled against the Trump administration’s attempt to immediately halt California’s","url":"https://calmatters.org/articles/newsletters/weekly-calmatters-2018-07-07/"}
