{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:02:42","date_modify":"2018-10-30 21:02:42","date_publish":"2017-01-12 14:39:02","description":"PM Benjamin Netanyahu reiterated the claim that Israel has “unequivocal” evidence of the Obama administration's involvement in orchestrating the anti-settlement resolution passed by the UN Security Council last month.","filename":"data/vaneerConsumption/WeHaveUnequivocalProofObamaBehindAntiIsraelUNResolution.json","image_url":"https://media.breitbart.com/media/2016/12/wi/ap/25/14rrtl5-e1482848146174.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_01_12__1540933362.html","title":"We Have 'Unequivocal' Proof Obama Behind Anti-Israel UN Resolution","title_page":"Netanyahu: We Have 'Unequivocal' Proof Obama Behind Anti-Israel UN Resolution","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Prime Minister Benjamin Netanyahu on Tuesday reiterated the claim that Israel has “unequivocal” evidence of the Obama administration’s involvement in orchestrating the anti-settlement resolution passed by the UN Security Council last month.\n“We have unequivocal evidence that the Security Council resolution passed in the UN against Israel was led by the administration,” he told a group of visiting American Israel Public Affairs Committee (AIPAC) officials in Jerusalem.\n“There is no question whatsoever about that – none whatsoever.”\nResolution 2334 demands an end to all settlement construction, which it deems a “flagrant violation of international law,” and further defines eastern Jerusalem, which includes the Old City, Temple Mount and the Western Wall as “occupied Palestinian territory.”\nNetanyahu said the resolution signaled a “major break” with the policies of previous administrations.\nHe quoted then-U.S. ambassador to the UN Madeleine Albright’s response to a 1994 Security Council resolution on the conflict.\n“We oppose the specific references to Jerusalem in this resolution and will continue to oppose its insertion in future resolutions,” Albright said.\n“We simply do not support the description of the territories occupied by Israel in the 1967 war as ‘occupied Palestinian territory,’” she added.\nNetanyahu raised concern that President Barack Obama would still try and impose parameters for a peace deal at the UN in the midnight hours of his administration.\n“We are concerned there may be a repetition of this [at the UN before Obama leaves office]. … We’re doing our best [and] we hope that you’ll do your best to exert the influence that it doesn’t happen, because it pushes peace further away because it’s unfair.”","url":"https://www.breitbart.com/middle-east/2017/01/12/netanyahu-we-have-unequivocal-proof-obama-behind-security-council-resolution-that-marks-major-break-from-u-s-policy/"}
