{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 18:07:12","date_modify":"2018-10-30 18:07:12","date_publish":"2017-02-14 22:38:35","description":"Singer Joy Villa donned a dress with the \"Make America Great Again\" slogan at the Grammys Sunday night, thanks to a patriotic designer.","filename":"data/vaneerConsumption/WeHavetoSupportOurPresident.json","image_url":"https://media.breitbart.com/media/2017/02/JoyVillaSalesSpike.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2017_02_14__1540922832.html","title":"'We Have to Support Our President'","title_page":"Joy Villa Designer at Grammys: 'We Have to Support Our President'","title_rss":"NULL","source_domain":"breitbart.com","text":"Singer Joy Villa donned a dress with the “Make America Great Again” slogan at the Grammys Sunday night, thanks to the help of one San Diego fashion designer.\nAndre Soriano of La Mesa designed the dress to represent “love and togetherness” in addition to making a statement, KSWB reported.\n“I took my Trump flag from the front of my house and made the gown for her,” Soriano said. “We have to support our president.”\nVilla walked the red carpet wearing a white cloak before taking it off to reveal the red, white, and blue Donald Trump-inspired dress.\nVilla posted a picture of herself wearing the dress after the show on Instagram.\n“Go big, or go home. You can either stand for what you believe or fall for what you don’t,” the post read. “Above all make a choice for tolerance and love. Agree to disagree. See the person over the politics, carry yourself with dignity, always.”\nVilla also held a purse shaped like a sacred heart. Soriano said they selected the heart-shaped purse to represent love, family, and togetherness.\n“We have to bring this country back,” he said. “There are a lot of people who don’t agree with our president, but they should give him a chance.\nVilla’s album sales spiked to the top spot on Amazon’s list of top 100 digital albums, and made it high on the iTunes top albums list after she wore the dress.","url":"https://www.breitbart.com/entertainment/2017/02/14/joy-villa-designer-used-trump-flag-make-dress-worn-grammys-support-president/"}
