{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 19:42:01","date_modify":"2018-10-30 19:42:01","date_publish":"2015-08-14 13:49:53","description":"Israel's Consul General in Los Angeles told Breitbart News that he believes Iran will cheat on the new nuclear deal.","filename":"data/vaneerConsumption/WeKnowIranWillCheat.json","image_url":"https://media.breitbart.com/media/2015/05/Israel-flag-Joel-Pollak-Breitbart-News-1024x768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_08_14__1540928521.html","title":"'We Know Iran Will Cheat'","title_page":"Israel's L.A. Consul General: 'We Know Iran Will Cheat'","title_rss":"NULL","source_domain":"breitbart.com","text":"LOS ANGELES, California — David Siegel, Israel’s Consul General in Los Angeles and to the southwestern United States, told Breitbart News in an exclusive interview this week that he believes Iran will cheat on the new nuclear deal, as it has on past agreements.\nIsrael will remain “vigilant” in the face of these threats, he says.\n“We [the government of Israel] see this as a very bad deal,” Siegel said. “Iran is the #1 sponsor of terrorism in the world and the #1 purveyor of antisemitism. We all know that Iran has cheated for a quarter century and will continue to cheat in the future.”\nHe noted that Israel has always believed peace could be achieved through robust diplomacy, economic sanctions and military preparedness.\n“Israel was one of the first countries to advocate a diplomatic solution to the Iranian problem. The only way to get Iran to roll back their nuclear program was under pressure, and there is a history which supports this,” Seigel said.\nAs for a military option for Israel, Siegel told Breitbart News, “we certainly don’t advocate that. We are big proponents of finding a political, diplomatic, economic way to stop Iran.” He added that “Israel knows well how to defend itself and we will make sure it can do that in the future. We will be very vigilant whether vis-a-vis Iran or its proxies.”\n“Initially, the agreement demanded that Iran’s nuclear program be dismantled….And then the model changed to something else, which enabled them to keep their program in place, and we relieved the sanctions.”\nSecretary of State John Kerry has unremittingly stated that he is “absolutely convinced beyond any doubt that this deal makes Israel safer, and the region and the world.” He also downplayed the dangers of by stating that even if Iran developed a nuclear weapon, “no nation is going to consider itself nuclear capable with one bomb.”\nPresident Barack Obama has insisted that, through the Iran deal, “every pathway to a nuclear weapon is cut off” for the Iranian regime.\nSiegel told Breitbart News, however, that Iran will continue on its quest for a nuclear weapon. This deal “will pave their path to a bomb. It won’t block all avenues to a bomb as the administration states,” he said.\n“Iran is not changing. It’s just as dangerous as ever. It’s taking over Arab country by Arab country and they now control four Arab capitals that are located on Israel’s borders,” including Syria, Lebanon and Gaza, he said.\nIran has also made continuous attempts to upgrade military equipment used by Hezbollah, Hamas and other Islamic jihadists by providing them with surface-to-sea, cruise and supersonic missiles.\nAdditionally, Siegel said that passage of the Iran deal, as it now stands, will set off a nuclear arms race in the region.\nThere is one silver lining: “We see a complete realignment in the Middle East where Saudi Arabia and even moderate countries like Jordan and Egypt see challenges and threats to the region” which could result in warming relations between them and Israel as a result of resisting their common enemy.\nFollow Adelle Nazarian on Twitter @AdelleNaz and on Facebook.","url":"https://www.breitbart.com/national-security/2015/08/14/israels-l-a-consul-general-we-know-iran-will-cheat/"}
