{"authors":[],"date_download":"2018-10-22 22:16:45","date_modify":"2018-10-22 22:16:45","date_publish":"2014-05-09 17:13:08","description":"High-end homes in Atherton are selling like hotcakes, often over the asking price, and frequently for all cash.","filename":"data/vaneerConsumption/WelcometoAthertonCaliftheNationsPriciestZIPCode.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/432531/140509-biz-atherton_a1611470e53fe6a7a1cd940e770c09c3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_real-estate_welcome-atherton-calif-nations-priciest-zip-code-n101581_1540246605.html","title":"Welcome to Atherton, Calif., the Nation's Priciest ZIP Code","title_page":"Welcome to Atherton, Calif., the Nation's Priciest ZIP Code","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nYou've heard it before: the rich are getting richer.\nAnd that's nowhere more evident than here in Atherton, California. The private mansions—rarely seen from the road—are experiencing a pricing renaissance.\nHigh-end homes in Atherton are selling like hotcakes, often over the asking price, and frequently for all cash. That's saying something when you are talking about $10 million-plus estates.\nAnd for Google's Eric Schmidt, HP's Meg Whitman, Facebook's Sheryl Sandberg and Charles Schwab, Atherton is home.\nThe town is 45 minutes south of San Francisco, and less than 20 minutes to the headquarters of Facebook, Google and most of the major tech companies in Silicon Valley.\nAtherton is the most expensive real estate ZIP code in the United States. The average home price has soared close to 40 percent year over year, according data compiled by several Silicon Valley real estate agencies.\nReal estate brokers say there was a frenzy of buying for homes in the $5 million range last year, but this year demand is shifting to the more expensive houses. In the first quarter of 2014, there were seven sales of mansions in Atherton in excess of $10 million, some to deep-pocketed Chinese buyers.\n\"We have a market here with high demand, low supply. And of course we are the center of technology. The tech sector is doing well. Everything that drives the tech sector, the local economy, venture capital, private equity. We're just the center of innovation here. So that, more than anything, drives our housing market,\" said Tom LeMieux of Pacific Union International, a real estate firm.","url":"https://www.nbcnews.com/business/real-estate/welcome-atherton-calif-nations-priciest-zip-code-n101581"}
