{"authors":["John Hutchinson For Mailonline"],"date_download":"2018-10-22 23:17:18","date_modify":"2018-10-22 23:17:18","date_publish":"2016-01-28 12:10:47","description":"This is Montecristo, made famous by author Alexandre Dumas, whose 19th-century novel The Count Of Monte Cristo incorporated legends of treasure buried there by pirates such as Redbeard.","filename":"data/vaneerConsumption/WelcometotheMediterraneansmostmysteriousislandMontecristoiswherefearsome16thcenturypiratesarerumouredtohaveburiedtheirtreasureandonlyathousandvisitorsarepermittedpery.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/26/17/3099675B00000578-0-image-a-16_1453828281208.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3417648_Welcome-Mediterranean-s-mysterious-island-Montecristo-fearsome-16th-century-pirates-rumoured-buried-treasure-thousand-visitors-permitted-year_1540250238.html","title":"Welcome to the Mediterranean's most mysterious island: Montecristo is where fearsome 16th-century pirates are rumoured to have buried their treasure... and only a thousand visitors are permitted per y","title_page":"Welcome to the Mediterranean's most mysterious island: Montecristo is where fearsome 16th-century pirates are rumoured to have buried their treasure... and only a thousand visitors are permitted per year | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's a picturesque island in the Mediterranean where piles of treasure could be buried - but digging it up is out of the question.\nThis is Montecristo, made famous by author Alexandre Dumas, whose 19th-century novel The Count Of Monte Cristo incorporated legends of treasure buried there by pirates such as Redbeard.\nOnly 1,000 tourists are permitted to visit the nature reserve per year and only then after they've waited three years for a visa to do so. And excavations are strictly out of the question.\nThere could be stacks of treasure buried on the picturesque island of Montecristo in the Mediterranean\nA chapel was set up in a cave by monks in the seventh century. They went on to become part of the Benedictine order and it's believed they amassed huge wealth\nAround a thousand tourists are permitted to visit the nature reserve each year, with many labelling it the 'forbidden island'\nThe exact location and nature of the supposed 'treasure' remains a mystery.\nRumours about hidden loot first started circulating in the 13th century when the Monastery of St Mamilian on the island became extremely wealthy.\nThe order was founded in the seventh century and their first chapel was built in a cave. But over time they accrued vast wealth thanks to donations from several noble families.\nBut some believe Turkish pirate Oruç Reis, known in the West as Barbarossa (which means Redbeard in Italian), stashed loot on the island when he seized it in the 16th century, having spent years robbing merchant ships.\nThe Monastery of St Mamilian was founded at the beginning of the seventh century and stands prominently on the island\nThe fearsome Ottoman pirate Dragat (left) is said to have stormed the island and raided the monks' treasure. Others believe Redbeard (right) left loot on Montecristo after years of raids on the high seas\nHis predecessor Dragut may also have buried wealth there.\nHe stormed the monastery in 1553, enslaved the monks, and decreed its end. Perhaps he uncovered their wealth and found his own hiding place for it?\nIn 1860, the Kingdom of Italy annexed Montecristo and, in 1889, it was ceded to the Marquis Ginori who transformed it into a game reserve and restructured the villa that had been built on the Cala Maestra some time before.\nThe only way tourists can visit the 'forbidden island' is by booking onto one of the various tours that take place in the national park\nVisitors will get the chance to meet mountain coats, one of only a few permanent residents of Montecristo\nIn 1971, the island went back into the hands of the state. It currently belongs to the Tuscan Archipelago National Park.\nNow the only way tourists can visit the 'forbidden island' is by booking into one of the various tours that take place in and around the national park.\nThe Greeks gave Montecristo its oldest known name, Oglasa or Ocrasia, after the yellowish colour of the rocks. The Romans, however, knew it under the name Mons Jovis, and erected an altar to Iuppiter Optimus Maximus on the highest mountain, of which some traces remain.\nThe Greeks gave Montecristo its oldest known name, Oglasa or Ocrasia, after the yellowish colour of the rocks\nIn 1860, the Kingdom of Italy annexed Monte Cristo and, in 1889, it was ceded to the Marquis Ginori who transformed it into a game reserve","url":"https://www.dailymail.co.uk/travel/travel_news/article-3417648/Welcome-Mediterranean-s-mysterious-island-Montecristo-fearsome-16th-century-pirates-rumoured-buried-treasure-thousand-visitors-permitted-year.html"}
