{"authors":["John Stevens And Mario Ledwith For The Daily Mail"],"date_download":"2018-10-22 22:38:23","date_modify":"2018-10-22 22:38:23","date_publish":"2017-03-10 01:06:02","description":"The row over a potential bill intensified yesterday as EU figures claimed the amount would have to be settled before talks on a new trading relationship start.","filename":"data/vaneerConsumption/WellfightEUdemandfor52bndivorcebillwarnsMay.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E1E1E7C00000578-0-image-a-95_1489107731423.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299600_We-ll-fight-EU-demand-52bn-divorce-bill-warns-May_1540247903.html","title":"We'll fight EU demand for £52bn 'divorce bill' warns May","title_page":"We'll fight EU demand for £52bn 'divorce bill' warns May | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Theresa May insisted last night she will fight any demands for Britain to pay a £52billion ‘divorce bill’ when it leaves the EU.\nThe Prime Minister warned European leaders the British people did not vote for Brexit only to keep sending huge sums to Brussels.\nThe row over a potential bill intensified yesterday as EU figures claimed the amount would have to be settled before talks on a new trading relationship start.\nTheresa May has insisted she will fight any demands for Britain to pay a £52billion ‘divorce bill’ when it leaves the EU\nBut Mrs May, in Brussels for an EU leaders’ summit, said: ‘I’m clear that the way people voted on June 23 for us to leave the European Union, they voted for us in the future not paying huge sums of money into the EU every year.\n‘And of course when we leave the EU that will be the case.’\nEU negotiators have claimed the country will be on the hook for projects it signed off as a member after it leaves, as well as pensions for Brussels officials.\nBut the Government’s legal advice states that there is no law or treaty that will compel Britain to make payments after Brexit.\nAsked yesterday what Britain would do if Brussels presents a hefty bill, Foreign Secretary Boris Johnson urged Mrs May to channel the spirit of Margaret Thatcher. He told the BBC: ‘I think we have illustrious precedent in this matter.\n'I think you can recall the 1984 Fontainebleau summit in which Mrs Thatcher said she wanted her money back and I think that is exactly what we will get.’\nPushed on whether the Government would say no, he replied: ‘It is not reasonable, I don’t think for the UK, having left the EU, to continue to make vast budget payments. I think everybody understands that and that’s the reality.’\nIrish prime minister Enda Kenny (pictured) indicated yesterday he would back demands for Britain to pay a Brexit divorce bill as he arrived for the summit in Brussels\nBritain is expected argue there is no basis in European or international law for payments to continue after Brexit, unless there is an agreement to do so.\nThe decision sets the stage for an early confrontation with the European Commission’s negotiating team, led by Michel Barnier, who has made it clear he expects the early focus of talks to be on Britain’s apparent financial liabilities.\nIrish prime minister Enda Kenny indicated yesterday he would back demands for Britain to pay a Brexit divorce bill as he arrived for the summit in Brussels.\nWILL TUESDAY BE EXIT DAY? The Prime Minister last night declared it was ‘time to get on with leaving the EU’ as she cleared the decks to kickstart Brexit as soon as Tuesday. Ministers set out a timetable that could see the Brexit Bill passed by MPs on Monday night – handing Theresa May the power to trigger Article 50. She could then do so in the Commons on Tuesday. European Council president Donald Tusk said EU leaders would be ready to react with their negotiation ‘red lines’ within 48 hours of Mrs May triggering Article 50.\nHe said: ‘When you sign on for a contract you commit yourself to participation and obviously the extent of that level of money will be determined. It will have to be dealt with and it will be dealt with.’\nHe also warned Dublin hoped to take jobs from the City, saying: ‘A substantial number of financial institutions or banks intend to make decisions to either move or move sections of their business out of London.\n‘Ireland will compete fairly for that and I’m absolutely convinced we will win substantial business.’\nIt came after Danish foreign minister Anders Samuelsen claimed it could take up to 15 years for Britain to get a trade deal.\nBut Mrs May said the withdrawal process as set out in Article 50, including setting the framework for future relations, ‘actually should take the two years’.\nShe added: ‘That is the timetable we’re working to and that is the timetable the EU is working to.’\nMeanwhile, EU leaders agreed last night to re-elect Donald Tusk as European Council president.","url":"https://www.dailymail.co.uk/news/article-4299600/We-ll-fight-EU-demand-52bn-divorce-bill-warns-May.html"}
