{"authors":["Steph Cockroft For Mailonline"],"date_download":"2018-10-23 02:34:57","date_modify":"2018-10-23 02:34:57","date_publish":"2017-03-16 13:15:57","description":"PC Ian Clarke, 48, from Mold, Flintshire, walked naked into his victim's room while she was sleeping and raped her. Fifteen minutes later, he rejoined his wife in a nearby bedroom.","filename":"data/vaneerConsumption/Welshpolicemanrapedvictimwhilehiswifesleptnearby.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E540C4F00000578-0-image-a-57_1489670154082.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320200_Arrogant-PC-48-raped-victim-wife-slept-nearby_1540262097.html","title":"Welsh policeman raped victim while his wife slept nearby","title_page":"Welsh policeman raped victim while his wife slept nearby | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PC Ian Clarke, 48 (pictured outside court), has been jailed for five years for raping his victim while his wife slept nearby\nAn 'arrogant' policeman who thought he was irresistible raped a woman as his wife slept in a room nearby.\nPC Ian Clarke, 48, walked naked into his victim's room while she was sleeping and raped her.\nFifteen minutes later, he rejoined his sleeping wife - herself a detective constable - in bed.\nMold Crown Court heard how the father-of-one, a police officer working in the major crimes unit of North Wales Police, had a 'disrespectful and dismissive' attitude to woman, as well as an 'overblown sense of self importance'.\nThe PC, who had also served in Afghanistan with the Territorial Army, denied the rape, had claimed the sex was a consensual 'drunken dalliance'.\nBut he was convicted last month after failing to show an 'ounce of remorse' for the crime.\nThe court heard that he even complained about being made to feel unwelcome in his force - which he joined in 2013 - following the allegations.\nClarke, from Mold, Flintshire, has now been jailed for five years.\nPassing sentence, Rhys Rowlands said Clarke had shown 'a complete lack of any moral compass whatsoever'.\n'This was appalling behaviour on your part,' he added.\n'At the trial you portrayed yourself as being the victim, suggesting this was a drunken dalliance and you simply regretted cheating on your wife who was also asleep in the room nearby.\n'This was drunken risk-taking borne out of an inflated sense of your own worth, out of sheer arrogance.'\nHe added that he was a man with a 'high opinion of himself, in complete contrast with your victim and your wife'.\n'Jail will be particularly difficult for you because of the nature of the offence and your occupation as a police officer,' he added.\nDuring the trial, the court heard how Clarke and another man had exchanged 'immature, laddish and disrespectful' text messages.\nHe had also trawled dating sites behind his wife's back.\nJurors were told how Clarke thought the victim - who had consumed alcohol - would be 'up for it' and believed she would welcome his advances as she would be 'unable to resist him'.\nBob Sastry, mitigating, said the defendant still denied raping the woman and had now lost his job, marriage and freedom and also had been ostracised by his community.\nHe added: 'Clearly, Mr Clarke's life is now in tatters.'\nClarke, who showed no reaction as he was sent down, was also ordered to sign the sex offenders register indefinitely.\nHe was told he cannot work with vulnerable adults or children on his release from prison.","url":"https://www.dailymail.co.uk/news/article-4320200/Arrogant-PC-48-raped-victim-wife-slept-nearby.html"}
