{"authors":["Phil Blanche","Press Association Sport"],"date_download":"2018-10-23 02:09:20","date_modify":"2018-10-23 02:09:20","date_publish":"2016-01-28 16:55:04","description":"The Welsh Rugby Union has called for players to inform it of any drug-taking in the sport to 'protect our game'. WRU chief executive Martyn Phillips made the appeal for intelligence on doping.","filename":"data/vaneerConsumption/WelshRugbyUnionurgesplayerstoreportdopinginordertoprotectthegame.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC68DB00000578-0-image-a-52_1453999377722.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-3421315_Welsh-Rugby-Union-urges-players-report-doping-order-protect-game_1540260560.html","title":"Welsh Rugby Union urges players to report doping in order to 'protect' the game","title_page":"Welsh Rugby Union urges players to report doping in order to 'protect' the game  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Welsh Rugby Union has called for players to inform it of any drug-taking in the sport to 'protect our game'.\nWRU chief executive Martyn Phillips made the appeal for intelligence on doping after Maesteg Harlequins lock forward Ryan Watkins became the 12th Welsh rugby player to be suspended by UK Anti-Doping.\nWatkins has been banned for four years after testing positive for the anabolic steroid nandrolone and the stimulant methylhexaneamine.\nWRU chief executive Martyn Phillips (left) has called for players to inform it of any drug-taking in the sport to 'protect our game'\nHis team-mate Shaun Cleary also tested positive before a Harlequins friendly with Bridgend Ravens last August and has been banned for two years after benzoylecgonine, a cocaine metabolite, was found in his system.\nIn November, UKAD figures revealed Welsh rugby players from both league and union codes made up 34 per cent of all sportsmen and women serving drugs bans in the United Kingdom.\nResponding to the two latest drug bans in Welsh rugby, Phillips stressed greater intelligence of drug-taking was needed to catch the culprits.\n'There is no place for doping within sport, and it certainly doesn't fit in with the values of rugby union,' Phillips said on the official WRU website.\n'Players have a responsibility to themselves, to each other, to their clubs and to the sport to act within the rules and spirit of the game.\n'We work closely with UK Anti-Doping and fully adhere to the World Anti-Doping Code.\n'Many of the ADRV findings are intelligence-led and we will be relentless in working with UKAD to follow up leads that 'out' players who dope in Welsh rugby.\n'We want to rid our game of these practices and we encourage anyone who has any intelligence of doping taking place to call the WRU or UKAD and help protect our game.'\nThe WRU says it has started a programme to train additional educators and advisers to deliver anti-doping education, while offering awareness workshops at the regions and clubs around Wales.\nNational team captain Sam Warburton has also in the past called on everyone involved in the game in to protect the sport, in order so that every player has the right to complete with any against other clean players.\nNational team captain Sam Warburton has also in the past called on everyone involved in the game in to protect the sport\nPlayers who are on the international pathway also have to complete World Rugby's e-learning course on anti-doping education.\nWhile the numbers caught do not represent the elite levels of the game, there have been a number of alarming cases down the Welsh pyramid in recent years.\nSwansea hooker Dean Colclough was handed a record eight-year ban by UKAD in February 2014 for possessing and trafficking steroids.\nOwen Morgan, who played for big-spending SWALEC Championship leaders Merthyr, was banned for four years in November after testing positive for the anabolic steroid drostanolone and benzoylecgonine.\nBut Watkins' lengthy ban has put the issue of doping in Welsh rugby back in the spotlight.\nUKAD director of legal Graham Arthur said: 'Ryan Watkins deliberately ingested nandrolone and methylhexaneamine without any consideration for his responsibilities as an athlete.\n'By making this conscious choice to dope, Watkins has chosen to cheat his team-mates, the opposition and his sport.\n'This serious breach of the rules and blatant attempt to cheat the system has rightly resulted in a four-year ban.","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-3421315/Welsh-Rugby-Union-urges-players-report-doping-order-protect-game.html"}
