{"authors":["Ashley Collman For Dailymail.Com"],"date_download":"2018-10-23 03:23:55","date_modify":"2018-10-23 03:23:55","date_publish":"2016-01-11 16:01:43","description":"Wendi Wanell Warner, 44, was found murdered in her father's Hardin County, Texas home on Sunday. She leaves behind two children and a grandchild.","filename":"data/vaneerConsumption/WendiWanellWarnersfatherfindshermurderedbyherexboyfriend.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300C080000000578-0-image-a-56_1452528195313.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394100_Father-arrives-home-discover-body-adult-daughter-murdered-ex-boyfriend_1540265035.html","title":"Wendi Wanell Warner's father finds her 'murdered by her ex-boyfriend'","title_page":"Wendi Wanell Warner's father finds her 'murdered by her ex-boyfriend' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A father in southeastern Texas received the shock of a lifetime on Sunday when he returned home to find his adult daughter murdered.\nAuthorities have not yet revealed how 44-year-old Wendi Wanell Warner died, but her ex-boyfriend Joseph Anthony Latulas, 40, has been arrested and charged with her murder.\nWarner was a mother of two and had a grandchild.\nBad romance: Wendi Wanell Warner, 44 (left), was found murdered in her father's home on Sunday, and her former boyfriend Joseph Anthony Latulas, 40 (right), has been arrested as the suspected killer\nHer father discovered her body around 10am on Sunday, when he returned to his double-wide home on the 7500 block of FM 92 in Hardin County, Texas.\nWarner lived in another home on the same property.\nIt's believed that Latulas was either dropped off or walked to the property to kill his former girlfriend. He is set to be arraigned Monday on the charges.\nFollowing her death, Warner's family gathered at the family home on Sunday to remember her.\nWarner's aunt Dorothy Underwood remembered her niece as sweet, funny and hard working.\n'Very sweet, very funny,' Underwood told 12 News Now. 'She had a good job. She was doing really well.'\nUnderwood says she feels horrible her brother had to discover his daughter's dead body.","url":"https://www.dailymail.co.uk/news/article-3394100/Father-arrives-home-discover-body-adult-daughter-murdered-ex-boyfriend.html"}
