{"authors":[],"date_download":"2018-10-30 14:31:30","date_modify":"2018-10-30 14:31:30","date_publish":"2015-06-19 00:00:00","description":null,"filename":"data/vaneerConsumption/Weneedtoworkhardertokeepstateandnationalparksclosed.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_06_we_need_to_work_harder_to_keep_state_and_national_parks_closed_1540909890.html","title":"We need to work harder to keep state and national parks closed","title_page":"We need to work harder to keep state and national parks closed","title_rss":"NULL","source_domain":"americanthinker.com","text":"We need to work harder to keep state and national parks closed\nEvery time someone visits a state or national park chances are they disturbing precious wildlife. Birds that were singing mating calls will forget the words. Male deer who were battling with each other for the right to mate with the females will suddenly get shy, creating an opening for the maimed, blind deer to mate with the herd. Fish swimming upstream to spawn will get disoriented, and swim instead into lower income downstream tributaries filled with dangerous \"gansta\" fish. That's why we need to keep our parks as inaccessible as possible. State and Federal governments have been doing a fairly good job of this. They keep entry fees low and fund the parks as little as possible. More importantly, they do their best to prevent parks from generating revenue sufficient to cover operating expenses. But now some evil Republicans in Florida want to ruin all that:\nFlorida is moving toward expanding cattle grazing, hunting and other commercial activities in state parks to help make them self-sufficient, an idea raising alarms among conservationists. You see? Conservationists are on our side. They don't want parks self sufficient either. Up first is a plan to sell cattle-grazing rights to 6,630 acres in the Myakka River State Park near Sarasota, one of the state’s most diverse natural areas popular with wildlife photographers, hikers and boaters, according to a draft bid document by the state Department of Environmental Protection. Ever notice in articles they always call whatever they are writing about as one of the \"most diverse natural areas\"? Have you ever seen an article in your entire life which said, \"such and such, wanted to build on a very non-diverse area\"? No. No such article has ever been written. In any event, the plan is outrageous. Imagine animals eating plants on nearly 9% of this state park. It would destroy everything. Although I have never been there, I am quite confident that no animals in Myakka River State Park eat plants. This would be a first. The existing animals in the park must all eat meat, or perhaps tofu. Cattle grazing in the 37,000-acre Myakka park would block large-animal migration, and damage wetlands and natural vegetation, said Glenn Compton, director of ManaSota-88, a west coast Florida environmental group. This is true. In large, natural habitats, other animals have no way of getting around herds of herbivores. You can easily find skeletons of lions and tigers who were forced to sit and wait and wait to cross until they starved to death. Cattle grazing already occurs in several state parks, but Jono Miller said those leases involve already disturbed land or parks that harbor special cows descended from a historic Florida breed brought to the state by the Spanish. This makes sense only for the special, Hispanic cows. If these cows can truly trace their lineage back to the cows of Queen Isabella of Spain, then I can see a special exception being made, though I would hope they would be joined by a more diverse herd made up of cows from Africa and Asia as well. In recent years, conservationists have fought off proposals for recreational vehicle camping grounds and golf courses within state parks, Larson said. Good for them! Because if parks allow money-making schemes on five or even ten percent of their acreage, they will easily make enough money to keep the rest of the park open to visitors. More people will visit and more animals will be discomfited. So what if visitors to major parks only visit two or three percent of the actual park? The needs of the animals in that tiny space is paramount. Let us work hard to fight efforts to make the outdoors more accessible to people, because the outdoors were made for animals and plants, not for us. This article was produced by NewsMachete.com , the conservative news site.","url":"https://www.americanthinker.com/blog/2015/06/we_need_to_work_harder_to_keep_state_and_national_parks_closed.html"}
