{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:48:59","date_modify":"2018-10-30 21:48:59","date_publish":"2016-06-20 19:55:25","description":"On ABC's The View, the co-hosts talked gun control in a post-Orlando world, lamenting an absence of background checks and waiting periods.","filename":"data/vaneerConsumption/WeNeedBackgroundChecksWaitingPeriodsforGunSales.json","image_url":"https://media.breitbart.com/media/2016/06/The-View-6-20-16-twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_06_20__1540936139.html","title":"We Need Background Checks, Waiting Periods for Gun Sales","title_page":"The View: We Need Background Checks, Waiting Periods for Gun Sales","title_rss":"NULL","source_domain":"breitbart.com","text":"During the June 20 airing of ABC’s The View, Whoopi Goldberg, Joy Behar, and others discussed gun control in the post-Orlando world, ultimately lamenting an absence of background checks and waiting periods.\nApparently unbeknownst to The View, Orlando gunman Omar Mateen passed a background check and submitted to a waiting period.\nGoldberg said, “Today, the Senate is set to vote on a new gun bill amendment that would add measures like expanding background checks or alerting authorities if someone is on a terror watch list or tries to obtain firearms.” Goldberg then expressed her frustration that securing gun control is mired in bureaucracy: “Maybe we’re just peeing in the wind,” she stated.\nJoy Behar predicted that new controls will not pass. She then accused the NRA of opposing “any kind of background checks or any stop-gaps in the gun laws,” making it appear she does not know Mateen passed a background check to get his guns and submitted to a “stop-gap,” known as a waiting period.\nOne host clearly did not understand the gun controls with which Mateen cooperated to acquire his firearms, as she brought up the “gun show loophole” and asked, “What is wrong with someone having a three-day wait if they want to purchase a gun?”\nIronically, on June 13, Ed Hensen, owner of St. Lucie Shooting Center, told reporters that Mateen did not buy his rifle and handgun on the same day because there was a state-imposed three-day waiting period for the handgun. Moreover, Hensen confirmed that Mateen passed a background check for the firearms.\nBreitbart News reported that Mateen possessed a Florida Security Officer License and a Statewide Firearms License for which he had to pass in-depth background checks, including a mental evaluation, to acquire.\nNonetheless, The View hosts think background checks and waiting period are keys to preventing another Orlando attack.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/entertainment/2016/06/20/the-view-need-background-checks-waiting-periods-for-gun-sales/"}
