{"authors":["John Hayward"],"date_download":"2018-10-30 19:31:01","date_modify":"2018-10-30 19:31:01","date_publish":"2016-04-09 01:53:23","description":"The co-founder of the law firm at the center of the \"Panama Papers\" data leak has an explanation for why few Americans were exposed by the scandal.","filename":"data/vaneerConsumption/WePreferNottoHaveAmericanClients.json","image_url":"https://media.breitbart.com/media/2016/04/Mossack-Fonseca-founder-Ramon-Fonseca-on-Panama-Papers-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_04_08__1540927861.html","title":"'We Prefer Not to Have American Clients'","title_page":"Founder of Panama Papers Firm: 'We Prefer Not to Have American Clients'","title_rss":"NULL","source_domain":"breitbart.com","text":"The co-founder of Mossack Fonseca, the Panamanian law firm at the center of the “Panama Papers” data leak, has a simple explanation for why few Americans have been among the clients exposed by the scandal: the firm preferred to seek customers in other parts of the world.\n“My partner is German, and I lived in Europe, and our focus has always been the European and Latin American market,” said Ramon Fonseca, whose partner was Jurgen Mossack.\n“He loves the U.S. a lot, and I do, too. My kids were educated there,” Fonseca added, as reported by the Associated Press. However, “as a policy we prefer not to have American clients.”\nThe AP suggests the shortage of American clients might be due to more generous opportunities under American law to create the sort of corporations Mossack Fonseca specialized in establishing, particularly in states like Wyoming, Delaware, and Nevada. Only some 200 American passports appeared in the leaked data, along with U.S. addresses for about 3,500 shareholders, representing a very small portion of the 250,000 shell companies the firm has helped to establish.\nIt is speculated that U.S. customers were better off avoiding the Panamanian firm because Panama has a reputation for “shady financial deals and money laundering” — which is, in essence, what the Panama Papers scandal is all about.\nAustralia’s News.com has some interesting background on Ramon Fonseca:\nUntil recently, he was president of the governing Panamenista party and served in the Cabinet of President Juan Carlos Varela as a special adviser. He was forced to resign in February after the offices of the Mossack-Fonseca affiliate in Brazil were raided and several managers arrested as part of the investigation into bribes paid to politicians by companies doing business with the firm.\nFonseca is also noted for writing prize-winning novels about political corruption, which he bills as containing details informed by his own life experiences.\nFonseca amusingly dismissed the virtually nonexistent diligence his firm practiced over its more questionable clients — some of whom were under international sanctions — by saying, “We’re not perfect, and some surely escape by.”\nHe also repeated the insistence by the firm, and many of its exposed clients, that “so far, the only crime that has been proven is the hack.”\nThe Panama Papers story is nevertheless causing political turbulence around the world and has increased tensions between Panama and Europe.\nEuropean Union officials have long complained that Panama is not sufficiently cooperative with efforts to combat money laundering and tax evasion. “People are fed up with these outrages. The amounts of money, the jurisdictions and the names associated with this affair are frankly shocking,” thundered EU financial affairs director Pierre Moscovici.\nPanama, on the other hand, complains it has been unfairly stigmatized by media coverage of the Panama Papers and points to laws in some European countries that are not much tighter than its own.\nThe Economist sees the scandal as evidence that tax-avoidance laws should be improved in many locales but warns that “cleaning up tax havens will not end graft.”\n“The prime responsibility for this lies with national governments, many of which should do more to make their finances transparent and their safeguards against cronyism stringent,” The Economist writes. “But it would help if kleptocrats were less able to hide their stashes. Hence co-ordinated global efforts are required to crack down on corporate anonymity and to stop the middlemen who make it so easy for crooks to launder their loot.”","url":"https://www.breitbart.com/national-security/2016/04/08/founder-panama-papers-firm-prefer-not-american-clients/"}
