{"authors":["Daily Mail Reporter"],"date_download":"2018-10-22 21:12:09","date_modify":"2018-10-22 21:12:09","date_publish":"2017-04-26 01:20:00","description":"Britons feel true 'happiness' 432 times a year on average with triggers including TV box set nights with the family, romantic nights out with a partner and soaking in the bath with a glass of wine.","filename":"data/vaneerConsumption/Weretrulyhappyeighttimesaweek.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B366D00000578-0-image-a-15_1493165784506.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4445910_We-truly-happy-eight-times-week_1540242729.html","title":"We're truly happy eight times a week","title_page":"We're truly happy eight times a week | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Britons feel true 'happiness' 432 times a year on average with triggers including TV box set nights with the family, romantic nights out with a partner and soaking in the bath with a glass of wine, a new survey suggests.\nResearchers examined the general happiness of the nation and revealed on a day-to-day basis, the majority of Brits (60 per cent) claim to be happy with their lot – with 41 being pinpointed as the best year of our lives.\nAnd the study found the average British adult feels a true 'wave of happiness' eight times in a typical week.\nThe ultimate 'happy place' for those who took part in the research was snuggling up with a partner\nThe catalysts include sitting down to your mother's Sunday roast, taking off on the plane on the way to a sunny holiday and barbequing with friends in the garden.\nHowever the ultimate 'happy place' for those who took part in the research was snuggling up with a partner – with other happy places listed as reclining on the sofa with snacks, swimming in the sea and out enjoying drinks with friends.\nThe typical Brit rates themselves as a seven out of ten when it comes to overall happiness – with box set nights at home with the family, romantic evenings out with the other half and and soaking in the bath with a glass of wine among the list of happiest places to be.\nWalking the dog with the children and enjoying a shopping spree with a best friend also featured on the list – as did reading a book on a sunny beach, riding bikes with the kids and being on holiday with the family.\nThe poll of 1,500 adults by Butterkist popcorn found an old-fashioned sing-song in the car and attending summer music festivals with friends were also a tonic for many adults.\nMore than eight in ten respondents said they preferred their home comforts and would always choose a night in with loved ones over a raucous night out.\nHappiness expert Andy Cope said: 'These results are very telling – overall we Brits are fairly happy with life. However our happiness really peaks when we are spending quality time with those we love.\nThe catalysts include sitting down to your mother's Sunday roast, taking off on the plane on the way to a sunny holiday and barbequing with friends in the garden\n'In today's digital generation, there is a tendency to spend less real-time together, however it's vital we don't forget the importance of this – laughing and relaxing with those we love releases 'happy hormones' that significantly boost our general wellbeing.'\nMore than half of adults stated that friends and family were very important to their overall happiness and well-being with the average adult considering five people in their life to be very good friends.\nFamily, friends, hobbies and interests were all among the things that make Brits happy with family coming top for seven in ten adults, while only 16 per cent of those polled said work made them happy.\nA third of respondents said they would be happier if they had more time to spend with friends and family.","url":"https://www.dailymail.co.uk/news/article-4445910/We-truly-happy-eight-times-week.html"}
