{"authors":[],"date_download":"2018-10-22 21:40:59","date_modify":"2018-10-22 21:40:59","date_publish":"2017-03-16 01:53:22","description":"Africa will host a Commonwealth Games one day despite the blow of Durban being stripped of hosting the 2022 edition, David Grevemberg, the chief executive of...","filename":"data/vaneerConsumption/WeremaincommittedtoAfricasaysCommonwealthGameschief.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/01/wire-225769-1489629204-984_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4318624_We-remain-committed-Africa-says-Commonwealth-Games-chief_1540244459.html","title":"We remain committed to Africa, says Commonwealth Games chief","title_page":"We remain committed to Africa, says Commonwealth Games chief | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Liverpool, in north-west England, has expressed an interest in hosting the 2022 Commonwealth Games\nAfrica will host a Commonwealth Games one day despite the blow of Durban being stripped of hosting the 2022 edition, David Grevemberg, the chief executive of The Commonwealth Games Federation (CGF), told AFP.\nDurban lost the right to host the Games on Monday -- just 18 months after being awarded them -- when it failed to meet criteria laid down by the CGF, primarily over costs.\n\"I wouldn't want to make a judgement call,\" Grevemberg told AFP on the sidelines of a briefing by 2018 Games hosts Gold Coast on Wednesday.\n\"Durban has hosted some great events, it is a fantastic city and are wonderful warm hosts with bright ambitions and great aspirations.\n\"However, it takes more than a municipality, it takes a nation to really embrace something like this and to realise its full potential.\n\"Timing was one of the biggest issues and also some of the circumstances of what South Africa is facing right now we have to be respectful and cognisant of that.\"\nGrevemberg, who was chief executive of Glasgow for its successful hosting of the 2014 Games, said now was not the time to walk away from Africa.\n\"We should not diminish our support and desert them. Instead, we should continue to help them realise their potential and ambitions,\" he said.\n\"We remain fully supportive of and committed to a Games in Africa.\"\nGrevemberg, who succeeded in persuading Jamaican athletics legend Usain Bolt to compete in his first ever Commonwealth Games in Glasgow, would not commit either to a timeline for selecting the replacement for Durban as hosts or the names of cities that had declared an interest.\nLiverpool, Birmingham and 2002 hosts Manchester have declared an interest -- however Gold Coast will not throw their hat in to the ring despite the mayor saying they might.\n\"We would look pretty greedy to have them again in 2022,\" said Gold Coast chairman Peter Beattie.\n\"We are saying clearly we are not interested in 2022. It is against the spirit of the Games.\"\nGrevemberg said whichever city hosted it, the core principles of the CGF -- peace, sustainability and prosperity -- would apply.\n\"We will continue with the alternative host to uphold those principles.\n\"It is a different context but they are as relevant as they were to Kuala Lumpur (1998 hosts), to Glasgow, to Manchester and Melbourne (2006).\n\"Those principles played very well and I am very confident it resonates.\"\n- 'Gold Coast are a great platform' -\nGrevemberg said Gold Coast would be an ideal host to promote the ideals of the Commonwealth Games.\n\"Gold Coast are a great platform to tell about our ambitions,\" he said.\n\"The way we define peace it is by design not by accident, human rights and protection and promotion and recognising marginalised groups like LGBT, child safeguarding, protecting vulnerable people and safeguarding gender issues.\n\"The third strand is conflict resolution and fourthly reconciliation which all ties back to peacebuilding the theme for the Commonwealth this year.\n\"This journey is designed to using the Games for that impact. The Games are resonant and relevant.\"","url":"https://www.dailymail.co.uk/wires/afp/article-4318624/We-remain-committed-Africa-says-Commonwealth-Games-chief.html"}
