{"authors":["Nikki Schwab","U.S. Political Reporter For Dailymail.Com"],"date_download":"2018-10-23 02:18:41","date_modify":"2018-10-23 02:18:41","date_publish":"2017-03-16 12:49:53","description":"U.N. Ambassador Nikki Haley warned that the U.S. should take the Russian threat 'seriously' in her first interview since gaining the post.","filename":"data/vaneerConsumption/WeshouldnevertrustRussiasaysUNAmbNikkiHaley.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E54201800000578-0-image-a-7_1489668507847.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319984_We-never-trust-Russia-says-Amb-Nikki-Haley_1540261121.html","title":"'We should never trust Russia' says UN Amb. Nikki Haley","title_page":"'We should never trust Russia' says UN Amb. Nikki Haley | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"U.N. Ambassador Nikki Haley warned that the U.S. should take the Russian threat 'seriously' in her first interview since gaining the post.\n'We cannot trust Russia, we should never trust Russia,' she told NBC's Matt Lauer in an interview for the Today show, which happened on the heels of the Justice Department's announcement it was charging Russian intelligence officials for the 2014 Yahoo hack.\nHaley, however, noted that she didn't think much should be made of conversations between Russian Amb. Sergey Kislyak and President Trump's associates.\nScroll down for video\nU.N. Ambasador Nikki Haley sat down for an interview for the first time in her new post and talked about the U.S.'s relationship with Russia\nNikki Haley (right) told NBC's Matt Lauer (left) that, 'we should never trust Russia,' though she believed not much should be made of the Russian ambassador speaking to Trump associates\n'I really don't,' she said. 'And I'll tell you why.'\n'Because I've talked to him about it, and while they know of people, you've got to look at the fact that ambassadors' jobs are to talk to everyone, that's what I think we've seen the Russian ambassador do,' she continued.\n'At the same time, he's never once told me not to slam Russia,' she said of her now boss, President Trump. 'He's not once told me to go and be nice to Russia. He's letting me do my job.'\nHaley had always taken a more aggressive position against Russia than Trump, which she noted in the interview today.\n'I think he's very open about working with everyone, he doesn't want to cut anyone off,' he said of the president.\n'What he's allowed me to do is when I see something wrong I call them out on it, I will always do that, but at the same time, if I see an opportunity to work on something with them, like we do with ISIS and Daesh, we're going to do that,' she said.\nLauer wanted to know how the U.S. should proceed with Russia in light of the election hacking allegations.\n'I don't think we want anybody meddling in our elections, that's why these investigations are going to matter,' Haley stated.\n'We have to find out exactly how involved they were and we should never be OK with that,' the former South Carolina governor added.\n'We we see the facts we absolutely should have some kind of action we take in response for it,' she said.\nWhen Lauer asked her if she and the president were now seeing eye to eye on the Russian threat, she declined to go that far.\n'Now, I would not say that,' she said. 'I'm not going to talk about where the president is because I don't know.'\n'I have always made it clear from my confirmation to the words that I've said at the U.N. that I don't trust Russia,' she added.\nHaley was additionally asked if she supported the president's travel ban, which has since been knocked down by two federal judges.\n'Yes,' she replied. 'It's not a Muslim ban. I will never support a Muslim ban, I don't think we should ever ban anyone based on their religion.'\nLast night a federal judge in Hawaii suggested plaintiffs would likely be successful in making a case that the ban represents an Establishment Clause violation, as the original intent of the order was to ban Muslims.\nIt's unconstitutional to discriminate based on religion.\nHaley was asked about another hairy subject too, the president's so-far unproven claims that President Obama 'wire-tapped' Trump Tower in the run-up to the presidential election.\nAt first Haley said she wasn't going to comment 'on any of that,' but then added, 'He is our president Matt, and so what he does, faults and all, he's our president so I want him to be successful.'\nDuring last year's GOP primary, Haley threw her weight behind Florida Sen. Marco Rubio, and then endorsed Sen. Ted Cruz after Rubio dropped out.\nA week before the election she went on the record to say that she would be casting a vote for he party's nominee and then Trump tapped her for the U.N. job.\n'When these tweets come out, do I look at them and say, \"OK, where did that some from?\" Yes,' she admitted to Lauer.\n'But I don't pick up the phone and say, \"What are you doing?\" I just know that's who he is,' she added.","url":"https://www.dailymail.co.uk/news/article-4319984/We-never-trust-Russia-says-Amb-Nikki-Haley.html"}
