{"authors":[],"date_download":"2018-10-22 23:01:15","date_modify":"2018-10-22 23:01:15","date_publish":"2014-05-13 09:53:12","description":"Officials were at the scene of an accident at the Brody Mine in Boone County, W. Va., where two miners were killed Monday night.","filename":"data/vaneerConsumption/WestVirginiaCoalMineAccident2KilledAfterRoofFalls.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/439971/140513-w-va-mine-accident-jms-1541_6eba5349b7d5490f4307b68e67ef4b68.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_west-virginia-coal-mine-accident-2-killed-after-roof-falls-n103931_1540249275.html","title":"West Virginia Coal Mine Accident: 2 Killed After Roof Falls","title_page":"West Virginia Coal Mine Accident: 2 Killed After Roof Falls","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTwo miners were killed in a West Virginia coal mine after the roof collapsed Monday night, officials said.\nThe bodies of miners Eric Legg, 48, and Gary Hensley, 46, were recovered in the accident at the Brody Mine in Boone County, according to NBC affiliate WSAZ.\nOfficials said a \"coal outburst\" — which involved the violent spewing of rock and coal from the mine — led to \"ground failure\" around 8:30 p.m.\n\"Rescue efforts later determined that the miners did not survive,\" Brody Mining LLC said in a statement.\nState inspectors were at the scene, and the federal Mine Safety and Health Administration is conducting a full investigation.\nThe MSHA put Brody Mine on notice last year after a pattern of violations of mandatory health and safety standards.\nThe mine was cited for 253 violations during a nine-month period — actions that officials found could result in injury or illness for miners, the MSHA reported.\nThis year, the mine was cited for a preliminary 147 infractions — the most recent on May 7 regarding tethers used during evacuations for mine emergencies. Some of the violations have not yet been assessed and are pending hearings, appeals and other actions.\n— Jay Blackman, Alastair Jamieson and Christopher Nelson","url":"https://www.nbcnews.com/news/us-news/west-virginia-coal-mine-accident-2-killed-after-roof-falls-n103931"}
