{"authors":[],"date_download":"2018-10-22 22:42:52","date_modify":"2018-10-22 22:42:52","date_publish":"2014-05-12 16:02:47","description":"Two teams of scientists say the long-feared collapse of the West Antarctic Ice Sheet has begun, kicking off an \"unstoppable\" rise in sea levels.","filename":"data/vaneerConsumption/WestAntarcticIceSheetsCollapseTriggersSeaLevelWarning.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/436801/140512-thwaites-glacier-antartica-jsw-137p_408b60b022c49bfa4f5665b6e8772ceb.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_west-antarctic-ice-sheets-collapse-triggers-sea-level-warning-n103221_1540248172.html","title":"West Antarctic Ice Sheet's Collapse Triggers Sea Level Warning","title_page":"West Antarctic Ice Sheet's Collapse Triggers Sea Level Warning","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTwo teams of scientists say the long-feared collapse of the West Antarctic Ice Sheet has begun, kicking off what they say will be a centuries-long, \"unstoppable\" process that could raise sea levels by as much as 15 feet.\n\"There's been a lot of speculation about the stability of marine ice sheets, and many scientists suspected that this kind of behavior is under way,\" Ian Joughin, a glaciologist at the University of Washington in Seattle, said in a news release about one of the studies published Monday. \"This study provides a more qualitative idea of the rates at which the collapse could take place.\"\nThe findings from Joughin and his colleagues, appearing in the journal Science, indicate that in some places, Antarctica's Thwaites Glacier is losing tens of feet, or several meters, of ice elevation every year.\nThey estimate that Thwaites Glacier would probably disappear entirely in somewhere between 200 and 1,000 years. That loss would raise global sea levels by nearly 2 feet (60 centimeters). The glacier serves as a linchpin for the rest of the West Antarctic Ice sheet, which has enough frozen mass to cause another 10 to 13 feet (3 to 4 meters) of sea level rise.\nA second study, published in Geophysical Research Letters, reports the widespread retreat of Thwaites and other glaciers on the West Antarctic Ice Sheet — and says the retreat can't help but continue.\n\"It has passed the point of no return,\" the research team's leader, Eric Rignot of the University of California at Irvine, told reporters during a NASA teleconference on Monday. The second study projected that the glacial retreat in Antarctica's Amundsen Sea Embayment, which includes Thwaites Glacier, would result in 4 feet (1.2 meters) of sea level rise — and open the way to more widespread retreats.\nRignot's team based their findings on a detailed analysis of radar data from two European Earth Remote Sensing satelllites, ERS-1 and ERS-2. Joughin's team relied on radar maps primarily derived from an aerial NASA survey called Operation IceBridge.\nScientists have been warning for decades that the West Antarctic Ice Sheet was in peril due to climate change, and recent readings have shown that the region is warming more quickly than expected. The loss of ice that is floating on the seas surrounding the continent would not contribute significantly to sea level rise. However, losing the ice that's currently grounded on the continent would.\nA moment of 'wow'\nThe two studies released on Monday document the glaciers' retreat and project what's likely to happen in the future. \"We finally have hit this point where we have enough observations to put this all together, to say, 'Wow, we really are in this state.'\" NASA scientist Tom Wagner told reporters.\nThe key findings in both studies relate to what's happening to the \"grounding line\" for Antarctica's glaciers. That's the subsurface boundary between ice that is floating on the sea and ice that is anchored to land.\n\"The grounding line is buried under a thousand or more meters of ice, so it is incredibly challenging for a human observer on the ice sheet surface to figure out exactly where the transition is,\" Rignot explained in a NASA news release. “This analysis is best done using satellite techniques.\"\nThe radar readings from both teams show that the grounding line for some areas of the West Antarctic Ice Sheet has retreated by as much as 20 miles (37 kilometers) over the past couple of decades, apparently due to the interaction with warmer seas. The main worry is that there appears to be no submerged hill or mountain that could slow down further retreat.\nRignot said that means the glacial retreat has triggered a process of \"positive feedback.\"\n\"We feel that this is at the point where even if the ocean is not providing additional heat, the system is in a chain reaction that is unstoppable,\" he told reporters.\nJoughin said computer models produce a wide range of scenarios for the collapse of Thwaites Glacier. Some scenarios suggest that the glacier could last more than a millennium longer, but the most likely scenarios predict that rapid collapse would occur somewhere between 200 and 500 years from now.\nWhat lies ahead\nHigher greenhouse-gas emissions would lead to faster ice loss, and lower emissions could slow down the meltdown. But in any case, the loss of Thwaites Glacier appears inevitable, Joughin said: \"All of our simulations show it will retreat at less than a millimeter of sea level rise per year for a couple of hundred years, and then, boom, it just starts to really go.\"\nIn its most recent assessment, the Intergovernmental Panel on Climate Change estimated that global sea levels were likely to rise between 4 inches and 3 feet (10 to 90 centimeters) by the year 2100. Sridhar Anandakrishnan, a geoscientist at Penn State University who didn't play a role in either study, said future IPCC estimates \"will almost certainly be revised, and revised upwards.\"\n\"The IPCC projections don't really include Antarctic contributions to any great measure,\" he told reporters. \"The results are just now starting to come together.\"\nAnandakrishnan said future middle-of-the-road estimates for 2100 may well zero in on the top end of the current IPCC projection, around 3 feet. Without mitigating measures, that amount of sea level rise would inundate significant areas of coastal cities including Miami Beach, New Orleans and New York.","url":"https://www.nbcnews.com/science/environment/west-antarctic-ice-sheets-collapse-triggers-sea-level-warning-n103221"}
