{"authors":[],"date_download":"2018-10-22 20:45:46","date_modify":"2018-10-22 20:45:46","date_publish":"2014-05-03 08:08:10","description":"12 Western military observers were freed in Ukraine after a week in captivity, the OSCE said.","filename":"data/vaneerConsumption/WesternObserversFreedbyProRussiansinSlovyanskOSCE.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_18/417901/140503-world-ukraine-generic-cover-hostages-420a_de33ea87571ec956262a4e97b8790347.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_western-observers-freed-pro-russians-slovyansk-osce-n96221_1540241146.html","title":"Western Observers Freed by Pro-Russians in Slovyansk: OSCE","title_page":"Western Observers Freed by Pro-Russians in Slovyansk: OSCE","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nEuropean military observers held by pro-Russian separatists in Ukraine have been released, the organization they belong to said early Saturday.\nAll 12 being held hostage were freed in the town of Slovyansk, RIA Novosti reported.\nIt came hours after President Barack Obama warned Russia that it must help free the observers, calling their detention “inexcusable” and “disgraceful.”\nAn Associated Press reporter on Saturday saw one of the observers, German Col. Axel Schneider, and his Ukrainian translator walk free.\nInsurgent leader Vyacheslav Ponomarev told The AP that all seven observers and their five Ukrainian assistants – members of the Organization for Security and Cooperation in Europe – were free.\nThe OSCE Special Monitoring Mission is “pleased to have been able to assist the Ukrainian authorities in the efforts that led to their release,” OSCE Chief Monitor in Ukraine Ertugrul Apakan Kyiv said in a statement.\nInsurgents in Slovyansk, the epicenter of the current crisis in eastern Ukraine, seized the observer team on April 25.\nOSCE Chairperson-in-Office and Swiss Foreign Minister Didier Burkhalter called for de-escalation of the unrest in Ukraine.\nBurkhalter “confirmed his readiness to make use of high level contacts to give new impetus to the implementation of the Geneva Statement,” Saturday’s OSCE statement read.\nRussian President Vladimir Putin said Friday that the U.S.-backed peace deal had surpassed its “final hope” after Ukraine’s forces launched an attack on pro-Russia separatists.\n— Alastair Jamieson and Elisha Fieldstadt","url":"https://www.nbcnews.com/storyline/ukraine-crisis/western-observers-freed-pro-russians-slovyansk-osce-n96221"}
