{"authors":["Nick Mashiter","Press Association Sport"],"date_download":"2018-10-23 03:36:00","date_modify":"2018-10-23 03:36:00","date_publish":"2017-04-26 15:04:36","description":"West Brom captain Darren Fletcher is ready to put contract talks on hold until the summer - he has triggered a one-year extension but is yet to sign it and his deal expires at the season's end.","filename":"data/vaneerConsumption/WestBromcaptainDarrenFletchertoshelvecontracttalks.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3F9FADD000000578-0-image-a-27_1493215407980.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447916_West-Brom-captain-Darren-Fletcher-shelve-contract-talks_1540265760.html","title":"West Brom captain Darren Fletcher to shelve contract talks","title_page":"West Brom captain Darren Fletcher to shelve contract talks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"West Brom captain Darren Fletcher is ready to put contract talks on hold until the summer.\nThe midfielder has triggered a one-year extension but is yet to sign it and his current deal expires at the end of the season.\nThe ex-Manchester United man activated the option in his favour based on appearances after playing against Southampton on New Year's Eve.\nWest Brom's Darren Fletcher described his contract situation at the Hawthorns as 'weird'\nBut Fletcher is prepared to wait until the season ends next month to have further talks with the Baggies about his future.\n'It probably is (a conversation for the summer),' he told the Albion Express & Star.\n'It's a weird situation the fact it's been triggered and it's my option. I'm not sure quite how that managed to be.\n'Probably when you sign at the last minute of a transfer window these things happen that way. There's no issue, I just want to finish the season and keep playing.'\nFletcher has made 92 appearances for West Brom since joining from Manchester United\nFletcher has made 92 appearances for the Baggies - starting all 86 Premier League games - after signing a two-and-a-half year deal from United in February 2015.\nBoss Tony Pulis wants to keep the Scotland international and expects a deal to be done, with Fletcher relaxed on his future.\n'That's the way it is really. I'm sure It will be sorted sooner rather than later,' Fletcher added.\n'I'm completely relaxed about it and I think the club is completely relaxed about it.\n'There's no real panic. From my point of view it's a completely relaxed situation. There's nothing really going on. It's just the way it is.'","url":"https://www.dailymail.co.uk/sport/football/article-4447916/West-Brom-captain-Darren-Fletcher-shelve-contract-talks.html"}
