{"authors":["Sam Cunningham For Mailonline"],"date_download":"2018-10-23 03:45:14","date_modify":"2018-10-23 03:45:14","date_publish":"2016-01-11 16:32:33","description":"Slaven Bilic has revealed that West Ham have dropped their interest in Queens Park Rangers striker Charlie Austin after exploring the possibility of signing him in the summer.","filename":"data/vaneerConsumption/WestHamnotinterestedinQPRsCharlieAustinSlavenBilicconfirms.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/1070D6D300000514-0-image-a-12_1452529889109.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3394209_West-Ham-not-interested-signing-QPR-striker-Charlie-Austin-Slaven-Bilic-confirms_1540266314.html","title":"West Ham not interested in QPR's Charlie Austin, Slaven Bilic confirms","title_page":"West Ham not interested in QPR's Charlie Austin, Slaven Bilic confirms | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Slaven Bilic has revealed that West Ham have dropped their interest in Charlie Austin after exploring the possibility of signing him in the summer.\nWest Ham were looking to bolster their attacking options and signed five players in the last window to continue their rise up the table in anticipation of moving into the Olympic Stadium.\nDimitri Payet, Nikica Jelavic and Michail Antonio made permanent transfers while Victor Moses and Manuel Lanzini joined on loan. During that time, West Ham were working on a deal to bring in Austin.\nCharlie Austin is no longer a player of interest for West Ham, manager Slaven Bilic confirmed on Monday\nQPR striker Austin was a reported target for the Hammers in the summer but a move never came to fruition\nThe potential of that move happening was virtually destroyed, however, when co-chairman David Sullivan dismissed the idea of signing him because ‘he has no ligaments in his knee.’\nAustin, 26, described it as an ‘outrageous slur.’ And Bilic admitted that he is no longer a target.\n‘He was linked with many clubs when he got relegated with Queens Park Rangers,’ he said. ‘We were among those clubs in the summer but we chose other options. We’re not looking at that option.’\nAustin’s 18 Premier League goals, which earned him an England call-up, made him one of the summer’s hottest prospects, but he eventually stayed at QPR to play in the Championship. He looks set to stay there until the end of the season, when he will move on.\nBilic says the club was looking at Austin in a bid to bolster their attack but that it is no longer the case","url":"https://www.dailymail.co.uk/sport/football/article-3394209/West-Ham-not-interested-signing-QPR-striker-Charlie-Austin-Slaven-Bilic-confirms.html"}
