{"authors":["Press Association"],"date_download":"2018-10-23 04:25:35","date_modify":"2018-10-23 04:25:35","date_publish":"2016-01-28 20:24:51","description":"Saido Berahino is set to stay at West Brom, with the Baggies unwilling to sell this month. Tottenham and Newcastle are interested in the striker, but Albion ...","filename":"data/vaneerConsumption/Westbromstrikersaidoberahinogoingnowhereinjanuary.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-07e4492f-6bf2-45d0-8361-a4e235c19735-2vdWmEltwXfba0ce28e632c6c17b-358_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420958_West-Brom-striker-Saido-Berahino-going-January_1540268735.html","title":"West brom striker saido berahino going nowhere in january","title_page":"West brom striker saido berahino going nowhere in january | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"West Brom striker Saido Berahino going nowhere in January\nSaido Berahino is set to stay at West Brom, with the Baggies unwilling to sell this month.\nTottenham and Newcastle are interested in the striker, but Albion have no intention of cashing in before Monday's transfer deadline, Press Association Sport understands.\nThey rejected four bids from Spurs in the summer - which led to Berahino threatening to strike - but have not received any offers during the January window.\nSaido Berahino has scored four goals in 19 games for West Brom this season\nTottenham's offers would have been paid in instalments, with their final bid rising to £23million, and their approach strained the relationship between the clubs, although any differences have since been patched up.\nAlbion chairman Jeremy Peace has been bullish in his stance over Berahino, with no club getting close to his valuation of the 22-year-old, and with just days left of the January transfer window it is understood the Baggies do not expect to receive an acceptable offer.\nThe England Under-21 international has scored four goals in 19 games this term - and has not started a match since October - after netting 20 times last season.\nLast month head coach Tony Pulis said Berahino was lucky to be included in the squad for their 1-0 win over Newcastle because of behind-the-scenes issues, with the forward's time-keeping understood to be a problem.\nBerahino will have one year left on his contract in the summer, yet Peace would still then only entertain sizeable offers.\nThe Baggies revealed they spent £36million in the summer and will only sign new players - likely to be on loan - if they are able to move others out.\nJames Chester was an £8million recruit from Hull but the defender has played just seven times, making only one Barclays Premier League start.\nCristian Gamboa and Sebastien Pocognoli will also be allowed to leave if the club can find buyers, while Serge Gnabry's season-long loan from Arsenal is still yet to be officially cancelled.","url":"https://www.dailymail.co.uk/wires/pa/article-3420958/West-Brom-striker-Saido-Berahino-going-January.html"}
