{"authors":["Jennifer Russell For Daily Mail Australia","Australian Associated Press"],"date_download":"2018-10-22 21:41:45","date_modify":"2018-10-22 21:41:45","date_publish":"2016-01-11 01:29:09","description":"Heroic firefighters are pictured lying exhausted in the middle of a football field after risking their own lives tackling a 'demon' bushfire in Western Australia.","filename":"data/vaneerConsumption/WesternAustralianfirefightersrestinafieldafterbushfirefight.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001D43900000578-0-image-a-68_1452475674871.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393104_Exhausted-firefighters-collapse-football-field-fighting-demon-Western-Australia-bushfire-killed-two-people-burned-70-000-hectares_1540244505.html","title":"Western Australian firefighters rest in a field after bushfire fight","title_page":"Western Australian firefighters rest in a field after bushfire fight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Heroic firefighters have been pictured lying exhausted in the middle of a football field after risking their own lives tackling a 'demon' bushfire in Western Australia.\nThe image shows three courageous volunteers taking a well deserved rest from fighting the blaze at Waroona, 110km south of Perth.\nThe Department of Fire and Emergency Services says the fire, which has burned more than 70,000 hectares and killed two people, has raged the towns of Waroona, Yarloop and Cookernup since it was sparked by lightning on Wednesday morning.\nFour firefighters have been injured, while a NSW contingent, including 60 firefighters, is now assisting fatigued local crews.\nHeroic firefighters have been pictured lying exhausted in the middle of a football field after risking their own lives tackling a 'demon' bushfire in Waroona, Western Australia\nFour firefighters have been injured, while a NSW contingent, including 60 firefighters, is now assisting fatigued local crews\nThe Department of Fire and Emergency Services says the fire, which has burned more than 70,000 hectares, has raged since it was sparked by lightning on Wednesday morning\nA fireman damping down fires near Waroona, south of Perth on Monday\nA major bushfire in western Australia destroyed nearly 100 homes and left 3 people unaccounted for as it tore through a small rural town south of Perth, emergency officials said on Friday\nA picture made available by NASA shows a natural-colour image acquired by NASA's Suomi NPP satellite, of bushfires over south west Australia\nWeather conditions are now easing which is helping the crew battle the bushfire, which is now contained but not controlled.\nAn emergency warning in place for east of Waroona, Hamel, Yarloop and surrounding areas was downgraded on Monday morning to watch and act.\nFavourable conditions also saw the alert level drop to advice for Preston Beach and Lake Clifton including the Waroona townsite.\nFavourable conditions also saw the alert level drop to advice for Preston Beach and Lake Clifton including the Waroona townsite\nWeather conditions are now easing which is helping the crew battle the bushfire, which is now contained but not controlled\nA fireman inspecting the damage near Waroona, some 110 kilometres south of Perth\nVolunteers who battled to save Yarloop have used social media to defend themselves from criticism that residents were not adequately warned of the danger\nAn advice alert remains in place for Pamelup Estate to Binningup townsite including the townsite of Myalup.\nVolunteers who battled to save Yarloop have used social media to defend themselves from criticism that residents were not adequately warned of the danger.\n'We were left by the hierarchy to defend our town on our (own), unfortunately we lost,' the brigade posted on Facebook.\n'To those of you who want to whinge that we weren't there, be thankful you have a house left, I and most of my fellow firies and townspeople don't.'\nThe cost of deadly bushfires in Western Australia's southwest has hit $60 million with insurers saying the figure is expected to rise.\nThe Insurance Council of Australia says several hundred calls have been made to insurers following the bushfires.\n'Insured losses are now estimated at $60 million and are continuing to rise. More detailed figures will be released later in the week,' Insurance Council of Australia said in a statement on Monday.\nThe small township of Yarloop, which is located about 120 kilometres south of Perth, was decimated with 95 homes lost following an unpredictable bushfire","url":"https://www.dailymail.co.uk/news/article-3393104/Exhausted-firefighters-collapse-football-field-fighting-demon-Western-Australia-bushfire-killed-two-people-burned-70-000-hectares.html"}
