{"authors":[],"date_download":"2018-10-23 00:29:50","date_modify":"2018-10-23 00:29:50","date_publish":"2017-03-10 07:13:10","description":"Russell Westbrook moved into a tie with Wilt Chamberlain on the regular season triple double list as the Oklahoma City Thunder shut down the San Antonio...","filename":"data/vaneerConsumption/WestbrooksThunderstopSpurswinningstreak.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/07/wire-194509-1489129993-452_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300224_Westbrooks-Thunder-stop-Spurs-winning-streak_1540254590.html","title":"Westbrook's Thunder stop Spurs' winning streak","title_page":"Westbrook's Thunder stop Spurs' winning streak | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Russell Westbrook of the Oklahoma City Thunder recorded his 31st triple double against San Antonio to tie for the second-most triple doubles in a NBA season\nRussell Westbrook moved into a tie with Wilt Chamberlain on the regular season triple double list as the Oklahoma City Thunder shut down the San Antonio Spurs with a 102-92 victory on Thursday.\nWestbrook recorded his 31st triple double to tie Chamberlain for the second-most triple doubles in a NBA season and he did it against the red-hot Spurs who are one of the top seeds in the Western Conference.\n\"It is a blessing,\" said Westbrook, who tallied 23 points, 13 assists and 13 rebounds. \"I try to play at a high level. Whenever you mention guys like that I don't take it for granted.\"\nWestbrook said his priority is winning and not setting records.\n\"My job is to make sure we come out with a win,\" he said.\nVictor Oladipo scored 20 points on eight-of-14 shooting from the field in his second game back since missing six contests with back spasms. Enes Kanter came off the bench to score 14 points and 10 rebounds as the Thunder snapped a four-game losing streak.\n\"I thought we did a good job, especially defensively,\" Westbrook said. \"Making an impact on the ball for 48 minutes, it was good.\n\"It means that were on the right track. Obviously throughout the season there are times you go through adversity. The strongest teams stick together through adversity. Tonight was one of those nights when we stuck together.\"\nThunder coach Billy Donovan praised Westbrook for leading by example.\n\"He says he plays every game like it's the last game of his career,\" Donovan said. \"I really, really admire that and respect that. Because tomorrow is not promised. He is just focused on right now. What do I have to do right now to help the team right now in this moment.\"\nKawhi Leonard tallied 19 points, Pau Gasol scored 18 points for the Spurs, who saw their nine-game win streak come to a halt.\n- Leonard held in check -\nThe Thunder held Leonard to just two rebounds and two assists. He sat out the entire fourth quarter after being hit in the mouth. The Spurs will need him on Saturday when they take on the Golden State Warriors.\nElsewhere, Reggie Jackson scored 21 points and the Detroit Pistons overcame LeBron James' 50th career triple-double with a 106-101 win over the Cleveland Cavaliers.\nAndre Drummond finished with 20 points and 16 rebounds and Kentavious Caldwell-Pope and Tobias Harris had 15 points apiece for the Pistons, who have won three of their last four contests.\nMarcus Morris and Ish Smith each added 12 points for Detroit, who outscored Cleveland 33-21 in the fourth quarter.\nJames earned 29 points, 13 rebounds and 10 assists. Kyrie Irving tallied 27 points and Channing Frye had 15, all from beyond the arc. James had seven baskets off dunks.\n\"In order for us to be great, we've got to be good all across the board,\" Irving said.\nJ.R. Smith came off the bench after missing the previous 36 games with a broken thumb. He was one of nine from the field.\nIn Memphis, Austin Rivers scored 20 points, Chris Paul added 19, J.J. Redick had 15 and Blake Griffin posted a double-double with 14 points and 12 rebounds to lead the Los Angeles Clippers to a 114-89 win over the Memphis Grizzlies at FedExForum.","url":"https://www.dailymail.co.uk/wires/afp/article-4300224/Westbrooks-Thunder-stop-Spurs-winning-streak.html"}
