{"authors":["Sportsmail Reporter"],"date_download":"2018-10-23 00:31:45","date_modify":"2018-10-23 00:31:45","date_publish":"2016-01-29 13:31:08","description":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats.","filename":"data/vaneerConsumption/WestBromvsPeterboroughTeamnewskickofftimeprobablylineupsoddsandstatsfortheFACupclash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B1CB4D00000578-0-image-a-6_1454073714551.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422782_West-Brom-vs-Peterborough-Team-news-kick-time-probably-line-ups-odds-stats-FA-Cup-clash_1540254705.html","title":"West Brom vs Peterborough: Team news, kick-off time, probably line-ups, odds and stats for the FA Cup clash","title_page":"West Brom vs Peterborough: Team news, kick-off time, probably line-ups, odds and stats for the FA Cup clash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats. Here is all the information you need for West Brom's clash with Peterborough United.\nTeam news\nWest Brom\nCallum McManaman will be out for up to six weeks after the West Brom winger suffered ankle ligament damage.\nThe 24-year-old could miss at least six games, starting with Saturday's FA Cup visit of Peterborough, while James Morrison (hamstring) is out with Darren Fletcher (knee) and Chris Brunt (calf) doubts.\nThe Baggies needed to register Sandro by 12pm if the midfielder is to play with the club aiming to sign the Brazil international from QPR on loan for the rest of the season.\nProvisional squad: Foster, Myhill, Dawson, Chester, Gamboa, McAuley, Olsson, Evans, Brunt, Pocognoli, Yacob, Gardner, Fletcher, McClean, Sessegnon, Berahino, Lambert, Anichebe, Rondon.\nWest Brom need to register Sandro by 12pm if the midfielder is to play against Peterborough\nPeterborough\nMichael Bostwick could play for Peterborough after playing 45 minutes in a reserve game in midweek, but Harry Tofolo will miss out following his head injury on Tuesday.\nJermaine Anderson, Joe Gormley and Gabriel Zakuani are ruled out with injury, while Aaron Williams and Callum Chettle are cup-tied. Adil Nabi can't play following an agreement with West Brom after his transfer.\nProvisional squad: Alnwick, Smith, Ntlhe, Brisley, Baldwin, Taylor, Bostwick, Oztumer, Maddison, Santos, Beautyman, Fox, Anderson, Adebayo-Rowling, Lopes, Angol, Henry, Coulibaly, Maslen-Jones, Collison, Forrester, Moore, Samuelsen, Wilson, Coulthirst, Toffolo.\nGraham Westley will take his Peterborough side to face West Brom in the FA Cup fourth round\nKey match stats (supplied by Opta)\nWEST BROM v PETERBOROUGH Kick-off: Saturday, 3pm Odds (subject to change): West Brom: 4/6 Draw: 3/1 Peterborough: 5/1 Referee: Kevin Friend Managers: Tony Pulis (West Brom), Graham Westley (Peterborough)\nThe Baggies have won two of their three FA Cup meetings with Peterborough (D1), including a fourth round tie at London Road in 2008 en route to the semi-final.\nThey also met a year later in the third round, with the Posh earning a draw at The Hawthorns but losing 2-0 at home in the replay.\nThat defeat in 2008 was the last time Peterborough reached the fourth round of the FA Cup. They haven’t progressed past this stage since 1986.\nWest Brom are unbeaten in their last 11 FA Cup home games against sides from a lower league (W7 D4).\nPeterborough have scored seven goals and conceded none in their three FA Cup matches so far in 2015-16.\nSaido Berahino has scored six goals and assisted four more in his last five FA Cup appearances.","url":"https://www.dailymail.co.uk/sport/football/article-3422782/West-Brom-vs-Peterborough-Team-news-kick-time-probably-line-ups-odds-stats-FA-Cup-clash.html"}
