{"authors":["Phil Medlicott","Press Association Sport"],"date_download":"2018-10-23 03:43:56","date_modify":"2018-10-23 03:43:56","date_publish":"2017-03-10 13:25:08","description":"West Brom boss Tony Pulis is set to enter talks with the club over another contract extension but has stressed there is 'no rush'. Pulis signed a one-year extension in October that runs to 2018.","filename":"data/vaneerConsumption/WestBrombossTonyPulisinnorushtosignnewdeal.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3DF39C1900000578-0-image-a-175_1489151879373.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301236_West-Brom-boss-Tony-Pulis-no-rush-sign-new-deal_1540266236.html","title":"West Brom boss Tony Pulis in 'no rush' to sign new deal","title_page":"West Brom boss Tony Pulis in 'no rush' to sign new deal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"West Brom boss Tony Pulis is set to enter talks with the club over another contract extension but has stressed there is 'no rush'.\nPulis, whose side are currently eighth in the Premier League, signed a one-year extension in October that runs to 2018.\nOn the prospect of another new deal for the 59-year-old, Baggies chairman John Williams said last month: 'It would be (a) recommendation to my colleagues in China (West Brom's owners) that... I would be more than happy to see his contract extended.'\nTony Pulis has eased concerns over his WBA future saying there is 'no rush' over a new deal\nWest Brom have reached 40 points and lost in their previous game at home to Crystal Palace\nAnd when asked ahead of Saturday's league trip to Everton if he was ready to talk to Williams about that, Pulis said: 'Yes, I'll sit down with John and we'll have a chat.\n'He's coming up to Everton this weekend, so we'll sit down and have a chat. But there's no rush.\n'There's no problems in anything we do here. John keeps me in touch with what the Chinese owners are thinking. I think they talk two or three times a week. So there is good communication between them.\n'And I think Mr Lai (club owner Guochuan Lai) is actually over for the Arsenal game (on March 18) as well, and all the Chinese contingent.'\nWest Bromwich Albion chairman John Williams (left) will discuss Pulis' future with him\nWest Brom were beaten 2-0 at home by Pulis' old club Crystal Palace last time out but that was their first defeat in six league games.\nThey are on 40 points from 27 matches going into the clash with seventh-placed Everton, who are four points better off.\nAnd Pulis' men are aiming this term to improve on the club's best-ever Premier League season, the 2012-13 campaign that saw them finish eighth with 49 points.\nTheir cause that year was helped by 17 goals from Romelu Lukaku, the striker they had on loan from Chelsea who is on fire at the moment for Everton.\nThe Baggies have struggled to keep clean sheets on the road and face Everton on Saturday\nLukaku has nine goals in his last nine appearances in all competitions, has netted 18 times in total in the league this season, and recently scored four in one match against Bournemouth.\nPulis said of the 23-year-old Belgian: 'He's got everything. He's got power and pace and can cause people problems from all areas.\n'He can run at you, take you on and beat you and score. He can score off crosses, and he's instinctive in the box. He's one of the top strikers in the Premier League.'\nRomelu Lukaku is fresh from becoming Everton's all-time Premier League top goalscorer\nAlong with the form of Lukaku, the confidence of West Brom striker Salomon Rondon is also a concern for Pulis.\nRondon has netted seven times this season, but not at all in his last 12 games. Pulis admits the Venezuelan needs a goal of any kind just to boost his confidence.\n'The big thing with strikers is confidence, and we're just hoping and praying one comes off his knee and goes in,' Pulis said.\n'That will wipe away everything that has gone before and hopefully he'll go on and score some goals.'\nPulis is fully aware of the threat Lukaku will pose his side at Goodison Park on Saturday","url":"https://www.dailymail.co.uk/sport/football/article-4301236/West-Brom-boss-Tony-Pulis-no-rush-sign-new-deal.html"}
