{"authors":["Sami Mokbel For Mailonline"],"date_download":"2018-10-22 23:57:09","date_modify":"2018-10-22 23:57:09","date_publish":"2016-01-28 13:16:53","description":"West Ham United rookie Reece Oxford is set for a loan move to Charlton Athletic. The youngster wants regular first-team football and is poised for a move across London.","filename":"data/vaneerConsumption/WestHamUnitedsReeceOxfordsetforloanmovetoCharltonAthletic.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/306DFFB300000578-0-image-a-43_1453986406828.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420960_West-Ham-United-whizzkid-Reece-Oxford-set-loan-Jose-Riga-s-Championship-strugglers-Charlton-Athletic_1540252629.html","title":"West Ham United's Reece Oxford set for loan move to Charlton Athletic","title_page":"West Ham United's Reece Oxford set for loan move to Charlton Athletic | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"West Ham United rookie Reece Oxford is set for a loan move to Charlton Athletic.\nThe youngster wants regular first-team football and is poised for a move across London.\nOxford, 17, started the club’s first two Premier League games, but has made just three substitute appearances since.\nWest Ham United's 17-year-old rookie Reece Oxford (centre) is set for a loan move to Charlton Athletic\nOxford (second left) tries to win the ball during a training drill with his Irons team-mates earlier this month\nThe teenager, who can play in midfield and defence, is viewed as one of the brightest talents in English football.\nCharlton travel to the New York Stadium to take on Neil Redfearn's Rotherham United in the Championship on Saturday.\nJose Riga's Addicks sit in 23rd position in the Championship table with 21 points from 28 games played - one more than bottom side Bolton Wanderers.","url":"https://www.dailymail.co.uk/sport/football/article-3420960/West-Ham-United-whizzkid-Reece-Oxford-set-loan-Jose-Riga-s-Championship-strugglers-Charlton-Athletic.html"}
