{"authors":["William Bigelow"],"date_download":"2018-10-30 18:19:31","date_modify":"2018-10-30 18:19:31","date_publish":"2015-11-25 03:22:59","description":"On Tuesday, Western Washington University cancelled classes due to media posts that President Bruce Shepard called \"hate speech.\"","filename":"data/vaneerConsumption/WesternWashingtonUniversityCancelsClassesDuetoHateSpeech.json","image_url":"https://media.breitbart.com/media/2015/11/students-at-western-washington-university-campus-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_24__1540923571.html","title":"Western Washington University Cancels Classes Due to 'Hate Speech'","title_page":"Western Washington University Cancels Classes Due to 'Hate Speech' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Tuesday, Western Washington University (WWU) called off its classes on its main campus in Bellingham, WA, due to media posts that President Bruce Shepard called “hate speech targeted at Western students of color.”\nAlthough Shepard acknowledged that law enforcement assured him there was “no threat to general campus safety,” he proclaimed, “I trust you stand with me on this: a threat to any one of us is an attack on all of us.”\nShepard added, “We do not know if the perpetrators are Western students… We are not talking the merely insulting, rude, offensive commentary that trolls and various other lowlifes seem free to spew, willy nilly, although there has been plenty of that, too. No, this was hate speech.”\nAccording to the Daily Nonpareil, “A series of threats against minorities were posted over the weekend on Yik Yak, an anonymous social media platform popular among college students. The posts mentioned almost every ethnic group, including blacks, Muslims, Jews and American Indians, blaming them for an effort on campus to debate changing the university’s mascot, a Viking.”\nShepard announced, “We need time to press the criminal investigation and to plan how, as a campus, we will come together to demonstrate our outrage, to listen to each other, and to support each other. So, I have decided to cancel classes today in order to provide that time. Have no doubt: this is not a capitulation to those I described as trolls and lowlifes. We are going after them.”\nLast week, WWU’s Black Student Union’s Facebook page called for a meeting to discuss “a pivotal movement regarding the survival of Students of Color and their retention and well-being on this campus,” adding, “We have reached a point where this issue MUST move beyond dialogue and further into action if we truly want this space to be created.”\nAbout 25 percent of WWU’s 15,000 students are “students of color.”","url":"https://www.breitbart.com/politics/2015/11/24/western-washington-university-cancels-classes-due-hate-speech/"}
