{"authors":["Thomas Colson"],"date_download":"2018-10-30 22:58:30","date_modify":"2018-10-30 22:58:30","date_publish":"2016-12-09 00:00:00","description":"Tim Martin drew parallels between the EU and 'totalitarian regimes' of the 20th century which were responsible for 'economic mayhem, poverty, and bloodshed.'","filename":"data/vaneerConsumption/WetherspoonsproBrexitchairmanTimMartinOnRemainEUdemocracyBrexiteffect.json","image_url":"https://amp.businessinsider.com/images/584a9953dd0895bc548b4600-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_wetherspoons-pro-brexit-chairman-tim-martin-on-remain-eu-democracy-brexit-effect-2016-12_1540940310.html","title":"Wetherspoon's pro-Brexit chairman Tim Martin: On Remain, EU, democracy, Brexit effect","title_page":"    Wetherspoon's pro-Brexit chairman Tim Martin: On Remain, EU, democracy, Brexit effect - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Tim Martin, the Chairman of JD Wetherspoon. JD Wetherspoons LONDON — The chairman of one of Britain's largest pub chains and one of the most vocal business leaders on the Leave campaign launched another scathing attack on the European Union and those who back staying within the 28-nation bloc.\nTim Martin, chairman at JD Wetherspoon, called Remain voters \"the mouthy few\" and said that \"non-democrats\" were trying to \"subvert the referendum result\" in the winter edition of the giant pub chain's quarterly company magazine.\nMartin drew parallels between the EU and \"undemocratic and totalitarian regimes\" of the 20th century which were responsible for \"economic mayhem, poverty, and bloodshed.\"\n\"Democracy is economic steroids, yet, for all its faults, it also creates far higher levels of freedom and human rights than undemocratic regimes. So, why would anyone want to reduce the level of democracy in Europe? That's the big question for UK and European citizens today,\" he wrote.\nHe said the \"current battle for democracy has echoes of similar battles in previous centuries,\" and suggested that the \"economic chaos\" in southern Europe was the result of the EU's \"democratic unaccountability.\"\nThe current battle for democracy has echoes of similar battles in previous centuries\n\"The fascinating question is why these highly educated people are so intent on remaining part of an undemocratic and economically chaotic organisation.\"\nMartin also drew fresh parallels between Wetherspoon and the EU when he suggested that the EU's accounts had gone unaudited for 20 years (a claim which is partially true).\n\"Just imagine the justified furore, if a company like Wetherspoon went even one year without audited accounts — yet the EU gets away with 20 years ... 'the insolence of office,' as Shakespeare termed this sort of arrogant behaviour,\" he said in his article.\nThe Wetherspoon's founder gained prominence in the run-up to the June vote on EU membership, when he printed 200,000 pro-Leave beer mats to be distributed throughout his pubs, and suggested that post-Brexit Britain would not need to strike a trade deal with the EU because his pubs do not sign deals with suppliers.\nAccording to his latest opinion piece, he has not changed his mind despite the result of the Brexit vote already affecting the pub chain's financial results.\nMartin admitted in November that the company will face \"higher costs\" for the rest of the year, but did not explicitly say that the increase was the result of the collapse in the pound's value since June. He instead opted to criticise the \"bullying approach\" of EU officials.\nHere is the stock price has performed since November, when the firm released its first-set of post-referendum sales figures. The chart is accurate as of 10:10 a.m. GMT (5.10 a.m. E.T.) on Friday:","url":"https://www.businessinsider.com/wetherspoons-pro-brexit-chairman-tim-martin-on-remain-eu-democracy-brexit-effect-2016-12"}
