{"authors":["Shea Simmons"],"date_download":"2018-10-31 01:42:28","date_modify":"2018-10-31 01:42:28","date_publish":"2018-09-14 17:02:37","description":"The beauty world is full of oddities. From glitter poop to green shifting lipsticks, there's no shortage of the strange. Now, Wet N' Wild's color changing blush is going to have you tripping out this Halloween, but in a really awesome sort of way.…","filename":"data/vaneerConsumption/WetNWildsZombieBlushChangesColorFromBlackToPinkItsSOTrippy.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/04e30c21-4505-4d33-906a-5209d0d5d7ef-screen-shot-2018-09-14-at-115132-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_wet-n-wilds-zombie-blush-changes-color-from-black-to-pink-its-so-trippy-11920200_1540950148.html","title":"Wet N' Wild's Zombie Blush Changes Color From Black To Pink & It's SO Trippy","title_page":"Wet N' Wild's Zombie Blush Changes Color From Black To Pink & It's SO Trippy","title_rss":"NULL","source_domain":"bustle.com","text":"The beauty world is full of oddities. From glitter poop to green shifting lipsticks, there's no shortage of the strange. Now, Wet N' Wild's color changing blush is going to have you tripping out this Halloween, but in a really awesome sort of way.\nFor the upcoming spooky holiday, Wet N' Wild has launched an entire 80 piece collection dedicated to helping their fans get affordable Halloween looks. From paint palettes to IRL makeup like highlighters and lipsticks, the brand's Fantasy Makers launch has more than enough goodies for you to get your spooky looks together.\nOne of the items, however, is particularly intriguing because it's a black blush. Yes, really. The product is a color shifting blush product, but inside the pan, the blush appears to be a reflective black-green shade that would definitely not be blush for anyone, except for maybe a zombie. That's probably why it's called Zombie Blush.\nSo, does the new creation from Wet N' Wild work? YouTube beauty guru RachhLoves tested out the new collection from the brand, and the blush seemed to boggle her mind just as much as it might confuse yours. As it turns out, though, this blush actually gorgeous according to Rachel.\nRachhLoves on YouTube\nIn the video, Rachel uses several of the products from the new Fantasy Makers collection, but it's the color shifting Zombie blush that really catches her eye. In fact, she titled her video after the product.\nAt first, she's pretty confused by how exactly the blush will change color given it's very clear black hue inside the pan. In fact, even after she initially swatches the product, it remains the same color on her finger. It's only after she starts to blend the blush onto her hand do you see that it changes hues.\nOnce swatched, it was time for Rachel to apply the blush, and like most people, she was a little apprehensive. It is a black blush in the pan, after all. However, once placing it onto her blush and dusting it onto her cheeks, the Wet N' Wild blush is actually gorgeous.\nWhile the swatch may have looked dark on Rachel's finger and still a deep rosy hue when blended on the back of her hand, when she used a brush over her cheeks, the color is so stunning. While you may be scared of this new Wet N' Wild good at first, there's clearly no reason to be.\nThe best part about the blush, though? It's price tag. Wet N' Wild is known for their affordable products, and the blush is no different. It rings in for only $5.99 on the Wet N' Wild website, but it can also be found in stores like Rite-Aid, Wal-Mart and others.\nIf you want to shop Wet N' Wild's new color shifting Zombie blush, head over to their website now and prepare to get spooky. This ultra trippy product may seem scary, but it's really not. Isn't that what Halloween is about, after all?","url":"https://www.bustle.com/p/wet-n-wilds-zombie-blush-changes-color-from-black-to-pink-its-so-trippy-11920200"}
