{"authors":[],"date_download":"2018-10-22 21:39:06","date_modify":"2018-10-22 21:39:06","date_publish":"2014-06-05 20:52:07","description":"The painting, titled \"View of Scheveningen Sands,\" is one of a series of seaside paintings by Anthonissen, a lesser master of the Dutch Golden Age.","filename":"data/vaneerConsumption/WhaleofaDiscoveryHiddeninDutchMasterpiece.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/490946/140605-whale-in-painting-tight-combo-jms-1756_63c74c94ea75fbe1251ccaa5e90e0837.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_whale-discovery-hidden-dutch-masterpiece-n123971_1540244346.html","title":"Whale of a Discovery Hidden in Dutch Masterpiece","title_page":"Whale of a Discovery Hidden in Dutch Masterpiece","title_rss":"NULL","source_domain":"nbcnews.com","text":"The painting, titled \"View of Scheveningen Sands,\" is one of a series of seaside paintings by Anthonissen (1605-56), a lesser master of the Dutch Golden Age.\nIt had been under restoration at Fitzwilliam Museum at Cambridge University since early this year, the museum said Thursday, and as varnish and heavily daubed overpaint were painstakingly scraped away over the months, its true subject slowly emerged.\n\"Sometimes as conservators, while working on a painting, we are lucky enough to make a surprising discovery,\" Shan Kuang, the postdoctoral student at the Fitzwilliams' Hamilton Kerr Institute who led the project, said in a video the museum published describing the work's restoration.\nKuang said her interest was piqued by the people on the beach who appeared to be intently looking at nothing in particular.\nAs she slowly removed protective varnish that had badly discolored over more than four centuries, \"a figure started appearing standing directly over the horizon line,\" she said.\nThat was \"extremely unexpected and peculiar,\" she said,as the figure looked as though he or she were magically hovering several feet over the water.\n\"We spent a good deal of time speculating about what it could be, and then the fin started appearing,\" Kuang said.\nEventually the head began to emerge as layers of heavy paint were removed, and it became clear that a whale on the beach had been painted out of the painting, probably well after Anthonissen completed it around 1641.\n\"At the end of the treatment, the whale had returned as a key component of the composition, just as the artist had intended,” she said.\n\"Sometimes as conservators, while working on a painting, we are lucky enough to make a surprising discovery.\"\nThe museum said the discovery might not be as surprising as it would first seem.\n\"Contemporary records show many instances of whale beaching on the coastline of the Netherlands in the first half of the 17th century,\" it said.\nKuang said the crude overpaint, which filled in the sea and shore where the whale had been, could have been added \"because the presence of a dead animal was considered offensive\" in the 18th or early 19th centuries.\nRemoving it could have made the painting more marketable at a time in history when paintings were more commonly seen as commodities, not precious works of art, she said.\n\"View of Scheveningen Sands\" is now back on permanent display in Fitzwilliam — whale and all, just as Anthonissen wanted it.","url":"https://www.nbcnews.com/news/world/whale-discovery-hidden-dutch-masterpiece-n123971"}
