{"authors":[],"date_download":"2018-10-30 21:16:17","date_modify":"2018-10-30 21:16:17","date_publish":"2018-07-15 19:17:26","description":"Trump-Putin summit: What time do they meet, where, what will they be talking about?","filename":"data/vaneerConsumption/Whattimewherewhatwilltheytalkabout.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/07/13/Videos/4437907.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_trump-putin-s_ea6a962bed62249d35e18c2d123c78c3__1540934177.html","title":"What time, where, what will they talk about?","title_page":"Trump-Putin summit: What time, where, what will they talk about?","title_rss":"NULL","source_domain":"ajc.com","text":"President Donald Trump will meet with Russian President Vladimir Putin Monday in Helsinki, Finland, days after 12 Russian military officers were indicted for interfering in the 2016 presidential election.\nIt will be the first time the two men have met in a stand-alone meeting.\nAccording to Trump, he has “low expectations” for the meeting, but said “nothing bad” and “maybe something good” would come out of it. He said the summit “may be the easiest\" meeting of a Europe trip that ended Sunday with Trump calling the European Union a “foe.”\n“Now you wouldn’t think of the European Union, but they’re a foe. Russia is a foe in certain respects. China is a foe economically, certainly a foe.”\nWhile some have called for the meeting to be canceled in light of the indictments, Jon Huntsman, the U.S. ambassador to Russia, said the meeting “is really the first time for both presidents to actually sit across the table and have a conversation and I hope it’s a detailed conversation about where we might be able to find some overlapping and shared interests.”\nHere’s what you need to know about the meeting.\nWhat time: The meeting starts at 1:15 p.m. Helsinki time. That’s 6:15 a.m. ET.\nWhere: The two will meet Finnish leader Sauli Niinistö at the Presidential Palace. He will greet Putin first, then Trump. The talks take place in the palace’s Gothic Hall. Russian Foreign Minister Sergei Lavrov and U.S. Secretary of State Mike Pompeo will meet for discussions at the Presidential Palace while Trump and Putin meet. After Trump and Putin finish their meeting, a working lunch will be held in the Hall of Mirrors. Later in the afternoon, the two men will participate in a press conference in the Hall of State.\nWhat will they talk about: The official agenda has not been released. National security issues such as the militarization of Crimea will be among the topics discussed, along with bilateral relations.\nWill the indictment of 12 Russians for interfering in the 2016 election be discussed: Trump, in an interview Saturday, said he “hadn’t thought” about asking Putin to extradite the dozen Russian military intelligence officers indicted Friday.\nLater in the interview, he said, “Certainly I’ll be asking about it.”","url":"https://www.ajc.com/news/national/trump-putin-summit-what-time-they-meet-where-what-will-they-talking-about/lEAy36e1fccWpunY1aqdjP/"}
