{"authors":["John Nolte"],"date_download":"2018-10-30 19:26:06","date_modify":"2018-10-30 19:26:06","date_publish":"2015-10-09 12:09:37","description":"Donald Trump's view of eminent domain is not just immoral and un-American, it exposes a very troubling mindset that contradicts the populist appeal that |","filename":"data/vaneerConsumption/WhatDonaldTrumpDoesntUnderstandAboutKeloandEminentDomain.json","image_url":"https://media.breitbart.com/media/2015/09/trump-60-mins-screen.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_09__1540927566.html","title":"What Donald Trump Doesn't Understand About Kelo and Eminent Domain","title_page":"What Donald Trump Doesn't Understand About Kelo and Eminent Domain | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Donald Trump’s view of eminent domain is not just immoral and un-American, it exposes a very troubling mindset that contradicts the populist appeal that has helped him get as far as he has in the Republican primary. People need to ask themselves if they want a second president in a row who’s so eager to use the fascist power of government to crush the individual in furtherance of corporate interests.\nAll in the name of the Common Good, naturally.\nI’m no extremist on this issue.\nLike much of my state, my small North Carolina town is growing. When I first moved here in 1993, there was no Walmart, no Ruby Tuesday, and just one major intersection. In the almost 20 years since, too much has changed for me to begin to list here. And eminent domain, the law that gives government the power to take personal property for public use, has been a big part of that expansion.\nHere in Watauga County countless homes and small businesses have been bulldozed or moved to another location in order to expand our roads. Miles and miles of local highway expansion to ease congestion have come at a very real cost to common everyday folks who live by the rules.\nThankfully, this was not something that happened to me. So maybe I have no right to say this, but I do believe that this is a proper use of eminent domain. If Watauga County had not replaced two lane roads with four lane roads, life would be intolerable here. As it was, on weekend afternoons when the tourists came to visit, roads could back up for a half mile or more.\nBy all accounts, our local government (the best kind) handled this issue responsibly and respectfully. And as a human being as well as a taxpayer who benefits from this expansion, I am comfortable with the idea that some of these property owners were probably paid well above market value.\nThis expansion was not based on a “greater good” argument. Rather, this is an issue of “competing rights.” And in their infinite wisdom and foresight, America’s Founders created what is commonly referred to in the Constitution as the Takings Clause in the Fifth Amendment: “…nor shall private property be taken for public use, without just compensation.”\nThis is not the argument Trump is making.\nWith its 2005 Kelo v. New London decision, the Supreme Court changed everything. The reasonable Takings Clause has been perverted into a “greater good” argument that allows the use of eminent domain to transfer property from one private owner to another.\nIn one 5-4 decision (Kennedy and the left-wing Justices, naturally), the Constitution’s explicit use of the words “public use” was upended to allow the well-connected to use the power of the government to force you to sell your property, your home or business, to well-connected developers.\nTrump has made no secret of the fact that he is politically well-connected. In his business dealings, he has also used eminent domain to enrich himself, and in an interview this week he called this “wonderful.”\nIn an exclusive interview with Breitbart News Wednesday, Trump made his “greater good” arguments:\n“But if you’re going to build a factory that’s going to have 5,000 jobs, that’s entirely different,” Trump says. … “These people, they’re not just being thrown out. Everyone said ‘you’re taking their property,’ but they’re getting paid at least fair market value,” Trump says. “What people don’t know is, usually you go through a condemnation, and [the property owner] will get 2, 3, 4 times the value of their house. People don’t know that,” Trump tells Breitbart News. Trump acknowledged that the condemnation process is difficult. “It’s always unpleasant,” he says. “They always say you pay them fair market value, but politically, they will pay you much more.”\n“Fair market value.”\n“50,000 jobs.”\n“2, 3, 4 times the value of their house.”\nThat all sounds great until you realize it is nothing more than lipstick on a fascist policy.\nFirst off, to many of us, a home is more than a “2, 3, 4 times” investment. It is more than a house. It is a place filled with memories. Over there Jimmy took his first steps. Over there Janie spoke her first words. That’s where Dad sat every Thanksgiving. That’s the room Mom and I painted together.\nFor 20 years, my wife and I have lived in our home. We’ve just not painstakingly turned what was a dump into everything we have ever wanted, to us it is a living breathing totem of our life together.\nOur grandchildren spent summers here, my father spend 6 weeks putting in the floors and remodeling our kitchen. When the empty lots across the street went up for sale, to protect the character of the neighborhood and our view, we spent a ton of money we didn’t have to grab them up.\nWe intend to die in this home. But now what, some billionaire who can never quite be rich and powerful enough can come along and use the government to force us out?\nYes!\nYes, he can — and in America, no less.\nAnd all he has to do is crony up to the right elected officials and use the magic word “jobs.”\nWe’re not talking about a road here — a road that cannot go someplace else. We’re talking about another hotel or another ugly box store; we’re talking about a business that can go someplace else but won’t because the billionaire in question has his eye on my property. He wants something that belongs to me, something he can get richer off of, and in order to get it, he’s willing to use the power of government force to take away what is legally and morally mine.\nWould my wife and I give up our home to expand a road? If we were convinced our local government had no other viable option, I would not only agree to sell, in good conscience, I would not gouge the taxpayers.\nWould we give up our home to Trump so he could get a little richer than he already is with some hotel?\nBelieve it or not, that decision is no longer up to me.\nEven though I live in America, I’d have no choice in the matter.\nAnd Trump thinks that’s “wonderful.”\nOne of the things that is so appealing about Trump is that he speaks “American” like no other candidate. I don’t mean English, I mean American. He’s fluent in it. But Kelo is neither American nor wonderful.\nWhat is “wonderful” is a government that understands that the smallest and most vulnerable minority in the country is the individual, and that the government’s primary responsibility is to protect the rights of that individual, most especially the rights of the obstinate, unreasonable “hold outs.”\nThe Individual has already suffered through eight years of a president completely enamored with the idea of using government to crush his human rights. We do not need another.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/politics/2015/10/09/what-donald-trump-doesnt-understand-about-kelo-and-eminent-domain/"}
