{"authors":["Michael Cunningham"],"date_download":"2018-10-30 19:22:26","date_modify":"2018-10-30 19:22:26","date_publish":"2018-06-19 16:55:00","description":"The Hawks own the No. 3 pick in the NBA draft Thursday.","filename":"data/vaneerConsumption/WhataretherealisticexpectationsfortheplayertheHawksdraftat.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/MyAJC/2018/06/19/Images/963425986.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-hawks_what-are_c2717f6452ce59c4bb93e394840eacc5__1540927346.html","title":"What are the realistic expectations for the player the Hawks draft at","title_page":"What are the realistic expectations for the player the Hawks draft at ","title_rss":"NULL","source_domain":"ajc.com","text":"The Hawks own the No. 3 pick in the NBA draft Thursday. They hope to find a franchise player, but how realistic is it for them to do so?\nTo get an idea, we can look at some historical data about players selected with the No. 3 overall pick. In 2014 FiveThirtyEight.com’s Nate Silver analyzed drafts to estimate the number wins produced by players at each draft position.\nSilver studied the five-year Basketball Reference Win Shares produced by players drafted beginning in 1985, the first year of the lottery, through 2014. The five-year window is important because that’s how long teams have contractual control over first-round draft picks (with salary-matching rights for restricted free agents in the final year).\nSilver found that third picks during those years produced an average of 26 Win Shares in their first five seasons. For context, here are the NBA players drafted during the lottery era who produced between 25 and 27 Win Shares over their first five seasons:\nPlayer From To WS Kenny Anderson 1992 1996 27.0 Grant Long 1989 1993 26.5 Damon Stoudamire 1996 2000 26.3 Rod Strickland 1989 1993 26.3 Emeka Okafor 2005 2009 26.2 James Posey 2000 2004 26.2 Terrell Brandon 1992 1996 26.1 Devin Harris 2005 2009 26.1 Derek Anderson 1998 2002 26.0 Raef LaFrentz 1999 2003 26.0 Wesley Person 1995 1999 26.0 Mitch Richmond 1989 1993 26.0 Kenyon Martin 2001 2005 25.9 John Wall 2011 2015 25.9 Otto Porter 2014 2018 25.8 Antonio Davis 1994 1998 25.6 Ronnie Brewer 2007 2011 25.5 Jerome Kersey 1986 1989 25.5 Michael Adams 1986 1990 25.4 Theo Ratliff 1996 2000 25.4 B.J. Armstrong 1990 1994 25.3 Drew Gooden 2003 2007 25.2 Antawn Jamison 1999 2003 25.2 Antonio McDyess 1996 2000 25.2 Charles Oakley 1986 1990 25.2 Mason Plumlee 2014 2018 25.2 Hassan Whiteside 2011 2017 25.2\nMitch Richmond would blossom later in his career and end up in the Hall of Fame. John Wall is a five-time All-Star. The rest of the list includes some good players but no franchise-changers.\nLook at the list of No. 3 picks during the lottery era and you’ll see the variance from the best player (Pau Gasol) to the median (Raef LaFrentz) to the worst (Adam Morrison). The Hawks would hit the jackpot to get a player like Gasol, James Harden, Carmelo Anthony or Al Horford, but that’s not likely.\nThere’s a lot of luck involved in the draft. Silver notes that in the 2007 draft Kevin Durant was the No. 2 pick behind Greg Oden. Hawks general manager Travis Schlenk has pointed out that when he was with Golden State, the Warriors got lucky that Minnesota took point guards Ricky Rubio and Jonny Flynn immediately before Golden State nabbed Steph Curry. And the Warriors have been lucky that Curry’s recurring ankle issues haven’t derailed his career.\nThe Hawks are in a good position with the No. 3 pick. But if there is a potential franchise player in this draft they must correctly identify him, trust that he’s available when they pick and then help that player reach his full potential within five years.\nAll that can happen but, as the history of the draft shows, the Hawks are more likely to end up with a good-not-great player at No. 3.","url":"https://www.ajc.com/blog/atlanta-hawks/what-are-the-realistic-expectations-for-the-player-the-hawks-draft/HGuRo6scovmh3UvLQEXNuK/"}
