{"authors":["Associated Press"],"date_download":"2018-10-23 05:13:07","date_modify":"2018-10-23 05:13:07","date_publish":"2016-01-28 21:07:58","description":"SWEDEN (AP) — Amid unprecedented waves of migration, the interior minister of Sweden says the coming years could see the deportation from the country of betw...","filename":"data/vaneerConsumption/WhatweknowaboutSwedenspredictionofmassdeportations.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:d4f25193abe341099e38c96030ce6923-2vdWmEltwXfba0ce28e632cab512-670_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421720_What-know-Swedens-prediction-mass-deportations_1540271587.html","title":"What we know about Sweden's prediction of mass deportations","title_page":"What we know about Sweden's prediction of mass deportations | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"What we know about Sweden's prediction of mass deportations\nSWEDEN (AP) — Amid unprecedented waves of migration, the interior minister of Sweden says the coming years could see the deportation from the country of between 60,000 to 80,000 people who have sought asylum. Here's what we know about what could become an uncomfortable reality for Europe:\n— Interior Minister Anders Ygeman is basing the deportation figure on the fact that more than 160,000 people applied for asylum in Sweden last year, and the current rejection rate is about 45 percent.\n— Sweden and Germany are prime destinations for those seeking asylum in Europe, and the sharp increase last year of such people almost certainly will also lead to much higher numbers of rejections and deportations.\nFILE - In this Dec. 17, 2015 file photo, the police escort 3 men from a train at Hyllie station outside Malmo, Sweden. Interior Minister Anders Ygeman says Sweden could deport between 60,000 and 80,000 asylum-seekers in coming years. Ygeman told newspaper Dagens Industri that since about 45 percent of asylum applications are currently rejected, the country must get ready to send back tens of thousands of the 163,000 who sought shelter in Sweden last year, it was reported on Thursday, Jan. 28, 2016. (Johan Nilsson /TT News Agency via AP, File)\n— The prospect of packing unwilling migrants, even entire families, onto chartered airplanes bound for the Balkans, the Middle East or Africa evokes images that clash with Europe's humanitarian ideals.\n— The European Union has urged its member countries to quickly send back those who don't qualify for asylum so that Europe's welcome can be focused on those who do, such as people fleeing war in Syria.\nSweden took in around 35,400 unaccompanied minors in 2015, nine times more than in 2014 (stock image)\nFILE - In this Nov. 11, 2015 file photo, Sweden's Interior Minister Anders Ygeman, announcing that the government will impose temporary border controls as the Nordic country struggles to receive tens of thousands of refugees in Stockholm, Sweden. Ygeman says Sweden could deport between 60,000 and 80,000 asylum-seekers in coming years. (Henrik Montgomery/TT via AP) SWEDEN OUT .\nRefugees prepare themselves before heading towards the border with Serbia, at the transit center for refugees near northern Macedonian village of Tabanovce, Thursday, Jan. 28, 2016. Macedonia allows in migrants whom it deems to be bona fide refugees - Syrian, Iraqi and Afghan nationals. All others are considered economic migrants and left trapped in Greece, where they are told to seek asylum, agree to voluntary repatriation or be deported. (AP Photo/Boris Grdanoski)","url":"https://www.dailymail.co.uk/wires/ap/article-3421720/What-know-Swedens-prediction-mass-deportations.html"}
