{"authors":["Maria Yagoda"],"date_download":"2018-10-30 23:27:20","date_modify":"2018-10-30 23:27:20","date_publish":"2014-08-13 18:24:27","description":"We all know that Instagram serves three main functions: proliferating the images of goofy-looking dogs; providing an inside look at the lives of the Kardashians and other celebrities with flawless skin; and lastly, perhaps most importantly,…","filename":"data/vaneerConsumption/WhatIInstagrammedVsWhatWasReallyHappeningTheTravelEdition.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/6370ddc3-b530-4bda-a725-40b25397efc4.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34880-what-i-instagrammed-vs-what-was-really-happening-the-travel-edition_1540942040.html","title":"What I Instagrammed Vs. What Was Really Happening: The Travel Edition","title_page":"What I Instagrammed Vs. What Was Really Happening: The Travel Edition","title_rss":"NULL","source_domain":"bustle.com","text":"We all know that Instagram serves three main functions: proliferating the images of goofy-looking dogs; providing an inside look at the lives of the Kardashians and other celebrities with flawless skin; and lastly, perhaps most importantly, Instagram is a tool that empowers users to present their best selves to others, in the hopes of inspiring jealousy, respect, and admiration.\nIn 2014, a large (if not the largest) part of taking a trip is the documentation of your journey; it's your responsibility to update friends, family, and frenemies with images of all the fun you're having, while they drearily scroll through Instagram, sitting on the toilet at their miserable places of work.\nYet, pictures of travel on social media can often be deceitful, willingly or not, as the desire to portray the fabulousity of your adventures can get in the way of some objective truths, like what you're actually feeling, doing, or thinking.\nI spent the second half of last year traveling through Italy, Croatia, and Bosnia, and social media played a key part in my sick need for validation. Here are a few classic travel shots that didn't quite represent the whole truth of the given moment.\n1. The Drinking Alone Shot\nWhat it looks like I'm doing . . .\nI'm in a foreign country, where beer is called something unpronounceable and it's commonplace to drink at 11 a.m. because who has jobs? Look at me out on the town, fearlessly assimilating into the culture.\nWhat I'm actually doing/thinking . . .\nIt's not depressing drinking a beer alone in a foreign country. It's not depressing drinking a beer alone in a foreign country. It's not depressing drinking a beer alone in a foreign country.\nOh God, now the locals are ostracizing me for taking a picture of my beverage.\nI'm horny.\n2. The Feet in Water Pic\nWhat it looks like I'm doing . . .\nOh, I'm just soaking my dainty feetsies in pristine seawater. I'm so #blessed to be in a part of the world where it's warm enough to swim in October!\nWhat I'm actually doing/ thinking . . .\nAfter weeks of eating exclusively cheese, sausage, fried potatoes, and beer, my feet are the only body parts I'm comfortable showing the world. I can't even go in any deeper, because it's October and freezing, despite what my caption would have you believe.\n3. The 'Bout to Hit the Clubs Shot\nWhat it looks like I'm doing . . .\nI'm so fly in my edgy leotard and dramatic side-swept part. Too fly, in fact, to even smile for this (very candid) picture. I can't wait to get to the underground punk rock club and flirt with some alternative hotties, now that I've picked up all this Croatian from wandering the streets alone and pointing to things at restaurants.\nWhat I'm actually doing/thinking . . .\nDamn, this outfit is so squeeze-y. I'm a sausage. I guess I won't be breathing tonight, so as to prevent my fried-calamari-filled belly from spilling over the top of my skirt. I wish I could take this picture somewhere besides the shower; too bad my room is covered in beer bottles, assorted foreign currency, half-written postcards, and wrappers from the Reese's I've been hoarding since I arrived on foreign soil.\n4. The Food Aerial\nWhat it looks like I'm doing . . .\nI just loooooove eating the local delicacies wherever I travel. This yogurt sauce is phenomenal and interesting! I eat things with yogurt on it because health is a thing I value!\nWhat I'm actually doing/thinking . . .\nWhy does this always happen? I go to a café to get a coffee or sparkling water, and I end up ordering an entire second dinner, even though I'm still SUPER gassy and overcoming yesterday's food poisoning.\nWhy didn't they serve bread with this?\n5. I'm a Local Now? Pic\nWhat it looks like I'm doing . . .\nI live on this street in Naples, which I'm portraying in black and white because it feels like I'm in an entirely different era! So old-timey and quaint. Wow, I'm so immersed in the lives of real Neopolitans. I've only been here a week, but I feel like I've lived on these streets forever.\nWhat I'm actually doing/thinking . . .\nAlmost\ngot trampled by a ruthless gang of youths on Vespas because I'm standing in the middle of the street like an idiot, squatting to get the perfect angle and debating whether or not to flip the phone around for a selfie (so I can really drive home the point that I'm here.)\n6. The Magical Landscape\nWhat it looks like I'm doing . . .\nI adore traveling through breathtaking foreign countrysides untouched by industry and globalization and all that other stuff I take no part in.\nWhat I'm actually doing/thinking . . .\nI just spent the past hour trying to connect to the atrocious Wi-Fi so that I could upload this picture, pacing frantically around the rest stop and using the three Bosnian words I know to ask bemused locals to help me. This picture represents the 15 seconds I spent appreciating my surroundings.\n7. The Adventurer Selfie\nWhat it looks like I'm doing . . .\nAnything is possible. I'm actually blowing this dandelion. I look cute after a day of exploring small Croatian towns. What a fun shot capturing a candid moment of my whimsical life!\nWhat I'm actually doing/thinking . . .\nNothing is possible. I'm exhausted and sweaty, praising the Lord for the curative properties of Instagram filters. I'm not actually blowing this dandelion, just making a kissy face.\nI missed my bus to take this; the next one comes in an hour.\nImages: Maria Yagoda/Instagram","url":"https://www.bustle.com/articles/34880-what-i-instagrammed-vs-what-was-really-happening-the-travel-edition"}
