{"authors":["Casey Rackham"],"date_download":"2018-10-30 23:41:30","date_modify":"2018-10-30 23:41:30","date_publish":"2014-08-13 14:28:47","description":"Ah, remember the good ol' days of cheerleader and hospice nurse heroes and serial killer villains? From 2006 to 2010, Ali Larter was one of those special people with superhuman abilities on NBC's Heroes. She played Niki Sanders, the internet…","filename":"data/vaneerConsumption/WhatHasLegendsAliLarterBeenUpToSinceHeroesTheStarIsBackAfteraFoodFilledBreak.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/cb34a9c6-8278-4de9-9777-5e22ed229619.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35469-what-has-legends-ali-larter-been-up-to-since-heroes-the-star-is-back-after-a_1540942890.html","title":"What Has 'Legends' Ali Larter Been Up To Since 'Heroes'? The Star Is Back After a Food-Filled Break","title_page":"What Has 'Legends' Ali Larter Been Up To Since 'Heroes'? The Star Is Back After a Food-Filled Break","title_rss":"NULL","source_domain":"bustle.com","text":"Ah, remember the good ol' days of cheerleader and hospice nurse heroes and serial killer villains? From 2006 to 2010, Ali Larter was one of those special people with superhuman abilities on NBC's Heroes. She played Niki Sanders, the internet stripper with multiple personalities and superhuman strength for the series' first two seasons, and Tracy Strauss for the third and fourth seasons — and after that, well, she kind of slipped off the radar.\nLucky for Larter fans, the Legally Blonde star — she played Brooke \"I Just Liked To Watch Him Change The Filter\" Taylor Windham — is set to make her TV comeback with TNT's new series Legends . The show follows Martin Odum (played by Game of Thrones' Sean Bean), an FBI agent with the ability to transform himself into a different person for each job. Larter will costar alongside Bean as Crystal McGuire, a fellow operative.\nCheck out what Larter's been up to since her four-season stint on Heroes.","url":"https://www.bustle.com/articles/35469-what-has-legends-ali-larter-been-up-to-since-heroes-the-star-is-back-after-a"}
