{"authors":["Jamie Primeau"],"date_download":"2018-10-30 23:57:23","date_modify":"2018-10-30 23:57:23","date_publish":"2014-08-12 20:45:14","description":"If you were a Jersey Shore fan since the beginning, you know that Deena Cortese wasn't a member of the original cast. Before the meatball BFF days of Deena and Nicole \"Snooki\" Polizzi, there was Angelina Pivarnick — \"the Kim Kardashian of Staten…","filename":"data/vaneerConsumption/WhatsJerseyShoresAngelinaPivarnickUpToWellShesStillTryingtoMakeItonTV.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/63854b9d-b0fa-4e9f-88c1-89b308fc15cb.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35434-whats-jersey-shores-angelina-pivarnick-up-to-well-shes-still-trying-to-make-it-on-tv_1540943843.html","title":"What’s ‘Jersey Shore’s Angelina Pivarnick Up To? Well, She’s Still Trying to Make It on TV","title_page":"What’s ‘Jersey Shore’s Angelina Pivarnick Up To? Well, She’s Still Trying to Make It on TV","title_rss":"NULL","source_domain":"bustle.com","text":"If you were a Jersey Shore fan since the beginning, you know that Deena Cortese wasn't a member of the original cast. Before the meatball BFF days of Deena and Nicole \"Snooki\" Polizzi, there was Angelina Pivarnick — \"the Kim Kardashian of Staten Island,\" as she so humbly called herself. Unfortunately, she wasn't the most well-liked cast member on the MTV show, so she didn't stick around for very long. Angelina was kicked out of the Seaside house in the first season's third episode because she was fired from her job at the t-shirt store, but then she was reunited with the cast in Miami during Season 2. As expected, her return didn't go over too well with the others and after that, Deena took her place.\nBack in 2010, Snooki explained that Angelina didn't fit in with the group because she didn't open up to them. This made it hard for the cast to connect. While she may not have shared personal details, she did not hesitate to speak her mind. Remember all the times she fought with the other girls?\nWhile we all know Snooki and JWoww are best friends still and new mothers, no one ever talks about Angelina. If you've been scratching your head, wondering what she's doing now, don't worry! I decided to take a look and find out what she's been up to since her screaming matches with JWoww. It's like I can almost hear her yelling, \"Hello? What about me?!\"\nSince the show, she's been up to quite a bit. Let's take a look at her recent projects:\nKickstarter Campaign\nIn March 2013, she started a Kickstarter campaign for her own show called The Comeback. While she funded all $8,000 (is that even enough to start a show?), it never actually happened.\nMusic Video\nslapmybeats on YouTube\n\"I'm Hot\" is one of those songs you can't not listen to. It includes these brilliant lyrics: \"I take a shot / It hits the spot / Then dance a lot / Until I drop / I shop and shop / I just can't stop.\" She also sings, \"I'm hot, so hot / I'm like an ice cream cone with a cherry on top.\" I guess she's never eaten ice cream and doesn't know it's cold?\nTwitter Fights\nAhh, some things never change. She got in a Twitter fight with Teen Mom Jenelle Evans. Then the conversation escalated and she dissed Snooki and Deena too, saying they slept with every guy in the Jersey Shore house. Yikes!\nWrestling\nThe most surprising thing in Angelina's bio is that she's a wrestler. In 2011, she made her debut on TNA iMPACT Wrestling. Apparently her fighting isn't just reserved for tackling Snooki on Jersey Shore.\nCouples Therapy\nAndrew H. Walker/Getty Images Entertainment/Getty Images\nIn 2012, Angelina was on VH1's show Couples Therapy with boyfriend Chris Nirschel, a chef who refers to himself as the Culinary Bad Boy. The two wanted to repair their relationship. Although I'm not sure how well it worked, since I can't find anywhere whether they're still together.\nEMT School\nCindy Ord/Getty Images Entertainment/Getty Images\nIn December 2013, TMZ reported that Angelina was going to EMT school to become certified. She told the website, \"Being the Jersey Shore bitch is in the past ... now, my future is saving lives.\"\nFuture Roles?\nVIVEKaterin on YouTube\nAccording to IMDb, she's working on a show called The Familia. It's apparently a \"modern day mob story\" that's still in pre-production. She plays the godfather's daughter in the show. (Skip ahead to the 5:00 mark in the video above to see her talk about it!)\nPersonally, I can't wait for Angelina to be back on our TV screens. She's always entertaining!\nImages: WiffleGif (2), Getty Images (2), RemoteControl.MTV.com","url":"https://www.bustle.com/articles/35434-whats-jersey-shores-angelina-pivarnick-up-to-well-shes-still-trying-to-make-it-on-tv"}
