{"authors":["Mical Raz","A Practicing Physician","Historian Of Health Policy","Will Be An Associate Professor Of History At The University Of Rochester In She Is The Author Of"],"date_download":"2018-10-21 03:29:33","date_modify":"2018-10-21 03:29:33","date_publish":"2018-07-02 10:01:15","description":"Poor children don't struggle in school because of their parents. They struggle because of poverty.","filename":"data/vaneerConsumption/Whatwegetwrongaboutthepovertygapineducation.json","image_url":"https://www.washingtonpost.com/resizer/LqrAh7cIXMKTf66hmqBxHEkpaIk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CEMLQR2XAE5KBNCKJXSYGIJM4Y.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_made-by-history_wp_2018_07_02__1540092573.html","title":"What we get wrong about the poverty gap in education","title_page":"What we get wrong about the poverty gap in education - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Brenda Molina, 33, of Manassas Park, Va., reads with Emiliano Martinez, 9 months, of Manassas, at the Georgetown South Early Head Start Child Development Center. Molina spends her time teaching infants, the youngest participants in the Head Start program. (Maddie Meyer/The Washington Post)\nMical Raz, a practicing physician and historian of health policy, will be an associate professor of history at the University of Rochester in 2019. She is the author of \" What's Wrong with the Poor? Psychiatry, Race and the War on Poverty .\"\nIf you have young children, chances are you’ve been to a pediatrician’s office and have left with a new book in hand. This is often part of a program, recognized by the American Academy of Pediatrics, designed to promote literacy by providing families with age-appropriate books.\nAlthough such programs are uncontroversial and popular, the reasoning behind them — a focus on what poor children and families lack — is misguided.\nOver the past 60 years, this emphasis has derailed policies meant to advance early-childhood education. Even more important, it has substituted unfounded critiques of parenting for more significant— and difficult — discussions about how to combat poverty and channel meaningful investments in anti-poverty programs and early education.\nSince the 1960s, policymakers, educators and researchers have shared a perception that poor families, often from minority backgrounds, were fundamentally different from middle-class families. While rejecting racist theories of biological difference, researchers in the 1960s focused on the home environment of poor families, particularly families of color, to map out what led to their children’s academic struggles.\nThe result was a theory of “cultural deprivation,” which holds that poor families lack the norms, values and skills to succeed within mainstream society. Poor families — and in particular, mothers — were viewed as lacking the skills necessary to instill a love of language and learning in their children.\nThis theory produced a gulf between what poor families needed and what policymakers believed they needed. Although poor families often lacked food, decent jobs, housing and health care, many programs focused on a perceived lack of motivation, work ethic or love of reading. This gap fueled long-standing stereotypes that blamed poor families for their misfortunes.\nThe result: public policies that perpetuated stereotypes of low-income families and minorities. These policies often led to ineffective programs.\nConsider, for example, Head Start, a program started in 1965 to counter the effects of poverty by providing a stimulating educational environment conducive to child development. One psychologist earnestly wrote that in these compensatory preschools, the teachers’ role was to do the “kind of things a ‘good’ mother does” with her infant. Preschool was touted as beneficial to families from inadequate homes, essentially intending to provide the children with an experience similar to that of having a middle-class mother.\nBut this approach was a double-edged sword. If preschool was useful only as a remedial step for “deprived” children, it was difficult to argue that it was beneficial for children from all backgrounds. This sacrificed an opportunity to build consensus behind the need for universal early-childhood education.\nUltimately, it undermined burgeoning bipartisan support for early-childhood education. In 1971, President Richard M. Nixon vetoed the Comprehensive Child Development Act. He acknowledged the benefits of preschool for poor families, but argued that Project Head Start already met this need. Middle-class families, Nixon argued, did not need such educational interventions, and accordingly could make their own private arrangements for child care as necessary.\nBy stigmatizing early-childhood education as a solution for perceived deficits of poor families, an important opportunity to provide early education to the nation’s children was missed. And since then, scholarship and policy for early education has continued to be hamstrung by focusing on perceived parenting problems, rather than on the real effects of poverty, racism and environmental hazards such as lead.\nConsider the idea behind the approach of handing out books. This program touts the concept of a “word gap” between children from low-income and more privileged families. This practice is based on a famous 1995 study that counted words spoken by parents to their children, and contended that by age 4, more advantaged children had heard 30 million more words than their poorer peers. The idea of the “word gap” quickly became a buzzword, serving as the rationale for numerous programs such as Reach Out and Read and certain others within Head Start in an attempt to assist poor families in “closing” this gap.\nYet the word-gap study, as scholars have repeatedly shown, was deeply flawed. It was based on a small, unrepresentative sample. In counting words, it relied on a strict criteria by which to define and measure vocabulary. And a new study has recently found that a “word gap” doesn’t actually exist: In fact, in some working-class families, children were exposed to more words than their more advantaged peers.\nLike those theories of “deprivation” from the 1970s, this word-gap concept points to deficits in children’s home lives as the reason for their scholastic disadvantage, rather than asking how poverty shapes those home lives, as well as children’s ability to learn and thrive. The result is a practice — handing out books — that doesn’t even attempt to solve the economic struggles poor families face.\nIn a country where more than 40 percent of children live in low-income families, we should ask how communities are failing struggling families. Providing books to children is likely a valuable intervention, but this should be just a beginning. To tackle poverty and educational issues, programs need to focus on providing access to food, housing, education and health care — all necessary to thrive — and not the potential inadequacies of parents.\nInstead, we’re moving in the wrong direction. Congress recently struggled to renew the Children’s Health Insurance Program, which offers health insurance to low-income families. Throughout the country, policymakers are erecting new barriers to accessing public aid, ostensibly to address deficits in motivation, self-sufficiency and work ethic. From Medicaid work requirements to the House version of the farm bill — which links food-stamp eligibility to employment — this portrayal of poor people as lacking in work ethic and motivation, rather than lacking in food, money and employment opportunities, has pernicious effects.\nWhile handing out books is a good thing — and something that we should continue to do — it’s time to stop blaming poor families for their circumstances. Children can’t learn without food, adequate shelter, good health and quality schools. By focusing on the perceived inadequacies of their parents, we’re failing as a society to attack the far more severe impediments to closing education gaps — in part because it’s easier to blame poor people than to have hard conversations about unfairness and inequity in our society.","url":"https://www.washingtonpost.com/news/made-by-history/wp/2018/07/02/what-we-get-wrong-about-the-poverty-gap-in-education/"}
