{"authors":["Associated Press"],"date_download":"2018-10-22 20:15:05","date_modify":"2018-10-22 20:15:05","date_publish":"2016-01-29 00:54:12","description":"All of a sudden, an extra point can provide some extra drama. The kick that comes after a touchdown — turning six points into seven — is not quite as much of...","filename":"data/vaneerConsumption/WhatifamissedextrapointdecidedtheSuperBowl.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:161165792a674c4fa87dfd1a39df960f-2vdWmEltwXfba0ce28e632e73495-363_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422022_What-missed-extra-point-decided-Super-Bowl_1540239305.html","title":"What if a missed extra point decided the Super Bowl?","title_page":"What if a missed extra point decided the Super Bowl? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"What if a missed extra point decided the Super Bowl?\nAll of a sudden, an extra point can provide some extra drama.\nThe kick that comes after a touchdown — turning six points into seven — is not quite as much of a sure thing now, because the distance was pushed back from 20 yards to 33 this season.\nImagine a Super Bowl decided by a flubbed kick following a TD. Seem far-fetched? Certainly used to be: No one has missed a PAT in the Super Bowl in a quarter-century.\nFILE- In this Jan. 24, 2016 file photo, New England Patriots punter Ryan Allen (6) watches as Stephen Gostkowski reacts after missing an extra point during the first half the NFL football AFC championship game against the Denver Broncos in Denver. Gostkowski¿s missed kick in the game contributed to the loss against the Broncos which, in the end, sent the Broncos to the Super Bowl. (AP Photo/Chris Carlson, File)\nThings have changed. After all, the Denver Broncos got to their Super Sunday matchup against the Carolina Panthers on Feb. 7 in Santa Clara, California, thanks in part to a botched extra point by New England Patriots kicker Stephen Gostkowski in last weekend's AFC championship game.\n\"Do you want a game to end on a missed extra point rather than going to overtime? I think that would be very anticlimactic. I don't think most fans would want to see a game end that way,\" said Jay Feely, a kicker for a half-dozen NFL teams over 14 seasons from 2001-14.\n\"I would never want to see a game end that way, especially one of this magnitude. I hope it doesn't,\" he said, before adding with a chuckle: \"But it certainly could.\"\nNFL kickers had never made worse than 99.3 percent of their extra-point attempts across any season from 2010-14, but the league-wide rate dropped to 94.2 percent this season — the lowest mark in 35 years, according to STATS.\nHere's another way to look at it: There were a total of eight misses in all of 2014; that total was exceeded by Week 2 of 2015.\n\"I wouldn't say I view it as an extra point anymore,\" Panthers kicker Graham Gano said. \"Extra points are gone. Now it's just another field goal.\"\nGano practices more from the new spot, the right hash mark at the 23-yard line.\n\"I wasn't a fan of when they changed it. Nobody wants their job to be harder,\" Gano said.\n\"But I think the better you are at being a placekicker, the more valuable you are going to be. I feel like I did a good job of hitting them this year, and in the years to come, it will make me a valuable asset to the team.\"\nHe is 65 of 68 on PATs this season, including the playoffs.\nThe other Super Bowl kicker, Denver's Brandon McManus, is 37 of 38.\nMcManus notes that the greater length of the kick means players need to warm up, which they didn't need to do before. And that can be an issue right after a defensive TD, because unlike when his offense has the ball and is driving toward the end zone, a score happens unexpectedly.\n\"You have to run 50 yards this way to get your helmet, then you've got to run 80 yards back the other way,\" McManus explained. \"The biggest issue is just refocusing, knowing you didn't get to warm up at all. You might have been on the sideline for 30 minutes.\"\nGostkowski sent an extra-point attempt wide right early in New England's 20-18 loss to Denver, forcing the Patriots to try to go for a 2-point conversion in a failed attempt to send the game to overtime in the closing seconds. It was his first missed PAT in nine years, ending a league-record run of making 523 in a row.\nFor any NFL kicker's leg, a 33-yard field goal is no big deal. But the mental pressure of a 33-yard extra point changes everything.\n\"Everyone in the stands and at home thinks you have to make it or else you're not worth anything,\" McManus said. \"That's kind of how it is.\"\nHere's the way Feely described it: \"Because of the expectation of perfection, there's an added layer of pressure ... and it has tangible impacts.\"\nHe was against the distance switch when it was approved in a vote of club owners in May. Now he's OK with it.\n\"It was a good change,\" Feely said. \"It did take a play that was a given and was a boring play, and it created more interest throughout this season.\"\nCount Panthers coach Ron Rivera among the converts, too.\n\"I will be honest with you about it: I was against it. I didn't like it. I thought it was going to change the game. I wasn't sure it was necessary,\" Rivera said. \"Now that I see how effective it has been, how it has made the game entertaining, how it did impact the playoffs this year — it is exactly what the league wanted.\"\n___\nFollow Howard Fendrich on Twitter at http://twitter.com/HowardFendrich\n___\nAP Sports Writers Steve Reed in Charlotte, N.C., and Pat Graham and Arnie Stapleton in Englewood, Colo., contributed to this report.\n___\nOnline:\nAP NFL website: www.pro32.ap.org and AP NFL Twitter feed: http://twitter.com/AP_NFL","url":"https://www.dailymail.co.uk/wires/ap/article-3422022/What-missed-extra-point-decided-Super-Bowl.html"}
