{"authors":["Caroline Burke"],"date_download":"2018-10-31 01:42:57","date_modify":"2018-10-31 01:42:57","date_publish":"2018-08-27 23:58:40","description":"On Monday, the Trump administration announced that the United States and Mexico have reached an agreement to revise some parts of the North American Free Trade Agreement (NAFTA). For years, Trump has called the trade agreement between Canada, Mexico…","filename":"data/vaneerConsumption/WhatTrumpsNAFTADealWithMexicoActuallyMeansForYouIfItBecomesAReality.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/6d1a1a85-d975-41a5-8a0b-0205396a08bd-getty-1021449322.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_what-trumps-nafta-deal-with-mexico-actually-means-for-you-if-it-becomes-a-reality-10257794_1540950177.html","title":"What Trump's NAFTA Deal With Mexico Actually Means For You If It Becomes A Reality","title_page":"What Trump's NAFTA Deal With Mexico Actually Means For You If It Becomes A Reality","title_rss":"NULL","source_domain":"bustle.com","text":"On Monday, the Trump administration announced that the United States and Mexico have reached an agreement to revise some parts of the North American Free Trade Agreement (NAFTA). For years, Trump has called the trade agreement between Canada, Mexico and United States \"unfair\" and \"seriously out of whack.\" Now, pending Canada's agreement with the revisions, it looks like NAFTA might get a Trump-approved touchup. But what Trump's NAFTA deal with Mexico actually means for you if it's passed might be harder to understand on a personal level— especially since it will probably affect your life in both good and bad ways, if it does come to fruition.\nThe agreed-upon revisions for NAFTA by the United States and Mexico focus on three essential staples, per CNN: eliminating tariffs between the three countries, increasing the number of car parts produced in the United States or Mexico, and raising the labor standards for workers involved in car parts production.\nOn a more local level, those revisions would hypothetically translate into higher wages for workers in the car industry (the new agreement would require that at least 40 percent of car part workers earn at least $16 dollars per hour). It would also mean lower costs for some of the goods that you know and love which come from Mexico and Canada, like maple syrup, bourbon, coffee beans and steel.\nCBS News on YouTube\nBeyond the specifics, a more secure trade agreement between the three countries that make up North America could also boost the U.S. economy in general, which is always good news. On Monday, when the trade agreement was announced, stocks soared to record highs, according to CNN Money. But just because investors are excited about the trade doesn't mean it's guaranteed, yet.\nIn order for the revisions to NAFTA to be passed into legislation, Canadian Prime Minister Justin Trudeau has to agree to the revisions on behalf of Canada's involvement. And though this is a likelihood, it's far from guaranteed. Trudeau has been notably quiet throughout the trade talks between the United States and Mexico, with some people even speculating that he's avoiding a trade agreement with Trump for political gain.\nIf Canada does decide to back out of the NAFTA agreement, it's unclear what would happen. Trump has already threatened Canada regarding the trade agreement, saying to reporters on Monday that the U.S. would reach an agreement with Canada \"one way or another,\" adding, \"It’ll either be a tariff on cars, or it’ll be a negotiated deal.\"\nNBC News on YouTube\nCanadian Foreign Affairs Minister Chrystia Freeland has indicated that Canada is interested in getting along with the U.S. and Mexico on this front, according to NPR. Through a spokesperson, Freeland said, \"Progress between Mexico and the United States is a necessary requirement for any renewed NAFTA agreement.\" However, she did add, \"We will only sign a new NAFTA that is good for Canada and good for the middle class. Canada's signature is required.\"\nIn the past, Trump has been an outspoken critic of the NAFTA agreement, and even went so far to suggest giving the trade agreement a new name after the revisions went into place. The reason for the name change is because Trump claimed NAFTA \"has a lot of bad connotations for the U.S.,\" per his conversation with reporters on Monday, and that it was generally a \"bad deal.\"\nTrump has not indicated what he would like to change the name to, though it's sure to be something entertaining.","url":"https://www.bustle.com/p/what-trumps-nafta-deal-with-mexico-actually-means-for-you-if-it-becomes-a-reality-10257794"}
