{"authors":["Anam Syed"],"date_download":"2018-10-30 23:27:16","date_modify":"2018-10-30 23:27:16","date_publish":"2014-08-13 18:31:32","description":"With every new episode, MTV's Teen Mom 2 further proves that it's rough being a teenage mother. Unstable home life, volatile partners, and struggles with addiction, not to mention just getting through school, are all issues that have plagued Jenelle…","filename":"data/vaneerConsumption/WhatIsKiefferfromTeenMom2DoingJenellesExIsStillUpToNoGood.json","image_url":"https://imgix.bustle.com/rehost/2016/11/10/dad08e20-758d-4ff0-a38f-07a3bfb887ac.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35496-what-is-kieffer-from-teen-mom-2-doing-jenelles-ex-is-still-up-to-no-good_1540942036.html","title":"What Is Kieffer from 'Teen Mom 2' Doing? Jenelle's Ex Is Still Up To No Good","title_page":"What Is Kieffer from 'Teen Mom 2' Doing? Jenelle's Ex Is Still Up To No Good","title_rss":"NULL","source_domain":"bustle.com","text":"With every new episode, MTV's Teen Mom 2 further proves that it's rough being a teenage mother. Unstable home life, volatile partners, and struggles with addiction, not to mention just getting through school, are all issues that have plagued Jenelle Evans in her time on the show. But after going through all of that, she's on her way to bettering her life. Fans of the show will recall Jenelle was a subject you wanted to root for, especially after witnessing her countless legal battles and rocky relationship with her ex-boyfriend Kieffer Delp.\nFrom heroin possession to supporting current partner Nathan Griffith's struggle with alcohol and jail time, seeing Jenelle address and try to work through those problems show she's committed to her son and overcoming all of the hardships she's faced. But what about the not so great blast from her past, Kieffer? In April, Radar Online reported that while Nathan was in jail, Jenelle began Facebook messaging Kieffer, an interaction that quickly took a regrettable turn.\nThe conversation between the two started with Jenelle applauding Nathan, then quickly turned sour when she used a hugely offensive racial slur, saying she wouldn't trade Nathan for a \"n****r like [Kieffer].\" Jenelle admits during the convo that Nathan doesn't treat her as \"nice\" as Kieffer, though it's upsetting to see what Jenelle considers nice behavior — and much, much more upsetting to see her use that word.\nA classic manipulator, Kieffer goes from slamming on Nathan and Jenelle to asking Jenelle to break up with him, playing the puppy dog and claiming he pawned everything for the chance to support her, even though she had moved on. In a twist, Jenelle suggests that she's only with Griffith due to being pregnant and not wanting to be alone, and generally conveys feelings of dismay with her situation and guilt for hurting Kieffer.\nWhat is Delp up to now, besides these alleged conversations with Jenelle?\nThe former drug addict now struggles with alcohol dependence, as reported by Wet Paint and confirmed by his Twitter. Perhaps he would be better served by actually addressing his issues versus tweeting a million emoticons about them. His Twitter bio is simply \"you know how choices can be,\" which is interesting, because I'm not sure if the poetry-writing Lothario is ready to recognize the weight of his choices just yet. However he does seem to be getting more introspective, tweeting just this month about not being able to control his emotional self\nFollowers are on Kieffer's case to find a vocation. A tweet pondering if he should \"grow up\" and work is met with a plea to get back to school and find a job (Kieffer doesn't respond to that user, but does respond to one praising him). Only time will tell if Kieffer will actually make good on some sort of growing up initiative and get the help he needs, or if he will continue to slide into substance abuse while obsessing over Jenelle.\nImage: MTV","url":"https://www.bustle.com/articles/35496-what-is-kieffer-from-teen-mom-2-doing-jenelles-ex-is-still-up-to-no-good"}
