{"authors":["Abc News","More Meghan"],"date_download":"2018-10-30 00:57:11","date_modify":"2018-10-30 00:57:11","date_publish":"2018-10-29 09:38:47","description":"Law enforcement is investigating a series of posts allegedly by the suspect.","filename":"data/vaneerConsumption/WhatisGabthesocialnetworkallegedlyusedbythePittsburghsynagogueshooter.json","image_url":"https://s.abcnews.com/images/US/gab-01-as-ht-180126_hpMain_2_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/US_gab-social-network-allegedly-pittsburgh-synagogue-shooter_story_id=58825693_1540861031.html","title":"What is Gab, the social network allegedly used by the Pittsburgh synagogue shooter?","title_page":"What is Gab, the social network allegedly used by the Pittsburgh synagogue shooter? - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Social media posts have become an integral source of clues and possible evidence in criminal investigations in recent years, and the search for answers in the wake of the Pittsburgh synagogue shooting that killed 11 is no different.\nBut in this case, rather than posting on giant, widely-used social media platforms like , Instagram and , however, the shooting suspect, Robert Bowers, allegedly used a lesser-known site, Gab.\nBowers' profile on Gab, according to a cached version, said, “Jews are the children of Satan,” and a post written shortly before Saturday’s shooting criticizes a Jewish organization that assists refugees and includes the statement, “Screw your optics, I’m going in.”\nAP\nGab is less mainstream than its better-known counterparts, and that may be part of its attraction to some users.\nGab is a micro-blogging site, similar in structure to Twitter, that has become popular with white nationalists and others espousing extremist views.\nThe platform has not been allowed to distribute its apps through either the Apple App Store or the Android store but it has tweeted that it gets 9 million visits per month and has a community of 800,000 people around the world.\nGab's CEO announced in a statement that his company is working with investigators of the synagogue shooting \"to bring justice to an alleged terrorist.\"\n\"Because of the data we provided, they now have plenty of evidence for their case,\" CEO Andrew Torba wrote.\nBut the Gab chief also defiantly defended his platform, which some internet providers have apparently cut ties with in the wake of the shooting Saturday.\n\"We are the most censored, smeared, and no-platformed startup in history, which means we are a threat to the media and to the Silicon Valley Oligarchy,\" Torba wrote. \"Gab isn’t going anywhere.\"\nHosting provider GoDaddy confirmed to ABC News that it notified Gab it had 24 hours to move its domain to another registrar “as they have violated our terms of service.”\n“In response to complaints received over the weekend, GoDaddy investigated and discovered numerous instances of content on the site that both promotes and encourages violence against people,” the hosting provider said in its statement.\nStripe, another web hosting company, has also stopped hosting Gab. So have Microsoft and hosting provider Joyent, according to Gab's tweets.\nWhile Gab's supporters defend the site for supporting \"free expression and liberty,\" as Torba put it, critics said the platform allows its users to cloak \"toxic and hateful ideas.\"\nGab is “one site of many that exist in this rising trend of alternative media platforms that promises censorship-resistant design,\" said Benjamin T. Decker, a research fellow at the Shorenstein Center at Harvard's Kennedy School.\nDecker noted that posts allegedly by Bowers referred to the Central American migrant caravan traveling toward the U.S. and “to Jewish control over the government and a historical war over white Christianity.”\n“What these spaces do -- and the media influencers that operate in them -- they can use nominal party politics... to essentially cloak much more toxic and hateful ideas that might not be allowed on a Facebook or Twitter or YouTube,”\n“They utilize it [newsworthy political discussions] to present a series of false equivalencies,” Decker said.\nOne person with an inside view of Gab is its former COO, Utsav Sanduja, who joined the company about a month after it started two years ago and left in June. Sanduja told ABC News that he “left the company over some differences in opinion” and said, “the decision was mutual.”\nSanduja said the platform has guidelines it enforces. “Gab has removed users in the past for death threats and people calling for violence,” he said.\nBut he added that he has personally experienced the real-world threats that can come from online hate.\nSanduja said that his wife works at a synagogue and received death threats while he worked at Gab.\n“I honestly don’t know how that came up, but apparently some of her personal information was found out and my family and I went through quite a lot of abuse, a systemic targeting from really vicious people, and honestly it just took a toll on us mentally,” he said.\n“I do believe in the concept of free speech. I do believe in the concept of free speech on the web, but I really believe it can be effective with the proper checks and balances in place,” said Sanduja, who now works as a consultant at his own firm.\nAs for Gab, Decker said he thinks examples of its closing the accounts of some extremists are essentially window dressing.\n“There's probably maybe a total of 10 situations where there are easy, high-level things they can point to and say ‘Look we don’t accept that behavior,’” Decker said. \"It's symbolic.\"\nBenjamin Decker's interview with ABC's Brad Mielke was featured in the Oct. 29, 2018, episode of ABC News' daily news podcast \"Start Here.\"\n\"Start Here\" is the flagship daily news podcast from ABC News -- a straightforward look at the day's top stories in 20 minutes. Listen for free every weekday on Apple Podcasts, Google Podcasts, iHeartRadio, Spotify, Stitcher, TuneIn, or the ABC News app. On Amazon Echo, ask Alexa to \"Play 'Start Here'\" or add the \"Start Here\" skill to your Flash Briefing. Follow @StartHereABC on Twitter, Facebook and Instagram for exclusive content, show updates and more.","url":"https://abcnews.go.com/US/gab-social-network-allegedly-pittsburgh-synagogue-shooter/story?id=58825693"}
