{"authors":[],"date_download":"2018-10-22 22:28:40","date_modify":"2018-10-22 22:28:40","date_publish":"2014-06-09 22:55:17","description":"The American Chemical Society has made a video explaining why something so good for your body is so bad for your breath.","filename":"data/vaneerConsumption/WhatCausesNastyGarlicBreathScienceHastheAnswer.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/497661/140609-garlic-bulbs-1612_3cbd7c051f1f816c9f8336ae1e80a293.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_weird-science_what-causes-nasty-garlic-breath-science-has-answer-n126811_1540247320.html","title":"What Causes Nasty Garlic Breath? Science Has the Answer","title_page":"What Causes Nasty Garlic Breath? Science Has the Answer","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGarlic adds a wonderfully pungent aroma and flavor to foods — and it’s got health benefits as well, having been used to help treat everything from high blood pressure to skin infections. So why is it that something so good for your body is so bad for your breath?\nThe American Chemical Society, collaborating with the Compound Interest blog, has produced a video to illustrate the answer to that question.\nGarlic contains four major organic compounds responsible for the reek in your breath: diallyl disulfide, allyl methyl sulfide, allyl mercaptan and allyl methyl disulfide. Interestingly, none of these compounds is present in garlic when it's in the ground. It’s only when the cloves are chopped or crushed that they’re formed and released.\nThe biggest culprit is allyl methyl sulfide, which is slow to break down in your body after you eat garlic. Even if you brush your teeth or rinse your mouth, the bad breath still remains and can last for hours.\nHow to cover up that stinky garlic breath? Try chewing on some parsley or drinking a glass of milk, the American Chemical Society suggests. You can also check out these 10 tips for combating occasional bad breath.\n— James Eng, NBC News","url":"https://www.nbcnews.com/science/weird-science/what-causes-nasty-garlic-breath-science-has-answer-n126811"}
