{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:12:06","date_modify":"2018-10-31 00:12:06","date_publish":"2016-06-07 08:00:00","description":"How much information should be available to the public in cases of severe child abuse? California lawmakers and the administration of Gov. Jerry Brown","filename":"data/vaneerConsumption/Whattodisclosewhenanabusedchildnearlydies.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/Child-welfare_LAT-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944726.html","title":"What to disclose when an abused child nearly dies","title_page":"What to disclose when an abused child nearly dies | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"How much information should be available to the public in cases of severe child abuse?\nCalifornia lawmakers and the administration of Gov. Jerry Brown have been at odds over that question for the last two years. Legislators recently rejected a proposal to limit public access to reports on abuse so extreme that children nearly die.\nThe schism reflects a fight between advocates for children and foster youths, on the one hand, and, on the other, the government agencies and workers tasked with protecting them from harm. At stake is about $5 million in federal funds and the outcome of a debate pitting privacy arguments against revelations of what social workers knew about a family situation before it grew almost deadly.\nState law already requires the release of original caseworker reports when children die from abuse or neglect, sometimes exposing serious lapses in the government’s care of vulnerable kids.\n“We spend a lot of time talking about the value of transparency in government, and I think that applies to this scenario too,” state Sen. Holly Mitchell (D-Los Angeles) said of cases deemed “near fatalities.”\n“If shedding light on a particular practice, a particular worker, can create… a different internal procedure that can have a positive outcome for the next child, that should be our collective goal.”\nMitchell chairs the Senate committee that turned down a proposal from Brown’s Department of Social Services to require summaries of social worker reports – not the reports themselves – to be disclosed in near-fatal child abuse cases.\nOver the last eight years, 855 children in California were abused so severely that their cases qualified as near fatalities, according to the Department of Social Services. The term is used when abuse victims end up in serious or critical condition. During the same period, 980 California children died from abuse.\nIn a high-profile Los Angeles case, documents released after 8-year-old Gabriel Martinez died in 2013 with a cracked skull and broken ribs showed that local officials left him with his mother despite having investigated her for abuse six times. Records also showed an unresolved allegation of abuse that social workers failed to investigate in the time required by law.\nBy contrast, state law is silent on the release of information when children barely survive abuse.\n“We were proposing to create a process that would require disclosures,” said Michael Weston, a deputy director in the state Department of Social Services. “There are currently no laws that require reporting.”\nKPCC Take Two: When it comes to severe child abuse cases, how much information should be disclosed to the public?\nThe department pitched a similar plan to the Legislature last year, but lawmakers did not accept it. This year, officials came back arguing that California is at risk of losing nearly $5 million in federal funding if it does not pass a law defining what information must be made public in near-fatal abuse cases.\nDisclosing a summary of findings would protect the privacy of a child recovering from abuse and adults or siblings in the home who were not responsible for it, state officials said, while meeting federal reporting requirements. Their plan had support from the Service Employees International Union, which represents social workers, and the County Welfare Directors Association, which represents local agencies that oversee child protective services.\n“We appreciate the Administration’s thoughtful balancing of the public’s right to know certain relevant information about these types of incidents with the need to protect privacy for the affected children who are still alive and trying to recover from serious injuries and trauma,” the groups wrote in a joint letter of support for the bill.\nBut Ed Howard, a lobbyist for the Children’s Advocacy Institute, protested that the administration’s approach “elevated the needs of government over the needs of kids.”\nBy the numbers 855 Number of California children, between 2008 and 2015, who were abused so severely that their cases qualified as near fatalities. 980 Number of California children, between 2008 and 2015, who died from abuse. Source: California Department of Social Services\nFoster youth groups objected, too, arguing that original documents are more informative, and releasing them after near-fatalities would force counties to improve in how they look out for kids.\nChildren’s advocates and newspaper publishers lobbied for a bill that would require disclosure of reports on near-fatalities the same way it’s done when youngsters die.\nThe administration’s latest proposal surfaced last month as part of Brown’s revised state budget blueprint — a common way of passing laws that may be only tangentially related to the budget and one that avoids the lengthier vetting regular bills receive.\n“They simply thrust it on everyone with this gun-to-the-head approach and attempted to get it jammed into the budget that way,” said Jim Ewert, lobbyist for the California Newspaper Publishers Association, which promotes open government and access to public records.\nLawmakers rejected the proposal after the outcry from advocates. A new version is in the works, several people involved in the negotiations said, and could take shape in the budget Brown and lawmakers must complete this month or in later legislation.","url":"https://calmatters.org/articles/what-to-disclose-when-an-abused-child-nearly-dies/"}
