{"authors":[],"date_download":"2018-10-30 21:07:31","date_modify":"2018-10-30 21:07:31","date_publish":"2018-09-05 21:49:00","description":"Line of succession: What is the 25th Amendment and how does it work?","filename":"data/vaneerConsumption/Whatisthe25thAmendmentandhowdoesitwork.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/09/06/Videos/4477371.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_what-the-25th-amendment-and-how-does-work__1540933651.html","title":"What is the 25th Amendment and how does it work?","title_page":"Line of succession: What is the 25th Amendment and how does it work?","title_rss":"NULL","source_domain":"ajc.com","text":"An op-ed written by an anonymous, senior member of the Trump Administration and published by the New York Times outlines alleged efforts that have been made by members of the administration to temper Donald Trump’s erratic behavior and “misguided impulses.”\nThroughout the op-ed, the writer describes an unstable, indecisive Trump, who ignores the country’s ties to our allies, and who often changes his mind on policy deicisons within days.\nThe writer says there are people in place who are putting the country first.\n“It may be cold comfort in this chaotic era, but Americans should know that there are adults in the room,” the author writes. “We fully recognize what is happening. And we are trying to do what’s right even when Donald Trump won’t.”\nOne of the avenues considered by some members of Donald Trump’s leadership team, according to the author, was invoking the 25th Amendment. However, they decided against that when they realized it would set off a Constitutional crisis.\nThe 25th Amendment outlines the presidential line of succession, or who becomes president should the president become disabled, resign or be removed from office.\nThe clause has never been invoked in the 50 years since the amendment was adopted on Feb. 10, 1967.\nThis is not the first time the 25th Amendment has made the news in relation to Trump’s presidency.\nIn July 2017, Rep. Jamie Raskin, D-Maryland, introduced a bill to establish an independent commission on presidential capacity.\nThe bill would allow Congress to “guarantee the security of the nation and effectiveness of government when serious concerns have been raised about the president’s ability to execute the responsibilities of the office.”\nRaskin referenced the 25th Amendment to the United States Constitution in the bill, which asks for the creation of a congressional body “to determine presidential fitness.”\n.@POTUS' incapacity must be seriously addressed. Check out my bill, the Oversight Commission on Presidential Capacity Act, HR 1987. #OCPCAct pic.twitter.com/f4Qszs2iLY — Rep. Jamie Raskin (@RepRaskin) May 12, 2017\nThe interest in the amendment started soon after the presidential election in November and first spiked in February 2017, around the time that Michael Flynn was fired as national security adviser.\nA story from Business Insider suggests the increased interest rests with those who oppose the president and have discovered the fourth clause of the document. They see it as a way to remove President Donald Trump from office.\nThat clause states, “Whenever the Vice President and a majority of either the principal officers of the executive departments or of such other body as Congress may by law provide, transmit to the President pro tempore of the Senate and the Speaker of the House of Representatives their written declaration that the President is unable to discharge the powers and duties of his office, the Vice President shall immediately assume the powers and duties of the office as Acting President.”\nIn short, the clause means that Vice President Mike Pence along with 13 of the 24 members of the Cabinet could decide the president is unable to do his job and remove him from office. In that case, Pence would become president.\nA president can fight such a move by a vice president and send the decision on removal to a vote in Congress.\nSo, what would happen if President Trump were to resign, become disabled or be removed from office? Who would become president? Here’s the line of succession for the presidency of the United States.\n1. Vice President\n2. Speaker of the House of Representatives\n3. President pro tempore of the Senate\n4. Secretary of State\n5. Secretary of the Treasury\n6. Secretary of Defense\n7. Attorney General\n8. Secretary of the Interior\n9. Secretary of Agriculture\n10. Secretary of Commerce\n11. Secretary of Labor\n12. Secretary of Health and Human Services\n13. Secretary of Housing and Urban Development\n14. Secretary of Transportation (Currently Elaine Choa, who is not a natural-born U.S. citizen, and cannot become president.)\n15. Secretary of Energy\n16. Secretary of Education\n17. Secretary of Veterans Affairs\n18. Secretary of Homeland Security","url":"https://www.ajc.com/news/national/what-the-25th-amendment-and-how-does-work/GWFEpaIYoCy8XZfc6OWKkJ/"}
