{"authors":[],"date_download":"2018-10-22 20:49:24","date_modify":"2018-10-22 20:49:24","date_publish":"2014-06-03 02:38:56","description":"For Alan Alda's annual Flame Challenge, scientists explained how color perception works — and kids decided which explanations were the best.","filename":"data/vaneerConsumption/WhatIsColorKidsPicktheWinnerinAlanAldasFlameChallenge.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/483056/140602-color_289a0911f74e2ed8d286da72dd6c9a90.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_what-color-kids-pick-winner-alan-aldas-flame-challenge-n120931_1540241364.html","title":"What Is Color? Kids Pick the Winner in Alan Alda's Flame Challenge","title_page":"What Is Color? Kids Pick the Winner in Alan Alda's Flame Challenge","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNEW YORK — Most people likely think they know what color is, but they should try explaining the concept to an 11-year-old. Even scientists have a hard time.\nLast year, as part of his annual Flame Challenge, actor-turned-science-advocate Alan Alda invited scientists to come up with accurate, vivid answers to the deceptively simple question, \"What is color?\" On Sunday, Alda announced the winners here at the World Science Festival during an event that explored what color is (and isn't) made of, how the brain perceives it, and how some individuals can even \"see\" it in music and smells.\nMore than 27,000 schoolchildren from 19 countries helped pick the winners from nearly 400 entries, Alda told a packed auditorium at New York University's Skirball Center for the Performing Arts. [Easy Answers to the Top 5 Science Questions Kids Ask]\nThe prize in the video category went to Dianna Cowern, an outreach coordinator in the physics department at the University of California at San Diego who runs a YouTube channel under the name Physics Girl. In her video clip, Cowern wears costumes and interacts with animations, asking her viewers to imagine themselves as color taking a journey from a wavelength of light to a reflection to a brain signal to a perception.\nAlda, a founding member of the Center for Communicating Science at Stony Brook University, praised Cowern for respecting the knowledge of her audience while still being playful. \"It was humorous and joyous, but it didn't disrespect the kids, and I love that,\" Alda told her.\nMelanie Golob, a science communicator who works for a company called Doctor Evidence, took home a Flame Challenge trophy for her written explanation.\n\"Color itself isn't a thing we can touch, like a pencil or book; color is how our eyes interpret reflection of light off of certain objects,\" Golob said in her entry. \"That's why we don't see colors in the dark; there's no light to reflect.\"\nAlda, who is most famous for portraying Hawkeye Pierce on the TV series \"M*A*S*H,\" kicked off the evening with a familiar tale. As a curious 11-year-old pondering the nature of fire, Alda asked his science teacher, \"What's a flame?\" and was unsatisfied by her answer: \"It's oxidation.\"\n\"I didn't know any more about than I did before,\" Alda said. \"It's just like calling it by another name. It's [as if] I said, 'What's a flame?' and she said, 'Oh, that's Fred.'\"\nThat experience inspired Alda's inaugural Flame Challenge in 2011. The next year, Alda asked scientists to explain time.\nColor as light\nAt Sunday's event, as the World Science Festival was drawing to a close, Alda invited scientists, artists, children and even a synesthete (someone who experiences blended senses) to come on stage and help explain color.\nTo demonstrate that what people perceive as color is something that happens in the brain, and not an inherent characteristic of an object, Jay Neitz, an ophthalmology professor and color vision researcher at the University of Washington in Seattle, had seven kids line up. Each child wore a shirt representing a hue of the rainbow. [Your Color Red Could Be My Color Blue]\n\"When we look at something and we see a color, it's easy to imagine that that color is actually a property of the object we're looking at, but it's not,\" Neitz said. \"Color is a property of the light that's falling on the object and, even more important, our brain's reaction to the light that's reflected in our eyes.\"\nThe stage lights dimmed, and a sodium lamp producing just a single yellow-light wavelength bounced off the kids' shirts — no longer a rainbow but an array of dull yellows. Neitz then used a \"magic wand\" (a white light flashlight) to restore the red, green, indigo and other colors.\nFeeling color?\nWhen some people say they can hear or smell color, they aren't being poetic; rather, they're having a genuine perceptual experience known as synesthesia. David Eagleman, a neuroscientist at Baylor College of Medicine in Houston, spoke about how some people can experience color this way.\nEagleman said synesthesia has proved beneficial for artists like Wassily Kandinsky and David Hockney — as well as memory champions, including one man who memorized 30,000 digits of the never-ending mathematical constant pi.\n\"For him, not only does each digit of pi have a color, but it has a texture, a gender, a shape and a personality,\" Eagleman said. \"And so for him, there's this whole story landscape that's going on, and he's able to memorize pi out to very large numbers.\"\nKaitlyn Hova, a violinist and synesthete, helped demonstrate how scientists can \"test\" people for synesthesia by using a tool called Synesthesia Battery, which was developed by Eagleman's lab. With a projection of flashing colors that accompanied a song on the electric violin, Hova also showed the crowd what she sees when she plays music: Hitting a G note, for example, triggered a splash of green.\nAlda is seeking questions for his next challenge. To learn more, visit the Flame Challenge website.\n— Megan Gannon, LiveScience\nFollow Megan Gannon on Twitter and Google+. Follow LiveScience on Twitter, Facebook and Google+. Original article on LiveScience.","url":"https://www.nbcnews.com/science/science-news/what-color-kids-pick-winner-alan-aldas-flame-challenge-n120931"}
