{"authors":[],"date_download":"2018-10-30 21:07:38","date_modify":"2018-10-30 21:07:38","date_publish":"2018-09-15 03:00:36","description":"The Special Counsel investigation led by former FBI Director Robert Mueller took a big step forward on Friday, as former Trump Campaign Manager Paul Manafort plead guilty to two criminal charges, and more importantly agreed to cooperate with Mueller's investigation, which President Donald Trump has ...","filename":"data/vaneerConsumption/WhattheManafortguiltypleamightmeanfortheMuellerprobe.json","image_url":"https://cmgajcjamiedupree.files.wordpress.com/2018/09/manafort471.jpg?w=150","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/jamiedupree.blog.ajc.com/2018_09_15__1540933658.html","title":"What the Manafort guilty plea might mean for the Mueller probe","title_page":"What the Manafort guilty plea might mean for the Mueller probe | Jamie Dupree - AJC","title_rss":"NULL","source_domain":"ajc.com","text":"View Caption Hide Caption\nThe Special Counsel investigation led by former FBI Director Robert Mueller took a big step forward on Friday, as former Trump Campaign Manager Paul Manafort plead guilty to two criminal charges, and more importantly agreed to cooperate with Mueller’s investigation, which President Donald Trump has repeatedly denounced as a ‘witch hunt.’\nManafort had already been convicted on eight charges of bank and tax fraud in an earlier federal trial in Virginia; his trial in Washington, D.C. was to begin next week, focused on allegations that he failed to disclose his foreign lobbying work, money laundering, and false statements to government agencies.\nNow that Manafort is working with Mueller investigators, what does that change? Will it lead to something dramatic? Or is this just a nothing burger?\n1. The biggest unknown is all about the President. With Manafort now cooperating with the Special Counsel investigation, Robert Mueller’s investigators are able to get information from Mr. Trump’s former campaign manager, deputy campaign manager (Rick Gates), and future National Security Adviser (Michael Flynn). But does any of it get to the issue of contacts between the Trump Campaign and Russian intermediaries? That remains the big unknown. For many supporters of the President, this remains a witch hunt, as they argue Manafort has nothing that ties the Trump campaign to Moscow. To quote one of my colleagues – time will tell.\n.@ByronYork on Manafort guilty plea: \"All this kind of talk that Manafort is the big one…I think that all of that is based on an assumption, a belief that there is some big conspiracy between Trump and Russia that only Paul Manafort can reveal.\" #TheStory pic.twitter.com/3yoKvoqNmN — Fox News (@FoxNews) September 14, 2018\n2. The Manafort plea might have a short term benefit for Trump. In one sense, not having the start of a second trial next week for Manafort is probably good for the White House. The first trial produced a daily drumbeat of news for several weeks, and when the verdicts came down, it grabbed the headlines. With this plea bargain by Manafort, now that court scene – and all the testimony – won’t be repeated over the next few weeks, and even into October. In that sense, that’s good for the President. The flip side is that Manafort is cooperating with investigators, something that President Trump had praised him for not doing, just several weeks ago. “Such respect for a brave man!” the President tweeted on August 22. Now that’s changed.\nI feel very badly for Paul Manafort and his wonderful family. “Justice” took a 12 year old tax case, among other things, applied tremendous pressure on him and, unlike Michael Cohen, he refused to “break” – make up stories in order to get a “deal.” Such respect for a brave man! — Donald J. Trump (@realDonaldTrump) August 22, 2018\n3. There is no language barring Manafort cooperation on Russia probe. I don’t know where this started on social media, but soon after Manafort plead guilty, a number of people told me that I was lying about the details of the Manafort cooperation agreement. But nowhere in the 17 page document is there anything that says Manafort won’t be helping out on the question of Russian interference in the 2016 elections. Again – Manafort may not have anything to offer on that question – but he has agreed in this plea bargain to fully cooperate “in any and all matters which the Government deems the cooperation relevant.”\n4. What might Mueller want to get from Manafort? Some of the answers to this are obvious. Manafort was a part of the infamous Trump Tower meeting between campaign officials and a woman lawyer who represented herself as having ties to the Kremlin. Manafort might have information from inside the campaign related to Russia contacts – or maybe no Russian contacts. But some believe it could also lead to other people inside of the President’s tight inner circle as well. Seth Waxman is a former federal prosecutor.\nSo much for Mueller not taking significant action in the 60 days leading up to the 2018 mid-terms. Doesn't get much more significant than Mueller. Trump Jr. and Kushner are next . . . . #Mueller #Trump #Manafort #ManafortFlip — Seth Waxman (@sethwaxman) September 14, 2018\n5. The Mueller investigation is not ending soon. For anyone who was hoping that the former FBI Director was going to wrap up his work soon, one might argue the exact opposite at this point. With the plea bargain involving Manafort – and his cooperation agreement – the Mueller team seems to be gaining momentum. We learned nuggets from the first Manafort trial about possible foreign money in the Trump Inauguration. And don’t forget – there’s still the open question of whether the President will answer any questions from the Special Counsel. While the President’s legal team keeps saying it’s almost over – it’s not.\nNEW: People who worked with MANAFORT in Ukraine think his real value to MUELLER may be flipping on the oligarchs, the pols they funded & the Western firms/operatives who assisted them, including ones he recruited, like TONY PODESTA, MERCURY & @SKADDENARPS. https://t.co/eubx2gJzfq — Kenneth P. Vogel (@kenvogel) September 15, 2018","url":"http://jamiedupree.blog.ajc.com/2018/09/15/what-the-manafort-guilty-plea-might-mean-for-the-mueller-probe/"}
