{"authors":["Patrick Marmion For The Daily Mail"],"date_download":"2018-10-22 22:53:20","date_modify":"2018-10-22 22:53:20","date_publish":"2017-03-10 01:42:23","description":"Before Monty Python and Fawlty Towers came Joe Orton. Now, the bad boy from Leicester makes a triumphant return to his native city with a riotous production of his best comedy.","filename":"data/vaneerConsumption/WhatTheButlerSawreviewbyPATRICKMARMION.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E0979EB00000578-0-image-a-45_1489109903885.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299712_A-bonkers-production-Butler-Saw_1540248800.html","title":"What The Butler Saw review by PATRICK MARMION","title_page":"What The Butler Saw  review by PATRICK MARMION | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"What The Butler Saw (Curve Theatre, Leicester)\nRating:\nBefore Monty Python and Fawlty Towers came Joe Orton, the original master of madcap farce. A subversive theatrical delinquent of the Sixties, he met a gory end at the hands of his lover — the story of Alan Bennett’s screen adaptation Prick Up Your Ears.\nNow, the bad boy from Leicester makes a triumphant return to his native city with a riotous production of his best comedy, starring Rufus Hound and Jasper Britton.\nJoe Orton, original master of madcap farce, returns to Leicester with a riotous production of his best comedy, starring Rufus Hound and Jasper Britton.\nThe mayhem kicks off with a randy doctor (Hound) inviting his secretarial temp (Dakota Blue Richards) to strip for a physical examination before he offers her the job. But his furtive designs are thwarted: first by his sex maniac wife, being blackmailed by a bellhop from the Station Hotel, then by a swivel-eyed inspector of psychiatric facilities.\nI sometimes find Orton dated — too stuck in the Carry On titters of his times. But if the idea of busty secretaries and desperate doctors sounds a bit yesteryear, Nikolai Foster’s wicked revival is deliciously risque. He rejoices in the comedy of transvestism and sexual identity, re-infusing both with the joy they had before political correctness.\nBritton raises the loony bar as the man from the Ministry. Richards and Jack Holden are delightful as the shapely youngsters, while Catherine Russell and Ravi Aujla stomp purposefully about as the hallucinating housewife and simple-minded policeman.\nA joke about a missing piece of a Winston Churchill statue may alarm those of a sensitive disposition, but that, and all the foregoing confusion, are imbued with an innocence that is blissfully bonkers.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299712/A-bonkers-production-Butler-Saw.html"}
