{"authors":["Georgette Eva"],"date_download":"2018-10-30 23:24:30","date_modify":"2018-10-30 23:24:30","date_publish":"2014-08-13 18:51:01","description":"Blake Lively and Ryan Reynolds, the well-coiffed blonde couple that they are, are sickeningly good together. I only say that with a hint of bitterness because I am still reeling in the potential downfall of the powerhouse that is Beyoncé and Jay Z.…","filename":"data/vaneerConsumption/WhatMakesBlakeLivelyRyanReynoldsBestFriendsLetsDiveIn.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/2f93aa47-8748-4be9-8357-249f43ae28c6.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35618-what-makes-blake-lively-ryan-reynolds-best-friends-lets-dive-in_1540941870.html","title":"What Makes Blake Lively & Ryan Reynolds Best Friends? Let's Dive In","title_page":"What Makes Blake Lively & Ryan Reynolds Best Friends? Let's Dive In","title_rss":"NULL","source_domain":"bustle.com","text":"Blake Lively and Ryan Reynolds, the well-coiffed blonde couple that they are, are sickeningly good together. I only say that with a hint of bitterness because I am still reeling in the potential downfall of the powerhouse that is Beyoncé and Jay Z. I feel things too much, okay? But what Lively and Reynolds seem to have down pat in their two-year marriage is that they are best friends first and foremost, because who else can you trust to tell you that you have spinach in your teeth or that your outfit seriously isn’t working for you other than your best friend?\nOf course, looking at the pristine golden-haired duo, I sincerely doubt that they get so much as a hair out of intentionally disheveled place, but, hey, they probably would. If Reynolds isn’t spotted visiting Lively on set or if the Gossip Girl actress isn’t hooked onto her man’s arm at Cannes, then they’re spending nights together, cooking dinner. Do you think you and your boo have the same chemistry? You wish. Check out what Lively has to say about her and her best friend/husband, and get ready to feel all kinds of feels.\nWhat do you and your friend do for fun? You don't have more fun than Reyvely\nAndreas Rentz/Getty Images Entertainment/Getty Images\nCover girl Lively told Marie Claire magazine that she and Reynolds don't make plans: “The best part is when we turn off our phones and just talk and hang out. He’s my best, best friend. What do you do with your best friend? You do nothing.”\nYou know you're comfortable with a person when you can have an absolutely blank agenda, when you meet up and have that be enough. There's no need to force conversation or activity, because sometimes being with another is just enough.\nDo you guys bring out the best in each other?\nMichael Caulfield/Getty Images Entertainment/Getty Images\nMy best friend and I have such different tastes and opinions on art, music, and TV shows, and when we disagree we'll listen to each other as we argue our points. But it's great because my bestie brings out a whole new perspective on things, and I love listening to her explain why she's influenced by something I can't understand. It looks like Lively does the same.\nWhen talking about her site Preserve and Reynolds' possible involvement, Lively said to Marie Claire that “[h]e’s incredibly involved. We’re involved in everything that the other does. But he’s influenced my taste so much on things like home design, things that I never loved before I now love because of him. There is nothing that goes through that I don’t run by him.”\nDo you collaborate?\nAndreas Rentz/Getty Images Entertainment/Getty Images\nWhether they're dinner decisions, moving furniture, or a haircut, sometimes you just want a second perspective to talk at — sometimes just to organize your own thoughts — and Lively and Reynolds totally work it out with Preserve. “On the site, when I’m doing photo kills, I’ll say, ‘What photos do you think? This one or do you think that one?’ And I love that he challenges me,\" she told E! \"He’s someone that I trust when I feel that was the right way and then other times I think, ‘Oh, shoot I should have gone with those photos or I should have gone with that writer.’ That’s nice. It’s nice to have a partner in everything.”\nDo you personalize your gifts?\nVittorio Zunino Celotto/Getty Images Entertainment/Getty Images\nI'll be honest, gifts are hard — I miss the days when I got away with getting everyone a Snuggie — but with the right couple, gifts are a breeze. It's even easier when that person is your best friend. With Lively and Reynolds' second anniversary coming up, Lively told E! that she and her hubs prefer doing something DIY when it comes to gifts. “Normally, we make something for each other,” she said, “because that’s something that lasts and isn’t something you just found and bought in a store.”\nMaybe they can make each other friendship bracelets? Or a nice set of matching \"Be Fri\" and \"St End\" pendants that can lock together?\nImages: Getty Images (4)","url":"https://www.bustle.com/articles/35618-what-makes-blake-lively-ryan-reynolds-best-friends-lets-dive-in"}
