{"authors":["Ashley Rey"],"date_download":"2018-10-31 01:39:37","date_modify":"2018-10-31 01:39:37","date_publish":"2018-08-30 23:17:46","description":"While many Americans are planning to ring in the upcoming three-day weekend with barbecues and parades, adding a binge session filled with shows and films surrounding the very meaning of Labor Day to your plans should also be a must. And in case you…","filename":"data/vaneerConsumption/WhatToWatchOnNetflixOverLaborDayWeekendToCloseOutYourSummer.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/30/4fd3a572-8239-44f3-9e5a-9514eba9ce1a-19c1043e-81a0-4ded-a8de-9e370d937dce.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_what-to-watch-on-netflix-over-labor-day-weekend-to-close-out-your-summer-11462899_1540949977.html","title":"What To Watch On Netflix Over Labor Day Weekend To Close Out Your Summer","title_page":"What To Watch On Netflix Over Labor Day Weekend To Close Out Your Summer","title_rss":"NULL","source_domain":"bustle.com","text":"While many Americans are planning to ring in the upcoming three-day weekend with barbecues and parades, adding a binge session filled with shows and films surrounding the very meaning of Labor Day to your plans should also be a must. And in case you need a little help crafting that playlist, below are some movies and TV shows you should watch on Netflix over Labor Day weekend that'll totally make you feel the love.\nBut, why we even celebrate Labor Day in the first place, you ask? Well, for over a century the first Monday in September has been dedicated to the many working Americans who strive to make the country a better place each year. And so, this upcoming Monday, Sept. 3, it's important to mull over the contributions that many have made to strengthen the current work force America has today. While barbecues and parades are always nice, nothing says \"celebration\" like a playlist comprised of television series and films that are all about the family members and friends who help you maintain a healthy work-life balance.\nFrom Rev Run's new Netflix series All About the Washingtons, to Academy Award nominated film Mudbound, to even the classic NBC sitcom The Office, these projects are sure to remind you of the love, laughter, and support from your own tribe that gets you through the work day.\n1 ‘All About The Washingtons’ Netflix on YouTube Described as Run's House, but with a laugh track, All About the Washingtons sets the makings of the iconic reality show into the scripted realm. And its half-hour episodes make it the perfect Netflix series to binge over the long weekend.\n2 ‘Like Father' Netflix on YouTube Real and raw, with doses of hilarity throughout, Kelsey Grammer and Kristen Bell star opposite each other in a tale that speaks to those fathers and daughters with strained relationships. And though exploring serious family dynamics, Like Father also does a great job at showing the joys that live at the other end of forgiveness. Have those tissues handy, because you're gonna need them.\n3 ‘Mudbound’ Netflix on YouTube Set in the divided climate of the World War II era, Mudbound explores the lives of two Mississippi families, and how they navigate the realities of farming, war, and friendship, in a community ravished by racial injustice.\n4 ‘The Office’ The Office US on YouTube Adapted from the British program by the same name, The Office (U.S.) is the perfect satirical comedy to remind you that there are actual humans living behind those not-so-beloved colleagues of yours.\n5 ‘One Day At A Time’ Netflix on YouTube And nothing says hardworking like Justina Machado's character of Penelope Alvarez in the Netflix hit One Day at a Time. The single mom, war veteran and nurse works day-in and day-out to make sure her two kids are safe, secure, and happy, while also enduring the stresses that come with having her widowed mother (played by Rita Moreno) in-house. It's hilarious, heartwarming, and downright inspiring to watch, and definitely one you'll want to binge before Season 3 hits the airwaves in 2019.\n6 ‘Queer Eye’ Netflix on YouTube And if you're in need of a little pick me up, the Fab Five is here to deliver. Together, the fashionable crew travel from city to city, making over the lives of the most deserving and hardworking individuals — leaving them with healthy doses of self-love and confidence as they exit. The Queer Eye for the Straight Guys reboot may feature five new lifestyle experts — Bobby Berk, Tan France, Antoni Porowski, Karamo Brown, and Jonathon Van Ness — but the same sense of inspirational wonder the original had is still felt within.","url":"https://www.bustle.com/p/what-to-watch-on-netflix-over-labor-day-weekend-to-close-out-your-summer-11462899"}
