{"authors":["Rachel Paige"],"date_download":"2018-10-30 23:33:22","date_modify":"2018-10-30 23:33:22","date_publish":"2014-08-13 16:40:55","description":"For anyone who wants to feel super old right now, Teen Mom Maci Bookout's son Bentley started kindergarten this week. There's no way you've already forgotten about Maci, originally from 16 and Pregnant, and her little bundle of joy, Bentley. The…","filename":"data/vaneerConsumption/WhatHasTeenMomMaciBeenUpToSheBentleyAreAllGrownUp.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/4e92d1df-a182-48af-b4ab-61747a4f761d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35437-what-has-teen-mom-maci-been-up-to-she-bentley-are-all-grown-up_1540942402.html","title":"What Has 'Teen Mom' Maci Been Up To? She & Bentley Are All Grown Up","title_page":"What Has 'Teen Mom' Maci Been Up To? She & Bentley Are All Grown Up","title_rss":"NULL","source_domain":"bustle.com","text":"For anyone who wants to feel super old right now, Teen Mom Maci Bookout's son Bentley started kindergarten this week. There's no way you've already forgotten about Maci, originally from 16 and Pregnant, and her little bundle of joy, Bentley. The original Teen Mom may have ended in 2012, but Maci and Bentley made for an unforgettable, adorable pair. Now that you've reminisced about your favorite MTV stars, enjoy feeling super old, because if Bentley is starting kindergarten, that means the first season of 16 and Pregnant took place just about six years ago. You're welcome.\nMaci, now 23, has managed to shy away from the public eye for the last few years, though she has popped up every now and then. After Teen Mom she filmed Being Maci, which served as a follow up to her journey across the MTV airwaves, and she used the hour long program to show viewers just how much she's changed since we first met her (you can currently stream it over at MTV.com). This summer, she started a \"big girl\" job, though she sadly hasn't released any details as to what it is. She's currently getting a degree in Media Technology, so hopefully her job is something awesome and cool, like working at a radio station or news, or, you know, the internet. Speaking of radio, though, the girl hosts her own radio show at a local station, and can also be found holding speaking engagements to educate others about teen pregnancy. Maci is one busy mom.\nBentley, meanwhile, looks like he had a great summer vacation, and went to the beach with his grandparents, where he played in the surf and boogie boarded and did other kid things. Sounds like a pretty awesome beach vacation if you ask me. Maci took her own vacation and headed down to Mexico with some friends. Moms are allowed to have fun, too.\nAll this leads up to an emotional first day of kindergarten for Bentley. It's crazy to think that he's already old enough to be heading off to school. It feels like just yesterday we were following the Teen Mom drama between Maci and her then boyfriend/Bentley's father, Ryan. Don't fret about Maci's current love life though, she's in a great relationship right now with a gentleman named Taylor. He even recently moved from Texas to Tennessee to be closer to her. It's great to hear that Maci is doing so well, and that Bentley is growing up so fast, because whether we want to admit it or not, we were all there from the beginning for this little kid. In a kind weird, but less creepy Truman Show-style way.\nMaci hoped to make it through the first day of school without the waterworks kicking in, but as she tweeted, that didn't exactly go as planned.\nGood luck at school, Bentley! Remember to play nice with the other kids, make friends, share your crayons, don't brag about being an MTV star, etc. They grow up so fast.\nImage: macideshanebookout/Instagram","url":"https://www.bustle.com/articles/35437-what-has-teen-mom-maci-been-up-to-she-bentley-are-all-grown-up"}
