{"authors":["Quoctrung Bui"],"date_download":"2018-10-23 05:25:56","date_modify":"2018-10-23 05:25:56","date_publish":"2014-05-09 00:00:00","description":"What is the mix of bachelor's degrees awarded today? And how has it changed since 1970?","filename":"data/vaneerConsumption/WhatsYourMajor4DecadesOfCollegeDegreesIn1Graph.json","image_url":"https://media.npr.org/assets/img/2014/05/09/screen-shot-2014-05-09-at-9.38.15-am_wide-ba0080b5a564c8a163bed1a3384fda7425c4d672.png?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_money_2014_05_09_310114739_whats-your-major-four-decades-of-college-degrees-in-1-graph_1540272356.html","title":"What's Your Major? 4 Decades Of College Degrees, In 1 Graph","title_page":"What's Your Major? 4 Decades Of College Degrees, In 1 Graph : Planet Money : NPR","title_rss":"NULL","source_domain":"npr.org","text":"What's Your Major? 4 Decades Of College Degrees, In 1 Graph\nIn honor of college graduation season, we made a graph. It answers a few questions we had: What is the mix of bachelor's degrees awarded today, and how has the mix changed over the past several decades?\nHover over the graph to see how the popularity of each category changes over time. Click or tap to see a category individually.\nA few notes:\nThe persistence of business. Business majors, which include accounting, marketing, operations and real estate, grew even more popular over the past several decades. One in 5 college grads now gets a degree in the field.\nThe decline of the education major. The education degree saw a dramatic decline, falling from 21 percent of all graduates in 1970 to just 6 percent in 2011. Does this mean there's a huge shortage of teachers? Not necessarily — it just means that far fewer students who go on to be teachers actually graduate with an education degree. According to the Department of Education, as recently as 1999 roughly two-thirds of new teachers graduated with an undergraduate degree in education. By 2009, that figure fell to just half.\nThe rise of health professions. Over the past decade, the health care sector added jobs month after month, even when jobs were disappearing elsewhere in the economy. And the field is projected to add lots more jobs in the coming decade. So it makes sense that the share of students majoring in health-related fields (like nursing, pre-med and physical therapy) rose sharply in the past decade. Roughly 1 in 10 college grads now gets a health-related degree.\nThe data come from the National Center for Education Statistics. It publishes a handy list that outlines which majors are included in which categories.","url":"https://www.npr.org/sections/money/2014/05/09/310114739/whats-your-major-four-decades-of-college-degrees-in-1-graph"}
