{"authors":[],"date_download":"2018-10-30 20:05:18","date_modify":"2018-10-30 20:05:18","date_publish":"2016-10-02 22:56:00","description":"Here’s what Falcons coach Dan Quinn had to say after the 48-33 victory over the Panthers on Su...","filename":"data/vaneerConsumption/WhatDanQuinnhadtosayafterthe4833winoverthePanthers.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/02/Images/newsEngin.16172998_Falcons-Saints-Football-Dan-Quinn.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_what-dan-qu_d16731ee83f645ab981a01b439927240__1540929918.html","title":"What Dan Quinn had to say after the 48-33 win over the Panthers","title_page":"What Dan Quinn had to say after the 48-33 win over the Panthers","title_rss":"NULL","source_domain":"ajc.com","text":"Here’s what Falcons coach Dan Quinn had to say after the 48-33 victory over the Panthers on Sunday:\nOpening Statement:\n“What a very good example of a team win. We were especially happy with a division win against a tough team. It was especially nice to do it here in front of our fans. That’s an excellent way for us to pay it forward to them. I thought offensively they really set it off in the first half. The connection with Matt Ryan and Julio Jones today was as strong as ever. In the second half, having a 99-yard drive, the defense came back in the third quarter and certainly made some good stops. I thought overall the special teams, they played fast and tough. That’s our identity, the finish, the toughness, and the resiliency that we show. It’s a very strong group, the brotherhood they have for one another, but again very good division team that we went against today. We knew it was going to take an all-day fight, go in that locker room and they’ve got a lot of good players. We knew it was going to be an all-day fight. Great division win today.”\nOn what was working between Matt Ryan and Julio Jones today:\n“They knew they had their opportunities and would likely get some based on just different looks, but they put the work in and that’s not just this week in practice. It goes out through the offseason before they get to OTAs, in training camp, and then if it’s a ‘Hey, let’s come in early and stay late’. That’s the connection those two have. They totally rely and count on one another. That chemistry was certainly on display today.”\nOn going down the field so much:\n“We know this group and how hard they do play. Oftentimes, you don’t get your shots down the field. The biggest thing is when those opportunities come, can you capitalize on them? I think that was the real story today where we had some opportunities to take those shots we took them. They’ve got a good front. They know how to push the pocket and get up in the face, but when we had our opportunities today I thought it was a nice job of those guys capitalizing on those.”\nOn how aggressively Carolina played defensively:\n“We didn’t necessarily go in thinking they played so aggressively or not just each week’s different. We’ve got a lot of respect for how they play on defense I can tell you that the way their inside with the linebackers and defensive tackles kind of all the up through the middle. Those guys can bring it. I don’t know how Thomas Davis is, but we certainly have a lot of respect for him. I know he got out of the game there sometime in the second half, but I think inside is kind of where the strength of their team is. The tackles and linebackers and the speed they play with. No, we didn’t come in thinking there was going to be more shots than normal, but when the game happens and it unfolds and the opportunities are there that’s what we were able to attack today. That was a great job by the staff and the players.”\nOn a lot of third down conversions today:\n“It certainly was. We didn’t like all the long third downs that we had, but the ability to convert and I know we won the time of possession. The run game wasn’t like we’d like it normally, but the play action and the pass game to go with that if you’re going to sell out in the run, there’s got to be some opportunities in the play action game and that was the case today. Third down was a big factor for us on both sides.”\nOn what he would say about a win like this and what it means:\n“We do know that it’s just the first quarter as we’re coming to a close of a long season. What I do like is the connection this team has. Our team identity is one built on toughness and resilience. Those things you can feel the connection among the players. We are still a work in progress in some spots, but that connection that the players have amongst each other to keep attacking, they know we have a lot of work to do.”\nOn Carolina’s last few possessions:\n“We knew it was going to be tough coming in. There’s a bunch of different types of runs they can do, and add Cam into the package where it’s not just zone read plays. We knew it was going to be a tough matchup and it was, but as the game shifted and became more of a passing game that style changed as well.”\nFalcons coach Dan Quinn discusses the win over the Panthers on Sunday. Video by D. Orlando Ledbetter.\nOn the penalties today:\n“Yeah there were quite a few. On special teams we had some as well. The pre-snap or post snap ones are the ones we emphasize the most because those are some that you can control, but those that are within a down, we’ll have to go back and look at those. But for us to play really disciplined ball we can’t have that many penalties.”\nOn how it feels to be the one chased in the NFC South:\n“We don’t spend too much time looking too far down the future. We are trying to just stay focused on the week at hand. It brings us right back to the process of getting ready and it’s all the guys helping that process. Every Wednesday when we come in it’s right back to it. The hardest thing for some people is to reset after wins. We focus on the things we can be better at this week. Let’s dial in on it. It was a good team win against a really good division opponent. We’ll leave it there, and we know we’ve got work to do.”\nOn holding Carolina to 49 yards on the ground:\n“I thought the tackling was better and then as the game shifted it became more of a passing game towards the second half. I thought the guys knew their fits, they made their hits, and tackling in the run game was certainly on point.”\nOn Sean Weatherspoon’s injury:\n“I don’t have any updates on any injuries of the guys.”\nOn what lead to the switch from Eric Weems to Justin Hardy:\n“As the game unfolded it was a coaching decision. Not much to read into on that one. We wanted to give Justin another shot.”\nOn Robert Alford making tough plays today:\n“We were pleased to see him come back and battle. He has terrific ball skills. With the interception, it would’ve been ok with us if he took a knee and went down, but we came back. We knew it was going to be a tough battle. We put different guys to guard different players and he had a tough assignment at times. One long pass interference had was a foul for sure. We’ll go back and look at that tomorrow and see how we can adjust.”","url":"https://www.ajc.com/sports/football/what-dan-quinn-had-say-after-the-win-over-the-panthers/fu1XTcepfxucGgXHcF1r0M/"}
