{"authors":["Madeline Stone"],"date_download":"2018-10-30 22:23:00","date_modify":"2018-10-30 22:23:00","date_publish":"2016-12-14 00:00:00","description":"Bleisure travel — when business trips include some elements of fun — are on the rise.","filename":"data/vaneerConsumption/Whatisbleisuretravel.json","image_url":"https://amp.businessinsider.com/images/58507c39a1a45ef4008b5a87-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_what-is-bleisure-travel-2016-12_1540938180.html","title":"What is bleisure travel","title_page":"    What is bleisure travel - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Courtesy of Singapore Airlines It can be tough for anyone to find the time for a vacation. But if you're an entrepreneur working on getting a new business off the ground, making the time for a break may seem nearly impossible.\nAccording to a new survey conducted by FoundersCard— a membership community that helps startup founders and other senior executives get access to elite status and other VIP upgrades — many entrepreneurs are extending previously scheduled business trips to make time for some fun.\nFoundersCard randomly selected 334 of its 20,000 members to find out how affluent business executives plan to spend their downtime next year.\n81% of those who responded to FoundersCard's survey said they have taken trips that combine business and leisure, while 51% said they plan to do this at least one time in 2017. Additionally, 23% of respondents said they plan to travel specifically for a change of scenery while working, which FoundersCard calls a \"workcation.\"\nSomewhat paradoxically, however, 80% of respondents to FoundersCard's survey said that they plan to take a vacation with the sole purpose of unplugging from work in 2017. When they do travel for fun, they're heading to places like Hawaii, Miami, Aspen, and Turks & Caicos, the survey found.\nBut it seems that for today's modern entrepreneur, the line between work and play is increasingly being blurred.\n\"My guess, especially as a fellow entrepreneur, is that they're taking hybrid business-leisure trips in order to make it possible for them to take the occasional trip in which they unplug entirely,\" Eric Kuhn, FoundersCard's founder and CEO, said to Business Insider. \"I wouldn't be surprised if many of them were unable to fully disconnect from their companies more than once a year, and traveling for leisure that sparingly can put you on the fast track to burnout.\"\nTurks & Caicos is a popular destination for entrepreneurs. Shutterstock/Ramunas Bruzas\n\"Half of respondents plan to travel five to 10 times per year for leisure next year, and nearly a quarter say they plan to vacation even more than that,\" Kuhn said. \"That's a lot when you take into account that these are entrepreneurs and executives who, while affluent, are often short on free time.\"\nThis trend isn't limited to entrepreneurs, it seems. The travel industry has even given the phenomenon its own name: \"bleisure.\"\nA recent study by Expedia Media Solutions found that 43% of all business trips, both international and domestic, are extended to include some kind of leisure activity. This is especially common with people who are traveling to another country for work, which makes sense given the expense and time commitment that international flights require. According to a 2014 Skift report on bleisure travel, more than half of those who extend a business trip bring family members or a significant other along with them.\nSpending more time in a country you're visiting for business also provides a chance to relax and enjoy the sights, whether that means checking out the British Museum in London or Victoria Peak in Hong Kong.\n\"It makes the stress of business travel more bearable,\" British public relations adviser Stuart Bruce told CNN earlier this year. \"It definitely makes me work better. I'm more relaxed, but I also get a better understanding of the city and culture that I'm working in.\"","url":"https://www.businessinsider.com/what-is-bleisure-travel-2016-12"}
