{"authors":[],"date_download":"2018-10-30 21:16:43","date_modify":"2018-10-30 21:16:43","date_publish":"2016-01-07 14:46:44","description":"Waffle House, that boxy beacon of unending breakfast, is trying a wacky little experiment at a single location in the 1,800-restaurant chain: a drive-thru.","filename":"data/vaneerConsumption/WhatyoucanandcantgetatWaffleHousesonlydrivethru.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/01/07/Images/photos.medleyphoto.8557864.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_what-you-can-and-c_8bd72d549b15304779936b460f7bb4d1__1540934203.html","title":"What you can and can’t get at Waffle House’s only drive thru","title_page":"Waffle House in Gwinnett experiments with chain's only drive thru","title_rss":"NULL","source_domain":"ajc.com","text":"Waffle House, that boxy beacon of unending breakfast, is trying a wacky little experiment at a single location in the 1,800-restaurant chain: a drive-thru.\nI was surprised by what I saw when I visited the Gwinnett County restaurant for a recent Unofficial Business column.\nFor starters, the chain is still trying to figure out what kind of make-to-order food it can prepare fast enough to satisfy drive-thru customers. So there’s a very limited menu for the drive thru, which operates from 6 a.m. to 1 p.m.\nThe main things you can get: a couple varieties of biscuits, hashbrown and grits bowls and an egg sandwich. No hamburgers, omelets or All-Star breakfasts.\nFind out why Waffle House is trying a drive thru now and whether it will it add more, in the recent Unofficial Business column on myAJC.com. In the meantime, here are the top sellers in the Waffle House chain (and whether they are served at the drive thru):\n1. Coffee (yes)\n2. Hashbrowns (yes)\n3. Waffles (no)\n4. Egg breakfasts (only in other items, like biscuits)","url":"https://www.ajc.com/business/what-you-can-and-can-get-waffle-house-only-drive-thru/egMlEV7LxkPIouZO6eFxWN/"}
