{"authors":[],"date_download":"2018-10-30 20:04:37","date_modify":"2018-10-30 20:04:37","date_publish":"2016-10-02 23:01:00","description":"Here’s what Falcons quarterback Matt Ryan, who passed for 503 yards and four touchdowns, had t...","filename":"data/vaneerConsumption/WhatMattRyanhadtosayafterthe4833winoverthePanthers.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/02/Images/newsEngin.16173004_100316-falcons-photos-bs37.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_what-matt-r_cf0c3c3c03cc9af4e1d9a32712cf7ae3__1540929877.html","title":"What Matt Ryan had to say after the 48-33 win over the Panthers","title_page":"What Matt Ryan had to say after the 48-33 win over the Panthers","title_rss":"NULL","source_domain":"ajc.com","text":"Here’s what Falcons quarterback Matt Ryan, who passed for 503 yards and four touchdowns, had to say after the 48-33 win over the Panthers on Sunday:\nOn what was working between him and Julio Jones:\n“Well we had good matchups and Kyle (Shanahan)did a great job of dialing up plays all day, he stayed aggressive. But at the end of the day, it comes down to Julio making some plays. I thought he played awesome, was huge for us in critical situations and showed how great of a player he is. That was fun to be a part of that.”\nOn Julio’s 75-yard touchdown catch:\n“Well, it looked pretty good from where I was standing. That was a great call, a really aggressive call by Kyle in that situation. But we knew they were going to be downhill against the run game, did a good job with play-action passing, got Julio the ball in space and when he gets the ball in space, he’s so explosive. He just finished the run so well and that was impressive to see.”\nOn whether he was surprised by Carolina playing man coverage:\n“No, that’s what they do. They play some man coverage in certain situations and they’ve got talented players and they believe in their guys. We just found a way to make some plays today.”\nOn the offensive production:\n“I think that’s really good, it’s been really good for us spreading the ball around and getting a lot of different people involved. It makes it difficult for a defense when you have that many guys catching passes. But I think Julio, by his standards, I think he only had 12 catches which is a lot but he’s had bigger receiving – in terms of catches – he’s had bigger games than that, but his explosiveness and the catches that he made were so critical. So, I thought all of the guys played really well but it doesn’t happen without our offensive line getting it done against a really good front seven. Those guys were rock solid all day.”\nOn Alex Mack leading the offensive line:\n“Well, Alex is awesome. He’s a great leader, he’s a great teammate, a really good competitor. He’s great during the week, he prepares as well as anybody I’ve been around. But I think all five of those guys have really played extremely well through the first quarter of the season. An offensive line is all about the chemistry between the guys and being able to work together, specifically within our scheme and I think we’ve got a good group of five guys that are playing really good ball right now.”\nOn his arm strength:\n“I don’t really listen to that stuff. I know what I’m capable of doing, our guys know what we’re capable of doing and there were certainly opportunities to get the ball down the field today and we took advantage of it. So, I haven’t worried about that too much throughout my career.”\nOn playing while backed up inside the five-yard line:\n“Yeah, I think we had three drives over 90 yards which is huge. I thought the drive coming out in the second half, the first drive of the second half where the ball got pinned at the one, I think we went 10 plays, 99 yards for a touchdown. That was huge. But we can still get better. I made a mistake down there early in the game, turned the ball over and gave them an opportunity to score points. So, while we did a good job, we can still get better there.”\nOn being able to work the offense the way they want to this year:\n“It’s been great, we’ve got a deep offense, lot of good, talented players across the board, guys that work hard, day in and day out and compete every day at practice and we’ve got guys who are eager to get better and want to improve. When you’ve got guys like that, it makes it fun to go to work every day. I’m excited about it, I think Kyle’s done a great job of keeping everybody involved, trying to find areas within a defense that we have an advantage and he’s done an excellent job of that through four weeks.”\nFalcons quarterback Matt Ryan discusses the win over the Panthers, the play of Julio Jones and the offense's long drives. Video by D. Orlando Ledbetter\nOn how he would assess the first quarter of the season:\n“I think we’ve played pretty well at times. We’ve obviously scored points which is, at the end of the day, the most important thing. But I had high expectations coming into it, we’ve got a lot of really good players, we’ve got a great scheme and expected us to play well. Honestly though, there are a lot of things we can improve on, a lot of things we can do better and that’s the exciting part. We can play better than we have up to this point and that’s got to be everybody’s focus. We’ll enjoy the win but when we get back to work tomorrow, it’s about finding a way to be better because we’re going to face a really good defense in Denver next week.”\nOn trusting the offensive line when passing while backed up:\n“That’s a lot of trust in those guys. When you’ve got the ball on the one-yard line and you’re willing to throw the ball and trust those guys to pass protect and they did an awesome job the entire day. I thought our backs did a great job of sneaking out of the backfield, catching some balls in some critical situations for us to get the chains moving. That was really, really important because those drive starts, especially inside the 10, when you can just get that ball punched out and start going, it’s huge. So, I thought we did a nice job of that but, again, we can still be better down there.”\nOn Taylor Gabriel:\n“Taylor’s been excellent, coming in from Cleveland in the first week of the season. He had some familiarity with the system, obviously, playing for a year with Kyle up there and I think that’s helped him. But he’s talented. He’s got incredible quickness, he’s really fast twitch and he’s fearless. The ball he caught on the in cut today shows what kind of courage and toughness he has to be able to go up and get that ball and not flinch. He’s a great competitor. I also think Aldrick Robinson’s done a great job for us coming on. That was a huge touchdown catch he had today, great job by him getting his feet in. I thought those two guys stepped up and played well for us.”\nOn throwing for more than 500 yards:\n“This is the first time. Hopefully, we can do it again.”\nOn his 500-passing yards and Julio’s 300-receiving yards making history:\n“That’s pretty cool to be a part of that. To watch the way Julio played today was really cool. Every play it seemed like we went to him, he was coming through big, creating explosive plays. To me the best catch of the day, I think we had a third-and-three and he ran a short little under route on the left-hand side in traffic and snatched it, didn’t even bring it into his chest. His hands are so strong. He had some other great plays, don’t get me wrong, but I threw that one and I was like ‘man, that was a hell of a catch’ and that was fun to see. Hats off to him, he played unbelievable.”","url":"https://www.ajc.com/sports/football/what-matt-ryan-had-say-after-the-win-over-the-panthers/ZVarQsBEimhGljxqq9owzI/"}
