{"authors":[],"date_download":"2018-10-30 21:47:51","date_modify":"2018-10-30 21:47:51","date_publish":"2016-12-21 21:39:00","description":"What happens when Christmas falls on a Sunday? In Atlanta, some churches are are canceling services on Sunday to let their members, staffers and vol","filename":"data/vaneerConsumption/WhatnochurchonChristmasSomechurchesareclosedthisSunday.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/12/21/Images/newsEngin.17209491_christmas.122503.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_religion_what-church-c_32af08ff69f73533210b4cf7e1163dc4__1540936071.html","title":"What, no church on Christmas? Some churches are closed this Sunday","title_page":"What, no church on Christmas? Some churches are closed this Sunday","title_rss":"NULL","source_domain":"ajc.com","text":"There won’t be choirs singing “Silent Night” at some metro churches this Christmas morning.\nSay what?\nChristmas, the Christian holiday to observe the birth of Jesus and one of the most widely celebrated days in the faith, falls on a Sunday this year and some churches are giving their members the day off.\nSeveral metro churches are not holding services on Sunday in order to let their members, staffers and volunteers spend time with their families.\nIt doesn’t happen often.\nAccording to Answers.com, the last time Christmas fell on a Sunday was in 2011. The next time will be in 2022.\nFirst Baptist Church Atlanta and North Point Community Church announced via social media that they will not hold regular services on Sunday. They will, though, have multiple services on Christmas Eve. North Point Community Church in Alpharetta, for instance, will have Saturday services at 9 a.m., 11 a.m. and 1 p.m.\n“With a church as large as ours, we have thousands of volunteers, and we feel that as a church it’s more important for them to spend time with their families on Christmas,” said an executive staff member who didn’t want her name used. She said it wasn’t the first time. “It’s not a new thing.”\nUnitarian Universalist Congregation of Atlanta also won’t have a Christmas Day service. Instead, the church will hold a Christmas morning pancake breakfast beginning at 10 a.m.\nOne of the biggest factors for skipping regular Sunday services is there will be two services—at 5:30 p.m. and 7:30 p.m.—on Christmas Eve, said Jonathan Rogers, associate minister for lifelong learning and growth. So many people come to those services, he said, that it just didn’t make sense to have another service roughly 12 hours later. That service wouldn’t likely have a much reduced attendance.\n“We didn’t want to have nothing, so we thought a pancake breakfast would be a nice way to still have a gathering and have a place for people to come on Sunday morning.”\nImpact Church in East Point usually has a combined five services—or experiences, as they call them—at two locations on a typical Sunday. This Sunday, however, the church will not hold Sunday services at its campuses, but will have “experiences” on Christmas Eve at 9 a.m., 11 a.m. and 12:30 p.m. at 2323 Sylvan Road and 10 a.m. at 2792 East Point St.\nOn Christmas Day, there will be a pre-recorded sermon by Lead Pastor Olu Brown that members can watch on the church’s website.\nBrown said the day away from a physical building is a way to show appreciation for volunteers and staff, “who really work every Sunday.”\n“People can engage wherever they are,” he said. “For us, it’s really about expanding our reach.”\nThat doesn’t necessarily bother Ronna Charles Nu’Man, who has been a member for about a year.\nHer family usually begins Christmas Day with a big breakfast, and then they open gifts and watch Christmas movies.\n“Instead, we’ll just watch the service,” she said.\n“It’s so hectic on Christmas Day anyway,” said Nu’Man, who sometimes sings in the choir. “I know all it takes to run the services, so I get it logistically.”\nThat doesn’t mean, though, that the reason for the season and day will get lost. Some people will visit other churches or by watching a streamed service. And before you count out going to church on Christmas all together, know this: most churches will still hold services on Sunday. They may combine services or keep the regular schedule.\nIn fact, nearly nine out of 10 Protestant senior pastors say their churches plan to hold services on Christmas Day and New Year’s Day, according to a recent survey from Nashville-based LifeWay Research. Pastors in the Midwest (92 percent) and South (89 percent) are more likely to say their church will be open on Christmas, according to the survey of 1,000 pastors.\n“Having Christmas Day services is a must for me,” said E. Dewey Smith, senior pastor of House of Hope Atlanta. “What better way to celebrate the birth of Jesus than in church?” The Decatur church will hold two regular Christmas Day services, each lasting an hour.\nThe Rev. Shanan Jones, executive pastor at Ebenezer Baptist Church in Atlanta, said instead of its regular three Sunday services, there will be one at 9:30 a.m.\n“It’s the holiest day of our year,” he said. “For it to land on a Sunday is an extra benefit for the church community to come together and worship Christ our Lord on the Lord’s birthday.”\nDon’t expect to sleep in at St. James Episcopal Church either. The Marietta church will have three regular services on Sunday and four on Christmas Eve.\n“We’re not celebrating Christmas for presents or Christmas trees,” said the Rev. Roger D. Allen. “We’re celebrating because of the birth of Christ…There’s no better place to do that than in church on Sunday. Some people want to get up early; others want to sleep late,” said Allen, jokingly. “Well, we have plenty of options.”\nRelated:\nChristmas Calendar: Atlanta services and church music Christmas Eve\nRestaurants open on Christmas Day\nFlashback photos: Christmas in Atlanta","url":"https://www.ajc.com/news/religion/what-church-christmas-some-churches-won-hold-sunday-services/qgStbWl0A2BYHIsHJGMh0M/"}
