{"authors":["Amy Sciarretto"],"date_download":"2018-10-30 23:13:16","date_modify":"2018-10-30 23:13:16","date_publish":"2014-08-13 22:00:01","description":"Rihanna is touring with Eminem on a short, summer stadium trek. Theirs are easily the most anticipated concerts of the soon-to-be-fading summer season. While what Rihanna wears onstage will be as thrilling and as eagerly awaited as her set list and…","filename":"data/vaneerConsumption/WhatToWearToARihannaShow7OutfitsTheFashionRebelWouldApproveOf.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/01b1757c-991b-45dc-b1e8-0beba1d82268.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35547-what-to-wear-to-a-rihanna-show-7-outfits-the-fashion-rebel-would-approve-of_1540941196.html","title":"What To Wear To A Rihanna Show: 7 Outfits The Fashion Rebel Would Approve Of","title_page":"What To Wear To A Rihanna Show: 7 Outfits The Fashion Rebel Would Approve Of","title_rss":"NULL","source_domain":"bustle.com","text":"Rihanna is touring with Eminem on a short, summer stadium trek. Theirs are easily the most anticipated concerts of the soon-to-be-fading summer season. While what Rihanna wears onstage will be as thrilling and as eagerly awaited as her set list and choreography, you also need to plan out what you will be wearing. You can't show up to a Rihanna show without putting a lot of thought into your ensemble. That would be uncivilized, unforgivable, and, most importantly, unfashionable.\nRiRi is fashion's most notorious rebel and she is inspiring that world in innumerable, immeasurable ways — we celebrated some of Rihanna's best looks when she picked up her CFDA award earlier this summer. Know what else the Bajan beauty and W's September 2014 cover girl inspired? Oh, just these seven outfits that I've created!\nThey are very RiRi-esque, totally appropriate for a RiRi show, and easy to recreate, so pay attention. Each one has an element or two or four that was totally influenced by something Rihanna has worn at one time or another.\nWhether your style is label-heavy, urban chic, or even a hybrid of sexy and tomboyish, RiRi wants to see members of her Navy looking as glam and as gorge as she does. Plus, you never know. RiRi could somehow catch a glimpse of your outfit and be inspired, making it totally cyclical. 360 degrees of fashion!\n1. Label-Loving Golden Goddess\nIf you love labels, why not dress up tough leather leggings? RiRi popularized the trend along with the Olsen Twins and Victoria Beckham. Go for the gold with huge hoops, strappy sandals, and metallic sunset shadow on dem lids. Cap it off with a high-end clutch and have at it.\n2. Sexy And Urban Tomboy\nInstead of mixing high and low, why not pair masculine and feminine for sexy, urban, tomboy chic? Get girly with destroyed denim cutoffs, a thin varsity jacket, a belly chain, lashes for days, and RiRi-like almond-shaped daggers. Then add some dudish touches with a baseball cap and studded ankle booties.\n3. Street Chic And Still Tomboyish\nSome of Robyn Fenty's most successful street style ensembles mix tomboy with sexy, so here's another option. Loose-fitting boyfriend jeans, a pyramid stud belt, and high-top Chucks provide the boyish element, while a cleavage-enhancing bra top, cat-eye shades, a chunky rope statement necklace, and a fringed crossbody keep it on da girl tip.\n4. Rock 'n' Roll Rebelista\nSeriously, this looks like something RiRi once wore. Or twice wore. A sleeveless graphic tee and lace-up skinnies are amplified and upgraded thanks to patent platform pumps, a cuff, and a wristlet. Slick on some RiRi Woo lipstick and a rock 'n' roll rebelista is what you are!\n5. Accessories Queen\nUp the ante of an LBD, which is sexier when it's leather, by accessorizing well. Stacks of black and gold bangles, strappy and gilded heels, gobs of rings, and pink gloss make you an accessories queen.\n6. Loudly Leisurely\nA sweatshirt dress can be kicked up a notch — more like 10,000 notches — with gladiator boots and a metallic wristlet. Add some loud street touches like slouchy beanie and glossed out crimson lips. Rihanna mixes styles like this all the time. You can, too.\n7. Monochromatic High Style\nNot gonna lie...I created this outfit based on items I own and/or lust after and want to wear. Take the comfy and slim fit hoodie by a name brand, pair it with grey wash skinnies, and top it with a leather jacket. Since it's currently summer, you'd probably want to ditch the jacket or save it for a cold weather RiRi show. Add nerdy specs, a crossbody, and killer heels, like these Rodarte boots I have coveted since I saw them on Mandana Dayani's Instagram.\nImages: Polyvore (7)","url":"https://www.bustle.com/articles/35547-what-to-wear-to-a-rihanna-show-7-outfits-the-fashion-rebel-would-approve-of"}
