{"authors":["Barbara J. King"],"date_download":"2018-10-22 21:58:57","date_modify":"2018-10-22 21:58:57","date_publish":"2015-01-15 00:00:00","description":"A UK woman's breastfeeding of her school-aged daughter has caused a furor. Anthropologist Barbara J. King tells us why everyone should calm down — and why prolonged breastfeeding can be beneficial.","filename":"data/vaneerConsumption/WhatsRightAboutA6YearOldWhoBreastFeeds.json","image_url":"https://media.npr.org/assets/img/2015/01/15/breastfeeding_wide-65024944933f3b645b1a296d63622f5e95a0b08e.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_13.7_2015_01_15_377384587_what-s-right-about-a-six-year-old-who-breastfeeds_1540245537.html","title":"What's Right About A 6-Year-Old Who Breast-Feeds","title_page":"What's Right About A 6-Year-Old Who Breast-Feeds : 13.7: Cosmos And Culture : NPR","title_rss":"NULL","source_domain":"npr.org","text":"What's Right About A 6-Year-Old Who Breast-Feeds\nEnlarge this image toggle caption Pat Roque/AP Pat Roque/AP\nWhen the British newspaper The Mirror reported in late December that a UK mother named Denise Sumpter was still breast-feeding her daughter Belle, who is 6 and a half years old, two experts were invited to weigh in on the practice.\nOne expert — a registered nurse, midwife and lactation consultant — called Sumpter \"an inspiration\" and noted that her daughter was \"benefiting emotionally and physically.\" The other, a retired midwife and breast-feeding counselor, disagreed, insisting that extended breast-feeding to age 6 in England \"isn't necessary — or normal\" because the child could be ridiculed, and because there are no longer any benefits to be had. In the article, Sumpter herself notes that critics worry her daughter will become overly emotionally dependent on her (while pointing out that Belle is mature for her age).\nWhen, in early January, the story was picked up here in the United States, readers' response was explosive. At Cosmopolitan, for example, an article on the topic garnered over 24,000 shares. Among its 1,176 comments were harsh judgments ranging from \"terrible\" to \"sick,\" to referring to the extended breast-feeding as \"disgustingness.\" Many others expressed support for Sumpter.\nWhy does a woman's choice to breast-feed her child longer than most women do touch such a nerve? We anthropologists often note that humans evolved in a context where the breast-feeding of children for three or four years was the typical and healthful pattern, and that individual variation in duration of breast-feeding is to be expected. So, I decided to check in on all the hype around Sumpter and her daughter with University of Delaware anthropologist Katherine Dettwyler, who has extensive cross-cultural experience in breast-feeding research.\nEarlier this week via email, Dettwyler answered my questions about the Sumpter case and about the possible benefits and costs of prolonged breast-feeding (I have edited her reply for length). From Dettwyler:\n\"My research, and research by others on non-human primates and non-primate mammals, suggests that nursing large-bodied mammalian offspring for many years, until their first permanent teeth erupt (5.5-6.0 years in humans), is \"natural\" for humans in the sense of being what the underlying evolutionary, biological/physiological norm is for us as a species. There is no research to suggest that normal durations of breast-feeding for humans as a species — 2.5 to 7+ years — lead to 'harmful emotional dependency.' There is some evidence that longer-term breast-feeding (along with co-sleeping in childhood) results in children who are more independent and score higher on measures of social competence. \"I would say that the benefits of long-term breast-feeding — as long as both mother and child want — are enormous. Long-term breast-feeding allows for normal development of the child's brain, facial structure, immune system, and emotional resilience to life's slings and arrows. As far as I know, there are no 'costs' to the child. If the mother doesn't want to continue breast-feeding, then of course, she shouldn't feel obliged to — regardless of the age of the child. But people should be informed that nursing a 6-7+year-old is a perfectly normal and natural and healthy thing to be doing for the child, and that their fears of emotional harm are baseless.\"\nThe latest version of the American Academy of Pediatrics' policy statement on breast-feeding offers extensive evidence on the health benefits of breast-feeding for children and supports Dettwyler's perspective, particularly in this sentence: \"The AAP recommends exclusive breast-feeding for about 6 months, with continuation of breast-feeding for 1 year or longer as mutually desired by mother and infant.\"\nI know that critics may seize on that word \"infant\" and point out that a 6-year-old doesn't fit into that category. Consider, though, that in her editorial from 2012 in the journal Clinical Lactation, health psychologist and lactation consultant Kathleen Kendall-Tackett notes that extended breast-feeding is \"officially out of the closet\" with an outpouring of support from those who practice it. Dettwyler herself falls into this group, is entirely public about it, and addressed it with me:\n\"There are lots and lots and lots of people in the United States who were nursed until age 3 or beyond as well as in other Western countries. This is not as rare and unusual as people think. But mothers are well advised to be quiet about this in a culture where they can be accused of sexual abuse and have their kids removed by child protective services, or lose them in custody battles. Both things have happened. \"I do encourage people to shout it from the rooftops once their kids are grown. That's why I am not shy about telling people that my daughter nursed until she was 4 years of age, and my younger son until he was 5.5 years of age. My daughter Miranda is now 34, has an MA in physics and is just about to finish an MA in architecture, and lives in Wales, UK, with her husband and two kids, the elder of whom nursed for 5 years, the younger of whom is currently nursing at age 2. My son Alex is now 23, has a BA in Anthropology, lives in Ann Arbor, Michigan, and works as a chef. They are happy to tell anyone who asked that they nursed for many years.\"\nI think it's important that we hear not only the science — the health benefits of and the evolutionary perspectives on extended breast-feeding — but also personal stories like Sumpter's and Dettwyler's.\nI do wonder how unique we humans are in this practice of extended breast-feeding. Not only are cultural norms and practices in place in our species, of course, but humans also have a relevant biological difference distinguishing us from other mammals. As Katie Hinde of Harvard University's Comparative Lactation Lab wrote in an email to me earlier this week:\n\"In this discussion we have to consider gene-culture co-evolution, because in all other mammals offspring stop making lactase early in ontogeny — concurrent with transitions between infancy and juvenility — so they can no longer digest mother's milk. Only because humans (in some populations) have the cultural practice of dairying have we had selection-favoring genes that allow lactase persistence to consume animal milk ... \"I think we, therefore, have to seriously consider that in humans very prolonged/extended breast-feeding (5+ years) without digestive issues is possibly a byproduct of gene-culture co-evolution that favored the consumption of dairy products.\"\nThat's cool. And it shows that prolonged breast-feeding is a beautiful example of human bio-cultural behavior, one that is enabled both by our evolved physiology and by our learned understandings of healthy parenting practices.\nBarbara's most recent book on animals was released in paperback in April. You can keep up with what she is thinking on Twitter: @bjkingape.","url":"https://www.npr.org/sections/13.7/2015/01/15/377384587/what-s-right-about-a-six-year-old-who-breastfeeds"}
