{"authors":["Kenneth Dickerman","Photo Editor"],"date_download":"2018-10-21 03:05:04","date_modify":"2018-10-21 03:05:04","date_publish":"2018-08-20 10:00:25","description":"Photographer Michael Abramson on Chicago's nightlife.","filename":"data/vaneerConsumption/WhatitwaslikeinthenightclubsofChicagosSouthSideinthe1970s.json","image_url":"https://www.washingtonpost.com/resizer/kkLq3OyyBXb8c4fAS85xiVKslAM=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6IIIEEPFZ4ZHJDMHRCOHZKSZUA.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_08_20__1540091104.html","title":"What it was like in the nightclubs of Chicago’s South Side in the 1970s","title_page":"What it was like in the nightclubs of Chicago’s South Side in the 1970s - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Photo Editor\n(Michael Abramson/Blue Sky Gallery)\n(Michael Abramson/Blue Sky Gallery)\nMichael Abramson didn’t start out as a photographer. He started out wanting to go into business, graduating from the Wharton School at the University of Pennsylvania in 1970. But somewhere along the way, he took an interest in photography and enrolled in the Institute of Design at the Illinois Institute of Technology in Chicago. It was here that he became interested in life in the nightclubs on Chicago’s South Side.\nFor the thesis that earned Abramson a master’s degree from IIT, he spent two years (1975-1977) getting to know the characters in those clubs. In 1978, Abramson won a grant from the National Endowment for the Arts, and the work eventually launched his career as a photojournalist. His work in the clubs has often been compared to that of the great French photographer Brassai, who documented nightlife in Paris in the early decades of the 20th century.\nAbramson would go on to have a successful career as a freelance photographer, working for clients such as Time, the New York Times, Newsweek, People, Forbes and Harper’s, among other publications. In 2009, the work was in the book “Light: On the South Side” (Numero Group). The book was accompanied by an album featuring Chicago blues that earned a Grammy nomination. Abramson died in 2011 of kidney cancer.\nAbramson’s work is on display at Blue Sky Gallery in Portland, Ore. The show brings together vintage silver gelatin prints of the work and runs through Sept. 2. Abramson’s work can be found in numerous museums, including the Smithsonian, the Art Institute of Chicago, the Milwaukee Art Museum and the Museum of Contemporary Photography in Chicago.\n(Michael Abramson/Blue Sky Gallery)\n(Michael Abramson/Blue Sky Gallery)\n(Michael Abramson/Blue Sky Gallery)\n(Michael Abramson/Blue Sky Gallery)\n(Michael Abramson/Blue Sky Gallery)\n(Michael Abramson/Blue Sky Gallery)\n(Michael Abramson/Blue Sky Gallery)\n(Michael Abramson/Blue Sky Gallery)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nConfronting depression with photos, this artist’s works are ‘keen emotional witnesses to this broken world of ours’\nStunning aerial photos of the worst drought in Australia’s living memory\nArtist Omar Victor Diop’s work ‘recasts history and the global politics of black resistance’","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/08/20/what-it-was-like-in-the-nightclubs-of-chicagos-south-side-in-the-1970s/"}
