{"authors":["Portia Crowe"],"date_download":"2018-10-30 21:12:56","date_modify":"2018-10-30 21:12:56","date_publish":"2016-12-21 00:00:00","description":"\"The companies and the entrepreneurs — they are the stars, and the bankers are enablers and advisers.\"","filename":"data/vaneerConsumption/Whatitmeanstobeaninternetbanker.json","image_url":"https://amp.businessinsider.com/images/58599241a1a45e1b008b72fd-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_what-it-means-to-be-an-internet-banker-2016-12_1540933976.html","title":"What it means to be an internet banker","title_page":"    What it means to be an internet banker - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters/Noah Berger New York, London, and Hong Kong used to be the most competitive cities in which to be an investment banker.\nBut as the heart of innovation has shifted toward one industry — technology and, more specifically, internet — so too have the most exciting jobs for Wall Street dealmakers.\nIt means that San Francisco — and Silicon Valley — where many of the most successful startups in the world are located, is becoming a competitive place to land a banking gig.\nThe appeal is obvious: Unicorn and decacorn companies like Uber, Airbnb, and Snapchat have exploded in valuation and stand to make for some of the hottest mergers or initial public offerings in years.\nBut there are some serious cultural differences between being a banker in a traditional finance hub versus in San Francisco or Silicon Valley (most bulge-bracket firms have offices in the Valley as well as the city, especially in Menlo Park).\nEnables and advisers\n\"In the Valley, the companies and the entrepreneurs — they are the stars, and the bankers are enablers and advisers,\" Riaz Ladhabhoy, Deutsche Bank's cohead of internet investment banking, told Business Insider.\n\"People want to change the world, and your banker can help you, but your banker's not coming up with the next autonomous-driving software — so it's a slightly different vibe.\"\nIn New York City, finance rules and bankers are king.\nIn the Valley, the companies and the entrepreneurs — they are the stars, and the bankers are enablers and advisers.\nBut in the Valley they take a backseat and look a lot more like service providers than masters of the universe. The work they do looks different too.\nKirk Kaludis, Barclays' cohead of US technology investment banking, said in tech hubs like San Francisco, clients expect you not only to provide financial assistance but to be engaged on a deeper level about what they are trying to accomplish.\n\"Historically, you would be more reliant on pure intellectual capital,\" Kaludis said. \"As a banker — as a service provider to your client — they want to feel like you understand them, that you are passionate about what they're doing, and you are part of their culture.\"\nTo be a successful internet banker, you should be a regular consumer of your clients' products. That helps you better understand their business and growth strategies.\nRiaz Ladhabhoy, Deutsche Bank's cohead of internet investment banking. Deutsche Bank Most go a step further by dressing and acting like startup founders. You'd be hard pressed to find Silicon Valley a banker meeting clients who is not wearing jeans. Ties are a rarity, even in the firms' downtown San Francisco offices.\nInternet bankers will tell you this is nothing more than a reflection of the easygoing West Coast culture, but one veteran Valley dealmaker said it takes an effort to fit in and put clients at ease.\nBankers from most firms now consciously dress more casually around tech clients, but it is thought to have started with Morgan Stanley, originally the most trusted firm in an industry that's largely viewed with suspicion in the Valley.\nThe mistrust stems from the perception that bankers are always in a rush to close a transaction — make a deal — according to one venture capitalist who was previously a startup founder and tech exec.\n\"The way they view the world is totally different,\" that person said, because banks tend to start working with tech startups much later in the game, closer to the IPO or sale.\nThe sentiment in the Valley is that banks are more rushed than venture capitalists or other longer-term investors and partners, according to the person. That's why internet bankers are working so hard to shed the image of traditional Wall Street dealmakers.\nMany have launched in-house VC funds. Goldman Sachs, for its part, has an \"emerging entrepreneurs\" team based in the Valley, which works with entrepreneurs and founders to connect their ideas with capital, talent, and other services — including, eventually, with the bank's wealth-management services.\nKirk Kaludis, Barclays' cohead of US technology investment banking. Barclays It explains the casual dress code. If you're a banker in the internet-startup world, where 23-year-old college grads are running some of the most exciting businesses, you don't want to be the guy pulling up to a meeting in a black car with a suit and tie.\nGetting close\nNot only is an internet banker's interaction with the client different in the internet world — so is their interaction with the buyside.\nNick Giovanni, Goldman Sachs' cohead of internet investment banking, told Business Insider his job is about \"being able to understand something new and being able to advocate for that and explain it to the markets.\"\nTo do that, you have to almost become part of the company as you're working for them, he said. It means more frequent and less formal interaction — \"getting very close to these companies and understanding their business, products, people, and culture.\"\nMany bankers will tell you they almost become part of the company they are working with on a deal. Sound challenging? It has its upsides. For Mark Fiteny, JPMorgan's head of internet and digital-media banking, internet is one of the most exciting industries to be in.\n\"Being a banker in an established industry is different than being a banker in an industry where the rails are being laid as the train moves forward,\" he said.\n\"The kind of perspective that you can provide an entrepreneur is different when the industry is young in its formation, versus very established.\"","url":"https://www.businessinsider.com/what-it-means-to-be-an-internet-banker-2016-12"}
