{"authors":[],"date_download":"2018-10-30 00:53:21","date_modify":"2018-10-30 00:53:21","date_publish":"2014-06-17 08:00:00","description":null,"filename":"data/vaneerConsumption/WhatGOPEstablishment.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/06/WAP20130312327_lg_0.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860801.html","title":"What GOP ‘Establishment'?","title_page":"What GOP ‘Establishment'?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Republicans are poised to capture the Senate this year, and the mainstream press has already telegraphed that it will report this as a terrible defeat for conservatives. According to the false narrative peddled by reporters, we live in the midst of a titanic struggle between the Tea Party movement and establishment Republicans—either a repeat or a continuation of the battle between the Republican wings of Robert Taft and Eisenhower in the 1940s and ’50s, or Goldwater and Rockefeller in the 1960s and ’70s.\nThe truth is that there is no such battle. Never has the Republican Party been more unified around a conservative agenda than it is today. The Tea Party movement, which rose up in February of 2009 and exploded that summer, demanding that “spend less” be added to “cut taxes” in the Republican catechism, has been an absolute success.\nThe Tea Party movement burst onto the political scene just short of three months into the Obama administration in reaction to TARP spending (half by Bush and half by Obama), the $800 billion stimulus bill, the trillion-dollar hike in Obama’s first budget for domestic discretionary spending, and the health care “debate” that ultimately led to Obamacare. America had witnessed tax revolts going back to the original Boston Tea Party and the Whiskey Rebellion, and more recently California’s Proposition 13 in 1978 and the Reagan-led Kemp-Roth tax cut. But a political movement targeting government spending was new. Before the Tea Party movement, taxpayers slept through enormous outlays and only awoke in anger when the tax hikes arrived to cover the bill.\nThe first casualty of this change in the political winds was Senator Arlen Specter of Pennsylvania. Specter was trying to maneuver for re-election in 2010 between the Scylla of a possible conservative challenger in the GOP primary and the Charybdis of the Democrat machine in Philadelphia in the general election. Specter had committed to voting with the GOP against liberal judges, against all tax hikes, and against card check legislation that would have allowed unions to bypass elections in forcing workers to pay dues. This, he felt with some justification, would get him past the GOP primary. The likely challengers took a pass. Then Obama promised to stay out of Philly get-out-the-vote efforts in return for Specter’s vote for the stimulus. In normal times, Specter might well have been correct in believing that this deal would secure his re-election. Instead his poll numbers plunged.\nDid the Tea Party shift the bulk of the congressional Republicans or did they move at the same time? One notes that the entire Republican caucus in the House voted against the stimulus bill on February 13, 2009, months before any Tea Party rallies. Imagine the temptation facing Republican appropriators who were offered billions in goodies to share with the courthouse boys back home. Yet only three Republican senators succumbed to the pressure: Specter and Maine’s Susan Collins and Olympia Snowe. The entire Republican caucus in the House voted “nay.” At the time, Republicans looking forward to the 2010 elections believed they would lose several Senate seats and saw no likely pickups. Yet the caucus held strong even staring into what looked like the mouth of an abyss.\nBut the tea party’s ascension proved that rules had changed. Big spending was now a liability—even in Pennsylvania. Other Republicans in the House and Senate watched Specter’s one-man train wreck and realized there was a new issue that could kill political careers. This solidified the conservative consensus within the party.\nThe fiscal year 2010 budget—Obama’s first—added $1 trillion in spending over the next decade, above and beyond the stimulus splurge. It received zero votes from Republicans in the House or Senate when it was voted on in April 2009.\nEvery single Republican in both chambers also voted against Obamacare. Four years later, every single national Republican remains committed to repealing it and has so voted at every possible occasion. Compare this to past entitlement legislation. Social Security was passed in 1935 with seventy-seven Republican votes in the House and sixteen in the Senate. Medicare and Medicaid passed in 1965 with seventy Republican votes in the House and thirteen in the Senate. More recently, when President Bush expanded Medicare in 2003, he received 204 Republican votes in the House and forty-two in the Senate.\nThe world spun further off its axis when the House voted to ban earmarks in January 2011. The Senate Appropriations Committee followed suit. Only a few years earlier, bringing pork back home was a sign of virility and status. Now it is akin to shoplifting or smoking at the dinner table.\nPaul Ryan’s budget plan, which reforms entitlement spending, block grants most welfare programs, and strictly limits discretionary spending, has passed the House each of the past four years. The number of Republicans voting “no” numbered only four in 2011, three in 2012, ten in 2013, and twelve in 2014—and most of those “no” votes were conservatives showboating to let their constituents know they wanted deeper cuts. So the most radical anti-spending and anti-tax budget in recent history is a consensus item in the Republican Party. This agreement is found among both rank-and-file voters—remember how Newt Gingrich’s presidential bid collapsed in mid-2011 when he said he opposed the Ryan plan?—and among elected officials, also known as the establishment.\nWhen the Democratic president, the Democratic supermajority in the Senate, and the entire establishment media demanded a budget deal in 2011 that included tax increases in return for promises of spending restraint, John Boehner and Mitch McConnell stood firm. They fought for and won an agreement with the ten-year sequester, clawing back $2.5 trillion. Unlike the great “compromises” of 1982 and 1990, there was not a dime of tax hikes and the spending cuts were written in law, not stated as meaningless promises. That victory had real consequences. Federal spending, which had jumped from 20.2 percent of GDP in 2008 to 23.4 percent in 2010, has now fallen to 20.4 percent in 2014.\nThe Tea Party has driven Republican politics in the states as well. Republican governors have cut taxes by $38 billion since 2011. In the twenty-four states where Republicans have full control of the legislature and the governorship, spending including federal funds has increased only 1.1 percent between 2011 and 2013 and state-only spending has increased just 6.25 percent. In contrast, Democratic governors have raised taxes by over $58 billion since 2011. In the thirteen states where Democrats have full control of the legislature and governorship, spending including federal funds has increased 5.55 percent and state-only spending has increased by 9.95 percent.\nIf the Tea Party was, as its many leaders stated, a movement to limit spending and constrain the government to live within the bounds of the Constitution, its victory was broad and deep—and it brought along most of the Republican Party.\nSo where does this narrative of liberal Republican leaders battling the Tea Party grassroots come from?\nTalk radio hosts created some of this confusion by focusing on tactical differences, for instance Senator Ted Cruz’s attempt to “defund” Obamacare in the fall of 2013. Cruz argued that the GOP House could force Harry Reid to repeal Obamacare, and then somehow get Obama himself to agree to destroy his life’s work. These tactics, which led to a government shutdown, did not work as advertised. Polls showed support for Republicans hit new lows and approval of Obamacare hit new highs. Both turned around only after the shutdown threat disappeared and the nation could focus on the problems with the Obamacare rollout. Tactics may be wise or foolish, but disagreements over them does not change the underlying unanimity within the Republican Party, top to bottom, that Obamacare should be repealed.\nA second reason many see an imaginary fight between the Tea Party movement and the establishment is that both terms are rather amorphous, and are often used and defined dishonestly. Fringe candidates with little or no support have cried out that they are the true Tea Partiers, and some national groups foolishly echo these claims. Local activists who support the more electable conservatives are drowned out by national voices claiming to speak on the Tea Party’s behalf. For instance North Carolina’s Speaker of the Assembly Thom Tillis, who is running for U.S. Senate, was attacked by national “Tea Party” groups as the establishment candidate. But Tillis has a solid conservative record, and real-life polling in the state found that he won strong support from self-identified Tea Party voters.\nThe national media loves to cover fights between conservatives, which damage the Right and distract from the very real divisions on the Left. But there is no fight between the Tea Party and the Republican establishment; the Tea Party is the Republican establishment. Fewer political victories have been more rapid and more complete than the one it has won in five short years.","url":"https://spectator.org/59572_what-gop-establishment/"}
