{"authors":[],"date_download":"2018-10-30 01:03:38","date_modify":"2018-10-30 01:03:38","date_publish":"2014-09-22 08:00:00","description":null,"filename":"data/vaneerConsumption/WhatDocSavageCanTeachUsAboutWorldWarOne.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/09/Screen20Shot202014-09-2120at2012.12.5720PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861418.html","title":"What Doc Savage Can Teach Us About World War One","title_page":"What Doc Savage Can Teach Us About World War OneThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"I’ve written elsewhere about some of the basic lessons Americans should learn from our experience in the First World War. But left untouched in that piece is an almost equally important question: what can Doc Savage teach us about World War One?\nDoc Savage, for the uninitiated, was a pulp fiction hero of the 1930s through the 1940s, appearing in more than a hundred and eighty novels. Though the books are very much of their time, they were reissued, starting in the 1960s, as mass market paperbacks, achieving extraordinary success, selling more than 15 million copies.\nDoc and his five sidekicks were veterans of the First World War, but definitely not members of the doleful, emotionally shattered, cynical “Lost Generation” who thought that “words like glory, honor, courage, or hallow were obscene.”\nOn the contrary, they were much more like the British hero Bulldog Drummond, created by World War One veteran Major H. C. McNeile of the Royal Engineers (who also commanded infantry), writing under the pen name of “Sapper.”\nCaptain Hugh “Bulldog” Drummond was a demobilized officer, bluff, good-humored, beer-loving, handy with his fists, a well-muscled English gentleman who, far from being emotionally or mentally fractured by the war, found “peace incredibly tedious” and so set himself up as a freelance do-gooder (which included putting the kibosh on “red” conspiracies against Great Britain).\nDoc Savage is also a freelance do-gooder, but raised from the cradle to that task by his father Clark Savage Sr. If Bulldog Drummond is a British “clubland hero,” Doc is the earnest American; not a drinker but a striver, putting himself through a daily regimen of two hours of mental and physical exercise, as well as continued rigorous study (including sabbaticals at his “Fortress of Solitude”), making him an expert in most every field imaginable.\nDoc was a fighter pilot in the First World War, and his five postwar assistants are army buddies. The most senior, in former military rank, is Brigadier General Theodore Marley “Ham” Brooks, a dapper, Harvard-educated attorney, who gained his nickname “Ham” from a war-time prank played upon him by Lieutenant Colonel Andrew Blodgett “Monk” Mayfair in retaliation for “Ham’s” getting “Monk” in trouble with some French officers. “Monk” is a world-class chemist of simian appearance. Outranking “Monk” is Colonel John “Renny” Renwick, an engineer with massive fists, and the trick of punching them through door panels. Then there is Major Thomas J. “Long Tom” (from a long-barreled cannon he used to defend a French village during the war) Roberts, an electrical engineering wizard. And finally, William Harper “Johnny” Littlejohn, who held no military rank because he was a war-time spy, something he could easily do, traveling the world as an archaeologist and geologist. Ironically, he is the only member of Doc’s crew to carry a near-permanent scar from the war (a bad eye; though Doc fixes it via surgery).\nDoc’s and his men’s war-time memories aren’t the stuff of shuddering nightmares, they are points of comparison for when they come under fire by new evildoers. Like Bulldog Drummond, they would find peace intolerably dull if it weren’t for there being an ever-flowing supply of bad guys to thwart.\nWhile our view of the Great War has been shaped by its melancholy poets, it is well to remember that Bulldog Drummond and Doc Savage were far more popular and represented a far different take on the war. It was a more matter-of-fact view: that the war had to be fought; it had to be won; and the skills and comradeship and excitement of war could find a constructive outlet in peacetime — including, most especially, preserving the peace.\nWhile Bulldog Drummond and Doc Savage were fictional, there were plenty of real life veterans, like Sapper himself, who took that view. You could find them still in the Army, Navy, and Marines, you could find them on street corners as police officers, you could find them in public office — men like Winston Churchill and Theodore Roosevelt Jr. — you could find them, in fact, most anywhere. But in the public mind today, despite the entreaties of a bevy of celebrated World War One historians from Sir Max Hastings to John Terraine to yours truly, the First World War is generally dismissed as a pointless slaughter.\nThat is something it most certainly wasn’t. Doc Savage knew that. So did Bulldog Drummond. They knew that stopping the aggression of the Second Reich had been a necessity. And the Great War that succeeded in doing that did not cause them to question but to reaffirm British and American ideals. And when their countries needed them again, they were ready; as we must always be.","url":"https://spectator.org/60458_what-doc-savage-can-teach-us-about-world-war-one/"}
