{"authors":[],"date_download":"2018-10-30 18:30:57","date_modify":"2018-10-30 18:30:57","date_publish":"2016-11-23 21:18:55","description":"Welcome to \"Actual Factual,\" a regular column in which Becca Godwin answers reader questions about goings-on in north Fulton.","filename":"data/vaneerConsumption/WhatsbeingbuiltnexttoaRoswellKFC.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/23/Images/Verizon.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_actual-factual-n_1adaf9842f3455649af3a88f32512cad__1540924257.html","title":"What's being built next to a Roswell KFC?","title_page":"What's being built next to a Roswell KFC?","title_rss":"NULL","source_domain":"ajc.com","text":"Welcome to \"Actual Factual,\" a regular column in which Becca Godwin answers reader questions about goings-on in north Fulton. Today I'll answer a question I came across on Reddit, but you'll find information for submitting your own questions at the bottom of this column. Cheers!\nA couple of days ago, Reddit user cdheiden asked: \"What are they building on [Holcomb Bridge Road] next to KFC (west of 400)? It seems really close to the road.\"\nGreat question, cdheiden.\nI'll give you a hint.\nOh, what's that? You didn't hear me? Well...\n\"Can you hear me now?\"\nGreat job. You accurately guessed the development in question, at 680 Holcomb Bridge Road, will be a Verizon store.\nHere's how I know.\nI asked a Roswell spokeswoman what the dealio was (not in those words, exactly), and she told me.\nSecondly, I asked Verizon what the dealio was (still not in those words), and they told me it would be a Cellular Sales store. That's an authorized Verizon retailer.\nSo I called up Regional Manager Jason Myers. He said the store is slated to open Feb. 1, and that the decision to put a store there was largely based on its good visibility and high-traffic location.\nThirdly, I reviewed some city documents. They show that a Mobil gas station on .36 acres was torn down to make way for the new store.\nNow, bear with me, cdheiden. Just a few more things of note here.\n1. I listened to the audio of the Design Review Board meeting from March 2, when construction of the building was discussed. And... there's this pretty amazing part in it.\nAt about 10 minutes in, board member Marcus Mello shook it up after a presentation from architect Kristen Ware, in which she said the plans are \"kind of typical for Verizon’s colors and their building.\"\nMello's response: \"The only comment that I have is the building looks rather plain and boring to me. It's very like, as vanilla as you can get. We would like something a little more distinctive. This could be just anywhere.\"\nWare then asked what kind of features Mello had in mind when he said \"distinctive.\"\nMello suggested the building could have some more canopies, or not have the typical beige crown molding.\n\"Do something more creative. It's just, I don't know how many times I have seen this,\" he said. \"Or drive around Roswell and see what type of buildings we have here and do something that would be a good match and is architecturally interesting.\"\nI like where your head's at, Mr. Mello.\n2. In your post, you mentioned that the building looks close to the road.\nIf it's any consolation, the Department of Transportation had the engineers rework the plans to be safer for pedestrians. With the new layout, they no longer have to cross the drive aisle to get to the building.\nIt was also proposed that the sidewalks along the perimeter be widened by at least one foot.\n3. I should point out — and give props to — the Reddit commenter who responded to you by saying, \"Looks like a Verizon store,\" and linking to a website that showed a construction project lead from June.\nThat's good stuff, mlw72z. Good stuff indeed.\nCdheiden and fellow-commenter prolikewhoa did not seem excited by this news. In fact, they literally virtually yawned at it.\nAnd while I realize the news isn't anything to shake your tailfeather at, hopefully I was able to flesh out the details and make it just a touch more interesting.\n4. In other Verizon news, a new store opened today at 914 Market Place Boulevard in Cumming.\nAnd, that's it.\nI've enjoyed our time together, but it's time to go now.\nI, Becca Godwin, am a staff writer with the AJC and a lover of metro Atlanta. To submit “Actual Factual” questions, contact me at becca.godwin@ajc.com, @BeccaJGGodwin on Twitter or via the form below.","url":"https://www.ajc.com/news/local/actual-factual-north-fulton-what-being-built-next-roswell-kfc/gZzRtvwbZYHtyhHvXhwrmK/"}
