{"authors":[],"date_download":"2018-10-22 22:49:28","date_modify":"2018-10-22 22:49:28","date_publish":"2014-05-12 17:34:34","description":"Early analysis has yielded little, but experts hope some clues can be gleaned from the 17-minute recording.","filename":"data/vaneerConsumption/WhatBokoHaramsChillingVideoReveals.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/436631/140512-boko-haram-video-main-1240_9042e3656c1c19926b1dc480b93d070c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_what-boko-harams-chilling-video-reveals-n103371_1540248568.html","title":"What Boko Haram's Chilling Video Reveals","title_page":"What Boko Haram's Chilling Video Reveals","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAuthorities who want to find and free the kidnapped Nigerian schoolgirls will play and replay the new Boko Haram video searching for clues — from the scrubby West African backdrop to the faces of the girls themselves.\nU.S. officials told NBC News on Monday that they believe the video is authentic. Most important, outside experts said after watching it, the video reveals that at least some of the girls are alive — or at least were when it was recorded. They were abducted almost a month ago.\nBeyond that, details from the footage may help authorities figure out where the girls are being held — and what to do about it.\nWhere are they?\nThe video shows dozens of girls — no more than 100 out of 276 still missing — in full-length Islamic dress, most of them sitting on land thinly covered with straw, on scrub land in front of some scattered trees.\nIt looks relatively indistinct, but it may be enough, using sophisticated Western geo-locating software, to narrow down where the girls are.\n“There’s been work done against every major terror group that puts together these kinds of films,” said Seth Jones, a former adviser to the commanding general of U.S. special operations forces in Afghanistan.\nThe CIA and other American experts are analyzing the video, but the early analysis has not yielded much about when or where it was shot. One U.S. official told NBC News that the images reveal little of the girls’ location beyond “under a tree.”\nExperts have said that the girls may be held in a shadowy and notoriously dangerous part of Nigeria called the Sambisa Forest, where camps of heavily armed Boko Haram subsist among African wildlife. It is eight times the size of Yellowstone National Park, but experts hope the video can still help.\n“Investigators can work with a lot of stuff,” said Jones, now a counterterrorism expert for the Rand Corp. “The types of plants, the rock formations, the trees, the lay of the land. You can make a lot of inferences from what’s in the video.”\nAbubakar Shekau, the Boko Haram leader, is seen in the video, cradling a gun and saying that the girls have been converted to Islam. But he does not appear with them, suggesting that they could be in separate parts of the country.\nCondition of the girls\nThe girls in the video show no apparent signs of torture or other physical harm. In one segment, they are mostly expressionless as they recite Al-Fatiha, the seven-verse Quran chapter that is one of the first prayers taught in Islam.\n“They look terrified, frankly,” said Richard Downie, deputy director of the Africa program at the Center for Strategic and International Studies.\nThe girls also appear clean, which suggests that the video was taken soon after they were captured, said Jacob Zenn, an analyst of Africa issues at the Jamestown Foundation, a Washington research institute. They at least had time to learn the prayer, one U.S. official noted.\nThere had been fears that the girls had been split into many groups, perhaps in several countries. That so many of them are together will inform, but not solve, the question of whether to negotiate with Boko Haram for their release or attempt a daring rescue.\nMichael Leiter, an NBC News terrorism analyst, stressed on TODAY that a rescue would be extremely difficult for the Nigerian authorities to pull off, even with help from the United States.\nIn a rescue, the benefit of the large grouping would be efficiency — so many captives in one place. The drawback is that a miscalculation could be disastrous.\n“One issue of concern for anybody thinking about a hostage rescue is the ease with which somebody could just turn a gun used to protect the girls, protect them from intrusion, and just turn and start shooting the girls,” Jones said.\nMeans and motives\nThe video also sheds light on the ambitions of Boko Haram, a terrorist group opposed to Western-style education and to the education of girls. Holding hostages and demanding the release of militant prisoners is similar to tactics used by Hamas and by at least two offshoots of al Qaeda.\nIn at least one previous case, Boko Haram has demanded money, not the release of prisoners, in exchange for letting a hostage ago. In November, the group kidnapped a French family of seven. A Nigerian government document reviewed by Reuters showed that Boko Haram was paid $3.1 million by negotiators from France and Cameroon.\n“We’ve gotten to this point because they’ve been very successful in the past,” Jones said, and a negotiation now makes it more likely that Boko Haram will kidnap again.\nThe relatively professional quality of the video illustrates Boko Haram’s increasing sophistication, Zenn said. He said its previous videos looked homemade, with primitive graphics.\nAnd the video is in Arabic, which suggests that Shekau is trying to reach not just Nigeria but a pan-Islamic audience, raising the group’s profile.\n“He’s trying to gain global support from other al Qaeda-like groups and show that he’s prominent on the world stage,” Don Borelli, former assistant special agent in charge of the New York Joint Terrorism Task Force, said on MSNBC.\nDownie said that he was encouraged because the video shows at least the prospect of negotiation. At the same time, he said, it shows that Boko Haram understands the worldwide attention it has already received for the mass abduction.\n“They hold all the cards,” he said.\nRobert Windrem and Cassandra Vinograd of NBC News contributed to this report.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/what-boko-harams-chilling-video-reveals-n103371"}
