{"authors":[],"date_download":"2018-10-30 14:30:38","date_modify":"2018-10-30 14:30:38","date_publish":"2015-08-26 00:00:00","description":null,"filename":"data/vaneerConsumption/WhatdoesTrumpmeanwhenhesaysinvitethegoodonesback.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_08_what_does_trump_mean_when_he_says_invite_the_good_ones_back_1540909838.html","title":"What does Trump mean when he says 'invite the good ones back'?","title_page":"What does Trump mean when he says 'invite the good ones back'?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Trump said ... that as president he would deport all undocumented immigrants and then allow the “good ones” to reenter the country through an “expedited process” and live in the U.S. legally, though not as citizens.\nAt a press conference where Donald Trump put Jorge Ramos in his place, Trump repeated a key element of his immigration plan, which seems to be deporting all illegal aliens but \" inviting the good ones back to get documentation and become legal.\" This part of his plan has no details but seems to be a key part of his policy.\nTrump has portrayed himself as being the toughest candidate on illegal immigration, based on the positions he has taken in the past two weeks. He is certainly toughest on the 14th Amendment, the only major candidate who calls for a quick legislative fix to prevent anchor babies (both Asian and Hispanic ones) from becoming automatic citizens. He is also the only candidate (including even Ted Cruz) to call for the deportation of illegal aliens.\nBut \"inviting the good ones to come back\" leaves open a big hole. The question is how big. How many illegal aliens are \"good\"? Is the only qualification for \"good\" that they haven't been convicted of a major crime, in which case most illegals would be considered \"good\"? Are the ones who lied to get a visa and purposely overstayed considered to be good? There is no way to know, but it is possible under Trump's plan that most illegals would be invited to come back (!).\nAnother thing that is unclear is whether illegals will actually have to leave the country and wait in their own countries before getting permission to return. Will Trump actually take the heat for the tremendous political effort to deport all illegals, only to allow the majority of them back six months later? Or will illegals simply have to go back to their countries, reapply in a day, and return to the U.S. to await the results?\nThere are no answers, but these are key questions to be asked. So far in this campaign, partially thanks to Donald Trump, we have learned a lot about the candidates' positions on illegal immigration. Bush is for it. Scott Walker was against birthright citizenship, then neutral on it, then for it. Ted Cruz is against it as a policy matter but doesn't believe that legislation can fix it. Ted Cruz also wants to build a physical wall. Jeb Bush, on the other hand, wants to build a conveyer belt.\nBut the irony is that while Trump's outspokenness has pushed the other candidates to be specific, we have not gotten the same level of detail from Trump. I hope that in the weeks to come, we learn more about this key point of his immigration plan.\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/08/what_does_trump_mean_when_he_says_invite_the_good_ones_back.html"}
