{"authors":["Caroline Pate"],"date_download":"2018-10-30 22:52:44","date_modify":"2018-10-30 22:52:44","date_publish":"2014-08-14 17:09:12","description":"No matter who you follow, last night your Twitter timeline was probably full of updates and outrage from the protests in Ferguson, Missouri. The fourth night of protest following the shooting of unarmed black teenager Mike Brown by police was the…","filename":"data/vaneerConsumption/WhatCelebritiesAreSayingAboutFergusonWhyItMattersThatTheyreSpeakingUp.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/2ae53331-d5ba-4834-b830-2eec1f403bec.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35773-what-celebrities-are-saying-about-ferguson-why-it-matters-that-theyre-speaking-up_1540939964.html","title":"What Celebrities Are Saying About Ferguson & Why It Matters That They're Speaking Up","title_page":"What Celebrities Are Saying About Ferguson & Why It Matters That They're Speaking Up","title_rss":"NULL","source_domain":"bustle.com","text":"No matter who you follow, last night your Twitter timeline was probably full of updates and outrage from the protests in Ferguson, Missouri. The fourth night of protest following the shooting of unarmed black teenager Mike Brown by police was the worst night yet, with police responding to the non-violent protest with tear gas, smoke bombs, and rubber bullets. The seeming militarization of the police force in Ferguson resulted in protests from every corner of the Internet, including celebrities. Writers, musicians, rappers, comedians, actors and celebrities of every kind spoke out about the conflict between demonstrators and police in Ferguson.\nOn first reaction, it's easy to want to disregard the opinion of celebrities on political issues. After all, celebrities aren't exactly \"just like us.\" They're part of an economic elite. It's rare you'd see a celebrity participate in a protest. But many stars, especially celebrities of color, had some interesting insights on the protests happening in Ferguson. And regardless of how insightful their opinions are, celebrities do have something important to offer the cause: exposure. Many tweets and Instagram posts introduced an important conflict to audiences who may had never heard of it before. So here are some of the social media posts that are helping to bring the conflict in Ferguson to the public:\nKiller Mike\nJohn Legend\nPenn Badgley\nLena Dunham\nAndy Cohen\nMia Farrow\nKeke Palmer\nMartha Plimpton\nBilly Eichner\nMichael Ian Black\nJohn Green\nJuicy J\nBig Boi\nKumail Nanjiani\nKerry Washington\nNeil Gaiman\nMoby\nHari Kondabolu\nGerard Way","url":"https://www.bustle.com/articles/35773-what-celebrities-are-saying-about-ferguson-why-it-matters-that-theyre-speaking-up"}
