{"authors":["Ariel Kay"],"date_download":"2018-10-30 23:00:39","date_modify":"2018-10-30 23:00:39","date_publish":"2014-08-14 14:04:28","description":"We've made it folks! We're finally halfway through Season 16 of Big Brother , and the jury is starting to form. Fans are able to catch every move players make on Big Brother via livefeeds, telecasts, and social media. But what goes down inside the…","filename":"data/vaneerConsumption/WhatHappensintheBigBrotherJuryHouse5ThingsJocastaHaydenAreProbablyDoing.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/ac1274c1-658e-4a70-a207-f08d7ce2fdc1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35369-what-happens-in-the-big-brother-jury-house-5-things-jocasta-hayden-are-probably-doing_1540940439.html","title":"What Happens in the 'Big Brother' Jury House? 5 Things Jocasta & Hayden Are Probably Doing","title_page":"What Happens in the 'Big Brother' Jury House? 5 Things Jocasta & Hayden Are Probably Doing","title_rss":"NULL","source_domain":"bustle.com","text":"We've made it folks! We're finally halfway through Season 16 of Big Brother , and the jury is starting to form. Fans are able to catch every move players make on Big Brother via livefeeds, telecasts, and social media. But what goes down inside the Jury house? Just like the Big Brother house, the location of the Jury is kept secret. Players have no access to the outside world while living there, including no phones, internet, or television. And just like on the show, there's still plenty of scheming going on. Even once players are out of the game themselves, they may continue campaigning on behalf of their former alliance members and friends, or they could choose to ruin others' games by revealing secrets.\nThough Hayden Voss and Jocasta Odom both left the house in a double eviction on Aug. 7, they're not out of the game yet. Along with the next seven players to be evicted, Hayden and Jocasta will get to vote on who takes home the $500,000 prize at the end of September. Along with that grave responsibility, host Julie Chen has suggested that jury members could also have a chance to return to the game, though we're not yet sure of how exactly that would work. (Donny Thompson's not even out yet, but he already has my vote. If only the returning houseguest was chosen via best birdcall, he'd have it in the bag.) At this point, Hayden and Jocasta are the only two Jury members, meaning just the two of them have been hanging out all week together. Here's what I imagine they've gotten up to in that time.\nWatching Big Brother Like the Rest of Us... Sort Of\nOf course, Hayden and Jocasta won't be able to go home and watch all their season's episodes like the previous evictees. But they are able to stay somewhat up to date on the happenings inside the house. Starting with the next eviction, each eliminated houseguest will bring to Jury a DVD of that week's competitions, meetings, and any other time the whole house gathers for an activity. They're not privy to any secret strategy sessions, private conversations, or to Diary Room entries, but they get to see how the formal events of the week play out.\nDishing\nOn Big Brother, everything you say can be used against you. Even if you trust other players, you've got to constantly watch what you say and do, lest someone picks you for their target. So after 49 days living in that kind of stress, of course Hayden and Jocasta are going to have a good ol' fashioned gab sesh. Maybe they won't reveal all their secrets, considering there's a chance one of them may return. But they'll finally get a chance to air some grievances without fear of retribution. My best guess at to what they'll talk about first? Caleb's craziness.\nComparing Fashion\nBoth these houseguests have, um, quirky style. Jocasta could certainly give Hayden tips on where to find a nice bow tie (he's gotta get fancy for the finale!), and Hayden could teach Jocasta the art of the perfect bun.\nBonding Over Missing Their Loved Ones\nSure, Hayden said in his exit interview that he and Nicole probably won't stay together in the end. But his eviction came so fast he didn't even have a chance to say goodbye. He and Jocasta can find common ground by commiserating over missing their sweethearts — at least until the power players in the house inevitably send Nicole to Jury.\nLet's Be Honest, Probably Praying\nJocasta, a minister, brought her spirituality to the Big Brother house (sometimes pretty intensely), so I'm sure she's praying in the Jury house too — maybe for a chance to return to the main house and win the prize. Right now she only has Hayden to pray with, but after Thursday night, they'll be joined by one more.\nFor more on the houseguests, check out Bustle’s very own Big Brother podcast, The Diary Room. Listen to the latest episode below, and be sure to check out future episodes on Bustle’s SoundCloud page and iTunes.\nImages: Sonja Flemming/CBS; Cliff Lipson/CBS","url":"https://www.bustle.com/articles/35369-what-happens-in-the-big-brother-jury-house-5-things-jocasta-hayden-are-probably-doing"}
