{"authors":["Anthony York","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:15:36","date_modify":"2018-10-31 00:15:36","date_publish":"2015-11-22 08:00:00","description":"Surrounded by city and union officials at a Labor Day rally in South Los Angeles last year, Mayor Eric Garcetti proposed raising the city’s minimum wage","filename":"data/vaneerConsumption/WhatsdrivingCaliforniacitiestoahigherminimumwage.json","image_url":"https://calmatters.org/wp-content/uploads/la_op_ed-e1538700010186.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944936.html","title":"What's driving California cities to a higher minimum wage?","title_page":"What's driving California cities to a higher minimum wage? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Surrounded by city and union officials at a Labor Day rally in South Los Angeles last year, Mayor Eric Garcetti proposed raising the city’s minimum wage to $13.25 per hour by the end of the decade — a plan he said would significantly help low-income workers in Los Angeles while placing minimal burden on employers.\nNine months later, Garcetti signed an ordinance that is more progressive than he proposed – a citywide wage hike to $15 an hour by 2021, with automatic increases in future years.\nWhat started as an effort to raise the minimum wage among some of Los Angeles’ largest public-sector unions has become a statewide movement, gaining support in polls and pushing mayors across California to propose hikes and sometimes to go further than planned.\n“Raise the Wage” has become a rallying cry for Democrats in 2015 to fight against economic inequality. Local governments across California have heeded the call. According to the UC Berkeley Labor Center, there are 29 cities and counties in the United States that have wage floors higher than their state’s minimum. Fourteen of those local governments are in California.\nProponents for raising the minimum wage argue the 14 local California governments have taken an important step in the fight against poverty and the higher costs of living in their regions. They point to the latest U.S. Census Bureau figures that show about 16 percent of Californians live below the federal poverty level, making them eligible for government assistance. The census data also show that if the state’s higher cost of living was factored in, the percentage of Californians who could be considered living in poverty climbs to 23.5 percent.\nOpponents counter that raising the minimum wage alone will not address California’s poverty and cost of living issues, and may worsen the plight of low-wage workers.\nIn an analysis of Los Angeles’ wage hike commissioned by the Los Angeles Chamber of Commerce, Beacon Economics argued the wage ordinance could lead to businesses employing fewer low-wage workers, resulting in a higher unemployment rate among unskilled workers.\n“It doesn’t work,” said Chris Thornberg, a founding partner of Beacon Economics. “Does a higher minimum wage reduce poverty? No. Does it reduce homelessness? No. Does it get more at-risk inner-city youth to work? No. So why are we doing it? We have to find a different plan.”\nThornberg said the best approach to helping low-wage workers and those in poverty has to start at the federal and state level, namely increasing the earned-income tax credit for low-wage workers and raising tax rates on upper-income earners.\nThornberg gave two reasons why California faces a bigger gap today between wages and cost of living. In recent decades, California lost tens of thousands of well-paying manufacturing jobs to other states, nations and innovation. At the same time, California has excelled at creating high-paying, high-skilled jobs in the technology and digital sectors, and lots of low-paying jobs.\nOf the seven fastest-growing employment sectors in the state in terms of total jobs, for example, all of them are low-wage employers with median salaries ranging from $9 to $11 an hour, according to projections from the California Employment Development Department. Retail, restaurants and other food-service work account for almost 30 percent of these low-wage jobs. Other sectors with high numbers of low-wage workers include child care and administrative services and personal-care services.\nJobs in 2012 compared to projected jobs in 2022\n“The push to raise the minimum wage in California is a political reaction to the fact that the kind of things we need to see done at the national level are not being done,” Thornberg said. “So you have bad policy in Washington, D.C., and that’s leading people to put in bad policy at the local level. We’re all losing here.”\nRegardless, more wage increases are on the way at the local level. Cities from Santa Clara to Santa Monica are contemplating local wage ordinances above the statewide minimum of $9 an hour. California’s statewide minimum wage will rise to $10 an hour on Jan. 1, 2016.\nAs more local governments look to raise the minimum wage within their jurisdictions, the pressure increases on state lawmakers to go beyond $10 an hour, said Robb Korinke, principal of GrassrootsLab, a firm specializing in advocacy and tracking of local government policy.\n“It’s a tried-and-true playbook that unions and their allies are building on,” Korinke said. “They start in large cities where they have a lot of influence … . First, you peel off the population centers. Then you make the argument that it’s uneven and not fair, and smaller cities get caught in the tidal wave.”\nDan Newman, a spokesman for a ballot measure backed by the United Healthcare Workers to raise the minimum wage to $15 an hour statewide by 2021, said local elected officials simply have been more responsive than state lawmakers in addressing the need for a higher wage. He notes that a Field Poll in August found that 68 percent of Californians support a $15 minimum wage and that within weeks the measure had gathered more than 25 percent of the total signatures needed to qualify for the November 2016 ballot. Under new state rules, that threshold will trigger legislative hearings on the measure next year.\n“You have seen some cities leading the charge, especially in places with high cost of living,” Newman said. “But we consider $15 a bare minimum for everyone in the state … . When you’ve got 68 percent of Californians supporting a $15 minimum wage, you come with an inherently broad coalition.”\nWeeks after healthcare workers announced their ballot proposal, another ballot proposal was launched that would phase in a $15 minimum by 2020 and expand paid sick leave for all workers from three to six days per year.\nWhile there is broad consensus among Democrats about the need for a higher wage, there is no agreement on how quickly or to what level the wage should rise — and whether it should apply to all workers.\nA bill by Sen. Mark Leno (D-San Francisco), would raise the statewide minimum to $13 per hour by 2017, and include automatic increases in future years. That measure cleared the state Senate earlier this year, but was held in the Assembly Appropriations Committee. At the request of Assembly Democrats, the state’s legislative analyst is preparing a report on a number of potential minimum-wage proposals, and looking at the fiscal and policy impacts of the various ideas.\nThe Brown administration has expressed its concerns about Leno’s plan. While Gov. Jerry Brown has not commented on the bill, the measure received a scathing rebuke in a Department of Finance analysis.\nThe analysis noted that government is one of the largest employers of minimum-wage workers.\nIn its review of Leno’s proposal, the Department of Finance found that the wage hike could cost the state as much as $3 billion per year once it is fully implemented. Most of those costs – about $2 billion — would come in the form of higher wages for in-home support workers who provide care to low-income elderly, blind or disabled people.\nThe administration’s concerns went beyond just the workforce cost to government. “The net impact of an increased minimum wage on California’s economy and state budget is likely to be negative,” the administration analysis said. “For the economy, losses from higher production costs to businesses would … lead to slower employment growth.”\nThat assertion is the source of much debate.\nBusiness groups say the higher the minimum wage is raised the more job losses and higher prices Californians will see. “The impacts of these dramatic wage increases can be seen in cities such as San Francisco and Oakland, where businesses have had to increase prices and implement automation” to replace workers, said Janna Haynes , a spokeswoman for the California Restaurants Association. The minimum wage in San Francisco and Oakland is $12.25 an hour.\nOn the other side, a recent study from UC Berkeley concluded a higher minimum wage would put more money in the pockets of low-wage workers who would be more likely to spend it, thus helping the state’s economy. In addition, the study found, increased costs to government would be covered by savings on social programs, as higher-paid minimum-wage workers would rely on fewer government services to make ends meet.\nAmid the hodgepodge of local proposals and $15 ballot initiatives, Leno acknowledged that those efforts may help clear a political path for his more modest legislative proposal.\n“We’re in an extreme time and people get it,” Leno said, noting the Field Poll that found strong support for a $15 minimum. “If we do not get our bill signed, there is a good chance an even higher minimum wage will be on the statewide ballot in 2016.”\nLeno says he is open to an idea by Assemblyman Jimmy Gomez (D-Echo Park) that some parts of the state should have a higher minimum wage than others. But the floor, he says, must be set at a reasonable level, and Leno argues $10 per hour is too low for any California worker.\n“Our premise is to ensure that no one employed full-time earns a poverty wage,” he said. “Even in Fresno, or Bakersfield, or Eureka.”\nAnthony York is a former Los Angeles Times reporter and is currently publisher of the Grizzly Bear Project.","url":"https://calmatters.org/articles/whats-driving-california-cities-to-a-higher-minimum-wage/"}
