{"authors":[],"date_download":"2018-10-30 20:04:28","date_modify":"2018-10-30 20:04:28","date_publish":"2016-12-24 23:27:00","description":"Here’s what Falcons coach Dan Quinn had to say after the victory over the Panthers:...","filename":"data/vaneerConsumption/WhatDanQuinnhadtosayafterthewinoverthePanthers.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/24/Images/newsEngin.17107394_Falcons_Panthers_Footba-2--1-DAN-QUINN.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_what-dan-qu_d16731ee83f645ab981a01b439927240__1540929868.html","title":"What Dan Quinn had to say after the win over the Panthers","title_page":"What Dan Quinn had to say after the win over the Panthers","title_rss":"NULL","source_domain":"ajc.com","text":"Here’s what Falcons coach Dan Quinn had to say after the victory over the Panthers:\nOpening statement\nI told the team today I thought this was a hard fought division win produced by everyone, so it belongs to everyone. It was all three phases. Different guys stepping up, it was good to see some of these tight ends have their first touchdown receptions with (Joshua) Perkins and DJ (Tialavea), same thing on the defensive side with (Brian) Poole and with Jalen (Collins). It really goes to show, when I say it belongs to everybody, that’s coaches, training staff, equipment staff, the personnel guys to get the right people in here for the right spot. We knew this was going to be a hard fought game. Carolina has the ability to rush with their front four or pressure, that was shown today and we knew how hard it was going to be to run the football against them. So it was great to see Tevin (Coleman) get the long one there. At the end it still comes down to football, so for us to finish plus two today that was a real key to that victory.\nWhat did you say to the team postgame?\nWe knew this was going to be a hard fought game, so when you put everything into it, with one another those kind of victories, they belong to everybody. So we wanted to make sure they all knew they were in it together. We celebrated with some of the young guys for their first touchdowns with DJ (Tialavea) and (Joshua) Perkins and with (Brian) Poole and Jalen (Collins), for their first interceptions. You can tell how close they are because they wanted to celebrate those moments with them in this game. Division game against a tough team and that’s exactly what we expected. We knew it was going to be a physical game and it was. At the end, like I said, having the turnovers was a real factor for us.\nThird down and 21, just got sacked and 12 men on the field, what does that say about Matt Ryan being able to complete that?\nIt was kind of a good finishing moment, knowing that you are never out of the fight. When you get a chance to get it to (Devonta) Freeman or to Tevin (Coleman) the run and catch is alive with them they are able to convert some plays even when the odds are long. Giving those guys a chance to go at it was good, but I’m not surprised by Matt (Ryan) when there’s a play, he’s able to reset and get going fast. And it was a terrific play on the bounce for Coleman on the long touchdown run. We’ve been waiting on those. You guys have seen that too where we were so close, or a missed tackle or a guy clipped him on the ankle, so for him to finish tonight on a long run against a very good defense is something that we were all excited for.\nTouchdown passes to 13 different receivers this year and what that says about Matt Ryan\nI think a lot of things. One, I think it shows he really trusts his training and knows that his teammates here, the standard doesn’t change it, and I think it goes deeper than that with the personnel staff to keep finding the right answers, the right guys. Then for the coaching staff, how to feature them and having that balance together, I think is an important thing. I think that was demonstrated a few weeks ago when we didn’t have Julio (Jones) for a game out on the West Coast, and what are we going to do, and we’re going to do what we do, we’re going to keep attacking, so it was great to see that. I was unaware of that stat, I was unaware that we even kept that stat to be honest with you, but it was good to find out.\nThe combination of Devonta Freeman and Tevin Coleman, how does the offense thrive around that?\nWe definitely do. That duo, they are connected too. You can see the genuine excitement they have for one another when they make plays. Honestly, when either of them are in, the expectation for them making plays and taking care of things, there were some excellent protection today by (Devonta) Freeman. That’s been a part of his game that he’s really worked hard against a very good blister in (Thomas) Davis. It was maybe the first play of the game, I saw Freeman with the good protection. That part of his game he’s really worked at. Both of them were disappointed they had to put the ball on the ground last week and that was a real part of their intent, you could see how hard they ran today.","url":"https://www.ajc.com/sports/football/what-dan-quinn-had-say-after-the-win-over-the-panthers/EHnyCw8Gz0e1ku4lJMHBdJ/"}
