{"authors":[],"date_download":"2018-10-30 21:16:51","date_modify":"2018-10-30 21:16:51","date_publish":"2018-08-24 16:00:00","description":"Atlanta Catholics want the church to step up on sexual abuse cases","filename":"data/vaneerConsumption/WhatAtlantaCatholicsseekinwakeofmoreabuseallegations.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/24/Images/newsEngin.22845449_AP18227779452523.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_religion_atlanta_ac0bbdcac93e3508076e87a3bbaa727b__1540934211.html","title":"What Atlanta Catholics seek in wake of more abuse allegations","title_page":"What Atlanta Catholics seek in wake of more abuse allegations","title_rss":"NULL","source_domain":"ajc.com","text":"Naka Nathaniel has become a symbol of the frustration and anger many Catholics feel in the wake of an explosive grand jury report out of Pennsylvania that outlined decades of sexual abuse by 300 priests and a cover-up by church officials.\nAs the priest at a Mass last Sunday at St. Thomas More Catholic Church in Decatur said the church had to change, Nathaniel, who was sitting with his 9-year-old son, stood up and yelled one word: “How?”\nHow would the church change? What was going to be done? What would he say to his son?\n“The conversations since Pennsylvania have shaken me to the core,” he said.\nIndeed, sometimes the simplest questions can be the most powerful, and he’s not the only one asking them in the wake of the latest revelations.\nSome metro priests addressed the scandal in their homily or in closing remarks; others were silent.\n“It makes you wonder, if this went on in Pennsylvania, where else did it go on?” said Atlanta physician Terri Hyde, who was also at Mass that Sunday.\nBeing Catholic is part of her identity, said Hyde, so there’s no thought of leaving the church and its teachings. After all, she’s had disagreements with the church before over such issues as the role of women and homosexuality.\nRelated: Vatican official to visit Emory this fall\nShe has a son, who will likely be an altar boy, and a daughter who may follow suit one day.\n“He’s almost at the age where I will trust him to the leadership of the church, so it does give me pause,” she said.\nWhat came out of Pennsylvania makes her wonder if the Catholic Church has been focused more on protecting the hierarchy than “protecting the people.” She would like to see all those involved in the abuse and cover-ups resign. “It’s inexcusable.”\nNathaniel’s actions caught national attention. They have made their way around social media, thanks to a Catholic theologian from Emory University’s Candler School of Theology who tweeted about the Mass. Her tweetstorm got thousands of retweets.\nSuch scandals and cover-ups are not new. They have taken place around the globe — Australia, Chile. Just recently, the pope accepted the resignation of Cardinal Theodore McCarrick over claims he sexually abused seminary students and an altar boy for years.\nRelated: How the Pennsylvania case is affecting Catholics here\n“From the pope, all the way down to the clergy, the church hierarchy needs to resign,” said Nathaniel, a cradle Catholic and former journalist who once covered the New York visit of then-Pope John Paul II. “That’s the most powerful thing they can do.”\nThose priests and officials who have never been accused “can come back and help rebuild the church.”\nThis latest scandal has put pressure on U.S. church officials and Pope Francis to act decisively on the handling of priests who are accused of sexual abuse and those who are involved in cover-ups.\n“Looking ahead to the future, no effort must be spared to create a culture able to prevent such situations from happening, but also to prevent the possibility of their being covered up and perpetuated,” the pontiff said in a letter to Catholics worldwide released earlier this week.\nIn May, according to CNN, every bishop in Chile offered his resignation to Rome after a sex abuse scandal. Media reports say five were accepted.\nAtlanta Archbishop Wilton D. Gregory, who was president of the U.S. Conference of Catholic Bishops in 2002, when it looked at the issue of sexual abuse by priests, wrote a letter to the 1.2 million Catholics in the archdiocese.\nRELATED: Watch survivor talk about systemic abuse issues in the church\nHe vowed to take whatever next steps “are necessary to ensure vigilance and accountability and to foster healing.”\nIndeed, Catholics are closely watching what happens in the Atlanta Archdiocese and nationally.\n“Our plan is to continue to offer healing support to help victim-survivors and their loved ones through a tremendously difficult time,” Gregory said in a statement, which encouraged people to use the hotline (see box). “With the church worldwide, in the coming weeks and months, we will evaluate how we can do even more to support families and safeguard against all types of abuse.”\nWill it mean a mass exodus from the pews?\nWhether people will leave their local parish or the church entirely will depend on how local priests and church officials react, said Sandra Yocum, a professor of faith and culture at the University of Dayton.\n“They have to honestly and effectively address the issue and listen to their parishioners,” she said. “In our discussions, we forget how painful this can be. People have a deep devotion and love for their faith.”\nShe said the Pennsylvania case will likely trigger more reports of abuse by clergy. Many sexual abuse survivors never speak out, or if they do, it can be years after the incident. Already, she said, sexual abuse hotlines in Pennsylvania alone are experiencing an increase in calls.\nShe said priests who have had credible claims against them and bishops who failed to take appropriate action need to be removed from office to help restore confidence among the Catholic laity.\nIn January, the Pew Research Center conducted a survey that asked American adults about their views of Pope Francis. It showed that while the pope was still highly regarded in the U.S., there were cracks in opinion about him among lay Catholics on several fronts.\nRelated: Lobbyist for archdiocese tries to gut childhood sexual abuse bill\nThe survey found that between 2015 and 2018, the share of U.S. Catholics who give Pope Francis “excellent” or “good” marks for his handling of the sex abuse scandal dropped from 55 percent to 45 percent.\nJoe Vella, a longtime parishioner at the Catholic Shrine of the Immaculate Conception in downtown Atlanta, is not thinking of leaving the Catholic Church.\n“Absolutely not,” said Vella of Decatur, who works for a nonprofit. “The Catholic Church took a very strong stand back in 2002 when the Boston story broke. The church out of Rome and the church in America have been working diligently throughout the years to establish a policy and procedure to work through these accusations and convictions. … I let the church guide me about my spiritual direction, and on that they are doing a fine job.”\nHe said the incidents that are detailed in the Pennsylvania report happened a long time ago. “If this took place in very, very recent history, then I’d say we have a real problem,” he said. He does think, however, that the church should offer victims some kind of “resolution,” although it does not have to be financial.\nThe abusive priests and the church officials who knew of the abuse and simply transferred priests should face criminal or legal action and removal, Vella said. “I honestly believe that’s what most Catholics are looking for. There are thousands of great priests out there.”\nSusan B. Reynolds, the Candler School of Theology assistant professor of Catholic Studies who tweeted about Nathaniel, remembers there were some people in church that day who wanted him to sit down and be quiet.\n“When he stood up, I burst into tears,” she said. “He kind of represented all of us. Here was this prophetic voice crying out in the wilderness. We have had enough of empty answers. We have had enough of statements. … That was a question that all Catholics are asking themselves. Where do we go from here?”\nShe would like to see independent investigations, “no more bishops investigating bishops,” and an elimination of the statute of limitations, which limits accountability. Earlier this year, the Atlanta Archdiocese was among those fighting legislators who tried to change the statute of limitations in Georgia.\n“Right now, this is, among other things, a moral crisis of leadership,” she said. “The future of the Catholic Church depends on how leaders act in the coming days.”\nAfterward, she went up to Nathaniel and shook his hand.\nThen she said two words: “Thank you.”\nFOR HELP\nArchdiocese of Atlanta 24-hour abuse reporting line: 1-888-437-0764\nSNAP, 1-877-SNAP-HEALS (1-877-762-7432)\nRAINN, National Sexual Assault Hotline: 1-800-656-4673","url":"https://www.ajc.com/lifestyles/religion/atlanta-catholics-want-the-church-step-sexual-abuse-cases/hFTQHt498DuwM6ACn1GJEP/"}
