{"authors":["Rosie Narasaki"],"date_download":"2018-10-30 22:24:43","date_modify":"2018-10-30 22:24:43","date_publish":"2014-08-15 18:00:02","description":"Predicting what celebrities will wear to award shows is legitmately one of my favorite hobbies. And I've actually gotten pretty close a couple times: I predicted that J. Law would wear that sequin-y Dior number to the Golden Globes, and she ended up…","filename":"data/vaneerConsumption/WhatDressWillLenaDunhamWearToTheEmmysAFewCakeInspiredGownsSheShouldConsider.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/9c434f18-3e8b-4802-84d2-fc970aa2afdb.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35815-what-dress-will-lena-dunham-wear-to-the-emmys-a-few-cake-inspired-gowns-she-should-consider_1540938283.html","title":"What Dress Will Lena Dunham Wear To The Emmys? A Few Cake-Inspired Gowns She Should Consider","title_page":"What Dress Will Lena Dunham Wear To The Emmys? A Few Cake-Inspired Gowns She Should Consider","title_rss":"NULL","source_domain":"bustle.com","text":"Predicting what celebrities will wear to award shows is legitmately one of my favorite hobbies. And I've actually gotten pretty close a couple times: I predicted that J. Law would wear that sequin-y Dior number to the Golden Globes, and she ended up wearing it to the SAG Awards. Oh, and Anne Hathaway was allegedly supposed to wear the Valentino gown I guessed for her, but then she ended up changing at the last minute because it was too similar to Les Miserables castmate Amanda Seyfried's. I also guessed that Jessica Chastain would wear gold to the 2013 Academy Awards, if you want to count that (I do!).\nUnfortunately, the number of times I've gotten into the ballpark is far outweighed by the times I've been completely wrong (though I stand by the fact that Kerry Washington totally should have worn that orange and pink Monique Lhullier crop-top/ballgown hybrid instead of that fairytale Marchesa monstrosity she ended up wearing). My track record might not be the best... but this time, things will be different! You know why? I have a clue from the source. Yes, Lena Dunham took to her Twitter account to tease her followers about her dress for this year's Emmy Awards:\nSo, sleuth that I am (or rather, aspire to be), I checked the recent runway shows of designers she's worn in the past for any hint of a Dunham-esque dress that looked cake-y and sweatpant-y — and here are my hard-won results:\nZac Posen\nShe's worn Zac Posen a lot in the past (apparently, he's an old friend), and this dress looks like it might be constructed completely out of buttercream frosting. Which is promising on the cake front, but it looks mad uncomfortable, which might take it out of the running.\nChristian Dior\nSo, any of the four of these dresses could be the culprit: they're fittingly cupcake-like when it comes to silhouette, and with their delicate pastel coloring and intricate detailing, they wouldn't look out of place in the window of a French patisserie. Plus, I think they'd fit in with her quirky sensibilities perfectly!\nValentino\nThe least cake-y, but most comfortable-looking of the bunch (thus far). Besides, the color scheme and shape reminds me of other gowns she's has worn in the past.\nErdem\nLooks like a comfy lemon meringue pie to me — and there's something very Lena about the combined forces a fashionable deep-v and bared arms (all the better for tattoos!).\nGiambattista Valli\n*gasps*\n\"LOOKS LIKE CAKE AND FEELS LIKE SWEATPANTS\"\n\"LOOKS LIKE CAKE AND FEELS LIKE SWEATPANTS\"\n\"LOOKS LIKE CAKE AND FEELS LIKE SWEATPANTS\"\nI'll just leave that there.\nImages: Getty Images; Style.com (3); dior, giambattistapr/Instagram","url":"https://www.bustle.com/articles/35815-what-dress-will-lena-dunham-wear-to-the-emmys-a-few-cake-inspired-gowns-she-should-consider"}
