{"authors":[],"date_download":"2018-10-23 01:38:51","date_modify":"2018-10-23 01:38:51","date_publish":"2017-03-10 10:03:09","description":"Friday's final verdict by South Korea's Constitutional Court to sack impeached president Park Geun-Hye has finally put an end to a months-long political...","filename":"data/vaneerConsumption/WhatnextafterSKoreaspresidentialimpeachment.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/10/wire-195207-1489140193-642_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300652_What-S-Koreas-presidential-impeachment_1540258731.html","title":"What next after S. Korea's presidential impeachment?","title_page":"What next after S. Korea's presidential impeachment? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Impeached South Korean President Park geun-Hye was sacked by the country's Constitutional Court on March 10, 2017\nFriday's final verdict by South Korea's Constitutional Court to sack impeached president Park Geun-Hye has finally put an end to a months-long political crisis that rocked the nation.\nMillions have taken to the streets to demand her ouster over a corruption and influence-peddling scandal involving her secret confidante Choi Soon-Sil.\nChoi is on trial for coercion and abuse of power for using her presidential ties to force local firms including Samsung, the world's biggest smartphone maker, to \"donate\" nearly $70 million to two foundations she controls.\nNow that the public call has been fulfilled, here are some key developments that may await South Koreans -- and Park -- in the coming months.\n- What happens to Park? -\nThe constitutional court's verdict immediately strips her of all powers and privileges, including protection from criminal indictment.\nShe is obliged to move out of the presidential palace, where she has been holed up for months, but an aide said she would not do so Friday as her private residence needed to be prepared.\nPark has already been named a criminal suspect, accused of bribery for offering policy favours to the firms that benefited Choi.\nFor months she has refused to make herself available for questioning by prosecutors probing the scandal.\nSouth Korea corruption scandal\nBut that may no longer be an option once she leaves the Blue House, when she could face formal arrest if she refuses a summons.\nSeveral former South Korean presidents have been embroiled in corruption scandals, with two former military-backed presidents -- Chun Doo-Hwan and Roh Tae-Woo -- serving jail terms for bribery in the 1990s.\nDemocratically elected Roh Moo-Hyun committed suicide in 2009 during a corruption probe into him and his family.\n- What happens to South Korea? -\nA presidential election is to be held within 60 days, with local media reports suggesting May 9 as the most likely date.\nBoth the court and acting President Hwang Kyo-Ahn appealed for the country to come together and move forward.\nBut the divisions fostered by the scandal will continue -- while Park's removal had overwhelming public support, she remains popular with an older, conservative constituency with fond memories of rapid growth under the 1961-79 rule of her father, her late army dictator, Park Chung-Hee.\n- Who is in charge? -\nPark's prime minister Hwang Kyo-Ahn has been serving as acting president since her powers were suspended by the parliamentary impeachment motion in December.\nBut he would have to step aside if he decides to stand in the presidential election race himself.\nPeople watch a live broadcast showing South Korea's Acting President and Prime Minister Hwang Kyo-Ahn delivering a public address in Seoul on March 10, 2017\nThe current front-runner -- by a distance -- is the liberal former Democratic Party leader Moon Jae-In, on 36 percent.\nBut Hwang is in second place on 14 percent and conservative parties have few other standard-bearers to turn to after former UN Secretary-General Ban Ki-moon ruled himself out.\nWith only caretaker powers, Hwang has done little in office to distinguish himself, but if he chooses to run, finance minister Yoo Il-Ho is next in line to take over.\n- What challenges lie ahead? -\nPark's rule has seen growing popular anti-establishment sentiment -- as elsewhere in the world -- with South Koreans increasingly frustrated over economic and social issues.\nThe scandal has laid bare the deep-rooted, corrupt ties between government and big businesses, and is likely to embolden calls for reform of the giant family-controlled firms -- known as \"chaebols\" -- that dominate Asia's fourth-largest economy.\nPark's successor will have their work cut out in the face of slowing economic growth, growing threats from the nuclear-armed North, and souring ties with China over a controversial US missile defence system.","url":"https://www.dailymail.co.uk/wires/afp/article-4300652/What-S-Koreas-presidential-impeachment.html"}
