{"authors":["Taylor Maple"],"date_download":"2018-10-31 01:46:09","date_modify":"2018-10-31 01:46:09","date_publish":"2018-08-27 19:20:23","description":"When you're watching Bachelor In Paradise, you can't get too comfortable. Just when you've solidified who your favorite contestant is, they could be sent home just as quickly as new arrivals will show up to take their place. Fan favorites like…","filename":"data/vaneerConsumption/WhatIsConnorsJobOnBachelorInParadiseTheFormerProfessionalBaseballPlayerIsAllAboutFitness.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/b968eb2b-258c-4b12-bfdb-87368667e13f-149577_1258.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_what-is-connors-job-on-bachelor-in-paradise-the-former-professional-baseball-player-is-all-about-fitness-10245492_1540950369.html","title":"What Is Connor's Job On 'Bachelor In Paradise'? The Former Professional Baseball Player Is All About Fitness","title_page":"What Is Connor's Job On 'Bachelor In Paradise'? The Former Professional Baseball Player Is All About Fitness","title_rss":"NULL","source_domain":"bustle.com","text":"When you're watching Bachelor In Paradise, you can't get too comfortable. Just when you've solidified who your favorite contestant is, they could be sent home just as quickly as new arrivals will show up to take their place. Fan favorites like Bibiana and Wills have been sent packing already this season, but Connor from Becca's season is about to step onto the scene for the very first time. And on a beach filled with models, programmers and Army veterans, the bar is set high when it comes to cast members' careers this season. So what is Connor's job on Bachelor in Paradise?\nAccording to his website, Connor is a model — because really, who in Bachelor Nation isn't? — and also is a professional fitness coach. The modeling career is pretty self-explanatory, but he's not just a pretty face on Instagram. His website boasts that he's done work for big names like Nike, Coors Light and Nordstrom. And the fitness coaching — which he does under the \"CJO Fitness\" name — is where you can actually hire Connor yourself. For a cool $350, he'll design a personalized workout routine and nutrition plan for you, and you can get a standalone target area regiment for $80 a pop.\nHis site also states that he's a certified personal trainer for small groups or one-on-one sessions with 12 years of experience, which means him and Krystal might have a lot to talk about. Apparently, he's pretty good at his job. The CJO Fitness Facebook page boasts a perfect 5 out of 5 star rating, based on reviews from 19 clients throughout 2017.\nAs it turns out, Connor adds to the ranks of former athletes who transitioned to become Bachelor Nation stars. According to the Tampa Bay Times, Connor played professional baseball for the Atlanta Braves organization, though he never reached the major leagues. That stint followed a baseball career for the University of Tampa, where he and his team won the Division II national championship in 2013, the same article reports, and where he earned a degree in public health.\nThough Connor will always be able to say he played professional baseball, it was ultimately a short-lived venture — his stats on the Minor League Baseball website divulges that Connor only stepped up to the plate for 64 at bats over 19 games. While any professional athleticism is impressive, and something that in the grand scheme of things, few people ever achieve, that's not exactly a long and storied career when you consider that a minor league baseball season typically runs more than 100 games.\nHe might not have made a lifelong career out on the baseball diamond, but Connor's remained in the spotlight with Becca's season of The Bachelorette. He was sent home before he became one of the last men standing, but he (and his glasses) still made an impression among fans. He is the one who threw Lincoln's photo into the pool, after all, in a moment of jealousy.\nThough that outburst was obviously inappropriate, Connor was otherwise pretty inoffensive throughout the season, even though he didn't snag Becca in the end. Which means he's likely poised to find love in Paradise. Or get a new job as the Bachelor next year, depending on how it all works out. Only time will tell.","url":"https://www.bustle.com/p/what-is-connors-job-on-bachelor-in-paradise-the-former-professional-baseball-player-is-all-about-fitness-10245492"}
