{"authors":[],"date_download":"2018-10-30 00:59:42","date_modify":"2018-10-30 00:59:42","date_publish":"2018-07-22 15:12:27","description":null,"filename":"data/vaneerConsumption/WhatHappenstotheFutureWhenItsSeveredFromthePast.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/1024px-Woman_of_Bolivarian_Armed_Forces_in_a_presidential_meeting.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861182.html","title":"What Happens to the Future When It’s Severed From the Past","title_page":"What Happens to the Future When It’s Severed From the PastThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"No one can say when exactly the modern age began, but it was clearly tied to the Reformation, Renaissance, and the Scientific Revolution which had their roots in 14thand 15thcentury Europe.\nThe reformation of church corruption and pursuit of spiritual truth promoted by Martin Luther had its analog with the pursuit of truth regarding the physical universe by contemporary Nicholas Copernicus, who is credited as a key founder of the scientific revolution. Copernicus’ empirical evidence and reasoning upset the prevailing geocentric view that the earth was the center of the universe with the heliocentric model that took its place — placing the sun at the center, with the earth and other planets orbiting it.\nThe Reformation and Renaissance set in motion a cultural awakening as well as an unusual concentration of human genius and extraordinary wisdom that culminated in the birth of a new nation, the United States — dedicated to the rule of law, separation of powers and limited government, and accountability to its citizens whose rights were God-given and thus unalienable and not subject to infringement by the state — a truly revolutionary model that subsequently influenced other nations worldwide well into the 20thcentury.\nCopernicus, followed by Kepler, Galileo, Bacon, Newton, and more were key figures in the scientific revolution that expanded the frontiers of understanding the physical universe. Collectively, they gave birth to the scientific method, which became the most reliable and powerful means of pushing the envelope of discovery and invention through hypothesis testing that involved compiling and rationally evaluating empirical evidence and results to arrive at facts.\nWhat is striking about the modern age compared with all previous ages is the speed at which progress was made. Coming on the heels of the Dark Ages, which encompassed nearly a millennium of relative stagnation and punctuated with the Bubonic Plague in the mid-14thcentury, the modern age made rapid progress applying science and harnessing innovation and discovery, reviving and pursuing cultural excellence, and addressing and solving people’s common needs and problems.\nWhen one considers the appearance of the United States from a grand historical perspective — notably its rise from colonial poverty to the world’s economic superpower in 200 years — it’s a bit like a production car today going from zero to 60 in 2 seconds.\nAnd while peoples’ standard of living has been greatly improved and their longevity significantly increased, many Americans now seem oblivious to how we got here. The incredible benefits attributable to the application of both the scientific method and the spiritual truths of Judeo-Christian heritage are increasingly taken for granted at best. At worst they are viewed as unnecessary, even obsolete.\nWe are told that our culture and the way we live is now post-Christian and that the need for redemption by God has been replaced by the imperatives of a secular redemption defined by political correctness. That new framework is largely based on the one-two approach of promoting guilt among largely successful white males for their alleged biases and misdeeds, past and present, and then providing them a solution in the form of relief and good feelings through making amends and accommodation to new groups and minorities.\nIn short the path of the new P.C. redemption has nothing to do with character improvement and everything to do with identity politics — races, classes, gender and sexual identity — and also the relationship that man has with the environment. And there is simply no end to atonement, role reversals, and reparations to fix things. As a result, we have come to a point where seemingly endless manufactured injustices are crowding out the joy of everyday life, stripping people of their spontaneity and their humor.\nThe tenets and framework of political correctness have largely negated the relevance of age-old moral truths, common sense, and the scientific method — all of which contribute to protecting relationships, solving problems, and facilitating progress. As a result, we are experiencing increasing regressive forces that are effecting economics, law, politics, and basic civility.\nConsider economics. It seemed that the debate between capitalism and socialism ended nearly three decades ago with the Iron Curtain coming down due to the failure and dissolution of the Union of Soviet Socialist Republics. Francis Fukuyama proclaimed in the title of his best-selling book published in 1992 that we had arrived at “the end of history,” which was characterized by the “triumph of capitalism,” and the “unabashed victory of economic and political liberalism.”\nSocialism has not only failed to work anywhere — whether in the old Soviet Union, Eastern Europe, Southeast Asian and African nations, North Korea, Cuba, or Venezuela — but it has also almost always been accompanied by horrendous abuse of power and the unnatural death of many millions.\nSo how could it be that just a generation after Fukuyama and the wall coming down that here in the United States in the “land of the free” that socialist candidate Bernie Sanders could win 43% of the Democrat primary voters?\nThe answer is complicated. But it starts with recognizing that because the knowledge industry — that is the educational establishment, the universities, and the media — embraces political correctness, they largely ignore contradictory views from common sense and factual findings of the scientific method with its emphasis on accountability and verifiable factual evidence. In short, the Bernie phenomenon was in some part the result of the last thirty years of accumulated subliminal conditioning and brainwashing in America by a politically correct educational and media establishment.\nThis is also the primary reason that 90+% of the media elite obsess on the flaws of President Trump but give him no coverage or credit for his success — the remarkable turnaround in the economy and foreign policy, the creation of more job openings than there are reported unemployed people, record low minority unemployment rate, greatly diminished welfare rolls and a decline in reliance on food stamps, a domestic energy boom, record high levels of the stock market and consumer confidence, the financial reform of the UN and NATO, the defeat of ISIS and much more.\nWhen facts and accountability no longer matter, media coverage regresses to propaganda and fake news, and politics devolves to preoccupation with power over ideas. When facts and accountability no longer matter, it seems that many political candidates and office holders feel they no longer need fight for solution-oriented ideas and policies. After all, in a democracy that has short election cycles why do the hard work of debate and compromise, when you think you can win or hold on to power through demagoguery, emotional appeals, and even inciting hatred and mobs to silence your opponents?\nWhen law is severed from its origin in Judeo-Christian teachings and the factual basis of the scientific method, the door is opened to legal relativity with all manner of new arrangements and new rights — from labor relations, patent and property rights, marriage and obligations to both the elderly and the unborn, to transgender confusion over bathroom access, and subordinating human rights to the rights of snail-darters.\nIf the logic of political correctness is taken to extremes as it is in the current trajectory of the Democrat Party and then superimposed on law, there would be no need for ICE or law enforcement because there is no legitimacy to the United States, its Constitution, laws or its borders.\nIn sum, when history and facts don’t matter — when the present gets severed from the past, when common sense gets jettisoned and displaced by P.C. nostrums, and when culture gets increasingly unmoored from its Judeo-Christian heritage of manners, moral standards and chivalrous inclinations — the barbarians, the hate mongers, and mobs emerge inside the gates. And sadly, the first victims are often the poorest and most vulnerable who are both dependent on and used by a warped political system and who find little respite or escape from the decay of pervasive mass culture.\nScott Powell is senior fellow at Discovery Institute in Seattle and managing partner of RemingtonRand LLC. Email him at scottp@discovery.org.","url":"https://spectator.org/what-happens-to-the-future-when-its-severed-from-the-past/"}
