{"authors":[],"date_download":"2018-10-22 21:35:34","date_modify":"2018-10-22 21:35:34","date_publish":"2014-06-05 14:44:25","description":"Boosting the adoption of messaging service WhatsApp in the United States and some other markets is proving difficult.","filename":"data/vaneerConsumption/WhatsAppCofounderSeesChallengesinUSandOtherMarkets.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_08/199776/140220-whatsapp-1653_d27099f7f032442d8ee313ab6b1e6f7a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gadgets_whatsapp-co-founder-sees-challenges-u-s-other-markets-n123516_1540244134.html","title":"WhatsApp Co-founder Sees Challenges in U.S. and Other Markets","title_page":"WhatsApp Co-founder Sees Challenges in U.S. and Other Markets ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPALO ALTO Ca. (Reuters) - Boosting the adoption of messaging service WhatsApp in the United States and some other markets is proving difficult, co-founder Brian Acton said, but the company will still create substantial revenue for prospective parent Facebook.\n“Growth in the United States is a challenge for us,” Acton said on Wednesday after a talk at StartX, an incubator for young companies affiliated with Stanford University.\nHe also cited Japan and Taiwan as countries where “we could have been more successful with a little bit more effort.”\nBut Acton otherwise struck an upbeat tone in his first public comments since Facebook said earlier this year it would acquire fast-growing WhatsApp for $19 billion in cash and stock.\nActon noted what he saw as WhatsApp’s value, saying he believed it would send 1 billion new users to the social network, even as WhatsApp services remain apart from Facebook’s.\nHe described the relationship between the two companies as “separate but equal,” saying co-mingling the services would create “risk and peril.”\n“We don’t look at it from the experience of, ‘We’re going to get swallowed by the Borg,’” he said, referring to a group in the show “Star Trek” who assimilate other species.\nDownplaying concerns that Facebook could learn data about WhatsApp users, Acton said WhatsApp had little valuable information to share.\n“We don’t have much beyond a phone number to work with,” he said, adding the company's staff didn't trawl through user messages. Talking to reporters later, he said all messages were anyway encrypted.\n-- Sarah McBride, Reuters","url":"https://www.nbcnews.com/tech/gadgets/whatsapp-co-founder-sees-challenges-u-s-other-markets-n123516"}
