{"authors":["Katy Parker-Shorthouse"],"date_download":"2018-10-31 01:45:06","date_modify":"2018-10-31 01:45:06","date_publish":"2018-09-14 14:59:51","description":"Looking for your next marathon-worthy TV show? Sky One is coming to the rescue with its a brand new witchy drama that you're going to want in your life. But while viewers will no doubt be gripped by the TV adaptation of the fantasy story, what we…","filename":"data/vaneerConsumption/WhatHappensInADiscoveryOfWitchesTheBookYoureGoingToWantToReadThisGrippingSeries.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/7e916941-0dff-4c01-ac0f-27a13434a6b6-landscape-1511356631-a-discovery-of-witches-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_what-happens-in-a-discovery-of-witches-the-book-youre-going-to-want-to-read-this-gripping-series-11917782_1540950306.html","title":"What Happens In 'A Discovery Of Witches' The Book? You're Going To Want To Read This Gripping Series","title_page":"What Happens In 'A Discovery Of Witches' The Book? You're Going To Want To Read This Gripping Series","title_rss":"NULL","source_domain":"bustle.com","text":"Looking for your next marathon-worthy TV show? Sky One is coming to the rescue with its a brand new witchy drama that you're going to want in your life. But while viewers will no doubt be gripped by the TV adaptation of the fantasy story, what we really want to know is what happens in A Discovery of Witches the book?\nThe final series of Game of Thrones is still many months away and Season 3 of Stranger Things won't come on Netflix until early 2019, so there's definitely a gap in the schedules for a larger-than-life fantasy drama. Step forward A Discovery of Witches, which was filmed in Wales and stars The Crown star Matthew Goode alongside Australian actor Teresa Palmer.\nThe adaptation will be based on the book of the same name — the first of the All Souls trilogy by American author Deborah Harkness. The historical-fantasy novel became a New York Times Best Seller upon its release in 2011, with reviewers comparing it to the likes of Harry Potter and Twilight. If that's not some good company to be in, I don't know what is. It follows the story of Diana Bishop, a history of science professor at Yale, who is spending time at Oxford University doing research. She is a witch but a reluctant one, having given up witchcraft and choosing to cut herself off from the rest of the witching community, as you do.\nJoBlo TV Show Trailers on YouTube\nBut her research leads her to the discovery of a mysterious long-lost manuscript in Oxford's famed Bodleian Library. This discovery has a seismic affect not only on Diana but on the rest of the magical world, and she soon realises that in order to protect herself and defend the safety of her fellow magical creatures, she must once again embrace her supernatural blood and delve back into the magical world.\nRomance appears in the form of seductive vampire Matthew Clairmont (played in the TV show by Goode), and an illicit romance ensues. It's all very Twilight meets True Blood — and it's seriously unputdownable stuff.\nSlaven Vlasic/Getty Images Entertainment/Getty Images\nThe next two books in the series follow Bishop as she descends further and further into the magical world, and are titled Shadow of Night and The Book of Life. Of course the question all Harkness' fans will be asking is, how true will the TV show stay to the book? Well it seems they have little to worry about, as Radio Times reports that the eight-part drama will cut very little from the author's original plot. In fact, the magazine's website suggests that some plotlines will be extended and explored more thoroughly than they were in the book, for example we will hear more from Gillian, the American witch who visits the university and tries to encourage Diana to join the Oxford witches coven.\nIt's the perfect dose of spookiness telly fans need to sustain them in the run up to Halloween, and with a primetime BBC Friday night slot, I think there will be a fair few people tuning in.","url":"https://www.bustle.com/p/what-happens-in-a-discovery-of-witches-the-book-youre-going-to-want-to-read-this-gripping-series-11917782"}
