{"authors":["Sarah Friedmann"],"date_download":"2018-10-31 00:01:41","date_modify":"2018-10-31 00:01:41","date_publish":"2018-10-28 15:00:29","description":"You can certainly learn a lot by going through someone's social media account — and that goes for members of the first family too. If you compare what Ivanka and Donald Trump Jr.'s tweets say, it's quite apparent that the two siblings lead very…","filename":"data/vaneerConsumption/WhatIvankaDonaldTrumpJrsTweetsSayAboutTheirVeryDifferentLifestyles.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/17/814ca863-dbb5-4984-87ee-1f96a54b68e8-getty-578134294.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_what-ivanka-donald-trump-jrs-tweets-say-about-their-very-different-lifestyles-11933860_1540944101.html","title":"What Ivanka & Donald Trump Jr.’s Tweets Say About Their Very Different Lifestyles","title_page":"What Ivanka & Donald Trump Jr.’s Tweets Say About Their Very Different Lifestyles","title_rss":"NULL","source_domain":"bustle.com","text":"You can certainly learn a lot by going through someone's social media account — and that goes for members of the first family too. If you compare what Ivanka and Donald Trump Jr.'s tweets say, it's quite apparent that the two siblings lead very different lifestyles. In fact, they seem to have different approaches to social media altogether.\nAs an advisor to the president, Ivanka is a part of the Trump administration — and her tweets reflect this role. The first daughter frequently uses Twitter to promote the initiatives in her own portfolio, like various meetings she's held on women's economic empowerment or events she's hosted as part of the White House National Council for the American Worker. However, the first daughter seems to shy away from commenting more broadly on her father's administration, instead mostly sticking to promoting her own White House initiatives — and rarely responding to critics.\nIn addition to professional content, Ivanka's Twitter account also occasionally contains some family photos shared via Instagram, like a recent picture of herself, her husband, and her son at an apple orchard to celebrate Rosh Hashanah. Notably, Ivanka seems to tweet regularly, but not heavily. It appears she has been tweeting around one to two times per day lately.\nIn contrast, Don Jr.'s Twitter account seems more active — and more controversial. Don Jr. is not a member of his father's administration and, as a result, is perhaps less guarded in his tweets. Don Jr. frequently uses Twitter to comment on articles with which he disagrees and promote those he finds appealing — often using strong language in both cases. Moreover, Don Jr. also directly pushes back against those who criticize him or his father — and regularly criticizes Democrats.\nFor example, on Sept. 7, Don Jr. condemned Democratic Senator Cory Booker after the senator shared a committee confidential document during the Supreme Court confirmation hearings for Brett Kavanaugh. The president's son accused Booker of playing political games.\nMore recently, on Oct. 5, Don. Jr. also tweeted about Kavanaugh's confirmation hearings, this time to suggest that Democrats will try to impeach the justice if they secure control of Congress following November's midterm elections. As Don Jr. noted:\nTrump supporters - The fight isn’t over. You better believe that Democrats are going to do everything in their power to impeach Kavanaugh from the Supreme Court if they take control of Congress in November. This is war. Time to fight. Vote on Nov 6 to protect the Supreme Court!\nNotably, while Don. Jr. frequently uses social media to espouse his political views, he has also condemned social media sites for what he believes is liberal bias. Indeed, back in August, Don Jr. issued a statement via Axios calling for conservative developers to create a \"conservative, Facebook-like social network\" to allow Trump supporters a space in which to communicate online — and avoid the liberal \"tech bias\" he alleges exists.\nOverall, it looks like Don. Jr and Ivanka have very different relationships with Twitter and, in a general sense, social media. Don Jr. heavily uses the network for political purposes, despite decrying its alleged bias. Meanwhile, Ivanka sticks to using it for limited personal and professional tweets, but not much more.","url":"https://www.bustle.com/p/what-ivanka-donald-trump-jrs-tweets-say-about-their-very-different-lifestyles-11933860"}
