{"authors":["Dennis Green"],"date_download":"2018-10-30 23:53:11","date_modify":"2018-10-30 23:53:11","date_publish":"2016-12-05 00:00:00","description":"Leather and water don't mix.","filename":"data/vaneerConsumption/Whatshoestowearwhileitsraining.json","image_url":"https://amp.businessinsider.com/images/551308e96da811182a54c535-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_what-shoes-to-wear-while-its-raining-2016-12_1540943591.html","title":"What shoes to wear while it's raining","title_page":"    What shoes to wear while it's raining - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"This man could certainly use galoshes. Reuters/Brendan McDermid Leather and water don't mix.\nShoes are obviously made to be worn, but that doesn't mean you shouldn't take a few precautions to safeguard your investment.\nWhile leather-soled shoes won't exactly fall apart in the rain, you should still be careful when wet weather hits. Leather deteriorates faster when wet, and when that wet leather hits pavement, bad things happen.\nHere's more on why leather and water are mortal enemies, as pointed out by style blog PutThisOn:\nLeather soaks up water like a sponge. Just like your skin, leather needs a certain amount of moisture to stay strong and supple. But this amount of water can damage the leather and make it break down prematurely.\nJust like your skin, leather needs a certain amount of moisture to stay strong and supple. But this amount of water can damage the leather and make it break down prematurely. After your soles get wet, your socks will instantly get soaked. It goes without saying that wet socks are always unpleasant.\nIt goes without saying that wet socks are always unpleasant. When leather is wet, it's much more easily damaged. You wouldn't want a chunk or two taken out of your expensive leather shoes just because they got wet.","url":"https://www.businessinsider.com/what-shoes-to-wear-while-its-raining-2016-12"}
