{"authors":["Kenneth Dickerman","Photo Editor","Lucy Nicholson"],"date_download":"2018-10-21 02:56:38","date_modify":"2018-10-21 02:56:38","date_publish":"2018-06-27 10:00:15","description":"Reuters photographer Lucy Nicholson explores California's aging prison population.","filename":"data/vaneerConsumption/WhatlifeislikefortheUSsincreasinglyagingprisonpopulation.json","image_url":"https://www.washingtonpost.com/resizer/28G5prGNHETzth2Hi-U1gvhP1Jo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UHOIX3WWJM4APEQOOBLZQMAIJM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_06_27__1540090598.html","title":"What life is like for the U.S.’s increasingly aging prison population","title_page":"What life is like for the U.S.’s increasingly aging prison population - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"An inmate sits in the yard of a cellblock that mainly houses prisoners with cognitive decline, Alzheimer’s and dementia at the California Health Care Facility in Stockton. (Lucy Nicholson/Reuters)\nInmate Michael Patrick Rodriguez, 62, who has skin cancer, watches a meditation video in the hospice at the California Medical Facility prison in Vacaville. (Lucy Nicholson/Reuters)\nImprovements in medical care, longer jail terms because of stricter sentencing guidelines and an increase in the number of older adults being sent to prison have had a significant effect on the U.S. prison population: The average age of inmates is rising.\nAccording to a report by Reuters, “In California, seven percent of the state’s 130,000 prisoners were over the age of 60 in 2016, the most recent year for which data is available, compared to just 1 percent 20 years earlier, according to a report by the California Department of Corrections and Rehabilitation.”\nBecause of this, states are finding ways to care for their older inmates. In California, for example, authorities are creating a dementia unit at the main prison medical facility in Stockton.\n“We have identified a specific need for a specialized unit for our dementia population and are in the very early phases of concept development,” Elizabeth Gransee, spokesperson for California Correctional Health Care Services, told Reuters.\nJoseph Bick, chief medical executive at the California Medical Facility in Vacaville, told the news service, “We and all of the jails and prisons around the country need to be able to do a better job with individuals who have cognitive impairment.”\nPrisons across the country are facing similar challenges, and the economic toll is costly. Reuters reports that medical care for inmates has reached $3 billion annually. Reuters photographer Lucy Nicholson visited a couple of California prisons recently to try to document how that state is dealing with the challenges presented by an aging prison population. Here’s what she saw.\nPastoral care services worker and inmate Kao Saephanh, left, helps inmate Joseph Morrow, 69, who has bladder cancer, take a shower in the hospice center at the California Medical Facility prison in Vacaville. (Lucy Nicholson/Reuters)\nGold Coat inmate workers who help other prisoners with health problems. Eleazar Ibarrola, 43, left, and Scottie Glenn, 47, chat at the California Health Care Facility in Stockton. (Lucy Nicholson/Reuters)\nInmate Richard Arriola, 88, undergoes medical tests at the California Health Care Facility in Stockton. (Lucy Nicholson/Reuters)\nPastoral care services worker and inmate Kao Saephanh gives a haircut to Eddie Van Houton, 71, who has cancer, in the hospice at the California Medical Facility prison in Vacaville. (Lucy Nicholson/Reuters)\nInmate Quentin Murphy, 50, shoots hoops at the California Medical Facility prison in Vacaville. (Lucy Nicholson/Reuters)\nInmate Eddie Galloway, 80, who has cancer, talks to a pastoral care services worker at the California Medical Facility prison in Vacaville. (Lucy Nicholson/Reuters)\nAn inmate undergoes physical therapy at the California Health Care Facility in Stockton.\nInmate Derrick Brooks, 65, who has cancer, shaves in the hospice at the California Medical Facility prison in Vacaville. (Lucy Nicholson/Reuters)\nInmate Joseph Morrow, shown in the hospice at the California Medical Facility prison in Vacaville, has bladder cancer. (Lucy Nicholson/Reuters)\nPastoral care services worker and inmate Kao Saephanh helps inmate Eddie Van Houton stand up after giving him a haircut in the hospice at the California Medical Facility prison in Vacaville. (Lucy Nicholson/Reuters)\nLouis Henson, 74, has his dentures fixed at the California Health Care Facility in Stockton. (Lucy Nicholson/Reuters)\nVan Houton sleeps in the hospice at the California Medical Facility prison in Vacaville. (Lucy Nicholson/Reuters)\nThe California Medical Facility prison in Vacaville. (Lucy Nicholson/Reuters)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nWhat life is like in the coal-mining boomtowns of Appalachia\nHaunting landscapes taken from thousands of hacked surveillance cameras\nInside the U.S.’s ‘National Radio Quiet Zone’ where there’s no WiFi or cellphone service","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/06/27/what-its-like-inside-the-u-s-s-increasingly-aging-prison-population/"}
