{"authors":[],"date_download":"2018-10-23 00:57:40","date_modify":"2018-10-23 00:57:40","date_publish":"2015-05-06 00:00:00","description":"Teachers, students and administrators are stretched thin by serious overcrowding. The city could add 32 schools tomorrow and every one would be filled to capacity.","filename":"data/vaneerConsumption/WhatHappensInVegasIncludesCrowdedStrugglingSchools.json","image_url":"https://media.npr.org/assets/img/2015/04/29/img_1048-toned_wide-b9b4ff7181e591d8d982ffaa6fcdeed2bbf171d3.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=402886741_1540256260.html","title":"What Happens In Vegas Includes Crowded, Struggling Schools","title_page":"What Happens In Vegas Includes Crowded, Struggling Schools   : NPR Ed : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nLas Vegas has made the transition from economic disaster back to success. So now it's facing the problems of success.\nDAVID GREENE, HOST:\nFew areas were hit so hard in the Great Recession. Las Vegas real estate values crashed. Now home prices are climbing. The job market is improving. And as a result, the schools are even more overcrowded.\nINSKEEP: If Las Vegas built nearly three dozen new schools tomorrow, every one would be filled to capacity right away. Eric Westervelt of NPR's Ed Team has more.\nERIC WESTERVELT, BYLINE: The earth moving machines groan and spray dust just behind Robert Forbuss Elementary in the desert on the edge of southwest Las Vegas. Giant dump trucks are piling rubble and dirt as if they're constructing a dam for an imagined waterway. But this is not part of normal building. The developer wants these new homes to have better views of the Las Vegas casino strip.\nCHARLIE HAUNTZ: We're building these crazy houses. I mean, it's ridiculous.\nWESTERVELT: Seventy-year-old retired geologist Charlie Hauntz stands in the school's dusty playground. All the kids here call the recess volunteer Grandpa Charlie. Hauntz is disgusted by what he sees as Vegas's return to unbridled construction and worsening school crowding.\nHAUNTZ: They don't issue building permits. You build a school first and then issue a building permit, you know? I mean, you can't - you just can't keep packing these kids in. I mean, there aren't any other schools around here.\nWESTERVELT: This elementary school was built to serve 780 students. Today, it serves 1,230 and growing.\nUNIDENTIFIED TEACHER: All right. At your desks, you may - listen up. Five...\nWESTERVELT: The overcrowding is so bad in the Clark County School District that two dozen schools will soon have to run year-round. Forbuss Elementary already does. One of five sections is always on break to make room. Scores of other schools are on staggered schedules. And more than 21,000 students here are taking some online classes because of space strains. Nearly 700 kids take all of their classes online.\nUNIDENTIFIED TEACHER: Nice job. And we got our information from where?\nWESTERVELT: Here 16 trailer classrooms - the school prefers the gentle euphemism portables - are parked in the outdoor recess area, eating away at playground space. There's also a portable bathroom and portable lunchroom. It's warmer in the big school, a 7-year-old tells me. These get cold in winter.\nRUBY CRABTREE: We do what we need to do, and we jump in and do it. We don't have enough people.\nWESTERVELT: Ruby Crabtree's title is school support staff, but that doesn't nearly capture all that she does. At one of the school's four crammed lunch periods, she's a janitor.\nCRABTREE: Our school is so overcrowded that, you know, we - everybody's got to pitch in.\nWESTERVELT: Later in the day, we find Crabtree sitting in a hallway, teaching a 7-year-old to read.\nCRABTREE: L - you got to do the L first. (Sounding it out) long.\nUNIDENTIFIED STUDENT: (Sounding it out) Long - long.\nCRABTREE: Good job.\nWESTERVELT: Frustrated parents ask when the crowding will end and if the portables are now permanent. This school recently slipped academically and lost a star rating, which troubles Principal Shawn Paquette. You have to make do, he says. You get creative.\nSHAWN PAQUETTE: The crowding issue absolutely plays into the instructional program. Would I like to have fewer students in a building and be able to run scheduling on a nine-month schedule? Yes. But I think that - you know, I think we're doing the job we need to do.\nWESTERVELT: The Nevada Legislature recently offered some relief by agreeing to a bond rollover measure that will help raise $4 billion over the next decade for schools. The school district's chief financial officer Jim McIntosh is thankful for that, but he says it's not nearly adequate.\nJIM MCINTOSH: No, it's not enough. While $4 billion sounds like a lot, we estimate we probably have closer to $7 billion worth of need right now. We could build 32 elementary schools today, and they would be to capacity.\nWESTERVELT: And that's just to catch up to today's overcrowding. Las Vegas conservatively predicts at least 1 percent growth over the next two years. That's another 3,000 to 4,000 students, and the need for at least two more elementary schools every year. Eric Westervelt, NPR News, Las Vegas.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=402886741"}
ong overdue. Las Vegas has been one of America's fastest growing cities for nearly 20 years. Teachers, administrators and the school district are thankful for the the legislative help. But many here say it's not nearly enough. The handful of new schools won't be finished for at least two years.\n\"No, it's not enough. While 4 billion sounds like a lot, we estimate we probably have closer to 7 billion worth of need right now,\" says the school district's chief financial officer, Jim McIntosh. \"We could build 32 elementary schools today and they would be to capacity.\"\nAnd that's just to catch up to today's overcrowding. The district predicts, conservatively, at least 1 percent enrollment growth over the next two years. That's another 3,000 to 4,000 students. That means at least two more elementary schools every year.","url":"https://www.npr.org/sections/ed/2015/05/06/402886741/what-happens-in-vegas-includes-crowded-struggling-schools"}
