{"authors":["Dan Morain"],"date_download":"2018-10-30 22:59:13","date_modify":"2018-10-30 22:59:13","date_publish":"2017-03-13 00:00:00","description":"California voters will decide an $8.9 billion water bond to fund environmental restoration, clean drinking water and help rebuild a major irrigation canal.","filename":"data/vaneerConsumption/What89billionwaterbondwouldbuy.json","image_url":"https://calmatters.org/wp-content/uploads/Screen-Shot-2017-03-13-at-1.58.32-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_newsletters__1540940353.html","title":"What $8.9 billion water bond would buy","title_page":"What $8.9 billion water bond would buy | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"What $8.9 billion water bond would buy\nGood morning, California.\nU.S. Sen. Dianne Feinstein swept every county in the June 5 primary. Fellow Democrat, Sen. Kevin de León, received a mere 12 percent of the vote. But over the weekend, de León won the California Democratic Party’s executive council endorsement. Only 7 percent of the party leaders voted to endorse Feinstein. It’s further evidence of the progressive-moderate divide among Democrats. — CALmatters.\nA vote on big water and environmental projects\nFriant-Kern Canal, (By Ted Holzem, Mintier & Associates.)\nA 152-mile long canal that irrigates pistachios and other crops in the eastern San Joaquin Valley is sinking by an inch a month, the result of groundwater over-pumping by farmers.\nThe Sacramento Bee described the Friant-Kern Canal as an engineering marvel, but its capacity has been reduced by as much as 60 percent at because of subsidence.\nThe Bee: “Now it’s reaching a crisis point on the Friant-Kern, and California voters are being asked to fix it”\nProposition 3, an $8.9 billion bond on the November ballot, would set aside $750 million to repair the canal, and additional sums to avert subsidence. Gerald Meral, a former water policy advisor to Gov. Jerry Brown, wrote the initiative.\nBusiness groups and farmers, many of them seeking canal improvements, donated $1.75 million of the $2.75 million Meral raised for the initiative so far. Environmental groups attracted by the measure’s promise of billions for habitat restoration have given $1 million.\nSome specifics: LA River $150 million; Salton Sea and San Francisco Bay wetlands restoration $200 million each; clean drinking water and water quality $3 billion.\nMeral: “The state can’t continue to underinvest in water. We have people who don’t have adequate water supplies. It is a human rights problem.”\nOpposition: Sierra Club warns Proposition 3 could be used to “fund dam projects that are harmful to the environment.” So far, there’s no funding for an opposition campaign.\nP.S. Republican gubernatorial candidate John Cox supports Proposition 3, telling CALmatters in a statement that it offers “the opportunity to build dramatically more storage and provide clean water.” Democratic gubernatorial candidate Gavin Newsom has not taken a stand.\nA message from Lucas Public Affairs: Strategic – Connected – Effective Navigating the crossroads of policy, politics and communications.\nFor more information, visit Lucas Public Affairs\nCALmatters is a nonprofit, nonpartisan organization and depends on the support of individual members, foundations and sponsors to produce quality journalism.\nBond debt: There is no free money\nIf voters approve Proposition 3, the $8.9 billion water bond on the November ballot, taxpayers would pay $17.3 billion during the bond’s 40-year life, the Legislative Analyst’s office says.\nThat would work out to $433 million a year.\nGov. Jerry Brown, who has tried to limit bonds and pay down debt, reported in his final budget that the cost of debt service has increased but at a slower pace during his tenure.\nTotal bond payments are $7.3 billion in a budget of $201 billion. The state has $120 billion in bond debt broken out like this:\n$74.2 billion in voter-approved general obligation bonds, some of it dating to the 1970s and 1980s.\n$9.2 billion in legislature-approved bond debt.\n$37.1 billion in bond funds that are authorized but not spent.\nCA faces a recycling crisis. Will we waste it?\nTons of paper and plastic we dutifully place in recycling bins are piling up in warehouses or being dumped in landfills.\nThe issue: California had exported discarded paper and plastic to China. But China has its own garbage and stopped accepting our waste earlier this year because it was contaminated with material that couldn’t be recycled.\nNumbers: Californians generated 76.5 million tons of garbage in 2016. Only 44 percent was recycled. China accepted 55,000 tons of mixed plastic from California in the first quarter of 2017. In the first quarter of 2018, that number fell to 4,900 tons.\nCal Recycle director Scott Smithline: “We have to take responsibility for the material we’re producing.”\nA solution: Sen. Bob Wieckowski, a Fremont Democrat, is pushing legislation requiring that beverage containers sold in this state contain recycled material, perhaps 35 percent or more. He’s also advocating more in-state recycling plants, which would provide jobs.\nThat effort suffered a setback when Graphic Packaging International, which made packaging for Sierra Nevada Brewery from recycled paper, closed its Santa Clara plant last year, citing high costs of doing business in California.\nWhat’s ahead: Expect more bills to limit single-use products like one to discourage plastic straws, new regulations to limit non-recyclable packaging, and requirements that products contain recycle material.\nDemocratic Assembly candidate faces fraud charges\nThe Shasta County District Attorney has charged a long-shot Democratic assembly candidate with fraud and grand theft for falsely claiming she worked thousands of hours as an employee of In-Home Support Services, a state program to provides care so frail elderly people can remain in their homes, the Record-Searchlight reports.\nCaleen Sisk got 24 percent of the primary vote on June 5, sufficient to get into the November run-off against Assembly Republican Leader Brian Dahle.\nThe prosecutor says the state paid Sisk $38,300 for 4,441 hours she fraudulently claimed. For part of that time, she reportedly worked at High Desert State Prison in Susanville as a spiritual advisor to inmates.\nWalters: Millions of reasons to sweat the census\nCALmatters’ Dan Walters comments on California’s fight with the Trump administration over the census, noting the state’s congressional delegation could drop by a seat if there’s a significant undercount.\nMoney also is at stake. The California Community Foundation estimates that “every uncounted resident costs California $1,934 in annual federal funding.” No wonder that the new state budget includes $90 million to encourage Californians to stand up and be counted.\nPlease email or call me with tips, suggestions and insights, dmorain@calmatters.org, 916.201.6281. Thanks for reading, please tell a friend and sign up here.\nSee you tomorrow.","url":"https://calmatters.org/articles/newsletters/what-8-9-billion-water-bond-would-buy/"}
