{"authors":["Jennifer Brett"],"date_download":"2018-10-30 21:34:41","date_modify":"2018-10-30 21:34:41","date_publish":"2016-07-16 07:21:40","description":"“Fast 8” director F.","filename":"data/vaneerConsumption/WhatsfilminginAtlantathissummer.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_what-filming-atlanta-this-summer__1540935281.html","title":"What's filming in Atlanta this summer?","title_page":"What's filming in Atlanta this summer?","title_rss":"NULL","source_domain":"ajc.com","text":"“Fast 8” director F. Gary Gray is beyond excited about the team he’s working with this summer in Atlanta.\n“This is one of the most phenomenal casts ever assembled in film history,” he said in a short Instagram video he posted the other day. The clip, taken while the movie was filming downtown, featured Tyrese Gibson and Helen Mirren.\n“The queen has arrived,” Gibson quipped.\nThe \"Fast 8\" squad in downtown Atlanta. Image: F. Gary Gray\nGray also posted a clip taken inside the cavernous studio, which he dubbed the “toy shop.” Think of a store with actual cars, instead of toys, on the shelves and you get the idea.\n“It is one of the most incredible sets I’ve ever seen,” he said. “You feel like you’re in the future here in the toy shop, and I love it!”\nMeanwhile in the Marvel universe, “Spider-Man: Homecoming: star Tom Holland posted a clip giving fans a sense of what working here is all about.\n“This is what it’s like filming in Atlanta, he said in a clip that features him exiting his trailer on the Pinewood Studios lot and returning a moment later, soaking wet. “It’s raining cats and dogs!”\nHe also posted this fun Spidey selfie:\nMelissa McCarthy and husband Ben Falcone team up for “Life of the Party,” which they cowrote. He’ll direct and she stars in the movie, due out in May 2018. It’s among the projects on a list compiled by state film commission folks of projects working here, but we don’t know much about it yet.\n“Plot details are scarce, but the project has been compared to Rodney Dangerfield’s 1986 comedy ‘Back to School,’” Entertainment Weekly notes.\nActress Rose Byrne will portray journalist Rebecca Skloot in the HBO film adaptation of Skloot’s riveting and phenomenally popular nonfiction work “The Immortal Life of Henrietta Lacks.”\nSkloot announced the casting on her Twitter feed, where she previously announced Oprah Winfrey will portray Henrietta’s daughter Deborah Lacks.\nHenrietta Lacks died in 1951 yet her cells live on and it’s not hyperbolic to say they probably have impacted nearly every human being on the planet.\n“She was a poor black tobacco farmer whose cells—taken without her knowledge in 1951—became one of the most important tools in medicine, vital for developing the polio vaccine, cloning, gene mapping, in vitro fertilization, and more,” Skloot notes on her author site, rebeccaskloot.com.\n“Step Sisters” filmed at Forbes Arena on the Morehouse College campus the other day, and we got to watch some of the high-energy stepping scenes. We couldn’t take photos and won’t give away any spoilers, but can say the project directed by Charles Stone III promises lots of fancy footwork.\nDue out next year, it stars Naturi Naughton, Megalyn Echikunwoke, Gage Golightly, Alessandra Torresani, Matt McGorry and Eden Sher.","url":"https://www.ajc.com/blog/buzz/what-filming-atlanta-this-summer/CDdzNGWqpozsW7rsP2TGDO/"}
