{"authors":["Anya Kamenetz"],"date_download":"2018-10-23 01:00:41","date_modify":"2018-10-23 01:00:41","date_publish":"2016-04-19 00:00:00","description":"Some teachers worry the heated rhetoric is causing stress, especially among immigrant and minority students. Others are trying to channel the political interest into learning opportunities.","filename":"data/vaneerConsumption/WhatAreKidsLearningFromThisPresidentialElection.json","image_url":"https://media.npr.org/assets/img/2016/04/18/ap_947660929124_wide-331b24d73a5e8c3e790e313f9da5b3c0526404e4.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_ed_2016_04_19_474384524_what-are-kids-learning-from-this-presidential-election_1540256441.html","title":"What Are Kids Learning From This Presidential Election?","title_page":"What Are Kids Learning From This Presidential Election? : NPR Ed : NPR","title_rss":"NULL","source_domain":"npr.org","text":"What Are Kids Learning From This Presidential Election?\nEnlarge this image toggle caption Charlie Neibergall/AP Charlie Neibergall/AP\nThird-grader Victor Reza was watching CNN in the living room in Houston with his family when Donald Trump was announced as the winner of the Florida Republican primary. Victor teared up, his older sister, Maria, said in a telephone interview.\n\"I don't want him to win,\" he announced. \"If he wins, I'm never going to see any of you again.\" Victor, 10, is a U.S. citizen, but members of his immediate family are not. And, says 21-year-old Maria, \"I'm pretty sure he's heard hateful rhetoric from his classmates at school. His friends at school were saying, 'Ha-ha, your family's going to be deported now because Donald Trump is going to win.' \"\nThis has been an unusually long and hotly contested presidential campaign, in both parties. Trump and other candidates have used language that wouldn't be acceptable in most classrooms.\nThe tone of the debate, and specific statements about building a wall on the Mexican border, deporting millions of immigrants and how \"Islam hates us,\" have raised concerns about how all this is affecting students. Especially given that nearly a third of the children in U.S. public schools, like Victor Reza, have foreign-born parents.\nThe Southern Poverty Law Center, a liberal-leaning advocacy organization, asked 2,000 teachers to weigh in on this question recently, in a report titled The Trump Effect. It was not a scientific sample, but of those who filled out the survey, more than two-thirds reported that students — especially immigrants, first-generation students and Muslims — have expressed fears about what might happen to them or their families after the election.\nA Tennessee kindergarten teacher wrote:\n\"Kindergarten students look at their ELL peers and tell them that they 'will get [de]ported soon and never come back because there's going to be a big wall to keep kids with brown skin out.' Imagine the fear in my students' eyes when they look to me for the truth. One student asks every day, 'Is the wall here yet?' In over twenty years of working with young children, I have never witnessed anything like it.\"\nAt least one student actually had a chance to ask a presidential candidate directly about the tone of the campaign. The Scholastic News Kids Press Corps is a group of 35 students ages 10 to 14 who go out on the campaign trail, attend rallies and cover the election for Scholastic's blog.\nIn Spartanburg, S.C., 12-year-old Gracie Wood asked Trump:\n\"Presidential campaigns and candidates can be very vicious with each other. How do you explain to kids that [such behavior] is OK?\"\n\"It's not really OK, but it's something you have to live with. It's called life,\" Trump responded.\n\"The kids, when they see something's unfair, they take it to heart,\" says Suzanne McCabe, who oversees the program.\nAt one point last month, McCabe adds, \"I had a little girl of color signed up and credentialed to cover a Trump rally in Chicago.\" With racial animus and violence occurring at a series of Trump events, McCabe and the girl's parents decided not to send her.\nThat rally was called off after several fistfights broke out between Trump supporters and protesters. \"I watched thinking, 'Oh, my lord, one of my kids could have been in that.' It was upsetting for anyone,\" she says.\nTeachers are responding to the unique challenges of this campaign in different ways. Some are avoiding bringing up the election at all, with 40 percent of teachers in the SPLC survey saying they're hesitant to teach about it.\nOn the other hand, Charles Quigley, of the Center for Civic Education, says interest in his organization's programming has never been stronger. The group offers tools, resources and training to teachers to teach about the workings of American government.\n\"We have a nationwide academic teacher-training program going on in 46 states and D.C.,\" he says. \"They seem to have found it much easier to recruit teachers than normal. In some states they're oversubscribed, with waiting lists.\"\nMany teachers, it seems, are determined to use the heightened interest in this election as a learning opportunity.\n\"We just had a meeting with 100 teachers from all over the country who are actively engaged in what's going on,\" Quigley says. \"I think most that I talked to were aghast at the quality of the Republican debates. They think very strongly that people should be focusing on issues.\"\nQuigley says that teachers are turning to civic education to help students \"critically analyze the statements that are coming out — the truth factor and so forth.\"\nThat's one strategy Luciano D'Orazio is using. He teaches social studies to sixth-graders in the Bronx, and also coaches the debate team. His debaters have been fact-checking the candidates' claims on issues like the Second Amendment. \"It's really been pleasant to see them actually cutting apart each speech and conducting their own research,\" he says.\nD'Orazio's social studies students are also finding connections between the campaign and their curriculum, which focuses on world and ancient history.\n\"Trump has been the gift that keeps on giving in my class,\" he says. \"He's been compared to Pericles, Alexander the Great, Julius Caesar — any sort of game-changing ruler. When we look at Athenian democracy and some of the flaws, that democracy, if it's not led by people who are educated, can fall prey to demagogues, a lot of kids pipe up: 'Sound familiar?' \"","url":"https://www.npr.org/sections/ed/2016/04/19/474384524/what-are-kids-learning-from-this-presidential-election"}
