{"authors":[],"date_download":"2018-10-22 22:43:02","date_modify":"2018-10-22 22:43:02","date_publish":"2014-06-10 19:00:42","description":"A TV documentary tracks the hunt for a \"super-predator\" that gobbled up a 9-foot shark, but experts say there's more hype than horror to the tale.","filename":"data/vaneerConsumption/WhatCouldEataBigSharkABiggerSharkNotaSuperPredator.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_25/500096/shark_00463b5b1c743f7a5622ce4cccdc06d6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_weird-science_what-could-eat-big-shark-bigger-shark-not-super-predator-n127621_1540248182.html","title":"What Could Eat a Big Shark? A Bigger Shark, Not a 'Super Predator'","title_page":"What Could Eat a Big Shark? A Bigger Shark, Not a 'Super Predator'  ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe tale of a 9-foot-long shark that a filmmaker suspects was consumed by a monstrous \"super-predator\" is now consuming a share of the Internet's spotlight, 11 years after it happened.\nBut if you take a closer look at the case, you'll be shocked, shocked! to find that there's more hype than horror to the story. The 2003 case is the focus of a string of online stories this week mostly because the Smithsonian Channel is airing a documentary about it, titled \"Hunt for the Super Predator.\"\nSign up for top news delivered direct to your inbox.\nThe documentary delves into the battles for survival that take place in the Southern Ocean off the coast of Australia, involving sharks as well as orcas, squids and other denizens of the deep. But the focus of the story is the disappearance of a tagged shark named Alpha. Filmmaker Dave Riggs had been looking forward to tracking Alpha, but instead, the tracking tag washed up ashore four months later.\nRiggs reacted by going into Captain Ahab mode. \"The mission to uncover what took out our shark has overtaken my life,\" he says in the documentary. \"It's almost like a drug.\"\nData from the tag indicated that it was brought down into deeper waters, that the temperature of its environment rose to 79 degrees Fahrenheit (26 degrees Celsius), and that it spent several days meandering around the ocean at that temperature before the tag was apparently released back into the water.\nAnother day at the ocean\nTo Riggs, that meant Shark Alpha must have been gobbled up by a sea monster. To shark experts, however, it's just another day at the ocean.\n\"I don't know this story,\" R. Dean Grubbs, a shark researcher at the Florida State University Coastal and Marine Laboratory, told NBC News in an email, \"but it doesn't take some mysterious giant shark to eat a 9-foot white shark.\"\nGrubbs said he's had more than one 10- to 12-foot-long tagged shark eaten by other sharks.\n\"Two 10- to 12-foot sixgill sharks were eaten by what we believe, based on the vertical tracks, were larger tiger sharks,\" he wrote. \"And one 10-foot tiger shark was eaten by what we are pretty certain was a larger sixgill shark. I have also caught multiple sharks that would have been over 10 feet, but only the head remained.\"\nIn Shark Alpha's case, the tag might have been chomped off and consumed, leaving a wounded shark behind. But it's certainly quite possible that Alpha ended up being food for the fishes, as all sharks eventually are.\nScary sharks on TV\nAustralia's ABC TV network aired a different version of Riggs' documentary last November. At the time, the show sparked critical commentary from Carlos Duarte, director of the University of Western Australia's Oceans Institute. Duarte voiced similar concerns on Wednesday.\n\"The documentary was done by a passionate citizen,\" he told NBC News in an email, \"but in my opinion the scientific basis is weak, and indeed not an important element in the documentary.\"\nThat's something to keep in mind as we inch closer to Shark Week (and Sharknado Week).\n\"Honestly, the thrill of society and TV stations for evil marine monsters is not really contributing much to public understanding of the oceans, but they do still serve the role of scaring the public if this is the intent,\" Duarte wrote. \"Any car on the street is far deadlier than the most evil marine predator.\"\nWe've made inquiries with the filmmakers in Australia and will update this item with any comments we get.","url":"https://www.nbcnews.com/science/weird-science/what-could-eat-big-shark-bigger-shark-not-super-predator-n127621"}
