{"authors":["Amy Sciarretto"],"date_download":"2018-10-31 01:39:12","date_modify":"2018-10-31 01:39:12","date_publish":"2018-08-30 13:24:38","description":"Urban Outfitters offers an expertly edited selection of makeup and skincare products — cool and hip brands like Milk and Sand & Sky populate its physical and digital shelves. Urban Outfitters is now launching ohii, its very own in-house, minimalist…","filename":"data/vaneerConsumption/WhatsInUrbanOutfittersohiiMakeupSkinCareLineItsMakeupMinimalismAtItsBest.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/30/673e81ee-5c69-46f5-9a43-9c8f743d5452-screen-shot-2018-08-29-at-92333-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_whats-in-urban-outfitters-ohii-makeup-skin-care-line-its-makeup-minimalism-at-its-best-11195771_1540949952.html","title":"What's In Urban Outfitters' ohii Makeup & Skin Care Line? It's Makeup Minimalism At Its Best","title_page":"What's In Urban Outfitters' ohii Makeup & Skin Care Line? It's Makeup Minimalism At Its Best","title_rss":"NULL","source_domain":"bustle.com","text":"Urban Outfitters offers an expertly edited selection of makeup and skincare products — cool and hip brands like Milk and Sand & Sky populate its physical and digital shelves. Urban Outfitters is now launching ohii, its very own in-house, minimalist beauty line that will certainly remind makeupistas of Glossier. The pleasant, white packaging is simple to the point of being chicly stark while the formulas inside are both cruelty and paraben-free.\nOhii can pretty much say \"Hello\" to instant cult status because that's inevitably in the brand's future. Get ready to take some bathroom shelfies and to post selfies while using or after you have used the products.\nOhii, which is pronounced like \"Oh, hi!,\" will cruise into the retailer's locations and onto its e-commerce website on Monday, Sept. 10. The range includes lip gloss, mascara, hand cream, masks, cleansers, and palettes.\nSo, yeah, ohii is basically everything you want, need, and look for from a modern beauty brand. It ticks off all of the millennial boxes!\nThe brand is also super affordable, starting as low as $8 and going as high as $24.\nAs The Cut reports, the brand isn't offering a full coverage foundation. Instead, its stocking strobing kits and 3-D lip gloss because why not?! These products are all about accentuating that natural beauty.\nAs the preview on the Urban Outfitters website proudly states, \"Ohii fills in the blanks of every beauty routine with thoughtful products developed to work well with others. Readily accessible to all, both in stores and online, ohii seeks to enhance natural beauty, not hide it.\" Yes to all of the above!\nUrban Outfitters Television on YouTube\nOhii offers feel-good beauty for everyone!\nThat gilded gloss is something else. Love. Want. Need.\nThat packaging, though. Don't you love those chubby caps?\nThat millennial pink cream swatch looks oh-so-luscious and worthy of being slathered all over your skin.\nYeah, this is starting to get dangerous. Based on packaging alone, you could blow your entire paycheck on ohii.\nIn 2018, beauty products that perform double or triple duty are essential. They eliminate packaging waste, save the user money and precious space in their makeup bag, and encourage creative usage and application. What would you do with these three-pan discs?\nSeriously, these tubes and the hues are too cute.\nJudging from the visuals and the initial marketing, ohii is aiming for inclusivity and doesn't view makeup as something to hide behind. Ohii also gives off that grab 'n' go vibe. In today's fast-paced, digitally-driven age, makeup products need to keep up with our schedules and busy lives. Products that satisfy multiple tasks and make us look our best are essential.\nIndeed, ohii's closest relative is Glossier, which has built an army of faithful loyalists thanks to simple, effective products in aesthetically pleasing packaging. Ohii, with its ethos, attractive pricing, and wide availability, might very well be your new favorite millennial and minimalist makeup brand.\nGo ahead and program a reminder in your smart phone of choice NOW so you don't forget to shop the line when it drops. You will be emphatically saying, \"Oh, hi\" to \"ohii\" in just under two weeks!","url":"https://www.bustle.com/p/whats-in-urban-outfitters-ohii-makeup-skin-care-line-its-makeup-minimalism-at-its-best-11195771"}
