{"authors":["Emily Dixon"],"date_download":"2018-10-31 01:39:10","date_modify":"2018-10-31 01:39:10","date_publish":"2018-08-30 13:28:00","description":"The X Factor 2018 launches this Saturday, and almost everything's neatly set up for the iconic talent show's return. The judging panel has been finalised: Robbie Williams, Ayda Field, Louis Tomlinson, and Simon Cowell (of course). Dermot O'Leary's…","filename":"data/vaneerConsumption/WhatIsTheXFactor2018PrizeThisYearsContestantsCouldBeCompetingForMoreThanARecordingContract.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/30/712114f5-892f-4c5a-bba7-b55d1527f027-getty-698561106.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_what-is-the-x-factor-2018-prize-this-years-contestants-could-be-competing-for-more-than-a-recording-contract-11451209_1540949950.html","title":"What Is The 'X Factor' 2018 Prize? This Year's Contestants Could Be Competing For More Than A Recording Contract","title_page":"What Is The 'X Factor' 2018 Prize? This Year's Contestants Could Be Competing For More Than A Recording Contract","title_rss":"NULL","source_domain":"bustle.com","text":"The X Factor 2018 launches this Saturday, and almost everything's neatly set up for the iconic talent show's return. The judging panel has been finalised: Robbie Williams, Ayda Field, Louis Tomlinson, and Simon Cowell (of course). Dermot O'Leary's back to present. And there's even word of a brand new twist, in the form of a Britain's Got Talent style golden buzzer. But there's one question most likely playing on every contestant's mind: what is the X Factor 2018 prize?\nWell, there hasn't been an official announcement confirming exactly what this year's winners will take home (and a spokesperson for the X Factor hasn't yet responded to my request for comment). But the prize has remained pretty consistent over the last few series, so let's take a look at what last year's winners, Rak-Su, secured when they were crowned X Factor champions.\nThe grand prize is a record contract with Syco Records, according to The Sun; that's the record label founded by Simon Cowell and owned by Sony. But the cash value, originally set at £1 million when the show debuted, has since decreased. The paper reports that \"since 2011 it has been thought that the act only gets an initial advance of £150,000 for their first album. If they manage to really impress the label, then the advance rises to £237,500 for a second album, £315,000 for a third, and £400,000 for a fourth.\"\nLast year, hopefuls weren't just angling for the grand X Factor title; they also competed for a weekly reward in the newly introduced Prize Fight, as Radio Times recapped. The act with the lowest votes was immediately eliminated — no sing-off required — while the two acts with the highest number of votes sang to secure an exclusive prize. (Week one's prize was a trip to New York to meet Pink, which was won by Grace Davies.) It wasn't the most popular format change — Radio Times said it was \"near-impossible to care\" who won the weekly prize — so will it return this series? I've contacted the X Factor team to find out, but haven't received an answer yet.\nSo, no specifics on the prize yet; but what do we know about this year's series? Well, as mentioned above, both the judging panel and the host have been confirmed. Because Robbie Williams will be touring South America in November, Sharon Osbourne will fill his slot for some of the live shows, as Digital Spy reports.\nAnd how about the format? The dreaded Six Chair Challenge will return, as the show's official Twitter account revealed. Plus, according to Radio Times, a new feature will be introduced to the challenge: the Golden X. Modelled on the Britain's Got Talent Golden Buzzer, the feature will allow each judge \"one guaranteed 'safe seat' to give to a singer in their category,\" sending them directly to the Judges' Houses stage. Interesting!\nThis weekend is all about the X Factor, as the 2018 series launches at 8 p.m. on Saturday night, on ITV, and continues on Sunday at the same time. Let's hope the revamped judging panel and updated format make for a thoroughly unmissable series.","url":"https://www.bustle.com/p/what-is-the-x-factor-2018-prize-this-years-contestants-could-be-competing-for-more-than-a-recording-contract-11451209"}
