{"authors":["Rebecca Hersher"],"date_download":"2018-10-22 23:17:18","date_modify":"2018-10-22 23:17:18","date_publish":"2017-01-11 00:00:00","description":"The white man who murdered nine black people in a church in Charleston, S.C., is the first person to receive the death penalty in a federal trial that included hate crimes charges.","filename":"data/vaneerConsumption/WhatHappenedToYouDylannVictimsFriendAsksRoofAtSentencing.json","image_url":"https://media.npr.org/assets/img/2017/01/11/npr---ap17010863296005-jan-17_wide-510ddefc48b2c0450ff8c0d9bb179aa51a640351.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2017_01_11_509299574_what-happened-to-you-dylann-victims-friend-asks-roof-at-sentencing_1540250238.html","title":"'What Happened To You, Dylann?' Victim's Friend Asks Roof At Sentencing","title_page":"'What Happened To You, Dylann?' Victim's Friend Asks Roof At Sentencing : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"'What Happened To You, Dylann?' Victim's Friend Asks Roof At Sentencing\nEnlarge this image toggle caption Brooks Brunson/The Post And Courier via AP Brooks Brunson/The Post And Courier via AP\nA federal judge in South Carolina formally sentenced Dylann Roof to death on Wednesday, one day after a jury recommended that he be executed for murdering nine people in a Charleston church.\nUnder federal sentencing laws, the death penalty can be imposed only if all 12 jurors agree on it, and the judge cannot overrule the jury's decision.\nRoof is the first person to be sentenced to death in a federal trial that included hate crimes charges, according to the Death Penalty Information Center. Since 1988, three of the 81 people sentenced to death have been executed by the federal government.\nAfter he was sentenced, Roof asked for new attorneys, saying he did not trust his defense team, which includes multiple experienced capital punishment defense lawyers. During the guilt portion of the trial, Roof's lawyers actively defended him, but Roof chose to represent himself during the penalty phase, with his attorneys providing backup counsel.\nU.S. District Judge Richard Gergel denied the request and gave Roof 14 days to file an appeal if he wishes.\nOn Tuesday, lead attorney David Bruck suggested in a statement that his team intends to appeal the sentence.\nBefore he read the sentence, Gergel opened the floor to dozens of family members and friends of those who died in June 2015. They addressed Roof directly, taking the stand and turning to face the 22-year-old, who kept his eyes down, according to reporters in the courtroom.\nMany of them asked Roof to look at them. He did not.\nAll expressed anguish and frustration. Some described their hatred of Roof. Others voiced forgiveness.\n\"Dylann! Dylann! I know that you can hear me,\" said Jamie Scott, whose nephew Tywanza Sanders was killed. \"I wish you would look at me, boy, but I know that you can hear me,\" she was quoted as saying by Charleston's Post and Courier.\nEnlarge this image toggle caption Anita Brewer Dantzler/AP Anita Brewer Dantzler/AP\n\" 'How dare you sit here every day looking dumb-faced, and acting like you did nothing wrong,' \" the newspaper said Ashland Temoney yelled at Roof, who murdered Temoney's aunt, DePayne Middleton.\n\"You are the biggest coward I have ever seen in my life,\" Temoney told Roof.\nFelicia Sanders lost both her son and her aunt, Susie Jackson, in the attack, but she herself survived. \"I cannot shut my eyes to pray,\" she said Wednesday. \"Even when I try, I cannot. I have to keep my eye on everyone that is around me.\"\n\"Yes, I forgive you,\" Sanders continued. \"That was the easiest thing I had to do. ... But you can't help someone who doesn't want to help themselves.May God have mercy on your soul,\" the Post and Courier reported.\nSouth Carolina Public Radio's Alexandra Olgin said that family members in the courtroom embraced after the jury recommended the sentence on Tuesday.\nOlgin reported:\n\"Melvin Graham, the brother of victim Cynthia Graham Hurd, says there are too many senseless shootings in this country. 'I just want this to stop. I really do. I'm tired. Every time I hear about a shooting I cry. We have to stop this.' \"Graham says he supports the death sentence for his sister's killer. \"During the trial prosecutors repeatedly showed through Roof's writings how much he hated black people. \" 'If Dylann Roof was named Abdul, we'd call him a terrorist and say he'd been radicalized. And he was radicalized! But not in the way some people think. Radicalized himself to believe this thing, and felt that he had to act on it, just like any other terrorist.' \"\nAs The Two-Way has reported, Roof told investigators that his beliefs about race were shaped by things he read on the Internet after an initial Google search for information about Trayvon Martin, the unarmed black teenager shot and killed in 2012.\nEmanuel African Methodist Episcopal Church member Marsha Spencer said the shooting left her \"broken.\"\n\"What happened to you, Dylann?\" she asked, according to a tweet by the Post and Courier's Abigail Darlington, who was inside the courtroom.\nBefore the final phase of jury selection in November, the judge ordered an evaluation of Roof's competency to stand trial after his defense team brought up concerns. The competency evaluation was submitted to the parties in the case, but it has not been released to the public.\nRecords from a hearing about that evaluation have also remained sealed — the judge believed the contents could potentially prejudice the jury — but are scheduled to be made public once the sentencing phase is over.\nRoof is facing separate murder charges brought by the state of South Carolina, which is also seeking the death penalty.","url":"https://www.npr.org/sections/thetwo-way/2017/01/11/509299574/what-happened-to-you-dylann-victims-friend-asks-roof-at-sentencing"}
