{"authors":[],"date_download":"2018-10-30 21:49:45","date_modify":"2018-10-30 21:49:45","date_publish":"2016-12-20 16:33:00","description":"Winter solstice 2017: What is it; when does it happen; Stonehenge connection","filename":"data/vaneerConsumption/Whatisitwhendoesithappen.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/K99Online/2016/01/20/Videos/4713791966001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_winter-solsti_fd8845c4b99e696530650ab85fee7824__1540936185.html","title":"What is it; when does it happen","title_page":"Winter solstice 2017: What is it; when does it happen","title_rss":"NULL","source_domain":"ajc.com","text":"Get ready, Thursday night is going to be a long one.\nThursday marks the winter solstice, so that means we will see the least amount of sunlight making the night the longest of the year.\nWhat’s a solstice and why is my day going to drag on? Here are six things to know about the longest night of the year.\n1. What is a winter solstice?\nThe winter solstice (solstice is Latin for “sun standing still”) happens at the same time for everyone on Earth. It represents the exact moment when the Northern Hemisphere is tilted at its furthest point away from the sun.\n2. Why is this night any longer than any other night?\nThe night is longer because you will see the fewest hours of sunlight in the Northern Hemisphere today as the earth hits its farthest tipping point. The sun is directly over the Tropic of Capricorn, with more sunlight seen in the Southern Hemisphere.\n3. Is the winter solstice celebrated?\nIt sure is, and has been for centuries. Christians celebrate the birth of Jesus on Dec. 25, just days after the solstice, and many believe the date of Dec. 25 was chosen to overshadow the pagan celebrations of Saturnalia and Natalis Invicti, according to timeanddate.com.\nThe word “Yule” -- used to describe the Christmas season -- is believed to have come from the Norse word “jol” which referred to the winter solstice festival. Wiccans celebrate Alban Arthan – or the rebirth of the Sun God. Today, celebrations are set for Poland, Pakistan, Iran and Guatemala, among other places around the world.\n4. Is the solstice always on Dec. 21?\nTechnically, the solstice can happen any day between Dec. 20 and Dec. 23 because the calendars we use aren’t the same length as a solar year. The 2017 solstice happens on Thursday at 11:28 a.m. EST\n5. When is the shortest night of the year?\nThe summer solstice happens in June. Take the winter solstice explanation and flip it – Northern Hemisphere tilted toward the sun, longer days, shorter nights.\n6. What does Stonehenge have to do with it?\nStonehenge is an ancient monument in England that is often mentioned in the same breath as the winter solstice. Some say the monument, which dates to between 3,000 and 2,000 BC, could have been a burial ground from its earliest beginnings. Others, say it’s a landmark for visits from space aliens. The only thing that is known for sure about the structure -- built without the aid of cranes or computers -- is that it sits perfectly along a straight line with sunrise on the winter solstice.","url":"https://www.ajc.com/news/national/winter-solstice-2017-what-when-does-happen-stonehenge-connection/Ngcd9jQZBCMzmWri8fLKEI/"}
