{"authors":[],"date_download":"2018-10-22 22:55:47","date_modify":"2018-10-22 22:55:47","date_publish":"2014-06-11 13:08:32","description":"The loss pretty much ends what was left of the chances of immigration reform getting done this year.","filename":"data/vaneerConsumption/WhatEricCantorsLossCouldMeanfortheGOP.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/502666/140611-cantor-mn-1319_1c0287e39eae677bce8c8395a1c7360c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_what-eric-cantors-loss-could-mean-gop-n128291_1540248947.html","title":"What Eric Cantor's Loss Could Mean for the GOP","title_page":"What Eric Cantor's Loss Could Mean for the GOP","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCantor’s loss sends shockwaves well beyond his Virginia district\nOnce every five years or so, we see an election result that has an impact well beyond the ballot box. (Think Scott Brown’s Senate win in Massachusetts in 2010, or Harris Wofford’s in 1991.) Well, House Majority Leader Eric Cantor’s (R-VA) stunning primary defeat in Virginia on Tuesday night fits into that same category, and it has five national repercussions outside of what happened in Cantor’s Richmond-area district. The first repercussion: It pretty much ends the chance of immigration reform getting done this year (and maybe the rest of the Obama presidency). As we’ve constantly written, immigration continues to be the issue that tears the Republican Party apart. And that was especially true in Virginia, where Cantor’s victorious opponent, Dave Brat, blasted the No. 2 House Republican for supporting a “Dream Act”-like proposal to provide a path to citizenship for children who were brought to the United States illegally. Immigration was the culprit for John McCain’s near-death experience in 2008; it was the reason (before “oops”) why Rick Perry lost in 2012; and it was the chief issue Mitt Romney used to bolster his conservative bona fides with GOP primary voters. Yes, Sen. Lindsey Graham’s (R-SC) own primary victory last night was an example of a pro-immigration-reform Republican winning with a conservative electorate (more on that below). But remember, the immigration ball is in House’s court, not the Senate’s. And Graham, unlike Cantor, was simply a smarter tactical politician when it came to changing the subject and finding others issues to animate the base.\nSign up for top politics news direct to your inbox.\nForget about immigration (or any other legislation) moving for the rest of the year\nA second repercussion: How does any other legislation move in Congress the rest of the year? Remember, Cantor and House Budget Committee Chairman Paul Ryan have traded places over the last couple of years as the go-between with Tea Party Republicans to get them to move on legislation. With Cantor’s loss, who steps in to be this intermediary? The irony here, of course, is that this Tea Party victory over the establishment didn’t come with national Tea Party support -- Tea Party Patriots, FreedomWorks, and Club for Growth didn’t target Cantor (probably because he was one of their chief allies in leadership). This was an actual grassroots uprising in VA-7, a truly rare occurrence these days.\nSending a scare to other Republicans running in primaries later this summer\nA third repercussion is that this has to give other Republicans -- think Pat Roberts in Kansas and Lamar Alexander in Tennessee -- a scare. The reason: Their challengers are suddenly going to receive A LOT more attention after Dave Brat’s victory last night. Just check out this fundraising email Chris McDaniel, who’s competing against Sen. Thad Cochran (R-MS), sent to his supporters. “Tonight, conservative Dave Brat won a stunning upset up in Virginia, unseating House Majority Leader Eric Cantor. Help us pull off another stunner in Mississippi. What does that have to do with the senate race in Mississippi? I'll tell you: It's one more example of what can happen when true conservatives band together and demand better from Washington.” And here’s what Tea Party candidate Milton Wolf, who’s taking on Roberts in Kansas, said: \"Eric Cantor isn't the only incumbent from Virginia who is going to lose his primary this year,” Wolf said in a statement to reporters. “On August 5th, it’s Pat Roberts' turn.”\nDo Jeb Bush and Marco Rubio think twice about 2016?\nA fourth repercussion has to be on the 2016 Republican field. Cantor’s loss last night is yet another sign that the Republican Party is fractured heading into the next presidential election. If you’re Jeb Bush -- who supports comprehensive immigration reform and Common Core -- does the result out of Virginia make you think twice about running in 2016? What about Marco Rubio, who was one of the co-authors of the “Gang of Eight” immigration bill that passed the Senate last year? Yes, Republicans are set to make some significant electoral gains this midterm election season. But today’s GOP is just as divided as it was after 2012, if not more divided.\nWho replaces Boehner whenever he decides to step down?\nThe fifth and final repercussion after last night is the uncertainty about who’s the heir apparent to House Speaker John Boehner? As NBC’s Frank Thorp reported yesterday, two conservative House Republicans said that when their conference elects a speaker in 2015, they don't expect it to be John Boehner. \"I don't think he runs,\" Rep. Raul Labrador, R-Idaho, said at a monthly event held by the Heritage Foundation called Conversations with Conservatives. Another conservative, Rep. Matt Salmon, R-Ariz., echoed Labrador, saying, \"I don't think he's going to come back as speaker, either.\" Well, if it’s not Boehner or Cantor in 2015, who would be speaker? Paul Ryan? Someone like Rep. Jeb Hensarling (R-TX)? Tom Price (R-GA)? And if not them, who? It’s VERY wide open.\nOther odds and ends about Cantor’s loss: NBC’s Frank Thorp has some additional notes about Cantor’s stunning defeat last night:\nCantor is the first House majority leader in the history of the officially designated position to have lost his primary for re-election, according to an analysis by NBC News of previous majority leaders. Including Cantor, there have been 24 majority leaders in the House since the position was created in 1899, and none of them lost their job in this way. The most recent high profile loss of a congressional leader was in 1994, when then-House Speaker Tom Foley lost in his general election against a little known Republican, George Nethercutt.\nCantor outspent Brat by more than 40-to-1, $5 million to $123,000.\nAnd get this: Cantor's re-election campaign spent more at steak houses then his opponent, Dave Brat, spent on his entire campaign, according to campaign finance data. According to FEC campaign finance data, Cantor's campaign spent $168,637 in 17 payments to both Bobby Van's Steak House and BLT Steak up until May 21. By comparison, Brat's campaign had spent a TOTAL of $122,793 in that same amount of time.\nWhy Lindsey Graham won (and Cantor didn’t)\nIn what was SUPPOSED to be the marquee race last night, Sen. Lindsey Graham (R-SC) easily cleared the 50% needed to avoid a runoff. So why did Graham -- who champions comprehensive immigration reform -- win and Cantor lose? For one thing, Graham faced a divided field of six opponents, while Cantor faced just one. In addition, Graham found a way to placate the conservative base (Benghazi, mentioning impeachment for Obama on the release of the Gitmo detainees). And Graham worked his re-election HARD, traveling back to his state constantly. As for Cantor, here’s what conservative Erick Erickson wrote: “Cantor lost his race because he was running for Speaker of the House of Representatives while his constituents wanted a congressman. The tea party and conservatives capitalized on that with built up distrust over Cantor’s other promises and made a convincing case Cantor could not be trusted on immigration either.”\nObama’s comments on the latest school shooting\nFinally, don’t miss President Obama’s remarks on the school shooting in Oregon -- in what was reportedly the 74th school shooting in America since the tragic shooting in Newtown, CT. “My biggest frustration so far is the fact that this society has not been willing to take some basic steps to keep guns out of the hands of people who can do just unbelievable damage,” Obama said. “We're the only developed country on earth where this happens. And it happens now once a week. And it's a one day story. There's no place else like this.” He added, \"A lot of people say this is a mental-health problem, you know, it’s not a gun problem. The United States does not have a monopoly on crazy people, it’s not the only country that has psychosis, and yet, we kill each other in these mass shootings at rates that are exponentially higher than any place else. Well what’s the difference? The difference is these guys can stack up ammunition in their houses.”It was a VERY blunt President Obama, but also a president who is aware of the limits of his power.\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/what-eric-cantors-loss-could-mean-gop-n128291"}
