{"authors":["Kenneth Dickerman","Photo Editor","Martin Bertrand"],"date_download":"2018-10-21 02:56:36","date_modify":"2018-10-21 02:56:36","date_publish":"2018-06-20 10:00:48","description":"Photographer Martin Bertrand explores skating culture in Vietnam.","filename":"data/vaneerConsumption/WhatitslikeskatinginHoChiMinhCity.json","image_url":"https://www.washingtonpost.com/resizer/0Elumk9d38ivev-aVSsBNiLjAhA=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UEPWACISE46S5BIDWVKVTHSWC4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_06_20__1540090596.html","title":"What it’s like skating in Ho Chi Minh City","title_page":"What it’s like skating in Ho Chi Minh City - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"A skater does a trick outside Saigon Skateshop in Ho Chi Minh City. (Martin Bertrand/Hans Lucas)\nInside Saigon Skateshop in Ho Chi Minh City. (Martin Bertrand/Hans Lucas)\nIn the heart of Ho Chi Minh City, Vietnam, is a store catering to the city’s skateboarders. It is called Saigon Skateshop, and it was founded by a 26-year-old man named Thong. Thong is the oldest member of a group of skateboarders in the city. When the shop was opened, the goal was to fill a gap in the skating scene. Previously, the only skateboards that could be found were cheap ones from China that would break easily. The shop is run by Thong, his friends and fellow skateboarders. While the shop exists to sell boards, clothing and other accessories, it also serves as headquarters for Thong and his friends; they gather at the shop and then head out on motor scooters to seek out places to skate.\nSkating in Ho Chi Minh City can be tough. Traffic is heavy, and the pavement is uneven. There is some respite, though. Outside the city and at the end of a long and dusty road stands the only skate park in town. Built in 2013, the park costs a little over $2 to get in. It is a little run-down and the roof leaks, especially during the rainy season. Despite this, young people who skate in the park are happy with it and can’t imagine asking for anything more. It is a place where the skateboarders feel as if they can be themselves. At the shop, the skateboarders put on a serious face, all business. But when they get to the skate park, they open up, showing off their tattoos and laughing as they skate. Skateboarding is relatively new to Vietnam but is gaining in popularity every day.\nPhotographer Martin Bertrand recently traveled to Vietnam to explore the burgeoning skate scene there. These photos show what he found.\nShoppers check out new skating shoes in Saigon Skateshop. (Martin Bertrand/Hans Lucas)\nSaigon Skateshop in Ho Chi Minh City. (Martin Bertrand/Hans Lucas)\nSkating in Ho Chi Minh City. (Martin Bertrand/Hans Lucas)\nA skater takes a break in Ho Chi Minh City. (Martin Bertrand/Hans Lucas)\nSkaters get on their scooters to seek out places to skate in Ho Chi Minh City. (Martin Bertrand/Hans Lucas)\nThe exterior of a skate park in Ho Chi Minh City. (Martin Bertrand/Hans Lucas)\nA skater does a trick inside the skate park. (Martin Bertrand/Hans Lucas)\nA skater takes a break. (Martin Bertrand/Hans Lucas)\nInside the skate park. (Martin Bertrand/Hans Lucas)\nSkaters use the ramps inside the skate park. (Martin Bertrand/Hans Lucas)\nSkaters hanging out. (Martin Bertrand/Hans Lucas)\nA skater and his board. Skateboarding is relatively new to Vietnam but is gaining in popularity. (Martin Bertrand/Hans Lucas)\nSkaters share a moment in Ho Chi Minh City. (Martin Bertrand/Hans Lucas)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nWhat life is like in the coal-mining boomtowns of Appalachia\nDeeply poetic photos focus on the nexus of ‘chronicle and fiction’\n‘That world where veils, blood and smoke go hand in hand with cosmic philosophy.’ Photographs from the black metal scene in Iceland.","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/06/20/what-its-like-skating-in-ho-chi-minh-city/"}
