{"authors":["Paige Tutt"],"date_download":"2018-10-30 22:56:57","date_modify":"2018-10-30 22:56:57","date_publish":"2014-08-14 15:12:43","description":"WeTV's family-centered reality television series Braxton Family Values is returning for its fourth season, and we'll certainly get to see a lot of that particular Braxton family drama that makes the show so fun. WeTV reports that this season's…","filename":"data/vaneerConsumption/WhatBroadwayShowIsToniBraxtonInWatchHerReturntotheStageonBraxtonFamilyValues.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/6705ae1c-12bf-422c-ace7-51464d5173f1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35730-what-broadway-show-is-toni-braxton-in-watch-her-return-to-the-stage-on-braxton-family_1540940217.html","title":"What Broadway Show Is Toni Braxton In? Watch Her Return to the Stage on 'Braxton Family Values'","title_page":"What Broadway Show Is Toni Braxton In? Watch Her Return to the Stage on 'Braxton Family Values'","title_rss":"NULL","source_domain":"bustle.com","text":"WeTV's family-centered reality television series Braxton Family Values is returning for its fourth season, and we'll certainly get to see a lot of that particular Braxton family drama that makes the show so fun. WeTV reports that this season's premiere episode is going to be juicy, and you already know I'm excited. One of my favorite cast members by far is Grammy Award-winning singer Toni Braxton. \"Unbreak My Heart\" used to always be playing around the house when I was a kid, and it's so fun to see Toni and the other ladies grow and progress career wise. This season, however, will showcase Toni in a light many have not seen her shown in for quite some time.\nThat's right, Braxton is back on Broadway baby! She and longtime collaborator Kenny \"Babyface\" Edmonds began performances of After Midnight in mid-March. They join a rotating cast roster of guest star vocalists, replacing K.D. Lang and American Idol winner Fantasia Barrino.\nIn Dec. 2013 Braxton and Babyface released an album of duets entitled Love, Marriage & Divorce. The pair have 16 Grammy Awards between them, and they worked together on Toni's infamous \"Unbreak My Heart,\" so you know there will be good chemistry.\nDon't think this is Toni's diva-licious debut on Broadway either, no sir. She's appeared in Aida, as well as everyone's favorite Disney musical (well at least one of their favorites) Beauty And The Beast, and was the first African American woman to play the role of Belle.\nAs for After Midnight, Broadway.com reports that it's a celebration of \"Duke Ellington’s years at Harlem’s famed Cotton Club using his original arrangements and performed by a world-class big band of 17 musicians.\" It's juxtaposed with a complimentary narrative of Langston Hughes' poetry.\nAfterMidnightNY on YouTube\nThe show features an insanely star-studded cast with the likes of Tony Award winner Adriane Lenox (Dreamgirls, The Butler, The Blind Side, 30 Rock, Black Snake Moan) and Dulé Hill (The West Wing, Psych).\nIf you want to know more about Braxton's Broadway return or what the other Braxton sisters are up to, you're going to have to tune into the premiere of Braxton Family Values, Thursday night at 9 p.m.","url":"https://www.bustle.com/articles/35730-what-broadway-show-is-toni-braxton-in-watch-her-return-to-the-stage-on-braxton-family"}
