{"authors":[],"date_download":"2018-10-30 20:06:49","date_modify":"2018-10-30 20:06:49","date_publish":"2016-12-19 01:57:00","description":"Here’s what 49ers quarterback Colin Kaepernick had to say after the lost to the Falcons:\nOn ho...","filename":"data/vaneerConsumption/WhatColinKaepernickhadtosayaftertheloss.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/19/Images/newsEngin.17036380_121916-falcons-photos-CC14.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_what-colin-kaepernick-had-say-after-the-loss__1540930009.html","title":"What Colin Kaepernick had to say after the loss","title_page":"What Colin Kaepernick had to say after the loss","title_rss":"NULL","source_domain":"ajc.com","text":"Here’s what 49ers quarterback Colin Kaepernick had to say after the lost to the Falcons:\nOn how injuries have affected their play:\n“It’s a difficult situation, two weeks in a row we’ve had a center, a receiver, and a tight end go down so players have had to step up. A lot of players have to move around, someone like Zane Beadles who played three different positions in three weeks for us. It’s great to have a player like that who’s flexible and can move around like that, especially his first year in the offense. So we have to have players that are able to do that, able to move around and make plays for us and be able to accommodate the situation.”\nOn any memories or feelings in his first game in the Georgia Dome since the 2012 NFC Championship:\n“When I first walked into the locker room my locker and [Joe] Staley’s locker were the same lockers we had during that championship game. So there was that little bit of a nostalgic moment, and then it was “Alright, let’s get ready for the day. Let’s get prepared. Let’s get focused.”\nOn how far the 49ers are from competing at a championship level again:\n“That’s always hard to tell. It can be pieces here and there that make a huge difference, and it can also be the culture of this team changing, which it needs to. We have to be able to create our opportunities and go out and create wins for our team.”\nOn what he means by saying the team’s culture needs to change:\n“We have to create a culture of winning, and winning by any means. Right now our culture isn’t that, and we have to be able to improve and create that.”\nReflect on his journey this season:\n“I really don’t reflect too much during the season. My focus is on the next game we have, the next opponent and making sure I’m preparing myself and trying to help prepare my teammates. Doing everything we can to try and win that next game, so I think a better time for reflection will be this offseason.”\nOn whether he thought the 49ers could come back in the second half:\n“Yes. I think at halftime our mentality was if we get a stop out of the gate, go down and score then it’s a one-score game. That would have given us an opportunity to close that gap. We weren’t able to do that but that was the mentality coming out at halftime.”\nOn whether he felt the offensive line held up better than he anticipated under the circumstances:\n“I wouldn’t say better than I thought, they’re both very talented players that’s why they’re on this team. Once again for Zane [Beadles] to be able to play three different positions on this offensive line and play at a very high level really speaks to his ability as a player. [John] Theus coming in, stepping up and holding his own as well, I think we have players that can step in we just have to put it all together to get a win.”\nOn whether the uncertainty with the offensive line has made him uncomfortable:\n“No, I think our offensive line has done a great job being able to move and being flexible with the positions they’re playing. Being able to pick up calls and know exactly what they’re doing pass protection and run game wise, so we have great confidence in them.\nOn whether the Falcons speed on defense surprised him:\n“No, this defense has a lot of speed on it and we knew that going in. There were a couple times I thought I was going to be able to catch an edge or step out of something and extend plays, but those plays didn’t happen.","url":"https://www.ajc.com/sports/football/what-colin-kaepernick-had-say-after-the-loss/ODHYdo9TXdnrF8VBagrGyN/"}
