{"authors":["Peter Over","Darwin Deason","A Texas Billionaire About His Mega-Yacht. He Donated","Million To A Superpac Supporting Rick Perry. He Wanted It Back After Perry Dropped Out","Got It"],"date_download":"2018-10-23 05:50:45","date_modify":"2018-10-23 05:50:45","date_publish":"2015-09-21 00:00:00","description":"When former Texas Gov. Rick Perry dropped out of the presidential race, a superPAC supporting him was left with millions of dollars in the bank. So where did it go? And what are the rules?","filename":"data/vaneerConsumption/WhatHappensToAllThatSuperPACMoneyWhenACandidateDropsOut.json","image_url":"https://media.npr.org/assets/img/2015/09/21/gettyimages-481258658_wide-90e338b15a362f79717ee63d40ea200777ed264a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_itsallpolitics_2015_09_21_442277940_what-happens-to-all-that-superpac-money-when-a-candidate-drops-out_1540273845.html","title":"What Happens To All That SuperPAC Money When A Candidate Drops Out","title_page":"What Happens To All That SuperPAC Money When A Candidate Drops Out : It's All Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"What Happens To All That SuperPAC Money When A Candidate Drops Out\nEnlarge this image toggle caption Scott Olson/Getty Images Scott Olson/Getty Images\nOpportunity and Freedom PAC, and its two siblings, Opportunity and Freedom PAC numbers 1 and 2, were meant to be heavyweight sluggers for Republican Rick Perry, providing big-budget support for his second presidential bid.\nBut Perry himself turned out to be a welterweight at best. The former Texas governor entered the race late, raised a skimpy $1.1 million by June 30 and \"suspended\" his campaign barely two months later.\n\"We had a plan,\" political consultant Austin Barbour, senior advisor to the superPACs, told NPR.\n\"To me it also represents the peak of spending absolutely foolish money. It's not rational, but I love it.\"\nThe plan began with more than a month of TV ads in Iowa, starting when Perry announced. It took a new course when Perry's campaign coffers emptied out and the superPACs poured money into Iowa field operations. Finally, Perry's withdrawal in the early rounds of the primary season left the superPACs with the plan mostly unimplemented and $13 million unspent.\nSo what happened to that $13 million?\nIt's gone back to the donors – mainly Dallas businessmen Darwin Deason and Kelcy Warren.\n\"The wire transfers have already been processed,\" Barbour said Friday evening.\nDeason, who lives part-time in Dallas, is reportedly worth $1.38 billion. He founded a company that handles processing for companies like E-ZPass. He sold it in 2010 to Xerox for $6.4 billion. He's gained attention for how he spends some of that money, including on his 205-foot yacht, Apogee.\n\"Apogee means pinnacle in Greek,\" Deason told ForbesLife magazine in 2012. \"To me it also represents the peak of spending absolutely foolish money. It's not rational, but I love it.\"\nWhat are the rules?\nCongress long ago passed a law limiting what candidates can do with unused campaign cash — in particular, they can't take it home with them.\nBut that law doesn't apply to superPACs.\nThis is only the second presidential contest since superPACs were created, and there is no law regarding left over money for the groups given their relative infancy.\nIs there any precedent for this?\nYes. In 2012, the presidential superPACs generally wound down at the same rate as the candidate's hopes, with one exception. When former House speaker Newt Gingrich dropped out of the GOP primaries, the superPAC Winning Our Future returned $5 million to Miriam Adelson.\nShe and her husband, casino billionaire Sheldon Adelson, had been the major underwriters of Winning Our Future. Their money had kept Gingrich in the race weeks longer than he could otherwise have managed.\nBut the superPAC alone wasn't enough, as Perry realized this month.","url":"https://www.npr.org/sections/itsallpolitics/2015/09/21/442277940/what-happens-to-all-that-superpac-money-when-a-candidate-drops-out"}
