{"authors":[],"date_download":"2018-10-30 17:49:59","date_modify":"2018-10-30 17:49:59","date_publish":"2018-10-30 14:33:00","description":"What is the ‘birthright citizenship,’ and can Trump terminate it?","filename":"data/vaneerConsumption/WhatisbirthrightcitizenshipandcanTrumpterminateit.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/10/30/Videos/4519064.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_what-the-birt_d7e5e68818061189d8b02e64459c9e43__1540921799.html","title":"What is ‘birthright citizenship,’ and can Trump terminate it?","title_page":"What is the ‘birthright citizenship,’ and can Trump terminate it?","title_rss":"NULL","source_domain":"ajc.com","text":"President Donald Trump says he plans to use an executive order to end \"birthright citizenship,\" or the practice of extending citizenship to children born in the United States even if their parents are not citizens.\nIn an interview published Tuesday by Axios, Trump claimed that the Citizenship Clause found in the 14th Amendment to the Constitution can be terminated by executive order, a notion legal scholars and others immediately attacked.\n\"It was always told to me that you needed a constitutional amendment. Guess what? You don't,\" Trump said. …\"You can definitely do it with an act of Congress. But now they're saying I can do it just with an executive order.\"\n\"It's in the process. It'll happen ... with an executive order,\" he said.\nWhat is the Citizenship Clause and can Trump terminate it? Here’s a look what it means and the legal fight that would ensue.\nWhat is the Citizenship Clause?\nThe Citizenship Clause is found in the 14th Amendment to the U.S. Constitution, written in 1866. The clause confers U.S. citizenship on children of foreigners who are born in this country.\nThe part of the amendment pertaining to birthright citizenship reads: “All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.\"\nCan an executive order, like the one Trump is talking about, be used to override the 14th Amendment?\nThe president can issue such an order – his power to do so rests in Article II of the Constitution – but whether such an order would survive the legal challenge to it becomes the question.\nWhile presidents have broad and sometimes undefined powers, the Constitution can only be changed by amending it.\nHow do you amend the Constitution?\nThe amendment process can be a long, involved one.\nAn amendment may be proposed either by a two-thirds majority vote in both the House of Representatives and the Senate or by a constitutional convention called for by two-thirds of the state legislatures.\nAll of the 27 amendments to the Constitution have come as amendments proposed by Congress.\nIf an amendment to the Constitution is proposed, the Archivist of the United States, who heads the National Archives and Records Administration (NARA), is charged with responsibility for administering the ratification process, according to the website for the National Archives.\nThe amendment is proposed by Congress as a joint resolution. The proposed amendment is sent to NARA’s Office of the Federal Register. It is then sent to the governor of each state, who presents it to his or her state’s legislature.\nOnce the state legislature decides to either vote for or against it, state officials notify the Archivist of the results.\nThe Constitution is amended when three-fourths of the states (38 of the 50) vote to ratify the amendment.\nWhat other laws protect birthright citizenship?\nThe Immigration and Naturalization Act (INA) of 1952 states that a \"person born in the United States who is subject to the jurisdiction of the United States is a U.S. citizen at birth.\"\nAre there any other ways for Trump to terminate birthright citizenship?\nTrump mentioned a legislative route for terminating birthright citizenship. Under Section 5 of the 14th Amendment, Congress has certain powers to “enforce, by appropriate legislation, the Amendment’s provisions.”\nIf Congress was to narrow the focus of the clause, it would likely involve passing a law that says any person born in the United States would not be considered “subject to the jurisdiction” of the country (meaning not a citizen of the U.S.) unless one of his or her parents is a citizen or legal resident of the United States.\nJust because Congress passes a bill does not mean it could not and would not be challenged in court. Such a bill would be challenged on the Amendment’s definition of who is eligible for birthright citizenship.\nIn other words, are people whose parents are in the country illegally entitled to birthright citizenship.\nMichael Anton, a former national security official in the Trump administration, wrote in an opinion piece for The Washington Post that Trump could \"specify to federal agencies that the children of noncitizens are not citizens\" even if they were born on U.S. soil, and he could do that using only an executive order.\n“The problem can be fixed easily. Congress could clarify legislatively that the children of noncitizens are not subject to the jurisdiction of the United States, and thus not citizens under the 14th Amendment. But given the open-borders enthusiasm of congressional leaders of both parties, that’s unlikely.\nIt falls, then, to Trump. An executive order could specify to federal agencies that the children of noncitizens are not citizens. Such an order would, of course, immediately be challenged in the courts.”\nThe full interview with Trump will air on \"Axios on HBO\" Sunday at 6:30 p.m. ET.","url":"https://www.ajc.com/news/national/what-the-birthright-citizenship-and-can-trump-terminate/lREwjVbqrG1P9z4eswuTSL/"}
