{"authors":["Meghan Demaria"],"date_download":"2018-10-31 01:43:12","date_modify":"2018-10-31 01:43:12","date_publish":"2018-08-27 21:58:45","description":"Fans wondering what will happen to Roseanne Barr's titular character in the Roseanne spinoff may not have to wonder much longer. In an interview with the U.K.'s Sunday Times, John Goodman said Roseanne's character is dead in The Conners, ABC's…","filename":"data/vaneerConsumption/WhatHappensToRoseanneInTheConnersWillChangeTheFamilyForeverAccordingToJohnGoodman.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/d3ce0b62-92c1-40e4-83a0-3a1ddd15bfd3-bca6407f-072b-4b54-b51d-73a57586181b-f03f32e1-692a-4b80-97af-0dd8aa9b27f7-148224_7501-2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_what-happens-to-roseanne-in-the-conners-will-change-the-family-forever-according-to-john-goodman-10253623_1540950192.html","title":"What Happens To Roseanne In ‘The Conners’ Will Change The Family Forever, According To John Goodman","title_page":"What Happens To Roseanne In ‘The Conners’ Will Change The Family Forever, According To John Goodman","title_rss":"NULL","source_domain":"bustle.com","text":"Fans wondering what will happen to Roseanne Barr's titular character in the Roseanne spinoff may not have to wonder much longer. In an interview with the U.K.'s Sunday Times, John Goodman said Roseanne's character is dead in The Conners, ABC's upcoming spinoff series.\n\"It's an unknown. I guess he'll be mopey and sad because his wife's dead,\" Goodman told the Times of his character, Dan Conner. It's been hinted plenty of times that Barr's character, Roseanne Conner, will be dead in the upcoming spinoff, but this appears to be the first time a cast member has confirmed the rumors. Bustle reached out to ABC about Goodman's statement, but the network declined to comment.\nGoodman's revelation puts a twist on how Roseanne's original run ended, too. Before the sitcom's recent revival, Dan was actually the character who died, according to the show's ninth season. But Dan Conner was very much alive and well in the season 10 revival, having evidently survived his heart attack after all.\nThe Conners is slated to premiere on ABC this fall. The spinoff's first season will have 10 episodes, according to a press release from the network announcing the series. Barr won't be involved with the new show, so it's somewhat fitting that her character won't be included. In a statement provided to Bustle earlier this year, Barr said of the spinoff,\n\"I regret the circumstances that have caused me to be removed from 'Roseanne.' I agreed to the settlement in order that 200 jobs of beloved cast and crew could be saved, and I wish the best for everyone involved.\"\nAstrid Stawiarz/Getty Images Entertainment/Getty Images\nBack in June, ABC seemingly referred to Roseanne Conner's fate in a press release about the new show. The release said that the spinoff will focus on the Conner family with the following description:\nAfter a sudden turn of events, the Conners are forced to face the daily struggles of life in Lanford in a way they never have before. This iconic family – Dan, Jackie, Darlene, Becky and D.J. – grapples with parenthood, dating, an unexpected pregnancy, financial pressures, aging and in-laws in working-class America. Through it all, the fights, the coupon cutting, the hand-me-downs, the breakdowns – with love, humor and perseverance, the family prevails.\n\"A sudden turn of events\" — the phrasing now seems to have been an allusion to the character's demise. The press release also made clear that the new show would focus on Roseanne characters Dan, Darlene, Jackie, D.J., and Becky.\nABC canceled Roseanne in May after Barr posted a racist tweet about Valerie Jarrett, who was an adviser to President Obama. Barr deleted the tweet and apologized. ABC Entertainment president Channing Dungey said in a statement to Bustle,\n\"Roseanne's Twitter statement is abhorrent, repugnant and inconsistent with our values, and we have decided to cancel her show.\"\nFor The Conners, ABC also made clear in the June press release that Barr \"will have no financial or creative involvement\" with the new series. And based on Goodman's latest statement, it sounds like the new show won't be drawing much attention to her character, either. Roseanne may have been named for its titular star, but it sounds like the focus of The Conners be will be squarely on the rest of the family.","url":"https://www.bustle.com/p/what-happens-to-roseanne-in-the-conners-will-change-the-family-forever-according-to-john-goodman-10253623"}
