{"authors":[],"date_download":"2018-10-30 17:59:06","date_modify":"2018-10-30 17:59:06","date_publish":"2018-09-11 11:00:00","description":"2018-19 season of Atlanta Symphony Orchestra to include experimentation in music and presentation","filename":"data/vaneerConsumption/WhattoexpectinnewASOseasonwhichopensSept20.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/11/Images/newsEngin.22776973_Robert-Spano-ASO-2-new-U64454667282jkl-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_music_experim_dfa982f341afe252d7147cd762456fba__1540922346.html","title":"What to expect in new ASO season, which opens Sept. 20","title_page":"What to expect in new ASO season, which opens Sept. 20","title_rss":"NULL","source_domain":"ajc.com","text":"Music Director Robert Spano begins his 18th season leading the Atlanta Symphony Orchestra Sept. 20 with an opening-night concert featuring Rachmaninov’s second piano concerto.\nThat Romantic beginning, featuring guest pianist Kirill Gerstein, belies the importance of new music to the 2018-19 season. Over the next eight months, the ensemble will perform past ASO commissions by six contemporary composers.\nSymphony No. 1 by Christopher Theofanidis is on tap for November. CONTRIBUTED BY MATTHEW FRIED\nThe ASO will perform Jennifer Higdon’s viola concerto in January. CONTRIBUTED BY J.D. SCOTT\nOne of Spano’s biggest legacies is his commitment to new music. During the season, the orchestra will play works by Christopher Theofanidis (Nov. 15), Jennifer Higdon and Alex Turley (both on Jan. 24), Michael Gandolfi (April 4), and Richard Prior and James Oliverio (both on May 9). Many of these composers, and the pieces that will be performed throughout the season, will be familiar to longtime ASO listeners. According to Evans Mirageas, the ASO’s vice president for artistic planning, performing a limited number of new composers is by design.\n“Robert has said, ‘Better to keep a focus on a narrower group of composers and do them again and again,’” Mirageas said. “What we have done is that by focusing, we have created an audience.”\n>> RELATED: With exit date set, Robert Spano still has dreams for ASO\nLast year, the ASO’s new music programming trained inward, focusing on bassist Michael Kurth and his compositions, which the symphony had been commissioning since 2011. By performing an album’s worth of music throughout the season, the ensemble highlighted the many facets of Kurth’s compositions, but also prepared itself for a year-end recording project.\nThe ASO and the ASO Chorus recorded the slate of Kurth’s original compositions for release in 2019. At the end of this season, the ASO will record another album of commissions.\n“I feel really proud that I can be part of this opening of doors to our city and saying, ‘Music is alive. It’s not a bunch of dead white guys in wigs,’” Kurth said.\n>> RELATED: Review: ASO concert highlights new Michael Kurth vocal work\nIn addition to programming new music, ASO officials are also experimenting with how music is presented. On the last day of November, a Friday, the symphony will perform an all-Rachmaninov concert with guest conductor Edward Gardner during an 11 a.m. concert. This “coffee concert,” as Mirageas called it, is actually a callback to a run of such events in the early 2000s. Those ultimately weren’t successful, he said, but through audience surveys, the ASO administration learned there was a demand for midday music.\n“So we’re going to try it,” Mirageas said. “In the world of performance, you can’t beta test something in front of an audience. You can do all the surveying you like … but you only know by trying.”\nFor another special performance, the symphony will bring back the movement artists of Glo for Ravel’s “Mother Goose” ballet, with choreography by Lori Stallings, on March 2.\nWhile the ASO spends most of its time in Atlanta, the ensemble has taken the show on the road more frequently in the past few years. While Mirageas said this is a down year for touring, the ensemble still will travel to the University of Georgia, Kennesaw State University or venues in southern Georgia about once a month. These jaunts outside the city aren’t seen by symphony officials as ways to increase the audience in Atlanta, but do serve as a way to reinforce the idea that the ASO is the symphony of the Southeast, Mirageas said. The spreading of classical music throughout the state also helps a little bit when applying to the state government for grants.\n“For me, the most important thing about getting out of Symphony Hall and playing elsewhere is to remind Georgians that we have a cultural treasure here that is the pride of the American Southeast,” he said. “We like to think of ourselves as Georgia’s orchestra.”\nWrapping up a two-year focus on Beethoven and Leonard Bernstein, the symphony will also present some of the grandest works in each composer’s catalog — Beethoven’s Fifth and Ninth symphonies, as well as the opera “Fidelio,” are peppered throughout the season.\n“This season, there are fewer (Beethoven) pieces overall, but they are the big-bang pieces,” he said. Mirageas is certain that by the end of the season, the ASO will have presented an appropriate study of the composer. “For my money, there’s no really significant Beethoven, in terms of his orchestral music, that we missed out on.”\nHere are four can’t-miss concerts during the Atlanta Symphony Orchestra’s 2018-19 season:\nBritten’s ‘War Requiem’ (Oct. 25, Oct. 27)\nPrincipal guest conductor Donald Runnicles takes the stage with the symphony and the ASO Chorus for an epic choral tour de force. Runnicles stays in town the next weekend (Nov. 1, 3) to lead the ASO in Mahler’s 10th Symphony.\nBrahms violin concerto (Nov. 8, Nov. 10)\nGuest violinist Veronika Eberle comes to Atlanta to perform Brahms’ brilliant concerto. The orchestra pairs these violin fireworks with Beethoven’s Eighth Symphony.\nBeethoven’s Ninth and Bernstein’s ‘Chichester Psalms’ (April 11, April 13-14, 2019)\nNeed a bigger choral fix? The ASO Chorus joins the symphony and a host of guest artists for one of Beethoven’s best-known symphonies and an awe-inspiring choral work by Bernstein.\nElgar Cello Concerto (April 25-27, 2019)\nLess than a year removed from his star turn at the royal wedding of Prince Harry and Meghan Markle, Sheku Kanneh-Mason comes to Atlanta to perform one of the most popular pieces of cello literature under the baton of guest conductor Carlos Kalmar. Leave the fascinators at home.\nCONCERT PREVIEW\nAtlanta Symphony Orchestra\n8 p.m. Sept. 20 and Sept. 22; 3 p.m. Sept. 23. $33-$119. Symphony Hall, 1280 Peachtree St. NE, Atlanta. 404-733-5000, atlantasymphony.org.\n8 p.m. Sept. 21. $20-$85. Hugh Hodgson Concert Hall, University of Georgia, 230 River Road, Athens. 706-542-4400, ugapresents.org.\nAJC’s new podcast: accessAtlanta\nLooking for things to do in and around Atlanta? We have lots of ideas, and we’ll be sharing them in a new weekly podcast, with new episodes debuting Thursday mornings.\nIn an episode from last spring, listen to Robert Spano talk about his career with the Atlanta Symphony Orchestra with AJC features reporter Bo Emerson. It is a revealing interview with the music director, whose career has spanned more than three decades.\n>> accessAtlanta PODCAST: Atlanta Symphony Orchestra's Musical Director, Robert Spano","url":"https://www.ajc.com/entertainment/music/experimentation-music-and-presentation-highlight-aso-season/oaYdZPVE0Mk4vR8eiVgZUN/"}
