{"authors":["Marita Noon"],"date_download":"2018-10-30 19:19:52","date_modify":"2018-10-30 19:19:52","date_publish":"2015-05-18 17:54:23","description":"In the United States, and most of the western world, there is an ideological war with dire physical consequences. It is the war on fossil fuels. But, even if you understand that energy is central to everything in modern society, the war is much bigger than energy. It is about freedom. It is about control. It is about global governance. |","filename":"data/vaneerConsumption/WhatifWeLose.json","image_url":"https://media.breitbart.com/media/2015/04/ap_ap-photo1777-1024x710.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_18__1540927192.html","title":"What if We Lose?","title_page":"What if We Lose? | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In every war, there are winners and losers.\nIn the United States, and most of the western world, there is an ideological war with dire physical consequences. It is the war on fossil fuels. But, even if you understand that energy is central to everything in modern society, the war is much bigger than energy. It is about freedom. It is about control. It is about global governance.\nIn my book Energy Freedom, I make a case for why energy is so important and, therefore, why it is under attack. I posit: “What would the world be like if we could suddenly wave a magic wand and give the environmentalists everything they want?” I then detail how our lives would change and how it would not be the utopia one might first think.\nWhile we know we can’t wave that magic wand, we head toward the same result. It is just happening a little at a time—one regulation after another, slowly, with some people, in the name of the planet, willingly giving up freedoms in favor of a promise of security. It comes in the form of the Endangered Species Act, Corporate Average Fuel Economy, and the Clean Power Plan—though the list could go on and on.\nOthers are not so gullible. They see the bigger plan and are willing to be scoffed at or even persecuted.\nThis past week, I had the opportunity to speak to a group of expats in Mexico. Repeatedly I heard: “If everything goes to hell in the U.S., this is where I am hiding out.”\nWhile I was South of the Border, I read a novel cover-to-cover: Mountain Whispers, Days without Sun. It was sent to me by the author, who reads my column. It is his debut novel and not the usual light, fluffy stuff I like to read around the pool. I didn’t expect to like it. But I promised I’d read it. I am glad I did.\nMountain Whispers: Days without Sun picks up where Energy Freedom leaves off. Coleman Alderson, using a fiction format, carefully weaves the green narrative into a spell-binding thriller set just slightly more than 25 years from now—when all of the green policies have taken force— and paints a gripping picture of how the Global Energy Enforcement Organization (GEEO) takes control of every aspect of our lives, leaving people struggling to survive a bleak existence.\nBut not everyone is willing to abandon freedom for the neat and tidy life promised in “Progress City.” They resist being “registered” and moved to work on an organic farm or serve in “the administration.” Even many of those who accepted the move are beginning to realize the mistake they made. The friction creates the story as the “retros”—Appalachian Mountain folks, many of whom worked in the now-closed coal mines—resist registration and citification.\nI chatted with Alderson about his book. I asked: “Why are cities important?” He explained the view that cities are “manageable regions,” that it is more efficient to have people in cites where they don’t use the resources. They don’t need cars. Instead they use public transportation or bicycles.\nOne of the lead characters is a young man named Agent Candler Greaves who is sent to round up the rebellious “retros.” Having been raised with the “save the planet” mantra, he genuinely wants to “help guide humanity toward a harmonious existence with the planet.” But, as Mountain Whispers makes vividly clear, the result of the GEEO’s efforts is a decrease in various public services, more land restrictions, and limited availability of food, electricity and medical treatments—while the leadership thrives in spite of it all.\nAlderson explains: “You can tell a story and capture people’s emotions more effectively than with facts and statistics. I really tried to dial back on the exposition and instead work it into the fabric of these people’s lives. My main goal is to show the impact of these mandates that result in control of people.”\nThe idea of citizens being willingly chipped and tracked may seem extreme to some, but as I returned to the U.S. and scanned my passport while the kiosk took my picture and printed out a report that allowed me back into the country, I realized it is closer than we think. If you’ve seen advertising pop up on your computer based on websites you’ve visited, or as you pull out of your driveway on Monday morning, your phone, without you asking it to, tells you how long it will take you to get to work, you know that the scenario Alderson presents, while fiction, is totally possible. Unless, like the Appalachian Mountain folks, we get what is going on and fight it while it is still an ideological war.\nAlderson is an optimist. In the end, it is going to be OK. If we can figure out how to put a brake on the policies and bring reason into the discussion, we can, then, figure out how to avoid living out the future he laid out in Mountain Whispers.\nThe author of Energy Freedom, Marita Noon serves as the executive director for Energy Makes America Great Inc. and the companion educational organization, the Citizens’ Alliance for Responsible Energy (CARE). She hosts a weekly radio program: America’s Voice for Energy—which expands on the content of her weekly column.","url":"https://www.breitbart.com/politics/2015/05/18/what-if-we-lose/"}
