{"authors":["Lee Stranahan"],"date_download":"2018-10-30 22:08:50","date_modify":"2018-10-30 22:08:50","date_publish":"2015-08-02 14:39:58","description":"What O'Reilly's Black Lives Matter Segment Left Out","filename":"data/vaneerConsumption/WhatOReillysBlackLivesMatterSegmentLeftOut.json","image_url":"https://media.breitbart.com/media/2014/12/Screen-Shot-2014-12-25-at-6.34.49-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_02__1540937330.html","title":"What O'Reilly's Black Lives Matter Segment Left Out","title_page":"What O'Reilly's Black Lives Matter Segment Left Out","title_rss":"NULL","source_domain":"breitbart.com","text":"Fox News host Bill O’Reilly did a segment on Tuesday night’s show about the Black Lives Matter movement with Washington Times writer Kelly Riddell that was solid, highlighting some of Riddell’s work about how progressive billionaire George Soros has been behind some of the group’s funding.\nThe segment left out some key facts, however, about O’Reilly’s central question: does the group matter? He asked Riddell:\nIs this just a fringe group or should we take them seriously? (…) I don’t whether this crew Black Lives Matter have any constituency other than the radical left, the real fringe nuts that runs around the country saying crazy things. Have they made any inroads into more established positions?\nThe O’Reilly segment never really answers that question fully and the answer is a resounding YES; Black Lives Matter has made inroads with elected politicians at every level, right up to the White House.\nPart of the evidence comes from Black Lives Matter founder Patrisee Cullors, in an interview on the Russia Today TV show Going Underground. Cullors told host Afshin Rattansi:\nWe’re going into halls of power now. Many of us are meeting with mayors or meeting with local government. Some of us have met with President Obama himself to talk about the demands.\nThose demands provide a major clue to the group’s background and agenda. Much of Black Live Matter’s “list of demands” is taken straight from the original Black Panther Party’s 10 Point Plans, archived here on a Marxist History website. The Black Lives Matter demands include “full, living wage employment for our people,” an end “to the military industrial complex,” and “release of all U.S. political prisoners.”\nAs Breitbart News has previously noted, Ms. Cullors’ name appears on White House visitor records. Add this to the group’s idolatry of terrorist Assata Shakur and the reality of this is stunning: a sitting U.S. President met with leaders of a revolutionary Marxist group that is based on the work and ideas of someone currently on the FBI Most Wanted Terrorist List.\nBlack Lives Matter has also made inroads overseas. Cullors and others from Black Lives Matter have also reached out internationally and travelled abroad to both the United Kingdom and to “Palestine.”\nAs Ebony Magazine reported:\nDuring the trip, Cullors presented to the British Houses of Parliament, alongside 10 families who experienced state violence, met with members of Black and immigrant communities across the UK, and connected with activists who fought in the Irish struggle for self-determination against the British. The European trip came less than two weeks after Cullors returned from a 10-day delegation to Palestine with the Dream Defenders and representatives from Ferguson and other racial justice groups.\nCullors told Ebony that these trips allow her group to be an even “greater threat” to the governments of the United States and the United Kingdom than the online activism the group gained fame for,\nSocial media has a real time presence but it’s not the same as meeting individuals, hearing their stories, looking them in the eyes, and promising we’ll bring their stories back,” she said. “It creates a greater threat to the US government and the UK government.\nMore proof that Black Lives Matter has successfully penetrated the Democrat political infrastructure: the Huffington Post reports that Howard Dean’s Democracy For America will now require all candidate they endorse to give a position on the Black Lives Matter movement and the “culture of white supremacy.”\n“As an organization that is largely white-led and that has a membership that’s predominately white, we feel it’s extremely important that we seize this moment to stand up with the organizers of the Movement for Black Lives in taking structural racism head on,” DFA executive director Charles Chamberlain told The Huffington Post on Monday. (…) DFA, which was founded by former Vermont Gov. Howard Dean (D), revealed its new criteria in a statement on its website Friday. Previously, the group has asked candidates to state their positions on LGBTQ rights, comprehensive immigration reform, making college debt-free and expanding Social Security. Candidates now must also state their position on the Black Lives Matter movement, and make clear how they plan to address structural racism and the “culture of white supremacy.” The change applies to candidates in all elections, from local to presidential.\nBlack Lives Matter has embedded themselves in a very short time into the Democrat mainstream using Occupy Wall Street style tactics and community organizing donations and muscle. This represents a significant movement by the Democrat party to the radical, militant left.\nThe Left Wants To Hide The Truth About Black Live’s Matter’s Marxist Revolutionary Agenda\nLeft-wing news source Raw Story quickly posted a response article after the show called Bill O’Reilly freaks out: #BlackLivesMatter ‘wants to tear down the country’ in an attempt to downplay the concerns of O’Reilly.\nRaw Story tries to make O’Reilly out to be a reactionary kook, freaking out about nothing and overstating his case. Note the scare quotes around the word “agitators” as they write:\nAs he did last December, O’Reilly accused the demonstrations of being orchestrated by “agitators,” noting a remark by co-founder Patrisse Cullors over the weekend that they would stage protests at next year’s Republican National Convention in Cleveland.\nIn fact, the O’Reilly segment did not go nearly far enough in exposing just how radical the Black Lives Matter movement really is.\nFor example, the O’Reilly segment mentioned nothing about the Black Lives Matter’s Marxist ideology that idolizes convicted cop killer and prison escapee Assata Shakur, a wanted criminal living in Cuba who is the first woman to make the FBI’s 10 Most Wanted Terrorist list under her real name, JoAnne Chesimard.\nThe three self-described queer founders of Black Live Matter make no real effort to hide their black revolutionary Marxist agenda and inspiration. As Breitbart News documented, Black Lives Matter pays homage to “Queen of the Black Liberation Army” Assata Shakur at every single event they do.\nThe media has simply ignored or covered up what the group believes and to do to America.\nRaw Story’s headline makes it appear that saying the group wants to “tear the country down” is crazy talk. However, Raw Story makes no mention that Breitbart News previously reported—and video proves—that Black Lives Matter founder Cullors was screaming “burn everything down” and “rise the fuck up” at the group’s recent takeover of the Netroots Nation event.\nObviously, Raw Story’s audience is not Fox News watchers so why the whitewash of Black Lives Matter for their liberal readers? The answer seems obvious: they want to hide the true face of the Black Lives Matter movement because they know it is out of step with the views of the vast majority of Americans, including most voting Democrats. If they can smear O’Reilly and Fox News in the process, all the better.\nThe reality is that Black Lives Matter is Assata Shakur’s Black Liberation Army reborn as a post-Alinksky group into the age of social media and community organizing. The leadership realizes that robbing banks gets you sent to jail or killed. Community organizing gets your money from liberal funders and the government. They don’t rob banks; they just want to see cities burned to the ground.\nSo, to answer another one of O’Reilly’s questions from the show: is this just a fringe group? In terms of ideology; yes, it is.\nAs hardcore black separatists who espouse a queer, no borders, anti-law enforcement, revolutionary Maoist political agenda, Black Lives Matter is as fringe as you can get.\nThe scary part is that the fringe group is helping set the agenda for Democrats, from tacit support from inside the White House.","url":"https://www.breitbart.com/politics/2015/08/02/what-oreillys-black-lives-matter-segment-left-out/"}
