{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:29:13","date_modify":"2018-10-30 22:29:13","date_publish":"2015-12-16 08:00:00","description":"Shortly after the new year begins, Gov. Jerry Brown will declare a special election to fill a vacant spot in the Legislature. The election will cost","filename":"data/vaneerConsumption/Whathappenswhenalegislatorquits.json","image_url":"https://calmatters.org/wp-content/uploads/ap_414837501228.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938553.html","title":"What happens when a legislator quits?","title_page":"What happens when a legislator quits? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Shortly after the new year begins, Gov. Jerry Brown will declare a special election to fill a vacant spot in the Legislature.\nThe election will cost Fresno County, one of the poorest areas of the state, more than $500,000. A small fraction of voters will likely participate, creating the potential that the seat flips parties or the winner does not reflect a heavily Latino, low-income population.\nAnd it is all caused by Democratic Assemblyman Henry Perea’s decision earlier this month to resign from office mid-term “to take a presumably high-paying job,” the Fresno Bee complained in an editorial.\n“It’s heart-wrenching to a community,” said Dillon Savory, political director for the Central Labor Council in Fresno. “You went to these people asking them to vote for you… then you back out and claim it’s for a personal reason. That’s just not good enough for people. We all have personal problems and we still go to work every day.”\nPerea declined an interview for this story. He served the public for 13 years – first on the Fresno City Council, and then in the Legislature, where he earned a high profile as the leader of a band of business-friendly Democrats. He hasn’t announced his exact plans but says he will take a job in the private sector. Though state law forbids him from becoming a lobbyist for at least one year, Assembly Speaker Toni Atkins (D-San Diego) said in a statement that Perea will “still have a voice in helping shape public policy.”\nHis decision to quit early marks an emerging trend in the Capitol: Perea is the third lawmaker in recent years to leave mid-term for the business world. In 2013, state Sen. Michael Rubio (D-Shafter) quit to do government affairs work for Chevron, and Sen. Bill Emmerson (R-Hemet) quit to become a vice president of the California Hospital Association.\nTheir resignations triggered special elections that many voters ignored. In the Inland Empire race to replace Emmerson, 19 percent of voters turned out compared with 65 percent average turnout for the last two general elections. In the Central Valley race to replace Rubio, 33 percent of voters turned out – compared with 47 percent average turnout for the last two general elections.\nVoter turnout low in special elections This chart shows average voter turnout in the 14 legislative districts in California that held special elections between 2012 and 2015.\n“These special elections give unbalanced political power to a very small segment of the electorate that turns out and votes,” said Paul Mitchell, vice president of Political Data Inc., who analyzed special election turnout.\nTurnout averaged just 16 percent in the 14 special elections California has held in the last four years to fill vacant legislative seats, most of which were caused by politicians winning a higher office. Special election turnout is especially low among people who are young, Latino or don’t own their homes, Mitchell’s analysis shows. That can favor Republican candidates, even in places where more voters are registered as Democrats. And after winning a special election, politicians gain the power of incumbency when they ask voters to re-elect them.\nWhen Rubio, a Democrat, quit his Senate seat in 2013, voters in the special election chose Republican Andy Vidak to replace him. Vidak won re-election to a four-year term a year later, even though 29 percent of the district’s Central Valley voters are Republicans and 48 percent are Democrats.\nIt’s too early to tell if the same might happen in Perea’s Fresno district, but there is concern among Democrats who would prefer to avoid the risk and the cost of a campaign. Political party registration is the same as in Vidak’s Senate district, with Democrats holding a 19-point advantage. The district is 68 percent Latino and one of the poorest in the state.\nThe likely Democratic candidate is Joaquin Arambula, a doctor who has name recognition in the district because his father was an Assemblyman. But Republicans are expected to get behind Fresno City Councilman Clint Olivier, potentially creating a competitive race.\n“The fear is that we get somebody that doesn’t represent the district’s demographics properly,” said Savory, the local labor leader.\nHe said residents are peeved about the cost of putting on a special election, which county officials say will likely cost at least $530,000 and could go higher if a runoff is necessary. The total budget for the Fresno County Clerk’s office this year is $7.4 million.\n“This is not in our existing budget,” said Fresno County Clerk Brandi Orth.\nIt takes a lot of work to put on an election when nothing else is on the ballot, Orth said. Fresno County officials will have to create ballots and voter guides, test voting equipment, send out absentee ballots, hire and train 1,500 precinct officers, find and establish 260 polling locations, deliver supplies to the polls, verify signatures and report results to the Secretary of State.\nSpecial elections cost Los Angeles County $20 million over six years, according to a bill analysis from last year. Concern over the cost of these low-turnout elections has prompted legislators to propose changes: one bill would have required the state, instead of counties, to foot the bill; another would have done away with special elections for Legislature, instead allowing the governor to make an appointment.\nBut neither proposal went very far.","url":"https://calmatters.org/articles/what-happens-when-a-legislator-quits/"}
