{"authors":["Keertana Sastry"],"date_download":"2018-10-30 23:41:39","date_modify":"2018-10-30 23:41:39","date_publish":"2014-08-13 14:03:39","description":"Guys, I'm about to state the obvious. Discovery Channel's Shark Week is just the best. Seriously, every year I wait for four events, Thanksgiving, Christmas, my birthday and Shark Week. And finally, it's here! What's more is it will answer all of…","filename":"data/vaneerConsumption/WhatDoBabyGreatWhiteSharkPupsLookLikeSharkWeekGivesUsAGlimpse.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/5ce3b4e9-932a-43b8-9919-032483ef3487.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35565-what-do-baby-great-white-shark-pups-look-like-shark-week-gives-us-a-glimpse_1540942899.html","title":"What Do Baby Great White Shark Pups Look Like? 'Shark Week' Gives Us A Glimpse","title_page":"What Do Baby Great White Shark Pups Look Like? 'Shark Week' Gives Us A Glimpse","title_rss":"NULL","source_domain":"bustle.com","text":"Guys, I'm about to state the obvious. Discovery Channel's Shark Week is just the best. Seriously, every year I wait for four events, Thanksgiving, Christmas, my birthday and Shark Week. And finally, it's here! What's more is it will answer all of your burning questions about baby Great White sharks. Finally.\nOne of the best things about Shark Week is that it not only caters to its \"I want to see badass sharks swimming around\" audience, it also educates us in the ways of the shark. How the Discovery Channel is able to find so many cool new stories about sharks is fascinating. And Wednesday night is no exception with an awesome hour-long look into the Great White shark breeding grounds entitled Spawn of Jaws 2: The Birthing.\nFirst off, can we talk about the pure awesomeness of the Shark Week video titles? Apparently the Discovery Channel Shark Week team has long brainstorming sessions to come up with these gems. This episode will answer a question I'm sure many of us didn't even realize we desperately needed answered: What do baby Great White shark pups look like? And where are their breeding grounds?\nAccording to the episode, the breeding grounds locations are a mystery until now. Dr. Michael Domeier ended last year's Shark Week by tagging a pregnant shark named Gil Rakers with the help of the late Paul Walker. Domeier will now continue this two-year long mission following the pregnancy Gil Rakers, and see where her birthing takes place to finally find the Great White breeding grounds once and for all.\nAndin Retna on YouTube\nAs for what the baby sharks look like? We've got you covered:\nOK. They actually look more like this, but wouldn't it be great if they were as cute as that baby?\nI can tell you right now without a doubt, this Shark Week special is going to be so ridiculously awesome. Last year's episode was extremely enjoyable and there's no way the dramatic follow-up, which actually includes the answers we all wanted from the two-part series, will be anything but incredible. What do baby Great White shark pups look like right as they are born? I imagine that's exactly what we'll get to find out that in Spawn of Jaws 2: The Birth. I don't know about you but I've never been more excited in my whole life. I might be afraid of sharks in real life, but during Shark Week, no animal is more fascinating.","url":"https://www.bustle.com/articles/35565-what-do-baby-great-white-shark-pups-look-like-shark-week-gives-us-a-glimpse"}
