{"authors":["Tori Telfer"],"date_download":"2018-10-30 23:04:39","date_modify":"2018-10-30 23:04:39","date_publish":"2014-08-14 13:00:03","description":"The denim maxi skirt is a freak of nature. It's designed to flow fetchingly down to your ankles as though you're the prettiest lady at the country ball, but it's made from one of the heaviest, bulkiest fabrics in the entire world. Who came up with…","filename":"data/vaneerConsumption/WhateverHappenedtoDenimMaxiSkirts4ReasonsYouShouldNeverGoThere.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/d9234764-61df-4888-b04e-4e69e13facd3.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35714-whatever-happened-to-denim-maxi-skirts-4-reasons-you-should-never-go-there_1540940679.html","title":"Whatever Happened to Denim Maxi Skirts? 4 Reasons You Should Never Go There","title_page":"Whatever Happened to Denim Maxi Skirts? 4 Reasons You Should Never Go There","title_rss":"NULL","source_domain":"bustle.com","text":"The denim maxi skirt is a freak of nature. It's designed to flow fetchingly down to your ankles as though you're the prettiest lady at the country ball, but it's made from one of the heaviest, bulkiest fabrics in the entire world. Who came up with this deplorable piece of clothing? I've been furiously scouring my local university's archives (okay, the Internet) to find the inventor of the denim maxi skirt so I can give them a piece of my mind, but they're apparently living \"off the grid,\" which makes a lot of sense given that they've done the world a grave disservice. ARE YOU THERE, INVENTOR OF THE DENIM MAXI SKIRT? IT'S ME, OUTRAGED.\nI'll be honest, the phrase \"what goes around comes around\" is lingering maliciously in my head, and all I can think is that someday I'll be wearing a denim maxi skirt and eating my words. These are the terrors that keep me up at night. But honestly, has the denim maxi skirt ever even \"gone around\" in the first place? It is, and has always been, a fashion outlier. It may have flared up a bit in the '90s, like so many other mistakes did, but it's always looked strange.\nAccording to my fashion expertise, the denim maxi can be worn in three distinct modes, which I've termed Faux-Trendy, Homeschooler, and Sorta Cowgirl. Let's start from the top.\nA Faux-Trendy denim maxi is, as the title conveys, NOT ACTUALLY TRENDY. But don't tell that to the Faux-Trendy maxi, or it'll probably cry, because it wants to be fashionable more than anything in the world. Expect patchwork, embroidery, ragged edges, different washes of denim, or all of the above. It's as though — in an attempt to declare itself modern — the denim maxi clings frantically to every trend it can possibly dream up. I can hear its frantic inner monologue now: \"Maybe if I added some leopard print on the pockets! And what about a chevron stripe along the bottom? I hear those are very fashionable these days. Ooh, and I'll embroider the phrase I'm actually a pair of skinny jeans along the tush!\"\nDon't believe me? I'll just leave these here, then:\nThe second form of the denim maxi draws much less attention to itself, because the whole point of the Homeschooler denim skirt is to be as demure as possible. This version of the maxi murmurs, \"I don't care for material things. I choose not to have a Facebook. I was raised on the prairie.\"\nThe Duggar girls often wear them, if that means anything to any of you. They're durable AND unflattering — what's not to love?\nThe third version of the denim maxi is what happens when smart, polite women decide they've always wanted to be a cowgirl and try to bring that \"Western sensibility\" into a \"modern environment.\" I'm here to tell you that the Sorta Cowgirl maxi is a mistake: Cowgirls don't wear maxi skirts, so why are y'all pairing them with cowboy boots and a Texas attitude? Honestly, I blame Ralph Lauren for this one — the dude is currently selling a denim maxi at Macy's that looks like a relic from 1994. It was originally priced for over one hundred dollars, but I guess that's because it's conveniently \"ripped, frayed and faded with a patchwork construction for a well-worn, vintage appeal.\" It's also apparently pre-wrinkled so you don't have to sit for hours on a bucking bronco to get those authentic creases!\nBy now, you're wondering, \"Is there no hope? Is there any way on earth I can bring my denim maxi into the modern age and style it the way it deserves?\"\nI'll let this young lady answer your questions for you.\nImages: LookAgainVintage (2), StacysVintageStore, rockstreetvintage, SewLoca, UpcycledBohemian, nakidbird, dinwiddies/Etsy, fashionshop088/Ebay","url":"https://www.bustle.com/articles/35714-whatever-happened-to-denim-maxi-skirts-4-reasons-you-should-never-go-there"}
