{"authors":[],"date_download":"2018-10-30 18:37:35","date_modify":"2018-10-30 18:37:35","date_publish":"2016-09-26 13:55:00","description":"A reader asks about the old cement factory near Your DeKalb Farmers Market.","filename":"data/vaneerConsumption/WhatswiththeeyesorenearDeKalbFarmersMarket.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/09/26/Videos/5141203221001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_progress-what-wi_437721644e409764362323e28b10360e__1540924655.html","title":"What's with the 'eyesore' near DeKalb Farmers Market?","title_page":"What's with the 'eyesore' near DeKalb Farmers Market?","title_rss":"NULL","source_domain":"ajc.com","text":"Welcome to \"In Progress,\" a regular column in which Becca Godwin answers reader questions about developments, mostly in Cobb, DeKalb, Gwinnett and North Fulton. Read previous editions — like this one confirming what’s going up behind the Academy Sports + Outdoors in Gwinnett — by clicking the hyperlinks at the bottom of this column, where you'll also find information for submitting your own questions. Cheers!\nReader Dale writes: \"What is going on with the old cement factory at Church and Robinson? Horrible, horrible eyesore. Half torn down, half abandoned.\"\nFirst, thanks to my fine colleague Josh Sharpe. This question was not actually submitted to me, but to him in response to his illuminating Actual Factual about the run down tower at Spaghetti Junction. I owe you a taco, Josh.\nO.K., this one was quite the puzzle, so bear with me.\nFirst, I drove out to the Scottdale area to assess the property myself Sept. 19 — during the gas shortage, mind you. Yes, that's how committed I am. Please hold applause until the end.\nI found that Dale was right. It was littered with trash, overgrown, graffitied and overall not a pretty sight for passersby, especially those running or biking on the Stone Mountain Trail right across the street. On the other side of the lot, there are railroad tracks and a DUI school. I was mentally agreeing with the reader, thinking, \"What's the deal, Dale?\"\nThen, I checked the property appraisal. It said the land is owned by Jacksons Atlanta Ready Mix Concrete Co Inc., which, other than a lawsuit from the 70s, didn't turn up much in ye olde Google search.\nBut the West Palm Beach address on the document belonged to a global building materials company called Cemex, which acquired Ready Mix USA in 2011. So I called them up, and got this statement: \"Ready Mix USA has recently agreed to work with CSX on cleaning up the site owned by the railroad.\"\nSo now CSX, the transportation network with about \"21,000 route miles of track in 23 states, the District of Columbia and the Canadian provinces of Ontario and Quebec,\" is in the equation, too.\nReady Mix. Cemex. CSX. Lots going on here.\nEnter reader Dale, who got back to me with an update Tuesday: \"Went by the property today and it was being surveyed. According to surveyors, it is owned by CSX railroad, and they are getting ready to sell it. NO idea what is going in, but I guess it would be best to wait and see.\"\nThanks, Dale. Nice job. Have you ever considered a career in investigative journalism?\nAnyway, since this whole CSX thing was checking out, I hit them up. Kristin Seay, CSX corporate communications, helped clarify some things.\n1. CSX is the property owner.\n2. Ready Mix, which leased the property from CSX until 2012, has agreed to work with CSX on the cleanup of the property — as required per the terms of that lease agreement.\nAnd most importantly:\n3. “Since the condition of the property was brought to our attention earlier this year, CSX has been diligently progressing through an extensive clean-up process. We are currently working to select a contractor for the demolition and remediation of the site. Once a contractor is selected, we will move forward with this work in a timely manner. We appreciate the community’s patience as we work as swiftly as possible to resolve this issue.” (Emphasis added.)\nSo, hurrah! Even though they didn't say what will become of the site, it's good news they're working on cleaning it up. Right?\nIn other words, hopefully this place will soon be an eyesore no more.\n__\nReporter's note: The DeKalb History Center was unable to find anything on the old cement factory, and DeKalb County did not respond to an email requesting comment about the condition of the lot.\nI, Becca Godwin, am a staff writer with the AJC and a lover of metro Atlanta. To submit “In Progress” questions, contact me at becca.godwin@ajc.com, @BeccaJGGodwin on Twitter or via the form below.","url":"https://www.ajc.com/news/local/progress-what-with-the-eyesore-near-dekalb-farmers-market/qsPGQpjBPd8HjO5lFKPr6O/"}
