{"authors":[],"date_download":"2018-10-30 14:21:18","date_modify":"2018-10-30 14:21:18","date_publish":"2016-08-19 00:00:00","description":null,"filename":"data/vaneerConsumption/WhattheheckiswrongwithJoeBidenpart1.json","image_url":"https://www.americanthinker.com/images/bucket/2016-08/196963.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_08_what_the_heck_is_wrong_with_joe_biden_part_1_comments_1540909278.html","title":"What the heck is wrong with Joe Biden? (part 1)","title_page":"Blog: What the heck is wrong with Joe Biden? (part 1)","title_rss":"NULL","source_domain":"americanthinker.com","text":"See also: What the heck is wrong with Joe Biden? (part 2) Ever since Joe Biden was selected by Barrack Obama as his running mate, the expression “one heartbeat away…” has been relegated to the mainstream media’s memory hole. Maybe it is the slender, healthful figure of the POTUS that has relegated consideration of Biden as the holder of the nuclear codes to obscurity. But I suspect that the obvious, visible, disturbing buffoonery of the man has something to do with it. Were Biden a Republican, we would hear no end of the peril of having a true weirdo potentially holding the fate of the world in his hands. In point of fact, it would be exactly like the warnings the media constantly broadcast about Donald Trump being scary. So how weird is Biden? Well, certain kinds of behavior with the female of the species are thought to indicate serious trouble with the brain wiring. Inappropriate touching, for instance.... (Read Full Post)","url":"https://www.americanthinker.com/blog/2016/08/what_the_heck_is_wrong_with_joe_biden_part_1_comments.html"}
 Hillary Clinton for the eternity of 17 seconds. Joe. Let go of me. Joe... pic.twitter.com/9x8wWUYhBd — Charlie Spiering (@charliespiering) August 15, 2016 Does he sense she is wobbly on her feet, in danger of falling?","url":"https://www.americanthinker.com/blog/2016/08/what_the_heck_is_wrong_with_joe_biden_part_1.html"}
