{"authors":["Emily Dixon"],"date_download":"2018-10-31 01:41:35","date_modify":"2018-10-31 01:41:35","date_publish":"2018-08-28 11:31:26","description":"The Great British Bake Off returns to TV tonight (August 28) but there's tragedy in the show's not so distant past. After it was confirmed in September 2016 that the show would move from the BBC to Channel 4, beloved hosts Sue Perkins and Mel…","filename":"data/vaneerConsumption/WhatAreMelSueDoingNowTheFormerGreatBritishBakeOffPresentersHaveKeptBusySinceLeavingTheTent.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/3ff00dd6-0b7e-4d97-a40d-7a37d3d49be8-getty-492011171.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_what-are-mel-sue-doing-now-the-former-great-british-bake-off-presenters-have-kept-busy-since-leaving-the-tent-10259081_1540950095.html","title":"What Are Mel & Sue Doing Now? The Former 'Great British Bake Off' Presenters Have Kept Busy Since Leaving The Tent","title_page":"What Are Mel & Sue Doing Now? The Former 'Great British Bake Off' Presenters Have Kept Busy Since Leaving The Tent","title_rss":"NULL","source_domain":"bustle.com","text":"The Great British Bake Off returns to TV tonight (August 28) but there's tragedy in the show's not so distant past. After it was confirmed in September 2016 that the show would move from the BBC to Channel 4, beloved hosts Sue Perkins and Mel Giedroyc announced their departure, alongside judge Mary Berry — and who else could deliver quite so many innuendos about buns? While replacements Noel Fielding and Sandi Toksvig have risen (sorry) to the challenge, it's hard not to miss the Bake Off originals. So what are Mel and Sue doing now?\nThe comedians have been a double act since the '80s, as Radio Times reports: they met at Cambridge University, where they were both members of comedy troupe Footlights. And Mel and Sue's first major venture post-Bake Off kept the partnership going, as they were announced in July 2017 as the hosts of the BBC's Generation Game revival. Unfortunately, the show didn't go down too well: in February 2018, the BBC announced that only two of the four filmed episodes would be aired, while the show's April debut was met with less than stellar reviews.\nAccording to the Sun, however, Mel and Sue will get another stab at reviving the classic family show. The paper reported in July that the BBC \"have booked a new filming slot\" for the show, according to an unnamed source; the source explained, \"They are going to mix things up a bit while staying true to the format. They don’t want to be remembered as the hosts of a flop, so said they were [sic] at least take part in another episode to sort out the problems.\" Looks like they'll be back on the TV together after all!\nWhat about solo ventures? Giedroyc, who co-hosted musical talent show Let It Shine with Graham Norton, is soon to take to the West End stage herself. According to What's On Stage, she'll be playing Sarah in Stephen Sondheim's Company in September 2018, at London's Gielgud Theatre. Her co-stars? Musical theatre staple Rosalie Craig, as well as the legendary Patti LuPone (Tony winner, Olivier winner, Grammy winner, everything winner). The show's set to be a pretty big deal, in other words. In April 2018, Giedroyc appeared as Beatrice in Shakespeare's Much Ado About Nothing at the Rose Theatre, Kingston; she also delivered the results of the UK Eurovision vote in May.\nAnd how about Sue? Well, Perkins has another book on the way, after her 2015 memoir Spectacles became a bestseller. East of Croydon, a travel memoir tipped for release in October 2018, is subtitled, \"Blunderings through India and South East Asia.\" It will trace Perkins' experience creating travel documentaries for the BBC including 2014's The Mekong River, during which she visited Vietnam, Cambodia, Laos, and China, 2015's documentary Kolkata, in which she explored the East Indian city, as well as 2017's The Ganges, in which she followed the sacred river through India. She'll appear at October's London Literature Festival at the Southbank Centre to promote the book; after that, she'll visit Cambridge, Leicester, and Swansea.\nPerkins is also the host of BBC panel show Insert Name Here, with team captains Josh Widdecombe and Richard Osman. The show debuted in 2016 and its third series concluded in January 2018; there's no news yet as to whether it'll be renewed for a fourth season. Her 2017 spelling bee show, The Big Spell, was cancelled by Sky1 after the first series, as the Sun reports.\nEssentially, Mel and Sue have been keeping busy since their Great British Bake Off departure, which is good news for fans of their sharp wit and enviable friendship. They'll be sorely missed in the Bake Off tent tonight, as the second series without them premieres, but their spirits still linger — and every time someone makes an inadvertently sexual comment about an innocent baked good, their presence will be felt.","url":"https://www.bustle.com/p/what-are-mel-sue-doing-now-the-former-great-british-bake-off-presenters-have-kept-busy-since-leaving-the-tent-10259081"}
