{"authors":["Marisa Lascala"],"date_download":"2018-10-30 23:38:55","date_modify":"2018-10-30 23:38:55","date_publish":"2014-08-13 15:37:50","description":"At first, the character of FBI newbie Maggie Harris on TNT's Legends doesn't seem like much of departure for actress Tina Majorino. Her job with the FBI's Deep Cover Operations team might bear some resemblance to another Majorino role: She's on the…","filename":"data/vaneerConsumption/WhatIsLegendsStarTinaMajorinoFromShesBeenthePerfectBestFriendForYears.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0c86a684-8adf-44bd-b546-841458a03a27.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35404-what-is-legends-star-tina-majorino-from-shes-been-the-perfect-best-friend-for-years_1540942735.html","title":"What Is 'Legends' Star Tina Majorino From? She's Been the Perfect Best Friend For Years","title_page":"What Is 'Legends' Star Tina Majorino From? She's Been the Perfect Best Friend For Years","title_rss":"NULL","source_domain":"bustle.com","text":"At first, the character of FBI newbie Maggie Harris on TNT's Legends doesn't seem like much of departure for actress Tina Majorino. Her job with the FBI's Deep Cover Operations team might bear some resemblance to another Majorino role: She's on the support staff, she's working with tech — she's basically Majorino's Veronica Mars character, Mac.\nThe Grey's Anatomy, True Blood, and Big Love star admits the similarities herself. \"There are really obvious comparisons,\" she noted during the San Diego Comic-Con. \"But the difference for is, I love Mac the character so much because she's very rebellious but fully herself and her true nature is just to go against the grain and do what she has to do and stand up for her friends and cause trouble sometimes. With Maggie, Maggie is highly-trained…She's part of the support staff, so she's helping set up these deep cover operations and trying to keep agents safe, so there's not really room for that rebellious nature.\"\nReally, the biggest difference between Veronica Mars and Legends will be the lack of friendship that binds the team together. After all, if everyone is keeping their true identities a secret, how can they ever form that kind of bond?\nIt's a shame, because Majorino excels at embodying the perfect best friend. Her characters are fiercely loyal, but they're always their own, fully realized people who draw the line when it needs to be drawn. Majorino can be sweet, she can be tough — she's basically the ideal best friend.\nAlso, can we talk about that Legends haircut for a second? It's amazing. It could be very Henry-Spencer-from-Eraserhead, but she rocks it like only a cool chick can. Besides pulling off a hairstyle you'd never dare, here are some other ways Tina Majorino embodies the perfect BFF.\nShe's Good to You, Even When You Don't Deserve It\nOn the 10th anniversary of Napoleon Dynamite, we can safely say that Napoleon is pretty hard to be friends with. And yet Deb, with her relentless positive attitude, is able to see past Napoleon's pricklier parts and bring out the best in him. (And Uncle Rico, too, snapping a good photo of him by telling him to imagine he's \"weightless, in the middle of the ocean, surrounded by tiny little seahorses.\") And yet, she's the first to call out Napoleon when his behavior crosses the line. Still, the little smile she gives him at the end of the film, followed by their adorable game of tetherball, packs the biggest emotional punch in the movie. And, since we're on the subject of difficult hairstyles, just look at Deb's hair. She spends most of the movie sporting a pretty cute side ponytail.\nShe's a Constant\nOn Veronica Mars, Veronica's relationship with Piz had its ups and downs. Logan came and went (and came back, and left again, and came back again, and so on). But Mac, Veronica's hacker best friend, was always there, willing to help Veronica out of a jam. It didn't matter if Veronica was pining over an ex-boyfriend (followed by mooning over an ex-boyfriend, followed by seething over an ex-boyfriend, etc.), solving a case, or poking at the perfect façade created by the monied denizens of Neptune — Mac always had Veronica's back, and always with a clear head — and maybe a techie trick or two up her sleeve, too.\nEven IRL, She's Endlessly Supportive\nHandout/Getty Images Entertainment/Getty Images\nJust ask Rob Thomas, the creator of Veronica Mars. Thomas likes to tell the story of how they met, when Majorino was taking a break from acting and Thomas was a novelist who'd written Rats Saw God. She contacted him to interview him for a book report, but then wound up giving him career encouragement. According to Texas Monthly, Thomas had no idea how much of a veteran she was.\nOne of her questions was, \"What do you want to do next?\" I replied that I was hoping to transition into the TV and film business. She responded that she'd done some film work herself.\n\"A girl with big dreams of being an actress! How sweet!\" I thought to myself. \"I should say something encouraging!\"\nI wrote back asking her, politely I hoped, what movies she'd been in.\n\"Waterworld,\" she wrote. \"Corrina, Corrina. When a Man Loves a Woman.\"\nShe was very sweet, though. She told me I should keep chasing my dreams.\nWho wouldn't want a Majorino of her own around, always encouraging you to keep chasing your dreams?\nImages: Doug Hyun/TNT; aleriehightower /Tumblr; Giphy (2); GillianJacobs/Tumblr; Getty","url":"https://www.bustle.com/articles/35404-what-is-legends-star-tina-majorino-from-shes-been-the-perfect-best-friend-for-years"}
