{"authors":[],"date_download":"2018-10-30 18:37:39","date_modify":"2018-10-30 18:37:39","date_publish":"2017-03-06 20:24:00","description":"Reader Kathy asks: What's being built at the corner of Woodstock Road and Canton Street in Roswell? It looks big!!","filename":"data/vaneerConsumption/WhatsgoingupatWoodstockandCanton.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/06/Images/vicker's.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_actual-factual-f_650a9043543677651199924beabfc9fb__1540924659.html","title":"What’s going up at Woodstock and Canton?","title_page":"Actual Factual N. Fulton: What’s going up at Woodstock and Canton?","title_rss":"NULL","source_domain":"ajc.com","text":"Welcome to \"Actual Factual,\" a regular column in which I, Becca Godwin, answer reader questions about goings-on in north Fulton. Here's one I did recently about where is the planned Aldi in Roswell going?\nNow that you're familiar, you'll find information for submitting your own questions at the bottom of this column.\nReader Kathy asks: What's being built at the corner of Woodstock Road and Canton Street in Roswell? It looks big!!\nThe property under construction at 1180 Canton St., where an auto repair shop used to stand, is a mixed-use development known as Vickers Village.\nCity council approved a three-story building with 79 residential units and 8,000 square feet of commercial office or restaurant space in June 2015.\nThe proposal for the multifamily development in the historic district inspired strong reaction from residents; many spoke out in support and opposition at a city meeting in 2015. Some thought it was just what the area needed, while others said the complex would be too dense for the city.\nDetails on exactly what to expect are scarce. The developer — King Lowry Ventures — did not immediately return requests for comment Monday, and Vickers’ website isn’t all that forthcoming.\nBut it does tell us a few things: It’s a “boutique collection of one, two and three bedroom residences for lease,” commercial space is available and it’s “delivering fall 2017.” It’s probably safe to assume that means “opening.”\nI, Becca Godwin, am a staff writer with the AJC and a lover of metro Atlanta. To submit “Actual Factual” questions, contact me at becca.godwin@ajc.com, @BeccaJGGodwin on Twitter or via the form below. Please include as much information as possible, including which city your inquiry regards. Thanks.","url":"https://www.ajc.com/news/local/actual-factual-fulton-what-that-corner-canton-street/cRYuvwholm4eh8G9kBiPsM/"}
