{"authors":["Shea Simmons"],"date_download":"2018-10-31 01:44:58","date_modify":"2018-10-31 01:44:58","date_publish":"2018-08-27 20:32:11","description":"If you're an avid celebrity stalker, you may have noticed something odd popping up on some of your favorite celebrities' Instagram feeds lately. Extreme body modifications on celebrities like Kim Kardashian and Chrissy Teigen are surfacing, but…","filename":"data/vaneerConsumption/WhatIsAHumanHeresWhyKimKardashianChrissyTeigenSuddenlyLookLikeAliens.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/b40f501d-ebdb-478b-8cdc-5b5e497deab6-5147bc47-a9fc-4c3e-a6d7-0df0240e84b7-img_1483.PNG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_what-is-ahuman-heres-why-kim-kardashian-chrissy-teigen-suddenly-look-like-aliens-10253213_1540950298.html","title":"What Is #AHuman? Here's Why Kim Kardashian & Chrissy Teigen Suddenly Look Like Aliens","title_page":"What Is #AHuman? Here's Why Kim Kardashian & Chrissy Teigen Suddenly Look Like Aliens","title_rss":"NULL","source_domain":"bustle.com","text":"If you're an avid celebrity stalker, you may have noticed something odd popping up on some of your favorite celebrities' Instagram feeds lately. Extreme body modifications on celebrities like Kim Kardashian and Chrissy Teigen are surfacing, but what's it for? Art exhibit A. Human is transforming celebrities using prosthetics, and if this is a marketing strategy for the exhibit, well, it's working.\nOne of the latest celebrities to participate in the viral A. Human takeover is Kim Kardashian. On Monday, the reality TV star and KKW Beauty mogul took to her Instagram account to debut what appeared to be an extreme body modification around her neck. The thick, chain-like design encircling her glowed from beneath her \"skin\" to the beat of her heart. At the end of her story, Kardashian thanked A. Human for the body mod as if it were simply a design piece.\nShe's not alone, either. Chrissy Teigen also took to her Instagram stories to showcase wings sprouting from her chest and rising to her collarbones in a look that was somehow both angelic and grotesque. Queer Eye's resident fashion guru Tan France has also been transformed by the minds of A. Human. His ruffled neck modification is being framed as a fashion piece on his Instagram account with France writing, \"I was lucky enough to get an exclusive glimpse of A. Human’s new collection, and it looks like I’m taking something home.\"\nA. Human, however, is not the latest design house to take over celebrity culture.\nA. Human is an interactive, hybrid art and entertainment exhibit being framed on social media as a collection of designs for New York Fashion Week, which it's not. It's simply an exhibit, but it's one that raises questions particularly about self-expression and the consumption of images and beauty. It's stated purpose, though? To look at what a future where body modification is normal means for self-expression, particularly as it relates to the body, fashion, and in turn, beauty standards.\nCreating the exhibit is Society of Spectacle, an entertainment brand created by founder of Command PR, Simon Huck. For the event, set to begin during New York Fashion Week, Huck has teamed up with designer Nicola Formichetti and makeup artist Isamaya Ffrench to create a space in which attendees will get to see and interact with the modifications as if they were part of a real fashion house.\nSpeaking to Vogue, Huck explained his desire to create A. Human stemmed from a wish to see the future not as a dystopia but also not as a utopia. Instead, he explained that A. Human's emotional tether is to a world of optimism or neutrality, but certainly not to the dystopian idea he appears to suggest most people see coming.\nThe real question, however, is whether or not A. Human will achieve this. With the exhibit framed as a fashion collection, the subject matter inherently raises questions about commodifying bodies as if they were clothing, about whether a future filled with body modifications would only lend itself to visible classism where the design brand you wear is no longer sartorial but physical.\nA. Human is disturbing visually already with many commenting on France's post with near revulsion, but others seeing the piece as the next step in fashion. The choice to bring in celebrities, particular a model like Teigen, a fashion guru like France, and a style icon like Kardashian, as a way to market the designs (which ultimately markets the event) suggests a fixation on images as a means creating social interaction.\nUltimately, the questions of A. Human will be answered by those who attend the exhibit and experience the \"body modifications\" first-hand.","url":"https://www.bustle.com/p/what-is-ahuman-heres-why-kim-kardashian-chrissy-teigen-suddenly-look-like-aliens-10253213"}
