{"authors":["Megan C. Hills"],"date_download":"2018-10-31 01:38:22","date_modify":"2018-10-31 01:38:22","date_publish":"2018-08-28 15:51:01","description":"Fire up those ovens and start greasing your pans — The Great British Bake Off is officially back. Now that the beloved baking show has settled into its new home on Channel 4, I’m super excited to see what cake-related drama the show has in store for…","filename":"data/vaneerConsumption/WhatsThePrizeForWinningTheGreatBritishBakeOffItsReallyNotWhatYoudExpect.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/e686fb30-b7d3-46e8-b788-2f0c27fc019d-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_whats-the-prize-for-winning-the-great-british-bake-off-its-really-not-what-youd-expect-10357099_1540949902.html","title":"What's The Prize For Winning 'The Great British Bake Off'? It's Really Not What You'd Expect","title_page":"What's The Prize For Winning 'The Great British Bake Off'? It's Really Not What You'd Expect","title_rss":"NULL","source_domain":"bustle.com","text":"Fire up those ovens and start greasing your pans — The Great British Bake Off is officially back. Now that the beloved baking show has settled into its new home on Channel 4, I’m super excited to see what cake-related drama the show has in store for Series 9. Channel 4 has already released the names of the baking hopefuls keen to prove themselves in the big white tent, however, one glaring question that hasn’t been addressed is: what is the prize for winning The Great British Bake Off? I did some digging and to be honest, well, the truth is pretty underwhelming.\nAfter enduring the #AlaskaGate trials and Lion Bread tribulations, it turns out that apparently, Bake Off contestants face off in order to win — drum roll please — a cake stand and flowers. No big prize money, no cook book deal, just a stand and a bouquet according to the Metro.\nI reached out to a Channel 4 rep for comment regarding the rather anti-climax prize up for grabs, however, they haven't got back to me just yet.\nTo be Frank, I'm genuinely shocked to learn that this is the prize. I mean, really? It’s pretty wild when you think about it, given that literally millions of people tune in to watch the show every season. And then, when you take into consideration just how much the show’s bakers have to go through in order to get to the final, let alone actually win, surely they deserve more than that?\nBack in 2014, former Bake Off contestant Martha Collison opened up about the show's prize. She told The Sun: \"Everyone is so surprised and thinks there must be some secret cash, but all we really get is a bunch of flowers and a cake stand.\" However, she explained there were some serious perks to doing the show, excluding the underwhelming prize. \"You also kind of become a national treasure just by doing it because everyone in Britain loves the bake off so much,\" Collison added.\nKind of a bummer TBH. Then again, I have a feeling that if the show worked in a huge cash prize, then it could change the sweet and gentle dynamic of the series; which is one of its biggest selling points in my opinion.\nStuart C. Wilson/Getty Images Entertainment/Getty Images\nEven though there isn’t an actual prize, Bake Off has actually helped launch the illustrious careers of previous winners, and this year’s winner could be make a pretty penny if they play their cards right.\nFor example, 2015’s winner Nadiya Hussain has done incredibly well since she was crowned champion by Paul Hollywood and Mary Berry. She used her newfound success to secure cookbook deals, shows with the BBC, a column with The Times magazine, and also occasionally makes appearance on The One Show for presenting gigs. And that’s just the tip of the iceberg. She also snagged the biggest job any British baker could ever hope for; baking the Queen’s 90th birthday cake. I know.\nChannel 4 on YouTube\nLast year, Hollywood and new judge Prue Leith chose Sophie Faldo as their winner. She has since secured her own cook book deal, a TV series, and has launched her own baking website. not bad, eh?\nSeries 9 of The Great British Bake Off drops tonight at 8 p.m. on Channel 4.","url":"https://www.bustle.com/p/whats-the-prize-for-winning-the-great-british-bake-off-its-really-not-what-youd-expect-10357099"}
