{"authors":[],"date_download":"2018-10-30 21:15:35","date_modify":"2018-10-30 21:15:35","date_publish":"2015-08-15 20:44:52","description":"I just came off stage at the Society of Professional Journalists' Airplay conference in Miami, Florida where we were discussing the failure of the press |","filename":"data/vaneerConsumption/WhatIMeantToSayAtSPJAirplay.json","image_url":"https://media.breitbart.com/media/2015/08/Screen-Shot-2015-08-15-at-16.43.141.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_15__1540934135.html","title":"What I Meant To Say At SPJ Airplay...","title_page":"What I Meant To Say At SPJ Airplay... - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"I just came off stage at the Society of Professional Journalists’ Airplay conference in Miami, Florida where we were discussing the failure of the press to report on #GamerGate fairly. Multiple bomb threats were called in to stop this event about ethics in journalism from proceeding.\nHere are my prepared remarks, only some of which I managed to get to on stage.\nHi, I’m Milo Yiannopoulos. I’m an author, broadcaster, journalist and satirist and I’ve been covering GamerGate closely, and I guess become part of the furniture, since this time last year.\nBut there’s one important thing that separates me from GamerGate, and it’s not the accent or the hair.\nIt’s my politics. Unlike the rest of GamerGate, I’m happy to admit I’m a pretty conservative guy. And I’d be lying if I said I didn’t recognise the potential of GamerGate to give the left a bloody nose when in August 2014 I was approached by Allum Bokhari, now my colleague at Breitbart, with the story.\nBut I quickly realised this wasn’t a left-right thing at all. It’s more about nannying pearl-clutchers with bully pulpits in the media versus decent, ordinary people who just want to be left alone. Authoritarianism versus libertarianism, if you like. And the extraordinary lengths authoritarians will sometimes go to in order to impose their will on others – even about something as apparently trivial as the humble video game.\nGamerGate is wrongly called a conservative movement simply because the only journalists willing to cover it fairly, or to give the movement time of day, were classical liberals, for whom there is really no home in the modern progressive left. That was another realisation that stung GamerGate supporters, who even now think of themselves as reflexively left-wing, despite what the liberal media has done to them.\nThe fact is, I wouldn’t be here if gaming journalism hadn’t made me necessary. I’m not a professional games critic. I’m a student, if you like, of internet cultures. But there would have been no space for me in this debate had the press covered this story fairly or responsibly. You might say my position in GamerGate and reputation among gamers generally is a creation of Kotaku and Polygon.\nGamerGate is remarkable—and attracts the interest of people like me—because it represents perhaps the first time in the last decade or more that a significant incursion has been made in the culture wars against guilt-mongers, nannies, authoritarians, gender activists, faux academic bloggers in places like Gawker, Vox and Buzzfeed and troublesome agitators of all descriptions.\nSo that’s what excited me originally. I didn’t have it in for feminists or anything like that, at least not really. But perhaps, mostly as a result of GamerGate, I sort of do now.\nGamers have no social capital. In fact it’s worse than that: everyone hates them. The Right hates gamers because it blames games for real-world violence. The Left now hates them because progressives have come to accuse video games, bizarrely, of somehow being able to make people sexist.\nWhat makes this scandal on the one hand a great story but on the other genuinely tragic and upsetting is that it represents not a culture clash but a kind of geek civil war. The people on either side of this debate are remarkably similar, and closer to one another than either group is to the rest of us.\nThat’s why it hurt GamerGate and anti-GamerGate to see their favourite celebrities start to pick sides. This was a family argument that became public and then escalated out of control.\nBut it was a family argument created by bad journalism. Bad journalism didn’t just report on GamerGate in all the shoddy and unacceptable ways you’ve already heard about. Gaming journalism started the whole schism in the first place, by insulting and ridiculing readers and handing its moral compass over to highly questionable people with axes to grind and wacky activist politics designed to divide.\nThen it drove a wedge down the middle of its own base of readers by cruelly, and in the absence of fact or justification, calling one side the most appalling names, while credulously, assiduously and reflexively supporting some of the most obviously and ostentatiously unreliable people in the history of journalistic sourcing.\nEven worse, the war was precipitated by people who don’t even play, or much care about, video games. Anita Sarkeesian admits, in footage you can find online but she’ll never acknowledge, that she’s not a gamer and doesn’t particularly like video games. That story changed dramatically when she was given space in the New York Times. She suddenly remembered a whole childhood she’d previously forgotten about in which not only was she a GameBoy addict but she was also, implausibly, very much aware of how Tetris was, like, really male-oriented. Or something, who knows.\nThe people GamerGate calls “social justice warriors” – the feminist activists, bloggers and so on – annoy gamers in part because so few of them really give a damn about gaming. Some call themselves “developers” without having ever released anything of substance. The press doesn’t know, and doesn’t bother to find out, how credible these claims are.\nWhen GamerGate gave birth to a now-infamous Law and Order: Special Victims Unit episode, it wasn’t gamers who’d wet the bed. It was journalists. That hour of television did more to damage the image of the gaming industry than anything gamers had ever done. And the media made it happen.\nIt also reinforced the most persistent myth in all of this: that gaming is a terrible place for women to be. Now, I can’t tell you the pathology that leads some of the most female and minority-friendly spaces in the world to become guilt-ridden and obsessed with diversity, quotas and inclusion.\nBut I’ve seen it before. I started my reporting career in the startup world – London and Silicon Valley – and the same is true of the Facebooks, Twitters and Snapchats of this world. They’re some of the best places you could ever get a job as a woman. But for some reason the startup industry, just like gaming, is convinced that there’s an epidemic of violent misogyny. It’s just not true.\nYet that Law and Order episode gave the impression to women that gaming was a hostile place for them to be. Most women aren’t strident gender activists brandishing placards and blog posts about micro-aggressions.\nIf they hear an industry is a terrible place to go for women, they’ll simply quietly avoid it. That’s what gaming journalism has achieved through a combination of negligence and malice: it has convinced the world that gaming is a scary place for a woman to be. I’ve received I would estimate between 50 and 100 emails from women , in gaming, female critics of the gender warriors, saying that’s simply not the industry they wake up to every day.\nSo journalists are doubly responsible in the case of GamerGate, both for creating the situation in the first place and then constantly inflaming it.\nSpecifically, I think gamers were subjected to six unacceptable journalistic injustices.\nThe worst elements in GamerGate were taken as prima facie evidence of what the authentic heart of the movement was like. We don’t do that for any other movement, whether Occupy, Black Lives Matter or even, when you think about it, Islamic terrorism. Only GamerGate.\nWorse, uniquely to GamerGate, there is no evidence that these “worst elements” were even part of the movement, had anything to do with it, knew any of the people driving the movement, or believed in its objectives. Both sides have admitted that third-party trolls have been active throughout. But only anti-GamerGate is given the benefit of the doubt. Why?\nGamerGate, again, uniquely in the history of hashtag movements, was never given the right to defend or define itself. We bend over backwards to describe Occupy and Black Lives Matter in terms acceptable to those movements – to give them self-determination and agency. That was denied to GamerGate, because the subject at hand was press ethics, and journalists didn’t want to admit they had a point\nBased on my year of reporting on this subject I believe some journalists in the gaming industry actively suppressed evidence – facts they must have known about – in order to present a narrative that did not cohere with reality. They systematically ignored not just the stated objectives of the movement but evidence that GamerGate supporters were being subjected to bullying, harassment, doxing, swatting, threats and even real-life intimidation. It’s now well known that I had an unsheathed syringe, a dead animal and a razor blade in the mail. Kotaku had to be publicly shamed into acknowledging any of this. If my reporting had been sympathetic to the other side of the debate, it would have been headline news. For those who like to keep score, it’s also worth remembering that the only bomb threat considered credible by the police in the history of GamerGate wasn’t directed at Anita Sarkeesian, but against a well-mannered meetup of gamers I organised in Washington DC.\nGamerGate victims have been subjected to a class war they didn’t want and didn’t start. Journalism is supposed to give a voice to the voiceless. In this instance it failed completely to identify the real victims and went on a crusade against an innocent party.\nFinally, as we’ve seen from the GameJournoPros revelations, journalists actively conspired with one another to shift the Overton window dramatically on this subject, making it professionally dangerous simply to report facts, as they had been doing for a decade on related subjects. As journalists, we have a word for environments in which it is dangerous to report true facts or question the establishment consensus, don’t we?\nWith GamerGate, Conservatives missed an opportunity to explore a new front in the culture wars because it didn’t have the courage to consider whether its history of demonising video games might have been a mistake.\nAnd progressives screwed up by allowing narrative to triumph over fact. We’ve seen elsewhere – in Rolling Stone, the Duke Lacrosse case and the case of Mattress Girl Emma Sulkowicz, the devastating consequences that can have.\nJournalists lost sight of who the powerful and who the powerless were in this debate. They mistook the double-speak and grievance culture of professional activists for women in need, and accepted that a disproportionately male culture simply must have something wrong with it.\nThis shames our profession greatly. If the future of journalism is picking a side before the facts are in and wantonly, wilfully, mercilessly bullying other people – if it’s activism over fact-based reporting – then I’m out. I’ll go be a comedian or a hair salon receptionist or something.\nGreat art asks questions. It provokes and challenges us.\nArt is not circumscribed by one person’s hurt feelings or opinion on what might be “harmful.” All GamerGate is asking for is the right to pursue its own truth and, sure, it’s own pleasure, in its own way.\nBut when a small but tight-knit cabal of people, all of whom think identically, all of whom are determined to defame ordinary consumers and become professional nuisances to the industry they profess to love, the chilling effects can be devastating.\nThat’s what happened here. And it’s a testament to the extraordinary, brilliant resilience of gamers that a year on, despite every conceivable bad word being hurled at them, they remain unbowed. Today, they’re asking you to look again.\nGaming culture is messy, and sarcastic, and full of bitching and banter and backstabbing and memes and one-upmanship. It’s also precious, and fragile, and desperately important for the many marginalised voices and people who depend on it for safety and security.\nSome of those marginalised people don’t look like you think they will. But that doesn’t mean they don’t rely on the culture they’ve built to sustain, nurture and protect them. Gaming culture is its own unique kind of safe space. And journalists should be exploring and celebrating that, not callously and mendaciously attempting to destroy it.\nFollow Milo Yiannopoulos (@Nero) on Twitter and Facebook. He’s a hoot! Android users can download Milo Alert! to be notified about new articles when they are published.","url":"https://www.breitbart.com/politics/2015/08/15/what-i-meant-to-say-before-that-bomb-threat/"}
