{"authors":[],"date_download":"2018-10-30 14:35:04","date_modify":"2018-10-30 14:35:04","date_publish":"2015-03-18 00:00:00","description":null,"filename":"data/vaneerConsumption/WhatwillBibisnewgovernmentlooklike.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_what_will_bibis_new_government_look_like_1540910104.html","title":"What will Bibi's new government look like?","title_page":"What will Bibi's new government look like?","title_rss":"NULL","source_domain":"americanthinker.com","text":"What will Bibi's new government look like?\nAs Bibi declares victory, here is how he could cobble together his coalition government. Keep in mind that he would need the support of more than 60 members of Israel’s 120-member Knesset. According to the exit polls, Netanyahu would start with 27 seats in his Likud party. The same total would obtain for opposition leader Herzog. What gives Netanyahu a better crack is that he can play an easier card in lining up other parties to round the necessary 61-plus Knesset seats.\nBibi’s likely coalition: Likud’s 27 seats. Yissrael Beitenus, 5. United Torah Judaism, 6. Shas, 7. Jewish Home, 8. So far he’s got only 53 seats. But there are a couple more candidates to put Bibi over the top: Kulanu (a breakaway from Likud), 10. That would be sufficient. The magic number would by 63. Or instead of Kulanu, Yesh Atid, a secular centrist party that would not be welcomed by United Torah Judaism or other religious parties, 12. With Yesh Atid, Bibi would have 65 Knesset members. With Kulanu and without Yesh Atid, his winning total would be 63. With both Yesh atid and Kulanu, Bibi’s total would rise to 75 – a solid government base. Turning to Herzog’s Zionist Union, Herzog also would start with 27 seats. To forge a government, he would also have to corral Yesh Atid, 12; Kulanu, 10; and Meretz, 5 for a grand total of 54 – seven seats short of the magic number 61. The only way Herzog can go over the top is to add the Arab Joint List, which assembled four Arab factions with a combined total of 13 seats. With the Arab bloc, Herzog could form a government with 67 Knesset seats. But only with Arab support. In contrast, Bibi could form a government without Arab members. A third possibility: a unity government, with Bibi’s 27 Likud seats and Herzog’s 27 Zionist Union seats, to reach 54. To reach 61, Bibi and Herzog would have plenty of options to find the final 7 Knesset members for such a marriage of center-left and center-right. However, it’s a scenario Netanyahu doesn’t seem t be too enthusiastic about. Leo Rennert is former White House correspondent and Washington bureau chief of McClatchy Newspapers.","url":"https://www.americanthinker.com/blog/2015/03/what_will_bibis_new_government_look_like.html"}
