{"authors":[],"date_download":"2018-10-22 21:07:49","date_modify":"2018-10-22 21:07:49","date_publish":"2014-06-04 12:28:24","description":"A gustnado is a weak, short-lived tonado-like vortex produced by the winds of a thunderstorm.","filename":"data/vaneerConsumption/WhatIsaGustnadoTornadoLiteitTurnsOut.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/486436/f_os_gustnado_140604_16b9fd557d4170b7aa5654d8f60c7bff.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_weather_what-gustnado-tornado-lite-it-turns-out-n122151_1540242469.html","title":"What Is a 'Gustnado'? Tornado Lite, it Turns Out","title_page":"What Is a 'Gustnado'? Tornado Lite, it Turns Out","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMove over polar vortex, there's an ominous new weather term in town.\nStorm chasers captured video of a \"gustnado\" in Seward, Nebraska, on Tuesday. The weather event accompanied baseball-sized hail and reports of 12 tornadoes in Nebraska, Kansas, Iowa and western Wyoming.\nA \"gustnado\" is a meteorological term for a weak, short-lived, tornado-like vortex produced by the heavy winds of a thunderstorm, according to Weather.com.\nGustnadoes \"may be accompanied by rain, but usually are 'wispy', or only visible as a debris cloud or dust whirl at or near the ground,\" according to the National Weather Service.\nGustnado wind speeds can reach up to 80 mph and result in significant damage, although they are not considered tornadoes, according to the National Weather Service.\nWhile tornadoes are possible across a large stretch of the Midwest and parts of the Mississippi River Valley Wednesday, gustnadoes are not expected, meteorologists predicted.\n— Elisha Fieldstadt","url":"https://www.nbcnews.com/news/weather/what-gustnado-tornado-lite-it-turns-out-n122151"}
