{"authors":[],"date_download":"2018-10-22 21:33:16","date_modify":"2018-10-22 21:33:16","date_publish":"2014-06-05 13:08:43","description":"What does this all mean for the military prison at Guantanamo Bay, Cuba? To us, that’s the big story that many are missing here.","filename":"data/vaneerConsumption/WhattheBergdahlStoryisReallyAboutGitmo.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/489261/140312-gitmo_2_2ca02491c92048d30396e2629e0863d9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_what-bergdahl-story-really-about-gitmo-n123391_1540243996.html","title":"What the Bergdahl Story is Really About: Gitmo","title_page":"What the Bergdahl Story is Really About: Gitmo ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWhat the Bergdahl story is really about: The Guantanamo prison\nLost in all the back-and-forth over Bowe Bergahl -- Was he a deserter? Did the Obama administration break the law? Why did some conservatives once demand his release and now oppose it? And was Bergdahl even worth it? -- comes this more important question: What does this all mean for the military prison at Guantanamo Bay, Cuba? To us, that’s the big story that many are missing here. Yesterday in her press briefing, State Department spokeswoman Marie Harf suggested something ON THE RECORD that had been hinted at OFF THE RECORD or ON BACKGROUND for days: that the five Taliban prisoners who were released in exchange for Bergdahl were probably going to be released anyway, because they weren’t among those who were slated for prosecution. “There are three buckets of people in Guantanamo that remain,” Harf said. “There are those who are approved for transfer. That’s 78. There are about 30 who have been referred for prosecution in some way. These five are in that middle bucket and were unlikely -- might have been, but unlikely -- to be added to the group that was going to be referred for prosecution. So it is quite likely that eventually, in line with our commitment to close Guantanamo Bay, they would be transferred.” Harf said later, “We should get something for them.”\nTime: How the Bergdahl story is a fitting end to the Afghanistan war\nSo there you go… The Obama administration’s rationale for all of this may have simply been about starting the process of emptying Gitmo. And it certainly now appears that among the reasons the White House decided to set up a Rose Garden announcement last weekend was about trying to deflect the start of the Gitmo debate -- by focusing attention on Bergdahl. Of course, the focus on Bergdahl become the story. By the way, a tip of the hat to Time’s David Von Drehle, who is using the Bergdahl debate to note how it’s a fitting end to the war in Afghanistan. Nothing’s ever been clear cut about this war, nothing’s ever been black and white (victory or defeat); worth it or not worth it; so of course even this story becomes complex.\nLindsey Graham warns Obama could be impeached if he releases more Gitmo prisoners without Congress’ approval\nIf the Obama White House wants to close Gitmo -- or at least transfer the prisoners who aren’t going to be prosecuted -- it’s not going to be easy. The Hill: “Sen. Lindsey Graham (R-S.C.) warned Wednesday that Republican lawmakers would call for President Obama’s impeachment if he released more prisoners from Guantanamo Bay without congressional approval. Republicans worry Obama may try to shut down the prison camp unilaterally after congressional opposition has repeatedly stymied efforts to pass legislation to close it. ‘It’s going to be impossible for them to flow prisoners out of Gitmo now without a huge backlash,’ Graham said. ‘There will be people on our side calling for his impeachment if he did that.’” Now remember, this could be Primary Lindsey talking (his primary race is on June 10). But his comments are a warning that closing Guantanamo -- even half of the way -- will be a political challenge for the administration. At some point, the president is going to get asked about whether he plans to expedite the emptying of Gitmo; it’s a question he has NOT answered in a while.\nObama vs. Putin takes center stage\nOverseas tonight, President Obama has an early dinner with French President Hollande, and then Hollande has a later dinner with Vladimir Putin. It’s not too dissimilar from someone having to spend different Thanksgiving dinners with a set of divorced parents. By the way, the French claim he’s having DINNER with Obama and SUPPER with Putin. So there! Speaking of Putin, don’t miss his dig at Hillary Clinton. “Russian President Vladimir Putin took jabs at Hillary Clinton’s gender in response to her own statements where she likened the man’s actions to that of Adolf Hitler,” the New York Daily News says. “‘It’s better not to argue with women,’ Putin said in an interview recorded Tuesday with a French television station and posted as a transcript on the Russian President’s website. ‘But Ms. Clinton has never been too graceful in her statements.’” By the way, NBC’s Brian Williams will interview President Obama from Normandy on Friday.\nThe weird Mississippi Senate race gets weirder\nIf you thought the Mississippi Senate GOP primary (and now runoff) couldn’t get any weirder -- especially after the arrests from photographing Sen. Thad Cochran’s bedridden wife -- think again. “The Hinds County Sheriff's Department is investigating why three people, including a high-ranking Chris McDaniel campaign official, were found locked in the Hinds County Courthouse in Jackson hours after an election official says the building was closed early Wednesday morning,” the Jackson Clarion-Ledger reports. “Hinds County Sheriff's Department spokesman Othor Cain said investigators are trying to figure out how Janis Lane, Scott Brewster and Rob Chambers entered the courthouse. They were inside until about 3:45 a.m., Cain said. Brewster is a former coordinator of presidential candidate Newt Gingrich's Mississippi operation and is currently McDaniel's campaign coalition coordinator.” The Cochran camp is trying to use this additional story as more evidence that McDaniel is a ticking time bomb for the GOP; he can’t handle his supporters and that he will somehow implode by November (a la O’Donnell, Angle, Akin, etc). The Cochran camp is VERY nervous that some key allies are about to give up; they are now hoping these new weird allegations will reinvigorate key establishment groups to stick by him for three more weeks. We’ll see if that charge sticks…\nHinds County GOP chair speaks to NBC News\nMeanwhile, NBC’s Kasie Hunt spoke to Pete Perry, the chairman of the Hinds County GOP. He says that he received a call around 2:00 am, as he was getting out of his car at his home, from Janis Lane, the leader of the Central Mississippi Tea Party. She told him that she and a female friend were locked in the Hinds County Courthouse, near the state Capitol building in Jackson. Hinds County was one of the last counties to report election results Tuesday night; at the courthouse, ballots were locked away in a vault in the clerk's office while ballot boxes were stacked in an open hall. Perry says that Lane explained that she and her friend had gone down to the courthouse to see ballots being counted, had encountered a uniformed officer and been directed to a door that was open. When they walked in the door, it shut behind them and they were locked in. He says that he called the sheriff's office, explained what had happened and helped convince them to go and help let them out. Perry says that anyone locked in the open areas of the building would have had access to the ballot boxes, but not to actual ballots.\nMcDaniel camp: All we were trying to do is count the number of outstanding ballots\nA McDaniel spokesman gave this statement to NBC News: \"Last night with an extremely close election and Hinds being one of the last counties to report, our campaign sent people to the Hinds courthouse to obtain the outstanding numbers and observe the count. In doing so, they entered the courthouse through an open door after being directed by uniformed personnel. They were then locked inside the building. At this point they sat down and called the county Republican chairman, a close Cochran ally, to help them get out. Eventually a Sheriff's officer showed up and opened the door to let them out.\"\nLindsey Graham almost at 50%, per new poll\nFor next week’s marquee South Carolina Senate primary, a new Clemson poll shows Sen. Lindsey Graham (R-SC) at 49% among likely GOP primary voters -- just one point away from the 50% threshold he needs to cross to avoid a runoff. So he’s right on the edge. Remember, all bets are off for him if he can’t avoid a runoff.\nBraley camp tries to define Ernst after her primary win\nAs we wrote yesterday, the Bruce Braley-vs.-Joni Ernst Senate contest in Iowa has emerged as a top-tier race for this November. And just hours after Ernst won the GOP nomination, the Braley campaign is up with a TV ad defining her for the general election. Playing off Ernst’s pig-castration TV ad, the Braley spot goes, “We’ve all heard the one about pigs squealing, but when Joni Ernst had the opportunity to do something in Iowa, we didn’t hear a peep. In the state Senate, Ernst never sponsored a bill to cut pork, never wrote one measure to slash spending… Joni Ernst’s ads are hard to forget, but her record just doesn’t cut it.” Folks, this new TV ad is a taste of probably what’s coming to Iowa TV sets over the next five months. It’s not going to be your typical “Iowa Nice” campaign.\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/what-bergdahl-story-really-about-gitmo-n123391"}
