{"authors":[],"date_download":"2018-10-30 17:57:49","date_modify":"2018-10-30 17:57:49","date_publish":"2017-04-18 13:13:00","description":"Eight candidates are running to replace Judson Hill, who vacated his state Senate seat to run for the U.S. House for Georgia's 6th District.","filename":"data/vaneerConsumption/WhattoknowabouttheGeorgiaSenateraceinCobbandSandySprings.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/18/Images/newsEngin.18428448_041617-state-senate-CC3.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_ed08e68c4ffd729b934822a6a4d23dec__1540922269.html","title":"What to know about the Georgia Senate race in Cobb and Sandy Springs","title_page":"What to know about Ga. Senate District 32 race to replace Judson Hill","title_rss":"NULL","source_domain":"ajc.com","text":"Voters in east Cobb and Sandy Springs, in addition to influencing the fate of Georgia’s 6th Congressional District race, will also decide in Tuesday’s special election who they want as their next state Senator.\nThe race to replace longtime state Sen. Judson Hill, who vacated his seat to run for the U.S. House, attracted eight candidates who will be on the same ballot for the state position.\nLike in the congressional contest, however, the results of Tuesday’s election could require a runoff election if nobody wins a majority of votes.\nWhat’s at stake?\nWith Hill, Republicans had maintained a majority in the 56-member state Senate by a 20-member margin, and the district has long been solidly Republican.\nIn the field of candidates, three are physicians — Republicans Roy Daniels and Kay Kirkpatrick and Democrat Bob Wiskind — and they, along with tax attorney Gus Makris, comprise the top fundraisers.\nTheir medical backgrounds, along with the failed attempt to repeal and replace the Affordable Care Act, made health care on the state level a central issue in debates.\nWhoever wins the election will also have the power to help craft laws about local traffic — an issue of heightened concern following the collapse of a bridge on I-85 and the opening of SunTrust Park, the new home of the Braves franchise.\nWho’s backed who?\nSome candidates have received explicit endorsements while others have sought other means of support and encouragement.\nKirkpatrick, the leading fundraiser in the race, has received almost $270,000 in donations from 185 contributors, including state Reps. Beth Beskin, R-Atlanta and Deborah Silcox, R-Atlanta, and U.S. Health Secretary Tom Price’s wife, state Rep. Elizabeth Price.\nGov. Nathan Deal endorsed Makris, while former Gov. Roy Barnes backs Wiskind.\nConservative radio host Erick Erickson extended support to Daniels, and Senate Transportation Chairman Brandon Beach, R-Alpharetta, backed railroad conductor Matt Campbell.\nIf necessary, the runoff election would take place May 16, a month earlier than the potential runoff election for the congressional seat.","url":"https://www.ajc.com/news/state--regional-govt--politics/what-know-about-the-georgia-senate-race-cobb-and-sandy-springs/ekddZ2w0PH333n8hzKJP3K/"}
