{"authors":["Brandi Neal"],"date_download":"2018-10-31 01:43:44","date_modify":"2018-10-31 01:43:44","date_publish":"2018-08-27 21:48:44","description":"Whether you do it by bus, train, on foot, or in your car, commuting to and from work is likely part of your daily routine. Have commuter anxiety? You're not alone. People with long commutes report a higher level of stress and anxiety. If you're…","filename":"data/vaneerConsumption/WhatToDoIfYouHaveAnAnxietyAttackWhileYoureCommuting.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/c15de600-a730-4a6b-9bf9-862024fc3d6b-getty-103873124.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_what-to-do-if-you-have-anxiety-attack-while-youre-commuting-10254784_1540950224.html","title":"What To Do If You Have An Anxiety Attack While You’re Commuting","title_page":"What To Do If You Have An Anxiety Attack While You’re Commuting","title_rss":"NULL","source_domain":"bustle.com","text":"Whether you do it by bus, train, on foot, or in your car, commuting to and from work is likely part of your daily routine. Have commuter anxiety? You're not alone. People with long commutes report a higher level of stress and anxiety. If you're having an anxiety attack on your commute, there are some things you can do to take back control. According to the U.K.'s Office of National Statistics, people who commute between 61 and 90 minutes each way experience higher levels of anxiety that those with shorter commutes. Because commuting makes most people anxious to begin with, things that force you to deviate from your regular commuting routine can cause anxiety to spike.\nMaybe the train has stopped and there's no news about when it's going to get going again, there's a five-car pile up on the freeway, or you missed your regular bus. Maybe you're definitely going to be late for an important presentation, or the idea of having an anxiety attack is triggering anxiety itself. Sometimes, a panic attack can happen without rhyme or reason, anywhere, anytime — including on your commute. With all of the variables on your daily commute, it's pretty difficult to control everything around you. If you find yourself having an anxiety attack during your commute, here are some ways you can manage your symptoms.\n1 If You're Driving, Pull Over Giphy If you have an anxiety attack while you're behind the wheel, pull into a parking lot or to the side of the road if it's safe for you to do so, Medical News Today recommended. If you can't pull over right away, Psychology Today suggested a super simple breathing technique to help you calm down. \"The only instruction is to breathe out slowly. The key is to focus on your out-breath and ignore your in-breath,\" Alice Boyes Ph.D. explained. \"Your in-breath will naturally lengthen when your out-breath is longer. Therefore you don't need to actively focus on your in-breath at all.\"\n2 Drink Water Giphy If you live with anxiety, it's a good idea to always carry a bottle of cold water and a snack in your bag. If you feel yourself start to have an anxiety attack while you're driving or on the subway, get out your water ASAP. \"Drink water and notice the coolness radiating down your throat and through your chest and body,\" Dr. Carrie Chiasson wrote for the Portsmouth Neuropsychology Center. \"People often feel warm when anxious and drinking cold water, running your hands under cold water, or putting a cool washcloth on the back of your neck can work wonders.\" You can't exactly wash your hands while driving or on public transport — though keeping hand sanitizer or makeup wipes in your bag might help — but you can drink water.\n3 Repeat A Mantra Giphy When you start to feel hella anxious on your commute, silently repeating a mantra to yourself can help you calm your mind. Your mantra doesn't have to be anything special or fancy. It can be anything that helps you feel grounded. \"Focusing on something like a mantra or statement can help focus your mind but also remind yourself that you are thinking clearly and will be OK,\" Dr. Chiasson noted. Love Friday Night Lights? Repeat \"clear eyes, full hearts, can't lose.\" Can't get enough My Favorite Murder? If saying \"stay sexy; don't get murdered\" helps you breathe easier, go for it. I use \"I am calm; I am light,\" which I borrowed from Lady Gaga.\n4 Re-label What's Happening One of the scariest things about having an anxiety attack is that it can feel like you're dying. By labeling what's actually happening to you, you can help your mind recognize that you're not in any danger. \"Identify what is happening in your body by non judgmentally labeling your physical experiences. For instance, calmly observing, 'I am experiencing a faster heart beat and feeling warm in my face and neck' can be a useful skill for slowing down what is happening without jumping to conclusions like, 'I must be having a heart attack,'\" Dr. Chiasson explained.\n5 Distract Yourself Set yourself up for success during your commute by arming yourself with a distraction. \"There are lots of ways to distract yourself, such as counting, calling a friend ... playing a game, reading a book, and so on. Anything that distracts your mind away from anxious thinking will indirectly end stress responses and anxiety attacks. The better you are at distracting yourself, the faster anxiety attacks end,\" the Anxiety Centre wrote on its blog. If you're pulled over in your car, you can turn on your favorite podcast or Spotify playlist, or you can even call a trusted friend. If you're on public transport, you might not have service to call or text with anyone. You can try listening to music or podcast, or even reading a book.\n6 Follow The 3-3-3 Rule Giphy One of the most effective ways to stop an anxiety attack in its tracks is to follow the 3-3-3 rule, according to WebMD. \"Look around you and name three things you see. Then, name three sounds you hear. Finally, move three parts of your body — your ankle, fingers, or arm.\" This helps ground you in time and place, and it gets you out of your head and focused on the tangible, which can help you feel more calm. \"Whenever you feel your brain going 100 miles per hour, this mental trick can help center your mind, bringing you back to the present moment,\" Tamar Chansky, Ph.D., a psychologist and author of Freeing Yourself from Anxiety, told Locke Hughes for WebMD.\n7 Sit, Or Stand, Up Straight Giphy This one is simple yet effective, and it actually makes a lot of sense. \"When we are anxious, we protect our upper body — where our heart and lungs are located — by hunching over,\" Dr. Chansky told WebMD. If you're on public transport, and it's safe to do so, stand up, pull your shoulders back, and open your chest. If you're driving, do the same thing while seated. By dong this, your body will start to feel more in control versus feeling like it needs to protect your heart.","url":"https://www.bustle.com/p/what-to-do-if-you-have-anxiety-attack-while-youre-commuting-10254784"}
