{"authors":["Nina Kahn"],"date_download":"2018-10-31 01:40:56","date_modify":"2018-10-31 01:40:56","date_publish":"2018-09-14 20:41:27","description":"And just like that, summer's almost over! As we enjoy this last week or so of longer days and summery vibes, we also inch closer and closer to the September 2018 full moon, which occurs on Sep. 24. This month's full moon, known as the Harvest Moon,…","filename":"data/vaneerConsumption/WhatDoesItMeanIfAFullMoonIsInAriesTheHarvestMoon2018WillMakeEveryoneFaceTheirPast.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/13/6dbd0254-8f15-4624-ae55-d485da4ec2aa-getty-468572130.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_what-does-it-mean-if-a-full-moon-is-in-aries-the-harvest-moon-2018-will-make-everyone-face-their-past-11907136_1540950056.html","title":"What Does It Mean If A Full Moon Is In Aries? The Harvest Moon 2018 Will Make Everyone Face Their Past","title_page":"What Does It Mean If A Full Moon Is In Aries? The Harvest Moon 2018 Will Make Everyone Face Their Past","title_rss":"NULL","source_domain":"bustle.com","text":"And just like that, summer's almost over! As we enjoy this last week or so of longer days and summery vibes, we also inch closer and closer to the September 2018 full moon, which occurs on Sep. 24. This month's full moon, known as the Harvest Moon, is the first fully-lit lunar event of the autumn season — and it happens to be rising in the very-fiery sign of Aries. So what does it mean when the full moon is in Aries? Well, things are definitely bound to get interesting — and in this case, a little dark.\nDuring full moons, our emotional lives often mirror the moon itself — darkness gets illuminated, and things that are hidden are suddenly brought to light. This unveiling asks us to reflect up on and deal with those revealed truths, a process that can be slow and emotionally painful. Such is certainly the case with the 2018 Harvest Moon — and that can be difficult to manage with headstrong, action-oriented Aries at the helm, to say the least.\nAries is both a cardinal fire sign and the very first sign of the zodiac, making it a natural leader, full of passion and energy, and always ready to charge forward and take initiative (whew, I'm exhausted just thinking about all that action). But full moons, on the other hand (this month's Harvest Moon, in particular) ask us for reflection and emotional sensitivity. \"[W]hen the full moon lands in this cardinal fire sign, we might just get a little hot and bothered,\" explained Astrology.com. They also note that reflection is \"not the sort of thing Aries typically enjoys,\" which, during an Aries full moon like the upcoming one, can cause all zodiac signs to feel some friction and hotheadedness.\nSeptember 2018's Aries full moon in particular presents its own unique challenges, as the moon will be square Saturn. This placement, as explained by Astrology King, \"has a restricting and depressing influence on your feelings and relationships,\" so don't be surprised if you're feeling down, and be sure to up your self-care game in preparation for the heavy emotions you're likely to experience. Astrologer Lisa Stardust spoke with Bustle and shares, \"While we may feel anxious and a little blue, remember, growth is essential for our personal evolution.\" So allow yourself to feel your feels — don't run from them, and try not to let your likely-Aries-influenced temper take over, either. Work through the emotions by staying aware of the fact that these feelings can actually help you if you choose to work through them, rather than trying swallow them down again and again.\nIn addition to Saturn's influence, the moon will also be conjunct the comet Chiron, which, according to Astrology King, \"links your fears to a deep wound in your soul related to your childhood memories.\" Yeah, I told you this was likely to get dark. Stardust also explains, \"The Harvest Moon will bring up issues which have been internalized for years, giving us the energy to finally assert ourselves and express our feelings with others.\" That said, be prepared to sift through painful memories from your past and repressed feelings that may have gone unchecked until now.\nBut you know what's great about having the full moon in Aries? Aries embodies pure confidence. Action. Drive. Power. So despite all the rough stuff that many of us will be dealing with — past traumas, bad memories, issues that we've tried to run from — we can call upon Aries to give us the power to face our demons head-on. As Stardust tells Bustle, \"Trying to power through the debilitating forces within will elevate our personal strength and elevate us all to a place of personal power, allowing us to breakthrough barriers from within.\" Whether or not you're an Aries yourself, now's the time to embody the unbridled confidence of one. If you're unsure how to move forward with something during this moon, ask yourself, what would an Aries do? — now channel that power!\nAnd as is always the case with an Aries full moon, the sun will simultaneously be in the sign of Libra — the sign directly opposite to Aries. Aries is a cardinal fire sign ruled by Mars, the god of war, while Libra is a cardinal air sign ruled by Venus, the goddess of love. Aries is decisive, unafraid of confrontation, and all about initiative, while Libra is slow to make decisions, diplomatic, and all about balance. You get the picture. This placement is super helpful in balancing out the sometimes-hotheaded nature of Aries, especially during such an emotionally-fraught full moon. If you're trying to stay balanced in the midst of all the emotional chaos, remember that it's Libra season and that the sun's energy can help you, too.\nThe September 2018 full moon is truly asking us to clean the skeletons out of our closets. You know how spring cleaning is a thing? Consider this an autumn clean-up, except that you'll be sorting through your emotional and spiritual life instead of your apartment. As Stardust explains, \"The Harvest Moon will emotionally test us all. We can overcome adversity and insecurities through perseverance.\" Channel Aries' fiery, leadership-driven, unabashedly confident spirit when it comes to navigating the deep waters of painful memories and feelings during this full moon. Your future self will thank you, as you'll embark on this fresh season knowing that you put in the work to clear out old your old, toxic baggage and make room for new and positive growth.","url":"https://www.bustle.com/p/what-does-it-mean-if-a-full-moon-is-in-aries-the-harvest-moon-2018-will-make-everyone-face-their-past-11907136"}
