{"authors":[],"date_download":"2018-10-22 20:34:50","date_modify":"2018-10-22 20:34:50","date_publish":"2014-06-02 11:28:40","description":"If there's a war on coal, someone may have forgotten to tell the primary target.","filename":"data/vaneerConsumption/WhatWaronCoalTheCarbonFuelIsDoingFine.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_40/480841/140602-coal_0726_a60625361e5cb21a468b30228788f8fd.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_energy_what-war-coal-carbon-fuel-doing-fine-n120076_1540240490.html","title":"What 'War on Coal'? The Carbon Fuel Is Doing Fine","title_page":"What 'War on Coal'? The Carbon Fuel Is Doing Fine ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIf there's a war on coal, someone may have forgotten to tell the primary target.\nAs the Environmental Protection Agency prepares to unveil new standards on cutting carbon emissions at U.S. power plants, a confluence of factors underscore how coal still remains a vital source of generating electricity.\nRegulations such as the Mercury and Air Toxic Standards, plus a shift toward natural gas by utilities, has put the fuel source under pressure. Yet nearly 40 percent of U.S. electricity is currently generated by coal, with both domestic and international use on the rise—fueled in part by a winter surge in natural gas prices. In recent research, Bank of America-Merrill Lynch noted that low U.S. coal supplies coincided with volatility in natural gas, triggered by \"demand rationing\" in the power sector.\nCoal is a leading cause of global carbon emissions. However, in spite of predictions about its demise, demand for the fuel source is expected to rise by more than 4 percent this year, according to the Energy Information Administration.\n\"It's not surprising there's strong demand, because coal is a relatively cheap source of generating electricity when you don't account for social costs.\"\n\"It's not surprising there's strong demand, because coal is a relatively cheap source of generating electricity when you don't account for social costs,\" said Jason Bordoff, director of Columbia University's Center on Global Energy Policy.\nThe rise in coal use—especially in Europe, where natural gas prices are far higher than in the U.S.—\"is driven by market economics, especially with the rebound in gas prices,\" said Bordoff, who noted that it's cheaper for utilities to scale back on nat gas and use coal. Despite that, the EPA is likely to \"change the economics of coal\" by stiffening emissions targets for carbon intensive fuel, he added.\nThe new rules come as the Obama administration is under scrutiny from conservationists. With a climate change bill stalled by foes in Congress, the carbon reduction initiative looms as a major test of President Obama's climate bonafides.\nThe Union of Concerned Scientists cites coal plants as \"the nation's top source of carbon dioxide,\" adding that the typical plant generates more than 3.5 million tons of greenhouse gasses per year. But the fuel is economically important for producing states like Kentucky, West Virginia and Ohio, which have fought to preserve its use.\nEven before the EPA's changes are made public, the battle over its substance has already been joined.","url":"https://www.nbcnews.com/business/energy/what-war-coal-carbon-fuel-doing-fine-n120076"}
