{"authors":[],"date_download":"2018-10-30 20:56:50","date_modify":"2018-10-30 20:56:50","date_publish":"2017-01-14 18:57:00","description":"Atlanta Mayor Kasim Reed pushed back Saturday on President-elect Donald Trump’s assessmen...","filename":"data/vaneerConsumption/WhatAtlantaMayorKasimReedsaidaboutDonaldTrumpstweet.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/14/Images/newsEngin.17448326_030216-elx-dem-georgia-BG2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_a_16f784984c49aee5954b18a925d197e0__1540933010.html","title":"What Atlanta Mayor Kasim Reed said about Donald Trump's tweet","title_page":"What Atlanta Mayor Kasim Reed said about Donald Trump's tweet","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta Mayor Kasim Reed pushed back Saturday on President-elect Donald Trump’s assessment of civil rights leader and U.S. Rep. John Lewis’ district.\nIn a series of tweets, Reed said: “John Lewis is an American hero & a national treasure. Period. Full stop.\n“That PEOTUS Trump would attack Congressman Lewis on MLK Day weekend for “all talk…no action” when he bled to actually “Make America Great” is why far less than half the country supports him at the dawn of his presidency.”\nTrump said Lewis’s district was “in horrible shape and falling apart (not to mention crime infested)” in an early Saturday tweet.\nLeaders throughout the metro area voiced their opinions Saturday on the controversy, including Georgia Republicans.\nTrump was reacting to Lewis’s comments in an interview that he did not think the incoming president was legitimate and raised questions about Russia’s involvement in the election.\nIn his tweet, Trump said Lewis “should spend more time on fixing and helping his district.”\nFormer Mayor Shirley Franklin said Trump has Atlanta all wrong. She said crime in Atlanta, like America in general, is down and that Atlanta has seen significant positive growth over the last two decades.\n“Clearly the President-elect’s tweet doesn’t do justice to all the strengths of the district,” she said. “Like much of America it has issues that need to be addressed, but when you look at in totality (Trump’s statement) factually is not true.\n“Tweeting may have been beneficial in winning the presidential election,” Franklin added. “It is yet to be seen whether it will benefit the American people when the President-elect governs.”\nAtlanta City Council President Ceasar Mitchell called Trump’s response to Lewis a “vicious attack” and “only serves to validate the sentiment initially expressed by Congressman Lewis.\n“From being the site of the world’s busiest airport, the Centennial Olympic Games, numerous fortune 500 companies, and an unparalleled civil and human rights heritage, Atlanta is a strong and proud city,” Mitchell said in a statement. “While our city does not require validation from anyone, it is my sincere hope that as president Mr. Trump will be actively supportive of Atlanta’s commitment to become an even stronger American city.”\nAtlanta City Councilman Andre Dickens said Lewis has stood “face to face with bullies from Selma and the Edmond Pettis Bridge to every corner of this country in the fight against discrimination.\n“He has been a staunch and vigorous advocate for his district and the country and no amount of political bullying can erase that record,” Dickens said.","url":"https://www.ajc.com/news/local-govt--politics/atlanta-mayor-reed-trump-john-lewis-american-hero-full-stop/s9OmEyJxqW1cAgU0ED8YmK/"}
