{"authors":["Allison Piwowarski"],"date_download":"2018-10-30 22:52:37","date_modify":"2018-10-30 22:52:37","date_publish":"2014-08-14 17:22:20","description":"Winning Big Brother is bound to change the lives of the contestant that walks away with the $500,000. Many of the houseguests this season have explained what they will do with the money if they were to make it to the end. This season, Big Brother…","filename":"data/vaneerConsumption/WhatIsFrankieGrandesCharityHowtheBigBrotherStarPlanstoGiveBackAftertheShow.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/91ef83a7-8df8-42d2-ae23-fdfcc8877021.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35777-what-is-frankie-grandes-charity-how-the-big-brother-star-plans-to-give-back-after-the_1540939957.html","title":"What Is Frankie Grande's Charity? How the 'Big Brother' Star Plans to Give Back After the Show","title_page":"What Is Frankie Grande's Charity? How the 'Big Brother' Star Plans to Give Back After the Show","title_rss":"NULL","source_domain":"bustle.com","text":"Winning Big Brother is bound to change the lives of the contestant that walks away with the $500,000. Many of the houseguests this season have explained what they will do with the money if they were to make it to the end. This season, Big Brother houseguest Frankie Grande plans to not only change his life if he wins the money, but also the lives of African children, by furthering their education. Frankie announced he is playing for charity this season, and if he wins, he will be using the money to build schools in Africa through the charity he works with, buildOn.\nAnnouncing his intentions was an interesting strategy. Many fans of the show seem to be torn if it will hurt or help his game. On one hand, telling the houseguests that the money will go to charity might make them more likely to vote for you at the end, knowing the money will go to a good cause. On the other hand, telling the houseguests that the money will go to charity might make them turn against you because they know that people will vote for you at the end, knowing the money will go to a good cause. It's a double-edged sword.\nSo what is Frankie's charity of choice? Here are the things to know about Frankie and his quest to fight the education crisis alongside buildOn.\nWhat is buildOn about?\nbuildOn's mission statement (within the International Program — which Frankie would be assisting) is as follows:\nWe build schools with villages that have historically had no adequate school structure – where students are squeezed into dark and crumbling mud huts, or are taught under trees when the weather permits, or have to walk multiple miles to a neighboring village, or can’t attend school at all.\nThrough fundraising and donations (such as Frankie's potential donation), schools are being built in countries where the education system is weak, if not nonexistent. According to the website, 629 schools have been built through the International Program in countries such as Haiti, Mali, Nicaragua, Senegal, Burkina Faso, Malawi, and Nepal.\nFrankie's history with buildOn\nFrankie's history with the charity is extremely respectable. In May 2014, just before entering the Big Brother house, Frankie was honored with the Global Impact Award in New York at buildOn's Builders Ball for his work with the organization in the United States and around the world. He was commended for using his power of social media to spread the message of buildOn and get more people involved through his influence.\nWhat Frankie plans to do if he wins\nIf Frankie wins the $500,000, he has said he plans to use the money to build four schools in Africa. If Frankie doesn't walk away with the first place prize, but instead wins second place ($50,000), he has said he will build two schools in Africa.\nAccording to buildOn's website, it costs approximately $30,000 to build a school through their program. If Frankie honors his word and builds the two schools with the $50,000 runner-up prize (and the additional $10,000 from Team America), he will have the perfect amount of money for two schools. If Frankie wins the $500,000 he will build four schools, at $30,000 each, costing around $120,000, which still leaves a chunk of money left over for him to enjoy. If Frankie were to decide to use the entire winnings (assuming after taxes that amounts to about $375,000), he would be able to build 12 schools.\nFrankie's efforts to help further education in struggling countries is admirable and should absolutely be recognized, but should it give him a leg up over the other houseguests? We'll have to wait and see if he makes it to the final two before we can answer that.\nImages: Lisette M. Azar/CBS; FrankieJGrande/Instagram; buildOn","url":"https://www.bustle.com/articles/35777-what-is-frankie-grandes-charity-how-the-big-brother-star-plans-to-give-back-after-the"}
