{"authors":["Shea Simmons"],"date_download":"2018-10-31 01:49:51","date_modify":"2018-10-31 01:49:51","date_publish":"2018-08-27 17:38:10","description":"Sure, beauty guru and makeup brand collaborations have been huge in 2018. However, there's something about a solid, classic collection from a brand that never gets old. That's why Too Faced's Peaches & Cream collection expansion is so exciting. Not…","filename":"data/vaneerConsumption/WhatsInTooFacedsPeachesCreamCollectionTheNewProductsLookSoGood.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/954b57fc-a2f6-4c3f-ad9a-43e8d2f1bc24-39331413_268116787131498_4849420129072578560_n.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_whats-in-too-faceds-peaches-cream-collection-the-new-products-look-so-good-10247433_1540950591.html","title":"What's In Too Faced's Peaches & Cream Collection? The New Products Look So Good","title_page":"What's In Too Faced's Peaches & Cream Collection? The New Products Look So Good","title_rss":"NULL","source_domain":"bustle.com","text":"Sure, beauty guru and makeup brand collaborations have been huge in 2018. However, there's something about a solid, classic collection from a brand that never gets old. That's why Too Faced's Peaches & Cream collection expansion is so exciting. Not only has the brand collaborated with a guru this year (here's looking at you Jackie Aina x Too Faced), but now, they're revisiting one of their most popular collections and making it even larger. Don't worry, it stills smells amazing.\nHot off the launch of the Tutti Frutti collection (which, you know, also happens to smell amazing), Too Faced has announced that even more sweet-smelling goods are coming fans' way. It's not, however, a brand new collection. It's an expansion, and it's so needed.\nAccording to an Instagram post from Too Faced Chief Creative Officer and Co-Founder Jerrod Blandino, new peach-themed goodies are coming fans' way, and they look so, so good. From highlighters to lip products, the Peaches & Cream family is getting bigger, and they're coming much sooner than you may think.\nIn the photo posted by Blandino, fans get a glimpse of a new lip balm, highlighter palette, lip scrub, and lip sticks. Too Faced is clearly not playing around with this expansion, and fans are sure to be stoked.\nWhat's the low-down on each product and when can you snag it? Good news! You've got only a bit over a week to wait until the new pieces of the Peaches & Cream collection can be yours. They're set to launch on the Too Faced website as well as at Sephora on Sept. 4.\nNow, what can you snag for your collection?\nSugar Peach Wet And Dry Face And Eye Palette\nThe Sugar Peach Palette $42 Too Faced The Sugar Peach palette is a buildable collection of highlighting shades that can be used wet or dry (hence the name). The best part, though, may be that they're multi-purpose and can be used on the face or the eyes. Bonus: these beauties smell like peaches and cream. Buy Now\nPeach Kiss Moisture Matte Long Wear Lipstick\nPeach Lip Balm\nPeach Lip Scrub\nClearly, Too Faced has much more up their sleeve when it comes to scented cosmetics, and fans of the brand are sure to be thrilled to see an expansion of the iconic Peaches & Cream Collection. Whether you're looking for lippies, a lip scrub, or highlighters, they're coming your way. Be sure to mark your calendar for Sept. 4.","url":"https://www.bustle.com/p/whats-in-too-faceds-peaches-cream-collection-the-new-products-look-so-good-10247433"}
