{"authors":[],"date_download":"2018-10-22 21:41:34","date_modify":"2018-10-22 21:41:34","date_publish":"2014-05-07 00:39:21","description":"Figures may show a slight drop in how much passengers are paying to check their bags, but the long-term trend is heading in the other direction.","filename":"data/vaneerConsumption/WhatsNextforAirlineFeesMoreWaystoPay.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/425026/140506-luggage-2015_27c88e91b316d44f5beb069bbc1e349b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_whats-next-airline-fees-more-ways-pay-n98796_1540244494.html","title":"What's Next for Airline Fees? More Ways to Pay","title_page":"What's Next for Airline Fees? More Ways to Pay","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAlthough the latest numbers may show a slight decline in how much passengers are paying airlines to check their bags, the long-term trend is clearly heading in the other direction.\n\"They're going to go up,\" predicted Jay Sorensen, the president of IdeaWorks, a research firm that advises the industry. \"The airlines are always testing higher rates to see if it will fly.\"\n\"I think the big push now, internationally you still get a free bag, and I suspect that will change in the next two years,\" Sorensen said. \"And free bags as an economy-class passenger will disappear within three years, practically worldwide.\"\nU.S. passenger airlines collected a total of $797 million in baggage fees during the fourth quarter of 2013, accounting for 1.6 percent of the airlines' total operating revenue, the U.S. Department of Transportation Bureau of Transportation Statistics reported Monday. In that same quarter, they collected $675 million from reservation change fees, or 1.4 percent of total operating revenue.\nThe fourth-quarter 2013 bag fee revenue were a 3 percent decline from the $823.3 million collected by the airlines in the fourth quarter of 2012. Conversely, reservation change fees were up 10 percent when compared with the $613.4 million collected in the fourth quarter of 2012.\nOverall, the airlines reported a net profit of $7.3 billion in the fourth quarter of 2013, up from a loss of $188 million in the fourth quarter of 2012, according to the BTS.\nFrontier was the latest airline to make waves with new add-on fees, including a $20 fee for larger carry-on bags.\n\"What we want to do is change customer behavior,\" Frontier CEO David Siegel told CNBC's \"Squawk on the Street\" on Monday.\n\"At the gate there are these carry-on wars where they have to gate-check the bags and they can't manage the number of bags being carried on. We want people to make a choice. They can check their bag for the lowest fee in the industry or pay more and carry on, but what we have done is taken the price of the bag out of the ticket.\"\nSorensen notes that Spirit already charges for larger carry-ons, so Frontier is hardly the first.\n\"Americans love their carry-ons and Spirit and Frontier are taking advantage of that. As long as you do it with full disclosure, up front, I think that's fine,\" Sorensen said. He noted that Spirit has been extremely profitable with add-on fees despite the complaints. \"Spirit Airlines, if they really are as bad as people say they are, they'd be out of business.\"\nGeorge Hobica, the founder of AirFareWatchDog.com, agreed the fees are likely to go up and even the carry-on fees may expand to the legacy carriers. \"United lost money last quarter and last year,\" Hobica said in an email to CNBC. \"They compete with Frontier in Denver. Might they be the first legacy network carrier to charge for carry-on bags? Most new fees will be incremental such as the change fee increase last year from $150 to $200 on a domestic fare, but that was hardly incremental really…a huge jump.\"\nThe \"checked bag fees are a bit like cigarette taxes, the higher they go, the more people avoid them,\" said Hobica, who maintains an online list of airline fees. \"Except for UA, airlines are now profitable, so why should they charge more fees? It seems counterintutive unless they're trying to make up for all the bad years when they lost billions. Will they one day charge for lap children on domestic fares as they already do on international ones? Will some of the majors charge for seat selection on all flights?\"\nSorensen said the airlines should actually be commended for finally figuring out how to make a profit. \"The airline industry had been threadbare and bankrupt for a long time and now it's starting to make money,\" he said.\n\"It is shocking that a passenger can pay, say, $175 for a one-way ticket only to pay an additional $150 fee simply to change the flight, and that doesn't even take into account any change in fare.\"\nThe airlines will likely see more revenue not just by adding fees, Sorensen said, but by figuring out the technology about how to sell them. While the airlines have gotten good at marketing those fees on their own booking sites, some third-party agents using Sabre or Amadeus have no financial incentive, let alone the technology ability to sell add-ons such as extra-legroom, Sorensen said.\nAnd for consumers, the way to avoid fees is to sign on for loyalty perks. \"Always, with all these things, the more loyal you are in terms of frequent flier partnerships and holding a (linked) credit card, the airline will rewarded for that,\" Sorensen said.\nBrandon Macsata, the executive director of the Association for Airline Passenger Rights, said the levels of customer satisfaction remains a troubling trend. \"It is shocking that a passenger can pay, say, $175 for a one-way ticket only to pay an additional $150 fee simply to change the flight, and that doesn't even take into account any change in fare. Whereas passengers understand fare differences when travel plans change, it is hard to comprehend why they're getting socked with change fees.\"","url":"https://www.nbcnews.com/business/travel/whats-next-airline-fees-more-ways-pay-n98796"}
