{"authors":[],"date_download":"2018-10-30 00:50:24","date_modify":"2018-10-30 00:50:24","date_publish":"2018-09-06 02:34:01","description":"My life here is just amazing. I usually get up at about 6 a.m. I check my emails and look out at the swimming pool. Now, just think about it. Someone had to invent plastic, which is what my phone is made of. Then someone had to make the plastic. Then someone had to invent the Internet and make it so it worked in a package the size of a few playing cards.","filename":"data/vaneerConsumption/WhatMazieDoesntKnow.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/Mazie.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860624.html","title":"What Mazie Doesn’t Know","title_page":"What Mazie Doesn’t KnowThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Los Angeles, Wednesday\nMy life here is just amazing. I usually get up at about 6 a.m. I check my emails and look out at the swimming pool. Now, just think about it. Someone had to invent plastic, which is what my phone is made of. Then someone had to make the plastic. Then someone had to invent the Internet and make it so it worked in a package the size of a few playing cards.\nThen someone had to build the Internet and I don’t have the faintest idea how that’s done. Let’s just say it’s done by people a lot smarter than I am. Then someone had to build a huge dam near here that creates hydroelectric power. That meant damming up a river and building generators and turbines. That means mining iron ore and refining it into steel. Then someone has to make copper wires, which means extracting copper from Wyoming or Montana or Mali. Then someone has to create an immensely complex system to charge me for the use of the phone and of the Internet and of the electricity to charge up the Internet and send me the bills.\nThen I usually drink some Ensure, a nutritious drink for us old people. It had about ten thousand ingredients. Where do they come from? It’s in a nifty plastic bottle that somehow sounds like it’s metal when it’s opened. How many people does it take to do that?\nThen I walk down the stairs to the swimming pool. I live right in the middle of a city called Beverly Hills. Somehow, within easy sight of skyscrapers, there is this neighborhood of houses on half acre grassy lots with swimming pools. These were built in the 1920s. Who knows how to build a house? Who knows how to invent and then run the best invention of all time, air conditioning? Yet there they are, just waiting for my heavy tread on the stairs. A simple flick and the AC roars to life. Then I walk to my pool. It’s warm all year long, thanks to natural gas from somewhere. How does it get here? How can they possibly get it to my heater in sufficient quantity and at a price I, a middle-class person, can afford? How can they make a machine that heats an immense body of water quickly and cheaply? And where does the water come from? LA is in a desert, but there’s always oceans of water for swimming and gardening.\nIt’s all a miracle. I just wish so much that my wife were well enough to enjoy it instead of lying in her bed moaning and coughing. That takes me down quite a few pegs. I’m in ecstasy about my pool, but in hades about my wife.\nAnyway, who invented Selsun Blue dandruff-removing shampoo, another miracle. Who brought Boar’s Head sliced corned beef to my lunch table. And how who’s seated across the room from me but my shrink, P. He’s been my shrink since 1980 when I first realized I was mortal and went into a crisis that I still am in. “What do I do now?” I asked him. “I’m 73. I don’t have much time left. What do I do?”\nHe looked at me with an immense smile. “Anything you want,” he said. “ANYTHING YOU WANT!”\n“Does that mean I can eat as much fried chicken as I want? Drink as much pink lemonade as I want?”\n“Yes. Absolutely,” P said with rapture.\n“And fly to Bangkok and eat chicken larb?”\n“ANYTHING YOU WANT,” he repeated with even greater emphasis.\nI felt liberated. Ecstatic. But then I remembered how sick Alex is. I realized how I get jet lagged. I recalled with a potent twinge of nausea how fried foods make me feel. Still… P. has a point. I had better get out my list and start to do what I really want to do.\nNow that I think of it, that’s mostly to lie in bed next to Alex and sleep holding her hand. Hmmm. Was that P.’s secret clever shrink’s way of guiding me to be happy with what I have?\nSomehow, I don’t think so. P. is a pleasure seeker — Polo Ponies, Yacht, Collectible Firearms. I think he does want me to go to Thailand. But what if I get sick while I’m there? Who’ll take care of me?\nAnyway, Judah Friedman and I drove around in his car, a gleaming Mazda 6, and listened to the torture of Judge Kavanaugh by some asinine nitwit named Mazie Hirono, a Senator from Hawaii. God help us. Book her, Danno. Somehow, she attacked Mr. Kavanaugh so violently she made me want to vomit. My guess is that she’s so INCREDIBLY stupid that she thought he was suddenly going to throw his hands in the air and say, “Senator, you nailed me. I was a concentration camp guard at Belsen. I surrender.”\nThirty minutes later, a true nitwit, our California Senator, Kamala Harris, started doing her Tom Cruise imitation trying to make Kavanaugh “confess” to having said the words “Mueller” and “investigation” to some unknown someone last year. She obviously thought she was just a spectacular courtroom bully. In fact, she was a pitiful little weasel.\nAnd meanwhile, every few minutes some psycho in the audience gets up and starts cursing at Kavanaugh and the GOP. It’s really sad. What a bunch of losers the leftists and their pals in the audience are. They’re not going to get anything on Kavanaugh. There’s nothing to get. He’s a mega genius jurist who will make a superb High Court justice.\nBut when did the Democrats become so rowdy and so angry? Is it because so many of them are angry women? Because so many of them are friends of minister Farrakhan? By the way, did anyone notice the ass kissing of the black anti-Semite Farrakhan by Bill Clinton at Aretha Franklin’s funeral? Farrakhan (just in my opinion) is the black David Duke, but all of the Democrats want to kiss his ring. This is what the Democrats have come to. Worshiping an out and out racist anti-Semite in the hopes of getting a few more black voters. Pitiful and scary. When National Socialism comes to America it will come in the guise of a crusade for racial justice. That’s exactly how it came to Germany. Come to think of it, it’s already here. I had better swim some more while I still can.","url":"https://spectator.org/what-mazie-doesnt-know/"}
