{"authors":["Daniel Bates For The Daily Mail"],"date_download":"2018-10-23 02:50:08","date_modify":"2018-10-23 02:50:08","date_publish":"2016-01-29 17:31:12","description":"It’s the same lure that makes ‘dangerous’ people irresistible — and the more danger we sense, the harder it is to ignore, say Researchers from Italy’s International School for Advanced Studies.","filename":"data/vaneerConsumption/WhatISitaboutcakescheeseandchocolatethatmakesthemsoirresistible.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B45C1600000578-0-image-a-17_1454088638888.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3423140_What-cakes-cheese-chocolate-makes-irresistible-Unhealthy-food-seen-dangerous-making-attractive_1540263008.html","title":"What IS it about cakes, cheese and chocolate that makes them so irresistible?","title_page":"What IS it about cakes, cheese and chocolate that makes them so irresistible? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The brain is naturally designed to pay attention to dangerous things\nScientists say it's the same lure that makes 'dangerous' people\nThere’s a reason we find it hard to resist a cream cake, bacon sandwich or wedge of ripe Camembert.\nAnd it’s not the smell or the taste.\nScientists say we are subconsciously drawn to unhealthy food because we see it as dangerous and attractive.\nIt’s the same lure that makes ‘dangerous’ people irresistible — and the more danger we sense, the harder it is to ignore.\nScientists are subconsciously drawn to unhealthy food because we see it as dangerous and attractive\nResearchers from Italy’s International School for Advanced Studies studied how people saw different foods on both conscious and unconscious levels.\nPeople pay attention to things that are dangerous and so when we see it we can’t help but be lured in.\nThe more unhealthy the food the more dangerous it seems to us - and the harder it is to resist.\nThe lure is the same as that towards situations and people - for example, members of the opposite sex - that we find dangerous.\nThey asked 57 people of normal weight to draw line with a stylus on a tablet computer as quickly as they could between two dots 13 cm apart.\nDuring the experiment there was a food like a banana or a pizza on one side of the first dot, along with a kitchen appliance like a toaster that acted as a control.\nThe participants rated the foods on a number of issues such as how much they liked each item, how healthy they were and noted whether or not they were dieting.\nThey also completed a test of their subconscious feelings about each of the food by saying if they associated them with positive or negative words.\nThe more unhealthy the food the more dangerous it seems to us - and the harder it is to resist, scientists from Italy’s International School for Advanced Studies have found\nThe results showed that test participants bent their lines towards the food pictures even if they didn’t realise it.\nEven though they always reached the second dot, the movements of their hands showed that, at a subconscious level, they were drawn to the food.\nThe study said: ‘Food and food-related stimuli are powerful attentional-capturing cues and strong sources of interference with ongoing actions even if irrelevant to the task’.\nLead researcher Francesco Foroni said that the gender or the BMI of the test participants had little bearing on the results.\nBut the more unhealthy people thought the food item was and the more negatively they felt about it, the stronger the pull they felt towards it.\nForoni, a doctoral research fellow, said that this was because we think of unhealthy foods as dangerous and we are hardwired to pay attention to dangerous things.","url":"https://www.dailymail.co.uk/health/article-3423140/What-cakes-cheese-chocolate-makes-irresistible-Unhealthy-food-seen-dangerous-making-attractive.html"}
