{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:59:54","date_modify":"2018-10-30 20:59:54","date_publish":"2015-08-11 07:01:29","description":"Still Standing: UPS Refuses To Cave, Continues Shipment Of Big Game Trophies","filename":"data/vaneerConsumption/WhatCanBrownDoforYouUPSRefusestoCaveonBigGameTrophyShipments.json","image_url":"https://media.breitbart.com/media/2015/04/ap_marty-thompson_ap-photo-1024x754.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_08_11__1540933194.html","title":"What Can Brown Do for You? UPS Refuses to Cave on Big Game Trophy Shipments","title_page":"What Can Brown Do for You? UPS Refuses to Cave on Big Game Trophy Shipments | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In the face of pressure from the Humane Society International and other animal-rights groups, shipping giant United Parcel Service (UPS) stands its ground and refuses to ban the shipment of big-game trophies.\nLast week, UPS public relations director Susan Rosenberg indicated that if UPS began prohibiting the shipment of things that one group or another finds offensive, there would be no end to the banning. Via email, Rosenberg wrote: “There are many items shipped in international commerce that may spark controversy. The views on what is appropriate for shipment are as varied as the audiences that hold these views.”\nAccording to The Washington Post, Rosenberg stressed that UPS follows the law and that those shipping with the company must do the same. Beyond that, UPS does not make judgments on what may or may not be appropriate in the opinions of one group or another.\nRosenburg wrote:\nUPS takes many factors under consideration in establishing its shipping policies, including the legality of the contents and additional procedures required to ensure compliance. We avoid making judgments on the appropriateness of the contents. All shipments must comply with all laws, including any relevant documentation from the shipper required in the origin and destination location of the shipments.\nFedEx spokesman Jim McCluskey made a similar statement via email. He indicated that while FedEx does not ship animal carcasses, it “may accept legitimate shipments of parts for taxidermy purposes if they meet [FedEx] shipping guidelines.” He added: “These are legitimate shipments, not shipments that are illegally obtained. Our priority is to ensure we abide by laws and regulations for all shipments.”\nThe statements from UPS and FedEx come as Delta, American, and Air Canada have all announced that they will no longer allow big-game trophy shipping on their airlines.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/sports/2015/08/11/what-can-brown-do-for-you-ups-refuses-to-cave-on-big-game-trophy-shipments/"}
