{"authors":["Joshua Caplan"],"date_download":"2018-10-30 18:30:26","date_modify":"2018-10-30 18:30:26","date_publish":"2018-09-05 23:33:46","description":"Journalist Glenn Greenwald says the White House \"coward,\" behind the anonymously written New York Times op-ed is part of an \"unelected cabal.","filename":"data/vaneerConsumption/WHCowardBehindAnonymousOpedPartofUnelectedCabal.json","image_url":"https://media.breitbart.com/media/2018/09/Trump-NYT-Op-ed-.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2018_09_05__1540924226.html","title":"WH 'Coward' Behind Anonymous Op-ed Part of 'Unelected Cabal'","title_page":"Greenwald: WH 'Coward' Behind Anonymous Op-ed Part of 'Unelected Cabal'","title_rss":"NULL","source_domain":"breitbart.com","text":"The Intercept co-founder and Pulitzer Prize winner Glenn Greenwald on Wednesday evening lambasted the senior White House official – who admitted in an anonymously written opinion-editorial to subverting President Donald Trump’s America First agenda – as an un-self-aware “coward,” part of an “unelected cabal.”\nIn a striking act of betrayal, a senior Trump administration official wrote an opinion piece in the New York Times claiming to be part of a group of people “working diligently from within” to impede President Trump’s “worst inclinations” and ill-conceived parts of his agenda.\nThe alleged White House official, claiming to be part of the “resistance” to President Trump, wrote, “Many Trump appointees have vowed to do what we can to preserve our democratic institutions while thwarting Mr. Trump’s more misguided impulses until he is out of office.”\nReacting to the op-ed, Greenwald tweeted that it focused largely on decrying President Trump’s deviation from establishment Republican orthodoxy, pointing out that it’s an “ideology he didn’t campaign on & that voters didn’t ratify.”\n“We want the administration to succeed and think that many of its policies have already made America safer and more prosperous,” the unnamed official writes, yet “the president continues to act in a manner that is detrimental to the health of our republic.”\n“Although he was elected as a Republican, the president shows little affinity for ideals long espoused by conservatives: free minds, free markets and free people. At best, he has invoked these ideals in scripted settings. At worst, he has attacked them outright,” the author of the piece continued.\nThe Rio de Janeiro-based journalist then eviscerated the official’s hypocritical characterization of the president as “anti-democratic,” while operating clandestinely within the White House as a member of an “unelected cabal” that “imposes their own ideology with zero democratic accountability, mandate or transparency.”\nThe irony in the op-ed from the NYT's anonymous WH coward is glaring and massive: s/he accuses Trump of being \"anti-democratic\" while boasting of membership in an unelected cabal that covertly imposes their own ideology with zero democratic accountability, mandate or transparency — Glenn Greenwald (@ggreenwald) September 5, 2018\nSpeaking before reporters, President Trump branded the piece as a “gutless editorial” and a “disgrace.”\n“Nobody has ever done in less than a two-year period what we have done,” the president said. “So when you tell me about some anonymous source within the administration, probably who’s failing, and probably here for all the wrong reasons.”\nPres. Trump calls publication of unsigned 'resistance' NYT op-ed by senior administration official \"really a disgrace.\"pic.twitter.com/PHYNjNjuCY — Josh Caplan (@joshdcaplan) September 5, 2018\n“So if the failing “The New York Times” has an anonymous editorial — can you believe it?” he continued. “Anonymous. Meaning gutless. A gutless editorial.”\nLater, in what appears to be a follow-up response to the op-ed, the president suggested the official may have committed treason.\nTREASON? — Donald J. Trump (@realDonaldTrump) September 5, 2018\nFurther, White House press secretary Sarah Huckabee Sanders called on the author to “do the right thing and resign” from his or her post. “The individual behind this piece has chosen to deceive, rather than support, the duly elected President of the United States. He is not putting country first, but putting himself and his ego ahead of the will of the American people. This coward should do the right thing and resign,” a statement released by Sanders reads.\nThe publication of the op-ed immediately triggered a wild guessing game as to the author’s identity on social media, in newsrooms, and inside the West Wing. Bloomberg reporter Jennifer Jacobs pointed out that a tweet by the paper may have disclosed the author’s gender. A NYT tweet suggests the anonymous senior admin official is a man — “he,” Jacobs wrote.\nNYT tweet suggests the anonymous senior admin official is a man — \"he.\" The official complains Trump \"engages in repetitive rants, and his impulsiveness results in half-baked, ill-informed and occasionally reckless decisions.\" https://t.co/HsNLRTCK5d pic.twitter.com/6GRD4Lbdbn — Jennifer Jacobs (@JenniferJJacobs) September 5, 2018\nHotly debated on Twitter was the author’s use of the word “lodestar,” which pops up frequently in speeches by Vice President Mike Pence. Could the anonymous figure be someone in Pence’s orbit? Other reporters argued that the term may have been included to throw people off.\nThis is an interesting theory using an interesting clue. \"Lodestar\" is, in fact, a very unusual word. So unusual that if I wanted someone to wonder if I were Mike Pence, I might use it. Or, perhaps, if I were someone who worked with Pence and picked up the word as a result. https://t.co/bruo7gsVb8 — Rebecca Lavoie (@reblavoie) September 5, 2018\nThe writer of the Times op-ed claimed Trump aides are aware of the president’s faults and “we are trying to do what’s right even when Donald Trump won’t.”\nIn addition, the writer also alleged, “there were early whispers within the cabinet of invoking the 25th Amendment” because of the “instability” witnessed in the president. The 25th Amendment allows the vice president to take over if the commander in chief is “unable to discharge the powers and duties of his office.” It requires that the vice president and a majority of the Cabinet back relieving the president.\n“This isn’t the work of the so-called deep state. It’s the work of the steady state,” the official added.\nThe column was released a day after the release of details from an explosive new book by longtime journalist Bob Woodward that laid bare concerns among the highest echelon of Trump aides about the president’s judgment. Among the various allegations, Woodward writes Gen. John Kelly views the president as an “idiot” and considers his role as Chief of Staff the worst job he has ever had.\nThe Associated Press contributed to this report.","url":"https://www.breitbart.com/the-media/2018/09/05/glenn-greenwald-white-house-coward-behind-anonymous-op-ed-part-of-unelected-cabal/"}
