{"authors":["Maria Godoy"],"date_download":"2018-10-23 00:51:54","date_modify":"2018-10-23 00:51:54","date_publish":"2016-01-13 00:00:00","description":"The USDA has been doling out nutrition advice since 1894. As the science changed, so did the government's efforts to visualize its best advice – sometimes, with amusing results to our modern eyes.","filename":"data/vaneerConsumption/WheelsPyramidsAndPlatesUSDAsStrugglesToIllustrateGoodDiet.json","image_url":"https://media.npr.org/assets/img/2016/01/13/basic7promoimage_wide-ede74625681594bcd06056de1ed533e5bdd0a73a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thesalt_2016_01_13_462821161_illustrating-diet-advice-is-hard-heres-how-usda-has-tried-to-do-it_1540255914.html","title":"Wheels, Pyramids And Plates: USDA's Struggles To Illustrate Good Diet","title_page":"Illustrating Diet Advice Is Hard. Here's How USDA Has Tried To Do It : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Wheels, Pyramids And Plates: USDA's Struggles To Illustrate Good Diet\nThe U.S. Department of Agriculture's first stab at offering nutrition advice came in 1894, when W. O. Atwater, a chemist and pioneering nutrition investigator for the agency, published this warning in a Farmer's Bulletin:\n\"Unless care is exercised in selecting food, a diet may result which is one-sided or badly balanced. ... The evils of overeating may not be felt at once, but sooner or later they are sure to appear...\"\nThus began the USDA's long struggle to craft eating advice based on the latest scientific evidence. That science, of course, has evolved quite a bit since 1894 – a time when micronutrients like vitamins hadn't even been discovered.\nAs the science changed, so did the USDA's efforts to represent its best advice with visuals – sometimes, with amusing results to our modern eyes.\n1943: The Basic 7\nEnlarge this image toggle caption U.S. National Archives and Records/USDA U.S. National Archives and Records/USDA\nAlong with margarine, butter gets a conspicuous slot in this food wheel from 1943 — when wartime butter shortages prompted many consumers to switch to margarine. It's hard to imagine either one playing a starring role in today's Dietary Guidelines, which still urge limits on saturated fats in foods like butter, and frown on margarine, which can be high in trans fats.\nAt first blush, butter is as prominent as the vegetables next to it. But look closely and you'll see fruits and vegetables in not one but three separate categories. While these guidelines were criticized at the time for lacking specific information on serving sizes, visually, at least, they seem to place a healthy emphasis on produce.\n1956: The Basic 4\nEnlarge this image toggle caption USDA USDA\nIn the 1950s, the USDA put the Basic 7 on a diet and slimmed it down to the Basic 4 – which did offer recommended minimum servings. Widely used into the 1970s, this diet guide was designed to meet basic nutritional needs – the assumption was that Americans would eat more than what was laid out here.\n1980: The Food Wheel\nEnlarge this image toggle caption American Red Cross/USDA American Red Cross/USDA\nIn the late 1970s, the focus of Uncle Sam's guidelines shifted – from getting enough of the right nutrients, to avoiding the wrong ones — as concerns rose about the links between diet and disease. Though there weren't a lot of data available, fat became a prime nutrient of concern.\nThe Dietary Guidelines as we know them today were born of this era. First published in 1980, they were (and still are) supposed to be based on a review of the latest nutritional science. Back then, they emphasized a diet low in fat, saturated fat and cholesterol. First visualized as a food wheel, the guidelines later took the form of the food pyramid many of us grew up with.\n1992: The Food Pyramid\nEnlarge this image toggle caption USDA USDA\nCarbs were the base of this pyramid, sending the message to eat all you want. And Americans did, gobbling up refined grains and processed snacks like SnackWell cookies — that staple of the low-fat craze — in their quest to avoid the dreaded dietary fat.\nWe know now that \"carbohydrates worsen glucose and insulin — they have negative effects on blood cholesterol levels,\" as Dariush Mozaffarian, dean of the Friedman School of Nutrition Science and Policy at Tufts University, told us back in 2014. In other words, he told us, replacing saturated fats with refined carbs \"has not been useful advice.\"\n2005: My Pyramid\nEnlarge this image toggle caption USDA USDA\nWith the obesity epidemic in full swing, this update to the food pyramid tried to emphasize the importance of exercise along with a healthy diet. The vertical wedges were supposed to indicate how much to eat of each food groups, but visually, it's a jumble: It looks like someone spilled the contents of a dinner table on the floor. Even worse was this bare-bones version of MyPyramid, which ditches the food images altogether. Without visual or written cues, just how are you supposed to know that blue is for milk?\n2011: MyPlate\nEnlarge this image toggle caption USDA USDA\nBy comparison, MyPlate, the latest visualization of the food guide, is sleek and, while imperfect, it's a step in the right direction. The plate makes it clear, for instance, that fruits and veggies should be half of each meal.\nNot that Americans are necessarily absorbing the message. According to USDA data, most of us don't eat the daily recommended amount of produce.","url":"https://www.npr.org/sections/thesalt/2016/01/13/462821161/illustrating-diet-advice-is-hard-heres-how-usda-has-tried-to-do-it"}
