{"authors":["Christine Distasio"],"date_download":"2018-10-30 22:26:35","date_modify":"2018-10-30 22:26:35","date_publish":"2014-08-15 17:30:02","description":"I have a lot of questions for you, Dr. Hart, starting with: When will Hart of Dixie Season 4 premiere? We learned, surprisingly, that the Rachel Bilson-starring series would get a fourth season early on, but when The CW announced the Fall 2014…","filename":"data/vaneerConsumption/WhenDoesHartofDixieSeason4PremiereThat20BurningQuestionsTheSeriesNeedsToAnswer.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/c5462e95-740d-417f-b544-78903f77556c.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35396-when-does-hart-of-dixie-season-4-premiere-that-20-burning-questions-the-series-needs_1540938395.html","title":"When Does 'Hart of Dixie' Season 4 Premiere? That & 20 Burning Questions The Series Needs To Answer","title_page":"When Does 'Hart of Dixie' Season 4 Premiere? That & 20 Burning Questions The Series Needs To Answer","title_rss":"NULL","source_domain":"bustle.com","text":"I have a lot of questions for you, Dr. Hart, starting with: When will Hart of Dixie Season 4 premiere? We learned, surprisingly, that the Rachel Bilson-starring series would get a fourth season early on, but when The CW announced the Fall 2014 premiere dates for most of our favorite shows, Dixie was missing from the line-up. And, while the network has revealed that fans of Bluebell will get a 10-episode season that will premiere midseason in 2015 and that Hart of Dixie Season 4 will address Bilson's pregnancy, network president Mark Pedowitz has yet to reveal an exact premiere date. This just seems like shoddy bedside manner to me — we need to know if Zade is back together already, CW. Update: Hart of Dixie Season 4 begins Jan. 9, per the CW.\nWhen we left off in Season 3, Dixie had gone through a major overhaul of characters and relationships (except for Tom and Wanda — those two are never breaking up). A severe case of Bluebell-wide hiccups prompted Zoe to declare her undying love for Wade, Crickett to come out as gay, and Annabeth to break things off with sneaker fetish-having Davis. Which, really, would've been plenty of revelations for the show's Season 3 finale — but, thankfully, Dixie didn't stop there.\nThe series opened up a love triangle we haven't seen since Season 1 — George, Lemon, and Lavon. And now fans are all kinds of up-in-arms. At the end of the finale, Lemon is aboard the \"S.S. Depression,\" (aka a singles cruise her grandma booked her a spot on in exchange for money to repair the burnt down Fancies) and George and Lavon come running to the terminal to, each, profess their love for her. As Lavon would say, \"No, no, no, no, no,\" this is the last way we wanted Season 3 to go out. Because frankly, all of these characters deserve better than to fall into their old patterns. So, without further ado:\n21 questions for Hart of Dixie Season 4\n1. Whose baby is Zoe having?\n2. Will Zade get back together? (If this is the final season, we deserve that.)\n3. Can we get Rose a real storyline?\n4. Will Robert Buckley's Peter return to Bluebell to screw over Lemon's love life again?\n5. Can Lavon finally GROW UP this season and be a man for Annabeth? (Seriously.)\n6. Will there be a Season 5? (Please say \"yes.\" PLEASE.)\n7. Will George finally get a real house and move out of his boat?\n8. Can Lemon's grandma finally realize that her granddaughter is so much more than the men she dates?\n9. What happened to Planksgiving? Can we celebrate it again?\n10. Where do Bluebell's residents get all of their period costumes? (And enough for the whole town, re: the Medieval jousting episode.)\n11. Will Crickett get a gay storyline now that she's out? (She should.)\n12. But really, whose baby is Zoe having and will there be a time-jump to explain pregnancy?\n13. We've only seen George work on like, two cases. How does he even make money?\n14. Will Joel come back and try to shoot a movie in Bluebell? (#annoying)\n15. Will Brick finally get a love interest that isn't borderline crazy?\n16. Is Annabeth really still in love with Lavon and is there any hope for them?\n17. Do George and Lavon REALLY think they're in love with Lemon? (God, boys are dumb.)\n18. Will Zoe have a goat-baby like Tom and Wanda? (lol jk)\n19. How many times can Crickett and the Belles paint the town gazebo in 10 episodes?\n20. But really, will Zade be back together in the season premiere?\n21. WHEN IS SEASON 4 GOING TO AIR???????????\nC'mon Hart of Dixie, us inquiring Bluebellian minds need to know.\nImages: Eddy Chen/The CW; Wifflegif (3); spencerscaffeine/Tumblr","url":"https://www.bustle.com/articles/35396-when-does-hart-of-dixie-season-4-premiere-that-20-burning-questions-the-series-needs"}
