{"authors":["Amy Sciarretto"],"date_download":"2018-10-31 01:40:39","date_modify":"2018-10-31 01:40:39","date_publish":"2018-08-28 13:46:30","description":"After months of teases and what feels like years of fans and customers clamoring for a collab between these makeup-loving besties, Kylie Jenner shared a sneak peek of the Kylie Cosmetics x Jordyn Woods makeup collection. Jenner posted a…","filename":"data/vaneerConsumption/WhenIsTheKylieCosmeticsxJordynWoodsMakeupCollabComingOutTheLongAwaitedCollectionIsAboutToDrop.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/047d9e95-f286-4039-8189-e08f0dc43cb5-screen-shot-2018-08-28-at-84159-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_when-is-the-kylie-cosmetics-x-jordyn-woods-makeup-collab-coming-out-the-long-awaited-collection-is-about-to-drop-10259472_1540950039.html","title":"When Is The Kylie Cosmetics x Jordyn Woods Makeup Collab Coming Out? The Long-Awaited Collection Is About To Drop","title_page":"When Is The Kylie Cosmetics x Jordyn Woods Makeup Collab Coming Out? The Long-Awaited Collection Is About To Drop","title_rss":"NULL","source_domain":"bustle.com","text":"After months of teases and what feels like years of fans and customers clamoring for a collab between these makeup-loving besties, Kylie Jenner shared a sneak peek of the Kylie Cosmetics x Jordyn Woods makeup collection. Jenner posted a behind-the-scenes Instagram shot from the campaign photo shoot for the collection that she and her BFF have been working on and OMFG! This one is going to slay all the live long day.\nNot only did we get a look at what is presumably some of the product assortment via Jenner's lids and lips. The billionaire makeup mogul also revealed in the caption that the Kylie x Jordyn set will arrive next month. September is just a few days away — so this range should land smack dab in the middle of the back to school and fall makeup season.\nJenner and Woods teased their long-gestating collab in a YouTube video earlier this summer and we've been waiting ever since for more concrete info. While we don't have a list of products, swatches, or an official social media reveal, nor do we have an exact date, we do have hints regarding what to expect. That, of course, is better than nothing.\nIn the Insta image, Jenner is rocking her platinum blonde bob, a white bra top, and bubble gum pink latex pants.\nThat's not the sole sexiness defining the shot. Jenner is also showing off some super glossy pink lips. The shine is so megawatt that it's reminiscent of the disco era of the '70s. It's quite a change from her signature 'n' strong velvet matte lip. But did you check out the inner corner of her eye? That blue glow is shimmery and something else.\nThe inner corner color takes on more of a white tint in another one of the teasers. So perhaps this is Jenner's first foray into a holographic product — be it an eyeshadow shade or a multi-purpose product?\nWe can assume that the Kylie x Jordyn collection will feature eyeshadow and lip gloss. It also looks like a bold and dramatic collection based on Jenner's shots.\nWoods also posted a bit of a hint-dropping selfie on her personal Insta. She did a bathroom mirror selfie, which used to be one of her BFF's signature selfie poses. She also captioned it \"That's a wrap,\" which we can only assume is referring to the same collection photo shoot as Jenner. While the lighting in the Woods image isn't that great, she is rocking some neutral-toned makeup. She's crushing those smoky eyes and matte, beige lips. Could that be part of her collection with Kylie Cosmetics? Anything is possible.\nKylie Jenner on YouTube\nHere's the YouTube video where the BFFs revealed that a makeup partnership was on the way. Fans wanted it. They got it.\nJordy Lip Kit $27 The raspberry red Jordy Lip Kit was christened after Woods. It was just a hint of things to come! Buy Now\nAt this point, Jenner has done collabs, er, kollabs with those closest to her. She has teamed up with her big sisters Kourtney, Kim, and Khloe. She was done a collection inspired by her momager Kris Jenner.\nShe dedicated a collection to her newborn daughter Stormi. She has named Lip Kits and products after her nieces and nephews. The only family member she hasn't done a beauty range with is her big sister Kendall Jenner. Could a \"Kendlie\" makeup collection be far off? It's anyone's guess. It doesn't seem as thought it's in the cards ATM. But that's perfectly OK. We're more than stoked to rock the prior KarJenner collabs...\nPascal Le Segretain/Getty Images Entertainment/Getty Images\n... and we're stoked for the Kylie Cosmetics x Jordyn Woods suite of products because duh!","url":"https://www.bustle.com/p/when-is-the-kylie-cosmetics-x-jordyn-woods-makeup-collab-coming-out-the-long-awaited-collection-is-about-to-drop-10259472"}
