{"authors":[],"date_download":"2018-10-30 14:22:32","date_modify":"2018-10-30 14:22:32","date_publish":"2014-08-19 00:00:00","description":null,"filename":"data/vaneerConsumption/WhenKosherisntKosher.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_08_when_kosher_isnt_kosher_1540909352.html","title":"When Kosher isn't Kosher","title_page":"When Kosher isn't Kosher","title_rss":"NULL","source_domain":"americanthinker.com","text":"When Kosher isn't Kosher\nSainsbury's, the second largest supermarket chain in the United Kingdom, was founded in 1869 by John James Sainsbury. As of June 2014, there were 1,230 locations in the UK, including one in Holborn, central London, located about half a mile from the company’s headquarters at Holborn Circus. When anti-Israel protesters picketed the Holbon store the other day, calling on the grocer to boycott Israeli goods, the manager allegedly feared the store would be ransacked. The solution smacked of appeasement: empty out the kosher food shelves, as reported by the Daily Mail.\nWhat happened next? Irate customers pointed out the obvious, causing the store to back down -- though it has not been reported whether anyone reminded the panicky manager what transpired after Prime Minister Chamberlain came back from his talks with Hitler waving a piece of paper. Many of the goods hurriedly taken off the shelves came not from Israel but from Britain and Poland. Reading labels is important! Because kosher food is produced in countries other than Israel, the store was in effect targeting a group based on race -- i.e. Jews. Here we go again!\nOne shopper commented that “'… as a Jew I find this deeply offensive. Naturally I am against the death of innocent children in Gaza so why are you persecuting me by denying me the right to buy kosher food?”\nAnother shopper noted that the store had not removed “… Halal food in protest against the Islamic State slaughtering Yazidis … therefore [the store] blurred the line between political statement and hate crime.”\nFormer Tory MP Louise Mensch joined the protest, writing on Twitter: “Dear @Sainsburys kosher is JEWISH food. Israel is a COUNTRY. How DARE YOU equate Jews' food to ISRAEL, how dare you #EverydayAntisemitism.” Evidently company executives paid attention. By the evening, the kosher food was back on the shelves. Here’s their version of what happened (the executives, not the food): It was the manager's decision there and then -- not company policy at all. We are a non-political organisation and we're not coming down on either side of the argument. A decision was taken by a store manager faced with a challenging situation outside the store. The decision was taken to move these products to chilled storage elsewhere in the store for a short period as a precautionary measure during an ongoing demonstration close to the store. They were returned to shelf as soon as was practically possible. We apologise for any inconvenience caused. I say, good show, chaps!","url":"https://www.americanthinker.com/blog/2014/08/when_kosher_isnt_kosher.html"}
