{"authors":[],"date_download":"2018-10-30 21:00:32","date_modify":"2018-10-30 21:00:32","date_publish":"2015-09-13 13:15:00","description":"In 2012, a flood in the neighborhood near Turner Field caused the doghouse in Mattie Jackson’s backyard to float away.","filename":"data/vaneerConsumption/WhenCityHallcomesinlikeafloodyouresunk.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/09/13/Images/photos.medleyphoto.8145261.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_when-city-hall-comes-like-flood-you-sunk__1540933232.html","title":"When City Hall comes in like a flood, you’re sunk","title_page":"Atlanta plan to end flooding has Mattie Jackson swimming upstream","title_rss":"NULL","source_domain":"ajc.com","text":"In 2012, a flood in the neighborhood near Turner Field caused the doghouse in Mattie Jackson’s backyard to float away.\nToday, floodwaters threaten to take her entire home. Only it won’t be washed away. It will either be purchased and torn down, or hoisted up and hauled away to another site.\nThe action is part of a vow by Atlanta Mayor Kasim Reed to mitigate flooding in that area. The $66 million plan will try to corral 24 million gallons of stormwater, and calls for new sewer lines in the area, underground holding tanks, permeable roads and, finally, turning a city block of 29 homes into a parklike reservoir with walking trails, waterfalls and a gazebo.\nBut the plan is being derided by some as a land grab by the Powers That Be. The thought gaining credence in the community is that city leaders and those who make money when these things happen want to push out longtime, poorer residents and ensure that gentrification accelerates after the Braves skedaddle to Cobb County in 2017.\nIt’s an accusation often trotted out during such urban dust-ups. And there’s often a kernel of truth in the supposed conspiracies, although the reality is normally a complicated stew of demographic, social and economic forces at work.\nCities are living organisms that constantly change, and the poor and the old and the working class often get pushed around unless they squawk. And some are doing just that.\nMrs. Jackson knows what it takes to fight City Hall, and how hard it is to win. For much of her 93 years, she has alternately scolded city pols or worked alongside them. She’s long been known as the Mayor of Summerhill, a matriarchal community leader who politicians visit at election time to receive her blessing.\nBut nowadays, Mrs. Jackson is a tiny old lady with little of her old clout. Last week, she cast a pitiful shadow as she pleaded before the city’s Urban Design Commission, hoping to gain a modicum of sympathy to be allowed to live out her days on Ormond Street, where she has resided for nearly 50 years.\n“I don’t understand how you can make me leave,” she told the board as family, neighborhood backers and activists crowded around her in support. “I want you to tell me why I have to go. The water doesn’t come into my yard.\n“I belong where I live now. That’s where I was born. That’s where I raised my children. That’s where I worked.”\nMrs. Jackson moved to Ormond Street with her eight children not long after the Summerhill neighborhood was torn apart by construction of the first Braves ballpark and expansion of the adjoining interstates. While she officially resides a few feet in the Peoplestown neighborhood, she won’t hear any of that nonsense. She is Summerhill through and through.\nUrban renewal has left a psychic scar for generations on those who live near the ballpark. Just about any longtime family in that area has a tale of woe.\nNewspaper articles going back to the 1960s document occasions when Mrs. Jackson chided officials to make sure they paid attention to those easily overlooked and pushed aside. She was the neighborhood lady everyone knew; the one who told truants to get their behinds back to school, the one watching out for kids when their mothers worked, the one with an extra meal when someone seemed like they weren’t getting fed at home.\nBeing on the receiving end\nIn 1991, she was appointed to the Atlanta Committee for the Olympic Games (ACOG) after Mayor Maynard Jackson insisted that her voice be on the board. Her aim was always to smooth the impact on the neighborhood, and maybe pull in a few crumbs for her neighbors.\nThere were tough decisions to make. In 1992, a task force recommended paving over seven homes by the interstate to create parking and limit impact on the rest of the community. An old man, who was pushed from Summerhill a generation earlier, grumbled at the unfairness that he was getting the boot again. “They don’t care about who’s in the way,” he said.\nMrs. Jackson chaired that task force. “I don’t like to see nobody have to move,” she said at the time, “but from what was told to me, those people who live in the houses agree with the plan.”\nThis time around, Mrs. Jackson is on the receiving end.\n‘This was our last alternative’\nAnd this time around, the water plan has the unstoppable force of a flood (or an Olympic parking lot). Mrs. Jackson’s block is a natural bowl built over a piped stream that also runs under Turner Field, four blocks away.\nTodd Hill, the Department of Watershed Management’s environmental restoration director, told the urban design commission that 1,500 acres of stormwater and 80 miles of sewer lines converge on Mrs. Jackson’s block.\nThe 2012 flood caused several residents to sue the city, saying the watershed department had not maintained the aging system that combines stormwater and sanitary sewers. Since then, several properties have been razed and other homeowners have settled with the city. Eight households are still hanging.\n“This was our last alternative in the solution for the public good,” Hill said.\nBuyouts ‘the right thing to do’\nResident Tanya Washington said the city has brought forth “insultingly low offers.” The Georgia State University law professor said she cannot buy a similar brick home in the same school district for that. She said her neighbors “settled against the backdrop of a threat: ‘If you don’t settle, we’ll take your home.’”\nBesides, the whole process is bizarre, Washington said. “They are taking homes that don’t flood to save us from flooding.”\nDavy Nixon, a young father and software developer, has lived down the block from Mrs. Jackson for eight years and said the flooding has been severe. He said the city initially low-balled him, but he got his own appraisal and the city ended up kicking in $48,000 more.\nNixon (yes, the three residents I’ve quoted have presidential names) said the buyouts “are the right thing to do.” In fact, the buyout will allow his family expand into a house nearby that is bigger than his current two-bedroom, one-bath bungalow.\nBulldozers are on the way\nThe city did not inform several of the neighbors that the Urban Design meeting was happening last week and the watershed department was asking for approval of homes they do not even yet own.\nStill, it apparently matters little. Several lots, like three next to Nixon, have already been cleared, a majority are owned by the city, and an official said bulldozers are on the way.\nEminent domain is being considered for the holdouts, and it is inconceivable that the city will allow a couple of homes to remain amid the walking trails and retention ponds.\nAnd if the move does not kill Mrs. Jackson, as her daughter worries, then maybe she can come back to visit the gazebo at the park, sit down and reminisce on a long life filled with fighting the good fights.","url":"https://www.ajc.com/news/local/when-city-hall-comes-like-flood-you-sunk/Ha27uQL53laUrUF0dUmW8I/"}
