{"authors":["Emma Madden"],"date_download":"2018-10-31 01:50:48","date_modify":"2018-10-31 01:50:48","date_publish":"2018-09-06 11:07:40","description":"Vampire Weekend have earned worldwide fans with their brand of delightfully absurd rock. Perhaps best known for their 2008 single 'A-Punk', the New York band were practically an overnight success, with their self titled, debut album charting at…","filename":"data/vaneerConsumption/WhenWillVampireWeekendsNewAlbumComeOutInTheUKGetExcitedBecauseItsQuiteSoon.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/ef9edacf-a417-49de-a011-fbc801824931-getty-450585856.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_when-will-vampire-weekends-new-album-come-out-in-the-uk-get-excited-because-its-quite-soon-11764478_1540950648.html","title":"When Will Vampire Weekend's New Album Come Out In The UK? Get Excited, Because It's Quite Soon","title_page":"When Will Vampire Weekend's New Album Come Out In The UK? Get Excited, Because It's Quite Soon","title_rss":"NULL","source_domain":"bustle.com","text":"Vampire Weekend have earned worldwide fans with their brand of delightfully absurd rock. Perhaps best known for their 2008 single 'A-Punk', the New York band were practically an overnight success, with their self titled, debut album charting at number 15 on the UK album charts. Their last album Modern Vampires Of The City went onto win a Grammy at the 2013 awards, but they've not released anything since. Five years later, and they've finally teased a follow-up. Now that it's been completed, when will Vampire Weekend's new album come out in the UK?\nPretty much since their inception, Vampire Weekend have been known as the hipster's band. If you've never heard of them, just step into an Urban Outfitters and you'll be sure to hear them playing. Though they've been quiet for the past few years, owing to multi instrumentalist member Rostam Batmanglij's departure. But, he's since returned, and will be featuring on album number four, as frontman Ezra Koenig confirmed to Entertainment Weekly.\nIn their recent headlining show at End Of The Road festival in Dorset, the band said that the album was \"done, but we'll talk about that later,\" NME reported. And fans at Lollapalooza got a flavour of things to come, as the band played five new songs, according to NME.\nMichael Buckner/Getty Images Entertainment/Getty Images\nA fan in the crowd described the new songs on Reddit as \"more spacey and empty\" and compared it to the folk outfit Fleet Foxes' latest album. It lines up with what the band's been saying about it — though they've not said much.\nKoenig told Entertainment Weekly back in December that he'd been inspired by country star Kacey Musgraves. \"I’ve always really had a thing for really simple forms of folk music,\" he said. But the album seems like it's been a slow battle. A fan tweeted Koenig in Sept. 2017 a picture of a pie she'd baked with the words \"Where's the album\" on it. Koenig tweeted back: \"80 percent done but the last 20 percent is always the hardest.\" He then replied to a fan on his Instagram and confirmed that the album was \"94.5 percent done,\" Spin reported.\nKoenig also revealed a working title on his Instagram in the same month. On the post he wrote: \"Every day I get comments & questions about the next Vampire Weekend album, we gotta take our time & get it right but the fans deserve some information. Working title is still Mitsubishi Macchiato cuz it is a helpful concept.\"\nHe also revealed a couple of song titles, including 'Conversation' and 'Flower Moon'.\nWhile a UK release date hasn't been confirmed just yet, Billboard have speculated that the album could even be with us this month. The site reported on Sony's quarterly financial statement, which has Vampire Weekend listed under \"Noteworthy projects for the quarter ending September 30, 2018.\"\nIf that's to be trusted, then you can expect to be listening to new Vampire Weekend within the next few weeks. It seems unlikely that they'll pull a Taylor Swift, so you can also bet that it'll be on whatever streaming service you use as soon as it's released.","url":"https://www.bustle.com/p/when-will-vampire-weekends-new-album-come-out-in-the-uk-get-excited-because-its-quite-soon-11764478"}
