{"authors":["Kelly Schremph"],"date_download":"2018-10-31 01:41:37","date_modify":"2018-10-31 01:41:37","date_publish":"2018-08-28 11:00:52","description":"It's hard to believe that the fifth season of Younger is about to come to a close, but the good news is that Liza's story is still far from over since the series has already been renewed for a sixth installment. But figuring out when Younger returns…","filename":"data/vaneerConsumption/WhenDoesYoungerReturnForSeason6LizasStoryIsStillFarFromOver.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/26/77bd0a28-9f01-4bb8-916e-be4849532500-younger_510_jw_1130_r.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_when-does-younger-return-for-season-6-lizas-story-is-still-far-from-over-10240506_1540950097.html","title":"When Does 'Younger' Return For Season 6? Liza's Story Is Still Far From Over","title_page":"When Does 'Younger' Return For Season 6? Liza's Story Is Still Far From Over","title_rss":"NULL","source_domain":"bustle.com","text":"It's hard to believe that the fifth season of Younger is about to come to a close, but the good news is that Liza's story is still far from over since the series has already been renewed for a sixth installment. But figuring out when Younger returns for Season 6 could prove to be somewhat difficult, mostly because TV Land has moved the show's premiere schedule all over the map each season.\nYounger made its series debut back in late March 2015, however, the network opted to change up its air date for Season 2, which came out the following January in 2016. You would think perhaps a pattern would start to form by the time the third season rolled around, but think again. TV Land kicked off the third installment only a few months later in September 2016. From there, things have become a little more predictable with the fourth and fifth seasons airing in June, which at least is in the same month as each other. Could this be an indicator of when Season 6 will air as well? As of now, no official premiere date has been announced, but if the show follows a similar formula like it has for the past two seasons, it seems like a safe bet that Younger will return sometime around June 2019.\nAgain, this is only a prediction and not an outright confirmation of any sort, so don't start marking your calendars just yet. Regardless, you'll have to enjoy every moment of the Season 5 finale — since there's no telling when you'll be able to get your next Liza, Kelsey, Diana, Charles, and Josh fill. Judging by the promo for Tuesday's episode, there's a lot that Liza needs to figure out.\nWill she really leave Empirical for a job at Plaza Publishing and no longer need to hide her age from anyone? Considering it would also allow her and Charles to go public with their relationship, the opportunity seems a little too good to be true. Plus there's the fact that Cheryl just spotted Liza leaving Charles' hotel room, so there's a chance she could turn the tables on Liza and rescind the offer.\nkittyc16 on YouTube\nThe whole premise of the show centers around Liza's secret, so if that no longer became a problem, could the show still go on? Hopefully, the finale will help to shed some light on the direction the series will be taking. But either way, TV Land definitely seems to have confidence in Younger's future.\n“Younger exemplifies romantic comedy at its best and each season the show hits new creative and ratings heights,” Kevin Kay, president of TV Land, CMT and Paramount Network said when he announced the renewal of Younger with Keith Cox ahead of Season 5, according to Deadline. “We are honored to continue to work with the brilliant Darren Star and this amazing cast, led by the multi-talented Sutton Foster. The new season is outstanding and we are thrilled for what’s to come for these beloved characters.”\nThankfully, Younger has another full season to reinforce those sentiments once again.","url":"https://www.bustle.com/p/when-does-younger-return-for-season-6-lizas-story-is-still-far-from-over-10240506"}
