{"authors":["Nina Kahn"],"date_download":"2018-10-31 01:39:08","date_modify":"2018-10-31 01:39:08","date_publish":"2018-08-29 21:23:34","description":"We’re all suffering from a little bit of end-of-summer denial here, OK? But deny as we may, the dog days keep getting shorter, Labor Day weekend is most certainly mere days away, and pumpkin spice has already made its grand entrance — so you know…","filename":"data/vaneerConsumption/WhensTheBestTimeToGetAFluShotThisIsWhatTheCDCRecommends.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/29/bc572804-906c-4f36-862d-431ee9548cf1-getty-462420480.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_whens-the-best-time-to-get-a-flu-shot-this-is-what-the-cdc-recommends-10940385_1540949948.html","title":"When’s The Best Time To Get A Flu Shot? This Is What The CDC Recommends","title_page":"When’s The Best Time To Get A Flu Shot? This Is What The CDC Recommends","title_rss":"NULL","source_domain":"bustle.com","text":"We’re all suffering from a little bit of end-of-summer denial here, OK? But deny as we may, the dog days keep getting shorter, Labor Day weekend is most certainly mere days away, and pumpkin spice has already made its grand entrance — so you know colder days are undoubtedly ahead. Subsequently, this means that flu season 2018 is also on the horizon, so you're probably wondering about when might be the best time to get a flu shot.\nAccording to the Center for Disease Control (CDC), flu season in the U.S. spans from around late fall through early spring, with the majority of influenza cases being reported in January or even later. But if you've been inside a pharmacy lately, you've likely already seen the signs encouraging you to jump in line and get vaccinated against the flu ASAP. With fall around the corner, it doesn't seem totally unreasonable to hop on the train now — but is there a better time to make the move?\nApparently so, according to the CDC. The organization released its official recommendations on Aug. 24, which suggest that by the end of October is the best time to line up for your flu shot. The reason behind the suggestion to hold off on the shot for potentially another couple months lies in the fact there are, as the CDC puts it, \"concerns that vaccine-induced immunity might wane over the course of a season\" — or in other words, that the protection you get from the vaccine could wear off and be less effective later in the season, when influenza is still rearing its ugly head. Given that the peak of flu season usually doesn't even occur until January or even later, you could be making yourself vulnerable down the road by going for the shot too early.\nThat said, the report also recognized that there's no single perfect time to get the flu shot, as flu season can absolutely vary year to year due to all sorts of factors, sometimes starting earlier or seeing its peak during a different month. The recommendations, though, are based on averages and trends seen throughout the past several decades. So while flu season is technically unpredictable, it's safe to say there's a decent chance things will fall somewhere within the suggested range.\nApart from the flu vaccine, there are still other things you should start doing immediately to try to protect yourself. Getting regular exercise and eating a healthy, balanced diet is always important, but during flu season their immunity-boosting effects are even more vital. Getting a full night of sleep is also huge as far as your immunity goes, as studies show that sleep deprivation suppresses your immune system and leaves you more susceptible to infectious colds and flu viruses. Also, try to get into habits that help prevent the spread of germs, such as washing your hands frequently, keeping your fingers out of your eyes, nose, mouth, and even ears (as those are all prime areas to allow for germs getting into your system), and carrying around your trusty hand sanitizer so you can keep yourself protected on the on the go.\nLast year's flu season was a pretty rough one. Described as a \"high severity season\" by the CDC, millions of people were affected, and it at one point reportedly resulted in thousands of deaths each week. Flu deaths among children tragically reached record-breaking highs, as well. And dangers aside, being laid up feeling miserable and burning through your sick hours — especially around the holidays — is never good, so do what you can to stay healthy. And if you are going for the flu shot, consider waiting until October for maximum effectiveness.","url":"https://www.bustle.com/p/whens-the-best-time-to-get-a-flu-shot-this-is-what-the-cdc-recommends-10940385"}
