{"authors":[],"date_download":"2018-10-31 00:07:47","date_modify":"2018-10-31 00:07:47","date_publish":"2016-12-30 00:00:00","description":"One in four El Monte residents lives in poverty. Yet taxpayers pay a steep price to fund bonus pensions and other perks for city workers.","filename":"data/vaneerConsumption/Whencityretirementpaysbetterthanthejob.json","image_url":"https://www.trbimg.com/img-58648454/turbine/la-me-el-monte-pension-20161227-photos-014/700","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/latimes.com/projects__1540944467.html","title":"When city retirement pays better than the job","title_page":"When city retirement pays better than the job - Los Angeles Times","title_rss":"NULL","source_domain":"calmatters.org","text":"James Mussenden doesn’t bring up his pension in casual conversation. No point getting his golf partners’ blood boiling. This series is a partnership of The retired city manager of El Monte collects more than $216,000 a year, plus cost-of-living increases and fully paid health insurance. “It’s giving me an opportunity to do a number of things I didn’t get to do when I was younger, like travel to Europe, take some things off my bucket list,” Mussenden, 66, said recently. He even flew to Scotland to play the famed Old Course at St. Andrews, a mecca for golf enthusiasts. Mussenden recognizes that few Americans have pensions anymore — least of all the El Monte taxpayers who are funding his retirement. So while he enjoys his monthly retirement check, he’s discreet about it. “The guys I play golf with, they get very angry about my pension because they don’t have anything like it,” he said. Actually, Mussenden has two pensions. He’s part of a coterie of former El Monte civil servants who receive one taxpayer-funded pension through the California Public Employees’ Retirement System (CalPERS) — and a second through a “supplemental” plan approved by the city council in 2000. The extra pensions, along with other sweeteners granted to El Monte employees over the years, have created one of the heaviest public pension burdens of any city in California, a Los Angeles Times investigation found. ADVERTISEMENT El Monte’s retirement costs totaled $16.5 million this year. That’s equal to 28% of the city’s general fund. Among California’s 10 largest cities, only San Jose paid as much toward retirement costs relative to its general fund. Los Angeles spends 20% of its general fund on retirement costs. El Monte’s outsize pension bill weighs heavily on the San Gabriel Valley city of 116,000, where half the residents were born outside the United States and a quarter live below the poverty line. The idea for the supplemental plan arose in 2000, after the city council granted El Monte police officers the right to retire with up to 90% of their highest salary guaranteed for life. The state and many other cities had approved similar benefits for public safety officers, part of a wave of pension enhancements adopted when pension funds were flush with cash from a stock market boom. But it created a gap between El Monte police and the city’s non-uniformed employees: Under CalPERS rules, civilian pensions were capped at two-thirds of final salary. Then-City Manager Harold O. Johanson and other top administrators thought that was unfair, since they supervised the police department. So they pitched the city council on the supplemental plan. May 9, 2000 Two pensions are better than one Resolution No. 8017, adopted unanimously by the El Monte City Council, established a “supplemental retirement plan” for civilian employees, on top of their existing pensions. It would boost civilians’ retirement checks by 50% and put their pensions nearly on a par with police. The city council approved the idea in May 2000, unanimously and without public debate. Johanson retired three years later, at 58. Today, he is the top beneficiary of the program he championed, collecting a combined pension of more than $250,000 per year, state and city records show. That puts him in the top one-hundredth of one percent of all public pension recipients in California. In El Monte, a city in the San Gabriel Valley, a bonus pension approved by the City Council in 2000 generates a big bill for taxpayers. Here's how it works. Mussenden, who was city manager from 2006 to 2009, is not far behind. He is among El Monte’s top five recipients of public pensions and one of at least eight who receive $200,000 or more a year. The city closed the supplemental plan to new employees in 2008 because of its high cost, and the legislature later prohibited such plans. But more than 200 active and retired El Monte workers who got in before the cutoff will enjoy the plan’s benefits for life. Between his regular and bonus pensions, Johanson, 72, has received approximately $3 million since retiring. Asked if his service to the city was worth that much, he said, “Probably not.” “I have to admit that we made the mistake back then, and I have to admit that I make too much money now, but what can I do?” Johanson said in an interview, adding that he contributes time and money to local charities. “ I have to admit that I make too much money now, but what can I do? ” — Former El Monte City Manager Harold O. Johanson Share this quote Bonnie Jimenez, a former El Monte city councilwoman who voted for the plan in 2000, said in a recent interview that she was “flabbergasted” to learn how much Johanson is collecting. “It wasn’t explained to us that we would be paying so much in the future, or that some people would be making more in retirement than when they were working,” Jimenez said. June 15, 2000 Sealing the deal Then-City Manager Harold O. Johanson signed a trust agreement with Union Bank to manage the assets of El Monte’s supplemental pension plan. The plan was overseen by Public Agency Retirement Services of Newport Beach.\n“Golden handshakes” To fund public pensions, government agencies and their employees both kick in a percentage of every paycheck. CalPERS invests that money, and the returns are supposed to ensure that there is sufficient cash available to pay employees’ pensions when they retire. El Monte has a history of generous employee benefits — including a four-day work week for civil servants, who put in 10 hours a day and have Fridays off. Liberal pension provisions are another part of that tradition. Under state law, police are supposed to contribute 9% of their paychecks toward their pensions, and civilian workers 7%. But El Monte covers the employee contribution as well as the employer share, a legacy of collective bargaining agreements dating to the early 1980s. On top of that, retired El Monte employees receive annual cost of living increases at the high end of what CalPERS allows: up to 4% for police retirees and 5% for civilians, depending on inflation. Most CalPERS pension recipients receive increases of 2% annually. Benefits that lavish do not come cheap: For every $100 the city paid a police officer in 2016, it had to pay an additional $71 to CalPERS to fund payments to current and future retirees. For every $100 the city paid a police officer in 2016, it had to pay an additional $71 to CalPERS to fund payments to current and future retirees. Share this That is the highest employer contribution rate among the more than 3,000 counties, cities, and local authorities that participate in the state retirement system. The average rate for public safety agencies is 38% of officers’ salaries, according to CalPERS. In 2000 and again in 2011, El Monte granted certain employees two years of extra service credit to encourage early retirements. The California legislature has since prohibited such incentives — sometimes called “golden handshakes” — but past enhancements are baked into El Monte’s pension costs for years to come. Because so many employees have been able to retire early on lucrative terms, El Monte has more than twice as many retirees drawing pensions as it does active employees, CalPERS documents show. Because so many employees have been able retire early on lucrative terms, El Monte has more than twice as many retirees drawing pensions as it does active employees. Share this “That is a huge disparity,” said Randy Dziubek, senior actuary for CalPERS. “Most agencies have many more active employees than retirees.” Most of the taxpayers who are footing the bill for public pensions have no pensions themselves, and very little to fall back on. About a third of Americans between 55 and 64 have no retirement savings, according to the Center for Retirement Research at Boston College. ADVERTISEMENT For those who work for private companies with 401k plans, the median employer contribution equals 3% of salary, according to Vanguard Investments. El Monte’s pension sweeteners were approved over the years by the five-member city council, typically without debate or public controversy. Few residents of the working class city, which straddles the 10 Freeway, have the time or inclination to keep a close eye on city government. That means much of the public’s business is “hidden in plain sight,” said Mayor Andre Quintero, who was born and raised in El Monte by immigrant parents, attended UCLA law school and is now a prosecutor for the Los Angeles City Attorney’s office. “We saw what corruption on steroids looked like in the City of Bell,” Quintero said, referring to the L.A. County city that became a byword for excessive public salaries. “But it’s not always as obvious as that. Sometimes it’s more subtle. You don’t pay people on the front end. You pay them on the back end.” El Monte Mayor Andre Quintero says that pension sweeteners for public workers are a subtle form of corruption. \"You don’t pay people on the front end,\" he said. “You pay them on the back end.” (Rick Loomis / Los Angeles Times) “ We saw what corruption on steroids looked like in the City of Bell, but it’s not always as obvious as that. Sometimes it’s more subtle. You don’t pay people on the front end. You pay them on the back end. ” — El Monte Mayor Andre Quintero Share this quote\n“He was outraged” El Monte probably would have been driven into bankruptcy years ago by retirement costs, Quintero said, if not for a little-known facet of city finances: an extra levy on property taxes to pay for pensions. Approved in 1946, the line on the bill reads “City-El Monte,” without further explanation. It’s listed with other common property tax add-ons for schools and the municipal water district. It costs owners an extra 0.15% of the assessed value of their property. The owner of a $442,000 house — the median sales price in El Monte, according to zillow.com — pays $663 a year for city employees’ pensions, on top of regular property taxes. The money goes into a special fund for pensions. Of 88 cities in Los Angeles County, El Monte is one of just 12 with pension surcharges. Former city manager Rene Bobadilla, who was born and raised in El Monte, said he hadn’t noticed the surcharge on his tax bill until he went to work for the city in 2008. He remembers showing it to his father. “When I told him it was for my pension, he was outraged,” Bobadilla said. The levy generated $9.4 million last year, according to the city budget. That was not nearly enough to cover El Monte’s pension costs. The city owed CalPERS $12.6 million, plus $2 million for the supplemental pensions and $1.9 million for retiree healthcare. What didn’t come from the pension levy had to be paid from the city’s general fund. The current city manager, Jesus Gomez, said the cost of retirement benefits is at “the top of the list of things that keep me up at night.” Jesus Gomez, the current El Monte city manager, says the city's pension obligations are at “the top of the list of things that keep me up at night.” (Rick Loomis / Los Angeles Times)\n“An extreme benefit” El Monte’s pension problem stems in part from decisions made in Sacramento in 1999, at the end of a decade-long bull market that tripled the value of the state’s massive public pension fund. The CalPERS board of directors, dominated by public employee union leaders and their political allies, voted to spend the surplus lowering retirement ages and raising pensions for all state employees. The Great Recession arrived a few years later, wiping out CalPERS’ stock market gains — but not before more than 200,000 civil servants became eligible to retire at 55, many with more than half their salaries guaranteed for life. The Pension Gap: Read the story California Highway Patrol officers got an especially sweet deal. Their pensions had been 2% of their highest salaries, multiplied by the number of years they worked. The percentage of peak salary was raised to 3%. That meant officers with 30 years of service could collect up to 90% of their highest pay for life. And they would be eligible to retire at 50. Police unions across the state demanded equal treatment. El Monte adopted the new pension formula (known as “3% at 50”) in 2000, and the effect was dramatic. Officers who retired before 2000 with more than 25 years of service collect $82,000 a year on average, according to CalPERS data. Those who retired after 2000 collect an average of $120,000. That list includes four former chiefs and a former captain, who retired in their 50s and now receive more than $200,000 a year each. El Monte Police Sgt. Jimmie Pitts said he had a business washing big rig diesel trucks before joining the department two decades ago. He changed careers at least in part for the financial stability, he said, but not specifically for the pension. Few people in their mid-twenties think that far ahead. “Is retirement good here? Yes. Did I know it when I came here? Not necessarily,” Pitts said. Pension benefits for El Monte police officers were significantly improved in 2000, widening the gap with civilian employees. Then-City Manager Harold O. Johanson thought something should be done. (Irfan Khan / Los Angeles Times) Art Saenz, president of El Monte’s police union, admitted that he was a bit more calculating. When he was deciding where to apply for a job as a police officer 10 years ago, he compared departments and noticed that El Monte paid employees’ share of the pension contribution, as well as the employer’s. “I always looked at it as an extreme benefit, and that’s what drew me to actually work here,” said Saenz, a detective. “I don’t know what the city managers were thinking.”\n“We could afford it” Johanson, who began working for El Monte as a planning intern in 1967, was city manager in 2000 when the council approved “3% at 50” for police officers. He and his fellow top administrators were eligible for 2% at 55 under CalPERS rules. They thought there shouldn’t be “such a large gap between the people who supervise the police department and the officers,” Johanson recalled in a recent interview. A private firm, Public Agency Retirement Services (PARS) in Newport Beach, was pitching supplemental pension plans that would allow local officials to augment their already generous CalPERS benefits. Support our public service journalism Become a Los Angeles Times subscriber today to support collaborations like this one. Start getting full access to our signature journalism for just 99 cents for the first four weeks. Johanson said he’s not sure whether he reached out to PARS or vice versa. But he recalled that the company, which designs and administers public pension plans, “had some pretty good salesmen.” Johanson brought the idea to city council members, who approved by a 5-0 vote. The plan covered most of the city’s non-uniformed employees and provided bonus pensions equal to 1% of their final salaries, multiplied by their years of service. Combined with their CalPERS benefits, they receive “3% at 55” — not quite as generous as police pensions, which kick in as early as age 50, but close. The city makes regular contributions to the PARS plan, just as it does to CalPERS, and the money is invested. In return, the city pays PARS a monthly charge — now more than $6,000 — plus a fee equal to about 1% of the pension assets under its management every year. Employees make no contribution toward their bonus pensions; city taxpayers bear the entire burden. July 2000 Courtesy of taxpayers A plan summary for the supplemental pensions said that “no employee contributions are required to participate.” El Monte taxpayers would bear all the costs. Minutes of the May 9, 2000, meeting where the plan was approved show that council members talked, among other things, about the design of an aquatic center and whether the city was insured for a river-rafting trip for city youth — but had no discussion about the supplemental pensions. Jimenez, 78, who served on the council from 1997 to 2001, said she doesn’t recall casting her “yes” vote. Art Barrios and Anthony Fellow, the other surviving council members who voted on the measure, did not respond to requests for comment. Neither did then-mayor Rachel Montes, whose signature appears on the resolution authorizing the supplemental pensions. None of the elected officials who approved the plan receive benefits through it. Johanson, who signed the final agreements with PARS, said the plan was seen as a way to attract and retain talented employees. “Times were good in El Monte,” he said. “We could afford it.” May 9, 2000 No opposition El Monte’s five-member city council approved the supplemental plan unanimously. Johanson retired in 2003 with a final salary of $197,000. With cost of living increases, his combined pay from his CalPERS and supplemental pensions reached $252,687 this year, state and city records show. Charles Hoffman, 65, a retired employee of Pasadena’s Water and Power Department, is one of the few El Monte residents who regularly attend city council meetings. Hoffman said he has heard city pensions mentioned in passing at meetings, but had no idea how much they cost taxpayers. Former employees who get paid more in retirement than they did when active “are just slopping at the public trough,” Hoffman said. “They’re taking advantage of the system.” “ (They) are just slopping at the public trough. They’re taking advantage of the system.” ” — Charles Hoffman, retired employee of Pasadena’s Water and Power Department Share this quote Charles Hoffman, 65, center, is a rarity in El Monte – a resident who regularly attends city council meetings. Even he was not aware how much El Monte’s employee pensions cost taxpayers. (Rick Loomis / Los Angeles Times) Contact the reporter. Follow @JackDolanLAT on Twitter and listen to the weekly California Politics Podcast.\nAdditional credits: Lily Mihalik\nCalifornia's Pension Crisis Sign up for our Essential Politics newsletter to receive more stories like this Privacy policy","url":"http://www.latimes.com/projects/la-me-el-monte-pensions/"}
