{"authors":[],"date_download":"2018-10-30 21:54:54","date_modify":"2018-10-30 21:54:54","date_publish":"2016-12-19 12:27:00","description":"Times Square drops an Apple. Atlanta lowers a giant peach. Elsewhere in Georgia, you can ring in 2017 watching a Buzzard, Possum or Peanut drop on NYE","filename":"data/vaneerConsumption/WhenistheAtlantaPeachDrop2016.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/19/Images/newsEngin.17185213_SAM_1476.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_peach-drop-pe_b5a1016e1ce8e26d030f7cc1a0173c4c__icmp=AJC_internallink_122016_digesttease_1220_1540936494.html","title":"When is the Atlanta Peach Drop 2016?","title_page":"When is the Atlanta Peach Drop 2016?","title_rss":"NULL","source_domain":"ajc.com","text":"Times Square on New Year’s Eve?\nToo Square!\nSeriously, how many years can they smoosh about a million people together on a few frigid city blocks to watch a Waterford Crystal ball sloooowly descend without it all getting to feel a bit stale?\nYou’re much better off staying in Georgia, this Dec. 31. From north to south, in big cities and teeny towns, they’re putting their own highly creative and representive twist on the traditional ball drop.\nAt midnight, everything from an oversized possum and a shamrock to — yes, really — a big buzzard wearing a formal top hat will come on down to help usher in 2017.\nMeanwhile, leave it to Savannah not to play by the usual rules. Rather than a dull old drop, Party Town on the River will be raising something at midnight instead. No, not heck. But pretty darned close.\nRead on for all the details on how to have a fun new take on Auld Lang Syne there and elsewhere in the state this New Year’s Eve.\nPeach Drop, Atlanta\nUnderground Atlanta, 50 Upper Alabama St. Atlanta. Free. 404-523-2311, www.underground-atlanta.com\nThe fruit that started it all, the largest New Year’s Eve celebration in the Southeast attracts big name musical performers (this year’s lineup hasn’t been announced yet. UPDATE: Read the AJC’s exclusive on who’s performing) and enormous crowds (swelled even more this year, no doubt, by folks in town for that afternoon’s Chick-fil-A Peach Bowl playoff game between Alabama and Washington). This year’s peach descent just before midnight will be especially bittersweet; Underground Atlanta has been sold to a developer, meaning this will likely be the final Peach Drop there.\nNugget Drop, Dahlonega\n6 p.m. - midnight, Dahlonega Town Square area. $10, 12 and under admitted free (admission “buttons” can be purchased online). www.dahlonegafirstnight.org.\nThe drop is a highlight of First Night Dahlonega, a family friendly celebration of the new year that also raises money for Jeremiah’s Place,which provides transitional housing and support for homeless families in Lumpkin County. The button gets you into all of the vocal and instrumental performances that will be going on at the Historic Holly Theatre and three churches located in the area of the square. There’ll also be activities at Hancock Park, and a vintage car show courtesy of The North Georgia and Dahlonega Car Club. Playing off of Dahlonega’s colorful history as a gold rush town, there are actually two nugget drops — a kids-focused one at 9:30 p.m. — and the biggie at midnight, featuring a golden nugget fashioned by local high school students that descends 30 feet into the square.\nBuzzard Drop, Perry\n9 p.m. - 12:15 a.m. Courthouse Square, Carroll St., Perry. Free. 478-988-2720, www.perrybuzzarddrop.com\nThis is the fourth go-round for this unique celebration, created in honor of what the Middle Georgia town describes as the “much-anticipated or despised return of (hundreds of) Buzzards each fall to Perry … Their favorite haunt, well known to locals, is the water tower.” Featuring food and spirits vendors, plus music by Atlanta band Sweetwater Junction. At 10:30 p.m. The Buzzard Boogie dance contest takes place with a $100 cash prize to the winner. It all culminates with the midnight drop of “Bob the Buzzard” from a water tower.\nRELATED: Atlanta New Year’s Eve concerts 2016: Indigo Girls, Michelle Malone, Yacht Rock Revue and more\nShamrock Drop, Dublin\n8 p.m. - midnight, Downtown Dublin. Free. 478-272-4002, www.visitdublinga.com\nA street party featuring dancing, live music, vendors, food and drink, largely in the area around the Dublin Theatre (314 Academy Ave.). At 8:30 p.m. there’ll be a free screening of “The Secret Life of Pets” at the the theater. Then, just before midnight for reasons we shouldn’t have to explain, this Middle Georgia town locate some 50 minutes west of Macon will drop a glittering shamrock from the roof of the historic Fred Roberts Hotel (306 Academy Ave.).\nMORE: Emory professor explains why we get — and give — such bad Christmas presents\nIt’s official: Santa’s reindeer cleared for flight on Christmas Eve\nPeanut Drop, Plains\n10 p.m. Plains Community Center courtyard (located behind the Plains Historic Inn), 106 Main St. Free. 229-824-4517, www.plainsinn.net.\nThis tiny town in Southwest Georgia is renowned for two things: Being the lifelong home of former President Jimmy Carter and his wife, Rosalynn. And producing peanuts (the Carters grew and sold peanuts before he went to the White House). This year, instead of waiting until midnight to drop an oversized peanut, they’re doing it two hours earlier. “We’re using the theme, ‘It’s 12 o’clock somewhere,” quipped Plains Better Hometown director Ruth Sanders.\nPossum Drop, Tallapoosa\n5 p.m. - midnight, downtown Tallapoosa. Free. 678-250-Drop ( 3767 ), www.thepossumdrop.com\nOne of the biggest and best-known drops in the state, it’s an homage to the West Georgia town’s onetime name of “Possum Snout.” There’ll be food, a Kids Zone and lots of entertainment. Among the musical acts playing on two stages at Head Avenue and West Alabama Street are On the Border, aka “the ultimate Eagles (tribute) band,” “South of Nashville” and “Eric Scheider as Elvis.” Beloved radio DJ Rhubarb Jones hosts at 8 p.m. and leads the countdown to Spencer the possum’s descent from the American Hometown Realty building (129 Head Ave.) starting just before midnight. It ends with a big fireworks display.\nDropping of the Edelweiss, Helen.\n8 p.m. - midnight, Helen Festhalle, 1074 Edelweiss St., Helen. $15 per person, $25 per couple, half-price ages 6-12, under 6 free. 706-878-1908,www.helenchamber.com.\nA family friendly event featuring music, dancing, food and drink (including a cash bar for adults). Come midnight, the little recreated Bavarian Alpine village in the North Georgia mountains will welcome in 2017 by lowering a version of the white flower that dot German mountainsides.\nGeranium Drop, McDonough\n8 p.m. - midnight, McDonough Town Square. Free. 770-898-3196,visitmcdonoughga.com.\nDance, listen to live music (lineup not yet announced) and enjoy food and drink specials from downtown restaurants in the place synonymous with a certain locally grown colorful flower (there’s been a giant Geranium Festival there each May for the past 39 years). The giant geranium starts to drop as midnight approaches.\nUp the Cup, Savannah\n8 p.m. - midnight. Rousakis Riverfront Plaza, 115 East River Street, Savannah. Free. 912-234-0295, www.riverstreetsavannah.com\nWhen you’re known as the best place to party on St. Patrick’s Day and pretty much every other day of the year, you really have to raise an (oversized) toast to yourself on New Year’s Eve. At least that’s the thinking in Savannah, where along with the usual fun on River Street, there’ll be a digital light show, a countdown clock and then at midnight, the raising of a what-could-be-more-perfect symbol: A six-foot-tall version of the classic party-hearty “to-go” cup! It’ll be followed in the night sky by a major fireworks display.","url":"https://www.ajc.com/entertainment/peach-drop-peanut-drop-possum-drop-only-georgia-new-year-eves/GO1rhRIyDTUYvI8QJ8LciP/?icmp=AJC_internallink_122016_digesttease_1220"}
