{"authors":["Brittany Bennett"],"date_download":"2018-10-31 01:43:53","date_modify":"2018-10-31 01:43:53","date_publish":"2018-08-27 21:38:00","description":"When everything else seems ~up in the air~ we at least have the stability of the lunar cycle to keep us grounded. Every month — with the occasional exception — we can rely on there being a new moon and a full moon. Whether you're looking to set…","filename":"data/vaneerConsumption/WhenIsTheSeptember2018NewMoonItsGoingToBringPositiveVibesToAllZodiacSigns.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/3d99b8f6-7b5d-4d1f-8bc5-aeac82a7ac5d-getty-1007873708.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_when-is-the-september-2018-new-moon-its-going-to-bring-positive-vibes-to-all-zodiac-signs-10251629_1540950233.html","title":"When Is The September 2018 New Moon? It’s Going To Bring Positive Vibes To All Zodiac Signs","title_page":"When Is The September 2018 New Moon? It’s Going To Bring Positive Vibes To All Zodiac Signs","title_rss":"NULL","source_domain":"bustle.com","text":"When everything else seems ~up in the air~ we at least have the stability of the lunar cycle to keep us grounded. Every month — with the occasional exception — we can rely on there being a new moon and a full moon. Whether you're looking to set spiritual intentions for the cycle ahead or plant literal seeds in your actual garden, these lunar bookends offer guidance to us Earthlings. And because of that, you might want to know when the September new moon is.\nSeptember excites us with the first crunchy leaves of the highly anticipated fall season and the whiff of back-to-school binders fresh from the shelves. There is an essence of new in the air. A new season, back to school wardrobe, class schedule and also, the moon. On Sept. 9, 2018 the moon will be new in Virgo. It's the start of a new cycle, a time to grow something abundant, full of fruit, from a seed. True to back to school season, this new moon might inspire you to revamp your ideas.\nWhile the full moon makes itself a spectacle, the new moon doesn't exactly glow like a lunar marquee. Its lack of light during this phase is courtesy of the moon being positioned between the earth and the sun. Britannica explains, \"the side of the Moon that is in shadow faces Earth.\" Thus, we can't see it. But without the illuminated rock hogging the night sky, we'll be treated to exceptional stargazing. Like a theater of twinkling constellations.\nAccording to timeanddate.com, the new moon will be precisely at 2:01pm on Sept. 9, 2018. If you're looking to set intentions for the moon cycle ahead, astrology.com said, \"this lunation is perfect for breaking down complex problems and finding simple, step-by-step solutions. After all, Virgo rules digestion — and that applies to facts as well as food. This sign teaches us to 'digest' information by discerning what’s useful and discarding the rest. That way, we have the bandwidth to focus on things that really matter.\" In the dark of the new moon, we won't be distracted and overwhelmed by all the avenues and options that surround us. There's still a lot you can see when your eyes adjust to the dark.\nThe effects of this new moon won't just last one night, according to Astrology King. The astrology site reported, \"The effects of the September 9 new moon will last four weeks up to the October 8 new moon. The best time for making a fresh start and for beginning new projects is during the first two weeks of this new moon cycle.\" If you're hoping to set intentions for the season ahead and turn a new (crunch!) leaf over, the energy is ripe with potential until the next cycle.\nAstrology.com continued to offer insight into setting intentions for the new moon ahead, suggesting, \"when we plant our own seeds at this new moon, it’s important to make sure the intentions behind them line up with our highest values and ideals. The gap between who we are and who we’d like to be can feel painfully wide at times, but there’s always something we can do to narrow it. Just take things one small step at a time — an approach that comes naturally to thoughtful, meticulous Virgo.\"\nTry to resist rushing through this cycle to the next one. There will always be another new moon, another energy to harness. But here, at this one, in tune with Virgo's efficient ways, there is an opportunity to begin building something that might just be substantial enough to come with you through the next few moon cycles.","url":"https://www.bustle.com/p/when-is-the-september-2018-new-moon-its-going-to-bring-positive-vibes-to-all-zodiac-signs-10251629"}
