{"authors":["Robert Cottingham For Mailonline"],"date_download":"2018-10-23 01:04:09","date_modify":"2018-10-23 01:04:09","date_publish":"2017-04-26 11:07:23","description":"The 2017 NFL Draft will see all 32 teams select the cream of the crop from colleges all across America. For the first time since 1961 the NFL draft will take place in Philadelphia.","filename":"data/vaneerConsumption/WhenisNFLDraft2017Timedateschedulemockdraft.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9EDC1300000578-0-image-a-19_1493200481334.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_nfl_article-4446750_When-NFL-Draft-2017-Time-date-schedule-mock-draft_1540256649.html","title":"When is NFL Draft 2017? Time, date, schedule, mock draft","title_page":"When is NFL Draft 2017? Time, date, schedule, mock draft | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The 2017 NFL Draft will see all 32 teams select the cream of the crop of talented players from colleges all across America.\nFor the first time since 1961 the draft will take place in Philadelphia - in front of the city's Museum of Art - as NFL commissioner Roger Goodell will read out the names of the youngsters who will become the future stars of the league.\nBut with at times a confusing format and so much potential for drama across the selections - Sportsmail have sought to answer a few of the big questions heading into the 82nd edition of the NFL draft.\nNFL commissioner Roger Goodell with last year's No 1 selection California's Jared Goff\nHow does the NFL Draft work?\nThe draft is made up of seven separate rounds taking place over three days (on April 27-29 this year) but obviously the first round is by far the most anticipated.\nEach NFL franchise gets one selection per round and teams are placed in order of their records last season - with the worst team selecting first and the Super Bowl winners picking 32nd - though the order gets muddled if teams opt to trade their pick.\nThe teams each congregate their organisation's brightest minds to meet up, react to picks, field trade offers and eventually make their selections in the aptly-named 'War Room' - in the first round they are afforded ten minutes to do so.\nThose selections are then handed to commissioner Goodell who reads out the selections before being joined by the college players on stage to hand them their new team's jersey and cap.\nRoger Goodell will read out the selections of NFL teams at the 2017 draft in Philadelphia\nSan Francisco 49ers executives and scouts discuss selections during the 2016 NFL Draft\nWho are likely to be the top selections in the 2017 draft?\nFreak of nature defensive end Myles Garrett is widely considered to be the best prospect in the country. The Texas A&M star proved a wrecking ball to college offences all season, sacking quarterbacks 31 times in the NCAA's most competitive conference across his three-year career.\nThe second-best prospect is less clear cut. Son of a former 1985 first-round pick, LSU safety Jamal Adams has dazzled scouts with his athleticism and leadership. He consistently makes big plays through interceptions and tackles as the last line of defence.\nNFL scouts have been blown away by the sheer athleticism of Texas A&M's Myles Garrett\nStanford defensive end Solomon Thomas is rated as an elite edge rusher who terrorises quarterbacks.\nLinebacker Reuben Foster dominated even in Alabama's elite defence - though concerns remain over a shoulder injury and he has not been invited to attend the draft due to what was described as a 'heated argument' at this year's combine.\nLSU's Jamal Adams makes one of his many tackles last season on Louisville's James Quick\nWhat about the quarterbacks?\nUncertainty reigns over 2017's crop of quarterbacks. Mitchell Trubisky of North Carolina looks prepared for the step up having developed a great understanding of pressure in the pocket but question marks remain over his experience having attempted only 446 passes last season.\nDeShaun Watson boasts big-game pedigree having won the NCAA Championship with Clemson this season but is judged to have little potential to develop further.\nTexas Tech's maverick Patrick Mahomes II meanwhile represents a wildcard. He boasts an incredibly strong arm and the capability to make game-winning plays but can also prove careless and overly-risky - a huge turnoff for NFL scouts.\nMitchell Trubisky of North Carolina impressed with his pocket presence this season\nPatrick Mahomes II of Texas Tech is viewed by many scouts as a gamble at quarterback\nWho has the top selections?\nThe perennially-hapless Cleveland Browns have a history of messing up the draft but seemingly can't go wrong with the No 1 pick here - especially with Garrett warning he would 'destroy' them if they didn't select him.\nThe San Francisco 49ers and Chicago Bears select 2nd and 3rd and could be tempted to reach for a quarterback early to reignite their fan bases despite relative pessimism over this year's class.\nSuper Bowl winners New England Patriots have already traded away their bottom pick to the New Orleans Saints.\nCleveland Browns' general manager Sashi Brown will be a key decision-maker for the No 1 pick\nWhat happened in the 2016 NFL Draft?\nWhile judgements cannot be made this early, the Los Angeles Rams' selection of Jared Goff at No 1 looks to be an error with the quarterback looking a fish out of water this season.\nThat selection looks worse considering Philadelphia Eagles selection at No 2 of fellow quarterback Carson Wentz proved an instant hit - Cleveland proved their ineptitude by trading that second selection away.\nDrama engulfed the first round when Mississippi's Laremy Tunsil, rated by some as a top-three pick pre-draft, fell to the Miami Dolphins at 13 after a video emerged minutes before the draft of him smoking a bong through a gas mask.\nJared Goff struggled when thrust into the Los Angeles Rams starting quarterback position\nOffensive tackle Laremy Tunsil fell to the Miami Dolphins at pick 13 in the 2016 NFL draft\nFull draft order for 2017 NFL Draft\n1 Cleveland Browns\n2 San Francisco 49ers\n3 Chicago Bears\n4 Jacksonville Jaguars\n5 Tennessee Titans (traded from Los Angeles Rams)\n6 New York Jets\n7 Los Angeles Chargers\n8 Carolina Panthers\n9 Cincinnati Bengals\n10 Buffalo Bills\n11 New Orleans Saints\n12 Cleveland Browns (traded from Philadelphia Eagles)\n13 Arizona Cardinals\n14 Philadelphia Eagles (traded from Minnesota Vikings)\n15 Indianapolis Colts\n16 Baltimore Ravens\n17 Washington Redskins\n18 Tennessee Titans\n19 Tampa Bay Buccaneers\n20 Denver Broncos\n21 Detroit Lions\n22 Miami Dolphins\n23 New York Giants\n24 Oakland Raiders\n25 Houston Texans\n26 Seattle Seahawks\n27 Kansas City Chiefs\n28 Dallas Cowboys\n29 Green Bay Packers\n30 Pittsburgh Steelers\n31 Atlanta Falcons\n32 New Orleans Saints (traded from New England Patriots)","url":"https://www.dailymail.co.uk/sport/nfl/article-4446750/When-NFL-Draft-2017-Time-date-schedule-mock-draft.html"}
