{"authors":["Angela Chen"],"date_download":"2018-10-31 01:42:03","date_modify":"2018-10-31 01:42:03","date_publish":"2018-08-28 06:37:18","description":"Her entrance into New York's gubernatorial race made headlines, but she and her opponent have yet to come face to face with each other in a formal parley. But that will change this week when Cynthia Nixon and Governor Andrew Cuomo debate on…","filename":"data/vaneerConsumption/WhenAreCynthiaNixonAndrewCuomoDebatingHeresWhatYouNeedToKnowAheadOfTheEvent.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/e5b7283e-a77f-403e-a722-079ade710cdd-screen-shot-2018-08-27-at-113249-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_when-are-cynthia-nixon-andrew-cuomo-debating-heres-what-you-need-to-know-ahead-of-the-event-10258808_1540950123.html","title":"When Are Cynthia Nixon & Andrew Cuomo Debating? Here's What You Need To Know Ahead Of The Event","title_page":"When Are Cynthia Nixon & Andrew Cuomo Debating? Here's What You Need To Know Ahead Of The Event","title_rss":"NULL","source_domain":"bustle.com","text":"Her entrance into New York's gubernatorial race made headlines, but she and her opponent have yet to come face to face with each other in a formal parley. But that will change this week when Cynthia Nixon and Governor Andrew Cuomo debate on Wednesday. This will be the first debate between the two in the Democratic primary race, according to amNY.\nThe debate will take place on Wednesday evening at Long Island's Hofstra University. Nixon, an actress turned political contender, has offered to debate Cuomo, 60, for several weeks, but the current governor has not accepted until now. The prominent Democrat will be expected to defend and explain his past eight years' record while Nixon, 52, will have to fend off criticisms against her lack of experience and whether she is equipped to govern.\n\"We’re at a point where we can’t rely on career politicians because we’re just getting more and more of the same, and we’re not getting the real change that we want,\" Nixon said in an interview with Bustle last month. \"So many women who are running for office for the first time. They looked at who was in charge and the job that they were doing and they said, 'I think I can do a better job and I’ve seen what he can do and I can do better.'\"\nThough the two have never debated, their stances may give the public an idea of what the Wednesday face-off will look like. On Monday, both Cuomo and Nixon got out into the community and talked to potential voters about affordable housing, PIX11 reported.\nCuomo spent part of Monday in Brooklyn, where he talked with New York City Housing Authority (NYCHA) tenants and community leaders. The governor also revealed the state's plans to help NYCHA seniors by funding 1,000 new affordable housing units, according to Curbed New York. The development is a part of Cuomo's $1.4 billion Vital Brooklyn Initiative.\n\"Every New Yorker deserves access to safe, affordable, clean housing. It is the foundation of our comprehensive efforts to address chronic disparities in central Brooklyn,\" Cuomo said, according to PIX11.\nJust a bit to the north, at a candidate's forum, Nixon also spoke to potential voters in the Bronx about her affordable housing plans.\n\"In the last eight years, Governor Cuomo’s real estate donors have dictated housing policy in our state — and the results have been disastrous,\" Nixon's website read. \"It’s hard to do right when you’re getting millions of dollars to do wrong.\"\nPer PIX11, a spokesperson for Cuomo's office issued the following statement: \"More paranoia and manufactured melodrama from Cynthia Nixon. The governor is looking forward to an in-depth, substantive debate on the issues that matter to New York.\"\nWith the indirect back and forth between the two candidates, the debate looks to be a fiery one. Unfortunately, no tickets are available to the public but the debate will air on CBS, starting at 7 p.m. EST.\nVoters will cast their ballots in the primary election between Cuomo and Nixon on Thursday, Sept. 13.","url":"https://www.bustle.com/p/when-are-cynthia-nixon-andrew-cuomo-debating-heres-what-you-need-to-know-ahead-of-the-event-10258808"}
