{"authors":[],"date_download":"2018-10-30 18:09:20","date_modify":"2018-10-30 18:09:20","date_publish":"2016-12-06 21:10:00","description":"The Japanese attack on Pearl Harbor shocked America to the core, killing 2,403 and grievously d...","filename":"data/vaneerConsumption/WhenworldwarcametoGeorgiasbackyard.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/06/Images/newsEngin.16977489_REINHARD-HARDEGEN-HEND_313773.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional_when-world-war-came-georgia-backyard__1540922960.html","title":"When world war came to Georgia’s backyard","title_page":"When world war came to Georgia’s backyard","title_rss":"NULL","source_domain":"ajc.com","text":"The Japanese attack on Pearl Harbor shocked America to the core, killing 2,403 and grievously damaging the Navy’s fleet.\nWhile that carnage occurred thousands of miles from the mainland, what has been called a “second Pearl Harbor” took place quietly, right in Georgia’s backyard.\nDays after the U.S. entered World War II, German submarines began firing on American merchant ships on the East Coast, sinking 400 in eight months and killing twice as many Americans as the battle in Hawaii.\nJack Lang remembers the sound of torpedoes hitting the SS Oklahoma and the Esso Baton Rouge less than 10 miles off the coast of Brunswick, Ga. It was early in the morning of April 8, 1942, and it practically bounced him out of bed. “The explosion reverberated through the water and literally shook the town of Brunswick,” said Lang, a retired Coca-Cola executive, who was 13 years old at the time. “It woke everybody up.”\nLang, 88, appears in a new documentary, “The Golden Isles at War,” which, 75 years after Pearl Harbor, recounts the bloody campaign against American ships by German U-boats, and the transformation of Brunswick from a sleepy vacation town to a ship-building powerhouse.\nThe hourlong film was scheduled to premiere Tuesday in front of an invited audience at the exclusive Cloister resort on Sea Island. The production company, Broadcast Solutions, is negotiating with public television to air the documentary sometime this month.\nWhy this chapter of the war receives little attention has much to do with politics. “The propaganda machine that was the Navy kept the lid on these things, so as not to create panic,” said television producer Jack English. English teamed up with John Weatherford (formerly of WABE radio) and television journalist Russ Jamieson to make the film.\nCoastal Georgia residents couldn’t ignore the devastation. Bob Meyer of Brunswick was a paperboy at the time, and while pedaling his bicycle around the sleepy town came upon a funeral home, outside of which were corpses stacked in body bags, victims of a recent attack. “It really hit home, how close it could be,” he says in the film, “because you always thought war was way away.”\nThe U.S. defense against the U-boat threat seemed dismal. There were beach patrols by volunteers on horseback, keeping a lookout for conning towers. There were more volunteers in the Civil Air Patrol, flying single-engine private planes along the shore, paying for their own airplane fuel and making their own lunches. “We called them the ‘sandwich and suicide patrol,’” said Brunswick resident Sonja Olsen Kinard, whose book “Memories From the Marshes of Glynn: World War II” details the history of that time and place.\nOne of her stories came from her father, Olaf Olsen, who tended to the Candler family property on the islands. One early spring morning, Olsen was awakened by a small plane buzzing his Cumberland Island house, and he went outside to see the pilot drop a note tied to a wrench.\nThe note directed him to a merchant vessel in flames just offshore. Olsen borrowed the Candlers’ motorboat (the Lourine II) and made his way to the smoking wreck of the Baton Rouge, arriving even before the Coast Guard. He rescued 34 survivors and ferried them to the Coast Guard’s boathouse near the Frederica River bridge.\nKinard, 83, remembers her mother picking her up at school, seeing her father’s boat by the bridge and pulling off the road to park on the grass. “I met the captain (James S. Poche) and he gave daddy a life ring and the bell off the ship.”\nLance Toland, chairman emeritus of the Museum of Aviation and the Georgia Aviation Hall of Fame, financed the movie partly to see men such as Olsen receive the attention they deserve. “If there was ever a hero in the state of Georgia, here’s somebody you should recognize,” he said.\nIn his work with Coca-Cola, Lang sometimes traveled to Germany, and to help Kinard with her research, Lang sought out the man who set the Baton Rouge ablaze. One day in 1996, he found himself enjoying a meal in Bremen, Germany, with Reinhard Hardegen, a German U-boat captain credited with sinking 22 Allied ships. The evening was cordial.\n“He would have been 80-something then,” Lang said. “He was very pleasant, very distinguished looking, very athletic. I looked upon him as a military man who was doing his duty for his country. I didn’t look upon him as a vicious killer of any kind. He kept saying ‘enemies yesterday, friends today.’”\nThe war shook up Brunswick in other ways. One of 16 ports chosen for cargo ship construction during the Emergency Shipbuilding Program, the Brunswick shipyards geared up at a supernatural rate to churn out “Liberty Ships,” ugly-duckling workhorses that could haul 10,000 tons in materiel. Brunswick built 85 of them, and the town ballooned from 15,000 to 65,000 residents.\nThere was barely enough town for the people. “You had to stand in line to go to the movie theater. You had to stand in line to go to the grocery store,” Lang said.\nAnti-submarine warfare improved dramatically with better radar and improved intelligence. In the second half of 1942, what the Germans had called the “happy time” or the “shooting season” came to a close.","url":"https://www.ajc.com/news/state--regional/when-world-war-came-georgia-backyard/mv79YvO8jVeFr9nUmSUErJ/"}
