{"authors":[],"date_download":"2018-10-30 14:23:58","date_modify":"2018-10-30 14:23:58","date_publish":"2014-08-15 00:00:00","description":null,"filename":"data/vaneerConsumption/WhenYusufcomesmarchinghomeagain.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_08_when_yusuf_comes_marching_home_again_comments_1540909438.html","title":"When Yusuf comes marching home again...","title_page":"Blog: When Yusuf comes marching home again...","title_rss":"NULL","source_domain":"americanthinker.com","text":"One big advantage to living in a free country is that a passport and a visa are pretty much the only legal requirements to traveling abroad. Try that in Cuba, North Korea, the old Soviet Union, and so on – though Jane Fonda could probably get in just by smiling. British subjects enjoy two additional freedoms. First, the law evidently allows Britons to travel to countries in the midst of civil war and join the fight alongside Islamic militants. Second, they can come back home any time they wish, apparently no questions asked. One estimate is that some 500 Britons have joined various jihadist factions abroad. The actual number is hard to determine. Why? Passport applications are unlikely to state the true purpose of travel. Some of these folks got to Syria via Turkey. What if it became known that returnees committed atrocities as jihadists? Would English law hold them accountable once home? I don’t see how.... (Read Full Post)","url":"https://www.americanthinker.com/blog/2014/08/when_yusuf_comes_marching_home_again_comments.html"}
ere is a potential problem if these bloodthirsty goons come back spoiling for another fight, having failed to chop off enough heads. Scotland Yard chief Sir Bernard Hogan-Howe said this about that:\n[T]here are a significant number of people who run the risk of being radicalised, militarised and potentially desensitised to violence, who one day we assume will come home. The biggest concern certainly I have is that none of us know which way those wars are going to go. We’ve seen some quite radical movements across whole countries. Look at Iraq, the shift in a few days. These world events were moving at pace. That was obviously Islamists who were progressing positively. If there were to be a reverse of that at pace, and they were to lose, there is a risk that hundreds of people would want to come home. That’s the biggest challenge. We can’t predict when it might happen. Should there be large numbers returning it puts great pressure on all of us to make sure that we are kept safe. While they are there they are not an immediate threat, but should they come back, and should they come back together, that’s a concern. We are trying our best to prepare for that. No one should underestimate the task.\nAn article such as this pointing out the obvious – Britain needs to change its laws to put a stop to this lunacy before it’s too late – will not impress the House of Commons. I’m writing it only to make Americans aware that what Sir Bernard calls, with typical British understatement, “a concern” is a good reason to put travel plans to England on hold, if possible. Let’s wait and see what exactly “trying our best to be prepared” amounts to. I, for one, am having second thoughts about going to St. Andrews next summer to see Tom Watson play his last round of golf at the Open Championship.\nEditor's note: A previous version of this post counted Turkey as a member of the EU. The error has been corrected.","url":"https://www.americanthinker.com/blog/2014/08/when_yusuf_comes_marching_home_again.html"}
