{"authors":["Jordan Lauf"],"date_download":"2018-10-31 00:02:40","date_modify":"2018-10-31 00:02:40","date_publish":"2018-10-28 11:00:29","description":"Comedian Hasan Minhaj has steadily been making a name for himself for the past few years. The Daily Show alum made waves with his emotional stand-up comedy special Homecoming King, which earned the comedian a Peabody award, and was launched into the…","filename":"data/vaneerConsumption/WhenAreNewEpisodesOfPatriotActWithHasanMinhajAvailableTheComedianIsTryingANewFormatForHisNewTalkShow.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/23/6904777f-bb73-4509-b65d-2def150f89ce-20181009_patriotact_ch_0023r.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_when-are-new-episodes-of-patriot-act-with-hasan-minhaj-available-the-comedian-is-trying-a-new-format-for-his-new-talk-show-12808225_1540944160.html","title":"When Are New Episodes Of 'Patriot Act With Hasan Minhaj' Available? The Comedian Is Trying A New Format For His New Talk Show","title_page":"When Are New Episodes Of 'Patriot Act With Hasan Minhaj' Available? The Comedian Is Trying A New Format For His New Talk Show","title_rss":"NULL","source_domain":"bustle.com","text":"Comedian Hasan Minhaj has steadily been making a name for himself for the past few years. The Daily Show alum made waves with his emotional stand-up comedy special Homecoming King, which earned the comedian a Peabody award, and was launched into the national consciousness when he hosted the White House Correspondents Dinner. And now, Minhaj is stepping into the footsteps of talk show giants before him with his own weekly show, Patriot Act With Hasan Minhaj, which is set to premiere on Netflix on Oct. 28. And those fans of Minhaj who can't wait for his new show are wondering when episodes of Patriot Act With Hasan Minhaj drop.\nAccording to The Hollywood Reporter, episodes of Patriot Act will be filmed on Wednesdays and drop on the streaming service on Sundays. So fans of Minhaj will be able to get their weekly fix regularly beginning Oct. 28. But unlike other Netflix comedy talk shows, which had trouble getting off the ground (Chelsea Handler, Michelle Wolf, and Joel McHale come to mind), Minhaj will attempt a new format, which will draw heavy inspiration both from his comedy special Homecoming King and from fellow late-night comedian John Oliver. Minhaj describes his process as \"distilling the coffee that is news into comedy espresso and doing it in a visually interesting way,\" in an interview with THR.\nCara Howe/Netflix\nInstead of sitting in a suit and tie at a desk, Minhaj will be explaining the news on his feet, with an elaborate setup behind him that The New York Times describes as \"a technological monstrosity,\" complete with \"an immense digital screen\" that flashes with graphics and videos. Minhaj called the show a \"woke TED Talk\" when explaining it to the crowd present at one of the test tapings, per the same report. In part, this setup is to help avoid comparison with other late-night talk show hosts. \"I was going to be in a suit, behind a desk, in front of a fake city skyline, and people would be, like, ‘Oh, it’s Indian John Oliver,'\" he told The New York Times.\nBut Minhaj definitely draws some inspiration from the popular host of Last Week Tonight. Each episode of the show will be focused on one particular subject, similarly to the approach that has made John Oliver such a success. \"I want to do deep investigative reporting,\" he told The Hollywood Reporter, \"and then some stuff that just makes me angry that I'll talk about for four minutes that's just funny for funny's sake.\"\nNetflix on YouTube\nMinhaj is hoping that unlike his predecessors on Netflix, his weekly show will manage to be a success. \"If we get this wrong, well, it’s what everyone predicted,” he told The New York Times. “But if we get this right? It feels like Rocky all over again.” His fellow comedians agree. “You never know what’s going to hit and what’s not going to,” Jon Stewart told the newspaper of Minhaj's new show, before adding that in the case of Minhaj, “I’d buy that raffle ticket any day of the week.”\nFans of Minhaj will surely be rooting for his success. But with an already crowded field of late-night shows to choose from, Minhaj will have to do more than walk around a flashy stage in order to stand out.","url":"https://www.bustle.com/p/when-are-new-episodes-of-patriot-act-with-hasan-minhaj-available-the-comedian-is-trying-a-new-format-for-his-new-talk-show-12808225"}
