{"authors":[],"date_download":"2018-10-30 01:08:35","date_modify":"2018-10-30 01:08:35","date_publish":"2018-08-28 00:05:28","description":"America’s legal system is swamped with bad faith actors. From activist judges who overturn perfectly sensible limits on immigration, to the literal activist lawyers who bring frivolous suits against those limits, to grafters who have turned GoFundMe pages into a political spoils system, the endless jokes about the uselessness of lawyers have never been easier to make.","filename":"data/vaneerConsumption/WhenArePatentTrollsGoingtoStopBotheringtheSupremeCourt.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Troll.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861715.html","title":"When Are Patent Trolls Going to Stop Bothering the Supreme Court?","title_page":"When Are Patent Trolls Going to Stop Bothering the Supreme Court?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"America’s legal system is swamped with bad faith actors. From activist judges who overturn perfectly sensible limits on immigration, to the literal activist lawyers who bring frivolous suits against those limits, to grafters who have turned GoFundMe pages into a political spoils system, the endless jokes about the uselessness of lawyers have never been easier to make.\nStill, at least some of our modern legal leeches give up after a big payday, or accept defeat with some modicum of decorum. The really awful ones, though, never give up. They keep coming back to try and undermine policies they disagree with by finding some grounds — any grounds — to get courts to end those policies, rather than taking up the matter with legislators, with whom the public policy consequences of their preferred actions would be a nonstarter. This is true of the idiots who say “Abolish ICE,” and it is also true of an even more persistent burr in the sock of America’s legal system: Non-Practicing Entities, or NPEs, better known as patent trolls.\nI have been railing against this particular group for some time now, because the influence they have on larger issues, like technology and healthcare, enables some of the worst abusers of our market economy. However, for those who have not yet encountered the term, a quick definition is in order: NPEs are organizations — often legal firms or universities looking to pad their endowments — that buy up patents with no intention of actually developing them into something marketable. Rather, their only goal is to sue anyone else who might try to develop their “patented” invention, which they did nothing to come up with, or to invent. The patents they purchase are often terrible quality, and any basic legal scrutiny would void them, but most of those targeted by these groups decide to cough up nominal fees for the “rights” rather than challenge the patents involved. The end result is that NPEs harass or “troll” often unwitting inventors who actually build the inventions they only technically own the rights to, hence the term “patent trolls.”\nNeedless to say, these groups inflict a massive penalty on innovation and also enable the proliferation of garbage patents, thus weakening the entire patent system in the process. Unfortunately for them, Congress got wind of their shtick some time ago, and passed a law that created a special board within the U.S. Patent and Trademark Office (USPTO) called the Patent Trial and Appeal Board (PTAB). The PTAB is, in essence, a court made up of patent lawyers where those sued for patent infringement can go directly to challenge the patent involved, rather than waste time and money on lengthy court proceedings that can get dragged out using technicalities. It is, in short, a quality control on patents — not an unnecessary thing, considering how many bad patents slip through due to examiners rushing to clean up the infamous patent backlog.\nNow, patent trolls hate PTAB for obvious reasons: most of the nonsensical pieces of paper they sue over get tossed out by PTAB’s members for being improperly granted. But it’s not just they who hate the institution: Pharma companies also dislike it because it tends to look unfavorably on them trying to extend patents that were once entirely valid for spurious reasons, a practice known as “ever greening.”\nSo, of course, with two litigious groups and a lot of money at risk, PTAB gets subjected to challenges before courts a lot. Last year saw the institution challenged in the Supreme Court case Oil States LLC vs. Greene Energy Group LLC, a challenge which it survived by a vote of 7-2. And now, yet another legal challenge has hit it, this time from a company called Smart flash, which claims that the PTAB has no authority because its members… aren’t appointed by the president. The lawsuit also aims to invalidate PTAB’s authority over all patents granted before the America Invents Act, which first established the PTAB’s existence, effectively gutting a huge chunk of its authority.\nGiven the past track record of patent trolls at the Supreme Court, which has been one of repeated, dismal failures, this is a challenge that should be looked at with great skepticism. Not least of all because it’s obvious that no matter what the legal merits of the case, bad actors like this will keep trying. With any luck, the court will refuse to grant certiorari altogether this time, and we will see that firsthand. Either way, with any luck, this tendency of the legal system to have to play whack-a-mole will be fixed by Congress at some point soon.","url":"https://spectator.org/when-are-patent-trolls-going-to-stop-bothering-the-supreme-court/"}
