{"authors":["Jefferson Grubbs"],"date_download":"2018-10-30 22:43:17","date_modify":"2018-10-30 22:43:17","date_publish":"2014-08-14 19:50:57","description":"FOX's supernatural-Revolutionary-War-time-warp-apocalyptic-thriller-creature-feature was the surprise hit of the 2013-2014 television season, so naturally, waiting for the premiere of Sleepy Hollow Season 2 has proved rather difficult. Judging by…","filename":"data/vaneerConsumption/WhenDoesSleepyHollowSeason2StartWereAnxiousForMoreIchabodCrane.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/f311eba3-46a1-4d9c-9d0d-74bfbdf10de2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35669-when-does-sleepy-hollow-season-2-start-were-anxious-for-more-ichabod-crane_1540939397.html","title":"When Does 'Sleepy Hollow' Season 2 Start? We're Anxious For More Ichabod Crane","title_page":"When Does 'Sleepy Hollow' Season 2 Start? We're Anxious For More Ichabod Crane","title_rss":"NULL","source_domain":"bustle.com","text":"FOX's supernatural-Revolutionary-War-time-warp-apocalyptic-thriller-creature-feature was the surprise hit of the 2013-2014 television season, so naturally, waiting for the premiere of Sleepy Hollow Season 2 has proved rather difficult. Judging by the concept (Ichabod Crane time travels to the modern day) and promotional art (the Headless Horseman wielding a submachine gun) alone, you'd be forgiven for rolling your eyes at the very idea of such a silly show — much like I did. But then, if you actually watched any of the show, you were probably hooked by the great cast, clever dialogue, and beautiful design — much like I was. Season 1 delivered thirteen fast-paced episodes that left viewers breathless with a doozy of a cliffhanger.\nWhen we left Sleepy Hollow back in January, all hell had broken loose. And I mean that quite literally. Ichabod and Abbie had ventured into purgatory to rescue Ich's witch of a wife (again, I mean that literally) Katrina. Unfortunately, Abbie remained trapped in limbo. And although Ich and Katrina managed to return to our world, they didn't fare much better. It turned out that Henry Parrish, also known as the Sin-Eater, was also-also known as Jeremy Crane: Ichabod and Katrina's son, who's got a major bone to pick with his parents for leaving him trapped in a coffin for two centuries. He gives Katrina to the Horseman, he breaks the Second Seal and literally becomes War, and buries his own father alive. Uh-oh!\nIt's already been seven months since the Season 1 finale; how much longer do we have to wait to find out how Ichabod and Abbie get out of their respective sticky situations? Fortunately, not much longer. Season 2 of Sleepy Hollow is due to premiere Monday, September 22 at 9 p.m. ET. You can start your Doomsday Clock now — the Four Horsemen of the Apocalypse will be here in one month. And I've got some extra good news for fans: FOX was so impressed by the freshman run of the show and by viewers' reactions that the network decided to supersize the sophomore outing. That's right: Sleepy Hollow is getting five more episodes this year, bringing the total to 18.\nThe expanded Season 2 means an expanded cast, as well. Both John Noble (Henry Parrish/Jeremy Crane/Sin-Eater/War) and Lyndie Greenwood (Jenny Mills) have been upped from recurring roles to main cast; Ichabod is getting an ex (Heather Lind, Turn); Abby and Jenny are getting a mom (Aunjanue Ellis, The Mentalist); the team's getting a bounty hunter (Matt Barr, One Tree Hill); and the town's getting a new sheriff (Sakina Jaffrey, House Of Cards).\nBut until September, you can whet your appetite (and your axes) for the new season with this teaser:\nYouTube\nImages: James Dimmock/Fox; Brownie Harris/Fox","url":"https://www.bustle.com/articles/35669-when-does-sleepy-hollow-season-2-start-were-anxious-for-more-ichabod-crane"}
