{"authors":["Katy Parker-Shorthouse"],"date_download":"2018-10-31 01:46:31","date_modify":"2018-10-31 01:46:31","date_publish":"2018-09-14 12:14:33","description":"The winners of last year's X Factor have been very quiet of late. If you're a fan of the band you might be wondering: when will Rak-Su tour the UK? Let's take a look. The group have just completed a tour with fellow X Factor…","filename":"data/vaneerConsumption/WhenWillRakSuTourTheUKFansCouldBeWaitingALittleWhile.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/1280c104-df4c-4b08-b06c-d4f5dedc855c-getty-922463970.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_when-will-rak-su-tour-the-uk-fans-could-be-waiting-a-little-while-11789146_1540950391.html","title":"When Will Rak-Su Tour The UK? Fans Could Be Waiting A Little While","title_page":"When Will Rak-Su Tour The UK? Fans Could Be Waiting A Little While","title_rss":"NULL","source_domain":"bustle.com","text":"The winners of last year's X Factor have been very quiet of late. If you're a fan of the band you might be wondering: when will Rak-Su tour the UK? Let's take a look. The group have just completed a tour with fellow X Factor finalists-turned-superstars Little Mix, according to reports by Capital FM — and if you missed it, you might have to wait a while yet, for another tour doesn't seem to be on the cards. What is on the cards, however, is a book according to reports by the Mirror. The text, titled Our Journey, will follow the band's road to winning the X Factor and will feature insider gossip and never-before-seen pictures.\nHailing from Watford, the group triumphed over fellow finalists Grace Davies and Kevin Davy White to win the 14th series of The X Factor, becoming only the second group in the show's history to win the crown, according to the Express. With Cowell as their mentor, the group's refreshing mix of hip hop, RnB and rap — plus some pretty knockout dance routines — felt like a breath of fresh air on the talent show, which is often dominated by ballad singers belting out Whitney Houston songs.\nWith a name that may sound bewildering to many, Rak-Su christened themselves the ultimate \"man-band\" during their time on the show, according to the Mirror. Comprised of bandmates Ashley Fongho, Jamaal Shurland, Mustafa Rahimtulla, and Myles Stephenson, the band took their name from a shorting of \"Tracks vs Suits\" — meaning music and fun vs adult life, according to the group's website.\nTheir winner's single, \"Dimelo\", which featured Naughty Boy and Wyclef Jean, soared to the top of the iTunes charts, according to the Mirror, and came in at Number 2 in the official singles charts, just behind chart-topping king Ed Sheeran and his single \"Perfect\". But that wasn't all, according to the Express, in December last year the band had no less than five hit songs in the Top 10 — an incredible coup for any band.\nTheir songs \"I'm Feeling You,\" which was the band's original audition track, \"Mona Lisa\" and \"Mamacita\" fell in at Numbers 4, 5, and 6 on the official charts respectively. Rak-Su tweeted at the time: \"We don't even know what this is! The support that you guys keep showing day in and day out has truly shocked us! You guys have put so many cherries on top of our cake and we appreciate every single last one of you for it #rakpack #raksu2d#rakwhatraksu #manband\", according to reports by the Express.\nWhen they won the music contest in December last year, Evening Standard tipped the band to out-sell One Direction, with manager Cowell reportedly telling them to \"to be that positive light in the world.\" Their refreshing brand of music coupled with their likeable personalities — not to mention the fact they're all handsome and single — makes them certifiably bankable stars, the paper reports. But that's not to say the band were happy to rest on their laurels, with Stephenson telling the Standard: “It’s The X Factor, it’s your world for six weeks, but suddenly it’s not the be-all and end-all ... we need to work a lot harder than we ever did to sustain ourselves. The hard work starts now.”\nSo what are the band up to now? Well according to the group's Twitter, in addition to the book fans can look forward to some new music, with the guys tweeting just yesterday that \"it's coming in September so you know you won't be waiting long.\"\nWatch this space.","url":"https://www.bustle.com/p/when-will-rak-su-tour-the-uk-fans-could-be-waiting-a-little-while-11789146"}
