{"authors":["Ari Bines"],"date_download":"2018-10-31 01:42:19","date_modify":"2018-10-31 01:42:19","date_publish":"2018-09-14 17:42:48","description":"When it comes to finding the perfect shade of red lipstick, we are all just a little bit snooty if it isn't bright enough to shock the system. However, some reds aren't as comfortable for everyone of every skin tone to wear. Hence why when chocolate…","filename":"data/vaneerConsumption/WhenCanYouBuyMACsNymaTangRedLipstickTheBoldLippieWasMadeForEveryone.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/239ff2bf-6a2a-4fad-a3a4-a50b67519832-getty-999747292.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_when-can-you-buy-macs-nyma-tang-red-lipstick-the-bold-lippie-was-made-for-everyone-11917858_1540950139.html","title":"When Can You Buy MAC's Nyma Tang Red Lipstick? The Bold Lippie Was Made For Everyone","title_page":"When Can You Buy MAC's Nyma Tang Red Lipstick? The Bold Lippie Was Made For Everyone","title_rss":"NULL","source_domain":"bustle.com","text":"When it comes to finding the perfect shade of red lipstick, we are all just a little bit snooty if it isn't bright enough to shock the system. However, some reds aren't as comfortable for everyone of every skin tone to wear. Hence why when chocolate girls like Nyma Tang drop a red lipstick, there's mayhem to be had on makeup shelves.\nMAC cosmetics is no stranger to inclusive influencer collabs and the matchup with this deep shade beauty queen is no exception. Nyma is a South Sudanese-bred vlogger who routinely experiments with the deepest shade in a variation of complexion products, including foundation, concealer, primer and more to trial and error the payoff on her complexion.\n\"I started wearing makeup when I was a little older, like 21, and that's when I started realizing that there's really not much out there for me,\" she told Refinery29. \"I think a lot of companies are playing catch up right now. We still need those deeper sculpting products, bronzers, and contour powders — even eyeshadows need to be more inclusive and dark skin-friendly.\"\nSo many black girls can probably relate, remembering times of shopping with our moms who'd swat our hands and say, \"Put that down, that color is not for you.\" But when a brand like MAC puts the face of YouTube's The Darkest Shade series behind a new universal red lippie, it's put the beauty world in a careful set of hands.\nNow that Tang's mastered blending brushes, cut creases and color matching, she's making moves in bringing us her self-named warm red lipstick in a matte finish, according to MAC's full description on its site. In addition to its warm undertones, the limited edition lipstick also features a red rose print. Way to make your mark, Ms. Tang!\nAlthough her relationship with complexion products have been on the rocky side, she knew she couldn't live without a set of statement-making red lips.\n\"I just love a red lip,\" she told Refinery29. \"I take the Fenty 'Stunna' with me if I want to be extra, and I love Sephora's 'Always Red.' That's probably my favorite, besides my own MAC lipstick.\"\nYou can now make the room pause and grab Nyma's creation at MAC cosmetics in stores and online.\n\"I honestly still can’t believe this is happening,\" she started her caption of the rich-colored lippie. \"I wanted to create a beautiful shade of red that is wearable & bold for any occasion.\"\nRegardless of your shade or undertone, this is a red lip that will make every shade of lips look their plumpest — and hopefully even moms won't make a negative peep.\nNow is the time to race to the nearest MAC store, stock up on her lipstick and get cute before there's none left. Gotta blast!","url":"https://www.bustle.com/p/when-can-you-buy-macs-nyma-tang-red-lipstick-the-bold-lippie-was-made-for-everyone-11917858"}
