{"authors":[],"date_download":"2018-10-22 21:35:20","date_modify":"2018-10-22 21:35:20","date_publish":"2014-06-04 17:11:46","description":"A new study suggests that food alone may not be enough to help children recover from malnutrition.","filename":"data/vaneerConsumption/WhenFoodIsntEnoughGutBugsAffectMalnutritionTooStudyFinds.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/487246/140604-bangladesh-child-1225_6a2cc007cc0b4f93d4dd6f5a77b1cc3e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_kids-health_when-food-isnt-enough-gut-bugs-affect-malnutrition-too-study-n122561_1540244120.html","title":"When Food Isn't Enough: Gut Bugs Affect Malnutrition, Too, Study Finds","title_page":"When Food Isn't Enough: Gut Bugs Affect Malnutrition, Too, Study Finds","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA new study may help explain why some children with malnutrition never seem to get better, even when they are finally fed. It has to do with the population of germs that live in the intestines and help digest food, researchers said Wednesday.\nThe findings suggest it's possible that food alone might not be enough to help kids recover from malnutrition. They may need a bacterial boost, also.\nIt’s become common knowledge that everyone carries a microbiome — a population of microbes such as bacteria and yeast that affect all sorts of functions, from absorbing food to immune response and even, possibly, mental illness.\nBabies inherit their gut and skin germs from their mothers, other caregivers and probably from the food they eat. Researchers are trying to figure out what the elements of an optimal microbiome are. People with imbalances may be more prone to obesity, but an imbalance may also hurt a child’s ability to absorb nutrients from food.\nDr. Jeffrey Gordon and his student Sathish Subramanian asked whether this may help explain why some children remain stunted and have learning difficulties even after they’ve been treated for malnutrition.\n“Although therapeutic food-based interventions have resulted in a significant decline in deaths from malnutrition, many children never fully recover,” said Subramanian.\n\"These children, although they gained weight, remained severely stunted and severely underweight.\"\n“These children, as they continue in their lives, are not able to achieve their full human potential for reasons that are obscure,” Gordon told NBC news. “Our thought was that perhaps the gut microbial community was a factor.”\nThey focused on children in the slums of Dhaka, Bangladesh. “They come from an urban slum where some children are severely malnourished, some moderately and some are healthy,\" Gordon said.\nThis can happen even among siblings in the same family, so something other than simply what they are eating may be involved, Gordon reasoned.\nThey did a series of tests on kids, sampling healthy children first of all to see what their gut bacteria looked like, by taking fecal samples. They got a good picture of how a healthy child’s microbiome grows and matures from infancy to age 2.\n“Using this microbial signature of normal gut microbial community maturation, we evaluated the gut microbial communities of 64 severely malnourished children before, during and after they received standard food-based interventions,” Gordon said.\nThe 64 babies, aged 6 months to 20 months, were randomly assigned to get one of two different special meals for malnourished kids — Plumpy’Nut, a peanut-based, nutrient-enriched food that is popular for treating severe malnutrition worldwide, or Khichuri-Halwa, a rice-and-lentil based enriched food produced in Bangladesh.","url":"https://www.nbcnews.com/health/kids-health/when-food-isnt-enough-gut-bugs-affect-malnutrition-too-study-n122561"}
