{"authors":["Akin Oyedele"],"date_download":"2018-10-31 00:10:37","date_modify":"2018-10-31 00:10:37","date_publish":"2018-07-12 00:00:00","description":"BI PRIME: Trade-related headlines put the stock market at risk of more volatility. Goldman Sachs has reiterated four of its top strategies that should keep investors on track for strong returns this year.","filename":"data/vaneerConsumption/WhereGoldmanSachssaysyoushouldinvestastradetensionsworsen.json","image_url":"https://amp.businessinsider.com/images/5b47597aaf2e4119008b47f8-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trump-tariffs-china-trade-war-where-goldman-sachs-says-you-should-invest-2018-7_1540944637.html","title":"Where Goldman Sachs says you should invest as trade tensions worsen","title_page":"    Where Goldman Sachs says you should invest as trade tensions worsen - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Traders work on the floor of the NYSE in New York Thomson Reuters\nTrade-related headlines put the stock market at risk of more volatility.\nTo help its clients navigate these swings, Goldman Sachs has reiterated four of its top strategies that should keep investors on track for strong returns this year.\nThe recommendations are not hedges against specific risks that trade disputes create for certain companies and industries. Instead, David Kostin, the chief US equity strategist, is reiterating some of his top ideas at a time when markets are vulnerable to swings based on trade-related headlines.\nThese strategies are supported by an expectation that earnings growth will extend the nine-year-old bull market's lifespan. Goldman forecasts that the S&P 500 will rise 5% to 2850 by the end of this year.\nThe four strategies are:\nHigh sales growth\n\"Stocks with the fastest revenue growth will outperform in a decelerating economy and also offer value relative to history,\" Kostin said. He anticipates that sales will drive profits, which would then drive stocks.\nGoldman's basket of stocks with high sales growth has outperformed the S&P 500 by six percentage points this year. Companies with the highest estimates for sales growth next year include Netflix, Amazon, Campbell Soup, and Salesforce.com.\nGoldman Sachs\nFinancials\nAs interest rates rise, banks should earn the difference between the lower rates at which they borrow and the higher rates at which they lend. Goldman also expects bank stocks to benefit as they repurchase more shares after passing the Federal Reserve's stress tests.\nGoldman Sachs\nCompanies with strong balance sheets\nThey are another play on rising interest rates: as borrowing costs increase, firms with the most cash and minimal debt are best positioned.\nGoldman's basket of such stocks has gained 7% this year, topping the S&P 500's 3% increase. They include Chipotle, Monster Beverage, Facebook, and Nvidia.\nKostin has previously cautioned that many companies with strong balance sheets are also growth stocks. This overlap is historically unusual, he said, and could pose a risk if investors rotate into more defensive stocks.\nCompanies with low labor costs\nWhile workers always welcome raises, they translate to higher costs for the companies paying them.\nAnd so in an environment of faster wage inflation, Goldman recommends finding companies with low labor cost exposure, which have a lower risk of shrinking margins.\nThe low labor cost basket includes Under Armour, Gap, Western Union, and Alphabet. The median stock in this basket has an implied labor cost of 5% of revenues, versus 13% for the S&P 500.","url":"https://www.businessinsider.com/trump-tariffs-china-trade-war-where-goldman-sachs-says-you-should-invest-2018-7"}
