{"authors":["Shea Simmons"],"date_download":"2018-10-31 01:45:35","date_modify":"2018-10-31 01:45:35","date_publish":"2018-09-06 16:29:19","description":"Sometimes, you just want to embrace everything that nostalgia can offer. From the warm fuzzies of snuggling in to watch a Disney movie to your Disney-themed clothing as a kid, perhaps nothing induces more childhood feels that the iconic studio. Now,…","filename":"data/vaneerConsumption/WhereToBuyTheDisneyPrincessSheetMasksBecauseSometimesYouJustWantToFeelLikeAPrincess.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/76dda7cc-f060-4077-91ff-7c4d0a91989b-screen-shot-2018-09-06-at-122345-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_where-to-buy-the-disney-princess-sheet-masks-because-sometimes-you-just-want-to-feel-like-a-princess-11772625_1540950335.html","title":"Where To Buy The Disney Princess Sheet Masks Because Sometimes You Just Want To Feel Like A Princess","title_page":"Where To Buy The Disney Princess Sheet Masks Because Sometimes You Just Want To Feel Like A Princess","title_rss":"NULL","source_domain":"bustle.com","text":"Sometimes, you just want to embrace everything that nostalgia can offer. From the warm fuzzies of snuggling in to watch a Disney movie to your Disney-themed clothing as a kid, perhaps nothing induces more childhood feels that the iconic studio. Now, there are Disney princess sheet masks that will allow you to wear your favorite character on your face. Yes really. From Jasmine to Belle, these masks will make you feel like a Disney princess will make your look like a member of the Disney fam in more ways than one.\nDisney-themed beauty isn't anything new, though. It simply seems to be ultra popular with brands like ASOS and Target hopping on the trend. Wearing princess faces, though? That's a new one. The four mask set appears to be from brand Mad Beauty according to the packaging, and features the appearances of Aurora, Ariel, Jasmine, and Belle. If you're thinking that these masks are just for play, they're not. They're all packed with ingredients meant to give you the skin of princess.\nAccording to website Firebox, where you can purchase the masks, the skin care products are themed around their matching princess with Aurora's mask named True Love's Kiss, Belle's called Enchanted Rose, Jasmine's is A Whole New World, and Ariel's is Jewel of the Sea.\nAs for the benefits of each mask, those vary, but each item is filled with ingredients common to sheet masks you can find in your drugstore aisles. From the moisturizing benefits of cucumber found in Ariel's mask to the rose water meant to provide a glowing complexion in Belle's mask, there Disney Princess masks don't just seem to be fun ways to relive your childhood. They'll improve your skin while you're thinking of your days dreaming of riding a magic carpet, or while you're currently dreaming that same dream (no shame!).\nAs for the price of reliving your Disney fantasy? Good news! It's affordable. The mask set retails for $18.09 making each mask just a bit over $4.50. If you want more than just these four masks inside the set, there's even better news. As it turns out, Mad Beauty actually sells a plethora of Disney products including more Disney face masks.\nGregory Gaige on YouTube\nIf you head over to the Mad Beauty website, you'll be greeted with an entire section dedicated to Disney products, and there are some true bangers. Perhaps the most obvious counterpart to the Disney princess masks, though, is the Disney villain mask set. Yes, it really exists, and yes, you do need both in your life.\nWith classic villains like Ursula, Maleficent, Cruella, it's going to be hard to pass up this collection of masks. Just keep in mind when ordering from the Mad Beauty website that they're not based in the states, so you will be shopping international. Totally worth it, though, right?\nIf you want to incorporate a bit of Disney magic into your skin care routine these princess and villain masks are the perfect way to do it. Whether you long to embrace your inner Princess Jasmine or have a darker side a la Ursula, Disney face masks are for everyone.","url":"https://www.bustle.com/p/where-to-buy-the-disney-princess-sheet-masks-because-sometimes-you-just-want-to-feel-like-a-princess-11772625"}
