{"authors":["David Wagner","Aaron Mendelson","Dan Morain","Byrhonda Lyons"],"date_download":"2018-10-30 22:39:54","date_modify":"2018-10-30 22:39:54","date_publish":"2018-07-31 12:01:00","description":"Federal data shows first-time buyers in California increasingly rely on family for help.","filename":"data/vaneerConsumption/WheredopeoplegetmoneytobuyCaliforniahomesthesedaysOftenfrommomanddad.json","image_url":"https://calmatters.org/wp-content/uploads/212705-full.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939194.html","title":"Where do people get money to buy California homes these days? Often, from mom and dad","title_page":"Where do people get money to buy California homes these days? Often, from mom and dad | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"When Melanie Gerber started working as a mortgage loan officer in Riverside seven years ago, she didn’t see many first-time buyers hitting up their parents for help.\nNow she sees it all the time.\n“I have one that just went into escrow yesterday,” Gerber said. “They’re having money gifted from the family.”\nShe estimates about half of her borrowers are now getting money from mom and dad.\n“I think the parents just want them to make it on their own and know they can’t do it,” she said.\nGerber’s observations are backed up by federal data. If you want to buy a home in California, it increasingly helps to have relatives who can chip in.\nKPCC crunched the numbers on more than 600,000 FHA loans, a type of government-backed mortgage that’s common with first-time buyers.\nFHA borrowers can use money from relatives for their down payment. In recent years, that kind of family financial help has been on the rise in California.\nBack in 2011, about one in four FHA loans in California included down payment money from relatives. Today, it’s one in three.\nPercent of family-assisted down payments for FHA loans, by county\nCounty-level data via HUD; current through May 2018\nFamily down payment support is playing an even bigger role in many parts of California, outstripping the national rate of 26 percent.\nLast year, in dozens of California ZIP codes — covering parts of East San Jose, North Hollywood, South Central Los Angeles, Santa Ana and Alpine in eastern San Diego County — at least half of FHA borrowers were getting family members to help with the down payment.\nMany first-time buyers choose FHA loans for their low down payment options and relaxed credit requirements. FHA loans have been declining as a share of California’s overall mortgage market. But still, in 2017 about 15 percent of all homes sold in California had an FHA loan according to a survey from the California Association of Realtors.\nThese loans can help young families get into lower to mid-priced California homes. However, lending limits max out at close to $680,000, making FHA loans unrealistic for California’s most expensive markets. Very few people use them to buy homes in areas like San Francisco or LA’s Westside.\nFHA loans with family down payment assistance by ZIP Code, 2011 – May 2018\nData via HUD, U.S. Census; ZIP Codes with fewer than 50 loans not shown on map\nLoan officer Melanie Gerber gave her son nearly $10,000 to get him into a $365,000 house in Riverside.\n“I saw the prices going higher and higher. And I knew that if we didn’t help him, he would not be able to buy something when he was actually ready to purchase,” she said.\nGerber’s 24-year-old son Brandon Miller said, “I could not be in this house without my family’s help.”\nMiller has embraced homeownership. His modest ranch house has a nice front yard where his two massive Great Danes can run around. He enjoys watering the plants and looking for mid-century furniture to highlight the house’s 1950s charm.\nLiving here keeps Miller close to his parents.\n“I do everything possible to show that I’m grateful for what they did,” he said. “I keep my house nice. I try to improve my house when I can. I want to show that what they invested in is actually going toward something good.”\nMiller shares the house with a few renters, so he can easily cover his portion of the monthly payments. He said it costs him less than renting an apartment. And he’s building equity.\n“I definitely feel like I was able to achieve the California Dream, since a lot of people nowadays can’t afford houses,” he said.\nParental help takes many forms\nMedian California home prices are now more than double the national average. Student loan debt and unaffordable rents can make it hard to save. When parents see their kids struggling under those pressures, of course they want to help.\nAnd they’re not just gifting down payments to their kids. They’re also co-buying houses.\nA recent quarterly report from Irvine-based real estate data firm Attom Data Solutions found that 48 percent of houses purchased in San Jose had sales deeds that listed multiple non-married buyers (often an indication that parents are co-buying with their children). The same was true for 38 percent of homes purchased in San Francisco.\nSome parents are making all-cash purchases for their kids. Family money can be involved in other ways that are harder to detect. Buyers can purchase homes with inheritances or trust fund money, which don’t show up in data on FHA loans.\nParental help is happening in many non-FHA loans as well.\nLabor union representative Raphael Leib used a conventional mortgage to buy a $390,000 house on the Eastside of Los Angeles three years ago with his wife, a high school French teacher.\nThe couple is raising their two young children in the three-bedroom house thanks in part to about $40,000 worth of help from their parents.\n“Having a gift from both our sets of parents really meant that we could find a place that our family could grow into,” Leib said.\nLeib has seen others also tapping into generational wealth to buy homes in Los Angeles. He doesn’t want to see long-term residents priced out of his City Terrace neighborhood.\n“This is a nice neighborhood. The neighbors have been here a long time. I know them all well. They know me well. It’s a close knit community,” he said. “I’d rather not see it be gentrified.”\nWho has wealth to share?\nHousing experts worry about the rising reliance on family wealth in California.\n“We have huge wealth inequality and homeownership inequalities by race and ethnicity,” said UC Berkeley’s Carolina Reid.\nMany black and Hispanic families today don’t have as much wealth to share as white families, said Reid, because past government policies shut them out of homeownership. As recently as the 1960s, the practice of “redlining” explicitly denied government-backed home loans to residents in minority neighborhoods.\nReid predicts today’s wealth gaps will only get worse if first-time buyers increasingly need to have parents who can help.\n“Who has wealth now — and who can bequest that wealth to their children — is a direct consequence of our government lending practices 50 years ago,” Reid said.\nRichard Green, director of USC’s Lusk Center for Real Estate, said families that have owned homes in California for generations have an advantage. Others may need to leave the state if they want to purchase a house.\n“It’s almost like we’re feudal now,” Green said. “You inherit the manor from your family if you happen to be a landowner. If you’re not a landowner, it’s really hard to get in.”\nHowever, money from relatives isn’t just benefiting families that have always been homeowners.\nJackie Dillon, a social worker at a Los Angeles hospital, was raised by a single mom who immigrated to the United States from Mexico.\nDillon’s family has always rented. Which is why getting an FHA loan to buy a house in South Los Angeles earlier this year was such a big deal.\n“We had balloons in here,” Dillon said. “We never see my mom cry. But she actually shed a tear that day. She was just so happy. I think she felt proud of me.”\nDillon shares the house with her mother. She now feels more financially secure.\n“I did not want to be renting my entire life and not establishing any wealth,” she said. “For me, it means that we’re out of poverty and actually building a future.”\nDillon’s savings covered roughly half of the down payment and closing costs on the $450,000 house. But she had another source of help — money passed down to her after her grandmother’s death.\n“My grandma was the matriarch of our family,” Dillon said. “Our family has always had very intelligent, strong and compassionate women. So that, to me, was just her helping us yet again.”\nDillon said if she kept saving, in a few years she might have been able to afford the down payment on her own. But then again, in a few years, who knows what a house like this will cost.\n“I would love to stay in California”\nFor those who don’t have relatives in a position to help, owning a house in California can feel unachievable.\nStephanie Pavón has been renting in Northeast Los Angeles with her husband Fernando for about six years. The couple has a 15-month-old son. They’ve considered buying a house. But Pavón said even with their decent incomes, they can’t save up enough for a down payment.\n“A big factor in our staying where we are is that we don’t have assistance from other family,” said Pavón.\nThey’ve watched prices in their neighborhood skyrocket. A three bedroom house on their street recently sold for $1 million. Another house in the area — barely bigger than their apartment at 789 square feet — is on the market for $499,000.\n“There are so many people like myself who can’t afford to live in a house like this. And I do wonder who can,” she said.\nPavón said her family could continue to rent in Los Angeles, or they could join her sister-in-law in Texas.\n“I would love to stay in Los Angeles,” she said. “I would love to stay in California.”\nHave you helped your kids buy a home in California? Did you get help from your parents? Join the conversation on our CA Dream Facebook group.\nNote about data: The California Dream collaborative analyzed 89 months of FHA loan data for California, from January 2011 – May 2018. That data, which represents over 600,000 mortgages, is available here. Lenders submit the information about down payment support to HUD, and family support does not necessarily mean that relatives provided 100 percent of the down payment. On the map, we chose to show the data broken down by ZIP code, the most specific geography available. The shapes on the map are ZIP Code Tabulation Areas, which are approximations of ZIP codes, created by the U.S. Census. All ZIP codes shown on the map had at least 50 loans during this time period. Some ZIP codes are missing because they didn’t have enough loans.","url":"https://calmatters.org/articles/california-real-estate-money-parents-mortgage/"}
