{"authors":[],"date_download":"2018-10-30 18:07:23","date_modify":"2018-10-30 18:07:23","date_publish":"2016-06-13 04:00:00","description":"Atlanta Zero Mile Post and its orginal marker near Underground Atlanta is one of Atlanta's oldest landmarks. Older in fact than the name Atlanta. The stone post marked the Terminus of the Western and Atlantic Railroad. See also Marthasville, created 1843.","filename":"data/vaneerConsumption/WhereistheZeroMilePostinAtlantawhatisit.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/04/25/Videos/4379508.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_actual-factual-georgia-zero-mile-post-marks-city-start__1540922843.html","title":"Where is the Zero Mile Post in Atlanta, what is it?","title_page":"Atlanta landmarks: Where is the Zero Mile Post in Atlanta, what is it?","title_rss":"NULL","source_domain":"ajc.com","text":"Q: I’ve been looking for a marker called the Zero Mile Post. Can you tell me where it’s located?\n—Dennis Withers, Atlanta\nA: The Zero Mile Post is beaten up and weathered.\nChunks are missing and dark stains partially obscure the letters and numbers chiseled into its side.\nOr at least that’s how it appears in photos from the past 10 years.\nThe Zero Mile Post is perhaps the oldest landmark in Atlanta, a reminder of the time when the city was merely a spot where railroads were destined to meet.\nIt’s also one of the least seen.\nThe Zero Mile Post is locked away in a vacant building near Underground Atlanta, which means folks can’t visit it. The facility under the Central Avenue viaduct is surrounded by parking lots and was once used by the Capitol police.\nUPDATE: The building is scheduled to be torn down and the marker may move\nRELATED: Map shows the approximate original location of Zero Mile Post. It was near the rail lines below Wall Street between Central Avenue and Pryor Street. Or between Five Points and Georgia State MARTA stations\nIf you’re a native Atlantan and you’ve never heard of the Zero Mile Post, don’t feel bad. I hadn’t either before I started writing this column several years ago.\nEven though the Zero Mile Post has been around since 1837 – before Atlanta was called Atlanta — it’s a little-known object and absent from the must-see lists of all the folks who are here to check out the World of Coca-Cola or Georgia Aquarium.\nThat doesn’t detract from its significance.\n“It’s a unique landmark,” said Paul Melvin, the director of communications for the Georgia Building Authority, which owns the building surrounding the Zero Mile Post.\nThe post was installed to mark the end of the Western and Atlantic Railroad, which linked the area with Chattanooga.\n“W&A R.R. 0 0” is inscribed on one side of the stone marker.\nThe town that grew up around it was called Terminus.\nThat became Marthasville in 1843, which several years later was renamed Atlanta.\nThe Zero Mile Post is shown with a (then) brand new historic marker in this photo from 1958. The landmark used to be exposed beneath a downtown viaduct and was open to the public. Today, it sits inslide a government building that remains locked. (AJC Archive at GSU Library / AJCP142-020I) (The Atlanta Journal-Constitution)\nAbout the marker post\nAn accompanying historical marker states: “A new City Charter approved February 28, 1874 redefined the corporate limits as a circle one mile and a half in every direction from this mile post.”\nThe post is about three feet high and each of its four sides measure 12 inches. The marker shows plenty of signs from being unprotected from the elements for nearly a century, before the viaduct was built in 1929.\nRELATED: More photos of the Zero Mile Post Marker and related Atlanta history\nRELATED: 10 important historical events in Atlanta history\nIf you would like to read more about the Zero Mile Post, go to nps.gov/nr/travel/atlanta/wes.htm.\nFor more places to see in downtown Atlanta, visit AJC’s Downtown Atlanta Visitor Guide\nFind the Atlanta Zero Mile Post on a map. (It is between Five Points and the Georgia State Capitol)","url":"https://www.ajc.com/news/actual-factual-georgia-zero-mile-post-marks-city-start/ibTw4U3AnT86ufvrNXq0tI/"}
