{"authors":[],"date_download":"2018-10-30 14:31:02","date_modify":"2018-10-30 14:31:02","date_publish":"2016-11-30 13:17:00","description":"Why you should live in Midtown, the Galleria, Alpharetta, or Westside for taco trucks.","filename":"data/vaneerConsumption/Wheretolivetobeclose.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/30/Images/photos.medleyphoto.12484307.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/classifieds_homes_where-live-atlanta-you-love-taco-trucks__1540909862.html","title":"Where to live to be close","title_page":"Taco trucks in Atlanta: Where to live to be close","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta has a strong culinary scene, but for some people the food trucks are most important. Taco trucks, specifically. That's because for those people, taco trucks are life.\nAnyone in the Atlanta area who lives for tasty Tex-Mex treats can move to these neighborhoods to ensure they always find a taco truck on the corner.\nMidtown\nMidtown Atlanta is a bustling business district filled with urban dwellers. It's also a taco truck haven.\nEvery Thursday, between noon and 2 p.m. food trucks line up at 12th Street and Peachtree. One of the regulars is Tex's Tacos, known for its lime french fries sprinkled with margarita-like salt.\n\"There's always a great crowd,\" said Katherine Kimbrell, who co-owns Tex's Tacos with her fiance Jeff Latham. \"We can sometimes feed 200 people in one afternoon.\"\nConsidered the \"Antonio Banderas\" of food trucks, Tex's Tacos is actually made up of two food trucks that circulate throughout Atlanta providing lunch and dinner, and catering private parties.\nLike most food trucks, Tex's Tacos moves around the city and uses social media to update customers on their whereabouts.\nThe truck is a lunch favorite for those who work in Midtown and a welcomed rolling restaurant for residents. Homes in Midtown range from the tiny flat of less than 500-square foot for less than $100,000 to the ultra swanky high-rise condos for over $1 million.\nhttps://www.trulia.com/property/1090789461-708-Argonne-Ave-NE-2-Atlanta-GA-30308\nAtlanta Galleria\nThe Atlanta Galleria is a business district that attracts a diverse group of young professionals. Although large corporate complexes dominate the center of activity, the area has a beautiful Bob Callan trail that connects to national park space near the Chattahoochee River National Recreation Area.\nThe Cobb Galleria Center and Cumberland Mall provide an array of shoping, dinning and entertainment offerings. Pricey high-rise condos sell for over a $1 million. But a two-mile bike ride away are affordable condos for less than $100,000, like this one-bedroom listing on Seven Pines Ct, within walking distance of the new Suntrust Field.\nYou can also find the Blaxican Food Truck, which serves up Mexican soul food.\n\"Que pasa y'all,\" is a slogan used by Blaxican. This fusion food caught the eye of rapper Snoop Dogg who once tweeted \"Who do this? So you telling me I can get soul food and tacos?\"\nYes, Snoop you can. The Blaxican offers elections such as smoked sausage tacos and jalapeno mac and cheese. The Blaxican moves around, but the Galleria during 11 a.m. and 2 p.m. is one of the truck's regular stops. Check the calendar to see where it rolls up next.\nIf you'd like to take your tacos and retreat to a sprawling estate, this six bedroom, eight-bath Vinings Village mansion is available for $2,199,000. With more than 7,000-square feet, there's plenty space for to enjoy chips and salsa.\nAlpharetta\nAlpharetta's Food Truck Alley draws crowds every Thursday during the warmer months of the year. Kimbrell said that's one of their favorite spots. She noticed the different customers based on location. \"More young people, in Midtown,\" Kimbrell said. \"In Alpharetta it's mostly families coming out for dinner.\"\nThere's also live music and beer tents, said Kimbrell. Located on 37 Old Roswell Street in Alpharetta, the Food Truck Alley is open from 5 to 9 p.m. so it draws a dinner crowd.\nIt's the perfect setting for this suburban neighborhood with an increasingly urban vibe. With its good schools and growing retail outlets, Alpharetta offers residents affordable luxury with all the amenities available to city dwellers, such as upscale day spas, boutiques, wine shops and movie theaters.\nSingle family homes in gated communities are popping up all over Alpharetta. New construction, such as these luxury models from EA Homes, are being built in communities with tennis courts and country-club style club houses.\nHowever, those who wish to make a taco truck stop on the way home, can still find affordable condos and townhouses, such as this two-bedroom, three bath home with a fireplace, less than two miles from the Food Truck Alley.\nWestside\nThe Atlanta Food Truck Park and Market at 1850 Howell Mill Road is like an outdoor foodcourt. Open Friday through Sunday, this park attracts all types of food trucks, including Tex's Tacos, the Blaxican and Yumbii, which offers an Asian/Mexican fusion menu.\nWith areas ranging from upscale near Buckhead to those still in the revitalization stage, the Westside is trendy and eclectic. Residents get access to public transportation, hip nightlife and cultural offerings.\nA blog for 2460 Peachtree Apartments in Buckhead featured Blaxican and Yumbii among their favorite food trucks.\nRemodeled homes with luxurious interiors are available for under $100,000. This small one-bedroom condo with granite counters in the kitchen, sells for $79,000.\nIf you crave Southern charm as much as you do guacamole, this lovely Charleston-style home with a front porch is available for $380,000.\nA cute porch in the city and a plate of tacos; now that's livin' la vida loca.","url":"https://www.ajc.com/classifieds/homes/where-live-atlanta-you-love-taco-trucks/R6yAIXFmLZLJNqo0y6S4qM/"}
