{"authors":[],"date_download":"2018-10-30 18:43:24","date_modify":"2018-10-30 18:43:24","date_publish":"2016-10-17 14:13:00","description":"The best places to live in Atlanta with kids are in the suburbs, according to a report. These are the best places to live in Georgia with families.","filename":"data/vaneerConsumption/WheretoraiseafamilyinGeorgia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/17/Images/newsEngin.16487002_Family-3.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_for-families-atlanta-rank-woeful-but-suburbs-glow__1540925004.html","title":"Where to raise a family in Georgia","title_page":"Best Atlanta suburbs: Where to raise a family in Georgia","title_rss":"NULL","source_domain":"ajc.com","text":"Sad! In a ranking of the 100 best places to raise a family Atlanta ranks 77th. And that is just in Georgia!!\nBut wait, when we say Atlanta, we are – somewhat atypically – actually referring to Atlanta. You know – the city? Not the metro region, as in, you tell people elsewhere that you live in Atlanta, but it’s actually a forty minute drive to get there.\nAnyhow, the list-happy folks at WalletHub have calculated rankings on a series of metrics that they think are critical to judging how good an area is for family-raisin’ and applied it to the towns and cities of Georgia.\nAnd on that hierarchy, Atlanta was 24th from the bottom, scoring high on “attractions,” but when it came to a series of other family-friendly measures? Not. So. Much.\nNow, your mileage may vary, of course. For one thing, WalletHub was trying to find family-centric ways to calculate rankings. You just may have a different set of priorities if you happen to be, say, a Millennial Single Dude (or Dudess, for that matter).\nOr, for example, if you’re an Empty Nesting Retiree, too, you may not be all that worried about good elementary schools or youth sports.\nIn any event, on divorce rate, Atlanta was 81st. On affordability of housing, 82nd. Contrary to some stereotypes, the city was better on violent crime – 64th – but that was still below average.\nBut if like quite a few folks, you define your Atlanta-ness in a regional kinda way, then the story is actually pretty positive.\nOf the top ten places to raise a family, eight are in the Atlanta metro area, according to the 21 metrics used in the WalletHub calculations. Number one is Johns Creek.\nWalletHub is Washington, D.C.-based outfit that collects credit and consumer information. And they make a lot of lists, too.\nThe WalletHub study can be found by clicking here.\nTop ten places to raise a family:\n1. Johns Creek\n2. Milton\n3. Alpharetta\n4. Cusseta\n5. Suwanee\n6. Druid Hills\n7. Peachtree City\n8. Decatur\n9. Evans\n10. Woodstock\nWalletHub’s bottom ten places in Georgia:\n91. Brunswick\n92. Moultrie\n93. Griffin\n94. Belvedere Park\n95. Monroe\n96. Doraville\n97. Union City\n98. East Point\n99. Candler-McAfee\n100. College Park\nSource: WalletHub","url":"https://www.ajc.com/business/for-families-atlanta-rank-woeful-but-suburbs-glow/g8XNghKT8fhBJBIqOtFxTN/"}
