{"authors":["Lulu Chang"],"date_download":"2018-10-30 22:33:53","date_modify":"2018-10-30 22:33:53","date_publish":"2014-08-15 01:00:03","description":"On October 15, 2009, 6-year-old Falcon Heene, aka the Balloon Boy, became the source of a wild goose chase that took Colorado authorities over both the land and air space of northern Colorado. After his parents, Richard and Mayumi, frantically…","filename":"data/vaneerConsumption/WhereIsTheBalloonBoyHeeneFamilyNowTheBoysFormedAHeavyMetalBand.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/8b4c3d0d-052e-4566-9081-9095f9f0ae93.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35503-where-is-the-balloon-boy-heene-family-now-the-boys-formed-a-heavy-metal-band_1540938833.html","title":"Where Is The \"Balloon Boy\" Heene Family Now? The Boys Formed A Heavy Metal Band","title_page":"Where Is The \"Balloon Boy\" Heene Family Now? The Boys Formed A Heavy Metal Band","title_rss":"NULL","source_domain":"bustle.com","text":"On October 15, 2009, 6-year-old Falcon Heene, aka the Balloon Boy, became the source of a wild goose chase that took Colorado authorities over both the land and air space of northern Colorado. After his parents, Richard and Mayumi, frantically alerted local police that their son was trapped in a balloon floating up to 7,000 feet above ground, the world watched in horror as the desperate search for the missing child dragged on for over four hours.\nBut that evening, around 6 p.m., it emerges that Falcon Heene had never even left his house, much less the ground. In fact, he was found in the attic of his home, where he had fallen asleep in a box after playing with his toys.\nThe story immediately drew a swarm of media attention — after all, it isn't every day that news crews cover a runaway UFO-like balloon potentially carrying a 6-year-old boy. But with the enormous influx of attention also came suspicions that the whole ordeal was nothing more than a hoax, one that Falcon's parents hoped would simply garner them their 15 minutes of fame.\nJust a few days later, these suspicions were confirmed, and since then, both parents have served jail time for their exploitative little stunt. But what else has the Heene family been up to in the five years since the most infamous scam in recent memory? After all, there's much to expect from a family like that.\nHold on, what exactly happened?!\nGood idea — it's a great story, even if it's not real. On a Thursday morning in Colorado, the Heene family was \"experimenting\" with the launch of a \"3D low-altitude vehicle\" — a large, silver balloon measuring 20 feet across and 5 feet high that closely resembled an extraterrestrial spaceship. Constructed of plastic tarps, aluminum poles, duct tape and string, the balloon also contained what the family called a \"battery compartment,\" which in turn, the family claimed, contained Falcon.\nAccording to one of Falcon's brothers, the 6-year-old had climbed into the balloon immediately before its launch. The plan, the family said, was to simply get the balloon up in the air, but keep it tethered to the ground so as to prevent it from floating away. But apparently, someone \"forgot\" to secure the contraption, and it went up, up, and away.\nThen, in a strange move, rather than immediately phoning the police, Richard Heene called local news station KUSA-TV, and asked them to send a news helicopter. Initially, the station director refused, telling Heene, \"I don't believe you.\" It wasn't until after the police verified a missing child report that the helicopter was dispatched, and the media circus began.\nSo enthralled were newscasters and the public alike by the story that the National Guard was dispatched, and several counties became involved in the widespread search. The balloon stayed in flight for over 90 minutes, and when it finally touched down, there was no Falcon to be found. This prompted another cause for concern, as one deputy reported that he saw an object fall from the balloon before landing — but this search also proved unfruitful.\nSo where was Falcon?\nAt home, in the attic. Where he had been the whole time.\nSeems reasonable — why did people think it was a hoax?\nDoubt arose almost as soon as Falcon was found. For one thing, the Heenes' choice to first notify a news station rather than authorities raised a few eyebrows. Secondly, given the size and the construction of the balloon, it seemed highly unlikely that a 6-year-old would fit, much less be able to be carried, by the balloon over such a long distance and at such a high altitude. And considering the Heenes had made the balloon themselves, many suspected that the family knew exactly what the balloon was and was not capable of doing.\nJohn Moore/Getty Images News/Getty Images\nFurthermore, a home video released the day after the incident that showed the entire launch and initial panic also displayed Richard Heene carefully checking the compartment were Falcon was said to be hidden. And then, of course, there was the family's questionable background.\nWhat background?\nThe Heenes, particularly Mayumi and Richard, were no strangers to television at the time of the incident. In fact, they had appeared on ABC's Wife Swap twice before, the second time as fan favorites. Then there was also Richard's reputation as something of a mad scientist and a storm chase — one who questioned Hillary Clinton's identity as a \"reptilian\" and took his sons with him into hurricanes and other storms.\nPoliticsNewsPolitics on YouTube\nBefore the balloon hoax, the Heenes had also (unsuccessfully) pitched a show to TLC, believing their curious interests to be the stuff of great reality television. TLC apparently disagreed, and the Heenes chose to make headlines in a different way.\nSo what ended up happening?\nThe Heenes really drew heat when Falcon himself seemed to suggest that it was a publicity stunt all along, telling Wolf Blitzer on Larry King Live, \"You guys said we did this for the show.\" His father adamantly denied that anything had been set up, and insisted that he had nothing to gain. In an interview with NBC's Today Show later that week, he said, \"I’m not selling anything. I’m not advertising anything.\"\nBut authorities didn't buy it, and just four days later, Larimer County Sheriff Jim Alderden called the incident \"absolutely ... a hoax.\" Deeming it a \"publicity stunt,\" Alderden told reporters that the Heenes had constructed the entire story and situation \"with hopes of better maneuvering themselves for a reality TV show.\"\nChris Schneider/Getty Images News/Getty Images\nOne year later, Richard and Mayumi Heene were sentenced to a combined total of 110 days of jail and eight years of probation, a sentence that some thought to be far too lenient. David Lane, Heene's own attorney, estimated that the hoax cost the Larimer County District Attorney's Office $46,000, which included overtime for officers, the two helicopters that were used in the search, and various other costs associated with the multiple counties involved.\nMatt McClain/Getty Images News/Getty Images\nDo they admit that it was a hoax?\nMayumi Heene reportedly told authorities just a couple days after the initial scare that she knew all along where her son was, but Richard Heene still insists that it was never a hoax (though he apologized for it during his sentencing). On a recent episode of Oprah: Where Are They Now? Heene explained that he pled guilty to protect his family and to prevent his wife from potential deportation.\nOWN on YouTube\n\"It was the easy way out, rather than taking my kids to court, possibly losing them...I took the guilty plea to save my family,\" Heene said.\nWhat is the family up to now?\nThe Huffington Post, who maintains a running Heene vertical, has reported that Richard Heene has showcased at least three bizarre inventions since pretending to have lost his son. One, called the Bearscratch, is nothing more than a piece of bark nailed to a wall that allows the poor fool who purchased it to scratch his back by himself — you know, like a bear.\nAnother, called the HeeneDuty Truck Transformer, is self-loading robot-like truck that Heene managed to sell to AME International in a deal that is worth up to $65 million over the course of five years. And then there's also YourShakedown, a device for the thrifty consumer who wants to squeeze every last bit of their shampoo, ketchup, or almond butter out of the bottle.\nThe Heenes also tried to auction off the balloon that figured in the famous \"accident.\" How's that for \"not selling anything,\" Richard?\nBut the kids! What about the kids?\nIron/Glass Productions on YouTube\nThe kids are doing even better than the parents, it seems. In fact, the Heene boys now make up the youngest heavy metal band ever, appropriately named the Heene Boyz, and they've already released two albums. So if Richard Heene's wacky inventions never take off, he can at least look to the musical talents of his sons to sustain his entrepreneurial adventures.\nSay what you will about the Heene family, but that's one household where I'd just love to be a fly on the wall.\nImages: 9News, Bloomberg,","url":"https://www.bustle.com/articles/35503-where-is-the-balloon-boy-heene-family-now-the-boys-formed-a-heavy-metal-band"}
