{"authors":["Sam Ramsden"],"date_download":"2018-10-31 00:02:37","date_modify":"2018-10-31 00:02:37","date_publish":"2018-10-28 11:15:29","description":"Sunday evenings and a good old television drama pretty much go hand in hand, and with the arrival of BBC's The Little Drummer Girl, it seems viewers have yet another brilliant drama series to enjoy each weekend. The series tells the story of a young…","filename":"data/vaneerConsumption/WhereWasTheLittleDrummerGirlFilmedBBCsNewDramaUtilisedSomeLandmarkLocations.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/26/192d07c9-b66b-4a13-a624-a2e772f19c44-16256973-low_res-the-little-drummer-girl.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_where-was-the-little-drummer-girl-filmed-bbcs-new-drama-utilised-some-landmark-locations-12985104_1540944157.html","title":"Where Was 'The Little Drummer Girl' Filmed? BBC's New Drama Utilised Some Landmark Locations","title_page":"Where Was 'The Little Drummer Girl' Filmed? BBC's New Drama Utilised Some Landmark Locations","title_rss":"NULL","source_domain":"bustle.com","text":"Sunday evenings and a good old television drama pretty much go hand in hand, and with the arrival of BBC's The Little Drummer Girl, it seems viewers have yet another brilliant drama series to enjoy each weekend. The series tells the story of a young actress, and double agent, who finds herself caught up in the world of an Israeli spy. The story is primarily set in Germany and Greece, but where was The Little Drummer Girl filmed?\nAccording to the Express, the majority of the spy thriller was actually filmed on location at European cities including London and Prague, but filming mostly took place in the Greek capital city of Athens. Whilst filming in the ancient city, the cast and crew of the BBC series were given special permission by the Greek government to film on the Acropolis during the night — which was the first time a night shoot had ever been permitted in that particular location.\nWhen discussing the historic filming locations the executive producer of the show, Simon Cornwell, said: \"We were very lucky. The Greek Government was incredibly supportive. Shooting on the Acropolis was a very big deal, shooting at night on the Acropolis, flying a drone over the Acropolis was a first in the 2,500 years since it was built.\" He continued, \"It went up to the ministerial and even prime ministerial level as a decision, but once the Greek government had committed to letting us do it, they were incredibly supportive and certainly it was, if not one of the most memorable nights of my life\".\nBBC\nDirector Park Chan-wook also told the Greek Film Center that \"the immense privilege of shooting at such historically and culturally important places such as the Acropolis or Temple of Poseidon cannot be understated.\" The National Herald also reports the crew was pretty extensive, 165 Greek members and 95 Brits. Chan-woom added:\n\"Greece, as the birthplace of Western drama, offers filmmakers a canvas of unique resonance and, for me, it is the perfect place to tell the story of Charlie.”\nOther notable filming spots featured throughout The Little Drummer Girl included the Temple of Poseidon on Greece’s Attica Peninsula, and an ancient temple which was constructed during 444-440 BC. The production team behind the thriller also made use of the surrounding Greek landscape to represent other areas of the world, which featured throughout the original story. The Nikaia region of Athens was used to represent Palestine, whilst the Greek town of Eleusis, was used to represent Lebanon, reports the Express.\nBBC / The Little Drummer Girl Distribution Limited\nWhen commenting on the decision to utilise their various filming locations, Producer of the series, Laura Hasting, said: \"This story takes place in more and more countries and obviously we wouldn't and couldn’t shoot all over the world so we made a decision very early on that we would obviously shoot in this country (UK) and then Greece where we had to obviously go for the Acropolis, we weren’t going to create that anywhere else.\" She continued \"We decided to shoot the Yugoslav stuff, the Turkish stuff, Israeli and then most importantly, all the Lebanese stuff that you will see in the next few episodes so Greece works for all those different locations\".\nThe series is created by the Cornwell brothers, the pair who brought the massively popular spy drama The Night Manager to our TV screens back in 2016. The brothers are actually the sons of John le Carré’s, the author who penned the original novel on which The Little Drummer Girl is based. The sibling's production company is known as The Ink Factory, according to Variety, which will help bring their father's story to life onscreen. The locations often take centre stage in their dramas, with The Telegraph reporting that The Night Manager shot in a 17th century Majorcan fortress turned villa, which served as Richard Roper's iconic lair, as well as Zermatt, Morocco, and Devon.\nThis thrilling story, combined with stunning on-set locations are sure to provide some quality Sunday night viewing, and I can't wait for this series to get started.","url":"https://www.bustle.com/p/where-was-the-little-drummer-girl-filmed-bbcs-new-drama-utilised-some-landmark-locations-12985104"}
