{"authors":["Matthew Wright For Dailymail.Com"],"date_download":"2018-10-23 02:07:21","date_modify":"2018-10-23 02:07:21","date_publish":"2017-03-16 12:29:48","description":"After it was announced in that Kate McKinnon (inset) would be voicing the role of Ms Frizzle in the Magic School Bus reboot, DailyMail.com talked to cast from the original show to hear their thoughts.","filename":"data/vaneerConsumption/WherearetheoriginalMagicSchoolBuscastnow.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/20/3E4EEC7600000578-0-image-a-95_1489608411760.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4314210_Where-cast-original-Magic-School-Bus-now_1540260441.html","title":"Where are the original Magic School Bus cast now?","title_page":"Where are the original Magic School Bus cast now? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It’s time to put back on your ‘seat belts, everyone!’\nFor more than two decades the Canadian television show Magic School Bus encouraged children to follow their dreams as the eccentric teacher Ms Frizzle, her gadget-filled bus and eager students went on unconventional field trips exploring the wonders of the scientific world.\nFollowing the books of the same name created by Joanna Cole, the 52-episode run first aired in 1994 and ended in 1997, airing reruns ever since.\nIt was such a millennial favorite that it was recently announced in February that Saturday Night Live star Kate McKinnon would assume the role of Ms Frizzle in the Netflix’s upcoming Magic School Bus reboot.\nShe fills the shoes of Lily Tomlin, who voiced the creative educator who doubled as the bus driver for the original animated series and won an Emmy in 1995 for the role.\nScroll down for video\nIn February it was announced that SNL star Kate McKinnon would play the role of Ms Frizzle in the Netflix upcoming Magic School Bus reboot. The eccentric teacher took her willing students on wacky field trips on a magical bus that could transform into a rocket and submarine\nKate McKinnon (left) takes on a character first played by Lily Tomlin (right) who won an Emmy in 1995 for the role\nAnd while it is uncertain whether any of the actors of Magic School Bus will reprise their roles as students, it has been speculated that a few may have tried to board the bus again.\nThroughout the shows run, the actors who played the original Arnold Perlstein and Tim Jamal would be replaced because their voices changed due to puberty.\nIn exclusive interviews with DailyMail.com, five of the eight student cast members from the original series shared their feelings about the new show and what they’ve been up to since that final recording session in 1997.\n‘You can’t turn into a Tyrannosaurus rex to fix all your problems’: Child star Danny Tamberelli ditched acting to pursue music after playing nerdy Arnold Perlstein\nDanny Tamberelli was a fan of the Magic School Bus book series before he was tapped to voice the role of nerdy Arnold Perlstein.\nArnold Perlstein was known as the nerd on the show who hardly enjoyed going on the field trips. Ms Frizzle once turned him into a Tyrannosaurus rex and he was often a deciding factor on what the students did on the show\nAlready a notable child actor on popular show The Adventures of Pete & Pete and cult classic movie The Mighty Ducks, Danny was not an original member of the show but was asked to audition after actor Amos Crawley’s voice got too deep for the part after the first season.\nAnd it was a perfect fit for the American actor who had to fly back and forth from Los Angeles to Toronto four times a month to record his lines for the character who despised the eccentric field trips.\n‘We shared similar characteristics because you may not enjoy the situation that you are in but you make do and something is going to happen and then you are going to come out and fix the problem,’ said Danny.\n‘She (Ms Frizzle) turned me into a Tyrannosaurus rex. I was the one kid who was like “I don’t want to be here” and there were times in my life where I was like I don’t want to be here.’\nDanny Tamberelli voiced Arnold starting in the second season after the original actor's - Amos Crawley - got too deep because of puberty. The American actor often had to fly back and forth from Los Angeles to Toronto to film his scenes with the rest of the cast\nBut Danny enjoyed being in Canada with his fellow classmates as the group quickly took him under their wing especially Stuart Stone (Ralphie) who taught his 13-year-old costar about Newfoundland slang and the country’s double tax.\nWhen the young actor was obsessed with Pogs milk caps, he recalled when his older costar had a very visceral response to the hobby.\nDanny said: He looked at me being like “are you sure that’s what you want to be doing with your life.”’\nFollowing Magic School Bus, Danny continued his work with Nickelodeon on All That and guest starred on the Amanda Show.\nBut while recording voice work on the cartoon Fillmore, Danny felt it was time to give acting a break.\n‘It’s kind of hard when you see all your friends going to college and you’re like “should I stay in New York and be an adult\",' said the actor who went to Hampshire College in Amherst, Massachusetts to study music in 2000.\n‘When kids recognized me from Magic School Bus, their heads would explode. I definitely had people print out pictures of Arnold and stick them on my dorm room.’\nDanny took a break from acting to pursue a music career and has had a band called Jounce for the past 17 years\nAnd for the past 17 years, Danny has been a part of a band called Jounce and still does tours with the group. He also performs at comedy shows and in a Weezer cover band Undone Sweaters and a jazz/funk group with Mike Clark from the Headhunters.\nToday he films a podcast with the older Pete - Mike Maronna – called Danny and Mike and runs a sketch comedy website Manboobscomedy.com where he features guest appearances from All That cast mates Kenan Thompson, Josh Server and Mark Saul.\nBut Danny’s role as Arnold is certainly one of his favorite and most memorable.\n‘There are a lot of kids who have come up to me as adults happy to see someone like that on TV,’ said the now 35-year-old who lives in New York with his fiancé and seven plants.\n‘You are rooting for him because he is an honest character.’\nThe actor is definitely rooting for the Magic School Bus reboot. He's expecting great things from the show and even hoping there may be a place for him on it.\n‘If they ever need Arnold Perlstein’s dad, let me know,’ he joked.\n‘That would be a lot of fun. Send me up to Toronto again, that would be great.\n‘And we should have gotten first dibs.’\nAlthough Danny took a step back away from acting, he doesn’t regret the decision at all and does an occasional job like voice work for Grand Theft Auto V as Jimmy De Santa.\nDanny said: ‘I just wanted to be a kid and enjoy that and if it is something that you want to do it will come back.\n‘You can’t turn into a Tyrannosaurus rex to fix all your problems.’\nNot such a sweet girl: Erica Luttrell loves playing characters who walk the line between good and evil but enjoyed the sass she was able to bring to Keesha Franklin\nWhen Erica Luttrell tried out for the role of level-headed Keesha Franklin it was a perfect fit.\nThe at the time 10-year-old often had her curly brown hair tied into a ponytail similar to her character on Magic School Bus and a witty personality to match.\nIt was a contrast to the sweet innocent child roles she was used to playing having first appeared in a Pampers commercial when she was two.\n‘Since then I’ve played a lot more sinister and darker characters which is lovely for me because I played a lot of sweet ones as a kid, said the now 34-year-old.\nErica Luttrell (left) voiced the sassy level-headed Keesha Franklin on the show. The at the time 10-year-old looked just like her character often sporting her curly brown hair into a ponytail\nThe youngest daughter of an American father and Tanzanian mother, Erica jumped right into acting appearing as Kara Cupper in the Shining Time Station franchise.\nMagic School Bus was the Canadian actress’s first voice job and she was immediately hooked by how chill the environment was without having to do hair and makeup. She was also immediately drawn to her cast members.\nShe said: ‘We would just sit about and eat and play and laugh and then go into the booth and do more laughing.\n‘Stuart (who played Ralphie) was hilarious! He was always a jokester and fun to be around and added a really good vibe to the sessions as someone who was new to it.’\nAnd after recently finding an old cassette of Magic School Bus recycling songs, the Toronto native recalls the fond memories she has of the show.\nErica still does voice work in Los Angeles, most recently as the voice of Sapphire on Steven’s Universe. She also has done work for video games including Diablo III and Dishonored 2\n‘I remember when we were doing the Space episode we were all told how to pronounce Uranus which is actually the correct pronunciation but no do not pronounce it Ur-ANUS,’ said Erica laughingly.\n‘There was one time that I came out to Los Angeles and I got to record finally with Lily Tomlin. Even for me I didn’t grow up watching her but she was pretty iconic.’\nFollowing the series finale, Erica made her way to Los Angeles after she was nominated for a Hollywood Reporter Young Star Award for her work on the CBS show The New Ghostwriter Mysteries.\nShe would go on to have guest star appearances on several popular TV shows including General Hospital General Hospital, Dexter, Buffy the Vampire Slayer. But her passion was voice work, eventually taking the roles on As Told By Ginger and of Princess Candy on Dave the Barbarian in the mid-2000s.\nErica has since done a lot of video game work as well, lending her voice to Dragon Age: Origins, the witch doctor of Diablo III, Final Fantasy XIII, World of Warcraft, Evolve, Lego Jurassic World and most recently Dishonored 2.\nShe still regularly appears on TV with guest roles on Lost Girl, Days of Our Lives, iZombie, Arrow and an ever expanding list.\nShe said: ‘Of all the shows that I have been on they do feel like family but in particular the Magic School Bus did. The show is all about the fun of it and absorbing new knowledge and having new experiences.' The cast goes over their lines for the show\nToday, fans know her as the voice of Sapphire on Steven’s Universe and as Aneka on the series Avengers Assemble. She’s also currently working on a show called Confess but Erica definitely prefers playing characters that toe the line of good and evil.\n‘I like playing conflicted heroes,’ she said.\nAnd with the news that Magic School Bus Rides Again will be on Netflix, Erica finds herself ‘totally excited’ and ‘thrilled’ with the casting of Kate McKinnon as Ms. Frizzle.\nErica said: ‘When I heard Kate McKinnon was signing on I was like that is the best because she is amazing and hilarious and everything right now.\n‘Clearly they have the right intentions.’\nBut the seasoned actress definitely misses the days of being on the show and her cast mates, many of which she hasn’t seen in almost 20 years.\n‘Of all the shows that I have been on they do feel like family but in particular the Magic School Bus did,’ she said. ‘The show is all about the fun of it and absorbing new knowledge and having new experiences.\nDaniel De Santo, AKA class clown Carlos Ramon, went on to have a role in the iconic Tina Fey movie Mean Girls\nCarlos Ramon cracked terrible puns that caused his classmates to groan: 'Carlos!' at least once every episode. He was voiced by Daniel De Santo who was known as a joker behind the scenes as well\nKnown for being a joker behind-the-scenes as well as on the show, his character cracked terrible puns that caused his classmates to groan: ‘Carlos!’ at least once every episode.\nHaving first taken on the role when he was just 12, Daniel De Santo worked on Magic School Bus until he was 16.\nBut the actor isn’t thrilled by the Netflix reboot. He had to audition again for his role - and as yet hasn’t heard back.\nHe said: ‘It’s a little disappointing. It became such an iconic show and when the new one came out I still do voice work and so does Stu and on Paw Patrol I play a kid so we can still sound young.’\n‘It was kind of s****y because not only did they not tell us but we had to send tape and audition for our roles. It would have been nice if they would have contacted.’\nDaniel (left) walks with Andre Ottley-Lorant (the second Tim Jamal) and Tara Meyer (Dorothy Ann) while on break during a recording session of the show. About the reboot he said: ‘It’s a little disappointing. It became such an iconic show and when the new one came out I still do voice work and so does Stu and on Paw Patrol I play a kid so we can still sound young’\nNow 36 years old, Daniel is still doing voice work. He recently recorded the role of a child for the Nick Jr show Paw Patrol. He has also guest starred on the FXX series Man Seeking Woman.\nSpeaking of his part on Magic School Bus, he said: ‘From an actor’s standpoint, yes they created the show and the character but I brought another half that was me. That was my life experiences and my life as a kid.\n‘You say well he’s in his 30s now he can’t do that anymore… that’s not necessarily true.’\nBut he is still optimistic to what the franchise can do with the series and looks back fondly on his contributions to it.\n‘I am so lucky and honored to have been a part of the show but it is kind of a double edged sword when you know that a new one is coming out and you aren’t a part of it.\n‘It is exciting that there is a revamped show. It is a new show and a new cast and it will be a new generation that grows up with it.’\nThe 36-year-old still does voice work and recently recorded the role of a child for the Nick Jr show Paw Patrol. He has also guest starred on the FXX series Man Seeking Woman\nSo as the joker and the butt of others’ jokes with his terrible puns and the frequent refrain of: ‘Carlos!’ echoing through the series, Carlos proved to be one of the highlights of the Magic School Bus series.\n‘When you get to do something like that you get to stand out. You could look at it as being the butt of the joke but I looked at it as a moment for Carlos’s time to shine.’\nThe Toronto native wasn’t a newcomer to the industry by the time he was cast on the TV series.\nAnd when the cast had to be separated because they goofed off too much on set, Daniel had to complete most of his sessions with fellow bad boy Stuart who was always a riot.\nLaughing, Daniel said: ‘Stuart was one of the first to get his license and he drove to work one day and he came in and was like who’s so and so’s car and it was my mom.\nDaniel most notably played Rachel's love interest Jason on the Tina Fey cult film Mean Girls. He told DailyMail.com that the infamous scene of him getting slapped in the bathroom by Rachel, played by Lacey Chabert, was entirely ad libbed\n‘So Stuart had to come up to her and told her “Yeah, I kind of nixed your mirror while I was driving”.’\nAfter the show ended, Daniel attended the Ryerson University Film School with a scholarship from the Alliance of Canadian Cinema, Television and Radio Artists. And while going to school and playing varsity soccer, he also had parts in shows Are You Afraid of the Dark and BeyBlade.\nBut most notably, he appeared next to Lindsay Lohan and Tina Fey in the cult film Mean Girls as Rachel’s love interest Jason.\nDaniel told DailyMail.com that the infamous scene of him getting slapped in the bathroom by Rachel, played by Lacey Chabert, was entirely ad libbed.\nHe said: ‘Mark Waters wasn’t getting the reaction that he wanted and so he comes up to me privately and he is like “I want you to kiss Lacey and right before you kiss her I am going to yell Lindsay at the door” and then we are supposed to react.\n‘So we are on set and he calls action and Lacey looks at me and I am so nervous because I have never done on screen kissing before.\n‘She puts her hand on my chest and I am like ok I got to go in and so I pull her hair back and I lean in to kiss her.\nDaniel as Jason on Meangirls. Of the moment when he was slapped by Lacey, he said: ‘Mark Waters wasn’t getting the reaction that he wanted and so he comes up to me privately and he is like “I want you to kiss Lacey and right before you kiss her I am going to yell Lindsay at the door” and then we are supposed to react\n‘I am waiting on Mark to yell cut but he doesn’t and so I have to commit.\n‘Mark yells Lindsay and we both look and she just looks at me and slaps me across the face and I was in shock.’\nThe actor’s latest project finds him currently in South Africa filming for a Canadian miniseries the Indian Detective starring Russell Peters, Daniel’s best friend.\nAnd although Daniel still frequents Los Angeles to audition for pilot season from January to April, he is currently based back in Toronto.\n‘I don’t want to be waiting by the phone in my 40s,’ he said.\n‘Before I went to Los Angeles I felt worthless’: Lisa Jai who voiced Wanda Li found solace in California’s theater community while battling rheumatoid arthritis that she’s had since childhood\nWhen Lisa Jai was three her elbow crooked up.\nDoctors thought that because the Toronto native was a dancer she had hurt herself but by the time she was seven years old the diagnoses was clear. Lisa had rheumatoid arthritis.\n‘It has gotten worse in the last decade, which is why I have been taking a step back,’ said Lisa who is now living bicoastal in both Canada and LA.\nLisa and Stuart Stone shared the same manager and had done work together in previous years before he pushed for them to audition for Magic School Bus. Lisa, who identifies as Eurasian, was selected for the Asian tomboy ballet loving Wanda Li.\nWanda Li was an Asian tomboy who also happened to love ballet. She was voiced by Lisa Jai who shared the same manager as Stuart Stone and identifies as Eurasian.\nWhile on the show, Lisa hid her rheumatoid arthritis from her cast mate but today uses her condition as a point of advocacy often working in theater productions that feature a disability\nAnd Lisa loved working with her cast members. She shot lots of her scenes with costar Danny Tamberelli and referred to Daniel DeSanto and Stuart as the bad boys of the show.\n‘They had to separate us because we would just laugh,’ said Lisa, who was 13 when the show first started.\n‘All of our mics were open so we had to be quiet but Daniel, Stu and the first Arnold would make the girls laugh and we got in trouble.\n‘We would bite our fingers if someone was saying their lines and it was funny.’\nBut while she found steady work after the series finale, she noted that her grades were slipping which was something her mother was not really fond of.\n‘Magic School Bus helped me get out of high school because it helped me pass a test that I really needed,’ she said with a laugh.\n‘It was photosynthesis and it came up on my science test and I nailed it dude from end to end.’\nAfter doing a brief stint of voice work, the actresses preexisting condition worsened and Lisa determined that she no longer could ‘masquerade’ her pain.\nShe moved to New York to pursue coaching at Stellar Adler before going to the sister school in Los Angeles, California. After spending eight years there, Lisa received her working visa and has maintained a frequent presence in the theater community.\nShe said: ‘Los Angeles is my creative home, I owe them so much because before I went to Los Angeles, I felt worthless. There was always a lack of self-esteem because I kept the illness hidden so being in the area that I love the most that is when I saw it build’\n‘Los Angeles Theater, they embrace me,’ said the 34-year-old.\n‘Deformity, limp and all and there I can balance my activism for advocating for people with disabilities and ethnic diversity.’\nAnd while she has since gone back home to get access to medicine for her arthritis, the free agent actress just did a play reading for a girl with hemiparetic cerebral palsy.\n‘Los Angeles is my creative home, I owe them so much because before I went to Los Angeles, I felt worthless,’ said Lisa who is single.\n‘There was always a lack of self-esteem because I kept the illness hidden so being in the area that I love the most that is when I saw it build.’\nFor Lisa, most of the fuss surrounding the Magic School Bus Rides Again remains a mystery to the actress but she is excited for the show nonetheless.\n‘It is such a big production,’ she said.\nI really don’t know anything about it and I don’t feel no type of way and it may be because I’m used to being rejected so many times.’\nAnd she definitely sees space for the former cast to jokingly be involved in the show.\nShe said with a laugh: ‘Yo, let’s get the old crew back together. It would have been nice to have a reunion.\n‘We should do a podcast and we will sit there and break it down and go “NO”.\n‘The public will give the ultimate verdict and then we will know.’\nBut nevertheless, the actress is really looking forward for what’s to come for the series.\n‘I wish the Magic School Bus Rides Again all the best and I want to tell them to buckle up because they are in for a trip of a lifetime,’ said Lisa.\n‘I was able to get a green card and work visas all because of Magic School Bus.’: How Stuart Stone turned his time as Ralphie Tennelli to launch a film-making career\nStuart Stone, the oldest of the Magic School Bus children, played class leader Ralphie Tennelli. He said: 'I was 15 when I was cast as Ralphie,’ said Stuart is 39 today. ‘I didn’t go through puberty until I was 19 so my voice was really high all throughout high school. I was able to do voice work for kids until I was almost 20'\nRalphie Tennelli was often seen as the leader of Ms Frizzle’s class with his athletic background and outgoing imaginative spirit.\nAnd for class clown Stuart Stone, the oldest of the Magic School Bus children actors, the chance to take on the role and prove his chops was the opportunity of a lifetime.\n‘I was 15 when I was cast as Ralphie,’ said Stuart, who is now 39.\n‘I didn’t go through puberty until I was 19 so my voice was really high all throughout high school. I was able to do voice work for kids until I was almost 20.’\nStuart had been on several cartoons prior to his role on Magic School Bus having done voice work on shows such as Barbar, Beetlejuice and X-Men.\nThe Toronto native missed up to 90 days of school at a time while filming but felt closely connected to his costars and the school like element of the recording sessions.\nStuart said: ‘It was like being in class. People would get in trouble and you would have to ask to go to the bathroom. Ralphie had a lot of heavy lifting to do in the series and was the class clown on the show and I was probably one of the class clowns in the recording sessions’\nHe said: ‘It was like being in class. People would get in trouble and you would have to ask to go to the bathroom.\n‘Ralphie had a lot of heavy lifting to do in the series and was the class clown on the show and I was probably one of the class clowns in the recording sessions.’\nStuart (who goes by Stu) loved being on the series recalling the episode where the class explored the inside of Ralphie’s body and when the entire cast got to sing a song with country music icon Dolly Parton.\nStuart's favorite memory from the show was when the cast got to do a song with Dolly Parton (pictured with Lily Tomlin) who appeared as a guest on the Magic School Bus. Following the show, Stuart moved to Los Angeles to pursue acting and lived with fellow child star Devon Sawa\nAfter Magic School Bus the actor moved to Los Angeles and pursued his dreams both on and behind the screen living with fellow child star Devon Sawa.\nHe appeared in Donnie Darko and eventually was tapped to costar on Jamie Kennedy MTV show Blowin’ Up which produced the comical song Circle Circle Dot Dot.\nStuart would also appear in the movie Kickin’ It Old School and hit television show Rugrats while doing production work for Crris Angel’s magic show.\nThe actor launched one of the first podcast TSM radio more than 11-years-ago and has been influential in helping establish many popular podcast.\nToday he is a filmmaker with an award winning independent horror film Haunted House on Kirby road which is slated to hit US and UK markets by the end of 2017\n‘If it wasn’t for the Magic School Bus I do not know what would have happened to my career because it was such a powerful credit,’ he said.\n‘I was able to get a green card and work visas all because of Magic School Bus.’\nAnd Stuart is stoked about the new series having first heard rumors about its return back in 2014.\n‘I was like “What” and was reaching out to my agent and was like “I can still do the Ralphie Voice,”’ he said while laughing.\n‘We are in the 20th anniversary since the original show stopped recording and it is still a tool that is being used in classrooms today.\n‘The brand is such a powerful brand and I think it is in good hands.’\nToday Stuart is a filmmaker with an award winning independent horror film Haunted House on Kirby road set to hit United States and United Kingdom markets later in the year.\nHe also has a film called Scarecrows in post-production and already has three follow up movies in the queue with his production company that he runs with his brother-in-law actor Adam Rodness called 5’7 films.\nThe 39-year-old is stoked about the new series having first heard rumors about its return back in 2014. He said: ‘I was like “What” and was reaching out to my agent and was like “I can still do the Ralphie Voice,”’ he said while laughing.\nPerhaps his most controversial work is a documentary he’s working on about his father, who disappeared soon after the star began work on the Magic School Bus.\n‘I had heard rumors of my childhood acting fortune being misused by my dad,’ said Stuart.\n‘Not every parent is responsible with the kid’s money.\n‘If the kid is 10-years-old making 200,000 grand a year and the parent is broke, there is a fine line between what is acceptable and what is not.’\nThe documentary follows Stuart as he seeks answers for boxes of cards worth nothing that he received from his father who owned stores selling baseball cards.\nBut no worries as the cast still receives a check for their work on the show.\nThe producer said: ‘It is not enough money to retire but you can make a mortgage payment. It is the gift that keeps on giving.’\nBut while the money is a nice touch, Stuart holds onto his fond memories of the Magic School Bus and all that it has done for children and their parents.\n‘It still holds up because science and the lessons that are learned are timeless. Dinosaurs are still dinosaurs and space is still space,’ said Stuart\n‘It’s rare to be a part of a show that is multi-generational.’","url":"https://www.dailymail.co.uk/news/article-4314210/Where-cast-original-Magic-School-Bus-now.html"}
