{"authors":[],"date_download":"2018-10-30 18:16:39","date_modify":"2018-10-30 18:16:39","date_publish":"2017-04-26 19:47:00","description":"Margaret Mitchell, the author of 'Gone with the Wind,' wrote her book while living in Midtown Atlanta, Georgia. Learn about the home she called \"the dump\" and her other homes in Atlanta, including her childhood home where her mother point out where Confederate entrenchments passed through their yard","filename":"data/vaneerConsumption/WhereGonewiththeWindauthorlived.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p4/MyAJC/2013/11/07/Images/photos.medleyphoto.4083973.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_attractions_g_3ee4af34fb58f6303c5de2aa526e021a_new_1540923399.html","title":"Where 'Gone with the Wind' author lived","title_page":"Margaret Mitchell House: Where 'Gone with the Wind' author lived","title_rss":"NULL","source_domain":"ajc.com","text":"From the archives: The story “'GWTW' author's former homes are mostly memories” was originally published in The Atlanta Constitution and The Atlanta Journal on December 12, 1984.\nOriginal story: Margaret Mitchell's homes have been demolished, burned and boarded up. But mostly, they've been forgotten:\n296 E. Cain St., on the north side of Cain, approximately 200 feet east of Jackson Street.\nMiss Mitchell was born here in a two-story cottage Nov. 8, 1900. Her family rented the house from her widowed maternal grandmother, Annie Fitzgerald Stephens, who owned a dozen houses on the block. Mrs. Stephens would sit on the porch with her baby granddaughter and - according to \"Road to Tara, \" a biography of Miss Mitchell by Anne Edwards - point out where Confederate entrenchments had passed through the back yard Nov. 15, 1864, when most of the city was burned by the invading Union Army.\nThe site is now covered with kudzu vines, the birthplace destroyed by the Atlanta fire of 1917. Most of the property was taken two decades ago by the state highway department for the ill-fated Interstate 485, a half-mile stub off the Downtown Connector that was intended to connect with the Stone Mountain Freeway and Interstate 85 but is now part of the planned Presidential Parkway.\n187 N. Jackson St., southeast corner of Jackson and Highland Avenue intersection.\nRented from Grandmother Stephens in 1902, the house was destroyed by fire in 1916, and the property is now a parking lot for the Georgia Baptist Medical Center.\n179 N. Jackson St., south of previous residence.\nThe Mitchells bought this rambling, 12-story, Victorian house in 1902 and lived in it until 1912. It faced west, looking over pastureland toward downtown Atlanta. According to \"Road to Tara, \" it is here Miss Mitchell heard aging relatives tell stories of Atlanta's capture and was sung to sleep by her mother's Civil War songs. A fearless tomboy, she was nearly killed when her horse fell on her.\nThe house was destroyed by the fire of 1917, and the property is now the site of a Georgia Baptist Medical Center warehouse.\n1401 Peachtree Street, 100 feet north of 17th Street, just south of and across Peachtree from Pershing Point.\nBuilt in 1912, this mansion with two-story columns was Miss Mitchell's longest residence. Eleven years old and a vociferous reader when she moved there, she evolved into a Southern belle, the woman of the house (after her mother's death), the wife of Berrien Kinnard \"Red\" Upshaw and, finally, a working journalist.\nMiss Mitchell's brother, Stephens Mitchell, sold the house in 1952 with the stipulation that it be destroyed. He said neither he nor Miss Mitchell had wanted anyone else to live in it. They feared it might become a cheap boarding house or, even worse, a Margaret Mitchell shrine.\nA five-story, brick office building was erected on the lot and remains there today. Just off the sidewalk is a Margaret Mitchell historical marker, erected by the state in 1961 and the only marker at any of the sites of Miss Mitchell's homes.\n979 Crescent Ave., southeast corner of Crescent Avenue and 10th Street intersection.\nThe Crescent Apartments became the first home of Miss Mitchell and her second husband, John Marsh, in 1925. Built in 1913, the three-story, brick house had been divided into 10 apartments when the Marshes moved into a three-room, first-floor unit they called \"The Dump.\" Miss Mitchell furnished the tiny apartment with family hand-me-downs, painted it herself and shocked her neighbors by placing two cards on the door: \"Miss Margaret Munnerlyn Mitchell\" and \"Mr. John R. Marsh.\"\nRestoration work on the Margaret Mitchell House continues Wednesday, April 24, 1996 near downtown Atlanta. The building, nearly destroyed by fire in 1994, is where author Margaret Mitchell wrote 'Gone With The Wind.' Daimler-Benz, Germany's largest industrial group, is restoring the property and plans to make it their centerpiece for the 1996 Summer Olympics. (AP Photo/Tannen Maury) (TANNEN MAURY)\nMiss Mitchell wrote the bulk of \"Gone With the Wind\" here, her small Remington typewriter set on a sewing table below two long windows in an alcove at the front of the house.\nVacant for seven years, the house is now encircled by an ugly brown fence and a dead vine blankets its north wall. Debris surrounds a magnolia tree in the tiny back yard, a fire has destroyed parts of the top two floors and the Marshes' former bedroom is painted purple. All doors and windows are boarded up and signs warn trespassers of bad dogs.\n4 17th St., on north corner of intersection with West Peachtree.\nThe Russell was the Marshes' home from 1932 to 1939. A three-story, cream-brick building constructed in 1915, The Russell became the focus of Miss Mitchell's sudden following of fans after \"Gone With the Wind\" was published in 1936. She had finished writing it in the living room of the five-room, first-floor apartment, which was furnished with Grandmother Stephens' Victorian furniture.\nThe Russell is boarded up and has been vacant for two months. Its residents all moved before the Dec. 31 eviction deadline given them by their landlord, Post Properties Inc.\n1268 Piedmont Ave., on the north corner of the intersection with South Prado.\nThe Marshes moved to the Della Manta Apartments in 1939, shortly before the movie debut of \"Gone With the Wind, \" and lived there until Miss Mitchell's death Aug. 16, 1949. Several days after she died, virtually all of the \"Gone With the Wind\" manuscript and many of Miss Mitchell's important papers were burned by her secretary and a janitor - at Marsh's request - in the brick-and-concrete-block boiler room of the Della Manta's basement\nThe 67-year old, red-brick building was converted into condominiums four years ago and now goes by the name \"One South Prado.\" It is the only one of Miss Mitchell's seven residences that is occupied.\nDr. Gayatri Spivak, a native of India and now Longstreet professor of English at Emory University, moved into Miss Mitchell's former second- floor apartment in August. Although the unit is not as large as when Miss Mitchell lived there, the hardwood floors, high ceilings and crown molding remain. And, every so often, a stranger stops by, asking to see the apartment where Margaret Mitchell once lived.","url":"https://www.ajc.com/entertainment/attractions/gone-with-the-wind-author-margaret-mitchell-former-homes-are-mostly-memories/8n3u11ZCAAY03VcNCd2EaI/new.html"}
