{"authors":[],"date_download":"2018-10-30 01:09:44","date_modify":"2018-10-30 01:09:44","date_publish":"2015-05-22 08:00:00","description":null,"filename":"data/vaneerConsumption/WheretheTruthWanders.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/05/ukraine-kharkiv-residents-defend-lenin-monument-on-fatherland-day.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861784.html","title":"Where the Truth Wanders","title_page":"Where the Truth WandersThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"On the night of April 9, 2015, masked men belonging to an anti-Russian militant group launched an audacious nighttime raid in the northeastern Ukrainian city of Kharkiv. Their targets were not pro-Russian partisans, but rather three Soviet-era statues of Bolshevik heroes, including the Red Army commander Nikolai Rudnev. A week later, a similar nocturnal razzia was carried out against a monument to Vladimir Lenin that had theretofore graced the campus of Kharkiv’s National Technical University. Likely inspired by the Verkhovna Rada’s passage of the bill “On the condemnation of communist and the National Socialist (Nazi) regime totalitarian propaganda and ban of their symbols (№2558),” these acts of vandalism were met with sputtering rage in pro-Russian circles, with the Opposition Bloc party blaming Ukrainian nationalists for “dismantling everything, from history, to tradition, national holidays and memory.” Separatists in the border town of Novoazovsk, meanwhile, responded by solemnly re-erecting a statue of Lenin that had been toppled during the civil war, replete with what appeared to be the curious sartorial addition of a blue superhero cape. In an impromptu ceremony on the occasion, the local partisan commander announced that “the monument has now been restored” and that “the Nazis [i.e. the Ukrainian government] will be completely banished from our glorious Motherland,” with the engineer of the Red Terror looking on approvingly from his vantage point upon the plinth.\nThose April raids were only the latest in a series of attacks on symbolic vestiges of Soviet rule in post-Euromaidan Ukraine. Throughout 2014, pro-western revolutionary protesters toppled statues with Soviet signification, including a depiction of Field Marshal Mikhail Kutuzov in Brody, a memorial to Soviet soldiers in Stryi, and another memorial to Afgantsy veterans in Dnipropetrovsk. “Stop this lawlessness,” the Russian Foreign Ministry demanded in response, a reaction similar to that prompted by the infamous Bronze Soldier of Tallinn crisis of 2007, and one ultimately of equally little avail. It is becoming increasingly clear that the front-line between the Ukrainian government and the Russian-sponsored separatists runs not just through the contested Donbass and Pontic regions, but through the country’s historical landscape as well, with rhetoric that seems to have hardly evolved since the mid-twentieth century now reaching fever pitch.\nTo wit, the head of the Ukrainian Institute of National Remembrance, Vladimir Vetrovich, has declared war on “Soviet clichés” like the term “Great Patriotic War” — now officially referred to in Ukraine simply as “World War Two” — and President Petro Poroshenko has demanded to know “What is the difference between the Anschluss of Austria or the occupation of Sudentenland, and the annexation of Crimea or the attempts to tear away Donbass in 2014?” The Russian Foreign Ministry, for its part, has lamented that Kiev has “used truly totalitarian methods of liquidating unwanted parties, civic organizations and movements,” and of course the propagandists of the Donetsk People’s Republic routinely castigate the “fascistic” pro-western “Kyiv junta.” (It did not take particularly long for the memetics of Godwin’s Law to be made manifest in post-Euromaidan Ukraine.) The separatist Education Minister Igor V. Kostenok, meanwhile, has worked hard to establish a curriculum of “Fatherland History” that studiously avoids any mention of “nationalist” notions like the Stalinist terror-famine of 1932 to 1933.\nAlthough the mid-twentieth century is definitely the focal point of these battles over historical meaning, the rhetoric of the Ukrainian crisis can at times come across as even more superannuated, reaching back into the murky fug of eastern European history and prehistory. Thus can President Vladimir Putin justify the seizure of Crimea on the grounds that the peninsula has a “sacred meaning for Russia, like the Temple Mount in Jerusalem for Jews and Muslims,” representing “the spiritual source of the formation of the multifaced but monolithic Russian nation” and the “spiritual soil that our ancestors first and forever recognized their nationhood.” And thus can a certain Orthodox zealot by the name of Igor Druz, serving as the adviser to the Donetsk People’s Republic’s Ministry of Defense, proclaim that\nOn the Ukrainian side there are no Orthodox at all, because not a single churched Orthodox individual would go to fight against New Russia, because they know that the unity of Holy Rus is pleasing to God. All saints who have spoken on this topic are unanimous in saying that Holy Rus must be united. Meanwhile Ukrainian fascists are the real separatists and they want to divide New Russia from Holy Rus and unite it to the decaying warmongering West. Therefore there are no church people on the Ukrainian side at all. Their battalions are made up mainly of uniates, schismatics, neo-pagans, and sectarians.\nThere is something hallucinatory about this sort of language, not unlike the will-o’-the-wisps that have from time immemorial flared and evanesced in the bottomless marshes of Pripyat, always to reappear and always to discomfit. It was not for nothing that Samuel Huntington, in his seminal 1993 Foreign Affairs essay “The Clash of Civilizations,” slashed a deep civilizational border right across Ukraine’s blood-imbrued heartland. In such a context, symbolic and historical politics inevitably contribute to the atmosphere of a socio-cultural Beargarden, where any stick to hand will serve. Ukrainians will make hay out of Putin’s arch references to the “talented Goebbels” and to the Molotov-Ribbentrop pact as appropriate “payback” for an upstart Poland. The Russian president, in response, will describe his country’s western neighbor as overrun by “nationalists, neo-Nazis, Russophobes, and anti-Semites” who “wanted to seize power and would stop short of nothing.” Ukrainians leaders like Boris Filatov, deputy governor of the Dnipropetrovsk region, will establish their philo-Semitic bona fides by praising the Orthodox Jewish soldier Asher Joseph Cherkassky, a prominent member of the paramilitary Dnipro Battalion, as a “hero and symbol of the resistance.” Russian papers lambast the Verkhovna Rada’s passage of a bill praising the controversial Organization of Ukrainian Nationalists (OUN) and the Ukrainian Insurgent Army (UPA) as “fighters for Ukrainian independence in the 20th century”; their Ukrainian counterparts answer with the argument that Putin’s expansionist policy of Eurasianism, his reliance on the Nashi youth movement, and his government’s terrible treatment of minority groups like the Tatars — “We have asked the Crimean Tatars to vacate part of their land, which is required for social needs,” the Crimean deputy prime minister recently declared — all reek of an authoritarianism unknown and indeed quite impracticable in beleaguered Ukraine. And so the back and forth continues, until the Greek Kalends, without concession and without nuance.\nThings being what they are, Ukrainians are obliged to make a choice between usable pasts, the better to establish that all-important mensonge que personne ne conteste. Ultimately, “the crisis in Ukraine stems from being forced to choose,” as Catherine Wanner has persuasively argued in the pages of American Ethnologist, and the choices that present themselves involve multifaceted geopolitical, religious, ethnolinguistic, and above all historical considerations. There was a time — before the Holodomor, before the world wars and attendant forced population movements, before Soviet authorities forbade the teaching of Ukrainian history as anything other than the istorychnye krayezhnavstvo (“the history of a region”) — that the choice seemed clear, at least to those like the Ukrainian-Jewish writer Hryts’ko Kernerenko. In his 1894 poem “Na stepakh Ukrainy” (“On the Ukrainian Steppes”), part of a collection which miraculously slipped past Russian imperial censors, Kernerenko described a field stretching so far that “sight cannot envelope” it, but “it’s only a dream that something will rise”:\nThis it is, — Ukraine,\nWhere the Truth wanders\nAnd sings to everybody\nA song with rebuke:\n“Good folks, Ukraine\nFades as a flower.\nThe sun burns it, the wind dries it out,\nNobody cares about it.\nThe ploughed field over there is covered by weed.\nAnd through that weed hardly grows\nThe planted seed.\n“It would have grown much better,” Kernerenko maintained, “if somebody cuts off the weed, the seed would start to rise!” As Yohanon Petrovsky-Shtern has commented, Kernerenko was making the case that “it was Russification that prevented the Ukrainian field from growing,” the result being the thwarting of the indigenous drive towards “universal freedom” (spil’nuiu voliu) so eloquently expressed in the works of Taras Shevchenko and others.\nKernerenko’s imagery is altogether apposite. His conception of Ukraine — a wide-open space in which the truth is sown broadcast, but is all too often lost in the weeds or ridden over like a ditch — is a compelling one. Yet once Ukraine makes what Petrovsky-Shtern has termed the “anti-imperial choice,” a whole host of thorny issues necessarily arise. Which of the pernicious weeds are to be uprooted during this political and cultural tillage? Which should be covered, pruned, or even on occasion cultivated? What to make of the contested legacies of, say, the early nationalist leader Symon Petliura, or the OUN and UPA movements? Ukrainians are, as always, “forced to choose.” When Mark von Hagen posed the question in his Slavic Review piece “Does Ukraine Have a History?” back in 1995, he paraphrased a Ukrainian scholar who cleverly responded to his rather provocative inquiry thusly: “if Ukraine has a future, then Ukraine will have a history,” and in doing so that interlocutor was, to von Hagen’s mind, “correctly put[ting] politics, including international politics, at the center of the discussion.” Choices made regarding Ukraine’s present state and future course, in other words, will determine the form its past takes. (The dizzying complexity of this state of affairs suggests, to draw a somewhat unconventional comparison, the non-linear Quechua cosmological conception of hanan pacha, kay pacha, and ukhu pacha, in which the past, present, and future represent concurrent paths which can intersect and influence each other at any given “world-moment.”)\nHryts’ko Kernerenko’s floruit was within living memory of the Springtime of Peoples, and his optimism and enthusiasm was fueled by the cosmopolitanism and nationalism of the fin-de-siècle central and eastern European independence movements. He did not, and likely could not, have foreseen what was actually in store for his hecatomb of a homeland in the trying decades to come. When the smoke had cleared somewhat, it was the poet Leonid Pervomais’kyi — languishing under Soviet as opposed to czarist misrule — who was in a position to assess the damage. In his dolorous poem “Mynuloho ne pereboresh” (“The Past You Will Not Overcome”), Pervomais’kyi declared that\nThe past cannot be overcome.\nRecently or long gone —\nNot behind you and not alongside you,\nBut always inside you it lives. All your days — far, and near —\nYou remember the false step,\nAs though it was only last week\nThat ancient lesson occurred. If only, if only you could today\nWith one sweep of the hand,\nAs though from a school blackboard, clean\nYour failures and mistakes — All sufferings and old pains\nStill crowd into your dreams,\nAnd with your will or without it\nHang onto your hunched back. You honestly strive with sensitive heart\nFor that initial purity,\nBut have to travel into the future\nCarrying all your past.\nFor contemporary Russia, the solution to this quandary is to take up the burden of history with a newfound sense of pride, though only after grotesquely contorting it. “Others cannot be allowed to impose a feeling of guilt on us,” Putin has said of his nation’s Stalinist past, and his people have by and large followed suit, re-erecting statues of Stalin, and even considering returning Yevgeny Vuchetich’s disgusting monument to Felix Dzerzhinsky, founder of the Cheka secret police, to Lubyanka Square (“Iron Felix” having ceded pride of place to a memorial to victims of the Gulag back in 1991). Meanwhile, at the Stalin-era Perm-36 work camp deep in the Ural Mountains, the local museum has, according to its former director Viktor Shmyrov, “been taken over by other people appointed by the new authorities, who have totally changed the content. Now it’s a museum about the camp system, but not about political prisoners. They don’t talk about the repressions or about Stalin.” Russian human rights groups like Memorial can bemoan such initiatives as “blasphemous” on the grounds that Stalin’s enormities have “no analogues in the country’s history,” but it is not difficult to read the nation’s mood in this regard.\nComparable efforts at historical rehabilitation have proven even more controversial in Ukraine. When outgoing President Viktor Yushchenko conferred “Hero of Ukraine” status on the controversial OUN militant Stepan Bandera on January 22, 2010, he was met with howls of outrage from the president of Poland, the chief rabbi of Ukraine, and no small number of his fellow citizens. His successor, the recently ousted Viktor Yanukovych, annulled the award, only for the pro-western Our Ukraine party to lament Yanukovych’s “attempts to rewrite the history of Ukraine and to belittle — in order to please Moscow — the heroes of the Ukrainian people.” The recent Verkhovna Rada draft bill honoring the OUN and UPA figures to opens similar wounds all over again. Yet the (largely symbolic) 2010 finding by Kyiv’s Court of Appeal that the Stalinist regime was guilty of “genocide against the Ukrainian national group in 1932-33 through the artificial creation of living conditions intended for its partial physical destruction,” the more recent bill “On the condemnation of communist and the National Socialist (Nazi) regime totalitarian propaganda and ban of their symbols,” as well as the ongoing campaign against vestiges of the Soviet past, demonstrate that the nationalist fight for, and the fight against, various aspects of Ukrainian history continues apace.\nUnder Russian domination, Ukrainian history was largely relegated to the mere “history of a region,” and scholars could even ask whether Ukraine possessed a history at all. Attempts to undo this unfair treatment have required the young country to deal with parts of its past which are destined to hang onto its hunched back in perpetuity, from Petliura and Bandera to the OUN and UPA. Different regions have had different reactions to the historical reagents of Ukrainian history. One finds countless streets, monuments, museums, and honorary citizenships dedicated to Stepan Bandera in western Ukrainian oblasts like Lviv and Ivano-Frankivsk. Elsewhere, such a figure is ignored or reviled. The diplomat and Cambridge historian Edward Hallett Carr famously maintained that “it does not follow that because a mountain appears to take on different shapes from different angles of vision, it has objectively no shape at all or an infinity of shapes,” yet the mixed reactions to the past on the part of Ukraine and her neighbors has created precisely such an infinity of shapes, constantly in flux and subject to revision and re-definition. Such is the usufruct of the twentieth century’s nocuous inheritance.\nYet considerations of the idea of Ukraine should involve more than imbibing the twentieth century’s unpalatable “black milk of daybreak,” to borrow the language of the Chernivtsi-born Paul Celan’s “Todesfuge.” Consider the curious tale of the cossack’s barrel of gold. It was on the eve of Ukrainian independence that a Ukrainian legislator announced that the Bank of England would have to pay Ukraine around sixteen trillion pounds sterling, based on accumulated interest on a barrel of gold allegedly deposited by the eighteenth-century Cossack het’man Pavlo Polubotok. The Cossack leader, so the story goes, was about to be arrested by the agents of Czar Peter I when he managed to have his savings spirited away, first to the port of Arkhangelsk and then onto a ship bound for England. The depositor, it is further said, specified that the account was to remain untouched until Ukraine was finally free. Ukraine’s ambassador to the United Nations, Hannadii Udovenko, insisted that the story of Polubotok’s gold was “not a legend,” and the Ukrainian Foreign Ministry and the Bank of England embarked on an earnest, though in the end fruitless, search for a deposit slip.\nIt would be easy to dismiss the brief Ukrainian “gold fever” inspired by Polubotok’s mythical barrel as little more than metaphorical iron pyrite, a worthless alloy of dubious historical and symbolic significance. This would be a mistake. As a journalist writing for Molod’ Ukrainy wrote in the midst of the fever, “time will pass and we will understand that Polubotok, who dared to come out against the insane Asiatic satrap, the first Russian emperor Peter I, and became his victim, left us more than gold: a sincere striving for an independent Ukraine, a will to see our fatherland not bounded by shackling agreements with neighboring rulers.” Serhy Yekelchyk, looking back on all the excitement eight years on, found that “not the Bank of England but the colonial past turned out to be the evil force that was robbing Ukraine both literally and symbolically.” On a more positive note, readers of Holos Ukrainy were informed that all the “treasure-hunting” surrounding the Polubotok affair has actually unearthed the “priceless treasure that is our history,” particularly given the attendant proliferation of museum exhibitions and historical novels centered on anti-Russian Cossack leaders like Polubotok, Ivan Mazepa, and other freshly-minted “national heroes.”\nPerhaps Serhy Yekelchyk was right to see in the story of Polubotok’s treasure that typically Ukrainian progression “from exciting to disappointing to carnivalesque,” but when one considers the affair in light of the subsequent battles — real and symbolic — waged across the Ukrainian steppe, one feels almost hopeful. The Ukrainian people are, as Pervomais’kyi lamented, saddled with a past that cannot simply be wiped out in favor of a tabula rasa. No nation possesses, or could ever possess, such an unrealistic attribute. But that same nation inhabits a storied land where, as Kernerenko put it, the “Truth wanders” and hidden treasures can still be found amidst the thorny brake and thicket of the past, and even Clio’s mournful “song of rebuke” provides important lessons for the future governance of the body politic, if only its lyrics will be heeded.","url":"https://spectator.org/62800_where-truth-wanders/"}
