{"authors":["Jennifer Brett"],"date_download":"2018-10-30 21:40:44","date_modify":"2018-10-30 21:40:44","date_publish":"2017-02-21 11:11:46","description":"Oscar Sunday is quickly approaching and \"Hidden Figures\" is Atlanta's key Academy Awards connec...","filename":"data/vaneerConsumption/WhereHiddenFiguresfilmedinAtlantaandelsewhereinGeorgia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/21/Images/WPIMAGE_cmgajcbuzz_15817.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_where-hidden-figu_78bbfb872b50aedfe372f5f487328850__1540935644.html","title":"Where \"Hidden Figures\" filmed in Atlanta and elsewhere in Georgia","title_page":"Where \"Hidden Figures\" filmed in Atlanta and elsewhere in Georgia","title_rss":"NULL","source_domain":"ajc.com","text":"Oscar Sunday is quickly approaching and \"Hidden Figures\" is Atlanta's key Academy Awards connection.\nThe movie, about African American women who faced institutional racial and gender barriers as they performed vital roles in launching NASA's early missions, was mostly set in Hampton, Va. but mostly filmed in Atlanta and elsewhere in Georgia.\n\"Tax incentive aside, I can't imagine shooting this anywhere but Georgia,\" director Theodore Melfi said in a video created by the state's department of film, music and digital entertainment. \"It was the most remarkable place to work.\"\nThe movie is up for best picture and adapted screenplay and Octavia Spencer is up for a supporting-actress Oscar for her role as Dorothy Vaughan. Spencer previously won an Oscar for her role in \"The Help,\" which was based on the book by Atlanta author Kathryn Stockett, and has since appeared in the short-lived Atlanta-filmed series \"Red Band Society.\" Coming up, she stars with Chris Evans in coastal-Georgia filmed \"Gifted,\" due out in April.\nLocations you'll see in \"Hidden Figures\" include downtown Canton, the Morehouse campus, where the domed Frederick Douglass Learning Resource Center had the perfect look for a NASA lab; downtown Monroe and the Walton County Courthouse there; a wind tunnel at the Lockheed Martin facility in Marietta; a hangar at the General Lucius D. Clay National Guard Center in Marietta; Collins Memorial United Methodist Church on Bolton Road in Atlanta (ideal for scenes depicting a church service then dinner on the grounds); a rural country road in Madison, where the three main characters encounter a clueless cop on their way in to work one day; and along Linwood Avenue near downtown East Point.\n“Seeing film productions in town has become commonplace here in East Point. In fact, we have another film group in town right now and several others scouting,” said Erin Rodgers, that city’s economic development specialist. “We are committed to maintaining the city’s reputation as a film-friendly environment, and I think the number of repeat film clients is a testament to that. It’s exciting to know that your city was a part of a film project that is so big, so exciting and tells a story that is so incredibly important as the story told in the film ‘Hidden Figures.’”\nThe project also filmed at the OFS facility in Norcross and the former Fort McPherson site, now owned by entertainment mogul Tyler Perry, in south Atlanta.\nOther Atlanta projects to cheer for this Sunday: the sci-fi romance “Passengers” with Jennifer Lawrence and Chris Pratt, which is up for best original score and production design. “Sully,” starring Tom Hanks and directed by Clint Eastwood, is up for sound editing. The awards show, hosted by Jimmy Kimmel this year, airs at 7 p.m. Sunday on ABC.\n\"Hidden Figures\" is based on the book by Margot Lee Shetterly, whose sister Lauren Colley works at the Atlanta Journal-Constitution.\n“Our family grew up in Hampton,” Shetterly “We knew a lot of the people in the community who worked at NASA. It was sort of no big deal. In Hampton, there is NASA, there are the shipyards, the military. It was just kind of a normal thing that a lot of those people were African-American, and a lot were women, and some were both.”\nShetterly studied finance at the University of Virginia and worked on Wall Street for a while before transitioning to various internet media projects. She and her husband were living in Mexico, where they ran an English language magazine, when the idea for the book blossomed during a trip back home several years ago. Talk turned to the “computers,” as the women were known back then, whose meticulous calculations were vital in sending astronaut John Glenn, who died in early December at age 95, into orbit.\n“How did I not know about this?” Shetterly recalled wondering. “My mom was like, ‘Hey, let’s call up Katherine Johnson and go over to her house.’ That’s where I heard the name Dorothy Vaughan. (Johnson) said she was the smartest person she ever met. I was like, I need to check out this Dorothy Vaughan, whose name I’d never heard.”\nThe book and movie projects took off at a joint gallop and the rest is history, hidden no longer.","url":"https://www.ajc.com/blog/buzz/where-hidden-figures-filmed-atlanta-and-elsewhere-georgia/YEshdnEvNtfgLREeaLMzMM/"}
