{"authors":["Rebecca Fearn"],"date_download":"2018-10-31 01:45:30","date_modify":"2018-10-31 01:45:30","date_publish":"2018-09-14 13:28:33","description":"If you're a Little Mix fan, it's fair to say you may have squealed with joy a little when you heard the news (which was announced in July) that the band are officially releasing a makeup collection. Yep, you'll now be able to emulate your favourite…","filename":"data/vaneerConsumption/WhereToBuyLittleMixsMakeupCollectionEverythingElseYouNeedToKnow.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/c23e5aca-7db4-4fbd-93f2-0b09483a40ee-getty-652310322.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_where-to-buy-little-mixs-makeup-collection-everything-else-you-need-to-know-11886993_1540950330.html","title":"Where To Buy Little Mix's Makeup Collection & Everything Else You Need To Know","title_page":"Where To Buy Little Mix's Makeup Collection & Everything Else You Need To Know","title_rss":"NULL","source_domain":"bustle.com","text":"If you're a Little Mix fan, it's fair to say you may have squealed with joy a little when you heard the news (which was announced in July) that the band are officially releasing a makeup collection. Yep, you'll now be able to emulate your favourite look from the ladies. Here's everything you need to know about where to buy Little Mix's Makeup Collection and what you'll find when you dp.\nFirst off, the basics: the collection is available to buy from the Boots website, meaning you can run from this article to the website straight off the bat (we're good to you like that). The range will also launch into Boots stores from Monday 17 September.\nOnto the name: the foursome have decided to keep it cool and simple and name their line LMX. Love it. They first debuted the announcement of the launch on their Instagram page with a video which showed them playing with makeup. In the post, they wrote that it would be launching into Boots. A representative for the band revealed the following details back in July about what to expect from the line:\n\"Years of experimenting with different looks means the girls really know their cosmetics and their collection makes no compromises, with high-performance, heavily-pigmented formulations that suit every skin tone, unbelievable highlighters, velvety matte lips and high-impact colours.\"\nThe range already has an Instagram account of its own that's racked up 34,000 followers, and has shared images of the girls wearing the products. The range looks to be vibrant and youthful, with some seriously bangin' palettes in there, and everything included is vegan and cruelty free.\nThere's the contour palette, which features 8 shades:\nThe eyeshadow palette, which has 16 shades in matte and shimmer formulas:\nAnd brushes aplenty:\nThere are also plenty of little sets, including a \"Shout Out To My Pout\" lipstick and liner collection, and \"Glitter Ballin,\" which contains a bunch of face and body glitters.\nEverything is affordable, with the range starting at £6. The most expensive set in the collection is only £40, too. There's plenty of ideas for Christmas presents for the Little Mix fan in your life, but be warned: it's all limited edition so I wouldn't wait around too long if I were you.\nThe reactions so far to the range have been wholly positive, and fans are stanning the collection in is entirety from the off.\nHowever, many international fans have shared their frustration that the range does not seem to be available overseas or offer international shipping:\nLet's stay optimistic; if the limited edition range flies off the shelves, surely the girls will be designing new collections? Perhaps there'll even extend the range and start offering new products. Anything's possible, including a possible roll out to international audiences, surely. Here's hoping, and if you're unlucky enough to be out of reach, next time you have a friend or family member venturing to the UK, get them to pick up your supplies. You're welcome.","url":"https://www.bustle.com/p/where-to-buy-little-mixs-makeup-collection-everything-else-you-need-to-know-11886993"}
