{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 20:03:21","date_modify":"2018-10-30 20:03:21","date_publish":"2016-09-29 16:00:00","description":"Fall has finally arrived and\ncollege football is in full swing around the South...","filename":"data/vaneerConsumption/WheretodrinkcocktailsandwatchcollegefootballinAtlantaonSatu.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/09/27/Images/WPIMAGE_cmgajcfoodandmore_11022.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_wh_36d362e41354ddc1389737b71200bab8__1540929801.html","title":"Where to drink cocktails and watch college football in Atlanta on Satu","title_page":"Where to drink cocktails and watch college football in Atlanta on Satu","title_rss":"NULL","source_domain":"ajc.com","text":"Fall has finally arrived and college football is in full swing around the South . Saturdays this time of year include tailgating with beers and barbecue, school colors, singing fight songs off-key in bars and a little civil discourse between friends while watching the old pigskin get tossed around on ESPN. Sure, you could go to a crowded sports bar and fight for a seat only to drink watered down beer and eat rubbery mozzarella sticks or you can cheer your team to victory while sipping crafty cocktails and noshing on everything from oysters to goat tacos at one of these five under-the-radar, sportball-viewing bars.\nBone Garden Cantina\nA Westside favorite for eight years, Bone Garden serves up fresh-Mex favorites like goat tacos, chilaquiles and duck enchiladas, some of the best queso in the city and house-made margaritas served by the glass or the pitcher full. From families to solo bar flies to friends with squad goals, Saturdays during the fall also include football, cheese dip and tequila. While we’re big fans of the freshly-made margaritas, we also love their smoky mezcal cocktails like the Chilo y Chile with Vida mezcal, cucumber, spicy serrano pepper, citrus and agave or the Oaxacan Sunset with Vida, grapefruit shrub, lime and a bit of heat from chile. Football on the telly is first-come-first-channel-requested, so claim your seat early.\n1425 Ellsworth Industrial Blvd. NW, Atlanta. 404-418-9072, bonegardencantina.com.\nHampton and Hudson\nHampton and Hudson, located in the courtyard of Inman Quarter , offers guests a chance to (hopefully) watch their team\nGather your football crew and share a bowl of seasonal punch at Ladybird Grove & Mess Hall.\ndominate on multiple indoor and outdoor televisions. Keep fueled with football-appropriate bites like buffalo-style chicken wings or spicy shrimp nachos while hydrating with a healthy selection of local beers, wine on draft and of course, cocktails. We suggest sipping on the Scavenger Type to keep your nerves on an even keel. This draft drink is the perfect combination of fall flavors--warm, slightly sweet with bourbon, toasted apple syrup, poire (or pear cider,) a hint of smoke from 18.21 Havana and Hide Bitters and a sliver of apple for garnish.\n299 N. Highland Ave., Atlanta. 404-948-2123, hamptonandhudson.com.\nLadybird Grove & Mess Hall\nGrab a table in front of the bar televisions, order the spatchcock chicken or backyard barbecue pork for the table and a heaping bowl of punch to share. We’ve made Ladybird on the Beltline our Saturday afternoon basecamp during college football season for bites, beers and punch for eight (or 16) of our closest friends. The seasonal bowl of booze usually includes whiskey and bubbles and is a great sipping option when you’ve gathered a crew to watch one of the many fall rivalry games. If things aren’t going well for your team, head out to the Grove to regroup in an Adirondack chair. Punch is served there, too, along with camper cocktails at the outdoor bar.\n684 John Wesley Dobbs Ave. NE, Atlanta. 404-458-6838, ladybirdatlanta.com.\nOne Eared Stag\nListen up, Ole Miss fans, chef Robert Phalen is here for you on Saturdays serving up his Rebel special of $1 oysters and beer at the bar during games. That’s right, $1 oysters and ponies of Miller High Life are on the regular Saturday rotation during the Fall at One Eared Stag . If sipping on the Champagne of Beers isn’t your thing, pick your poison from the selection of brown water on the back bar to pair with the crazy delicious Meat Stick burger while you proudly proclaim your loyalty to Ole Miss with, “Hotty toddy, gosh almighty...” Y’all know the rest.\n1029 Edgewood Ave. NE, Atlanta. 404-525-4479, oneearedstag.com.\nOne Eared Stag is the place to be on Saturdays for Ole Miss football, $1 oysters and Miller High Life ponies.\nRation and Dram\nIf watching your favorite team means being far from the maddening crowds, dining on pan-seared trout and sipping on a Manhattan or Hanky Panky, we suggest sidling up to the bar at Ration and Dram on Saturdays. The cocktail menu includes both classics and modern riffs and a back bar full of whiskey, Scotch and gin to sip neat or on the rocks. Cocktails, comfort food and college football are a relaxed affair at Ration and Dram whether you’re dining solo or with an intimate group of like-minded friends.\n130 Arizona Ave. NE, Atlanta. 678-974-8380, rationanddram.com.\nRead more of our coverage of the Atlanta bar scene\nWhy aren't you drinking aperitif cocktails?\nOrange wine? Here’s why and where to give it a try\nVIDEO: The art of crafting ice at Japanese cocktail lounge Himitsu\nMake a rum run for these 5 cocktails at Atlanta bars\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook , following @ATLDiningNews on Twitter.","url":"https://www.ajc.com/blog/atlanta-restaurants/where-drink-cocktails-and-watch-college-football-atlanta-saturdays/ilJp0dS8LBW5wMe2EtJgYM/"}
