{"authors":["Matt Levin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:54:29","date_modify":"2018-10-30 23:54:29","date_publish":"2016-06-17 08:00:00","description":"The number of Californians who have health insurance has grown by more than 2 million since the federal government began requiring two years","filename":"data/vaneerConsumption/WhereareCaliforniasuninsured.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/flickrPhoto-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540943669.html","title":"Where are California's uninsured?","title_page":"Where are California's uninsured? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The number of Californians who have health insurance has grown by more than 2 million since the federal government began requiring two years ago that everyone have coverage. About 90 percent of Californians are insured, data show — up from 85 percent before major features of the federal law kicked in.\nBut more than 3 million people in the state remain uninsured, and policymakers are searching for ways to reach them. Experts say knowing where the uninsured live and work in California is key to reducing their numbers. City and county outreach efforts can be critical to raising awareness among those who are eligible for federal health insurance programs but not enrolled. The most recent statistics available are from 2014.\nWhere are the uninsured in California? Here is a map of California cities and their estimated percentage of uninsured residents.\nThe larger the bubble, the higher the proportion of uninsured. Zoom in to see how neighboring cities compare–the results could surprise you. You can also type the name of a city into the search box in the upper right portion of the map.\nThe Geography of the Uninsured\nThese estimates are based on 2014 Census survey data, the most recent available. Rates may be lower now, as several key features of the Affordable Care Act began in 2014. Rates for each city have different margins of error. All cites over 100,000 in population.","url":"https://calmatters.org/articles/where-are-californias-uninsured/"}
