{"authors":["Marlen Komar"],"date_download":"2018-10-31 01:46:21","date_modify":"2018-10-31 01:46:21","date_publish":"2018-09-11 16:44:48","description":"The fashion world is becoming more diverse, but at a stubbornly slow pace. While there are more people of color and curvier bodies on runways now, they are still in the minority and not often represented. That's why when Chromat created \"sample…","filename":"data/vaneerConsumption/WhereCanYouBuyChromatsSampleSizeShirtTheViralTeeMakesABodyPositiveStatement.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/a5afafe0-f996-4924-835c-376456ac6bf6-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_where-can-you-buy-chromats-sample-size-shirt-the-viral-tee-makes-a-body-positive-statement-11868926_1540950381.html","title":"Where Can You Buy Chromat's 'Sample Size' Shirt? The Viral Tee Makes A Body Positive Statement","title_page":"Where Can You Buy Chromat's 'Sample Size' Shirt? The Viral Tee Makes A Body Positive Statement","title_rss":"NULL","source_domain":"bustle.com","text":"The fashion world is becoming more diverse, but at a stubbornly slow pace. While there are more people of color and curvier bodies on runways now, they are still in the minority and not often represented. That's why when Chromat created \"sample size\" shirts and sent them down the runway, it made a big political statement about body diversity and body positivity. (Chromat offers sizes XS-3XL.)\nThe Spring/Summer 2019 Saturation Runway Show was inspired by wet t-shirts, and how they are worn at the pool or beach. \"We wanted to reclaim the experience of hiding under a giant T-shirt at a pool party (when you’re too embarrassed to be seen in your swim) and make it a garment to wear proudly,\" Chromat shared in a release.\n“I wanted to reimagine the whole idea of throwing a ginormous shirt over your swimsuit at the pool because you’re too embarrassed to be seen,” Becca McCharen-Tran, the designer, told Vogue backstage. “To take that moment of vulnerability and make it something to be proud of.”\nThis new focus on body positivity comes with an exciting new development for the label. This summer the brand extended their size options to a 3X, and with the extension they launched the #ChromatPoolRules campaign, which shared a list of rules like \"Intolerance Not Tolerated,\" \"Food-Shaming Not Permitted,\" and \"Scars + Stretch Marks Welcome.\"\nNow that the label is designing empowering clothes for all body types, they wanted to make a statement on their runway show. Models walked down in t-shirts that read \"sample size\" in big block letters, underlining that every size is a sample size.\n\"'Sample sizing' tends to be an excuse that other designers cite as a reason why they don't feature a range of sizes in their runway shows. At Chromat, we know that the designer has the power to choose what size they prototype their collection in,\" the label shared in a release. \"Our goal is to encourage more designers to sample their collections in a range of sizes, in order to celebrate all different size bodies on the runway.\"\nBy putting these t-shirts on models who are all sorts of different sizes and shapes, Chromat made a clear political statement.\nThe shirt itself is a unisex heavyweight cotton t-shirt, and it has the word \"Sample Size\" screen printed on the front and a Chromat logo on the back. Even though it debuted on the runway, you can already buy the t-shirt on Chromat's website for $60. The sizes run from XS to 3XL, and if you want the tee you will see that the landing page cheekily writes, \"Every size is Sample Size. Click 'add to cart' if you agree.\"\nChromat's runway show was all about athleisure and swimsuits, with models of all kinds of races, sizes, and body abilities taking over the catwalk. For example, walking on the runway was cancer survivor and amputee Mama Cax and trans activist Leyna Bloom.\nThe label is serious about changing the fashion industry, and they are taking the lead in becoming more inclusive by always casting diverse models and now creating bigger sizes so more fans can wear their clothes.","url":"https://www.bustle.com/p/where-can-you-buy-chromats-sample-size-shirt-the-viral-tee-makes-a-body-positive-statement-11868926"}
