{"authors":[],"date_download":"2018-10-30 01:26:05","date_modify":"2018-10-30 01:26:05","date_publish":"2018-09-11 00:05:40","description":"The annual approach of 9/11/01 brought memories, news recaps, and best of all, in some ways, speculation. As in, what’s the matter with Americans today? Where’s now the national unity that marked the aftermath of the attacks; the U.S. flags that decorated pickups and sedans; the spirit of we’re-all-in-this-together?","filename":"data/vaneerConsumption/WhereDidAlltheUnityGo.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/Remains_of_the_World_Trade_Center_29351715261-2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862765.html","title":"Where Did All the Unity Go?","title_page":"Where Did All the Unity Go?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The annual approach of 9/11/01 brought memories, news recaps, and best of all, in some ways, speculation. As in, what’s the matter with Americans today? Where’s now the national unity that marked the aftermath of the attacks; the U.S. flags that decorated pickups and sedans; the spirit of we’re-all-in-this-together?\nUmm, yes. Where, in fact, had that unity gone by the time the victory over Iraq had sucked Americans into a guerrilla war and America’s commander-in-chief in that war was being castigated right and left?\nI have a suggestion. It is that in 2001, under attack by — I do not think it is too much to say — the powers of darkness, Americans found and asserted their American identity. It took some effort. Vietnam, Watergate, and the Clinton years had produced deep national divisions. The 2000 presidential election had dug them deeper still.\nNevertheless, enough national spirit remained to further and facilitate the coming together of the American tribe, the American family in the interest of punishing suitably the murderous foes of that family. We all suddenly embraced one another. We were in this thing together. God bless the U.S.A.\nThere is no purpose in retracing how it all fell apart in wrangles and bitterness over the Iraq invasion, etc.: culminating in the Trump election. Oh, how it culminated, and continues to. Witness the Kavanaugh hearings, which produced varying views as to what should be done with the nominee: confirm him or shoot him into outer space with a toothbrush and a ham sandwich.\nThe difference between 2001 and 2018 is the difference between I-am-an-American and I-am… fill in the blank. The vast community we all inhabited has become a series of subdivisions. Group identity is the thing it’s all about: Me, less as American, than as progressive, populist, African-American, Ivy League, Christian, transgender, Hispanic, vegan, Jewish, “none,” Anglo, gun owner, yogan, Asian-American, Native-American, #MeToo — I’m out of breath.\nIdentity politics, we have come to understand, is the new brand of politics: the demands of a particular constituency (self-styled) asserted over the needs and rights of other constituencies.\nIt would be silly to say that in some ethereal past we were all of one mind and one heart. It was never so. From the start we had Protestants and Catholics, planters and industrialists, farmers and cowmen, factory workers and bosses. We generally worked through these entirely human and timeless distinctions, cutting slack for those in need of it. It took time sometimes, as with the incorporation of ex-slaves and their dependents into the American mainstream. But it was done. And keeps on getting done.\nThe indisposition to cut slack for anyone besides ourselves is the main and most frightening feature of today’s politics. It isn’t just that we don’t want to help the other side. We don’t want to know there’s another side: a thing to respect, even grudgingly; something to accommodate as an element of the American design. We’re currently raising a crop of collegians whose regard for free speech and, likely, other valued freedoms can only be regarded as provisional. And perilous, inasmuch as the accommodation of interests and identities, rather than the triumph of one or two over 500 different ones, is the difference between the United States of America and the Russian empire of Czar Vladimir I.\nMy way or the highway is, increasingly, the rule of political thumb in modern society. Secularists, to the extent they can, air-brush Christianity from the American canvas. Progressives — Good Lord, what a name for reactionaries! — want, for no intelligent reason, to eliminate Confederate monuments. The president wages dogmatic war on the ideal of free trade, meaning the free selection and exchange of goods in world commerce.\nYou see the linkage here. The American ideal of freedom to pursue legitimate interests turns off people who view themselves and their group as uniquely deserving, or put-upon, or smarter and more forward-looking than you. Anyway, not the sort to drape their cars in red, white, and blue the next time terrorists strike: which we must pray for many reasons is no time soon.\nWilliam Murchison is writing a book about moral restoration in the 21stcentury.\nCOPYRIGHT 2018 CREATORS.COM","url":"https://spectator.org/where-did-all-the-unity-go/"}
