{"authors":["Arielle Dachille"],"date_download":"2018-10-30 23:04:47","date_modify":"2018-10-30 23:04:47","date_publish":"2014-08-14 11:45:04","description":"Do you remember the mid-'90s afternoon TV block on Nickelodeon? Ah, I can recall it just like it was yesterday. Episodes of Clarissa Explains it All would bleed into back-to-back slots of Salute Your Shorts, which would culminate in The Adventures…","filename":"data/vaneerConsumption/WherearePetePeteFromTheAdventuresofPetePeteTheirTVBrotherhoodIsForever.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/3d01af50-da00-4fa0-9df1-2fa2bf524c0f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35577-where-are-pete-pete-from-the-adventures-of-pete-pete-their-tv-brotherhood-is_1540940687.html","title":"Where are Pete & Pete From 'The Adventures of Pete & Pete'? Their TV Brotherhood Is Forever","title_page":"Where are Pete & Pete From 'The Adventures of Pete & Pete'? Their TV Brotherhood Is Forever","title_rss":"NULL","source_domain":"bustle.com","text":"Do you remember the mid-'90s afternoon TV block on Nickelodeon? Ah, I can recall it just like it was yesterday. Episodes of Clarissa Explains it All would bleed into back-to-back slots of Salute Your Shorts, which would culminate in The Adventures of Pete & Pete. Those hours of classic '90s pre-teen TV gave me a great list of reasons not to play outside. After all, the shenanigans of the Petes were always far more interesting than the pitiful excuses for misadventures that me and the neighborhood kids would get ourselves in to. Ah, if only this '90s goodness was still on the air. Come to think of it... Where are Pete & Pete from The Adventures of Pete & Pete these days?\nDoes little Pete still have a penchant for flannel hats? Does big Pete still play the serious older brother?\nThere was just something about that show. The red-headed duo loved philosophizing and gave us hours of meditative, yet still engaging TV. Pete & Pete was, in many ways, like FX's Louie for kids; a comedy at heart, but prone to periods of existentialist ruminations. While other Nickelodeon stars like Melissa Joan Hart and Amanda Bynes went on to have long careers in showbiz, we haven't heard too much from Danny Tamberelli, little Pete, or Michael Maronna, big Pete, since their Nick days. They must still be acting, right? Are they even still friends?\nWell, it appears that one of them is still acting-ish, and that's Danny Tamberelli. He also is in a \"punk influenced anthemic rock\" band called Jounce. I mean, he spent years as a panelist getting compulsively slimed on Figure it Out, and that clearly gives you an appetite for showbiz.\nYouTube\nSo wouldn't ya know... he's in comedy. That is to say, he has a sketch group called \"Man Boobs Comedy\" that releases videos regularly on YouTube. Here is a sketch in which Danny lampoons his career of being showered with green goop.\nManBoobs Comedy on YouTube\nIncidentally, Michael appears in one of Danny's sketches...\nManBoobs Comedy on YouTube\nSo how about big Pete? He's still in a semi-creative field, no? According to his IMDb page, Michael Maronna has been working behind the scenes rather than in front of the camera. He's worked as the electrician for plenty of notable titles such as The Normal Heart, Elementary, Nurse Jackie, Ugly Betty and Sex and The City. I don't know about you, but that blows my mind to know that big Pete was likely standing just off camera while Kim Cattrall delivered likes like the following...\nBut how about what he does for fun? Welp, if you think you were heavy into the World Cup, you should talk to Maronna. We can see that on his Twitter, he celebrated each game by wearing the jersey of one of the teams. Here he is on one of Mexico's game day wearing a custom Mexico jersey with the Virgin Mary sewn onto the back. As you can see, he's quite the designer...\nHere's his jersey selfie for one of the Sweden games. Although he's purportedly staying neutral on this match, he chose to support the Swedes with his duds.\nReally though, do these guys still hang out? Why, yes! Yes they do, and they re-kindled their friendship to enter into an artistic endeavor together. The two former co-stars have re-kindled their friendship to produce a weekly Podcast called \"The Adventures of Danny & Mike.\" According to a Reddit AMA they did together back in Dec. of 2013, they fell out of touch for a bit, but have re-connected over the past year or so. This probably has a good deal to do with the fact that the Pete & Pete cast did a 20 year reunion show for a few months last year. Here they are at SF Sketchfest.\nSF Sketchfest on YouTube\nAlso, the podcast probably helped to keep them close. They reportedly fell out of touch in college, although Michael would send Danny \"the earliest birthday wishes for years.\"\nNickelodeon shows may come and go, but fictionalized TV brotherhood is forever!\nImage: Nick; Giphy (3)","url":"https://www.bustle.com/articles/35577-where-are-pete-pete-from-the-adventures-of-pete-pete-their-tv-brotherhood-is"}
