{"authors":["Bill Chappell"],"date_download":"2018-10-23 05:17:24","date_modify":"2018-10-23 05:17:24","date_publish":"2014-05-21 00:00:00","description":"The newly released \"positive experience index\" of 138 countries finds that people in Paraguay had the rosiest outlook (again). The U.S. made the top 20 in the annual Gallup index.","filename":"data/vaneerConsumption/WhereAreTheWorldsPositiveVibes.json","image_url":"https://media.npr.org/assets/img/2014/05/21/paraguay_wide-bbf3ef0ea5449be1597ce96fa217261d48ac1769.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_05_21_314468048_where-are-the-world-s-positive-vibes_1540271844.html","title":"Where Are The World's Positive Vibes?","title_page":"Where Are The World's Positive Vibes? : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Where Are The World's Positive Vibes?\nEnlarge this image toggle caption Nelson Antoine/AP Nelson Antoine/AP\nThe world, as you've no doubt noticed, has its problems. But some folks seem to be dealing with them pretty well, according to poll results released Wednesday. Countries in Latin America dominated the top of Gallup's \"positive experience index,\" while Syria set an all-time low.\n\"At least seven in 10 adults worldwide report experiencing lots of enjoyment, laughing or smiling a lot, feeling well-rested, and being treated with respect,\" Gallup reports, \"while a slight majority (51 percent) report that they learned or did something interesting the day before.\"\nParaguay sat atop the list for the third year in a row, with 87 percent of people who participated in the poll saying they felt positive emotions about their lives. Denmark was the highest-rated nation outside of Latin America, in eighth place.\nThe U.S. was in 19th place, tied with several other countries such as Argentina and the Netherlands.\nBy contrast, Syria's results reflect the toll of a brutally destructive civil war. The country was more than 15 points lower than any other nation in the poll.\n\"Fewer than one in three Syrians report feeling well-rested (31 percent), feeling enjoyment (31 percent), or learning or doing something interesting (25 percent) the day before,\" Gallup says.\nGlobally, the poll found slightly more people had good things to say about their lives in 2013 than in the previous seven years.\nThe poll was conducted by questioning 1,000 adults in each of 138 countries. Here are the full results:","url":"https://www.npr.org/sections/thetwo-way/2014/05/21/314468048/where-are-the-world-s-positive-vibes"}
