{"authors":["Taylor Maple"],"date_download":"2018-10-31 01:46:43","date_modify":"2018-10-31 01:46:43","date_publish":"2018-09-14 11:00:53","description":"In American Vandal's second season, the same two filmmakers who uncovered the true identity of who vandalized a high school faculty's parking lot with spray-painted, vulgar drawings, team up again for a new mystery. And this one, believe it or not,…","filename":"data/vaneerConsumption/WhereWasAmericanVandalSeason2FilmedTheShowrunnersWantedItToFeelLikeARealCatholicHighSchool.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/12/0846a89e-44ee-4fae-8103-2426d0a06d00-51e44cb6-5628-479f-bf61-6280c69109b9.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_where-was-american-vandal-season-2-filmed-the-showrunners-wanted-it-to-feel-like-a-real-catholic-high-school-11887259_1540950403.html","title":"Where Was ‘American Vandal’ Season 2 Filmed? The Showrunners Wanted It To Feel Like A Real Catholic High School","title_page":"Where Was ‘American Vandal’ Season 2 Filmed? The Showrunners Wanted It To Feel Like A Real Catholic High School","title_rss":"NULL","source_domain":"bustle.com","text":"In American Vandal's second season, the same two filmmakers who uncovered the true identity of who vandalized a high school faculty's parking lot with spray-painted, vulgar drawings, team up again for a new mystery. And this one, believe it or not, is a little — OK, a lot —grosser. At another high school, someone contaminates the school lunches with a substance that makes everyone uncontrollably poop, and Peter and Sam are on the case. Yeah, the tone established Season 1 is still strong. But it's a while lot different. And a different setting. So where was Season 2 of American Vandal filmed?\nIn Vulture's review of the latest season, it's confirmed that the school where everything goes down this year is called St. Bernardine, and that it's \"a private Catholic school in Bellevue, Washington.\" A quick Google search yields no results for a school by that name in that city, but according to the Oregonian, a hefty portion of Season 2 was filmed on-location in the Portland, Oregon area.\nCasting directors for the show put out casting calls in early January looking for extras in the community between the ages of 14 and 22 to fulfill \"multiple speaking roles,\" another Oregonian report stated. And, the IMDB page for the show lists Mt. Hood Community College in Portland as a filming location.\nNetflix on YouTube\nThe decision to place the show's events within a private, Catholic school was not happenstance — it was a deliberate choice. Co-creator Dan Perrault said in an interview with Vulture that a private school offers the chance to explore the lives of wealthier kids as opposed to the public school students featured in Season 1. And in doing so, they wanted to drive home the point that the two groups of kids are more similar than one might think.\n\"For the second season, it’s very crime-dependent. But it’s a time in your life when the stakes are high every day!\" he said in the same interview. \"'What’s the rest of your life going to be?' It doesn’t matter if you’re born on third base, you’re asking yourself that same question, you know?\"\nNetflix\nTo properly nail the vibe that accompanies education in a Catholic school, the showrunners said they hired writers for their team who went through that experience first-hand, and studied what it should look like. \"We watched Lady Bird! But [season two] is not full Rushmore,\" co-creator Tony Yacenda said in the same piece, invoking the names of other famous Catholic school-set projects. \"We didn’t want it to be like Dead Poets Society. Because when we talked to kids who did go to these wealthy private high schools, they understood season one perfectly. It’s still a show about the kids you went to high school with.\"\nAnd that's what American Vandal has been about from the start. Regardless of the absurdity happening onscreen, you can pretty much point to any character within the show and say, \"Yeah, I know that guy.\" It's rooted in a twisted kind of mundane reality, which makes the ridiculousness of the story at hand all the more hilarious, no matter what school its set in.","url":"https://www.bustle.com/p/where-was-american-vandal-season-2-filmed-the-showrunners-wanted-it-to-feel-like-a-real-catholic-high-school-11887259"}
