{"authors":["Brion Mcclanahan"],"date_download":"2018-10-30 21:20:08","date_modify":"2018-10-30 21:20:08","date_publish":"2016-02-08 19:22:43","description":"In the months leading up to the 2016 election cycle, I have often been asked by students, colleagues, and interviewers/journalists which of the potential candidates in either major party would be best suited to be president. |","filename":"data/vaneerConsumption/WhichCandidateWillScrewUpAmericatheLeast.json","image_url":"https://media.breitbart.com/media/2016/02/GOP-debate-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_08__1540934408.html","title":"Which Candidate Will Screw Up America the Least?","title_page":"Which Candidate Will Screw Up America the Least? | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In the months leading up to the 2016 election cycle, I have often been asked by students, colleagues, and interviewers/journalists which of the potential candidates in either major party would be best suited to be president.\nI tend to measure my response to this question in relation to originalism, meaning how the founding generation said the Constitution would be interpreted when it was ratified in 1788. After all, James Madison said that it was the ratifying conventions that gave the Constitution its life and vitality.\nWith that in mind, we’re down to five (who have any chance), and it ain’t pretty. But there is hope.\nLet’s start with the low-hanging fruit, Democrats Bernie Sanders and Hillary Clinton.\nAnyone who believes in the Constitution other than as an “elastic document” with limitless “implied powers” could never in good conscience vote for either Clinton or Sanders. A vote for either will be a continuation of the last nearly thirty years of overwhelming executive abuse of office, from blatantly unconstitutional domestic agendas to support for massive unconstitutional executive war-making powers.\nSanders sounds like an outsider. If you call a man who has served in the United States Congress for over twenty years an outsider, then Jeb! should be the second coming of Ronald Reagan.\nPlease clap.\nThe case for Clinton should stop at five letters: F.E.L.O.N. She would have to pardon herself upon taking office. Of course she is not able to do that constitutionally, but either Sanders or Clinton swearing to “preserve, protect, and defend the Constitution” would be like Bill Clinton pledging not to run the intern-screening process as First Man.\nOn to the Republicans.\nTed Cruz has two things working against him. He isn’t qualified according to the original Constitution, and he is not an originalist.\nCruz is not a “natural born citizen.” Remember those who demanded Obama “show us the birth certificate”? He produced one showing that he was born in Hawaii. Had he been born in Kenya as was allegedly the case, Obama would have been ineligible for office. Several law professors on both the Left and Right admitted this was the correct interpretation of the Constitution. Where was Cruz born again? Those on the Right should give pause when voting for a man with a weaker claim to “natural born” status than Barry Soetoro.\nAs for originalism, Cruz is at least solid on a textual understanding of the Constitution, but textualism and originalism are not the same. Textualism opens the door to vast executive powers, and Cruz has openly admitted he will follow the unconstitutional path of every president of the last eighty years in freely using his pen to legislate from the Oval Office. That isn’t originalism.\nWhat about Marco Rubio? See Ted Cruz. A “natural born citizen” was defined by the founding generation and by contemporary—meaning 18th century—legal scholars as being a person born in the United States to two parents who are American citizens. We know where the Rubios used to call home.\nAnd Rubio as president would be indistinguishable from either Bush. That nets the American public Medicare Part D, massive illegal immigration, T.A.R.P., No Child Left Behind, the Americans with Disabilities Act, “reasonable” gun control, and an American bomb (or thousands) for every country that doesn’t support our New World Order. Don’t think so? Follow the recent flow of establishment money. They are betting on Rubio.\nAnd then there’s Trump. By legal default, he should be the last man standing, but I have little hope that either Cruz or Rubio will be disqualified by our complicit federal judiciary system, so the Trumpster is going to have to slug it out. In that kind of fight, my money is on Trump. No one riffs, trolls, or smacks down the other candidates down better than he does.\nHow would Trump be as president? He is not an originalist, but he would be closer to what the founding generation would have expected out of the president than anyone else in the field in either party.\nTrump’s apparent lack of position on several issues is actually refreshing, at least from an originalist position. The president was not supposed to be the chief legislator, and the impression Trump gives is that he would appoint good people and then let them do their jobs while letting Congress legislate.\nOf course, Trump would freely wield the veto pen for legislation he does not “approve,” and while that is not how the founding generation thought the veto should be used, expecting any modern president to buck what is now a century-old misuse of presidential power would be the definition of insanity. So would thinking the president is going to dramatically change American life, but we seem to think that every four years.\nAnd unlike Cruz, Rubio, Sanders, or Clinton, Trump has gravitas. He is getting attention because of who he is, not because of where he was elected or what position he held in government. No one else in the top five can say that. Most in the founding generation could.\nTrump may not be able to “make America great again” on his own, but he would be the one who would screw it up the least. The others would eventually have to be added to a Volume 2 of my 9 Presidents Who Screwed Up America. Trump, at least, would have a chance to be considered for the “Four Who Tried to Save Her.”\nBrion McClanahan is a historian the author of the newly released, 9 Presidents Who Screwed Up America–and Four Who Tried to Save Her.","url":"https://www.breitbart.com/politics/2016/02/08/which-candidate-will-screw-up-america-the-least/"}
