{"authors":["George Odling For The Daily Mail"],"date_download":"2018-10-22 21:05:29","date_modify":"2018-10-22 21:05:29","date_publish":"2017-04-26 01:08:53","description":"Consumer group Which? Travel says duty free shopping could be more pricey than supermarkets. A study found chocolate, gin, and a memory card were cheaper in the supermarkets than airports.","filename":"data/vaneerConsumption/WhichTravelsaysdutyfreecouldbemoreexpensive.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B5B3000000578-0-image-a-8_1493165207849.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4445912_Duty-free-save-supermarket_1540242329.html","title":"Which? Travel says duty free could be more expensive","title_page":"Which? Travel says duty free could be more expensive | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Picking up a bargain bottle of gin and giant bar of Toblerone might be a staple part of any airport visit.\nBut shopping duty free could be more expensive than a normal supermarket, a consumer group has found.\nA 360g of Toblerone costs £4 at Bristol World Duty Free but just £3 at Asda, while a 70cl bottle of Tanqueray gin costs £18 at Heathrow Terminal 2 but just £15 at Morrisons, Which? Travel found.\nWhich? Travel says duty free shopping could be more pricey than supermarkets\nSome chocolate purchased at Duty Free shops were more expensive than in some supermarkets\nAnd there was a whopping £73 more to pay when buying a SanDisk Extreme Plus 64GB camera memory card at Glasgow International’s Dixons Travel rather than Currys online.\nThis was due to a ‘pricing error’ which was being corrected, a spokesman from Dixons Travel said.\nShoppers could save £21 buying a 100ml bottle of Eternity for Men Eau de Toilette on Amazon for £25 rather than paying £46 for the same product at Birmingham World Duty Free, according to the watchdog’s study.\nAnd toy bargain hunters can buy a Lego Star Wars Millennium Falcon for £20 less at Toys R Us online that at the World Duty Free at Gatwick’s south terminal.\nThere were some savings to be made at airport shops, according to the watchdog, which checked all the prices between March 10 and March 13, including delivery costs for online orders.\nThe iPad mini 2 and Fitbit Flex 2 were both £10 cheaper at Dixons Travel at Glasgow International airport than at John Lewis online.\nWhich? Travel warned shoppers to ‘always do your research before you head to the airport to make sure the “deal” is not actually dearer than you find on the high street or online’.\nShoppers could save £21 buying a 100ml bottle of Eternity for Men Eau de Toilette on Amazon for £25 rather than paying £46 for the same product at Birmingham World Duty Free, according to the watchdog’s study\nThe Dixons Travel spokesman said: ‘We follow the common practice of non-duty free airport retailers in offering one single, great value price across products, regardless of destination, underpinned by our price promise.\n‘If on the rare occasion one of these products is found cheaper at a competitor, we will double the difference instantly at the till.’\nWhich? Travel also revealed other ways of saving money while visiting the airport.\nConsumers were warned not to leave changing currency until the last minute and are instead advised to order euros online from John Lewis currency then pick them up at the airport.\nTravellers are also advised to book their parking space well in advance. A week’ s parking at Birmingham airport could cost £235 without prior booking, but on-site parking was £56 if secured in advance.","url":"https://www.dailymail.co.uk/news/article-4445912/Duty-free-save-supermarket.html"}
