{"authors":["Sean Poulter","Consumer Affairs Editor For The Daily Mail"],"date_download":"2018-10-22 21:13:05","date_modify":"2018-10-22 21:13:05","date_publish":"2017-04-26 01:27:20","description":"The idea is that customers can enjoy complimentary food and drink in relaxing, comfy chairs, free wi-fi and perhaps a shower for an average fee of around £25 per person. Yet, the reality is rather different.","filename":"data/vaneerConsumption/Whichsurveyfindsflyersletdownbyairportlounges.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B568300000578-0-image-a-9_1493166431053.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4445988_Pay-airport-lounges-not-luxury-says-Which_1540242785.html","title":"Which? survey finds flyers let down by airport lounges","title_page":"Which? survey finds flyers let down by airport lounges | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Paying for access to the peace and comfort of an executive airport lounge offering complimentary food and drink has an obvious appeal.\nHowever, an investigation has found that too often the nation's airports are serving up only a basic buffet in dreary surroundings.\nAirports have caught on to the money making idea of offering access to these new lounges on a pay as you go basis.\nPaying for access to the peace and comfort of an executive airport lounge offering complimentary food and drink has an obvious appeal. Pictured is Plaza Premium at Heathrow\nThe idea is that customers can enjoy complimentary food and drink in relaxing, comfy chairs, free wi-fi and perhaps a shower or a manicure for an average fee of around £25 per person.\nYet, the reality is rather different, for most people are disappointed and feel the lounges offer poor value for money, according to Which?\nThe Which? Travel magazine checked out a total of 17 lounges countrywide looking at the prices, facilities, views and comfort.\nThe average score awarded for the lounges, which can cost as much as £40 for those who pay at the door, was just 2.6 out of five.\nWorst rated was Gatwick My Lounge North, which costs £18 if booked in advance (pictured)\nA spokesman said: 'When you are wedged alongside a squabbling family on the last remaining plastic seat in an overcrowded airport, you might start wishing you'd paid for business class.\n'Not for the flight experience - just to get a bit of peace and quiet, and a free drink, in one those swanky, hushed executive lounges.\n'But most airports now have lounges that all passengers can use, for a fee. Whether you are flying Easyjet or Emirates, these pay-as-you-go escapes promise free food and booze, magazines, better wi-fi and, in some cases, even showers and spa facilities.\nThe No1 lounge at Gatwick's south terminal earned the highest score at 3.5 out of five\n'Unfortunately, when we sent our reviewers to 17 such UK airport lounges, they weren't very impressed - the average score they awarded was just 2.6 out of 5.\n'The decor was often low-rent rather than ritzy, and the buffets were basic. And, having paid an average of £25 to enter, the consensus was that you would need to eat and drink an awful lot to get your money's worth.'\nWorst of the 17 investigated was the Gatwick My Lounge North, at Gatwick Airport (pictured), which costs £18 if booked in advance and £24 on the door\nWorst of the 17 was the Gatwick My Lounge North, which costs £18 if booked in advance and £24 on the door.\nWhich? said: 'The smallest of the three lounges at Gatwick North left us wishing we'd stuck to the seating outside. The floor was grubby and the facilities were basic.'\nTHE BEST AND WORST AIRPORT LOUNGES Worst: Gatwick My Lounge North, which costs £18 in advance. Which? said: 'The smallest of the three lounges at Gatwick North left us wishing we'd stuck to the seating outside. The floor was grubby and the facilities were basic.' Best: The No1 lounge at Gatwick's south terminal earned the highest score at 3.5 out of five. With an advance fee of £30, it was found by Which? to be 'classy and comfortable' and 'worth paying the little extra for'\nOn the free food and drink, it said: 'Orange juice made out of concentrate wasn't a good start, and with breakfast finishing at 11am, the all-day menu item of vegetable chilli didn't look especially appetising.\n'There weren't enough easy chairs or sockets for laptops, but we liked the separation between the family area and the rest of the lounge.'\nIt added: 'If this really was 'our lounge', we'd buy some nicer snacks and have a whip round with a vac.'\nThe Heathrow Plaza Premium T4 lounge is £35 a head, but Which? found it was almost as busy as the concourse outside.\nWhich? said: 'An 'extensive food and beverage choice' was promised. But this just meant curry, spaghetti, casserole, and the usual salads, soups and snacks.'\nIt was impressed with the fast wi-fi, reclining chairs and a quiet no children area.\nThe consumer group's reviewer said: 'The fancy armchairs and fashionable design do lend an executive air, but fighting over elbow space doesn't. Our advice is to check out how busy the lounge is before checking in.'\nThe average satisfaction score awarded for the lounges, which can cost as much as £40 for those who pay at the door, was just 2.6 out of five\nThe lounge at Manchester airport's Aspire T1 is £25 if booked in advance of £28 on the door, however it was 'pretty gloomy', said Which?\nThe reviewer said: 'It felt more like a place for business people to get some work done - good wi-fi - rather than a glitzy setting to kick off your holiday with a drink or two.\n'At lunchtime, the only hot food was leek and potato soup. Otherwise it was salad, or a variety of sticky snacks -lemon drizzle cake, millionaire's shortbread and brownies.'\nThe Aspire lounge at Birmingham, which is £22 if booked in advance and £25 on the door, was offering 'rather tired-looking' bacon sandwiches at breakfast.\nIt was small and rather basic without any toilets of its own with the reviewer described as no more than a 'pleasant waiting room'.","url":"https://www.dailymail.co.uk/news/article-4445988/Pay-airport-lounges-not-luxury-says-Which.html"}
