{"authors":[],"date_download":"2018-10-30 14:30:55","date_modify":"2018-10-30 14:30:55","date_publish":"2015-08-06 00:00:00","description":null,"filename":"data/vaneerConsumption/WhichishardergettingvoterIDordoingyourtaxes.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_08_which_is_harder_getting_voter_id_or_doing_your_taxes_1540909855.html","title":"Which is harder: getting voter ID or doing your taxes?","title_page":"Which is harder: getting voter ID or doing your taxes?","title_rss":"NULL","source_domain":"americanthinker.com","text":"A federal appeals panel ruled Wednesday that a strict voter identification law in Texas discriminated against blacks and Hispanics and violated the Voting Rights Act of 1965 . The Texas ID law is one of the strictest of its kind in the country. The law requires voters to bring a government-issued photo ID to the polls. Accepted forms of identification include a driver’s license, a United States passport, a concealed-handgun license and a so-called election identification certificate, a card issued by the State Department of Public Safety.\nWendy R. Weiser, the director of the democracy program at the Brennan Center for Justice at New York University School of Law, called the ruling “great news for voters in Texas and for the country.”\nDoes anyone see the irony in someone who directs a \"democracy program\" pushing for a ruling that corrupts the very franchise on which our country was founded?\nThe plaintiffs, including individual voters, civil rights groups and the Department of Justice, said it was discriminatory because a far greater share of poor people and minorities do not have these forms of identification and lack easy access to birth certificates or other documents needed to obtain them\nIt's not difficult at all. There is a huge choice of documents you can provide to get an ID card in Texas. All you have to do is bring some combination of them to your local DMV office. It's really not that hard.\nBut if that's the criterion – that if it's too cumbersome to comply with, the law is invalid – then what about doing your taxes? Filling out all those complex forms is much, much more difficult than getting an ID from a DMV office. And yet laws requiring payment of taxes haven't been struck down as \"discriminating against poor people and minorities.\" (Do you think the \"earned income\" tax credit might be struck down, too, as it too is too difficult to apply for?)\nThe government produces thick phone book after phone book of regulations and never worries about the difficulties of compliance. What about small businesses that have to comply with extremely complex EPA and labor laws? Should they be excused?\nYou see, ease of compliance is a worry only when it comes to voting. And the stated reason plays into bigotry – that blacks and Hispanics are too dumb to go the DMV office and fill out a form.\nWhy is this sort of blatant racism on the part of the judiciary acceptable? We know that blacks are no less capable of going to the DMV with their papers than white people. We also know that most blacks and Hispanics already have ID, or else they would not be able to rent a car, go to a hotel, board a plane, or buy beer.\nThis ruling really reveals the intellectual bankruptcy of the liberal judiciary, when it has to rely on racial stereotyping and spurious arguments to perpetuate a system where voter fraud can run rampant simply because authorities are not allowed to verify identity of voters.\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/08/which_is_harder_getting_voter_id_or_doing_your_taxes.html"}
