{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:27:44","date_modify":"2018-10-30 21:27:44","date_publish":"2015-05-31 14:47:13","description":"Andy Puzder, CEO of Carl's Jr. and Hardee's parent company CKE Restaurants, says some models are better at eating hamburgers than others. |","filename":"data/vaneerConsumption/WhichModelsHandleBurgersBetterCarlsJrCEOSpillsSecrets.json","image_url":"https://media.breitbart.com/media/2015/05/carls-jr-model-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_05_31__1540934864.html","title":"Which Models Handle Burgers Better? Carl's Jr. CEO Spills Secrets","title_page":"Which Models Handle Burgers Better? Carl's Jr. CEO Spills Secrets | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Andy Puzder, CEO of Carl’s Jr. and Hardee’s parent company CKE Restaurants, says some models are better at eating hamburgers than others.\nCarl’s Jr. is known for its ads featuring scantily-clad models chowing down on its signature “Thickburgers.”\nIn an interview with the Associated Press, Puzder said that in order for the commercials to work, the models “really have to go at [the burger]. You really have to attack it.”\n“We used Kim Kardashian in an ad. But Kim really couldn’t eat the burgers,” Puzder explained. “Luckily, we had a salad we were promoting, so we used Kim in the salad ad. But if we had not been promoting a salad, we probably never would’ve done an ad with Kim, because she wasn’t good at eating the burger. She’s too tiny. She’s really little.”\nKardashian, for her part, told the AP that she had a fitness DVD out and wanted to eat something that fit with her brand.\nPuzder said the concept for the ads originated in 2005, when ad executive Jordin Mendelsohn approached him with an idea to use Paris Hilton in a commercial. Since then, Carl’s Jr. commercials have featured superstar models like Kate Upton, Heidi Klum Padma Lakshmi and Sports Illustrated model Hannah Ferguson , some before they became famous.\n“We have a history of picking these young women before they hit their peak,” Puzder told the AP. “We put Kate Upton in an ad a month before she got the cover for Sports Illustrated. At the time we picked her, we just said, ‘This is a beautiful woman.'”\nThe CEO claims that the ads are so successful that some models now view them as a platform to further their careers.\n“We did an event in Texas and I was talking to [Sports Illustrated model Hannah Ferguson],” Puzder explained. “She said, ‘All us girls at Sports Illustrated, we all talk about who’s going to do the next Carl’s Jr. ad and how can we be the model that does the next ad.'” (A rep for Ferguson told the AP that exchange never happened.)\nPuzder said he receives some negative feedback about the commercials, but he ends up thanking the people who criticize the ads.\n“I said, ‘If you don’t do an email blast with one of our ads, I run into the head of marketing and say, ‘What’s the matter with the ad?'” Puzder joked.\nThe latest ad features Sports Illustrated model Samantha Hoopes hawking the “Most American Thickburger,” a burger with a split hot dog and potato chips on top. Hoopes’ ad premieres Monday.","url":"https://www.breitbart.com/entertainment/2015/05/31/which-models-handle-burgers-better-carls-jr-ceo-spills-secrets/"}
