{"authors":[],"date_download":"2018-10-30 20:28:46","date_modify":"2018-10-30 20:28:46","date_publish":"2015-10-24 04:00:00","description":"The city of Jonesboro is only about 2½ square miles. But what it lacks in size, it’s making up for in traffic tickets.","filename":"data/vaneerConsumption/whichcitiesandcountiesaretheworst.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/06/19/Videos/4419139.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_traffic-tickets-_1f9bd11bfeac84df4bb83e643f365fd3__1540931326.html","title":"which cities and counties are the worst","title_page":"Georgia ticket traps: which cities and counties are the worst","title_rss":"NULL","source_domain":"ajc.com","text":"The city of Jonesboro is only about 2½ square miles.\nBut what it lacks in size, it’s making up for in traffic tickets.\nSeveral major thoroughfares — Tara Boulevard, Jonesboro Road, Ga. 3 — bring tens of thousands of commuters and rivers of cash into the town of 4,600, which collects more traffic ticket revenue per capita than any other jurisdiction in metro Atlanta, an analysis by The Atlanta Journal-Constitution has found. At least one city councilman said he fears the priority is making money, not serving the community.\n“I don’t know if it’s to ‘protect and serve’ or to ‘collect and serve,’” said Jonesboro City Councilman Robby L. Wiggins. “A lot of times, that’s what it seems like to me.”\nThe AJC examined traffic fines paid last year in more than 500 cities and counties in Georgia and created a searchable database online that any driver may use to find ticket revenue in any jurisdiction in the state. The AJC also calculated how much each jurisdiction collected per capita.\nMetropolitan Atlanta has more than a few aggressive traffic enforcers. With $1.8 million in revenue — or nearly $400 for every man, woman and child in town — the city of Jonesboro took in more than five times the metro Atlanta per capita average, $70.82. It unseated Doraville, which held that distinction in 2013 and came in No. 2 in 2014. Other high-dollar jurisdictions rounding out the metro top five: Avondale Estates, Pine Lake and College Park.\nThe law enforcement community in Georgia says most departments are targeting unsafe drivers, not ensnaring any driver they can.\n“There’s always one or two departments goofing it up for everybody,” said Frank Rotondo, who heads the Georgia Association of Chiefs of Police, although he didn’t identify any jurisdiction in particular and said metro Atlanta departments are operating above-board. “There are reasons why there are equipment rules and there are speeding rules. But if you’re ticketing for the wrong reason, shame on law enforcement.”\n‘I’m not trying to run a ticket trap’\nThe latest figures show Jonesboro’s revenue from citations has tripled since 2012.\nPolice Chief Franklin Allen credits much of the increase to the department’s five automatic license plate recognition systems, which are mounted to patrol cars. The plate recognition cameras can read thousands of license plates per minute, and they alert officers when a vehicle has expired registration. Allen said the tag reader is a valuable public safety tool because it also detects stolen vehicles and cars owned by people with arrest warrants outstanding.\n“I honestly don’t (think we are overly aggressive) for the population we serve that is transient,” Franklin said. “I’m very transparent about this. I’m not trying to run a ticket trap.”\nHe added, “When we get a hit on a car, it’s not like we can just turn a blind eye to it.”\nA tag reader is what landed Cameron Bryant in Jonesboro Municipal Court. But Bryant, 28, wasn’t upset at the police officer who scanned his plate.\n“What I did was against the law and I got a fine for it,” he shrugged as he sat waiting Oct. 12 for his case to be called. The judge reduced his $1,000 fine to $745.\nDouglasville resident Andre London could only shake his head as traffic offenders paraded before the court and had their wallets lightened. At least a dozen others in court that day had been stopped for having an expired or suspended vehicle registration.\n“They’re making a killing,” London said, his eyes widening in astonishment. “That’s $750 a head.”\nBeach-bound and busted\nThe AJC’s analysis found that the worst “ticket traps” in Georgia by far are in rural areas. They include a string of small cities and counties along state routes and interstates that lead to Florida and the Georgia coast. (Travelers to the Georgia-Florida game on Oct. 31, beware.)\nWarwick, population 411, was the top revenue generator in the state for the second year running. City patrol cars are a frequent sight on the Georgia-Florida Parkway (Ga. 300), a popular cut-through to western Florida and a key connector route between Cordele and Albany.\nCity attorney Tommy Coleman said Warwick has collected about half the revenue it previously did since a new administration took office (the dropoff was not well-reflected in the data, since it occurred later in 2014). Many of the tickets come from officers using the city’s two license plate readers, Coleman said.\n“They are still giving probably a larger number of tickets than they should,” Coleman said. “It’s easy work. You have a big highway like that, you can sit out there and pop them off.”\nLenox and Ashburn, Nos. 3 and 8 in the statewide rankings, sit astride I-75 in South Georgia.\nOak Park (No. 6) has annexed part of I-16 on the way to Savannah, while Register (No. 2) sits along a state route that parallels it, Ga. Highway 46.\n‘If that’s what slows you down …’\nThe fact that so many South Georgia towns are amassing huge sums from citations isn’t surprising to Cullen Wassell, a truck driver from Illinois who says he crisscrosses the country on a regular basis.\n“There is more police activity on I-75 between Macon and Valdosta than any other stretch of road I’ve been on, in the nation,” Wassell said.\nBut many cops say travelers should be thankful for the aggressive enforcement.\n“If you got a lot of people going down there and a lot of people speeding, you’re going to have a lot more accidents, and they’ll be fatal accidents,” said Rotondo of the police chiefs association. “People see blue lights in a car stopped for speeding, and it slows a lot of people down.”\nIn fact, prominently displayed blue lights on a stopped patrol car are an effective deterrent to speeding, Rotondo said.\n“You could call it a speed trap,” he said. “If that’s what slows you down and saves your life, that’s OK.”\nTwice the revenue, one-fifth the people\nThe more aggressive ticket-writing cities in metro Atlanta say they’re simply enforcing the law, not operating speed traps. But cities like Jonesboro and Doraville seem to enforce the law with greater enthusiasm than others in the region.\nCompare Jonesboro to Decatur, an intown suburb that is also a county seat for the even larger county of DeKalb. Decatur sees its fair share of commuter traffic, too, thanks to job centers like CDC and Emory University and thoroughfares like Scott Boulevard and East College Avenue.\nYet the city of Decatur – with twice the area and five times the population — generated only half the revenue Jonesboro did last year.\nDecatur Police Chief Mike Booker said Decatur’s traffic enforcement concentrates on school zones and neighborhoods where residents have complained about speeding – not just the busiest corridors with the most commuters.\nThe department also has an officer patrolling with a tag reader on every shift, but they’re typically cruising through retail parking lots looking for stolen vehicles, he said.\n“If you drive it too far, people aren’t appreciative of what you’re trying to do because they feel like they are being taken advantage of,” Booker said. “Without being overly aggressive, you have to find the balance.”\nThe city of Doraville takes umbrage at the suggestion that it’s too aggressive (see accompanying article), but compare its ticket revenue to that of nearby Sandy Springs. Doraville, population 10,714, took in $2.5 million in ticket revenue last year; Sandy Springs, population 101,908, contains a portion of I-285, Roswell Road and a long stretch of Ga. 400. It reported revenue of $2.4 million.\nNew law seeks ticket transparency\nFollowing the AJC’s reporting on ticket traps last year, the General Assembly passed a law that forced police departments to be more transparent about the money they derive from writing speeding tickets.\nGeorgia already had a speed trap law on the books, but it was more or less toothless. SB 134, which took effect July 1, made several key changes to that law:\nFor the first time, cities and counties must report how much revenue they receive from citing speeders every year. Previously, the state only learned about speed traps when someone complained about them. Even then, the Department of Public Safety had to perform a painstaking audit of speeding citations to determine whether the allegation was true.\nThe cap on the portion of a police department budget that can come from speeding ticket revenue was lowered to 35 percent from 40 percent. A police department that exceeds the threshold can lose its permit to use speed-detecting radar.\nFormerly, departments didn’t have to count revenue from speeding tickets that were 17 mph or more over the limit in the calculation of whether their revenue exceeded 40 percent. This meant, of course, that the most expensive speeding tickets weren’t counted toward the 40 percent ceiling. Bill sponsor Jesse Stone, R-Waynesboro, proposed abolishing that loophole. After receiving pushback from police and sheriffs, however, lawmakers chose instead to raise the bar from 17 mph to 20 mph, and to lower the revenue ceiling to 35 percent of budget.\nThe bill required that citations for driving too fast for conditions be counted toward the 35 percent threshold.\nThe new law does not require law enforcement to report total ticket revenue. So police can still write as many tickets as they want for moving and vehicle equipment violations like expired tag registration, following too closely, running a stop sign or failure to maintain a lane.\nStone said he wants to see the impact of the legislation before he considers changing it.\n“There is no perfect way to stop (speed traps), and there are legitimate safety concerns to consider,” Stone said. “But it’s a stricter rule, it sends a message, and hopefully it’ll be a little easier to enforce.”\nJohn Bowman, with the National Motorists Association, said that monitoring speeding ticket revenue only will lead police departments to devise workarounds. The nonprofit organization operates speedtrap.org, where drivers can find and share information.\n“If they are only held accountable for speeding ticket revenue, that gives them all the incentive to charge people for equipment violations and miscellaneous things like that instead,” Bowman said.","url":"https://www.ajc.com/news/local/traffic-tickets-some-cities-use-interstates-cash-registers/PULjG07fwkFbQUadT4YGvL/"}
