{"authors":[],"date_download":"2018-10-30 00:59:50","date_modify":"2018-10-30 00:59:50","date_publish":"2015-08-20 00:00:00","description":null,"filename":"data/vaneerConsumption/WhileObamaSleepsRussiaGobblesupUkraine.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_08_while_obama_sleeps_russia_gobbles_up_ukraine_comments_1540861190.html","title":"While Obama Sleeps, Russia Gobbles up Ukraine","title_page":"Articles: While Obama Sleeps, Russia Gobbles up Ukraine","title_rss":"NULL","source_domain":"americanthinker.com","text":"President Obama ridiculed Mitt Romney in the 2012 debates for saying that Russia was our greatest geopolitical threat. Now, as Russia continues to gobble up pieces of Ukraine under the cover of a phony cease-fire, President Obama’s outgoing Army Chief of Staff, Gen. Roy Odierno, said exactly the same thing on Wednesday: Outgoing Army Chief of Staff Ray Odierno said Wednesday that Russia is the most dangerous to the United States. “I believe Russia is the most dangerous because of a couple things,” Odierno said in the press conference. Odierno said he considers Russia the most dangerous because of some of their intents and their capabilities in Ukraine. “First they are more mature than some other of our potential adversaries and I think they have some stated intents that concern me in terms of how the Cold War ended,” Odierno said. “They have shown some significant capability in Ukraine to do operations that are fairly... (Read Full Article)","url":"https://www.americanthinker.com/articles/2015/08/while_obama_sleeps_russia_gobbles_up_ukraine_comments.html"}
w that the demise of the Soviet Union was one of the greatest disasters of modern times. His actions in Ukraine in conjunction with massive Russian rearmament show his desire to reassemble the old Soviet Union.\nIn his annual address to parliament in 2005, old KGB boss emeritus Putin made the grotesque claim that the \"demise of the Soviet Union was the greatest political catastrophe of the century,\" demonstrating a nostalgia for what he considers the good old days.\nBack in 2012 when Romney put Russia at the top of the geopolitical threat list, President Obama gave a mocking response more worthy of a former community organizer rather than the leader of the free world. As Investor’s Business Daily noted:\n\"You said Russia. Not al-Qaida. You said Russia,\" Obama rebuked him regarding our biggest threats. \"The 1980s are now calling to ask for their foreign policy back because... the Cold War's been over for 20 years,\" said the president who promised the Russians more flexibility as he disarmed the United States.\nIf the Cold War was over, somebody forgot to tell Moscow, for their belligerence towards Ukraine is straight out of the playbook of Nikita Khrushchev and Leonid Brezhnev. They ruthlessly repressed with Soviet armor the 1956 Hungary rebellion and the 1968 Prague Spring in Czechoslovakia.\nPutin’s approach is perhaps more subtle, arming so-called “separatists” rather than sending in Soviet armored columns, but it is a distinction without a difference. Attacks by these separatists, with the full knowledge and support of Moscow, have increase markedly in recent days, making a mockery of the February cease-fire:\nUkraine’s military reported 127 attacks on Monday by the pro-Russian rebels, including an assault by 400 separatists and tanks about 30 miles north of Mariupol, a strategic government-held port in southeastern Ukraine…. U.S. Secretary of State John Kerry “expressed grave concern” Thursday about the escalation in rebel attacks in a phone call with Sergei Lavrov, his Russian counterpart. Kerry urged Russia to end its support for the separatists and stick to the Minsk ceasefire signed in mid-February…. Luke Coffey, a fellow at the Heritage Foundation’s Margaret Thatcher Center for Freedom who studies European security issues, said in an interview that Russian President Vladimir Putin is pursuing a “very incremental, deliberate, slow” strategy in Ukraine. By taking small pieces of territory over a months-long conflict, he can blunt a concerted response from an international community that has devoted attention to other immediate issues, such as the Iran nuclear deal.\nGrave concerns and sternly worded letters carry no weight with Putin, whose stated ambitions are clear. President Obama has done less than nothing, sending only supplies worthy of a Boy Scout Jamboree rather than a sovereign nation resisting Russian aggression. Ukrainian President Petro Poroshenko warned Congress last September that Russian actions in the Ukraine were the start of a new Cold War:\nOn Thursday, Ukrainian President Petro Poroshenko gave a 40-minute speech to a rare joint session of Congress alerting lawmakers to the plight of his country under Russia's creeping \"Anschluss.\" Poroshenko once again pled for meaningful aid, including an affiliation with NATO, and warned that a new Iron Curtain may soon descend as Vladimir Putin tries to reassemble the Soviet Union whose demise he has publicly mourned…. In March, Ukraine asked for arms and ammunition, intelligence support, aviation fuel and night vision goggles. The Pentagon agreed only to provide the Ukrainians with supplies of U.S. military rations known as Meals Ready To Eat, or MREs. This time Ukraine did not get much more than that — just some peripheral gear such as night-vision goggles and helmets. But once again it received no lethal aid that Poroshenko's country desperately needs, such as requested anti-tank weaponry.\nJust as Obama failed to aid Iran’s “Green Revolution” in Iran in 2009 when it might have brought the mullahs to their knees and nipped Iran’s nuclear threat in the bud, he is allowing Putin and Russia to take the first steps toward rebooting the old “evil empire” President Ronald Reagan worked so hard to defeat, Like Hitler’s 1936 march into the Rhineland it will lead to a bad end.\nDaniel John Sobieski is a free lance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/articles/2015/08/while_obama_sleeps_russia_gobbles_up_ukraine.html"}
