{"authors":[],"date_download":"2018-10-30 19:45:31","date_modify":"2018-10-30 19:45:31","date_publish":"2018-08-16 09:00:00","description":"When people are mistreated just because of their race, we need to rethink routine behavior","filename":"data/vaneerConsumption/Whilesomeroutinesareharmlessothersareheartbreaking.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/16/Images/newsEngin.22784303_US-NEWS-VIRALVIDEOS-ACTIVIS.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_when-routine-rea_0b07649864c5abbf7c4e363b4aaf8081__1540928731.html","title":"While some routines are harmless, others are heartbreaking","title_page":"While some routines are harmless, others are heartbreaking","title_rss":"NULL","source_domain":"ajc.com","text":"The calendar hasn’t yet declared it so, but summer is officially over.\nSchool bells are ringing and bumper-to-bumper traffic is upon us once more. Depending on how you look at it, that alone makes this a dreadful time of year. The 45 minutes it takes to make my 19-mile commute to work has nearly doubled. Again.\nAnd yet, even in the dead of traffic, I find solace in this routine. It’s what I’ve become used to, like waking up to my husband’s footsteps up the stairs and to the nightstand beside the bed where he places my cup of coffee.\nI know it’s 5 a.m. or thereabouts sometimes because he announces the time and other times just because that’s the time we’ve started our day for, oh, more than 30 years now.\nJimmy returns to the kitchen. I sit up, grab my glasses, my Bible and for 30 minutes spend time reading and listening to God.\nDone, I read the e-newspaper, bathe, dress, shut my bedroom door, kneel and pray before heading out the door and into another day.\nFor as long as I can remember, this has been my morning routine, and however mundane it may seem, my happy place.\nThat doesn’t mean I don’t appreciate spontaneity. I do. Even a ritualist like myself can break from the familiar every now and then and be grateful for it.\nRELATED: Living while black\nFor me at least, routine provides a level of comfort and security that I need, that frees me from the places where, if we aren’t careful, we linger too long.\nI’ve lived long enough, seen enough to know that depending on the routine — not just what we do but what we say and how we even think about the world and the people around us — can lead to trouble.\nIn this Aug. 31, 2017, photo, former U.S. Sen. Fred Harris of Oklahoma holds a copy of “The Kerner Report” at his home in Corrales, N.M., as he discusses the 50th anniversary of the Kerner Commission, a panel appointed by President Lyndon Johnson in 1967 to examine the causes of the 1960s riots. Harris is the last surviving member of the Kerner Commission, and he says he remains haunted that its recommendations on U.S. race relations and poverty were never adopted. AP PHOTO / RUSSELL CONTRERAS (The Atlanta Journal-Constitution)\nAs adults, we set up our own routines, even the simple ritual of taking a walk or driving into work. Same route. The same time of day.\nTo deviate is nothing short of unsettling. Remember the last time you started a new job or moved to a new neighborhood or went to a new school? Small things but often stressful just the same.\nThe opposite is true when we stick to what’s familiar.\nThe problem is we can get stuck in old and unhealthy ways of thinking, too.\nAll Asians are smart. All whites are racists. All black and brown people are lazy or criminal or both.\nNone of it is true, but I was reminded of how harmful that kind of thinking can be recently after writing about Oumou Kanoute, the Smith College sophomore who recently became the latest African-American to have the police sicced on her because she seemed out of place.\nI’d been hearing about these incidents for months. But forever mindful that “he that refraineth his lips is wise,” I took a wait-and-see stance, as I often do before drawing any conclusions.\nMy first reaction was that it — black men accosted at Starbucks — was just an isolated case, but then there was another reported incident and another and another.\nIt wasn’t until a week or so ago that it occurred to me that these daily outings by black folk had clearly become routine problems for some whites and that maybe I needed to say something and so I did.\nThe reaction was mixed, as it almost always is.\nI like it that I’m seldom alone in the way I see the world. It just feels right. Comfortable.\nEach week, Gracie Bonds Staples will bring you a perspective on life in the Atlanta area. Life with Gracie runs online Tuesday, Thursday and alternating Fridays. (The Atlanta Journal-Constitution)\nBut it doesn’t bother me either when people disagree. I like hearing how other people view the issues I write about.\nI can promise you, even if it stings, I will consider whether it’s valid, whether it demands a change in what I do and how I think on my part.\nRELATED: How we experience race and ethnicity in Georgia\nThat was my hope last week when I wrote about Kanoute, that people who believe her treatment was warranted because as one reader wrote African-Americans make up about 15 percent of the population but commit close to 50 percent of U.S. crimes might see the harm that does and maybe, just maybe, rethink that sort of reasoning.\n“Is it any wonder that people are suspicious?” he asked.\nSo because we commit 50 percent of the crimes, we don’t even deserve the benefit of the doubt and not one ounce of care or compassion? Not one of us? Ever? Really?\nIt’s OK to call the police on blacks because they commit 50 percent of crimes. We don’t criminalize all whites, nor should we, because white men commit 90 percent of serial murders and school shootings.\nYet when I point out that something is wrong when this keeps happening to African-Americans, if I think that’s an unfair burden to have to carry, I’m told I’m racist and what I should be writing about is all the black people who kill, steal and destroy.\nThere’s no denying the black crime rate is a routine and serious problem, but it doesn’t mean we should ignore routine calls to police on black people because they seem out of place.\nThat’s the kind of uneven routine response that has held us in this place for centuries.\nI get it that it’s easy to fall back on old ways of thinking, of how we view this life. It’s familiar. It feels safe like any routine, even something as menacing as being stuck in back-to-school traffic. It is what it is.\nRace, though, is different. Treating people with dignity and compassion is possible because it depends only on our will to do so.\nCan’t we do something different? Isn’t it about time?\nFind Gracie on Facebook (www.facebook.com/graciestaplesajc/) and Twitter (@GStaples_AJC) or email her at gstaples@ajc.com.","url":"https://www.ajc.com/news/local/when-routine-really-just-excuse-for-denying-dignity-others/IIEntmyQbBkFyV3qSIhu3H/"}
