{"authors":["Oliver Jj Lane"],"date_download":"2018-10-30 21:23:14","date_modify":"2018-10-30 21:23:14","date_publish":"2014-10-08 15:23:22","description":"A Syrian woman who joined the ISIS morality police and patrolled the streets enforcing strict Islamic State female dress codes has spoken of her |","filename":"data/vaneerConsumption/WhippingsForcedMarriagesandBeheadingsInsideISISsMoralityPolice.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-London/2014/10/08/ISIS-Defector.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_10_08__1540934594.html","title":"Whippings, Forced Marriages, and Beheadings: Inside ISIS's 'Morality Police'","title_page":"Whippings, Forced Marriages, and Beheadings: Inside ISIS's 'Morality Police' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Syrian woman who joined the ISIS morality police and patrolled the streets enforcing strict Islamic State female dress codes has spoken of her experiences after finding the country too much to handle, having witnessed crucifixions and beheadings and being forced into an arranged marriage.\nThe 25 year-old woman, who has only been identified by pseudonym ‘Khadija’ has spoken to CNN while dressed in a full veiled niqab to hide her face has told the network about life in Raqqa. As a member of the al-Khansaa brigade she was charged with enforcing the morality of the Islamic regime, and patrolled the streets while heavily armed to ensure compliance.\nSpeaking of the punishment for dissent, she said: “We’d patrol the streets. If we saw a woman who was not wearing the correct sharia clothing, we would grab her. Sometimes, they would be lashed”.\nDescribing the first time she met the senior figure within the al-Khansaa morality police tasked with carrying out the physical punishments, ‘Khadija’ said: “she’s female, but she’s not a normal female. She’s huge. She has an AK-47, a pistol, a whip, a dagger. And she wears the niqab”.\nThe rules for clothing in the Islamic state for women are very strict. Beads are outlawed, as are any garment that follows the female form, and a woman’s eyes must never be seen in public.\n‘Khadija’ was initially very happy about her position of power but began to have second thoughts after witnessing executions, and coming into contact with the local man who was in charge of organising marriages between young women and jihadists.\nWorking from an office embedded in the morality police headquarters, ‘Khadija’ recounted the organiser of arranged and forced marriages was “one of the worst people” she had encountered: “the foreign fighters are very brutal with women, even the ones they marry. There were cases where the wife had to be taken to the emergency ward because of the sexual violence”.\nAfter having a forced marriage arranged for her, university-educated ‘Khadija’ decided she would not accept herself what she had forced upon others through her position within the al-Khansaa brigade, and fled to Turkey, taking advantage of the developed network of human traffickers flourishing along the border. Now she is free in Turkey, ‘Khadija’ still chooses to wear the full-face veil, conscious that she doesn’t want to “reject religion completely”.\nAdmitting her own mistake in joining ISIS, ‘Khadija’ said “I don’t want anyone else to be duped by them. Too many girls think they are the right Islam”.","url":"https://www.breitbart.com/europe/2014/10/08/isis-morality-police/"}
