{"authors":[],"date_download":"2018-10-22 22:05:48","date_modify":"2018-10-22 22:05:48","date_publish":"2014-05-08 22:38:09","description":"Dr. Samuel Foote was the first to allege that in an effort to improve their record, hospital officials kept a secret unofficial list of veterans.","filename":"data/vaneerConsumption/WhistleblowerSaysVAHospitalCoveredUpProblemsDelayedCare.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/430786/140508-phoenix-veterans-affairs-jms-2142_15481e17453c8bf717ad15306f22455e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_va-hospital-scandal_whistleblower-says-va-hospital-covered-problems-delayed-care-n100851_1540245948.html","title":"Whistleblower Says VA Hospital Covered Up Problems, Delayed Care","title_page":"Whistleblower Says VA Hospital Covered Up Problems, Delayed Care","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSally Eliano lost her father-in-law Thomas Breen to cancer last November, and she blames his death on the Veteran Affairs hospital in Phoenix.\nEliano told NBC News when Breen went to the hospital for urgent care, the staff refused to treat him and told him to see his primary VA doctor.\nHe waited months, but died before he could get an appointment.\n\"All the people who were part of this, they should be held accountable because it is a crime. You know delayed care is denied care and it's just not fair,\" Eliano said.\nBreen is one of up to 40 patients who died at the Phoenix hospital, allegedly due to delays in care.\nThe VA has become notorious for its long delays and backlog.\nSeveral hospital whistleblowers claim that in an effort to improve their performance record, administrators ordered thousands of appointment requests be diverted to a secret unofficial list not to be reported. If the patients died, their names would disappear.\nDr. Samuel Foote, who spent decades working for the VA, was the first to allege that in an effort to improve their record, hospital officials kept a secret unofficial list of veterans who sought medical care.","url":"https://www.nbcnews.com/storyline/va-hospital-scandal/whistleblower-says-va-hospital-covered-problems-delayed-care-n100851"}
