{"authors":["Associated Press"],"date_download":"2018-10-23 00:01:32","date_modify":"2018-10-23 00:01:32","date_publish":"2016-01-28 13:27:24","description":"BERN, Switzerland (AP) — A whistleblower has given potentially key evidence to Swiss prosecutors in their investigation of FIFA and suspended president Sepp ...","filename":"data/vaneerConsumption/WhistleblowerhelpsSwissprosecutorsinFIFABlattercase.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420901_Whistleblower-helps-Swiss-prosecutors-FIFA-Blatter-case_1540252892.html","title":"Whistleblower helps Swiss prosecutors in FIFA, Blatter case","title_page":"Whistleblower helps Swiss prosecutors in FIFA, Blatter case | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Whistleblower helps Swiss prosecutors in FIFA, Blatter case\nBERN, Switzerland (AP) — A whistleblower has given potentially key evidence to Swiss prosecutors in their investigation of FIFA and suspended president Sepp Blatter.\nThe spokesman for Switzerland's attorney general's office, Andre Marty, revealed progress in the case in an interview broadcast Thursday by German network ARD.\n\"A witness, a so-called whistleblower, gave us interesting information relevant to the case, which brought us markedly forward in the criminal investigation,\" Marty said.\nSwiss attorney general Michael Lauber opened criminal proceedings against Blatter four months ago. The next day, Blatter was quizzed at FIFA and his office was raided immediately after chairing an executive committee meeting.\nBlatter is suspected of criminal mismanagement and misappropriation of FIFA money linked to a $2 million payment to Michel Platini and selling undervalued World Cup TV rights for the Caribbean to then-FIFA vice president Jack Warner.\nBlatter signed a contract in 2005 that gave Warner, a key powerbroker in FIFA elections, control of regional rights the 2010 and 2014 World Cups for a total of $600,000. Warner then sub-licensed the rights to broadcasters for sums reported to be more than $15 million.\nMarty said formal charges could be brought by the end of the year.\nBlatter faces a jail sentence of up to five years if convicted.\n\"I think that it will be clear by the end of 2016 to the middle of 2017 whether there will be enough evidence to bring about a prosecution,\" Marty said.\nThe intervention by Swiss authorities led the FIFA ethics committee to provisionally suspend Blatter and Platini in October, then ban both for eight years last month. Both deny wrongdoing and have appealed against their sanctions.","url":"https://www.dailymail.co.uk/wires/ap/article-3420901/Whistleblower-helps-Swiss-prosecutors-FIFA-Blatter-case.html"}
