{"authors":["Press Association"],"date_download":"2018-10-22 22:58:44","date_modify":"2018-10-22 22:58:44","date_publish":"2017-04-26 06:19:09","description":"Baby humpback whales \"whisper\" to their mothers to avoid attracting unwanted attention.","filename":"data/vaneerConsumption/WhisperingwhalesBabyhumpbacksheardcallingsoftlytomother.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/06/wire-463429-1493183955-470_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4446340_Whispering-whales-Baby-humpbacks-heard-calling-softly-mother_1540249124.html","title":"Whispering whales: Baby humpbacks heard calling softly to mother","title_page":"Whispering whales: Baby humpbacks heard calling softly to mother | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Baby humpback whales “whisper” to their mothers to avoid attracting unwanted attention from predators and marauding males, scientists have discovered.\nThe quiet communication reduces the chances of being overheard by killer whales and sexually rampant male humpbacks looking for an opportunity to mate.\nHumpback whales are known for their loud, haunting songs. But a study using microphone tags showed that, while swimming with their mothers, newborn whales uttered intimate grunts and squeaks that could only be heard at close range.\nA mother whale with her calf in the Exmouth Gulf (British Ecological Society/PA)\nDr Simone Videsen, from the University of Aarhus in Denmark, who led the research in Exmouth Gulf, Western Australia, said: “We .. heard a lot of rubbing sounds, like two balloons being rubbed together, which we think was the calf nudging its mother when it wants to nurse.\n“Killer whales hunt young humpback calves outside Exmouth Gulf, so by calling softly to its mother, the calf is less likely to be heard by killer whales, and avoid attracting male humpbacks who want to mate with the nursing females.”\nThe findings highlight the importance of keeping humpback “nursery” waters as quiet as possible, say the scientists, whose findings appear in the journal Functional Ecology.\n“Because mother and calf communicate in whispers, shipping noise could easily mask these quiet calls,” said Dr Videsen.\nBaby humpback whales whisper to their mothers to avoid attracting unwanted attention from predators and marauding males, scientists have discovered (British Ecological Society/PA)\nThe team tagged eight humpback calves and two mothers with suction cup devices that recorded both their sounds and movements for up to 48 hours before detaching and floating to the surface.\nHumpback whales breed in the tropics during winter and then migrate thousands of miles to their summer feeding grounds in the Arctic and Antarctic.\nDr Videsen said: “We know next to nothing about the early life stages of whales in the wild, but they are crucial for the calves’ survival during the long migration to their feeding grounds.\n“This migration is very demanding for young calves. They travel 5,000 miles across open water in rough seas and with strong winds. Knowing more about their suckling will help us understand what could disrupt this critical behaviour, so we can target conservation efforts more effectively.”","url":"https://www.dailymail.co.uk/wires/pa/article-4446340/Whispering-whales-Baby-humpbacks-heard-calling-softly-mother.html"}
