{"authors":["Eleanor Hayward For The Daily Mail"],"date_download":"2018-10-22 21:59:48","date_modify":"2018-10-22 21:59:48","date_publish":"2017-03-10 00:10:49","description":"Whistleblowers added to growing accusations that the Conservative Party engaged in electoral fraud. Volunteers, Gregg and Louise Kinsell, said national funds went on local candidates.","filename":"data/vaneerConsumption/WhistleblowersaccuseToriesofelectoralfraud.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1E70DB00000578-0-image-a-35_1489104555448.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299530_Whistleblowers-accuse-Tories-electoral-fraud_1540245588.html","title":"Whistleblowers accuse Tories of electoral fraud","title_page":"Whistleblowers accuse Tories of electoral fraud | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Whistleblowers last night accused the Tory Party of lying over campaign spending – deepening accusations of electoral fraud.\nThe party has repeatedly denied allegations it exceeded spending limits ahead of the last General Election.\nBut two activists who worked on the campaign now claim that the party cheated and has since engaged in a cover-up.\nGregg and Louise Kinsell, who volunteered for the Tories in the final few days of the 2015 election campaign in the South West, said funds which the party had declared as national spending were actually spent on local candidates.\nTwo whistleblowers added to the growing accusations that the Conservative Party engaged in electoral fraud. Gregg and Louise Kinsell, who volunteered for the Tories said funds which the party had declared as national spending were actually spent on local candidates\nThis would breach election laws stating that costs incurred to promote a candidate must be declared on local spending returns.\nThe allegations centre on the ‘Battlebus 2015’ campaign, which sent coach-loads of party activists into 29 marginal seats.\nParty spending on the battlebuses was declared only in the national election campaign’s expenses.\nThe Tories insisted the buses were a national event and not used to specifically promote local candidates.\nHowever, the Kinsells said that, while working on the battlebus tours in four key marginal constituencies in the South West, they were specifically tasked with promoting local candidates.\nThis included being given local briefing papers and seat-specific scripts, being handed specific voter data and distributing local leaflets. Mrs Kinsell told Channel 4 News: ‘We worked for the local candidates and MPs to ensure that they won their seat and we were sent wherever they thought we would help.’\nMr Kinsell said: ‘If people are saying, and the MPs concerned in these areas are saying it was part of a greater expense nationally for the Conservatives, that is a lie and an obvious falsehood.\n‘In that case I feel especially motivated to go to the police and go to the Electoral Commission. They are telling lies about what we did – and we duped people on the doors, it feels like cheating.’\nThe Kinsells alleged there was a ‘code of silence’ among activists about the battlebus operation. He said: ‘It has shocked me that they have been this arrogant and think they can get away with it.\n‘We were on the bus. We know what happened.\nThe allegations centre on the ‘Battlebus 2015’ campaign, which sent coach-loads of party activists into 29 marginal seats. Party spending on the battlebuses was declared only in the national election campaign’s expenses\n‘We know what we were doing. And they know what we were doing.’\nThe Electoral Commission is understood to be investigating the spending.\nLast July it withdrew an application to the High Court to force the Conservatives to disclose documents after party officials provided ‘limited disclosure of material’.\nLast year then-prime minister David Cameron said: ‘Lots of political parties have these bus tours – you know buses that go round different constituencies, and this is a national expense.’\nLast night a Conservative Party spokesman said: ‘We are co-operating with the ongoing investigations.’","url":"https://www.dailymail.co.uk/news/article-4299530/Whistleblowers-accuse-Tories-electoral-fraud.html"}
