{"authors":["Peter Devlin For Daily Mail Australia"],"date_download":"2018-10-22 22:00:02","date_modify":"2018-10-22 22:00:02","date_publish":"2017-03-10 00:16:17","description":"The noise from balcony railings that whistle as the wind passes through is so loud it has forced some New Zealand residents out of their home.","filename":"data/vaneerConsumption/WhistlingfenceforceNewZealandresidentstoleavehome.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1ED43000000578-0-image-a-13_1489103413911.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299262_Whistling-fence-force-New-Zealand-residents-leave-home_1540245602.html","title":"Whistling fence force New Zealand residents to leave home","title_page":"Whistling fence force New Zealand residents to leave home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The noise from balcony railings that whistle as the wind passes through has become so loud it has forced some elderly New Zealand residents out of their home.\nNeighbours of the million dollar Barrington apartments on Great North Road in Auckland say people come from blocks away to investigate the noise, the New Zealand Herald reported.\n'When it gets really bad, you get to screaming point,' said Sherrol Manton, 71, who lives in a retirement village next to the apartments.\nScroll down for video\nThe noise from balcony railings that whistle as the wind passes through has become so loud it has forced some New Zealand residents out of their home\nNoisy balcony railings have forced elderly New Zealand residents out of home- Sherrol Manton, 71, said it drives her to 'screaming point'\n'We get on the bus, go downtown and have a break.'\nThe developer behind the apartment block, Craig Kells, has acknowledged the whistling noise is an issue.\nHe said one set of repairs had already been done, and more are planned.\n'We have had the rail supplier back on site and added extra horizontal supports to try and mitigate this problem. This has helped but not fixed the issue,' Mr Kells said.\nVirgil Roberts from Fresh Realty is advertising the noisy apartments and admits it has been an 'issue' trying to work out where the sound is coming from.\n'Whistling railings have been in different places, where someone has put something up, just like vertical louvres, which can also whistle, depending on the distances of the blades to each other and the width of the louvres,' Roberts said.\nSix units have been sold and the remaining two are on the market for $1.75 million to $1.89 million.\nSix units have been sold and the remaining two are on the market for $1.75 million to $1.89 million (artist's impression)","url":"https://www.dailymail.co.uk/news/article-4299262/Whistling-fence-force-New-Zealand-residents-leave-home.html"}
