{"authors":["Allum Bokhari"],"date_download":"2018-10-30 18:20:29","date_modify":"2018-10-30 18:20:29","date_publish":"2016-02-09 15:13:34","description":"Students at the University of Exeter have a rare opportunity to reject the censorious, divisive policies of the regressive left at student government |","filename":"data/vaneerConsumption/WhiteMaleStudentRunsForExeterDiversityOfficerElectionsOnAntiSJWPlatform.json","image_url":"https://media.breitbart.com/media/2016/02/800px-Washinton_singer.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_02_09__1540923629.html","title":"White Male Student Runs For Exeter Diversity Officer Elections On Anti-SJW Platform","title_page":"White Male Student Runs For Exeter Diversity Officer Elections On Anti-SJW Platform | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Students at the University of Exeter have a rare opportunity to reject the censorious, divisive policies of the regressive left at student government elections this week. M.A student Paul Rota is running for office on a platform that challenges the wackiest ideas of the regressive left, including “safe spaces” and “cultural appropriation.”\n2015 saw an escalation of radicalism on campus, with reports of white students being banned from campus events in the U.K, while professors, presidents and faculty members on U.S campuses were hounded from their positions for offering the mildest of challenges to student regressives. In one memorable incident, a professor at Yale faced weeks of outrage for the crime of defending offensive Halloween costumes.\nPaul Rota hopes to be the gust that blows away this intellectually suffocating atmosphere, at least on his own campus of Exeter Univeristy. He’s running for the office of Welfare and Diversity officer, a position usually reserved for identity-obsessed zealots of the regressive left like the University of Goldsmiths’ notoriously racist Bahar Mustafa.\nDiversity officers are usually concerned with segregationist policies like minority-only “safe spaces,” banning conservative speakers from campus, or ensuring that peoples’ gender pronouns are respected. In short, Rota wants to challenge the regressive left from one of their own strongholds.\nHe proposes to dissolve the “Liberation Council,” a student body set up solely to spread intersectional feminism on campus. In his manifesto, Rota accuses them of “wasting everybody’s time.” If elected, he will also work to overturn Exeter’s “safe space” code, pointing out that campus safe spaces currently have more to do with banning political speech than protecting students’ safety. Last but not least, Rota wants to hold a referendum on Exeter’s membership of the National Union of Students (NUS) – the notoriously left-wing national umbrella of student unions in the U.K.\nDespite his opposition to the regressive left, Rota’s platform isn’t entirely bereft of identity politics. It directly addresses the deteriorating condition of male mental health in western societies. Rota promises to “remove the stigma that prevents young men coming forward to talk about their problems.” Don’t let the moderate language fool you — any attempt to raise male issues on campus, however mild, is akin to kicking a hornet’s nest. The University of York’s attempts to recognise International Men’s Day last year were met with widespread protest from feminists, eventually causing York to abandon its plans.\nRota has of course met with his own, minor backlash from feminists and supporters of the regressive left. This will no doubt increase once more people discover his campaign.\nThis cunt running for welfare and diversity officer tho #banwhitemenhttps://t.co/kz3WYOWUs5 — Nina Jean Genie (@notwaving) February 7, 2016\nWant to see what an absolute cunt looks like? Apparently one's running in welfare and diversity in #ExeterVote https://t.co/dJCHov6l3N — Becca (@fractalbears) February 7, 2016\nRota previously agitated for an elected Men’s Representative at Exeter, to “dispel myths like the pay gap” which he said are “causing more men to become marginalized due to a perceived bias that does not exist.” In response, feminists on campus created their own parody proposal calling for “Men’s Rights Activist Tears” to be “bottled and sold at the guild [student union] shop.”\nRota’s election campaign is an early attempt to wrest control of student government away from the regressive left, who typically dominate student elections. However, the number of moderate and libertarian students concerned with the antics of left-wing campus crazies is growing. At Exeter, they can now do something about it.\nYou can watch Paul Rota’s campaign video, which features Breitbart Tech editor Milo Yiannopoulos, below:\nYou can follow Allum Bokhari on Twitter, add him on Facebook, and download Milo Alert! for Android to be kept up to date on his latest articles.","url":"https://www.breitbart.com/tech/2016/02/09/exeter-students-can-reject-regressive-left/"}
