{"authors":["Charlie Spiering"],"date_download":"2018-10-30 19:49:35","date_modify":"2018-10-30 19:49:35","date_publish":"2016-05-16 19:07:58","description":"White House Press Secretary Josh Earnest spun the unanimous decision by the Supreme Court to punt the Zubik v. Burwell decision to lower courts as a | Politics","filename":"data/vaneerConsumption/WhiteHouseClaimsVictoryAfterSupremeCourtPuntsonLittleSistersObamacareCase.json","image_url":"https://media.breitbart.com/media/2016/03/Little-Sisters-of-the-Poor-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_05_16__1540928975.html","title":"White House Claims Victory After Supreme Court Punts on Little Sisters Obamacare Case","title_page":"White House Claims Victory After Supreme Court Punts on Little Sisters Obamacare Case | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"White House Press Secretary Josh Earnest spun the unanimous decision by the Supreme Court to punt the Zubik v. Burwell decision to lower courts as a victory for the administration.\n“We obviously were pleased with the announcement from the Supreme Court today,” Earnest told reporters during the White House press briefing today.\nAlthough the decision to punt the ruling didn’t end with a victory on either side, Earnest insisted that it was a win for Obama.\n“It will allow millions of women across the country to continue to get the health care coverage that they need,” he said. “And so, this obviously is a, you know, an outcome that we are pleased to see.”\nHe used the incident as an opportunity to demand that the senate hold hearings to confirm Obama’s Supreme Court nominee Merrick Garland, although he admitted that it was unclear that it would have changed the verdict.\nEarnest also admitted that the decision by the court did not offer finality to the case, since it was remanded to lower courts.\n“We’ll obviously continue to engage in the process,” he said.","url":"https://www.breitbart.com/politics/2016/05/16/white-house-claims-victory-supreme-court-punts-little-sisters-obamacare-case/"}
