{"authors":["Australian Associated Press"],"date_download":"2018-10-23 03:50:10","date_modify":"2018-10-23 03:50:10","date_publish":"2017-03-16 14:52:31","description":"The Queensland government placed an immediate ban on the removal of uncooked prawns and other crustaceans from parts of the region on Thursday.","filename":"data/vaneerConsumption/WhitespotdiseasespreadstoprawnsinSEQueensland.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54BC5200000578-0-image-a-98_1489674777338.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320396_White-spot-disease-spreads-prawns-SE-Queensland_1540266610.html","title":"White spot disease spreads to prawns in SE Queensland","title_page":"White spot disease spreads to prawns in SE Queensland | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The future of southeast Queensland's prawn industry remains under a cloud after it was confirmed the white spot virus had spread into the wild.\nThe state government placed an immediate ban on the removal of uncooked prawns and other crustaceans from parts of the region on Thursday.\nIt followed the detection of 31 prawns infected with the virus that causes the disease in Moreton Bay near the Redcliffe Peninsula and Deception Bay, north of Brisbane.\nQueensland Agriculture and Fisheries Minister Bill Byrne said the movement control zone would be enforced for three months and applied to Moreton Bay, from Caloundra to the NSW border and inland past Ipswich.\nThe future of southeast Queensland's prawn industry remains under a cloud after it was confirmed the white spot virus had spread into the wild\n'Green prawns and other uncooked crustaceans will not be permitted to be moved outside the zone,' he said on Thursday.\n'Cooked crustacean products will be permitted to leave the zone.'\nChief biosecurity officer Jim Thompson said the exclusion zone was designed to control the spread of the disease, but it could not be stopped once it was in the wild.\nDr Thompson said the best outcome would be that it died off, but he said there was a real risk it might not be eradicated in southeast Queensland.\nAn independent report into white spot disease, also released on Thursday, addressed what would happen if that occurred.\nBut Mr Byrne said, for now, he was focused on the next three months and ensuring the virus wasn't detected in any more prawns both within and outside the exclusion zone.\nAustralian member of Parliament Bob Katter holds a prawn on the banks of the Logan River, south of Brisbane, Queensland, in February\nMoreton Bay Seafood Association vice president Michael Wood told AAP the restrictions could be devastating for the local industry.\n'If it's got to stay in the area it's going to slow our sales down,' he said on Thursday.\n'It's also going to scare the public.'\nMr Wood said it was critical for customers to know their products were safe and the disease was harmless to humans.\nIt was a point reiterated by Mr Byrne, who said it was the reputation of the industry at stake.\n'There is absolutely no risk whatsoever to human consumption of a white spot-diseased product,' he said, referring to the fact the disease is killed when cooked.\nBoth the minister and Mr Wood urged people not to use imported prawns as fishing bait following suspicions the virus made its way to Queensland from overseas.\nMr Byrne refused to be drawn on the federal government's importation laws, except to say white spot disease did not 'show up here by the hand of God'.\n'Surely the logic is this has come by a pathway by the hand of a man and it didn't come from within Australia,' he said.\nThe detection of the white spot virus in Moreton Bay comes just months after prawn farms along the Logan River were closed following an outbreak of the disease.\nDr Thompson said recent testing in the area had come back negative.\nMr Byrne said prawns in Moreton Bay would not be wiped out by the disease as they were on the farms.","url":"https://www.dailymail.co.uk/news/article-4320396/White-spot-disease-spreads-prawns-SE-Queensland.html"}
