{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 00:18:06","date_modify":"2018-10-23 00:18:06","date_publish":"2016-01-11 09:16:02","description":"The white Maltese from North America proved dogs aren't that different from humans after all when it was filmed looking dazed and confused after eating the THC-infused oil that fell to the floor.","filename":"data/vaneerConsumption/WhiteMaltesedogcantstandupaccidentallyeatingTHCinfusedcoconutoil.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/30069E6300000578-0-image-a-5_1452503419932.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393601_Poor-dog-t-stay-feet-accidentally-lapping-THC-infused-coconut-oil_1540253886.html","title":"White Maltese dog can't stand up accidentally eating THC-infused coconut oil","title_page":"White Maltese dog can't stand up accidentally eating THC-infused coconut oil | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The dog, 'Rascal', made a full recovery according to its owner\nIts hilarious predicament was captured on video filmed in North America\nThe pet accidentally ate the cooking aid after it fell on the floor\nThis is the amusing moment a dog can't stay on his feet after accidentally eating some cannabis coconut oil.\nThe white Maltese lapped up some of his owner's THC-infused oil, which he called 'weed butter', when it dropped on the floor, leaving the animal dazed and confused.\nIt was captured on video, believed to be filmed in North America, falling over twice while its owner and some friends are heard off camera giggling away at its predicament.\nThe white Maltese dog is filmed looking around blankly and struggling to stand upright after eating the butter\nDespite being sat on the floor, it is filmed twice losing its balance and falling over as a result of the drug\nBut the dog, called 'Rascal' still has some of its wits about it as both times it stops itself falling flat on its face\nHis owner also warns the befuddled creature, that he calls 'Rascal', not to make the same mistake again.\nHe said: 'Hey Rascal, is that going to teach you not to eat the weed butter from now on?'\nWhile some people have branded the video cruel, the owner has insisted it was an accident and the dog made a full recovery after food and a good night's rest.\nThe anonymous owner wrote on YouTube: 'Dropped a small glob of THC coconut oil on the kitchen floor and before I could stop him he licked it up and this is the hilarious result.\n'Don't worry ..... after this I fed him pieces of my steak dinner and let him sleep on my pillow for the night so he was extra well taken care of after I stopped recording.'\nCoconut oil has several health benefits thanks to a combination of fatty acids that can kill bacteria and viruses.","url":"https://www.dailymail.co.uk/news/article-3393601/Poor-dog-t-stay-feet-accidentally-lapping-THC-infused-coconut-oil.html"}
