{"authors":["Associated Press"],"date_download":"2018-10-22 23:11:20","date_modify":"2018-10-22 23:11:20","date_publish":"2016-01-29 10:55:02","description":"WASHINGTON (AP) — Ohio Gov. John Kasich, the budget expert with the wry humor and regular-guy style, is coming to the starting line of the nomination process...","filename":"data/vaneerConsumption/WhiteHouseBriefThingstoknowaboutOhiosJohnKasich.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:893960792a6a47dd9703b284b2944797-3bmscybNe842cce83474b547fd72-958_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422515_White-House-Brief-Things-know-Ohios-John-Kasich_1540249880.html","title":"White House Brief: Things to know about Ohio's John Kasich","title_page":"White House Brief: Things to know about Ohio's John Kasich | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"White House Brief: Things to know about Ohio's John Kasich\nWASHINGTON (AP) — Ohio Gov. John Kasich, the budget expert with the wry humor and regular-guy style, is coming to the starting line of the nomination process — the Iowa caucuses — with one of the biggest compliments a presidential candidate can receive: attack ads against him. Gee, thanks, he might say. But the ads by Jeb Bush and an outside group are signs that Kasich's longshot presidential bid has become a threat to other campaigns vying for the establishment mantle. Here's a look at Kasich:\n___\nTHE BRIEF\nRepublican presidential candidate former Florida Gov. Jeb Bush answers a question as Ohio Gov. John Kasich listens during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Charlie Neibergall)\nKasich entered the presidential race just 16 days before the first presidential debate in August with no guarantee that he'd qualify for the stage. His could have been one of the shortest presidential bids in history. Instead, the strong-willed and sometimes abrasive governor jumped into the contest with more than a dozen other hopefuls by casting himself as a conservative who bucks his party on occasion and disdained the sport of bashing Democrat Hillary Clinton.\nIn a year in which outsiders and ideologues rule, Kasich has advocated pragmatism. \"Purpose,\" he said, is \"more important than party.\"\n___\nRESUME REVIEW\nKasich, 63, was raised a Catholic but turned to a more fundamentalist brand of Christianity after his parents were killed by a drunk driver in 1987. He was born in McKees Rocks, Pennsylvania, but left the blue-collar town outside Pittsburgh to attend Ohio State University. As a freshman, he requested a meeting with President Richard Nixon, who obliged.\nKasich defeated an incumbent Democrat in 1978 to become the youngest person elected to the Ohio Senate, at age 26. Four years later, he was elected to the U.S. House, where he served nine terms. Kasich rose to prominence in 1997, when as House budget chairman, he became the chief architect of a deal that balanced the federal budget for the first time in decades.\nA short-lived bid for president in 2000 led Kasich to trade Washington in 2001 for a decade-long stint as an investment banker at Lehman Brothers. In 2010, he narrowly defeated a once-popular Democratic incumbent to become Ohio governor.\nKasich cites his Christian faith for his pragmatic mix of policy positions — favoring income-tax cuts and smaller government while supporting Medicaid expansion under the federal health care law and certain tax increases. That's the focus of the American Future Fund's ad against him in New Hampshire. Says the spot: \"John Kasich: Not a conservative. Not even a moderate. An Obama Republican.\" Kasich says he hasn't abandoned the conservative agenda but redefines it around core American values.\n___\nSIGNATURE ISSUE\nBalancing the federal budget. In addition to building the first balanced budget in years while in the House, he went on as Ohio governor to cut, reshape or privatize much of the state government, erasing a projected $8 billion budget gap and seeing employment restored to pre-recession levels. Labor unions, armed with video of Kasich calling a police officer an idiot, prevailed in a 2011 clash, winning repeal of a law he'd signed curtailing collective bargaining rights for public employees. Kasich is a budget wonk — but as such he endured years of litigation, political resistance and media investigations after he privatized Ohio's economic development department, designing the nonprofit JobsOhio to \"move at the speed of business.\"\nIn March, he announced that Ohio had regained the more than the 406,000 private-sector jobs lost during the recession, a fulfilment of a campaign promise and, as he saw it, a vindication of his effort. Ohio's recovery mirrored national trends. But he said JobsOhio, tax cuts and innovation in government set an example for other states.\n___\nDEBATE DIGEST\nKasich was asked in one debate about his assessment that his rivals' tax and other plans are \"crazy.\" This set off a riff:\n\"To talk about (how) we're just gonna have a 10 percent tithe and that's how we're gonna fund the government? And we're going to just fix everything with waste, fraud, and abuse? Or that we're just going to be great? Or we're going to ship 10 million people out of this country, leaving their children here in this country and dividing families? Folks, we've got to wake up. We cannot elect somebody that doesn't know how to do the job. You have got to pick somebody who has experience, somebody that has the know-how, the discipline.\"\n___\nMOMENT TO REMEMBER\n\"By the way,\" Kasich said at a September debate at the Ronald Reagan Presidential Library, gesturing to the Air Force One backdrop behind the candidates, \"I think I actually flew on this plane with Ronald Reagan when I was a congressman, and his goals, and mine, really are pretty much the same. Lift Americans, unify, give hope, grow America, and restore it is to that great, shining city on a hill.\"\n___\nPLEASE FORGET\nOutlining his national security plan in November, Kasich said that as president, he'd set up a government agency with a \"mandate\" to promote \"Judeo-Christian\" values and counter propaganda from Islamic militants.\nKasich said the new agency would promote human rights, democracy and the freedoms of speech, religion and association.\nBut he drew derision for sounding like he wanted to fight Islamic propaganda with taxpayer-funded American propaganda that espouses Judeo-Christian values — possibly violating the First Amendment's freedom of religion guarantees. He clarified that it need not be a new agency, but an upgrade to the existing Voice of America to \"engage in the war of ideas\" against the Islamic State group.\n___\nONLINE AND SOCIAL MEDIA\nTwitter: https://twitter.com/JohnKasich and https://twitter.com/GovernorKasich\nInstagram: https://instagram.com/johnkasich/\nFacebook: https://www.facebook.com/johnkasich\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3422515/White-House-Brief-Things-know-Ohios-John-Kasich.html"}
