{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-22 22:31:03","date_modify":"2018-10-22 22:31:03","date_publish":"2017-03-10 00:54:04","description":"The 32-year-old former The City star is expecting her first child with husband Tim Rosenman, and on Thursday she shared a teaser of her upcoming video series on Instagram and Youtube.","filename":"data/vaneerConsumption/WhitneyPortstartscandidnewYouTubeblog.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1F0CE400000578-0-image-a-17_1489106522596.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299436_Whitney-Port-starts-candid-new-blog_1540247463.html","title":"Whitney Port starts candid new YouTube blog","title_page":"Whitney Port starts candid new YouTube blog  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Whitney Port is sharing with fans the highs and lows of her very first pregnancy in a candid new video blog series.\nThe 32-year-old is expecting her first child with husband Tim Rosenman, and on Thursday the former The City star shared a teaser of her upcoming video series, which she has called 'I Love My Baby, But I Hate My Pregnancy'.\nWhitney explained in the Youtube video that she and Tim had decided to create the blog to connect with other moms-to-be, and to fill fans in on her day-to-day life as she awaits the arrival of her firstborn.\nScroll down for video\nWhat to expect when she's expecting! Whitney Port is sharing with fans the highs and lows of her very first pregnancy in a candid new video blog series called I Love My Baby, But I Hate My Pregnancy\nThe cute teaser began with Whitney curled up in bed, giggling, as her husband sat behind the camera.\n'OK, look into the camera and say, \"Hi everyone!\"', Tim could be heard saying out of frame as he focused in on his wife of one year.\n'Hi everyone!' Whitney said in between her laughter. 'I haven't been on TV in so long!'\nTim then asked, 'Wanna do an intro? \"Welcome to....Whitney's Pregnancy Blog.\"'\nCamera shy? The reality star was snuggled in her robe as she declared, 'I haven't been on TV in so long!'\nWelcome fans! Port couldn't stop giggling as she introduced her new video series\n'What should I call it?' Whitney asked her husband, before the name came to her. 'I love this baby, but I hate pregnancy.'\nLaughing at herself, she added, 'Welcome to I Love My Baby, but I Hate Pregnancy by Whitney Port. Is that bad?' she asked again, laughing.\n'Hi everyone! I felt extra sh*tty this morning, so Timmy decided to set up a camera and put it at the foot of my bed so I could share with you all the terrible things that are going on with me and my pregnancy,' Whitney told the camera.\nPoking fun: Tim teased his wife as she gestured while chatting to the camera\nTaking five: Port was curled up in bed as she made the video\nGetting in some rest: Whitney explained that she 'felt extra sh*tty this morning'\n'How I'm feeling, what I'm doing, eating, just how I'm dealing with the whole process, and thought that it might be fun to share it with you guys.\n'I'm by no means telling you guys what to do or how to deal with your pregnancy, just thought, from one pregnant woman to another that it would be fun to share the journey with you.'\nWhitney also posted the teaser to Instagram, along with the caption: 'Soooo, Timmy decided to get out his camera and start documenting everything about my first pregnancy,' she explained. 'We both thought it would be a fun thing for our child to see once he or she is old enough. It will be a totally open and honest look into our lives as I cook this tiny thing growing inside me.\nWatch and learn: The reality star invited fans to learn more about her day-to-day life as she awaits the arrival of her first child\nBaby love: The reality star-turned-fashion designer announced just last month on her blog that she and Tim were expecting their first child\n'I can’t wait to share my journey with you all and connect with expecting Moms, any women that are thinking about becoming Moms, and maybe even some Dads going through similar things Timmy will inevitably have to deal with!!! Hahaha.\n'Please comment below on what topics you would like me to cover and really any feedback or advice you might have. We have no clue what we are doing, but excited to learn!'\nThe teaser also included a sonogram image, however it was unclear if the photo was of Whitney's yet-to-be-born child.\nMake yourself at home: The former The City star relaxed inside the couple's home\nMom-to-be! The reality star-turned-fashion designer announced just last month on her blog that she and Tim were expecting their first child\nThe reality star-turned-fashion designer announced just last month on her blog that she and Tim were expecting their first child.\nWhitney and Tim tied the knot in November 2015 after a two year long engagement.\nThey met while Whitney starred on the reality show The City, a spin-off of The Hills, which starred Lauren Conrad.\nTim served as a producer of the show which followed Whitney as she broke into the fashion industry in New York.\nMarital bliss: Whitney and Tim Rosenman tied the knot in November 2015 after a two year long engagement","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299436/Whitney-Port-starts-candid-new-blog.html"}
