{"authors":["Charlie Spiering"],"date_download":"2018-10-30 20:20:44","date_modify":"2018-10-30 20:20:44","date_publish":"2015-06-15 18:15:25","description":"Although rumors had surfaced about the concert, the White House was silent about the event that brought up to 500 people to the event and did not inform the press about it. |","filename":"data/vaneerConsumption/WhiteHouseDefendsPrivatePrinceConcertWith500PeopleTheyDidItOnTheirOwnDime.json","image_url":"https://media.breitbart.com/media/2015/06/GettyImages-182543153.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_15__1540930844.html","title":"White House Defends ‘Private’ Prince Concert With 500 People: ‘They Did It On Their Own Dime’","title_page":"White House Defends ‘Private’ Prince Concert With 500 People: ‘They Did It On Their Own Dime’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"At the White House today, Press Secretary Josh Earnest defended Saturday night’s “private” concert with Prince.\nAlthough rumors had surfaced about the concert, the White House was silent about the event that brought up to 500 people to the event and did not inform the press about it.\nNews of the event quickly leaked on social media – including posts from Seattle Seahawks quarterback Russell Wilson and Rev. Al Sharpton.\nEarnest indicated that the Obama family paid for the event at the White House, telling reporters that the first couple “did it on their own dime.”\nWhen repeatedly questioned about the size and scope of the event, Earnest defended it as an “appropriate” “private social event” on a Saturday night, and that the Obamas wanted a chance to “host some of their friends” at “their own home.”\nEarnest also suggested that since details of the event leaked, it was a sign that Obama was committed to transparency.\n“I think the fact that we’re talking about a private event and the fact that details of this are known, is an indication that the president is committed to being transparent,” he said. “At the same time, the president and the First Lady are going to reserve the right to host private parties at the White House and they did it on their own dime.”\nHe also took a shot at reporters, suggesting that they were offended that they were not invited.\n“Nobody else in here was invited either, there appears to be some angst about that,” he said.","url":"https://www.breitbart.com/politics/2015/06/15/white-house-defends-private-prince-concert-with-500-people-they-did-it-on-their-own-dime/"}
