{"authors":["William Bigelow"],"date_download":"2018-10-30 19:21:20","date_modify":"2018-10-30 19:21:20","date_publish":"2016-01-10 16:43:52","description":"Now that Bill Cosby, 78, has admitted drugging women, allegedly before he committed sexual assault. the White House allowed that it would consider a bill proposing stripping Bill Cosby of his Presidential Medal of Freedom, but still protested that the Administration would not want to set a precedent by “trying to undo medals.” |","filename":"data/vaneerConsumption/WhiteHouseWontCommittoStrippingBillCosbysPresidentialMedalofFreedom.json","image_url":"https://media.breitbart.com/media/2016/01/Bill-cosby-MOF-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_10__1540927280.html","title":"White House Won't Commit to Stripping Bill Cosby's Presidential Medal of Freedom","title_page":"White House Won't Commit to Stripping Bill Cosby's Presidential Medal of Freedom | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Now that Bill Cosby, 78, has admitted drugging women, allegedly before he committed sexual assault, the White House allowed that it would consider a bill proposing stripping Cosby of his Presidential Medal of Freedom. But the administration still protested that it would not want to set a precedent by “trying to undo medals.”\nFifteen Republicans and two Democrats are sponsoring a bill that would allow Barack Obama to revoke Cosby’s medal and would also punish anyone who publicly displayed a medal that had been stripped from them. Cosby was awarded the medal in 2002.\nLast July, when confronted with the question of whether he would strip Cosby of his medal, Obama lamely replied, “There’s no precedent for revoking the medal. We don’t have that mechanism.”\nA draft of the measure from the office of House Republican Paul Gosar, the chief sponsor of the bill, argued, “Cosby has admitted to drugging women in order to satisfy his sexual desires, and, therefore, the federal government should not recognize Cosby with an honor like the Presidential Medal of Freedom.”\nOn Thursday, Gosar was accompanied at a press conference by Executive Director of Promoting Awareness Victim Empowerment (PAVE), Angela Rose. Gosar asserted Cosby’s admission that he had drugged several women left Cosby “outside the bounds of whom we should admire in our society … Like so many Americans, I am sick and tired of watching the rapid decline of our culture right in front of our eyes. It is time to reclaim our nation’s moral compass.” He added, “Revoking Bill Cosby’s Medal of Freedom won’t undo his actions or heal the wounds of his victims, but it will signal to the American people that we will not tolerate such lewd behavior.”\nOn Thursday, White House spokesman Josh Earnest said, “Symbolic commemorations are always difficult to deal with,” then added the white house was worried about creating a precedent by “trying to undo medals.”\nLast week Cosby was charged with felony sexual assault; over 50 women have accused him of drugging and sexually molesting or raping them.","url":"https://www.breitbart.com/politics/2016/01/10/proposal-to-strip-bill-cosby-of-presidential-medal-of-freedom/"}
