{"authors":["Jj Nattrass For Mailonline"],"date_download":"2018-10-23 00:06:46","date_modify":"2018-10-23 00:06:46","date_publish":"2016-01-11 08:34:34","description":"Opting for a flesh-flashing mesh gown, the 30-year-old reality TV star put a rather racy twist on the classic awards gown, as she mingled with the toast of Tinsel Town following the awards 73rd show.","filename":"data/vaneerConsumption/WhitneyPortwearsseethroughmeshgownatGoldenGlobes2016afterparties.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/08/3006257B00000578-0-image-a-15_1452501172372.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393529_Whitney-Port-dares-nearly-bare-racy-mesh-gown-Weinstein-Company-InStyle-Golden-Globes-parties_1540253206.html","title":"Whitney Port wears see-through mesh gown at Golden Globes 2016 after parties","title_page":"Whitney Port wears see-through mesh gown at Golden Globes 2016 after parties | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She shot to fame in her pursuit of a glittering career in fashion on The Hills.\nSo it was little surprise to see Whitney Port competing in the fashion stakes, as she made the rounds on the red carpet at The Golden Globes after parties in Los Angeles, on Sunday night.\nOpting for a flesh-flashing mesh gown, the 30-year-old reality TV star put a rather racy twist on the classic awards gown, as she mingled with the toast of Tinsel Town following the awards 73rd show.\nScroll down for video\nDaring to bare: Whitney Port appeared to be competing for the top-spot in the fashion stakes, as she made the rounds at The Golden Globes after parties in Los Angeles, on Sunday night, in a flesh-flashing mesh gown\nNever one to turn down an invite to the hottest ticket in town, the blonde bombshell strutted her stuff at both The Weinstein Company and Netflix after-party as well as the InStyle And Warner Brothers bash.\nEnsuring that all eyes were on her, Whitney left relatively little to the imagination as she sashayed into the soirees in a figure-hugging, skin-baring ball gown.\nSlipping into the floor-length, see-through frock, the former MTV star left little to the imagination as she flaunted her lithe body, slim curves and toned pins.\nA racy red carpet look: Opting for a flesh-flashing mesh gown, the reality TV star, 30, put a rather racy twist on the classic awards gown, as she mingled with the toast of Tinsel Town following the awards 73rd show\nHowever, the gown managed to merge both eye-catching modern style with classical Hollywood glitz, as it featured a billowing, ruffled trail.\nKeeping her modesty preserved thanks to a strapless, plunging black bodysuit, the star showed off more than a hint of cleavage thanks to the skintight one piece's extreme cut.\nFurther accentuating her incredible figure, the TV star rounded her wardrobe off with a pair of towering black stiletto heels.\nMaking sure she didn't detract from the eye-catching nature of her frock, Whitney accessorised sparsely with just a pair of glittering star-like earrings and a handful of rings.\nWearing her long golden mane scraped back off of her face and into a trailing ponytail, the star ensure her naturally striking features shone through.\nWearing a pale and minimal palette of make-up, Whitney highlighted her features with a liberal application of eyeliner and a flash of berry lipstick.\nBut The City star was not the only one making a bee-line for the top fashion spot at either event as both Katy Perry and Heidi Klum cut sensationally sizzling figures.\nEye-catching frock: Ensuring that all eyes were on her, Whitney left relatively little to the imagination as she sashayed into the soirees in a figure-hugging, skin-baring ball gown and towering stiletto heels","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393529/Whitney-Port-dares-nearly-bare-racy-mesh-gown-Weinstein-Company-InStyle-Golden-Globes-parties.html"}
