{"authors":[],"date_download":"2018-10-22 21:06:34","date_modify":"2018-10-22 21:06:34","date_publish":"2014-05-05 22:40:29","description":"The White House used Cinco de Mayo celebrations on Monday to continue the push for immigration reform and slam Republicans in the House for blocking a comprehensive reform bill.","filename":"data/vaneerConsumption/WhiteHouseUsesCincodeMayotoRenewPushforImmigrationReform.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/421896/140505-obama_cinco_immigration-1839_0cd87a5b84d1878c44e53a3acd4384f0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_white-house_white-house-uses-cinco-de-mayo-renew-push-immigration-reform-n97656_1540242394.html","title":"White House Uses Cinco de Mayo to Renew Push for Immigration Reform","title_page":"White House Uses Cinco de Mayo to Renew Push for Immigration Reform ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe White House used Cinco de Mayo celebrations on Monday to continue the push for immigration reform and slam Republicans in the House for blocking a comprehensive reform bill passed by the Senate last year.\n\"So far, the Republicans in the House have refused to let meaningful immigration reform to move forward at all,” Obama said during a reception at the White House. “We know there are Republicans in the House who want to do the right thing.\"\nThe president called on those in attendance to pressure Congress in the coming months to address an overhaul of the nation's immigration laws, saying it is time the GOP \"catch up with the rest of the country.\"\nThe Senate passed an immigration bill in 2013, but the Republican-led House has failed to move on the legislation. House Speaker John Boehner has said Congress cannot trust the administration to implement the law as passed, citing changes to the implementation of the Affordable Care Act as proof.\nEarlier in the day, Vice President Joe Biden even more forcefully called for reform at a breakfast highlighting the success of Hispanic Americans.\n“It’s time for [Boehner] to stand up, stand up and not let the minority—I think it’s a minority—of the Republican Party in the House keep us from moving in a way that will change the circumstances for millions and millions of lives,” Biden said.","url":"https://www.nbcnews.com/politics/white-house/white-house-uses-cinco-de-mayo-renew-push-immigration-reform-n97656"}
