{"authors":["Associated Press"],"date_download":"2018-10-22 23:17:38","date_modify":"2018-10-22 23:17:38","date_publish":"2016-01-29 10:57:07","description":"IOWA CITY, Iowa (AP) — Republican presidential candidate Donald Trump is counting on a strong showing in Monday's Iowa caucuses to prove his convention-busti...","filename":"data/vaneerConsumption/WhiteHouseBriefThingstoknowaboutDonaldTrump.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422355_White-House-Brief-Things-know-Donald-Trump_1540250258.html","title":"White House Brief: Things to know about Donald Trump","title_page":"White House Brief: Things to know about Donald Trump | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"White House Brief: Things to know about Donald Trump\nIOWA CITY, Iowa (AP) — Republican presidential candidate Donald Trump is counting on a strong showing in Monday's Iowa caucuses to prove his convention-busting combination of bluster and unpredictability is a winning formula in the 2016 race for the Republican presidential nomination. Here's a quick look at some things to know about him.\n___\nTHE BRIEF\nA year ago, the reality television star and billionaire real estate developer was largely dismissed as an attention-seeking showman who had little intention of actually entering the race. But since announcing his candidacy in June at Trump Tower, he has upended the presidential contest as longtime Republican observers look on in awe.\nTrump's campaign has been ignited by a series of controversial statements, each seemingly more outrageous than the last. He's said the Mexican government sends criminals across the U.S. border illegally. He's questioned Arizona Sen. John McCain's status as a war hero. He's called for temporarily banning Muslims from entering the country — a religious test derided across the globe. But while critics condemn each successive statement, Trump has won over new fans and remained atop of the GOP field in preference polls, tapping into the angers and frustrations of an electorate deeply concerned about America's place in the world.\n___\nRESUME REVIEW\nThe son of a New York real estate developer, Trump grew up in an upper-income section of Queens and quickly joined his father's business after graduating from The Wharton School of the University of Pennsylvania. Lured by the tall buildings and bright lights, Trump moved across the East River and set his sights on Manhattan.\nOver the following decades, Trump's reputation grew, not only for his assets but for his made-for-New-York-tabloid exploits. He became a national household name with the success of the hit television show, \"The Apprentice,\" and earned conservative credentials as he questioned whether President Barack Obama was born outside the United States.\n___\nSIGNATURE ISSUE\nThe campaign promise best associated with Trump is his plan to build a wall along the length of the U.S. Southern border to stop the flow of migrants from Mexico. And, Trump says, he'll make the Mexican government pay for it. Trump has also vowed to deport all of the estimated 11 million people living in the country illegally. While he says the deportations will be done \"humanely,\" he's advocated using deportation squads that would search door-to-door. Trump says his wall would include a \"big beautiful door\" so that the \"good\" immigrants can re-enter the country legally. He has yet to lay out specifics of how the federal government would manage that process.\n___\nDEBATE DIGEST\nIt began with a simple question: \"Is there anyone on stage, and can I see hands, who is unwilling tonight to pledge your support to the eventual nominee of the Republican Party and pledge to not run an independent campaign against that person?\"\nWith Trump's raised hand, he stole the show at that first Republican debate and made it clear that he was not playing by the usual rules.\nLater in that same debate, he began his showdown with Fox News anchor Megyn Kelly, who confronted Trump over his history of making derogatory comments about women.\nTrump responded by denouncing what he called a culture of political correctness. \"I don't frankly have time for total political correctness,\" he said. \"And to be honest with you, this country doesn't have time either.\"\n___\nMOMENT TO REMEMBER\nAs rival Ben Carson rose in some Iowa polls in November, Trump delivered an epic takedown of the retired neurosurgeon at one of his campaign rallies. In an effort to cast doubt on one aspect of Carson's life story, Trump dramatically re-enacted a scene from Carson's autobiography, in which he, as a young man, attempted to stab a friend or family member in the stomach. In Carson's telling, the blade is miraculously stopped by the victim's belt.\n\"So I have a belt ... it's going in because the belt moves this way. It moves this way, it moves that way,\" Trump said, dramatically acting out the scene.\n\"How stupid are the people of Iowa?\" he later railed. \"How stupid are the people of the country to believe this crap?\"\n___\nPLEASE FORGET\nThat time he joked about dating his daughter, if only the two weren't related. A series of derogatory comments aimed at women. Dozens of potentially offensive tweets, including several re-tweets of accounts linked to white supremacists.\nTrump's refusal to play by the rules of political correctness has earned him legions of loyal supporters. But his comments have also raised questions among critics about his temperament and whether he has the judgment to be president.\n___\nONLINE AND SOCIAL MEDIA\nTwitter:\nhttps://twitter.com/realDonaldTrump\nInstagram:\nwww.instagram.com/realdonaldtrump\nFacebook:","url":"https://www.dailymail.co.uk/wires/ap/article-3422355/White-House-Brief-Things-know-Donald-Trump.html"}
