{"authors":["The Associated Press"],"date_download":"2018-10-30 17:51:02","date_modify":"2018-10-30 17:51:02","date_publish":"2018-10-30 00:00:00","description":"BOSTON — James \"Whitey\" Bulger, the murderous Boston gangster who benefited from a corrupt relationship with the FBI before spending 16 years as one of America's most wanted men, has died in federal prison. He was 89.","filename":"data/vaneerConsumption/WhiteyBulgerBostongangsterfounddeadinprisonat89.json","image_url":"https://media.arkansasonline.com/img/photos/2018/10/30/AP18303609036100_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30__1540921862.html","title":"Whitey Bulger, Boston gangster, found dead in prison at 89","title_page":"Whitey Bulger, Boston gangster, found dead in prison at 89","title_rss":"NULL","source_domain":"arkansasonline.com","text":"FILE - These 1953 file Boston police booking photos provided by The Boston Globe shows James \"Whitey\" Bulger after an arrest. Officials with the Federal Bureau of Prisons said Bulger died Tuesday, Oct. 30, 2018, in a West Virginia prison after being sentenced in 2013 in Boston to spend the rest of his life in prison. (Boston Police/The Boston Globe via AP)\nBOSTON — James \"Whitey\" Bulger, the murderous Boston gangster who benefited from a corrupt relationship with the FBI before spending 16 years as one of America's most wanted men, has died in federal prison. He was 89.\nBulger was found unresponsive Tuesday morning at the U.S. penitentiary in West Virginia where he'd just been transferred, and a medical examiner declared him dead shortly afterward, according to the Federal Bureau of Prisons. Authorities did not immediately release a cause of death but said the FBI was notified and is investigating.\nBulger, the model for Jack Nicholson's ruthless crime boss in the 2006 Martin Scorsese movie, \"The Departed,\" led a largely Irish mob that ran loan-sharking, gambling and drug rackets. He also was an FBI informant who ratted on the New England mob, his gang's main rival, in an era when bringing down the Mafia was a top national priority for the FBI.\nBulger fled Boston in late 1994 after his FBI handler, John Connolly Jr., warned him he was about to be indicted. With a $2 million reward on his head, Bulger became one of the FBI's \"Ten Most Wanted\" criminals, with a place just below Osama bin Laden.\nWhen the extent of his crimes and the FBI's role in overlooking them became public in the late 1990s, Bulger became a source of embarrassment for the FBI. During the years he was a fugitive, the FBI battled a public perception that it had not tried very hard to find him.\nAfter more than 16 years on the run, Bulger was captured at age 81 in Santa Monica, California, where he had been living in a rent-controlled apartment near the beach with his longtime girlfriend, Catherine Greig.\nIn 2013, he was convicted in the slayings, as well as extortion, and money-laundering after a sensational racketeering trial that included graphic testimony from three former Bulger cohorts: a hit man, a protege and a partner. He was sentenced nearly five years ago to two consecutive life sentences plus five years.\nBulger had just been moved to USP Hazelton, a high-security prison with an adjacent minimum security satellite camp in Bruceton Mills, West Virginia. He had been in a prison in Florida before a stopover at a transfer facility in Oklahoma City. Federal Bureau of Prisons officials and his attorney had declined to comment on why he was being moved.\nBulger, nicknamed \"Whitey\" for his bright platinum hair, grew up in a gritty South Boston housing project and became known as one of the most ruthless gangsters in Boston. His younger brother, William Bulger, became one of the most powerful politicians in Massachusetts, leading the state Senate for 17 years.\nIn working-class \"Southie,\" Jim Bulger was known for helping old ladies across the street and giving turkey dinners to his neighbors at Thanksgiving. He had a kind of Robin Hood-like image among some locals, but authorities said he would put a bullet in the brain of anyone who he even suspected of double-crossing him.\n\"You could go back in the annals of criminal history and you'd be hard-pressed to find anyone as diabolical as Bulger,\" said Tom Duffy, a retired state police major who investigated Bulger.\n\"Killing people was his first option. They don't get any colder than him,\" Duffy said after Bulger was finally captured in June 2011.\nBulger was accused of strangling Debra Davis, the 26-year-old girlfriend of his partner, Stephen \"The Rifleman\" Flemmi, and Deborah Hussey, also 26, the daughter of Flemmi's common-law wife. In both cases, Bulger insisted on pulling out the women's teeth so they would be difficult to identify, Flemmi testified.\nDuring a search of his Santa Monica apartment, agents found over $800,000 in cash and more than 30 guns, many hidden in holes in the walls. A property manager at the building said Bulger and Greig, who used the names Charles and Carol Gasko, had lived there for 15 years and always paid the rent-controlled rate of $1,145 a month in cash.\nThey were caught days after the FBI began a new publicity campaign focusing on Greig. The daytime TV announcements showed photos of Greig and noted that she was known to frequent beauty salons and have her teeth cleaned once a month.\nA woman from Iceland who knew Bulger and Greig in Santa Monica saw a report on CNN about the latest publicity campaign and called in the tip that led agents to them. The Boston Globe identified the tipster as a former Miss Iceland, a former actress who starred in Noxzema shaving cream commercials in the 1970s.\nBulger, a physical fitness buff, had been taken to a Boston hospital from his jail cell at least three times, complaining of chest pains, since being brought back to Boston to stand trial.","url":"https://www.arkansasonline.com/news/2018/oct/30/whitey-bulger-boston-gangster-found-dead-prison-89/"}
