{"authors":["J. Taylor Rushing","U.S. Political Reporter","For Dailymail.Com"],"date_download":"2018-10-23 02:49:02","date_modify":"2018-10-23 02:49:02","date_publish":"2016-01-11 15:18:26","description":"A nationally prominent white supremacist leader has begun making robocalls in Iowa urging Republican voters to support Donald Trump in the Feb. 1 caucuses.","filename":"data/vaneerConsumption/WhitenationalistgroupmakesrobocallsforDonaldTrumpinIowa.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/3001764A00000578-0-image-a-5_1452525346332.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394066_White-nationalist-group-makes-robo-calls-Donald-Iowa-insists-didn-t-authorize-telling-voters-don-t-need-Muslims_1540262942.html","title":"White nationalist group makes robo-calls for Donald Trump in Iowa","title_page":"White nationalist group makes robo-calls for Donald Trump in Iowa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A nationally prominent white supremacist leader has begun making robocalls in Iowa urging Republican voters to support Donald Trump in the Feb. 1 caucuses.\nJared Taylor, publisher of the white nationalist Web site American Renaissance, is making the calls on behalf of a new political committee called the American National Super PAC, which filed a statement of organization with the Federal Election Commission earlier this month.\nTaylor identifies himself in the call and goes on to say, “I urge you to vote for Donald Trump because he is the one candidate who points out that we should support immigrants who are good for America.'\n“We don’t need Muslims. We need smart, well-educated white people who will assimilate to our culture. Vote Trump.'\nScroll down for videos\nGOP presidential front-runner Donald Trump is receiving help from prominent white supremacist groups in his campaign, including robocalls this month in the crucial state of Iowa\nJared Taylor, a white supremacist author and Web site publisher, has recorded robocalls to promote Trump among Iowa Republicans\nThe calls, first reported by Talking Points Memo, also include an endorsement of Trump by Donald Tan, a pastor and a conservative Christian talk show host who is lending his support to Trump because had been summoned by God, according to a press release about the robocalls.\nThe calls end with a brief statement by American National Super PAC treasurer William Johnson, who identifies himself as a 'farmer and white nationalist' and adds that Trump himself had not authorized the calls.\nThe Trump campaign has not responded to requests for comment, and Trump has not made any detailed statements about the robocalls on the campaign trail in recent days. He is a neck-and-neck battle with GOP presidential hopeful Ted Cruz in Iowa, which represents the first primary contest in the 2016 election.\nTaylor rose to prominence in the 1990s as a spokesman for the Council of Conservative Citizens, a latter-generation version of the White Citizens Councils, a group which fought desegregation efforts in the 1950s and 1960s.\nDylann Roof, the South Carolina man who murdered nine people at a church in Charleston last summer, cited CCC dogma in his manifesto, Taylor returned the favor by saying Roof had 'legitimate grievances' at the time.\nIn an interview with The New Yorker last summer, Taylor said Trump 'would repudiate any association with people like me, but his support comes from people who are more like me than he might like to admit.'\nTaylor at the 2006 American Renaissance annual conference in Herndon, Virginia\nTrump's support from white supremacist groups has been building throughout the election season, capped by a conference held in Washington over Halloween in which he was praised as an 'icebreaker' candidate.\n'He’s de-legitimized—and I think to a degree he’s humiliated—mainstream conservatives, the elite of the GOP, and certainly the kind of fuddy-duddy conservative movement types, the National Review,' Spencer told The Daily Beast at the time.\n'It’s not so much Trump per se. It’s not like we think he’s going to save the world. It’s like we finally felt like we’re breaking through, that something’s breaking out, and what comes after Trump is going to be interesting.'\nFor his part, Tan quotes the Bible in the robocalls to back up his support for Trump.\n'First Corinthians states, 'God chose the foolish things of this world to shame the wise and God chose the weak things of this world to shame the strong,' Tan says. 'For the Iowa caucuses, please support Donald Trump.'\nAccording to an average of polls as compiled by Real Clear Politics, Trump is trailing Cruz in Iowa. The Texas senator has 30.2 percent of the GOP field, while Trump is runner-up at 27.4 percent and Florida Sen. Marco Rubio is in a distant third place at 12.6 percent.","url":"https://www.dailymail.co.uk/news/article-3394066/White-nationalist-group-makes-robo-calls-Donald-Iowa-insists-didn-t-authorize-telling-voters-don-t-need-Muslims.html"}
