{"authors":["Bill Chappell"],"date_download":"2018-10-23 01:08:59","date_modify":"2018-10-23 01:08:59","date_publish":"2017-01-31 00:00:00","description":"President Trump \"is determined to protect the rights of all Americans, including the LGBTQ community,\" the White House says.","filename":"data/vaneerConsumption/WhiteHouseSaysObamasOrderOnLGBTQRightsWillStayInEffect.json","image_url":"https://media.npr.org/assets/img/2017/01/31/gettyimages-543163168_wide-2a6b5b872fd8d0f1763f1a32b6d666f370e60ddf.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2017_01_31_512606452_white-house-says-obamas-order-on-lgbtq-rights-will-stay-in-effect_1540256939.html","title":"White House Says Obama's Order On LGBTQ Rights Will Stay In Effect","title_page":"White House Says Obama's Order On LGBTQ Rights Will Stay In Effect : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"White House Says Obama's Order On LGBTQ Rights Will Stay In Effect\nEnlarge this image toggle caption Bryan R. Smith/AFP/Getty Images Bryan R. Smith/AFP/Getty Images\nAn executive order protecting gays and lesbians who work for federal contractors \"will remain intact\" at President Trump's direction, the White House says. The move could allay concerns that Trump might end recently adopted protections against an anti-LGBTQ workplace.\nThe White House announced the move in a relatively short statement early Tuesday, saying that the president \"is determined to protect the rights of all Americans, including the LGBTQ community.\"\nThe announcement comes after reports that the White House was considering a new executive order that would undo former President Barack Obama's 2014 executive order that gave new protections to gay and transgender people. When it was signed, the order applied to 28 million workers — roughly a fifth of America's workforce.\nIn today's statement, the White House says, \"The President is proud to have been the first ever GOP nominee to mention the LGBTQ community in his nomination acceptance speech, pledging then to protect the community from violence and oppression.\"\nTrump's decision largely conforms with his election campaign, in which he didn't often seek to highlight either gay rights or restrictions.\nThe new president's plan for his first 100 days didn't mention taking actions to strip LGBTQ rights or protections, but Trump did list as his first priority the canceling of \"every unconstitutional executive action, memorandum and order issued by President Obama.\"\nWhile the persistence of the executive order suggests Trump agrees with Obama's action, civil rights activists have worried that the president might appoint a U.S. Supreme Court justice who has ruled against gay rights. At 8 p.m. ET Tuesday, Trump is scheduled to name his pick to replace the late Justice Antonin Scalia.\nAfter Trump's election, activists on both sides of the issue wondered how his administration might treat legal claims of \"religious liberty,\" a phrase that has been invoked by those who oppose LGBTQ discrimination protections and, in many cases, gay marriage — and who say that adjusting to new federal laws requires them to compromise their beliefs.","url":"https://www.npr.org/sections/thetwo-way/2017/01/31/512606452/white-house-says-obamas-order-on-lgbtq-rights-will-stay-in-effect"}
