{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:44:42","date_modify":"2018-10-30 19:44:42","date_publish":"2015-03-18 17:04:42","description":"White House spokesman Josh Earnest said on Tuesday that the chances of securing a nuclear deal with Iran are currently 50/50 “at best.”","filename":"data/vaneerConsumption/WhiteHouseSaysIranDeal5050asNegotiationsEnterDeadlinesStage.json","image_url":"https://media.breitbart.com/media/2015/02/Iran-nuke-reactor-bike-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_18__1540928682.html","title":"White House Says Iran Deal 50/50 as Negotiations Enter Deadlines Stage","title_page":"White House Says Iran Deal 50/50 as Negotiations Enter Deadlines Stage | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"White House spokesman Josh Earnest said on Tuesday that the chances of securing a nuclear deal with Iran are currently 50/50 “at best,” as the P5+1 negotiators have until March 31 to agree to a basic framework, and then July 1 to sign off on a complete deal.\n“In the mind of the president the odds have not moved,” and “some of the most difficult issues… have yet to be resolved,” said Earnest, according to AFP.\nHowever, Iran’s nuclear chief, Ali Akbar Salehi, said that “90 percent of the technical issues” for an agreement have been settled. “In most of the issues we have come to mutual agreements — we have differences only in one major issue which we will try to solve in this evening’s meeting,” revealed Salehi.\nThe Obama administration hopes that an agreement will convince the dictatorial Aytaollah’s regime in Iran to forgo its pursuit of a fully-functional nuclear weapons program.\nU.S. Secretary of State John Kerry met with his counterpart, Iranian Foreign Minister Javad Zarif, for multiple hours on both Monday and Tuesday. AFP reports that Wednesday will continue with more long meetings between Iranian officials and the six world powers.\nWhile the White House remains optimistic, reports have revealed that the majority of Congress, even many democrats, remain highly skeptical that the Obama Administration can pull off a “good deal” for America’s national security interests.\nThe United States has been engaged in official talks with Iran for well over a year. Even as Iran has agreed to certain principles regarding nuclear enrichment, they have already violated the terms of the agreement on multiple occasions.","url":"https://www.breitbart.com/national-security/2015/03/18/white-house-says-iran-deal-5050-as-negotiations-enter-deadlines-stage/"}
