{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:09:43","date_modify":"2018-10-30 18:09:43","date_publish":"2018-07-20 04:16:52","description":"Companies and associations pledged to President Trump to provide job training to 3.8 million American workers over 5 years.","filename":"data/vaneerConsumption/WhiteHousePledgestoTrain38MillionNewAmericanWorkers.json","image_url":"https://media.breitbart.com/media/2018/07/Trump-Pledges-Job-Training-Brendan-Smialowski-AFPGetty-Images.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_19__1540922983.html","title":"White House Pledges to Train 3.8 Million New American Workers","title_page":"White House Pledges to Train 3.8 Million New American Workers","title_rss":"NULL","source_domain":"breitbart.com","text":"Companies and associations gathered with President Donald Trump, Ivanka Trump, and American workers at the White House Thursday to announce pledges to provide on-the-job and vocational training to nearly four million workers over the next five years.\nIvanka Trump spoke first to the packed White House East room crowd, including company and association leaders and American workers. She has been traveling across the country, meeting Americans and working with members of Congress to reauthorize the Perkins Act.\nSeveral high school graduates shared their stories of participating in the Pathways in Technology (P-TECH) program. Each graduated high school with more than 20 college credits and interned in the areas of science, manufacturing, and electrical engineering.\nSome members of the President’s cabinet attended the event, as did a few members of Congress and state elected officials.\nPresident Trump then took to the podium, recognizing all those gathered for the event for the same goal of training and hiring American workers. He recounted the “economic miracle” under his administration, including historic lows in American unemployment for several segments of the population. He said to keep the “miracle going” the country must “invest in jobs training and vocational eduction.”\n“We want every American to have the chance to earn a great living doing a great job that they love where they wake up in the morning and they can’t get to work fast enough,” said Trump.\nTwenty-three companies and associations joined the president with pledges to expand apprenticeships, providing on-the-job training and vocational education for a combined 3,817,700 Americans. Trump noted their original goal was to get pledges totaling 500,000, a number far exceeded with Thursday’s pledges.\nTrump joked as he put together that they were pledging “apprenticeships” and his former television program was called The Apprentice.\nThe president brought up three American workers to tell their stories: an electrician’s apprentice, a hotel and lodging association’s management apprentice, and a truck driver who is a military veteran.\nThe president said it’s never been a better time to hire and grow in America:\nAmerica’s strength, America’s heart, and America’s soul is found in our people. It’s their love, their pride, and their patriotism that makes this magnificent land our beloved home. And together with the help of everyone in this room, we will truly make America greater than ever before.\nPresident Trump then signed the new executive order establishing the President’s National Council for the American Worker. The council will be co-chaired by the Secretary of Commerce, Secretary of Labor, Assistant to the President for Domestic Policy, and the Advisor to the President overseeing the Office of Economic Initiatives. Other council members will include some cabinet secretaries and other administration officials specified in the order. There will also be an “outside advisory board of industry leaders and experts” whose names are yet to be revealed.\nMichelle Moons is a White House Correspondent for Breitbart News — follow on Twitter @MichelleDiana and Facebook","url":"https://www.breitbart.com/politics/2018/07/19/white-house-pledges-to-train-3-8-million-new-american-workers/"}
