{"authors":["Alex Swoyer"],"date_download":"2018-10-30 19:17:32","date_modify":"2018-10-30 19:17:32","date_publish":"2015-04-14 19:03:59","description":"President Barack Obama’s White House is beginning to show signs it may fold under congressional pressure on the deal it struck with Iran over nuclear arms. |","filename":"data/vaneerConsumption/WhiteHouseShowsSomeLegOnIranMaybeWillingToWait30DaysForCongressButNot60.json","image_url":"https://media.breitbart.com/media/2015/04/ap_robert-menendez-bob-corker_ap-photo-e1428945780934.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_14__1540927052.html","title":"White House Shows Some Leg On Iran: Maybe Willing To Wait 30 Days For Congress, But Not 60","title_page":"White House Shows Some Leg On Iran: Maybe Willing To Wait 30 Days For Congress, But Not 60 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Barack Obama’s White House is beginning to show signs it may fold under congressional pressure on the deal it struck with Iran over nuclear arms.\nThe White House said it might be willing to wait 30-days for Congressional approval of the Iran deal, but disagrees with the 60-day provision in Sen. Bob Corker’s (R-TN) bipartisan Iran Nuclear Agreement Review Act of 2015. The Senate Foreign Relations Committee will vote on the bipartisan measure Tuesday afternoon, and it is expected to pass. There is also expected to be widespread bipartisan support for it throughout the Senate, meaning that even Democrats are chilled by Obama’s negotiations with the Iranian regime outside the purview of Congress.\nWhite House press secretary Josh Earnest addressed the measure at a press briefing Tuesday, saying the shortening of the review period and clarifying Congress’s role would address some of President Obama’s concerns, but he did not address a veto threat.\n“If we arrived at a place where the bill that is passed by Foreign Relations Committee essentially is a vote to vote later on congressional sanctions — and not a decision on whether or not to enter the agreement — that would certainly resolve some of the concerns we’ve addressed,” Earnest said, according to Politico.","url":"https://www.breitbart.com/politics/2015/04/14/white-house-shows-some-leg-on-iran-maybe-willing-to-wait-30-days-for-congress-but-not-60/"}
