{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:51:07","date_modify":"2018-10-30 19:51:07","date_publish":"2015-11-12 17:48:30","description":"Obama \"assigned White House lawyers\" to find a way executive action can be used to expand background checks to include private gun sales.","filename":"data/vaneerConsumption/WhiteHouseSeeksExecutiveActiononBackgroundChecks.json","image_url":"https://media.breitbart.com/media/2015/04/gun-store-background-checks-gun-control-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_12__1540929067.html","title":"White House Seeks Executive Action on Background Checks","title_page":"White House Seeks Executive Action on Background Checks","title_rss":"NULL","source_domain":"breitbart.com","text":"On November 12 a CBS News report focused on Everytown for Gun Safety’s efforts to secure more gun control revealed that President Obama has “assigned White House lawyers” to look for a way that executive action can be used to expand background checks to include private gun sales or at least some sales by private gun owners.\nBreitbart News previously reported that Obama was weighing the use of an executive order to expand background checks in the wake of the Umpqua Community College attack. The gunman in that attack passed a background check for the weapons he used.\nAccording to CBS News, Michael Bloomberg’s Everytown is being given the opportunity to present their gun control plan to the White House today, and that will include include urging Obama to go around Congress with an executive order on background checks. Everytown wants checks expanded to cover private gun sellers “who make occasional sales,” but they provide no figure to indicate how many gun sales would be required to meet the threshhold of “occasional” seller. Rather, Everytown simply describes persons who “[make’ occasional sales…of firearms for the enhancement of a personal collection or for a hobby” and who do so without having to get a permit from the government.\nWhen Obama first floated the idea of using an executive order to accomplish this, NBC News reported that “50 or 100 guns a year [would be] the threshold to trigger” the new background check “requirements.” But they stressed that the administration had “not formally settled on a number.”\nIt appears that Everytown now wants the Obama administration to require background checks not based on the number of guns sold, but on the length of time a gun is owned before it is sold.\nTo secure this approach, Everytown is asking the Obama administration to provide a legal definition for “personal collection” of firearms. If they can get this, they hope to at least secure an expansion of background checks to cover privately sold firearms that fall outside the “personal collection” designation. For example, Everytown would like the president to declare that a firearm has to be owned for a certain period of time–one full year, for example–before it can be considered part of a personal collection and therefore outside the purview of background checks.\nIt should be noted that Americans have been selling guns privately since 1791, regardless of the amount of time they might have owned the gun prior to selling it. But with Bloomberg’s help, Obama is looking for a way to change that, so that he leaves office with a background check on every gun sale, retail or private.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/11/12/white-house-focused-executive-action-background-checks-private-sales/"}
