{"authors":["Virginia Hale"],"date_download":"2018-10-30 22:04:37","date_modify":"2018-10-30 22:04:37","date_publish":"2018-06-28 15:37:38","description":"By 2021, white Britons will be a minority in Birmingham, where already less than a third of schoolchildren are white.","filename":"data/vaneerConsumption/WhiteBritishWillSoonBeMinorityinUKsSecondLargestCity.json","image_url":"https://media.breitbart.com/media/2018/01/Theresa-May-Campaigns-On-The-Conservative-Battle-Bus-Day-Five.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_06_28__1540937077.html","title":"White British Will Soon Be Minority in UK’s Second Largest City","title_page":"White British Will Soon Be Minority in UK’s Second Largest City","title_rss":"NULL","source_domain":"breitbart.com","text":"By the time of the next census in 2021, white Britons will be a minority in Birmingham, where already in 2013 less than a third of schoolchildren were recorded as having white ethnicity, an official report has said.\nBirmingham City Council’s community cohesion strategy states the city is “soon to become majority minority”, noting in the report that figures from the last census already showed 60 per cent of residents aged under-18 had a foreign background.\nMore than half of its population of more than 1.2 million people will class themselves as non-white British when the next census rolls around, up from 42.1 per cent in 2011, according to the report.\nWhile noting that neighbourhoods suffering from “long term, persistent deprivation” are a problem for Birmingham, along with a “shrinking affordable housing sector”, the strategy boasts that the city’s “super-diverse” demographics are an asset.\nThis shocking message appeared in a British city https://t.co/QInbEF6Vkc — Breitbart London (@BreitbartLondon) August 17, 2017\n“Ethnic diversity can bring many benefits such as transnational trading links and high levels of cultural resource,” says the report, which was tabled to the cabinet’s council on Tuesday. “Birmingham has benefited from its diverse migrant communities who have settled in the city and successfully contributed to its economic vitality.”\nWhile it reports “greater levels of disadvantage” in areas of the city with a “high concentration” of ethnic minority inhabitants, the strategy — which alleges authorities need to tackle “segregation” — suggests that geographical location is to blame for inequality, citing ‘neighbourhood effect’.\nAnother problem highlighted is unemployment, with the rate in Birmingham 10 per cent higher than the UK average. The city has a “skills deficit”, the report said, noting that “a particularly high percentage of Pakistani and Bangladeshi residents have no qualifications” while more than 47,000 residents are unable to speak English.\nIn its report, the council brags about making the metropolis a “city of sanctuary” for illegal immigrants, with equalities chief Councillor Tristan Chatfield stating that “Birmingham is committed to creating a culture of hospitality and support to people seeking refuge and asylum”.\nFrench Islamists are moving to UK cities like Birmingham to have the ‘freedom’ to practice radical Islam. https://t.co/Sw9YQANgys — Breitbart London (@BreitbartLondon) May 31, 2017\nWith almost a quarter of its population born abroad, the extent to which mass migration has transformed Birmingham was revealed in a 2013 report which showed white pupils accounting for just 31 per cent of the city’s school population.\nAccording to the Community Safety Partnership (BCSP), a multi-agency body including West Midlands Police and the city council, South Asian students comprised the single biggest ethnic group with 44 per cent, while black pupils were 13 per cent of the total.\nBirmingham has been struggling to deal with a massive surge in violent crime in recent months, as Breitbart London reported this week, with local media alleging shoppers are afraid to tread parts of the city centre against a backdrop of random machete attacks and mass brawls.\nA 43-year-old security worker and self-described “big lad” said that working in the city had taken its toll, telling the Daily Mail: “I left Birmingham because of the violence, I left because it was all too much and I didn’t feel safe. I haven’t been back since.”\n‘I’m Used to It, This Is a Very Violent Place’ – Witness to Birmingham Gang Brawl Ended by Stabbing, Acid Attack https://t.co/KNliS6Tk5P — Breitbart London (@BreitbartLondon) March 31, 2018\nThe report comes amid a new government statistical report which shows that mass migration has pushed the UK population over 66 million, following a one-year population increase equivalent to a city the size of Cardiff, the Welsh capital. Of those new people in the United Kingdom, over half were migrants.","url":"https://www.breitbart.com/europe/2018/06/28/report-white-minority-uk-largest-city/"}
