{"authors":[],"date_download":"2018-10-22 21:51:06","date_modify":"2018-10-22 21:51:06","date_publish":"2014-06-06 19:33:59","description":"Climate change is aggravating asthma and causing deadly heat and floods, the White House said in a report promoting new limits on carbon pollution.","filename":"data/vaneerConsumption/WhiteHouseClimateChangeIsRuiningOurHealth.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/493541/140606-global-warming-jhc-1717_37917c313b93be814392cffebbfe0907.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-news_white-house-climate-change-ruining-our-health-n124796_1540245066.html","title":"White House: Climate Change Is Ruining Our Health","title_page":"White House: Climate Change Is Ruining Our Health","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nClimate change is aggravating asthma and allergies and killing more people through extreme heat and floods, the White House said in a report Friday promoting new federal limits on carbon pollution.\n\"We have a moral obligation to leave our children a planet that's not irrevocably polluted or damaged,\" the report said, adding that in addition to kids, other members of society — the elderly, those with chronic illnesses, and the poor — were also particularly vulnerable to the health effects of climate change.\nThe percentage of Americans with asthma has more than doubled in the past three decades as air quality has decreased, the report said. The warmer air temperatures have increased allergies. And extreme weather events like heavy precipitation, droughts, and heatwaves are increasing in frequency and duration.\nThe sobering report comes days after the Obama administration proposed a plan that aims to reduce carbon dioxide emissions from existing power plants 30 percent by 2030.\n\"This is something that is important for all of us, as parents, as grandparents, as citizens, as folks who care about the health of our families and also want to make sure that future generations are able to enjoy this beautiful blue ball in the middle of space that we're a part of,\" Obama said Monday.\nAbout 40 percent of American's carbon pollution comes from power plants, according to the White House.\nEnvironmental advocates cheered the plan, but it has already met opposition: Republicans branded it a \"national energy tax\" and Senate Minority Leader Mitch McConnell of Kentucky called it a \"dagger in the heart of the American middle class.\"\nFriday's report shared disturbing statistics on the health effects of climate change, including:\nExtreme heat exposure caused more than 7,800 deaths in the United States from 1999 to 2009\nLyme disease cases have increased over time, with five states reporting 50 to 90 more cases per 100,000 people than they did in 1991\nAllergy seasons are lengthening due to there being more frost-free days and warmer temperatures, increasing, for example, Minneapolis' ragweed season by 21 days per year and Fargo, North Dakota's by 19 days\nThe Environmental Protection Agency's proposed guidelines for carbon pollution from power plants \"will not only help reduce the health impacts from climate change; it will also lead, through the measures implemented to achieve the carbon reductions, to reduction in emissions of other air pollutants that are directly harmful to human health,\" the report said.\nReduced pollution will not only help American families' health, it will also save them money on health bills, the report suggested. Some benefits the report predicted Americans would see by 2025 included:\nUp to 130,000 asthma attacks and up to 2,800 heart attacks will be prevented\n3,700 cases of bronchitis in children will be avoided\n310,000 lost work days and 180,000 school absences will be prevented\nThe coal industry has attacked the EPA proposal, arguing it will cause massive job losses and skyrocketing electricity costs. The U.S. Chamber of Commerce calculated the proposal could cost an average of $50 billion each year until 2030.\nBut the EPA says the plan is worth nearly $100 billion in “climate and health benefits” and will reduce electricity bills by about eight percent.\nPower plants are required to limit emissions of arsenic, mercury, sulfur dioxide, nitrogen oxides, and particle pollution, but have no federal limits on carbon dioxide at the moment.\nFriday's report laid out other action items the Obama administration planned on implementing to help communities.","url":"https://www.nbcnews.com/health/health-news/white-house-climate-change-ruining-our-health-n124796"}
