{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:10:23","date_modify":"2018-10-30 18:10:23","date_publish":"2015-01-13 21:59:40","description":"It is common for White House spokespeople to spin the facts--to find the interpretation that best flatters the president. It is rare, but not unheard of, for White House spokespeople to lie about facts that are not yet fully known to the public. It is extraordinary for White House spokespeople to lie about facts that everyone already knows. Yet that is exactly what Josh Earnest did on Tuesday, when trying to explain why the Obama administration strains to avoid mentioning radical Islam. |","filename":"data/vaneerConsumption/WhiteHouseLiesAboutFranceTerrortoPreservePCViewonIslam.json","image_url":"https://media.breitbart.com/media/2015/01/earnest1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_13__1540923023.html","title":"White House Lies About France Terror to Preserve PC View on Islam","title_page":"White House Lies About France Terror to Preserve PC View on Islam | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"It is common for White House spokespeople to spin the facts–to find the interpretation that best flatters the president. It is rare, but not unheard of, for White House spokespeople to lie about facts that are not yet fully known to the public. It is extraordinary for White House spokespeople to lie about facts that everyone already knows. Yet that is exactly what Josh Earnest did on Tuesday, when trying to explain why the Obama administration strains to avoid mentioning radical Islam.\nEarnest claimed that it would be inaccurate to blame the Charlie Hebdo attack and the attack on the kosher supermarket in Paris on radical Islam because there are Muslims who do not support the attacks, Muslim leaders who condemned the attacks, even Muslims who were victims of the attacks. To identify radical Islam as the culprit, he seemed to imply, would be to implicate Islam as a whole. That is a tired straw-man argument, but it at least is a matter of opinion, however ridiculous.\nWhat Earnest did to back up his argument, however, was simply dishonest. Asked by National Public Radio’s Mara Liasson why the White House has refused to identify “radical Islam” as a threat when other nations had done, Earnest cited “accuracy”:\nAnd I guess I am doing my best to try to explain to you what that is. The first is, accuracy. We want to describe exactly what happened. These are individuals who carried out an act of terrorism. And they later tried to justify that act terrorism by invoking the religion of Islam and their own deviant view of it. [original emphasis]\nSetting aside the arguable proposition as to whether the terrorists’ view of Islam is really “deviant” or in fact widely accepted, Earnest is claiming that the terrorists later invoked Islam to justify their attacks. That flies in the face of all available evidence.\nAlmost every account of the attacks on Charlie Hebdo and the kosher supermarket noted that the terrorists made specifically Islamic gestures during the attacks. They shouted “Allahu Akbar” at the Charlie Hebdo offices, and proclaimed that they had avenged Muhammad. At the kosher supermarket, the terrorist ranted about Osama bin Laden and the Palestinians, among other grievances. At one point, according to some, he prepared for Islamic prayer, which is when police decided to move.\nOn Tuesday–the same day that Earnest fabricated his false chronology–CNN aired newly-released footage of the attack, in which the gunmen shouted in the street (in French, contrary to the comments of the anchor) that they had avenged the prophet. That was before they executed the police officer on the street in cold blood–i.e. it was in mid-attack, not “later.”\nYet Earnest lied, to preserve Obama’s politically correct fictions about radical Islam. What an insult to the dead, and a disgrace.\nSenior Editor-at-Large Joel B. Pollak edits Breitbart California and is the author of the new ebook, Wacko Birds: The Fall (and Rise) of the Tea Party, available for Amazon Kindle.\nFollow Joel on Twitter: @joelpollak","url":"https://www.breitbart.com/politics/2015/01/13/white-house-lies-about-france-terror-to-preserve-pc-view-on-islam/"}
