{"authors":["Charlie Spiering"],"date_download":"2018-10-30 22:01:51","date_modify":"2018-10-30 22:01:51","date_publish":"2016-04-01 19:51:43","description":"The White House appears to have scrubbed “Islamist terrorism” from a video of a speech by French Pres. Hollande at a meeting with Pres. Obama.","filename":"data/vaneerConsumption/WhiteHouseScrubsTranslationofFrenchPresidentSayingIslamistTerrorism.json","image_url":"https://media.breitbart.com/media/2016/04/Obama-WH-Censors-Islamist-Terrorism-White-House-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_04_01__1540936911.html","title":"White House Scrubs Translation of French President Saying ‘Islamist Terrorism’","title_page":"White House Scrubs Translation of French President Saying ‘Islamist Terrorism’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"White House staffers appear to have scrubbed the mention of “Islamist terrorism” from a video of a speech delivered by French President Francois Hollande at a bilateral meeting with President Obama.\nAccording to the White House translation of Francois’ speech, he said the following:\nWe are also making sure that between Europe and the United States there can be a very high level coordination. But we’re also well aware that the roots of terrorism, Islamist terrorism, is in Syria and in Iraq. We, therefore, have to act both in Syria and in Iraq, and this is what we’re doing within the framework of the coalition. And we note that Daesh is losing ground, thanks to the strikes we’ve been able to launch with the coalition.\nBut in the White House video, the translated portion of his remarks about Islamist terrorism is muted, starting at 4:48 in this video, according to a report posted by the Media Research Center.\nWatch the official White House video below:\nIn the White House video, starting at 4:48, Hollande’s female translator goes silent, while he continues speaking for about 15 seconds before the translation restarts.\nHollande’s reference to Islamist terror also appears to have been muted in the White House video.\nThe White House’s edited version of the video also has Hollande saying the following: “But we’re also well aware that the roots of terrorism–and we note that Daesh is losing ground thanks to the strikes we’ve been able to launch with the coalition.”\nThe edit excludes this passage; “Islamist terrorism is in Syria and in Iraq. We, therefore, have to act both in Syria and in Iraq, and this is what we’re doing within the framework of the coalition.”\nThe official video of the remarks posted by the Nuclear Security Summit was not edited, and includes the translation of Hollande’s remarks referring to “Islamist” terror.\nWatch below:\n**UPDATE**\nA White House official released the following statement to Breitbart News in response to a request for comment:","url":"https://www.breitbart.com/politics/2016/04/01/white-house-mutes-translation-french-president-saying-islamist-terrorism/"}
