{"authors":["Dr. Phyllis Chesler"],"date_download":"2018-10-30 20:54:39","date_modify":"2018-10-30 20:54:39","date_publish":"2014-06-30 20:25:00","description":"My heart is broken, absolutely broken. Words never fail me but, at this moment, mere words feel inadequate, even inappropriate. I am, of course, talking |","filename":"data/vaneerConsumption/WhiteHousesCondolencesforMurderedIsraeliTeensWillnotbeEnough.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Peace/2014/Middle-East/Israel/Kidnapped-Teens-IDF.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2014_06_30__1540932879.html","title":"White House's 'Condolences' for Murdered Israeli Teens Will not be Enough","title_page":"White House's 'Condolences' for Murdered Israeli Teens Will not be Enough | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"My heart is broken, absolutely broken. Words never fail me but, at this moment, mere words feel inadequate, even inappropriate. I am, of course, talking about the discovery of three dead bodies which once belonged to three beautiful Israeli souls: Gilad Shaar, Naftali Frenkel, and Eyal Yifrach.\nThis is a time for tears but also a time for some very serious decisions. Prime Minister Benyamin Netanyahu has confirmed that “Hamas is responsible, and Hamas will pay. He added that the teenagers were “kidnapped and murdered in cold blood by wild beasts.”\nThe French foreign Minister, Laurent Fabius, is “deeply shocked and upset” by the murder of these boys. He also expressed “horror” and indignation.”\nPresident Obama expressed his “deepest condolences” to the family of the slain teenagers. He added: “I also urge all parties to refrain from steps that could further destabilize the situation.” President Obama did not accuse Hamas of this despicable act nor did he say our government would assist Israel in its search for security and justice. Obama has once again called for “restraint” and “stability.” Does he mean that Jihadists should refrain from Jihad because it is “de-stabilizing” the entire Middle East or does he mean, more likely, that Israel should “refrain” from defending itself?\nWhite House spokesman, Josh Earnest, also said: “We obviously condemn in the strongest possible terms violence that takes the lives of innocent civilians.”\nThis is a very unsatisfying and peculiar statement. To what is Earnest referring? This could apply to anyone anywhere at any time. It’s lack of specificity is cruel and insulting.\nWhy did Hamas operatives choose to kidnap these three boys? Why did they decide to kill them, apparently, almost immediately, and not use them to barter for Palestinian Arab terrorists in Israeli jails? Are these the actions of two low-level Hamas operatives hoping to be rewarded? Did the Hamas leadership decide they were not interested in hostage-taking especially since the boys could not be moved very far due to the massive IDF search for them?\nOr, is this a game-changer? No more bartering. Just Jew-killing. Do the crazed Jihadists now plan to take over both Jordan and Israel?\nI take it personally whenever evil triumphs. One knows that evil is at work when children are murdered by adults or callously used by adults as human shields, sex objects, child soldiers– or as hostage victims.\nThe Muslim-on-Muslim violence that is taking down the Middle East as we have known it is so fiery, so horrendous, that perhaps the death of these three precious boys will be overlooked or minimized. Perhaps our passionate focus on them will be resented and mocked.\nJews, Israelis, our supporters and allies know that we will never forget these boys and their cruel fates. We will honor their martyrdom by our deeds of valor and courage.\nWhenever an Israeli is killed, the Jew-haters quickly point out how many Arabs have been killed. However, they have mainly been killed by other Arabs and Muslims. This particular killing field is accepted as a given. When an Israeli or a Jew fights back or seeks to rescue on of their own, that’s when the entire world points a finger and starts its games of counting and moral equivalencies.\nA Memorial service will be held tonight outside the Israeli Consulate in NYC. I am sure that similar Memorial services will be held all over Israel and across North America. Hopefully, such Memorial services will also be held across Europe but I have my doubts.\nMay these dear, innocent boys rest in peace, may the lives they led be a blessing for us all, may their families and all Israel be comforted among the mourners of Zion and Jerusalem.","url":"https://www.breitbart.com/national-security/2014/06/30/White-House-Delivers-Muted-Inadequate-Response-to-Murdered-Israeli-Teens/"}
