{"authors":[],"date_download":"2018-10-22 21:10:31","date_modify":"2018-10-22 21:10:31","date_publish":"2014-05-06 12:30:03","description":"A new White House report says that the hard realities of a changing climate have \"moved firmly into the present.”","filename":"data/vaneerConsumption/WhiteHouseReportSaysClimateChangeHasMovedIntothePresent.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/422416/140506-climate-change-630a_97d475368a0774133cd0c9c435757ff2.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_white-house-report-says-climate-change-has-moved-present-n98006_1540242631.html","title":"White House Report Says Climate Change Has Moved 'Into the Present'","title_page":"White House Report Says Climate Change Has Moved 'Into the Present'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA new White House report says that the hard realities of a changing climate are beginning to directly affect Americans as the issue “has moved firmly into the present.”\nThe third National Climate Assessment, the result of four years of research by scientists and experts, was released on Tuesday. A 1,300-page draft version of the National Climate Assessment was issued last year.\n“Climate change, once considered an issue for a distant future, has moved firmly into the present,” they wrote in the report. “Corn producers in Iowa, oysters growers in Washington State, and maple syrup producers in Vermont are all observing climate-related changes that are outside of experience.”\n“Americans are noticing changes all around them,” the researchers wrote in the report. “Summers are longer and hotter, and extended periods of unusual heat last longer than any living American has ever experienced. Winters are generally shorter and warmer.”\nThe report comes after a series of other high-profile warnings on the pace and effects of climate change. The Intergovernmental Panel on Climate Change is releasing a series of global assessments. The American Association for the Advancement of Science, the National Academy of Sciences and the Royal Society have all issued their own reports or begun educational campaigns.\n--- NBC News Staff","url":"https://www.nbcnews.com/science/environment/white-house-report-says-climate-change-has-moved-present-n98006"}
