{"authors":["Sean Moran"],"date_download":"2018-10-30 19:14:12","date_modify":"2018-10-30 19:14:12","date_publish":"2017-02-27 08:56:43","description":"The Trump White House is weighing its options to fire Consumer Financial Protection Bureau (CFPB) Director Richard Cordray.","filename":"data/vaneerConsumption/WhiteHouseLookstoFireCFPBDirectorCordray.json","image_url":"https://media.breitbart.com/media/2015/03/Cordray.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_02_27__1540926852.html","title":"White House Looks to Fire CFPB Director Cordray","title_page":"Report: White House Looks to Fire CFPB Director Cordray","title_rss":"NULL","source_domain":"breitbart.com","text":"The Trump White House is weighing its options to fire Consumer Financial Protection Bureau (CFPB) Director Richard Cordray.\nRichard Cordray directs the CFPB. Dodd-Frank legislation tasked the CFPB with regulating mortgages and other consumer loans from predatory practices.\nThe Boston Globe reports that the White House will decide the future of the director, seen by critics as partisan, unconstitutional, and abusing his authority to regulate the consumer financial world.\nOne lobbyist said, “They want to fire him. Their legal counsel are looking at every angle.”\nFiring Cordray will not be as simple. The CFPB is an independent agency, and his term as director expires in 2018. Trump can only dismiss Cordray for inefficiency, neglect of duty, or malfeasance. Sources say that the administration examines Cordray’s five-year tenure as director to justify his termination.\nA Washington, D.C., circuit court ruled in October that the CFPB is, by design, unconstitutional. Judge Brett Kavanaugh wrote in the majority opinion, “The director of the CFPB possesses more unilateral authority – that is, authority to take action on one’s own, subject to no check – than any single commissioner or board member in any other independent agency in the U.S. government.”\nHe continued, “The CFPB’s concentration of enormous executive power in a single, unaccountable, unchecked director not only departs from settled historical practice, but also poses a far greater risk of arbitrary decision-making and abuse of power, and a far greater threat to individual liberty, than does a multi-member independent agency.”\nJudge Kavanaugh’s opinion gave a blistering refutation of the CFPB, until this month when a U.S. appeals court agreed to reconsider the D.C. court’s opinion to repeal his job protection. The U.S. appeals court will start in May.\nRepublicans believe that the CFPB has made it harder for Republicans to get credit. Other conservatives contend that accountable to the president or Congress. Reformers in Congress want Congress, not the Federal Reserve, to fund the CFPB.\nSenator Ben Sasse (R-NB) said, “The CFPB has done some things that are good, and they’ve done some things . . . that are really bad policy-making. There are counties in Nebraska where you really can’t get a mortgage, and it’s because of CFPB and larger Dodd-Frank overregulation.” He continued, “If people in Nebraska have a problem that’s actually created by bad policy-making by the CFPB, who do they complain to? Who really has the power? He doesn’t report anywhere.”","url":"https://www.breitbart.com/politics/2017/02/27/white-house-weighs-options-fire-cfpb-director-cordray/"}
