{"authors":["Associated Press"],"date_download":"2018-10-23 02:37:47","date_modify":"2018-10-23 02:37:47","date_publish":"2016-01-29 17:13:05","description":"WASHINGTON (AP) — New Jersey Gov. Chris Christie is largely looking past Monday's Iowa caucuses, where he barely registers in preference polls, to New Hampsh...","filename":"data/vaneerConsumption/WhiteHouseBriefThingstoknowaboutGovChrisChristie.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:4aca6b791a8c4a7a927b59e3884f631d-3bmscybNe842cce83474b5811ef7-723_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423082_White-House-Brief-Things-know-Gov-Chris-Christie_1540262267.html","title":"White House Brief: Things to know about Gov. Chris Christie","title_page":"White House Brief: Things to know about Gov. Chris Christie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"White House Brief: Things to know about Gov. Chris Christie\nWASHINGTON (AP) — New Jersey Gov. Chris Christie is largely looking past Monday's Iowa caucuses, where he barely registers in preference polls, to New Hampshire, where he's staked his flag in the 2016 race for the Republican presidential nomination. Here's a quick snapshot of things to know about him.\n___\nTHE BRIEF\nChris Christie argues a point during a Republican presidential primary debate, Thursday, Jan. 28, 2016, in Des Moines, Iowa. (AP Photo/Chris Carlson)\nA year ago, it was hard to imagine any candidate overshadowing Christie in the charisma-and-entertainment department. But his \"Sit down and shut up!\" made-for-YouTube moments began to seem tame compared with Donald Trump's insult-fueled reality show campaign, which arrived in June. That, combined with New Jersey's sluggish economic recovery, his evolving policy positions and his staff's politically motivated traffic jam near the George Washington Bridge, have emerged as Christie's chief challenges.\nChristie has bounced around in the polls — qualifying for early debates, missing the main stage in another, then qualifying again. Christie aides are hoping a stronger-than-expected finish in Iowa — which they define as beating the two other governors in the race — will boost him heading into New Hampshire, where he's counting on a strong finish to keep his campaign alive.\n___\nRESUME REVIEW\nThe son of an Irish father and a Sicilian mother (to whom he credits his combative nature), Christie, 53, grew up in Livingston, N.J., playing Little League and high school baseball. He met his future wife, Mary Pat, at the University of Delaware and returned to his home state with her to attend Seton Hall University School of Law. Before he was governor, Christie built his reputation as a media-savvy prosecutor who took on the state's notorious public corruption and won, scoring 130 convictions or guilty pleas on his watch.\nHe was widely praised for his performance, despite skepticism: Critics charged President George W. Bush only appointed the lawyer and registered lobbyist to the post of U.S. Attorney in New Jersey because of the money he raised for Bush's 2000 campaign. A year after leaving that office, Christie, whose political career had consisted of failed bids for state office and several years as a local freeholder, defeated Democratic Gov. Jon Corzine in 2009. He secured a commanding re-election victory in 2013 after a term spent confronting public employees' unions and rebuilding from Superstorm Sandy. He also stoked anger when he embraced President Barack Obama in the aftermath of the storm.\n___\nSIGNATURE ISSUE\nChristie has highlighted his background as a federal prosecutor by criticizing Obama's handling of law enforcement issues, and by claiming that his history in the courtroom makes him the best candidate to take on Hillary Clinton if she wins the Democratic presidential nomination.\n\"The fact is we need someone who knows how to beat Democrats, who knows how to beat Democrats in a Democratic area,\" Christie said in a debate. \"I've done it twice as governor of New Jersey, and Hillary Clinton doesn't want one minute on that stage with me next September when I'm debating her, and prosecuting her for her vision for America.\"\n___\nDEBATE DIGEST\nChristie has consistently cast himself as the Republican presidential candidate who speaks directly to voters and best understands middle-class concerns. He laid down that marker at a debate in September when Christie bluntly told Trump and former tech company CEO Carly Fiorina that voters don't care about their resumes.\n\"You're both successful people. Congratulations,\" Christie scolded. \"The middle class in this country who's getting plowed under by Barack Obama and Hillary Clinton, let's start talking about those issues tonight and stop this childish back-and-forth between the two of you.\"\n___\nMOMENT TO REMEMBER\nChristie's compelling recollection of losing a friend to drug addiction was captured in a Huffington Post video in October 2015, which at last count had racked up more than 8.6 million views on Facebook and liked by site founder Mark Zuckerberg and tens of thousands more.\n\"It can happen to anyone,\" Christie said. \"And so we need to start treating people in this country, not jailing them. We need to give them the tools they need to recover.\"\nThe video caught fire just before Christie fell far enough in preference polls to lose his place in the GOP's top-tier debates. But it underscored Christie's raw political talent and ability to connect with an audience in ways many of his rivals cannot. The video, combined with Christie's strong performance in the undercard debate and his constant campaigning across New Hampshire, helped improved his standing in preference polls enough to win back a place on the main stage in later debates.\n___\nPLEASE FORGET\nAides to Christie were accused of engineering the traffic jams at one of the world's busiest bridges in September 2013 to punish a Democratic mayor who didn't support his bid for re-election. Christie has consistently denied any knowledge of the plot, which led to federal indictments of his former deputy chief of staff and two other close allies. It was a scar, however, that raised questions about Christie's judgment and put his campaign behind even before it started.\n___\nONLINE AND SOCIAL MEDIA\nTwitter:\nhttps://twitter.com/GovChristie\nhttps://twitter.com/ChrisChristie\nInstagram:\nhttps://instagram.com/govchristie/\nFacebook:\nhttps://www.facebook.com/GovChrisChristie?fref=ts\nhttps://www.facebook.com/govchristie?fref=ts\nhttps://www.facebook.com/chris.christie.940?fref=ts\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3423082/White-House-Brief-Things-know-Gov-Chris-Christie.html"}
