{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-22 22:56:07","date_modify":"2018-10-22 22:56:07","date_publish":"2016-01-28 11:29:40","description":"Cecilia Turk, pictured, was kicked out of Cineworld in Whiteley, Hampshire, after moving in front of a fire escape from a designated bay at the front of the screening as her neck started to ache.","filename":"data/vaneerConsumption/WhiteleysCineworldthrowsoutdisabledathleteCeciliaTurkwithcerebralpalsy.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30AA358F00000578-0-image-a-62_1453983139564.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420632_Disabled-athlete-cerebral-palsy-thrown-cinema-fire-hazard_1540248967.html","title":"Whiteley's Cineworld throws out disabled athlete Cecilia Turk with cerebral palsy","title_page":"Whiteley's Cineworld throws out disabled athlete Cecilia Turk with cerebral palsy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The 32-year-old moved from a designated bay at the front as her neck hurt\nA disabled woman has spoken off her humiliation after claims she was chucked out of a cinema screening because she was a 'fire hazard'.\nCecilia Turk says the incident occurred during a viewing of In The Heart Of The Sea at the newly-built Cineworld multiplex at Whiteley Shopping Centre on January 6.\nThe 32-year-old, who has cerebral palsy and is in a wheelchair, claims she was told by staff 30 minutes into the 6pm screening that she had to leave as she was blocking a fire escape.\nCecilia Turk says the incident occurred during a viewing of In The Heart Of The Sea at the newly-built Cineworld multiplex at Whiteley Shopping Centre on January 6\nThe 32-year-old, who has cerebral palsy and is in a wheelchair, claims she was told by staff 30 minutes into the 6pm screening that she had to leave as she was blocking a fire escape\nShe said ‘They asked me to leave because I was a fire hazard. Everyone was looking at me.\n‘The incident made me feel intimidated and discriminated against.’\nMs Turk, who has a masters degree in accessibility and law, was originally sat in a bay at the front of the screening, but moved further back 15 minutes in to the film as her neck began to hurt.\nLIVING WITH CEREBRAL PALSY Cerebral palsy is the general term used for a number of neurological conditions, caused by caused by problems in the brain and nervous system, that affect movement and co-ordination. Specifically, cerebral palsy is caused by a problem in the parts of the brain responsible for controlling muscles. The condition can occur if the brain develops abnormally or is damaged before, during or shortly after birth. It's estimated that 1 in 400 people in the UK is affected by the condition, with the symptoms normally becoming apparent during the first three years after birth. The main symptoms are muscle stiffness or floppiness, muscle weakness, random and uncontrolled body movements, and balance and co-ordination problems. While there is no cure for cerebral palsy, there are numerous treatments which can treat many of its symptoms and help people with the condition to live a more independent live. Source: NHS\nShe claims that an usher asked her and her personal assistant, who helped her to move, to leave 15 minutes after moving.\nAfter leaving the viewing, she demanded to see the multiplex's manager, who issued her a refund for her ticket.\nMs Turk is a familiar face on the disabled sports scene thanks to her playing career in the precision ball sport Boccia, which saw her named the country's national champion of the sport in 2012.\nThe talented sportswoman, from Waterlooville, Hampshire, has questioned why a cinema built less than four months ago has, in her view, poor disabled access.\nShe said: ‘I’d like to see Cineworld made fully accessible and legal like all of the other cinemas.’\nA Cineworld spokesman told MailOnline: 'We were really sorry to hear that Ms Turk wasn’t happy with her experience at our cinema and we have been in regular contact to apologise and address her concerns.\n'We take matters of equal access very seriously. Our Whiteley cinema is fully accessible and we meet standards and guidelines from the Disability Working Group of the cinema industry body the UK Cinema Association.\n'Our staff are trained on disabilities and Cecilia was asked to move back to the designated wheelchair bay when she moved to a different position which blocked the fire exit.\n'We welcome feedback on how we can improve our accessibility and we’ll continue to make changes wherever possible to improve the experience of our customers with additional needs.'","url":"https://www.dailymail.co.uk/news/article-3420632/Disabled-athlete-cerebral-palsy-thrown-cinema-fire-hazard.html"}
