{"authors":[],"date_download":"2018-10-30 21:02:40","date_modify":"2018-10-30 21:02:40","date_publish":"2017-03-13 20:56:00","description":"Monday is the deadline for the Justice Department to give the House Intelligence Committee any evidence it has that backs up President Donald Trump’s claim that his campaign was the subject of a wiretap authorized by the previous administration.","filename":"data/vaneerConsumption/WhoarethekeyplayersintheRussiaTrumpsaga.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgSharedContent/2017/03/22/Videos/3960629.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_who-are-the-key-players-the-russia-trump-saga__1540933360.html","title":"Who are the key players in the Russia/Trump saga?","title_page":"Who are the key players in the Russia/Trump saga?","title_rss":"NULL","source_domain":"ajc.com","text":"Here are some of the key players in the Trump-Russia story.\nPaul Manafort\nManafort was the chairman of Donald Trump’s campaign, but resigned in August 2016 after revelations surfaced about his work on behalf of former Ukrainian President Viktor Yanukovych. Yanukovych was a supporter of Russian President Vladimir Putin. According to The Associated Press, Manafort “helped a pro-Russian governing party in Ukraine secretly route at least $2.2 million in payments to two prominent Washington lobbying firms in 2012, and did so in a way that effectively obscured the foreign political party's efforts to influence U.S. policy.” A U.S. lobbyists must declare publicly if they represent any foreign leaders or political parties. The New York Times reported that Manafort spoke to Russian intelligence officials last year via telephone calls that were monitored by U.S. intelligence agencies. Manafort has denied that he spoke with the Russians. Manafort has also been linked to handwritten ledgers that list cash payments of $12.7 million by Manafort’s name.\nMichael Cohen\nCohen is Donald Trump’s personal attorney. According to a New York Times report, Cohen was involved with a peace plan for the Ukraine and Russia that involved the U.S. removing sanctions on Russia in return for Russia ending its support of pro-Russia separatists fighting the Ukrainian government in eastern Ukraine. In addition to having sanctions removed, the deal would allow Russia to cement its control over Crimea. Russian annexed Crimea in 2014. The Times story claims that Cohen delivered the peace plan to Michael Flynn, the national security adviser who was forced to resign last month. Cohen told The Washington Post that he did not deliver a plan to Flynn, but that he had met with businessman Felix Sater and Ukrainian lawmaker Andrii Artemenko in New York in January and talked about a peace plan for the Ukraine for “about 15 minutes.” Artemenko said that the plan was, indeed, delivered to the White House.\nMichael Flynn\nFlynn was Trump’s national security adviser – for three weeks. He was forced to resign when it became known that he misled Vice President Mike Pence on conversations Flynn had with the Russian ambassador to the United States, Sergey Kislyak. U.S. intelligence sources said that Flynn talked with Kislyak about sanctions placed on Russia by former president Barack Obama in late December. Flynn also worked for “Russia Today,” a state-owned TV show. He was paid for a visit he made to Russia to celebrate the 10th anniversary of Russia Today, and could be in trouble for that visit if it was not approved by the Defense Department and the State Department. Flynn was registered with the Justice Department as a foreign agent prior to Election Day. He was registered for $530,000 worth of lobbying work that may have aided the Turkish government. The AP reported that the Trump transition team was told that Flynn likely needed to register as a foreign agent before taking top national security role.\nSergey Kislyak\nKislyak is the Russian ambassador to the United States. He spoke with Michael Flynn, Trump’s former national security adviser, in December about sanctions that had been brought against Russia for its alleged interference in the 2016 presidential election that, eventually, led to Flynn's resignation. Kislyak also met with then-Sen. Jeff Sessions (now attorney general) on at least two occasions. Sessions says he barely remembers what was said and that the meetings were brief. He did not disclose the meetings during his confirmation hearing in response to a question about what he would do if someone in Trump’s campaign had had contacts with Russian officials. Sessions recused himself from any potential investigation into Russian meddling with the election and ties with Trump’s campaign. CNN reports that Kislyak, in an October speech to the Detroit Economic Club, “denied meeting with Donald Trump or campaign officials during the course of 2016 presidential election, but acknowledged that he met with members of Congress and others who approached him at events.”\nCarter Page\nPage was a foreign policy adviser to Trump in the early days of his campaign. Page is the head of an investment company known as Global Energy Capital. He was publicly accused by then-Senate Minority leader Harry Reid (D-Nev.) of being a link between Trump and the Russian government. Page has also been accused of being a go-between for the Trump campaign and high-level Russian officials. Page was in Moscow for three days in mid-July, and according to reporter Michael Isikoff, and intelligence sources claim he met with Igor Sechin, the head of the Russian state oil company. Sechin is said to have been working on a plan to have Western sanctions against the company lifted. Page has denied ;he met with any government officials while in Russia last July. He has criticized US sanctions on Russia as \"sanctimonious expressions of moral superiority.”\nAndrii V. Artemenko\nArtemenko is a Ukrainian politician who opposes Ukrainian President Petro Poroshenko and claims to have evidence of Poroshenko’s corruption. He has crafted a plan for peace in Ukraine with himself as president, and Politico has reported that Artemenko met with Trump attorney Michael Cohen and businessman Felix Sater, a business partner of Trump’s, to discuss that plan.\nFelix Sater\nAccording to The New York Times, Sater, a real estate developer and adviser to the Trump Organization, met with Ukrainian politician Andrii Artemenko and Michael D. Cohen in New York in January to discuss sanctions against Russia. The story said that Sater was given the letter, which proposed the deal to lift sanctions by withdrawing Russian forces from eastern Ukraine, to Trump attorney Michael Cohen to be delivered to Michael Flynn, the then-national security adviser to the president.\nIgor Sechin\nSechin is the head of Russia’s state oil company, Rosneft. According to reporting by Yahoo’s Michael Isikoff, a U.S. intelligence source said that Sechin was desperate to have Western sanctions against him and Rosneft lifted, so he arranged to meet with Carter Page, head of Global Energy Capital. Isikoff reported that Sechin offered Page the brokerage of a 19 percent stake in Rosneft in exchange for the lifting of US sanctions on Russia. Page has denied this report.\nJeff Sessions\nAttorney General Sessions, a former senator from Alabama, was the first sitting senator to endorse Trump. He appeared with Trump at some campaign stops and was rumored to be under consideration for vice president. During 2016, Sessions met with Russia’s ambassador to the United States, Sergey Kislyak, at least twice. Sessions said that the meetings were in line with his duties as a senator, and that nothing about Russia’s potential involvement with the 2016 presidential election was discussed. Sessions did not disclose those meetings during his confirmation hearings in response ;to an indirect question about Russia’s involvement in the election. Sessions recused himself from any potential investigation into Russian meddling with the election and ties with Trump’s campaign.\nRoger Stone\nStone is a longtime friend of Trump’s and was an informal adviser to his campaign. According to several media reports, Stone is being investigated by the FBI about whether he had inappropriate contact with Russian officials. Stone told CBS News that he suspects he is being investigated, and said, “Sure, they’ll get my grocery lists, they may get the emails between my wife and I, but here’s what they won’t get -- any contact with the Russians.” Despite saying in a speech that he had communicated with WikiLeaks founder Julian Assange, he claims did not know Wikileaks was going to publish emails stolen from Hillary Clinton campaign chairman John Podesta. This week, The Smoking Gun reported that Stone was “in contact with the Russian hacking group that U.S. intelligence officials have accused of illegally breaching the Democratic National Committee’s computer system” and Podesta’s email account.","url":"https://www.ajc.com/news/national/who-are-the-key-players-the-russia-trump-saga/mmTueceZA3JinF6SC2GXyI/"}
