{"authors":["John Hayward"],"date_download":"2018-10-30 18:23:24","date_modify":"2018-10-30 18:23:24","date_publish":"2018-08-07 22:02:36","description":"Dr. Robert Epstein argues that the recent banning of Alex Jones is \"not even a free speech issue. The issue is: Who should be making these decisions about what people see and don’t see? That’s the question.”","filename":"data/vaneerConsumption/WhoGavePrivateBigTechCompaniesthePowertoDecideWhatWeCanSee.json","image_url":"https://media.breitbart.com/media/2018/08/google-facebook-apple-spotify-big-tech-censorship.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/radio_2018_08_07__1540923804.html","title":"Who Gave Private Big Tech Companies the Power to Decide What We Can See?","title_page":"Exclusive -- Robert Epstein: Who Gave Private Big Tech Companies the Power to Decide What We Can See?","title_rss":"NULL","source_domain":"breitbart.com","text":"Dr. Robert Epstein , the senior research psychologist at the American Institute for Behavioral Research and Technology and a veteran of Breitbart News’ “ Masters of the Universe ” town hall on Internet freedom, joined SiriusXM hosts Rebecca Mansour and Joel Pollak on Monday’s Breitbart News Tonight to discuss the simultaneous banning of Infowars host Alex Jones by most major social media platforms.\nEpstein stressed that he is not a political conservative and “certainly no fan of Alex Jones,” but he saw the Jones’ banning as a disturbing threat to the free speech and vibrant democracy he loves. “I think the big issue here is not even a free speech issue. The issue is: Who should be making these decisions about what people see and don’t see? That’s the question.”\nLISTEN:\n“In some ways, the problem [for Jones] is better than you think. It’s not as bad as you think,” he qualified. “For example, Alex Jones’ apps are still available through, I guess, Apple and Google Play, so he hasn’t been completely shut down.”\n“In some ways, things are worse than you think,” he continued. “Jones himself responded by saying, ‘Well, you know people, you can still livestream me at…’ and then he gave the links to go to so you can livestream him. But what apparently he doesn’t realize is that these companies, Google in particular, they have the power to limit access to websites, which most people know nothing about.”\nEpstein cited a piece he wrote for U.S. News and World Report entitled “The New Censorship” in which he explained that Google is “literally every day blocking access to millions of websites.”\n“Sometime last year, I believe it was, they for ten minutes blocked access to every single website in Japan. On January 31, 2009, Google blocked access to virtually the entire Internet all over the world for 40 minutes,” he recalled.\n“The bottom line is, in some ways what’s happened to Jones is not as bad as you think. In other ways, it’s actually much worse than you think. There are some big issues here that we need to explore, and talk about, and understand,” he said.\nPollak presented the Big Tech argument that the companies acting in concert to ban Jones are “private companies” that should be allowed to “exclude whoever they want,” so the case “has no implication for freedom of speech.”\n“It’s complete nonsense and it’s quite a dangerous argument,” Epstein responded. “By the way, they only make that argument when it’s convenient. There are times when they argue just the opposite, saying they’re just passive platforms and they don’t make editorial decisions. Of course, this is an extreme example of them not acting as passive platforms and making extreme decisions about content.”\n“The big issue here, no matter what one thinks of Alex Jones, is: Who on Earth gave these private companies the power to make decisions about what everyone in the world is going to see or not see,” he said.\n“That is the key issue here. Who gave this power to these companies? And the answer is, nobody. Nobody has thought this through. There are no relevant laws or regulations in place, at least in the United States. If people really started thinking about this, they would realize – again, no matter what their feelings are about Donald Trump, or Alex Jones, or anyone else – wait a minute, these companies shouldn’t have that power, period,” he said.\nMansour pointed to the Facebook banning of a campaign ad from Republican congressional candidate Elizabeth Heng of California as an example of Big Tech’s heavy thumb on our political scales. The ad was deemed “shocking, disrespectful, or sensational” because Heng talked about her family’s flight from the communist horrors of Cambodia.\nEpstein raised the stakes by previewing an upcoming article in which he contends “Google, Facebook, and other tech companies can shift millions of votes in the U.S. midterm elections without anyone knowing.”\n“The power that these companies have to impact opinions, purchases, beliefs, attitudes, voting preferences – there’s never been power like this. No government has ever had power like this.\nThe fact that it’s really just two or three companies – mainly two – and that they have similar politics, that just makes this even crazier. In fact, I say in this upcoming article that if these companies in November all happen to be favoring the same political party, I estimate conservatively – and I emphasize conservatively, even though I’m not a ‘conservative’ – that they could shift upwards of 12 million votes,” he warned.\nEpstein added no one would know this vote-shifting had occurred, and there would be no paper trail for election monitors to track. To illustrate how many tools are available for the Masters of the Universe to influence politics, he said outright censorship was merely one of ten techniques they can employ.\n“What we all saw today in the Alex Jones situation was some of that power being exercised, mainly in just one area, but there are at least nine other huge ways in which these companies are exercising power every single day over the decision-making right now of over 2.5 billion people around the world. It will grow in the next two to three years to over 4 billion people. So something is completely wrong here,” he said.\nMansour observed with dismay that Big Tech was once criticized for compromising its free speech values to do business with authoritarian regimes like China, but now it seems there is no “compromise” of values necessary to adopt the Chinese model of censorship in America.\nEpstein pointed to an internal Google video called “The Selfish Ledger” that captured senior personnel celebrating the company’s “ability to shape humanity.”\n“They specifically mentioned company values in this eight-minute video,” he noted. “There are people there who, in their minds, they’re doing us a big favor, they’re doing the world, humanity, a big favor by thinking about ways to reshape us in a way that somehow matches company values. That’s for our own good.”\nFor a thorough exploration of those “company values,” Epstein recommended the work of his friend Jonathan Taplin, author of Move Fast and Break Things: How Facebook, Google, and Amazon Corner Culture and Undermined Democracy.\n“Taplin argues pretty convincingly that these are megalomaniacs. These are people who are not just greedy, but they also feel like they have a duty. They’re superior people, and they have a duty to humanity to reshape it in a form that they approve of,” he said of the top Big Tech executives.\n“It’s kind of like Ayn Rand’s Atlas Shrugged going amok here, with tech moguls at the center of the universe that’s emerging,” he remarked, adding parallels to President Dwight Eisenhower’s famous warning about the “military-industrial complex.”\n“If you actually go back and read the speech, you’ll be really impressed, because he’s not just warning about those people. He’s warning about the rise of a technological elite. This is January 1960! The rise of a technological elite that can basically run our world without us knowing, and he even says we have to be alert of this is going to happen,” Epstein said of Eisenhower’s amazing prescience.\nEpstein said he was willing to bet money that at this very moment, “Google and Facebook are in subtle ways encouraging more Democrats to register to vote than they are encouraging Republicans.”\n“Think how that shifts things over time,” he said. “I think in subtle ways they’re probably encouraging more Democrats to go out and vote in the primaries than they are encouraging Republicans. I think they’re shifting things around, right now, every day, and not just in the political realm.”\nEpstein said it was inevitable that regulatory solutions to the power of Big Tech would be proposed, although he doubted the answer lay in that direction.\n“I keep getting invited to conferences on anti-trust actions. Yes, anti-trust would be nice. That’s the kind of thing the EU has done, and let’s allow them to levy these huge fines against Google – first a $2.7 billion fine last year, and now a $5.1 billion fine against Google, and a third one is coming soon,” he said.\n“Anti-trust, regulation, legislation – that’s all nice, but you know that stuff takes forever,” he continued. “It moves so slowly that these companies will be light-years ahead of any regulations, any new laws that are put in place. I just don’t think it’s going to help that much,” he predicted.\n“My recommendation, my focus these days is on another way to deal with the problem, and that is by setting up large-scale monitoring systems,” Epstein said.\n“I actually set up a small-scale monitoring system which worked beautifully, and which looked at bias in search rankings that people were seeing before the 2016 election, looking at Google, Bing, and Yahoo, not just Google. I was able to preserve more than 13,000 election-related searches, more than 90,000 web pages to which the search results linked,” he explained.\n“I was able to analyze this looking for bias toward either Clinton or Trump in search results. I found a very clear bias toward Mrs. Clinton, enough to shift possibly 2 or 3 million votes without anyone knowing that this was occurring because you can’t see bias in search rankings. You have to set up monitoring systems that allow you to look over people’s shoulders as they are using their computers and mobile devices. It’s kind of like what the Nielsen company does when it monitors people’s television watching,” he said.\n“I’m now working with some business partners, some academic colleagues, actually on three continents. We are in the process of building large-scale monitoring systems. Eventually, when these systems are in place, we will be able to detect manipulations on the part of these tech companies, in some cases probably within minutes of when they try something,” he anticipated.\n“In my opinion, monitoring is the way to go: fighting tech with tech. That would allow us to keep up with them, maybe even stay ahead of them, because we could move lightning fast – which would never happen with regulations and laws,” he said.\nEpstein envisioned “blue-ribbon bipartisan committees” examining the data from these large-scale monitoring projects and responding with action ranging from directing media attention to Big Tech political mischief to regulatory measures or court injunctions where needed.\n“By accumulating these data 24 hours a day, we would be able to hand over, to any or all of those kinds of parties, massive amounts of evidence showing that such-and-such is really occurring,” he said.\nFor example, Epstein posited: “If, on Election Day in 2016, if that morning Mark Zuckerberg decided to send out ‘go out and vote’ just to supporters of Hillary Clinton – and of course he knew who those people were for sure, because of all the information he had – that would have given her an addition 450,000 votes at least.”\n“How do I know that? I know this from Facebook’s own published data,” he added.\n“Did he do that? Did he send that out? I don’t think that he did, because I think he was overconfident. The point is, without a monitoring system in place, if he chose to send out that kind of targeted message, no one would ever know that it was just going to certain people and not others. You have to have a monitoring system in place,” he emphasized.\nEpstein saw the increasing popularity of home monitoring devices such as Google Home and Amazon Alexa as reasons to be even more concerned about the social and political influence of Big Tech.\nEpstein rejected the argument that it’s not truly “censorship” if a private company decides material falls beneath its standards and refuses to publish it, rather than a government agency expressly forbidding publication.\n“Amazon, Google, Facebook, they hide behind what’s called the ‘Safe Harbor Law,’ CBA 230,” he noted. “They pretend to be passive when it suits their needs, but in fact, we know the opposite is true, that they’re extremely, extremely aggressive in the kind of editing that they do. They’ve been playing it both ways in court cases for years, and by the way very successfully. They have confused a lot of judges, including conservative judges.”\nIn Epstein’s view, the confusion is beginning to clear up, and tech companies will no longer be able to switch between the roles of passive platform providers and active content editors as easily as they could a few years ago.\n“Everything has changed now. They are in danger. We saw that when Zuckerberg testified before Congress. We saw that with the massive unprecedented drop in Facebook’s stock. The fact is that Google – again, no one reports this – Google has gone through two corporate reorganizations since 2015. Eric Schmidt has been selling off his stock in the company, the former chair of Alphabet and of Google. Things actually are changing and these companies and their model, which I call the surveillance business model, is very much in jeopardy,” he judged.\n“One of my sons, he plays the stock market, and he has this undying faith in the tech companies. I keep telling him, ‘Hey, Schmidt is selling off his own stock in Google, maybe you should too,’” he said.\n“In the not so distant future, I think the surveillance business model is going to be illegal,” Epstein boldly predicted. “I think the censorship issue is going to be tackled because I think the big issue here is not even a free speech issue. The issue is: Who should be making these decisions about what people see and don’t see? That’s the question.”\nPollak asked if Epstein was aware of any examples of left-wing sites getting the Alex Jones treatment.\n“That’s an excellent question,” he replied. “The fact is, right now we all know – it’s not a big secret – that these big tech companies lean left. That’s not a secret. You can look at the donations they’ve made. You can look at Schmidt’s emails offering to run Hillary Clinton’s tech campaign, et cetera, et cetera. They lean left, so of course, most of the suppression that’s occurring now is bound to be for conservative material, or at least there’s going to be more suppression there than in the other direction.”\n“Having said that, the fact is that more and more prominent liberals are speaking out against these companies and the threat they pose,” he added. “I can give you a quick example here: George Soros, who is about as liberal as you can get, he certainly leans left and he’s a billionaire supporter of left-leaning candidates, he’s come out repeatedly with statements expressing real fear about these companies. I mentioned John Taplin’s book which looks at these tech moguls as megalomaniacs. Well, Taplin is left-leaning.”\n“There are more and more people who are left-leaning people, who are liberals, who are expressing anger, concern, fear about these tech companies,” he said. “Tristan Harris is another example, he’s one of the co-founders of a new organization that’s definitely a liberal organization. This organization is devoted to getting these tech companies to stop this horrible process of getting us and our children to become addicted to their platforms. He’s fighting the addiction issue, and yet he’s left-leaning. His group, they’re all left-leaning.”\n“Tim Berners-Lee, for goodness sake, who’s on the faculty at MIT, and who was the one that invented the World Wide Web. He’s been expressing tremendous concern. He’s working with people to try to reinvent the whole Internet to save us from these monopolies, which he never envisioned,” Epstein pointed out.\n“I think you’re right: the suppression, the harm, is definitely more to conservatives at the moment, because these companies do lean left,” he told Pollak. “But more and more people on the left, more and more liberals, are speaking out. So what does that tell you? At least it tells me there is potential here for real change. I’m not saying these people are talking to each other, but the point is, you’ve got people on the left and the right saying exactly the same thing, expressing exactly the same concerns, and the same fears, and the same anger.”\n“It’s just a matter of time before they start to talk to each other. Isn’t that what’s happening right now? Aren’t I on your show? Isn’t that what’s happening?” Epstein asked.\nBreitbart News Tonight broadcasts live on SiriusXM Patriot 125 weekdays from 9 p.m. to midnight Eastern (6 p.m. to 9 p.m. Pacific).","url":"https://www.breitbart.com/radio/2018/08/07/exclusive-robert-epstein-who-gave-private-big-tech-companies-the-power-to-decide-what-we-can-see/"}
