{"authors":[],"date_download":"2018-10-23 05:39:31","date_modify":"2018-10-23 05:39:31","date_publish":"2016-06-30 00:00:00","description":"Connecticut is the first state requiring police fill out a form when they use a stun gun. Research shows police used stun guns on black and Latino suspects at a higher rate than on white suspects.","filename":"data/vaneerConsumption/WhoGetsTasedFirstStatewideStudyRevealsRacialDisparities.json","image_url":"https://media.npr.org/assets/img/2016/06/29/img_5696_wide-adedd668dc26ccbdb19f599c12745785c4cf5363.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=483829855_1540273171.html","title":"Who Gets Tased? First Statewide Study Reveals Racial Disparities","title_page":"Who Gets Tased? First Statewide Study Reveals Racial Disparities : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ROBERT SIEGEL, HOST:\nThe first ever state-wide report on how police used Tasers was released today in Connecticut. Policing with stun guns has stirred controversy in many communities. Their use in Connecticut is raising questions about why some groups are more likely to receive electric shocks. NPR's Hansi Lo Wang reports.\nHANSI LO WANG, BYLINE: Before cops can use Tasers on suspects in Connecticut, they have to be trained. And many feel the pain themselves.\nUNIDENTIFIED MAN: Taser, Taser.\nEDGAR GONZALES: (Groaning).\nWANG: That groaning's from Officer Edgar Gonzales as he falls onto a padded mat during training at the Norwalk Police Department. Seconds later, he says he feels drained but no pain.\nGONZALES: I think it's going to be a great tool. I know that after going through that, I'm glad that I will have one on me.\nTHOMAS KULHAWIK: The Taser has proven to be a tremendous tool because the officer and the suspect neither are usually injured.\nWANG: That was Norwalk Police Chief Thomas Kulhawik. But he admits Tasers can be abused and sometimes even result in deaths. Police use stun guns against suspects who show what cops consider threatening and resistant behavior. The shock can get them to follow orders. Kulhawik says Tasers can level the playing field for police.\nKULHAWIK: You're not depending just on size and strength in order to arrest someone, even a small-statured officer against a larger individual can still have the Taser as a tool to use to gain compliance.\nWANG: The new report shows that Tasers were used more than 600 times last year. Ken Barone a researcher at Central Connecticut State University co-wrote the report and found racial disparities. He found that black men were about three times more likely to be tased than simply warned. For Latino men, it was more than 40 percent more likely to be tased than warned, and for white men the chances of being tased or warned were about the same.\nKEN BARONE: Some of this might be driven by the fact that those departments that submitted the most Taser reports are larger, more diverse cities.\nWANG: Barone says researchers need more time to figure out what's driving these racial disparities. And there was another trend that stood out.\nBARONE: Nearly one-third of all Taser incidents involved a person that the officer believed to be emotionally disturbed.\nWANG: Taser International warns against using its stun guns on people experiencing psychiatric crisis or on children. Today's report found that nine of those tased last year were under 18. All the report's information came from forms cops are required to fill out every time they pull out a Taser.\nBut there were cases of underreporting. For example, the Hartford Police Department did not report a man who died after he was tasered last year until researchers followed up. Deputy Chief Brian Foley says Hartford police is trying to improve their reporting for Tasers.\nBRIAN FOLEY: The infrastructure's not there. There's no way to track it. And that's our goal is to get it back and have it on camera - be it on Taser camera or on body camera - any time it's used.\nWANG: Video recording of police using Tasers may be a ways off for many departments. In the meantime, Wilson Ramos says that goal and this new report gives him some hope. His brother Jose Maldonado died in a jail cell after police tased him more than two years ago.\nWILSON RAMOS: If this is a step forward so we can avoid someone else dying, then I'm glad it's in place. But as far as for me, I - you know, nothing's going to take back that moment. I'm not going to get my brother back.\nWANG: The Hartford Police Department has said that Maldonado was combative after he was arrested for punching a car window while intoxicated. Ramos has filed a federal lawsuit against the department.\nRAMOS: Due to the mandatory reporting now I think it's going to come to light that these things get used more often than they should for situations that don't warrant it.\nWANG: How often that actually is in Connecticut, researchers say for now they don't know. California recently passed a law requiring police to report Taser incidents that seriously injure or kill people. But there are no similar laws in other states or at the federal level. Researchers in Connecticut say they hope their state will serve as a model for the rest of the country on tracking Tasers. Hansi Lo Wang, NPR News.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=483829855"}
