{"authors":[],"date_download":"2018-10-22 23:16:02","date_modify":"2018-10-22 23:16:02","date_publish":"2014-08-14 00:00:00","description":"Location, location, location too often trumps medical need, some doctors say. But another solution to making the distribution of scarce organs fairer worries some transplant surgeons and patients.","filename":"data/vaneerConsumption/WhoGetsFirstDibsOnTransplantedLiverRulesMayChange.json","image_url":"https://media.npr.org/assets/img/2014/08/13/liver-transplant_wide-533dee6463c30c4797594b0c331b2a4d7e946592.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=339579923_1540250162.html","title":"Who Gets First Dibs On Transplanted Liver? Rules May Change","title_page":"Who Gets First Dibs On Transplanted Liver? Rules May Change : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\nThis nation's organ transplant network is considering a big change in how livers are distributed. The change would give people who need a transplant the same shot at getting one no matter where they live. But critics say this might end up harming some patients. NPR's Rob Stein explains.\nROB STEIN, BYLINE: Vicki Hornbuckle's 54 and lives in Snellville, Georgia. She used to play piano at her church, but that was before her liver started failing.\nVICKI HORNBUCKLE: And I had to give it up because I couldn't keep up. I couldn't - didn't have the energy to do three services on Sunday. You're just too tired to deal with anything. And so it's not a life that you want to live.\nSTEIN: But she hasn't given up. She's fighting to stay alive long enough to get a liver transplant.\nHORNBUCKLE: I would like to see my grandchildren grow up. And my mother is still alive, and it's not fair to just, you know, to bury your children. It's not supposed to work that way.\nSTEIN: Hornbuckle is one of more than 12,000 Americans waiting for a liver transplant because they have conditions like hepatitis, cancer or cirrhosis. Nine hundred miles north, in East Hartford, Connecticut, Woody Wright's also on the list. He's 38 and used to work as a pharmacy technician until his failing liver made him too sick.\nWOODY WRIGHT: I feel horrible. And, I mean, you know, some of my bones are hurting really bad. I'm anxious. I'm, you know, waiting and just waiting for this liver.\nSTEIN: But only about 6,000 livers are donated each year, so hundreds of patients like Hornbuckle and Wright die every year waiting. And David Mulligan, a transplant surgeon at Yale, says not everyone has the same change to get a liver. It depends a lot on where someone lives.\nDAVID MULLIGAN: Either it's a jackpot and you have very, very easy access to life-saving liver - if you lived in Indiana or if you lived in Louisiana or Florida. But if you lived in California or New York or New England the chances are significantly worse.\nSTEIN: That's because the country is divided into 11 regions and some regions have more livers than others for transplants.\nMULLIGAN: So in the Southeast, for example, or in parts of the Midwest, where there's a higher death rate, there are more donor organs in those areas.\nSTEIN: And the sickest patients in each region get the first crack at every liver. That means patients in the parts of the country that have most livers don't have to be as sick to get a transplant as people who live in other places.\nMULLIGAN: We have this huge disparity.\nSTEIN: Mulligan chairs a committee that's come up with some ideas for making things fair. The country could be divided into much bigger districts - maybe only eight or even four so that livers could be distributed across a much wider area. That would make the chances of getting one about the same no matter where someone lives.\nMULLIGAN: Our goal is to save lives and to be fair and to take this scarce resource and to spread it in a way that will allow us to save lives.\nSTEIN: But this is raising a lot of concerns. Some patients in places that currently have more livers would have to wait longer to get a transplant than they do now. That's because more organs from their area would end up going to sicker patients elsewhere.\nMARTY SELLERS: The impact on patients in our area would be that would increase their risk of dying while they're waiting for a liver transplant.\nSTEIN: That's Marty Sellers, a transplant surgeon at the Piedmont Hospital in Atlanta.\nSELLERS: The longer someone waits for a liver the risk of their dying is higher.\nSTEIN: Sellers and others argue a better solution is to get more people to donate livers in places that need them.\nSELLERS: As opposed to taking organs from parts of the country where risk of dying is lower and shipping them to areas where risk of dying is higher. We don't have enough livers here in Georgia to transplant all the patients that are in need here.\nSTEIN: And some worry the change could end up backfiring by making people less willing to donate organs. Michael Charlton at the Intermountain Medical Center in Utah says one reason a lot of people donate is because they want to help someone in their community.\nMICHAEL CHARLTON: People who live in Texas would prefer for their organs to be transplanted into people who live in Texas rather than to go to New York or Chicago. People feel like that.\nSTEIN: Proponents of changing the system, like Mulligan at Yale, agree that more needs to be done to increase donations. But that takes time. And they dispute the idea that rejiggering things would end up costing lives.\nMULLIGAN: There are patients that are currently receiving liver transplants that could easily wait a little longer so that patients that don't have the option to live can live.\nSTEIN: Now, when you ask patients about this, how they feel tends to depend on where they live. Woody Wright in Connecticut thinks it's a good idea.\nWRIGHT: I don't think it's fair how they're doing it right now, you know. You should not take all for yourself, you know. Share it around, distribution. Let it be fair. There's a lot of sick people out there.\nSTEIN: But Vicki Hornbuckle in Georgia isn't convinced.\nHORNBUCKLE: I'm worried about dying before I get my new liver. Anytime you have to wait behind somebody else and your life depends on it, it makes you worried.\nSTEIN: The nation's organ network is holding a public hearing in Chicago in September to discuss how best to distribute the limited supply of livers for transplantation. Rob Stein, NPR News.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=339579923"}
