{"authors":["Paige Tutt"],"date_download":"2018-10-31 01:35:36","date_modify":"2018-10-31 01:35:36","date_publish":"2014-08-12 19:53:11","description":"Some of the best reality shows combine music, drama, and reality. Oxygen's new series, Sisterhood of Hip Hop , tells the story of five female hip hop artists pursuing careers in the music industry, and you can bet all of the magic ingredients for a…","filename":"data/vaneerConsumption/WhoIsSisterhoodofHipHopsDiamond4ThingsToKnowAbouttheRisingStar.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/aaf9a782-88d6-4880-a4e7-2b9429688234.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35388-who-is-sisterhood-of-hip-hops-diamond-4-things-to-know-about-the-rising-star_1540949736.html","title":"Who Is 'Sisterhood of Hip Hop's Diamond? 4 Things To Know About the Rising Star","title_page":"Who Is 'Sisterhood of Hip Hop's Diamond? 4 Things To Know About the Rising Star","title_rss":"NULL","source_domain":"bustle.com","text":"Some of the best reality shows combine music, drama, and reality. Oxygen's new series, Sisterhood of Hip Hop , tells the story of five female hip hop artists pursuing careers in the music industry, and you can bet all of the magic ingredients for a great series are involved. Some of the women come with sterling endorsements from heavy hitters like Pharrell, Timbaland, Lil Mama, and Chris Brown. Perhaps one of the most well-known names on the Sisterhood of Hip Hop cast roster is Diamond.\nDiamond, also known as Diamond ATL, also known as Brittany Nicole Carpentero or Miss 32 Flavas, has been chasing a music career since she was a teenager. When she was just 14 years old, she joined Atlanta rap clique Crime Mob. Other members of the group included M.I.G., Cyco Black, Princess, Lil' Jay, and Killa C. The group was signed to a variety of record labels and produced a slew of popular hits such as \"Knuck If You Buck,\" \"Rock Yo Hips,\" and \"I'll Beat You Azz\" before disbanding.\nLeaving the group in 2007 didn't really slow her drive. Diamond produced seven mixtapes over the course of about five years. Diamond's most recent mixtape, The Young Life, was released in 2012. What else has this female rap phenom been up to? Quite a bit.\nHELLO LAVENDER\nNothing makes you feel like a brand new person more than a hair cut and color, and Diamond really pulled out all the stops.\nBut, that doesn't mean she's denying where she came from. All of Diamond's old mixtapes are still available on her personal site, and she acknowledges her Crime Mob fame has been crucial in helping her become who she is today and get to where she is today.\nTHE MUSIC IS EVOLVING\nDespite being nominated twice for a BET Award, Diamond isn't relying on her old sound to produce different results. Along with her new style, she is trying some new stuff from her bag of tricks.\nOn Aug. 6, Diamond dropped a freestyle over one of the summer's most popular beats. It's clear she's not messing around.\nYouTube\nSHE Won't Be Overshadowed by the Men In Her Life\nFrederick M. Brown/Getty Images Entertainment/Getty Images\nHaving been romantically involved with Lil Scrappy, who was featured on a few Crime Mob singles, and Soulja Boy, Diamond knows what it's like to live in the shadow of a famous beau. She made it clear in her Sisterhood of Hip Hop introduction video that she wasn't going to be overshadowed by men any longer.\nSHE'S BEEN ENDORSED BY HIP HOP ROYALTY\nFrom Eve to Lil Jon to T.I., multiple artists of note have worked with and endorsed Diamond's flow. She appeared on the official remix of Ludacris' \"My Chick Bad,\" which featured rap and pop powerhouse Nicki Minaj and Trina. Here she is above pictured with T.I.'s wife Tiny, and recording artist/Real Housewife of Atlanta Kandi Burruss.\nThe saying about a diamond in the rough definitely doesn't refer to this gem anymore. Diamond has proved countless times that she's a female force to be reckoned with in a predominantly male-driven genre. With the likes of Nicki Minaj and Iggy Azalea changing the way people see women in rap, Diamond has got an incredible amount of competition but she is no doubt initiated into the Sisterhood of Hip Hop.\nImages: Oxygen; Diamondatl /Instagram (3); Getty","url":"https://www.bustle.com/articles/35388-who-is-sisterhood-of-hip-hops-diamond-4-things-to-know-about-the-rising-star"}
