{"authors":["Parry Ernsberger"],"date_download":"2018-10-31 01:52:19","date_modify":"2018-10-31 01:52:19","date_publish":"2018-09-13 20:25:38","description":"Rachel Brosnahan's starring role in Amazon's break-out hit show, The Marvelous Mrs. Maisel, has earned her a 2018 Emmy nomination for Lead Actress In A Comedy Series. With this year's award ceremony rapidly approaching, some fans might be wondering…","filename":"data/vaneerConsumption/WhoIsRachelBrosnahanDatingTheMrsMaiselStarWasRecentlyLinkedToAFellowActor.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/7844236f-09f4-49b3-8533-b7ae00d330b4-619c83a0-4068-4241-8463-b9091dcc1013-getty-903958990-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_who-is-rachel-brosnahan-dating-the-mrs-maisel-star-was-recently-linked-to-a-fellow-actor-11907902_1540950739.html","title":"Who Is Rachel Brosnahan Dating? The 'Mrs. Maisel' Star Was Recently Linked To A Fellow Actor","title_page":"Who Is Rachel Brosnahan Dating? The 'Mrs. Maisel' Star Was Recently Linked To A Fellow Actor","title_rss":"NULL","source_domain":"bustle.com","text":"Rachel Brosnahan's starring role in Amazon's break-out hit show, The Marvelous Mrs. Maisel, has earned her a 2018 Emmy nomination for Lead Actress In A Comedy Series. With this year's award ceremony rapidly approaching, some fans might be wondering who Rachel Brosnahan is dating. Will she have an escort as she walks down the red carpet, or will she opt to fly solo? Her current love-life status isn't entirely clear, but as of a few months ago, she was in a long-term relationship with fellow actor, Jason Ralph.\nSo, there's not a whole lot of information out there about Brosnahan and Ralph — who's best-known for playing Quentin Coldwater on The Magicians — as a couple. Neither one of the stars has really opened up about one another during interviews, and they haven't really put their love on display via social media, either.\nAccording to PopSugar, the pair first met while working on the WGN series Manhattan back in 2015. The outlet also noted that both Brosnahan and Ralph wear bands on *those* ring fingers, but they've never confirmed whether or not they got hitched.\nIt's not like their relationship has ever been completely secret, though. They've walked a ton of red carpets together over the years, and pretty much always look like they're head-over-heels in love.\nAstrid Stawiarz/Getty Images Entertainment/Getty Images\nEarlier this year, Ralph accompanied his lady to the 2018 Golden Globes in January — where Brosnahan won Best Actress in a TV Series for Mrs. Maisel — and was by her side when she won the Critics' Choice Award for Best Actress in a Comedy Series that month, too. They were spotted together at the 2018 New York Theatre Workshop Gala in April, according to JustJared, but have been kind of M.I.A. from the public eye since then.\nOf course, just because they haven't been photographed in public as of late, by no means indicates that they've split up. It's not like either one of them are Kardashian-level celebrities — that isn't necessarily good or bad, by the way, simply a statement — so the paparazzi probably aren't following their every move.\nBesides, Brosnahan's been busy filming the second season of Mrs. Maisel — which has already been renewed for Season 3, Variety reported in May — and Ralph's been shooting Season 4 of The Magicians this year as well. According to IMDb, the former series is shot primarily in New York, while the latter films mostly in Vancouver, British Columbia, Canada.\nJoe Scarnici/Getty Images Entertainment/Getty Images\nThat being said, it's definitely possible that the two busy actors have been doing the long-distance thing in recent months. That would totally explain why they haven't been photographed together lately.\nRegardless, if Brosnahan and Ralph are still a happy couple, there's a good chance he'll be by her side for the 2018 Emmy Awards on Sept. 17. The Marvelous Mrs. Maisel is up for multiple awards this year — including Brosnahan for Lead Actress in a Comedy Series and the show itself for Comedy Series — so it's bound to be a big night for everyone involved.","url":"https://www.bustle.com/p/who-is-rachel-brosnahan-dating-the-mrs-maisel-star-was-recently-linked-to-a-fellow-actor-11907902"}
