{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 22:56:41","date_modify":"2018-10-30 22:56:41","date_publish":"2014-08-14 16:32:00","description":"ICYMI, American Horror Story producer Ryan Murphy announced over Twitter that the tiniest woman in the world, Jyoti Amge, will join the cast of American Horror: Freak Show . While Murphy didn't yet say who Amge would be playing — hell, we don't…","filename":"data/vaneerConsumption/WhoIsJyotiAmgeTheWorldsSmallestWomanTheAHSFreakShowStarHasBigActingDreams.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/48633dce-0da0-49c5-9a89-1ad289ea6758.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35779-who-is-jyoti-amge-the-worlds-smallest-woman-the-ahs-freak-show-star-has-big-acting_1540940201.html","title":"Who Is Jyoti Amge, The World's Smallest Woman? The 'AHS: Freak Show' Star Has Big Acting Dreams","title_page":"Who Is Jyoti Amge, The World's Smallest Woman? The 'AHS: Freak Show' Star Has Big Acting Dreams","title_rss":"NULL","source_domain":"bustle.com","text":"ICYMI, American Horror Story producer Ryan Murphy announced over Twitter that the tiniest woman in the world, Jyoti Amge, will join the cast of American Horror: Freak Show . While Murphy didn't yet say who Amge would be playing — hell, we don't even have a teaser trailer yet — we still have a few months to get to know the latest addition to the show. So, who is Jyoti Amge?\nAccording to The Guinness Book of World Records, the 20-year-old Amge is the smallest living woman in the world, who measures up to 23 inches and weighs in at 11 pounds on account of her dwarfism, called achondroplasia. However, despite her small stature, the young woman from India has always had big dreams. Back in 2011, Guinness reported that she had aspirations of being a Bollywood actress. Her size, which Guinness mentioned necessitates her having special clothes, jewelry, and silverware made, has not been detrimental to her career. In fact, in 2008, a Fox News story mentioned that she released an album with the Indian pop star Mika Singh, and at the time, she said she had even bigger aspirations:\nI would like to work in a big city like Mumbai, act in films and travel to London and America.\nIn 2012, she appeared on the show Bigg Boss . At the time, she mentioned that she had zero qualms with her size:\nI am not sad and don’t have any issues about being short. I am famous because of it and even got two Guinness Records. People talk, but I don’t pay attention. How does it matter? I focus on my work. Some people put me down, but there are others who support me, too.\nClearly, that's evident, considering that Amge is now gearing up to star in the huge hit that is American Horror Story, and it looks like the dreams she spoke about a few years ago are coming true. So, yes — this girl may be little, but she's always had big plans, and it's pretty apparent that they're all coming to realization now.\nImage: MrRPMurphy/Twitter","url":"https://www.bustle.com/articles/35779-who-is-jyoti-amge-the-worlds-smallest-woman-the-ahs-freak-show-star-has-big-acting"}
