{"authors":["Lindsay Denninger"],"date_download":"2018-10-31 00:02:42","date_modify":"2018-10-31 00:02:42","date_publish":"2018-10-28 11:00:29","description":"Behind every great performer in Hollywood is a great writer. Sure, you can be both, but writers like myself tend to want to stay in little caves, drinking coffee, having snacks, and letting someone else do the talking. Which is why Busy Phillipps…","filename":"data/vaneerConsumption/WhoIsKellyOxfordOnBusyTonightTheWriterActressIsKnownForHerInternetWit.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/26/4a7d36ef-781a-4b6b-b058-3902f23b1a35-screen-shot-2018-10-26-at-122307-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_who-is-kelly-oxford-on-busy-tonight-the-writer-actress-is-known-for-her-internet-wit-12633762_1540944162.html","title":"Who Is Kelly Oxford On 'Busy Tonight'? The Writer & Actress Is Known For Her Internet Wit","title_page":"Who Is Kelly Oxford On 'Busy Tonight'? The Writer & Actress Is Known For Her Internet Wit","title_rss":"NULL","source_domain":"bustle.com","text":"Behind every great performer in Hollywood is a great writer. Sure, you can be both, but writers like myself tend to want to stay in little caves, drinking coffee, having snacks, and letting someone else do the talking. Which is why Busy Phillipps gathered a group of hilarious women to help her write her new talk show on E!, Busy Tonight. One of those Busy Tonight writers, Kelly Oxford, also happens to be one of Busy's BFFs, a New York Times best-selling writer, actress, a seriously funny social media presence. (Comedians Jenny Yang and Shantira Jackson are also on the writing team.)\nAccording to her bio from her book publisher, HarperCollins, Oxford was born in Edmonton, Canada, and she “likes poodles and PBS.” Oxford rose to fame on Twitter in the early 2010s, when she was a very young stay-at-home mother with three kids and the Internet was the only outlet for her thoughts — and those of her kids. Her daughter Bea, was the source of inspiration for a lot of them. (Fun Instagram fact: Kelly and Busy's daughters are also friends. Seriously hope they can make a cameo some night.)\nIn a 2013 interview with The Globe And Mail, Oxford said that she had been “putting stuff online forever” and had “always just done what [her passion is],” but getting a big break from her Twitter posts and moving to Los Angeles was something she couldn’t pass up. “All of a sudden I get this opportunity and I get these agents calling me and I'm like, 'Oh right, [staying at home is] not going to happen.” From those tweets came two books, Everything is Perfect When You’re a Liar and When You Find out the World Is Against You: And Other Funny Memories about Awful Moments, multiple pilots, film scripts, and more.\nOxford is also an actress, with small roles in Sharknado 2: The Second One, Aloha, and, most recently, The Disaster Artist with James Franco. Now, Oxford is behind the scenes at Busy Tonight, writing (with, you know, a team of super talented women writers) all of the fun jokes we’re sure to laugh along with as Philipps interviews the myriad guests that have already signed up for the show. (Tina Fey has also just signed on as an executive producer, so that's a good sign, too.) If Oxford’s Instagram is any indication, the writing process looks like it’s been pretty amazing. To be honest, I kind of want an invite.\nOxford In Some Signature Sunglasses\nWith The Rest Of The Hilarious Women Behind The Show\nAnd With Busy Herself\nOxford is a very funny lady, but she's not all fun and games. When the Access Hollywood tape of Donald Trump and Billy Bush making obscene remarks came out, Oxford tweeted, “Women tweet me your first assaults. They aren’t just stats. I’ll go first: Old man on city bus grabs my ‘p-y’ and smiles at me. I’m 12.” Her hashtag, #NotOkay, spawned thousands of women to share their own assaults.\nOf the response, Oxford told Chatelaine, “It was really overwhelming. The first night the hashtag started, I didn’t really move and I didn’t go to sleep until the next day... I honestly think because of the way Trump framed it, as a no-big-deal-ha-ha-ha thing, some of the shame I felt around being assaulted dissipated. If they were willing to laugh about it, then I was willing to say, no, f–k you about it.”\nThe outspoken Oxford isn't afraid to say what she thinks, no matter the subject. Hopefully for Busy Tonight, this translates into topical humor with an edge. Whatever she and the rest of the team come up with will certainly be fun to watch.","url":"https://www.bustle.com/p/who-is-kelly-oxford-on-busy-tonight-the-writer-actress-is-known-for-her-internet-wit-12633762"}
