{"authors":["Genevieve Van Voorhis"],"date_download":"2018-10-31 00:02:10","date_modify":"2018-10-31 00:02:10","date_publish":"2018-10-28 18:00:29","description":"Whoever said \"you can't have it all\" clearly hadn't met the Ladygang. The three women that host the successful celebrity podcast — Keltie Knight, Becca Tobin, and Jac Vanek — have all had impressive and accomplished careers even before they decided…","filename":"data/vaneerConsumption/WhoIsJacVanekFromLadygangTheFashionDesignerTurnedEntrepreneurIsMakingHerTVDebut.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/23/1207fa2b-775e-491f-9c42-9df849ddff43-getty-619122854.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_who-is-jac-vanek-from-ladygang-the-fashion-designer-turned-entrepreneur-is-making-her-tv-debut-12637074_1540944130.html","title":"Who Is Jac Vanek From 'Ladygang'? The Fashion Designer Turned Entrepreneur Is Making Her TV Debut","title_page":"Who Is Jac Vanek From 'Ladygang'? The Fashion Designer Turned Entrepreneur Is Making Her TV Debut","title_rss":"NULL","source_domain":"bustle.com","text":"Whoever said \"you can't have it all\" clearly hadn't met the Ladygang. The three women that host the successful celebrity podcast — Keltie Knight, Becca Tobin, and Jac Vanek — have all had impressive and accomplished careers even before they decided to join forces in 2015. Now, they're about to become the hosts of their very own reality TV series on E!, also titled Ladygang, which premieres on Sunday, Oct. 28. While Tobin is no stranger to the spotlight from her days on Glee and Knight has seen her share of cameras as an entertainment journalist, this grand entrance into the world of television is a first for Ladygang's Jac Vanek.\nA California native, Vanek was born and raised in Orange County, according to Racked LA. After going to her first concert in high school, Vanek got a whiff of the pop punk scene in her home state, which laid the groundwork for what would become her signature grunge designs. While studying Media Arts at UCLA, she designed her first bracelet: a rubber strap with the word \"Ruthless\" written on it. From there, she launched Jac Vanek, the self-titled brand she runs today.\nBack in 2011, Vanek explained how she started her company in an interview with Infectious Magazine.\n\"Well, my company is named Jac Vanek, obviously it’s my name and it’s an accessories and T-shirts company I started when I was in college. I made one bracelet, gave a few to my friends and the pictures kinda circulated through the internet and I started getting a big demand out on them, so I started making a bunch of different bracelets, and I’ve moved on to other accessories and T-shirts, stuff like that.\"\nTalking about her venture into design, she told Racked LA, \"I kind of just did it to make some money because I didn't want to get a real job.\"\nLater, she started selling apparel and accessories at music festivals around the country. In an interview with GirlTalk in 2013, she explained the challenges she faced trying to get her brand off the ground. \"It was such a weird thing because, especially at the Warped Tour and stuff, it's very male-dominated, and the women are not... taken that seriously,\" Vanek said. \"So it was very, very hard kind of overcoming that and kind of proving to people that I'm serious and this is a real business for me.\"\nGirltalk HQ on YouTube\nNowadays, it's hard to imagine anyone failing to take Vanek seriously, as the CEO and founder of her own company and soon-to-be co-host of her very own E! talk show. But if anyone was worried that all that success might have gone to her head, Vanek revealed to Medium that — like everyone — she's not immune from imposter syndrome and other negative feelings. \"I also constantly feel like I’m failing or being a total phony,\" she explained, \"but what I’ve learned is everyone is kind of falling apart on the inside in some way or another, and that’s okay. It’s human.\"\nIndeed, it is human. And it's also part of what makes Vanek such a terrific, insightful part of the Ladygang trio.","url":"https://www.bustle.com/p/who-is-jac-vanek-from-ladygang-the-fashion-designer-turned-entrepreneur-is-making-her-tv-debut-12637074"}
