{"authors":[],"date_download":"2018-10-30 18:28:09","date_modify":"2018-10-30 18:28:09","date_publish":"2018-08-22 12:06:00","description":"Cristhian Bahena Rivera, a Mexico native who allegedly was living in the U.S. illegally, kidnapped and killed the 20-year-old University of Iowa student, who vanished during a run in Brooklyn, Iowa, last month.","filename":"data/vaneerConsumption/WhoisCristhianBahenaRiverasuspectinMollieTibbettsdeath.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/08/22/Videos/4466429.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_who-cristhian_7d4d3140b2d5fdc892cdc313fa6317f9__1540924089.html","title":"Who is Cristhian Bahena Rivera, suspect in Mollie Tibbetts' death?","title_page":"Who is Cristhian Bahena Rivera, suspect in Mollie Tibbetts' death?","title_rss":"NULL","source_domain":"ajc.com","text":"A 24-year-old man has been charged with first-degree murder in the death of Iowa college student Mollie Tibbetts, authorities said Tuesday.\nAccording to The Associated Press, police said Cristhian Bahena Rivera, a Mexico native who allegedly was living in the U.S. illegally, kidnapped and killed the 20-year-old University of Iowa student, who vanished during a run in Brooklyn, Iowa, last month.\n>> Suspect in death of Mollie Tibbetts being held on federal immigration detainer\nHere's what we know about Rivera:\nCristhian Bahena Rivera arrested and charged with 1st Degree Murder in killing of Mollie Tibbetts. @weareiowa5news pic.twitter.com/sheVZalv7M — Mario Rossi (@mariovrossi) August 21, 2018\n1. Authorities said Rivera confessed to killing Tibbetts and led investigators to a body believed to be hers. Investigators said they questioned Rivera on Monday after determining that a Chevy Malibu caught on surveillance video was connected to him.\nAccording to the arrest affidavit, Rivera was \"driving back and forth\" near where Tibbetts was jogging on July 18. The affidavit said Rivera told investigators that he got out of the car and ran next to her, prompting Tibbetts to pull out her cellphone and threaten to call the police.\nRivera claimed he then blacked out \"and doesn't remember anything after that until he came to at an intersection\" in his car, the affidavit said, adding that Rivera realized that he had put Tibbetts in his trunk when he \"noticed there was an ear piece from headphones in his lap.\" He said he then drove to a cornfield, dragged Tibbetts' bloody body to a \"secluded location\" and covered her body with corn stalks, according to the affidavit.\nHe later led police to the area, where they found a body matching Tibbetts' description, the affidavit said.\nAn undocumented immigrant has been charged with first-degree murder in the presumed death of Mollie Tibbetts, an Iowa college student who went missing on July 18, officials said https://t.co/Rp1Q2fvb5P pic.twitter.com/hFZxlhqvoC — CNN (@CNN) August 21, 2018\n2. ICE officials lodged a federal immigration detainer for Rivera after his arrest. \"That move means the agency has probable cause to believe he is subject to deportation,\" the AP reported.\nRivera's Facebook page said he is from Guayabillo in Guerrero, Mexico, according to the AP.\n3. Authorities believe Rivera had been living in the Brooklyn, Iowa, area for as long as seven years. Officials said he \"lived in a rural area and kept to himself,\" the AP reported.\n4. He worked for Yarrabee Farms, a dairy farm owned by the family of prominent Iowa Republican Craig Lang. \"This individual has worked at our farms for four years, was vetted through the government's E-Verify system, and was an employee in good standing,\" Yarrabee Farms said in a statement Tuesday, according to ABC News. \"On Monday, the authorities visited our farm and talked to our employees. We have cooperated fully with their investigation.\"\n>> Read more trending news\n5. President Donald Trump spoke about Rivera's arrest Tuesday at a West Virginia rally. \"You heard about today with the illegal alien coming in, very sadly, from Mexico and you saw what happened to that incredible, beautiful young woman,\" Trump said, according to the AP. \"Should've never happened. Illegally in our country. We’ve had a huge impact, but the laws are so bad. The immigration laws are such a disgrace, we're getting them changed, but we have to get more Republicans. We have to get 'em.\"\n>> See the clip here\nPresident Trump on Mollie Tibbetts case: \"It should have never happened.\" https://t.co/0DPqNPjQGk https://t.co/QgqXnAxNUw — HLN (@HLNTV) August 22, 2018\n– The Associated Press contributed to this report.","url":"https://www.ajc.com/news/national/who-cristhian-bahena-rivera-suspect-mollie-tibbetts-death/dI9mr96S5FC3zkWSHA4uuN/"}
