{"authors":["Emily Dixon"],"date_download":"2018-10-31 00:02:35","date_modify":"2018-10-31 00:02:35","date_publish":"2018-10-28 11:30:20","description":"Tonight sees the premiere of Park Chan-wook's The Little Drummer Girl, a six-part BBC adaptation of John le Carré's 1983 thriller. The cast is headed up by Florence Pugh as Charlie, a struggling actor turned spy recruit, alongside Michael Shannon…","filename":"data/vaneerConsumption/WhoIsFlorencePughTheLittleDrummerGirlActorHasBeenCalledTheNextKateWinslet.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/28/fe357120-fdae-4493-8ad1-2d661d228ec8-16735827-high_res-the-little-drummer-girl.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_who-is-florence-pugh-the-little-drummer-girl-actor-has-been-called-the-next-kate-winslet-13009240_1540944155.html","title":"Who Is Florence Pugh? 'The Little Drummer Girl' Actor Has Been Called The Next Kate Winslet","title_page":"Who Is Florence Pugh? 'The Little Drummer Girl' Actor Has Been Called The Next Kate Winslet","title_rss":"NULL","source_domain":"bustle.com","text":"Tonight sees the premiere of Park Chan-wook's The Little Drummer Girl, a six-part BBC adaptation of John le Carré's 1983 thriller. The cast is headed up by Florence Pugh as Charlie, a struggling actor turned spy recruit, alongside Michael Shannon and Alexander Skarsgård. So who is Florence Pugh? The 22-year-old's only been acting professionally since 2014, but she's already drawing comparisons to the Hollywood greats (\"the next Kate Winslet\" is pretty much a mandatory phrase in Pugh profiles by this point). Already recognise the actor? Here's where you've seen her before.\nPugh, born and raised in Oxford, landed her first film role while studying for her A-levels, according to the Guardian. She starred alongside Game of Thrones' Maisie Williams in the 2014 film The Falling, a mystery drama about a baffling fainting epidemic at a girls' boarding school. She also played Cara Thomas in the first series of the Anna Friel-led detective drama Marcella, which debuted on ITV in 2016.\nIt was Pugh's role in 2016's Lady Macbeth, however, that really cemented her breakthrough. The actor led the 1800s period drama as Katherine, a young woman bartered into a transactional marriage who proves ruthlessly unwilling to accept her unhappy fate. \"It’s a cheeky film, isn’t it?\" Pugh told the Radio Times. \"It gives in to all your secret hopes about what you want stories to turn into. You’re like: 'OK! Cool! Kill everyone!' Love it.\"\nBBC on YouTube\nIn 2018, Pugh appeared in Liam Neeson thriller The Commuter as Gwen, while she played Cordelia to Anthony Hopkins' Lear in the BBC's critically lauded adaptation of King Lear the same year. Pugh met Emma Thompson on the set (Thompson played Goneril), she told the Guardian, as the Harvey Weinstein allegations broke. \"The industry was so sad and so desperate for leadership that to come into work and be around Emma, and Emily Watson, and that loud female wisdom all day was so powerful,\" Pugh said. \"There wasn’t a day she didn’t educate me on something, or give me a book or podcast to listen to.\"\nWhat's next for Florence Pugh? After The Little Drummer Girl, she'll appear as Elizabeth de Burgh in Netflix's Outlaw King, a 14th century period drama starring Chris Pine as Robert the Bruce. Next, there's Fighting With My Family, a comedy drama led by Dwayne Johnson. And in 2019, she'll head up Midsommar, the next horror film from Hereditary director Ari Aster. Unsurprisingly, Pugh hasn't had a spare second to put down roots. \"I don’t have a home,\" she told the Guardian. “With the life I’ve been lucky enough to live in the last two years, I’ve had to live out of bags.”\nTim P. Whitby/Getty Images Entertainment/Getty Images\nThere's also the small matter of the impending Greta Gerwig adaptation of Louisa May Alcott's Little Women, in which Pugh will play Amy March. Also in the cast? Timothée Chalamet, Emma Watson, Saoirse Ronan, and Meryl Streep (as Laurie, Meg, Jo, and Aunt March respectively.)\nThe Little Drummer Girl airs tonight at 9 p.m. on BBC One, according to the Radio Times. And if it's anywhere near as successful as 2016's The Night Manager, it's likely to send Florence Pugh well on her way to Kate Winslet status.","url":"https://www.bustle.com/p/who-is-florence-pugh-the-little-drummer-girl-actor-has-been-called-the-next-kate-winslet-13009240"}
