{"authors":["Keertana Sastry"],"date_download":"2018-10-30 23:55:09","date_modify":"2018-10-30 23:55:09","date_publish":"2014-08-12 21:14:56","description":"As if getting turned into a demon wasn't bad enough. In Supernatural 's upcoming Season 10, Dean will not only deal with his new demon identity, but also a face from his past that will be looking for him. According to Entertainment Weekly's…","filename":"data/vaneerConsumption/WhoIsColeinSupernaturalSeason10WhyIsHeLookingForDean3PossibleExplanations.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/b868ebef-de02-4ada-947f-37c2dfc4e2c6.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35417-who-is-cole-in-supernatural-season-10-why-is-he-looking-for-dean-3-possible_1540943709.html","title":"Who Is Cole in 'Supernatural' Season 10 & Why Is He Looking For Dean? 3 Possible Explanations","title_page":"Who Is Cole in 'Supernatural' Season 10 & Why Is He Looking For Dean? 3 Possible Explanations","title_rss":"NULL","source_domain":"bustle.com","text":"As if getting turned into a demon wasn't bad enough. In Supernatural 's upcoming Season 10, Dean will not only deal with his new demon identity, but also a face from his past that will be looking for him. According to Entertainment Weekly's interview with showrunner Jeremy Carver, a man named Cole will be searching for Dean, while Sam is also trying to find his brother after he disappeared from the hospital where he was last seen.\nWho is this mystery man and what do we know about him so far? As we've already been told Season 10 will begin with Dean being on his own as his brother has already spent quite some time looking for him. But Cole will not be one of the many people Dean has met during his demon days, he is from Dean's past before the black-eyed transformation. So why is he looking for Dean now? Where and when could have met Dean? We also don't know if Cole knows that Dean is now a demon. Will that change the reason he's looking for Dean? Knowing this show, it's only going to make things worse. But if we know that Cole is only looking for Dean and not Sam, that could narrow down a few potential clues for his relationship with the older Winchester brother.\nWe know that there have been a few times that Dean has been separated from his brother in the past. So it's possible that Cole and Dean had a friendship or something worse during the non-Sam days.\nCole And Dean Could Know Each Other From Their Boy's Home Days\nRemember when we all found out that Dean was in a boy's home for a few months because John basically deserted him for a while? Yeah, I do too, because it seemed to be the time when Dean was actually at his happiest. Perhaps Cole is someone we weren't able to meet when Dean revisited the home later in life. Cole could have been another kid living at the house with whom Dean either became friends or did not get along with. Either way, it could make for interesting television to see why he'd be looking for Dean now.\nCole And Dean Met During Dean's Days Without Sam\nThere are many moments throughout the series and even before the series began that Dean has hunted without his brother. It's entirely possible that Cole was someone with whom Dean teamed up and now something bad has happened to Cole that is making him search for Dean. But in this case, finding Dean in demon form probably won't instill confidence in the guy.\n3. Cole And Dean Know Each Other From Dean's Time In Purgatory\nThis one worries me the most. If Cole is someone (or something) Dean met in Purgatory, how come we haven't heard about him until just now? Most likely it's because he's bad news. The only person we know to be friends with Dean from Purgatory was Benny and he was a surprisingly kind and good vampire that Sam never trusted until it was too late. Could Cole be a creature that Dean and Benny encountered together and tried to stop one before? Does that mean he's out for blood now? Or does he need Dean's help? In this case, perhaps it wouldn't be such a bad thing for Dean to have a little demon help on his side.\nImages: The CW; iamjensensbitch, rphdegrassi, not geniusjustclevererthanyou, adeliadekne/Tumblr","url":"https://www.bustle.com/articles/35417-who-is-cole-in-supernatural-season-10-why-is-he-looking-for-dean-3-possible"}
