{"authors":["Shona Sibary For The Daily Mail"],"date_download":"2018-10-22 20:22:59","date_modify":"2018-10-22 20:22:59","date_publish":"2016-01-29 01:19:16","description":"SHONA SIBARY: According to recent research, I am not alone in my feeble ability to flush out fibbing in my children, Flo, 17, Annie, 15, Monty, 13, and even little Dolly, six.","filename":"data/vaneerConsumption/Whoisabetterliaryouoryourteenager.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AE695D00000578-0-image-a-51_1454032332685.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422062_Who-better-liar-teenager_1540239779.html","title":"Who is a better liar - you or your teenager?","title_page":"Who is a better liar - you or your teenager? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The first time my son, Monty, lied to me was when he was two years old. We’d just had our beautiful Edwardian hallway painted in expensive Farrow and Ball ‘French Gray’.\nIt looked perfect except for a single line of indelible black marker stretching along the dado rail from the front door to the first floor landing.\nI took one look at my blond, cherubic son and said: ‘Monty? Was this you?’\nSHONA SIBARY: According to research, I am not alone in my ability to flush out fibbing in my children. But it seems help may be at hand. There is a lie detector that can be bought online and connected to any PC\nHis big blue eyes filled with tears and he shook his head, innocent as an angel. If it hadn’t been for the fact his fingers were covered in black ink and he was still clutching the offending pen I would have fallen, headlong, for his fib.\nFast forward 11 years and I still struggle to believe that my lovely boy is capable of lying to me.\nExcept that I know he does. It wasn’t the tobacco fairy who put that cigarette in his school coat pocket a few weeks ago.\nBut he argued so eloquently and presented such a case for it belonging to someone else that, call me stupid, I did question whether I was going completely mad.\nAccording to recent research, I am not alone in my feeble ability to flush out fibbing in my children, Flo, 17, Annie, 15, Monty, 13, and even little Dolly, six.\nA study has found that teenagers are the best liars of all because of their ability to think fast. Scientists discovered that around 60 per cent of children aged between 13 and 17 tell up to five lies a day.\nThey are also the most successful age range at not getting caught, with experts claiming this is because the prefrontal cortex in the brain — the area just behind the forehead, associated with planning and problem-solving, and also the area most affected by the ravages of time — is still firing on all cylinders.\nShona Sibary with son Monty taking a lie detector test at home in Devon - the pair tested one another\nThis must be some cruel Darwinian joke. Take the most high-risk group in society — hormonal and hard-wired to raise hell and break all the rules — and then give them the gift of being brilliant liars.\nThat’s genius, Mother Nature. Thanks for yet another sleepless night.\nBut it seems help may be at hand. There is a lie detector that can be bought online and connected to any home PC.\nIf you don’t trust your teenager and, like me, truly want to find out how much wool is being pulled over your eyes, then this could be the answer.\nThe Polygraph Machine Home Testing Kit comes with everything you need to conduct your own KGB-style interrogation. All you have to do is insert a CD into your home PC or laptop and follow the online instructions to load the software.\nThe way lie detectors work is by measuring certain physical reactions when the body is under stress, including heart rate, breathing patterns, blood pressure and sweat secretion — all uncontrollable by-products of telling particularly uncomfortable porkies.\nWhen they are added up, a pattern is formed and a lie can quickly be detected. Or so the theory goes.\nEverything you need is in the box. The chest strap, to monitor your heart rate, goes around your body under your bust and is fastened with a clasp.\nTwo Velcro straps around the index and second fingers on your left hand measure sweat and, finally, a plastic clip on the first finger of your right hand reads your pulse.\nAll these sensors are attached via cables to a USB plug, which then connects to the computer.\nAccording to the manufacturer, the lie detector is accurate from 80 per cent to 99 per cent of the time.\nBut what it can’t possibly know is that Monty’s favourite TV programme is Lie To Me — a U.S. drama about a genius body language expert, which also manages to be a masterclass in how to be the best liar possible.\nMonty was surprisingly keen to test the machine, saying he’d already mastered the art of not looking shifty by ‘resisting the urge to look up to the left and touch your nose’, tell-tale signifiers of guilt he’d obviously heard about on the TV.\nShona and Monty agreed to ask ten questions each. These are keyed into the computer before the test\nHe was also super-confident that he could breeze through whatever questions I threw at him.\nBut he had one condition; he would be allowed to test me, too. I wasn’t a bit worried. Honest (am I sweating here?).\nWe agreed to ask ten questions each. These are keyed into the computer before the test — along with ‘base’ questions such as ‘Are you female?’ and ‘Are you sitting down?’ to demonstrate what the screen looks like when you are definitely telling the truth.\nOnce you are hooked up and have entered your questions, a graph appears on the computer with three lines — blue, green, and red — showing your pulse, movement and breathing patterns. It’s quite simple. Tell the truth and these lines don’t move. If you’re lying, they do.\nThe person interrogating looks at the screen.\nOnce they click to start, the computer displays the first question which you read out loud. The person being tested has 15 seconds to answer.\nThe computer then comes back with a verdict: Truth, Lie or Undetermined.\nThere is also a ‘bad body language’ button which can be clicked if the interviewee shows any suspicious physical signs such as excessive blinking or twitching. All this does is give the computer extra information to analyse responses.\nI opted to be interrogated first. It is suggested in the instruction manual that you enter questions requiring only a simple yes or no answer.\nSo, in true Jeremy Kyle spirit, Monty fired away . . .\nMonty was super-confident that he could breeze through whatever questions I threw at him. But he had one condition; he would be allowed to test me, too. I wasn’t a bit worried. Honest (am I sweating here?)\nWHAT MY SON ASKED ME\n‘Are you my real mother?’\nMe: Yes.\nComputer: True.\nMy verdict: Typical Monty sense of humour. Also happens to be true.\n‘Do you have a favourite child?’\nMe: No.\nComputer: Lie.\nMy verdict: Argh! As if I’m going to admit that. Computer is right again, but no, I’m not telling you who it is. Usually I’d say my favourite child of the four is the one most willing to help me out around the house at any given moment — and that can change on a daily basis.\nBut seriously, it would be impossible to choose because they’re all so different. I love Flo’s spirit and headstrong nature and Monty’s charming quirkiness. Dolly’s still so little and sweet, while Annie is really helpful and always positive about life.\n‘Have you ever regretted having children?’\nMe: No.\nComputer: Lie.\nMy verdict: This surely can’t be answered with a simple yes or no? Obviously there are days when I’m tearing my hair out and wishing I was alone on a desert island, but then I look at my children and can’t imagine a life without them.\n‘Have you ever broken the law?’\nMe: Yes.\nComputer: True.\nMy verdict: I once stole a mascara from the chemist. I was 15. Computer is right.\nHave you ever taken drugs?\nMe: No.\nComputer: True.\nMy verdict: The computer is right on this one.\n‘Do you wish we hadn’t moved to Devon?’\nMe: No.\nComputer: Lie.\nMy verdict: Right again. How can it know me this well? I often miss our life back in Surrey and wonder whether decamping the entire family to remote North Devon was actually a good idea. We moved in June 2013, hoping to give our children a good rural life by the sea in a glorious holiday destination. But in winter when there’s no one here, you do start thinking: ‘What have we done?’\nDo you still fancy Dad?\nMe: Yes.\nComputer: True.\nMy verdict: Phew. Right again. We’ve been married 16 years and I’ve known him for more than half my life. He’s my soul mate.\nAre you content with your life?\nMe: Yes.\nComputer: Lie.\nMy verdict: I am content with my life. I think. But am I just kidding myself? Is there a nagging ache I’m not admitting to? I’m worried now.\nWould you like to be slimmer?\nMe: Yes.\nComputer: True.\nMy verdict: Who wouldn’t?\nDo you snoop on my phone?\nMe: Yes.\nComputer: True.\nMy verdict: Again, top marks. Any mother who doesn’t do this is stupid, in my opinion. I don’t think a 13-year-old has a right to privacy — and I’ve found quite a few things on his phone in the past. Inappropriate texts using bad language, or things he’s said online that I know he’d never say to someone’s face.\nI’ve even caught him communicating with total strangers — he has 1,400 Facebook friends! I tell him: ‘Every time you send a text, you need to ask, what would Mum think of this?’\nAccuracy: 8/10\nShona says: Some questions were harder to answer with ‘yes’ or ‘no’. ‘Do I regret having children?’ No, obviously. But there have been odd occasions, usually after a very bad parenting day, where the thought has flickered through my mind\nWhat I learned: I don’t know what I was expecting Monty to ask, but his list of questions completely threw me. I had anticipated a question about drugs and had no problem telling the truth there — I’ve never taken anything.\nSome questions were harder to answer with ‘yes’ or ‘no’. ‘Do I regret having children?’ No, obviously. But there have been odd occasions, usually after a very bad parenting day, where the thought has flickered through my mind.\nI think I must have faltered slightly here because the computer picked up that I was lying. I wasn’t. I just think the nature of the question made me feel stressed.\nDitto, ‘Are you content with your life?’ On balance, yes. Yet the computer thought I was lying — so maybe it knows something I don’t. After all, how can you reliably know this from one day to the next when life has so many ups and downs? Still, the computer picked up on something about the question itself that caused me anxiety, which does make me think that perhaps something is not quite right.\nI usually insist I’m fine and cling to my British stiff upper lip, but this test has revealed there are areas of my life that are far from perfect. Am I truly content? More or less.\nIt’s pretty galling to admit, but the computer was almost entirely accurate. There was only one question where deliberately I lied to test it: ‘Do you wish we hadn’t moved to Devon?’ I said ‘No.’\nActually, I do miss Surrey, and it’s for the very reasons we left — the hustle and bustle and the competitiveness of life in the cut and thrust of the commuter belt.\nMonty’s questions were really insightful from a 13-year-old. He’s obviously noticed certain things I’d rather he was happily oblivious to.\nThe question about wishing I was slimmer worries me — how often do I harp on about the fact I’m not happy with my body in my children’s hearing? I wouldn’t want them to think I’m not happy with myself, but clearly Monty knows. Luckily, I could set him straight on whether I still fancy his dad — but it makes me think about how much it affects the children when we argue, as any married couple does.\nI thought the point of this test was for me to find out about Monty — but maybe there’s more serious things he wants to know about me!\nMonty was surprisingly keen to test the machine, saying he’d already mastered the art of not looking shifty by ‘resisting the urge to look up to the left and touch your nose’, tell-tale signifiers of guilt\nWHAT I ASKED MY SON\n‘Have you ever smoked?\nMONTY: Yes.\nComputer: True.\nMONTY'S verdict: It’s right. I have experimented with smoking very occasionally. Mum knows this, so I’m not going to lie.\n‘Are you smoking regularly?\nMONTY: No.\nComputer: True.\nMONTY'S verdict: What counts as ‘regularly?’ Anyhow, computer right again.\n‘Have you ever helped yourself to alcohol in the house?’\nMONTY: No.\nComputer: Lie.\nMONTY’S verdict: Mum didn’t know this. Now she does. It was a quarter bottle of tequila left over from Christmas which I shared with friends. I am in so much trouble.\nAre you really unhappy at boarding school?\nMONTY: Yes.\nComputer: Lie.\nMONTY’S verdict: Got me again. I’m not that miserable at my new school, Burford, in the Cotswolds. I’d just rather be at home because I think it’s unfair I’ve been sent away and none of my sisters has.\nHave you ever shoplifted?\nMONTY: No.\nComputer: True.\nMONTY’S verdict: As if. I’m not an idiot. I would be far too frightened of getting caught and I cannot believe Mum would do something so stupid as a teenager, either.\nAre you trying your hardest at school?\nMONTY: No.\nComputer: True.\nMONTY’S verdict: Right again. Some days I want to do my best, other days I can’t be bothered. But Mum only had to read my report to know this.\nDid you knowingly loosen the hot water bottle top before putting it in your sister’s bed last weekend?\nMONTY: No.\nComputer: True.\nMONTY’S verdict: Ha! The computer’s wrong. I’m getting the hang of this now. Of course I sabotaged the hot water bottle!\nDo you love me more than Dad?\nMONTY: Yes.\nComputer: Lie.\nMONTY’S verdict: I am lying. But it might gain me some brownie points. I love them both differently. It’s easier with Mum, but that doesn’t mean I love her more.\nHave you ever put something you regret on social media?\nMONTY: Yes.\nComputer: True.\nMONTY’S verdict: What teenager hasn’t? Thank goodness I don’t have to go into more detail, but there was a time when I put an unlit electronic cigarette in my little sister’s mouth and took a photo to share on Snapchat, an app that lets you send photos privately . . .\nDid you take my phone charger and leave it somewhere?\nMONTY: No.\nComputer: Lie.\nMONTY’S verdict: I openly lied to Mum about this when I lost her charger and now she’ll be furious. I thought I could beat the computer and this has proved me wrong.\nAccuracy: 9/10\nShona said she thought the point of this test was for her to find out about Monty — but maybe there’s more serious things he wants to know about her!\nWhat Monty learned: I tried really hard to lie on some of these questions, but the computer still caught me out. I’m always telling Mum I’m homesick at school to make her feel guilty for sending me off but, actually, I’m quite enjoying myself.\nThe moment the question came up, despite taking deep breaths to stay calm, I could feel my heart rate quicken. Also, I tend to blush when I’m lying, which obviously the computer doesn’t know but Mum should be able to tell.\nThere was one question the computer got wrong about the hot water bottle. I did loosen the lid but maybe it was easier to lie about that because it was just a joke.\nQuestions I knew would get me into trouble — like alcohol and smoking — were harder to avoid. I’m quite impressed that the computer knew I was lying, even though Mum has believed me in the past. And I’m gutted about the phone charger because I’ve got to pay for a new one out of my pocket money.","url":"https://www.dailymail.co.uk/femail/article-3422062/Who-better-liar-teenager.html"}
