{"authors":["Nicole Fabian-Weber"],"date_download":"2018-10-30 23:24:25","date_modify":"2018-10-30 23:24:25","date_publish":"2014-08-13 19:01:31","description":"Champagne pops all around! Nicky Hilton is engaged! The hotel heiress is betrothed to the heir of a European banking firm. Imagine the cute mini heirs or heiresses they'll have running around their mansion one day! Squee! It was confirmed on…","filename":"data/vaneerConsumption/WhoIsJamesRothschildNickyHiltonsFianceIsSuperPrivate.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/10/36d42920-becf-4033-82eb-14391c498266-getty-460332884.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35644-who-is-james-rothschild-nicky-hiltons-fiance-is-super-private_1540941865.html","title":"Who Is James Rothschild? Nicky Hilton's Fiance Is Super Private","title_page":"Who Is James Rothschild? Nicky Hilton's Fiance Is Super Private","title_rss":"NULL","source_domain":"bustle.com","text":"Champagne pops all around! Nicky Hilton is engaged! The hotel heiress is betrothed to the heir of a European banking firm. Imagine the cute mini heirs or heiresses they'll have running around their mansion one day! Squee! It was confirmed on Wednesday — via Paris Hilton's Instagram — that Nicky is set to marry James Rothschild. A fine aristocratic name if anyone's ever heard one, right?\nJames and Nicky hooked up in 2011 after meeting like most of us have met our better halves — at Petra Ecclestone and James Stunt's wedding in Italy. A source told Us Weekly that Rothschild popped the question last weekend in the very same country that they met. \"They went on a romantic anniversary trip over the weekend,\" a mysterious person said. \"He took her out on a boat into the middle of Lake Como and he proposed, got down on one knee and everything. It was incredibly romantic and beautiful.\" No word on whether or not Clooney was around when it happened.\nAnyway! Now that the first of the Hilton sisters is engaged, time to do our due diligence: Who the heck is this James Rothschild dude? And what makes Nicky so smitten with him? I did a little digging around, and, not gonna lie, the man appears to be a private guy (where's your Twitter, dude?!). But I did manage to find a few juicy tidbits about him. Enjoy!\n1. He's Old School.\nMike Coppola/Getty Images Entertainment/Getty Images\nBefore popping the question to Nicky, he made a trip to ask her parents' permission for her hand in marriage. Not impressed? How about this: He flew from England, where he's based, to the U.S. to make the request.\n2. He's Taking Her on a Celebratory Road Trip through Europe.\nAfter she said yes, the couple proceeded to travel around Europe. They've already hit up Milan and Rome, and Hilton has chronicled some of their adventures on her Instagram account.\n3. He hails from a seriously (no, seriously) rich family.\nSome have reported the Rothschilds to be worth more than $700 trillion . Now, if this is even true, obviously James personally isn't worth that much, but OMG! The dude's got a lot o' cash. At least Nicky doesn't have to worry about him marrying her for her money.\n4. He and Nicky Travel in Style.\nI mean, we obviously wouldn't expect anything less, but feast your eyes on one of Nicky's recent Instagram pics from Lake Como. Not bad.\n5. He's in Good With Paris.\nAgain, Paris was the one to confirm the news on Wednesday, but it's also worth noting that the heiress gushed over her soon-to-be brother-in-law. She wrote, \"Congratulations Nicky Hilton on your engagement! I'm so happy for you! You will be the most beautiful bride! Such a lovely couple! Love you both so much!\" Aww.\nImages: Nicky Hilton/Instagram; Getty; College Candy; Paris Hilton/Instagram","url":"https://www.bustle.com/articles/35644-who-is-james-rothschild-nicky-hiltons-fiance-is-super-private"}
