{"authors":["Ashley Adams"],"date_download":"2018-10-30 23:00:26","date_modify":"2018-10-30 23:00:26","date_publish":"2014-08-14 14:36:22","description":"If you've been paying any attention to Once Upon a Time lately, you've probably noticed that Josh Dallas' Prince Charming isn't the only in Storybrooke guy worth swooning over — not by a long shot. Nope, Irishman Colin O'Donoghue is definitely…","filename":"data/vaneerConsumption/WhoIsHelenODonoghueColinODonoghuesWifeLovesAwkwardPicsasMuchasHeDoesPHOTOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/6c0e81b3-6659-4f65-b991-8e4d882a28f3.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35480-who-is-helen-odonoghue-colin-odonoghues-wife-loves-awkward-pics-as-much-as-he-does_1540940426.html","title":"Who Is Helen O’Donoghue? Colin O’Donoghue’s Wife Loves Awkward Pics as Much as He Does - PHOTOS","title_page":"Who Is Helen O’Donoghue? Colin O’Donoghue’s Wife Loves Awkward Pics as Much as He Does — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"If you've been paying any attention to Once Upon a Time lately, you've probably noticed that Josh Dallas' Prince Charming isn't the only in Storybrooke guy worth swooning over — not by a long shot. Nope, Irishman Colin O'Donoghue is definitely giving Dallas a run for his money in the resident hottie department. O'Donoghue joined the cast in 2012 as Captain Hook. It was difficult time for me. At that point, Once Upon a Time had sort of spun out of control, plot wise, and I was left to cross my fingers and hope that O'Donoghue would be making one of his semi-regular appearances as the iconic Peter Pan villain. But then, because the world apparently is a wish granting factory, he was made a series regular halfway through the second season (which coincidentally corresponded with a significant up-tick in my viewing habits) and I've enjoyed watching him swashbuckle about in pretty much every episode since.\nI'm sure I'm not the only one who took to Google to type in that most crucial of searches: \"Colin O'Donoghue girlfriend\" (you know, because that was obviously the only thing keeping us apart). Unfortunately, that search returned the most dreaded of results: O'Donoghue doesn't have a girlfriend — he's married to a woman named Helen O'Donoghue.\nSigh. It looks like none of us will be lucky enough to be Mrs. O'Donoghue, but that doesn't mean we can't learn a thing or two about the woman who is. Now, the O'Donoghues are apparently pretty private people, so details aren't exactly overflowing. But I think we're all up to the challenge.\nTHEIR WEDDING PICTURES ARE A THING OF BEAUTY\nI'm perhaps willing to overlook the fact that O'Donoghue fell in love with another woman because they produced these wonderfully awkward wedding pictures.\nPerfection.\nSHE WAS HIS CHILDHOOD SWEETHEART\nThey grew up in nearby towns back in Ireland (where they're both from) and have been together since they were 18. Now that he's 33, I guess we can take some comfort in knowing that we missed our window of opportunity more than a decade ago.\nTHEY HAVE A BABY\nTheir son, Evan James O'Donoghue, was born August 1, 2013. O'Donoghue announced the birth (and the pregnancy, which was unknown) via Twitter later than day.\nSHE DOESN'T MIND HIS \"HOOKERS\"\nHis fan-base, that is. I assume she might take issue with the other kind of hooker. In fact, she seems to have a pretty good sense of humor about it. He told Access Hollywood, “She's like, 'Have you seen what they’ve said, here, about this, or that and the other,' and I was like, 'No.' I just say, 'Don’t look at it.'\"\nSHE'S A TEACHER\nO'Donoghue is a man of few words when it comes to his personal life, but he did have something pretty sweet to say about his wife's profession.\nNot to belittle what we do as actors, but my wife Helen is a teacher, and she makes a real difference to kids. So it's unusual to see people thinking of us as something special.\nSay it with me now: D'awwwww.\nThe takeaway? O'Donoghue might not technically be on the market, but that won't stop us from doing this if we get the chance:\nImages: Colin O'Donoghue/Facebook (2); welcomeaboardthenopetrain (2), fuckyeahpositivegraph/Tumblr","url":"https://www.bustle.com/articles/35480-who-is-helen-odonoghue-colin-odonoghues-wife-loves-awkward-pics-as-much-as-he-does"}
