{"authors":["Jodi Walker"],"date_download":"2018-10-30 23:33:15","date_modify":"2018-10-30 23:33:15","date_publish":"2014-08-13 16:49:31","description":"While being both terrified out of your mind, but interested beyond reason, do you ever start to wonder how exactly Discovery's Shark Week came to be a real, live, actual thing that people who otherwise care to know nothing about aquatic life follow…","filename":"data/vaneerConsumption/WhoisJeffKurrTheSharkWeekExperts7MostMindblowingRevelations.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/48ae8cbf-60ec-40ba-878f-99acad79b4ad.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35569-who-is-jeff-kurr-the-shark-week-experts-7-most-mindblowing-revelations_1540942395.html","title":"Who is Jeff Kurr? The 'Shark Week' Expert's 7 Most Mindblowing Revelations","title_page":"Who is Jeff Kurr? The 'Shark Week' Expert's 7 Most Mindblowing Revelations","title_rss":"NULL","source_domain":"bustle.com","text":"While being both terrified out of your mind, but interested beyond reason, do you ever start to wonder how exactly Discovery's Shark Week came to be a real, live, actual thing that people who otherwise care to know nothing about aquatic life follow like Game of Thrones and The Walking Dead had a zombie lovechild? I'll tell you: the sheer passion of people like Shark Week expert Jeff Kurr. Kurr has been a producer, director, and host of Shark Week for the last 23 years, and with 30 documentaries under his belt, is a legend among natural history filmmakers. To quote Kerr from his Reddit AMA: \"My mission is to help make sharks the most popular wild animals on the planet by showcasing their beauty and majesty. I love sharks they're awesome!! [sic]\"\nKurr has been the executive producer for Shark Week's last four annual kickoff shows, and 2014 was no different. On Sunday, Discovery's 27th Annual Shark Week kicked off with Kurr's Air Jaws: Fin of Fury. Fin of Fury follows Kurr and his team's search for Colossus, the \"mega-shark\" that they famously filmed breaching in South Africa in Air Jaws 2012, while Kurr was just 12-feet away in a decoy \"seal cage\" (pictured above). And for the last two years, Kurr, his frequent collaborators, Dickie Chivell and Chris Fallows, and their team have been back on the hunt for Colossus, which often included putting themselves, unprotected, right on the water's surface, atop a 14-foot female shark decoy.\nDiscovery on YouTube\nSpoiler Alert: Kurr and Colossus meet again; but you'll have to catch the doc to see just how they managed to find one shark for the second time in a literal sea of them.\nTwo full days into Shark Week, and with Air Jaws: Fin of Fury under your belt, who knows what you might be looking for: Comfort? Intensity? MORE SHARKS?! Kurr has it all on his Reddit AMA and I'm culling together the most interesting tidbits for you here:\nDon't be scared, sharks are everywhere\nWhile this assertion is educational, I'm not sure Kurr has assuaged the fear of the already fearful.\nSharknado is just some silly fun\nI like this guy's optimism, but...\nHow Did Kurr become a shark expert?\nComments to the Haters\nThe most up-voted question on Kurr's AMA was a mildly aggressive one about Shark Week's foray into the land of fiction.\nJudging by the points, everyone is not as laid back as Kurr.\nA little more on his lack of \"outrage\" at Megalodon, last year's mockumentary about a \"monster shark.\"\nOn Favorite Sharks and pop culture attention\nThe biggest issue facing sharks right now\nBut there's hope!\nFinally, what does the future hold?\nImages: Discovery Channel; Reddit (Screenshots) (12)","url":"https://www.bustle.com/articles/35569-who-is-jeff-kurr-the-shark-week-experts-7-most-mindblowing-revelations"}
