{"authors":["Rachel Paige"],"date_download":"2018-10-30 23:27:16","date_modify":"2018-10-30 23:27:16","date_publish":"2014-08-13 18:32:22","description":"MTV is currently in the middle of airing its utterly fascinating, sometimes controversial new series Virgin Territory . It follows 15 young adults as they make their way through the treacherous relationship waters, all while exploring their own…","filename":"data/vaneerConsumption/WhoIsVirginTerritorysShelbyGetToKnowtheSelfProclaimedUnicorn.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/400c82cc-149d-4dbd-8825-a9e62a4e01aa.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35550-who-is-virgin-territorys-shelby-get-to-know-the-self-proclaimed-unicorn_1540942036.html","title":"Who Is 'Virgin Territory's Shelby? Get To Know the Self-Proclaimed \"Unicorn\"","title_page":"Who Is 'Virgin Territory's Shelby? Get To Know the Self-Proclaimed \"Unicorn\"","title_rss":"NULL","source_domain":"bustle.com","text":"MTV is currently in the middle of airing its utterly fascinating, sometimes controversial new series Virgin Territory . It follows 15 young adults as they make their way through the treacherous relationship waters, all while exploring their own sexuality and their desire or decision to wait to have sex. Heavy stuff, which is probably why it airs at 11 p.m. Last week's Virgin Territory episode introduced us to Shelby, and according to twitter, everyone wants to be her best friend.\nShe's a college senior down in Texas majoring in dance and has formed a clique within her sorority called \"The Unicorns.\" No, Shelby and her friends aren't super into magic or fantasy role-playing; the title refers to the fact that they're sorority girls with their virginity still intact, and they say people believe that's just as rare as a mythical horned creature. The Unicorns used to have multiple members, but slowly their numbers have dwindled. Now there are only two, Shelby and her friend Savanna. Shelby has her eye on a very cute friend, Scott, and yes, by episode's end the two have locked lips. That leads us to our burning question: is this the end of Shelby's unicorn status? Thankfully, her story continues tonight. Here's what we already know about our girl Shelby.\nShe Loves to Work Out\nAs a dance major, Shelby is already in great shape, and according to her, she doesn't sweat. She \"sparkles.\" (Just like a Unicorn!)\nShe Loves Katy Perry\nShe Thinks She's Half Mermaid\nWhoa, whoa, Shelby, you can't be both a unicorn and a mermaid. Save some for the rest of us.\nThis Is How She Goes Out to Get Fast Food\nMaybe she's actually a unicorn goddess?\nShe Really Loves Unicorns\nAnd apparently has a great sense of humor.\nShe Wants To Get a Boob Job\nThe first time we meet Shelby she's complaining about her lack of boobs, and doesn't even hesitate stating that she'd be willing to pay for breast impants. Her friends ask her if she's serious about it, and she is.\nShe Seems to Doubt Herself Sometimes\nThough she never comes out and says it, it is heavily hinted at throughout the episode that Shelby is self-conscious. She makes a few asides as to how she might not be getting male attention because maybe she's not pretty enough when she goes out to the bar, which causes her to have doubts about her body image, which causes the desire for breast implants.\nIf given the opportunity I would most definitely want to be Shelby's friend, so here's to the beautiful unicorn. And as a friend who's never met you, Shelby, I hope you can start to feel great about yourself with or without breast implants. I can't be the only Virgin Territory fan who's rooting for you to end the season on a high-note.\nImages: MTV; Shelby Muegee/Instagram","url":"https://www.bustle.com/articles/35550-who-is-virgin-territorys-shelby-get-to-know-the-self-proclaimed-unicorn"}
