{"authors":[],"date_download":"2018-10-30 21:04:18","date_modify":"2018-10-30 21:04:18","date_publish":"2018-09-07 17:53:00","description":"Who is George Papadopoulos, first to be sentenced in Russian investigation?","filename":"data/vaneerConsumption/WhoisGeorgePapadopoulosfirsttobesentencedbyMueller.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgSharedContent/2017/10/30/Videos/4212647.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_who-george-pa_c29017b1dc786e1d16098ed64206556a__1540933458.html","title":"Who is George Papadopoulos, first to be sentenced by Mueller?","title_page":"Who is George Papadopoulos, first to be sentenced by Mueller?","title_rss":"NULL","source_domain":"ajc.com","text":"George Papadopoulos, who briefly served as a foreign policy adviser to President Donald Trump’s campaign, will be sentenced Friday for lying to the FBI.\nPapadopoulos, 31, pleaded guilty Oct. 5, 2017, to lying about connections to people he understood were connected to the Russian government. Prosecutors say Papadopoulos had hoped to broker deals between the campaign and Russian officials.\n>> Mueller investigation: Former Trump campaign adviser George Papadopoulos pleads guilty\nPapadopoulos was arrested at Washington Dulles International Airport on July 27, 2017, and arraigned the next day, charged with lying to the FBI, among other charges.\n>> Read more trending news\nPapadopoulos’ guilty plea in October 2017 was part of a plea bargain with prosecutors from special counsel Robert Mueller’s investigation into Russian meddling in the U.S. presidential election.\n>> More on Robert Mueller's investigation\nWho is Papadopoulos? Here are some things we know about him.\nHe was born in Chicago on Aug. 19, 1987. He graduated from Niles West High School and then went on to get a degree from DePaul University in Chicago in 2009. He studied international political economy and then earned a master’s degree in security studies at the University of London, according to his LinkedIn page. His dissertation “focused on the deleterious effects of low governance and state capacity levels in the Middle East,” according to his page.\nHe worked as a research associate for the Hudson Institute from 2011-2015. The Hudson Institute is a “(t)hink tank and research center dedicated to nonpartisan analysis of U.S. and international economic, security, and political issues,” according to its website.\nPapadopoulos was an oil and gas consultant for Energy Stream in London from September 2015 to December 2015.\nHe joined Ben Carson’s presidential campaign as an adviser in November 2015 and stayed with the campaign until February 2016.\n>> Paul Manafort guilty on 8 charges in bank fraud, conspiracy trial; mistrial declared on 10 counts\nHe was the director of the Centre For International Energy and Natural Resources Law & Security in London from February 2016 to April 2016.\nAccording to court records, Papadopoulos was recruited to join Trump's campaign in March 2016 by Sam Clovis, who was the national co-chairman of the campaign. He joined Trump’s campaign in April 2016 and stayed until January 2017.\nWhen he left Trump’s campaign, he became an independent oil, gas and policy consultant.\nAccording to his LinkedIn page, his \"commercial work has been published in prominent think tanks in Washington, D.C., the Cypriot and the Israeli press.\" On the page, he claims to have written \"policy and energy reports for Cambridge University\" and says he is a \"(c)urrent member of the International Presidential Business Advisory Council\" in Cyprus. Papadopoulos also says he has a \"(s)trong background in business, energy, policy and finance.”\nHe speaks Arabic, French and Greek.\nTrump, in a 2016 interview with The Washington Post, called Papadopoulos an “excellent guy.”\n>> Mueller investigation: Former Trump campaign adviser George Papadopoulos pleads guilty\nIn October 2017, after Papadopoulos pleaded guilty to lying to the FBI, White House press secretary Sarah Huckabee Sanders said his role in the campaign was “extremely limited. It was a volunteer position.”","url":"https://www.ajc.com/news/national/who-george-papadopoulos-first-sentenced-mueller/MBFhm6mgp7EnCcAfd5shaM/"}
