{"authors":["Caitlin Gallagher"],"date_download":"2018-10-31 01:46:45","date_modify":"2018-10-31 01:46:45","date_publish":"2018-09-14 11:00:53","description":"A year after a California high school was shaken to its core when 27 faculty cars were vandalized with spray-painted drawings of penises, Peter Maldonado and Sam Ecklund are investigating another crime. And the case is just as vexing this time…","filename":"data/vaneerConsumption/WhoIsTheTurdBurglarOnAmericanVandalThereAreTwoMajorSuspectsThisSeason.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/12/0cca1834-2ac7-48c8-81b0-25618b957f06-av_201_311732_r.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_who-is-the-turd-burglar-on-american-vandal-there-are-two-major-suspects-this-season-11885487_1540950405.html","title":"Who Is The Turd Burglar On ‘American Vandal’? There Are Two Major Suspects This Season","title_page":"Who Is The Turd Burglar On ‘American Vandal’? There Are Two Major Suspects This Season","title_rss":"NULL","source_domain":"bustle.com","text":"A year after a California high school was shaken to its core when 27 faculty cars were vandalized with spray-painted drawings of penises, Peter Maldonado and Sam Ecklund are investigating another crime. And the case is just as vexing this time around. The faux-filmmakers travel to a Catholic school in Washington to figure out who the Turd Burglar is in American Vandal Season 2. This self-proclaimed Turd Burglar contaminated the school cafeteria's lemonade with a laxative, causing the student body to start pooping uncontrollably in an incident now known as \"The Brown-Out. And after the success of American Vandal Season 1, Peter and Sam are compelled to head to St. Bernardine to figure out who this mysterious Turd Burglar is.\nWhile the graffiti \"artist\" of American Vandal Season 1 didn't want to be found out, Peter says in the Season 2 trailer that the Turd Burglar is \"a different animal.\" The unknown perpetrator seems to feed off the attention they are receiving and an interviewee in the documentary states, \"This guy wanted an audience.\" The Turd Burglar is causing mayhem at school and continues their reign of feces-filled terror by also having a social media presence. No one is safe from the Turd Burglar at the elite Catholic school or at home, so St. Bernardine student Chloé (Taylor Dearden — Bryan Cranton's daughter) calls upon Peter and Sam to help.\nNetflix on YouTube\nIn the trailer, most everyone refers to the Turd Burglar as a \"he.\" And while that shouldn't rule out any females, the two main suspects are male. (And no, the \"Hot Janitor\" featured in the trailer isn't one of them.) As Rolling Stone writes in its review of Season 2, student Kevin McClain claims to be the Turd Burglar. He is considered odd and a bit of a loner, so he could have wanted to get revenge on the student body. Yet, Kevin's grandmother and Chloe don't believe he's the real perpetrator. And Season 1 showed that Peter and Sam won't simply stop their investigation there.\nPeter and Sam keep digging and St. Bernardine's star basketball player, DeMarcus Tillman, becomes a suspect. He's on the opposite side of the spectrum as Kevin when it comes to popularity, but there are clues connecting him to the crime. But what would DeMarcus' motive be? As Peter says, is the Turd Burglar's motive simply: \"Poop is funny\"?\nScott Green/Netflix\nAmerican Vandal co-creator Tony Yacenda explained the differences between the two main suspects to Entertainment Weekly and how their social statuses at the school come into play this season. Yacenda said:\n\"I would say the question with Kevin is whether or not he's the Turd Burglar because he's bullied by his students. We wanted this year to kind of be a modern look at bullying in a school setting where it's not the version you've seen a million times where people are pushing kids up against lockers and stealing their lunch money. It's more like kind of laughing with them but really laughing at them, and it's a much tougher distinction to make, especially on social media. So we're analyzing whether or not this kid was actually bullied to the point that he could do something like that. Meanwhile, this guy DeMarcus is somebody that there's some evidence that he could be connected to the Turd Burglar, but there's obvious reasons why this school would protect their golden goose and the number-four [basketball] player in the country. It's a question of sort of A or B.\"\nThe identity of the Turd Burglar is the entire mystery of Season 2. And while Peter and Sam will learn about the disparity between the way athletes and non-athletes are treated at St. Bernardine, their goal is to figure out who the Turd Burglar is. In Season 1, Peter was hesitant to claim who he believed drew the penises, so maybe the Turd Burglar's true identity will never be revealed. But by the end of Season 2, viewers should hope to know the name of the brazen person who caused all the poo.","url":"https://www.bustle.com/p/who-is-the-turd-burglar-on-american-vandal-there-are-two-major-suspects-this-season-11885487"}
