{"authors":["Aoife Hanna"],"date_download":"2018-10-31 00:02:34","date_modify":"2018-10-31 00:02:34","date_publish":"2018-10-28 12:32:29","description":"The Skarsgård name has become synonymous with incredibly handsome and talented actors. Now that is not too shabby is it? Imagine your surname foretold sexiness beyond belief and not only genetic giftedness but also like, hella skilfulness at your…","filename":"data/vaneerConsumption/WhoIsAlexanderSkarsgardDatingTheLittleDrummerGirlStarHasBeenLinkedToSomePrettyBigNames.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/26/682ceb5b-4930-486b-adf6-f3a896629828-shutterstock_9773563j.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_who-is-alexander-skarsgard-dating-the-little-drummer-girl-star-has-been-linked-to-some-pretty-big-names-12997254_1540944154.html","title":"Who Is Alexander Skarsgard Dating? 'The Little Drummer Girl' Star Has Been Linked To Some Pretty Big Names","title_page":"Who Is Alexander Skarsgard Dating? 'The Little Drummer Girl' Star Has Been Linked To Some Pretty Big Names","title_rss":"NULL","source_domain":"bustle.com","text":"The Skarsgård name has become synonymous with incredibly handsome and talented actors. Now that is not too shabby is it? Imagine your surname foretold sexiness beyond belief and not only genetic giftedness but also like, hella skilfulness at your craft? Lit with a capital L. Wondering if you can get a piece of that gene pool? Who is Alexander Skarsgård dating? Is he single? Will he ever love me? OK, kidding about the last one but what is up with this hunk's dating life?\nWell if I'm honest, I don't actually know for sure as the star tries to keep his private life, well, private. He previously spoke to the Guardian, explaining that he is inspired by his actor dad's ability to keep his romantic life on the DL.\n\"Yeah, I don’t talk about it much, and that’s a way to protect it. When I was a kid, that’s how my father dealt with it. I wouldn’t say it kept him sane, because he’s pretty crazy, but somewhat. The fact that he protected his private life so much, and protected my mum who is not an actor or a public figure.\"\nAll that said, he has been linked to many fellow stars in the past.\nNeil Rasmus/BFA/Shutterstock\nHe dated Brit icon Alexa Chung for a while from 2015 to who knows when, but TBH they were mega private about their relationship from the get go. And who can blame them really. Dating is definitely difficult without people literally taking photos of you all the time.\nAccording to Vogue has also been linked to Kate Bosworth, Amanda Seyfried, Margot Robbie, and Katie Holmes. Yikes if he has dated even half of the people they claim he has, he has been a really busy boy. How has he had time to do anything at all? Especially when you think about his career which has sky-rocketed over the last few years.\nHe first came to my attention as Eric in True Blood, the vampire who you would definitely let bite you. But guys he had a lot of success in his native Sweden as well as being one of the cute but dumb models in Zoolander, a role which he reprised in the second instalment of the hit comedy. IKR?! When I read that I was like \"OMG duh how did I not clock that?\". That was in fact his first starring role in an American film. And wowzers he has come a long way since then.\nRecently he proved that he is in pretty good shape when he lifted weights until he was like shredded and ripped AF to play Tarzan in The Legend Of Tarzan.\nMost recently though, you might have seen that he is set to appear in a brand new spy thriller from AMC The Little Drummer Girl, based on the novel by the legendary spy author John Le Carré. Heard of a little show called The Night Manager? Yeah babes, this guy is so effing good.\nBBC on YouTube\nThe show tells the story of an average gal and jobbing actress named Charlie, who is recruited by a mysterious ring of Israeli spies while minding her own business on holiday in Greece. Wow, not chill. It is set in the '70s and sees all the drama you might expect from someone being brought into a secret chaotic world.\nNeedless to say when the show begins on Sunday, Oct. 28 at 9pm on BBC One, you will low key be in for a bumpy ride. Hold on tight y'all, it runs for six weeks.","url":"https://www.bustle.com/p/who-is-alexander-skarsgard-dating-the-little-drummer-girl-star-has-been-linked-to-some-pretty-big-names-12997254"}
