{"authors":["Kelly Schremph"],"date_download":"2018-10-31 01:42:59","date_modify":"2018-10-31 01:42:59","date_publish":"2018-08-27 23:15:41","description":"Fans still have a ways to go before The Walking Dead returns for its ninth season on Sunday, Oct. 7, but that hasn't stopped AMC from unleashing some exciting details about what awaits viewers this fall. The latest casting announcement in particular…","filename":"data/vaneerConsumption/WhoIsBetaOnTheWalkingDeadSonsOfAnarchyActorRyanHurstWillPlayThePivotalCharacter.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/24bd8537-6e04-45da-a5f4-c09033cf1fd9-getty-632198922.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_who-is-beta-on-the-walking-dead-sons-of-anarchy-actor-ryan-hurst-will-play-the-pivotal-character-10255901_1540950179.html","title":"Who Is Beta On 'The Walking Dead'? 'Sons Of Anarchy' Actor Ryan Hurst Will Play The Pivotal Character","title_page":"Who Is Beta On 'The Walking Dead'? 'Sons Of Anarchy' Actor Ryan Hurst Will Play The Pivotal Character","title_rss":"NULL","source_domain":"bustle.com","text":"Fans still have a ways to go before The Walking Dead returns for its ninth season on Sunday, Oct. 7, but that hasn't stopped AMC from unleashing some exciting details about what awaits viewers this fall. The latest casting announcement in particular is sure to intrigue fans of the series and comic books alike. On Aug. 27, The Wrap reported that Sons of Anarchy star Ryan Hurst is joining The Walking Dead in recurring role, playing the part of Beta, who is the second in command of the Whisperers, which is yet another group from the comics that is set to cause some problems for Rick & Co. (These guys are hard core, even covering themselves with walker skin so they can blend in and move freely among the dead.)\nThe introduction of the Whisperers has been highly anticipated among fans. Before being dubbed as the Scavengers, many thought Jadis' junkyard crew could've been tied to the Whisperers, but alas, that turned out not to be the case. So much of the past few seasons have been focused on Negan (a little bit too much, one could argue), so there hasn't been a whole lot of time for Rick, Maggie, Carol, Daryl, and all the others to deal with any other big threat.\nBut now that Negan is resting comfortably behind bars, as shown in the Season 9 trailer that was released during San Diego Comic-Con, it's time for another group to pose a new threat. Because while Rick's idea of all the communities living in harmony together sure sounds nice, this is The Walking Dead, after all, so trouble is never too far behind.\nSeries Trailer MP on YouTube\nHurst, who is best known for his role of Opie in Sons of Anarchy, has also starred in several other prominent shows, such as Bates Motel, Outsiders, and Bosch. With those credentials, it's easy to see him fitting right in among The Walking Dead family, though as a high ranking member of the Whisperers, there will definitely be no love loss between his character and Rick. In fact, you can expect him to antagonize Rick just as much as Negan did, if not more.\nHowever, Hurst isn't the first actor to be cast as part of this formidable new group. Fantastic Beasts star Samantha Morton will play the leader of the Whisperers, Alpha, and Ozark’s Cassidy McClincy is set to portray her daughter, Lydia. Additionally, Dan Fogler, who skyrocketed to fame for his role as Jacob Kowalski in Fantastic Beasts and Where to Find Them has been cast to play Luke, another member of the Whisperers, so Hurst will be in good company.\nBut as exciting as it is to welcome newcomers into the fold, there is one departure that will be happening at some point this season that'll prove to be a hard pill to swallow. Andrew Lincoln confirmed he would be leaving The Walking Dead by the end of this season during his appearance at Comic-Con this year, as reported by The Hollywood Reporter. It's hard to imagine this show without its heroic sheriff, but recently released photos of the upcoming season prove that Rick will still be very much apart of the story throughout Season 9.\nJackson Lee Davis/AMC\nJackson Lee Davis/AMC\nJackson Lee Davis/AMC\nThough it also hints at who else could end up taking center stage when Rick does eventually take his final bow...\nJackson Lee Davis/AMC\nJackson Lee Davis/AMC\nJackson Lee Davis/AMC\nLet's just hope Rick doesn't end up leaving too soon into the season, because when you're dealing with a group like the Whisperers, you're going to need as much help as you can get.","url":"https://www.bustle.com/p/who-is-beta-on-the-walking-dead-sons-of-anarchy-actor-ryan-hurst-will-play-the-pivotal-character-10255901"}
