{"authors":["Jeff Poor"],"date_download":"2018-10-30 21:49:04","date_modify":"2018-10-30 21:49:04","date_publish":"2016-12-01 04:22:13","description":"Wednesday the ladies of ABC's \"The View\" took on the issue of burning the American flag after President-elect Donald Trump stated his beliefs on the | Video","filename":"data/vaneerConsumption/WhoopionFlagBurningPeopleGetAngryandTheyBurnThingsItDoesntMeanTheyHatetheCountry.json","image_url":"https://media.breitbart.com/media/2016/11/Goldberg1130.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_11_30__1540936144.html","title":"Whoopi on Flag Burning: ‘People Get Angry and They Burn Things — It Doesn’t Mean They Hate the Country’","title_page":"Whoopi on Flag Burning: ‘People Get Angry and They Burn Things --- It Doesn’t Mean They Hate the Country’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Wednesday the ladies of ABC’s “The View” took on the issue of burning the American flag after President-elect Donald Trump stated his beliefs on the issues in a tweet earlier in the week.\nNobody should be allowed to burn the American flag – if they do, there must be consequences – perhaps loss of citizenship or year in jail! — Donald J. Trump (@realDonaldTrump) November 29, 2016\nWhile the agreement that protesters burning the flag were within their First Amendment rights to do so, co-host Paula Faris explained why it would cause people to get upset and added that if something about the country led you to burn the U.S. flag, perhaps leaving the country should be a consideration.\n“My thing, too, is if you hate this country so much you want to burn the flag, then just leave,” Faris said.\nGoldberg said burning the flag wasn’t necessarily hate for the country, but instead anger.\n“For you to equate somebody’s anger – my grandfather fought for this country and couldn’t walk on the streets of Selma, AL,” Goldberg said. “Let’s put this all in perspective … people get angry and they burn things. It doesn’t mean they hate the country. So let’s not put that in there.”\nFollow Jeff Poor on Twitter @jeff_poor","url":"https://www.breitbart.com/video/2016/11/30/whoopi-flag-burning-people-get-angry-burn-things-doesnt-mean-hate-country/"}
