{"authors":[],"date_download":"2018-10-22 22:23:47","date_modify":"2018-10-22 22:23:47","date_publish":"2014-06-09 20:29:32","description":"Get ready, Snapchat. Facebook is releasing a new photo-sharing app ... eventually.","filename":"data/vaneerConsumption/WhoopsFacebookAccidentallyReleasesSnapchatCompetitor.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/497731/slingshotapp_fbca03b323e247c0ff59d7091d7ac843.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_social-media_whoops-facebook-accidentally-releases-snapchat-competitor-n126686_1540247027.html","title":"Whoops! Facebook Accidentally Releases Snapchat Competitor","title_page":"Whoops! Facebook Accidentally Releases Snapchat Competitor ","title_rss":"NULL","source_domain":"nbcnews.com","text":"People could either swipe a message away, thus making it disappear forever, or tap to respond with their own moment. Users could only see the message if they decided to respond to it first — creating a serious incentive to share new content. They could also draw on photos or attach captions, another feature that should seem familiar to Snapchat users.\nThe app was spotted on Monday afternoon before disappearing from the App Store only hours later. It turns out the release was premature.\n\"Earlier today, we accidentally released a version of Slingshot, a new app we're working on,\" a Facebook spokesperson told NBC News in a written statement. \"With Slingshot, you'll be able to share everyday moments with lots of people at once. It'll be ready soon and we're excited for you to try it out.\"\nFacebook reportedly tried to buy Snapchat for $3 billion last November. Since then, several companies have tried integrating Snapchat-like features into their own apps. That includes Tinder, a dating service that last week unveiled \"Moments,\" a feature lets people share photos that disappear after 24 hours.\nIt's not clear when Facebook will actually launch Slingshot, but by now, Snapchat already knows it's coming.","url":"https://www.nbcnews.com/tech/social-media/whoops-facebook-accidentally-releases-snapchat-competitor-n126686"}
