{"authors":[],"date_download":"2018-10-22 20:52:04","date_modify":"2018-10-22 20:52:04","date_publish":"2014-05-02 20:56:32","description":"A vaccine against whooping cough, tetanus and diphtheria safely protects not only a pregnant woman, but her newborn, too, experts say.","filename":"data/vaneerConsumption/WhoopingCoughVaccineProtectsPregnantMomandBabyToo.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/417416/140502-whooping-cough-vaccine-1724_671320fadb1cb3626cfd5babaaeb0bf3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_kids-health_whooping-cough-vaccine-protects-pregnant-mom-baby-too-n96016_1540241524.html","title":"Whooping Cough Vaccine Protects Pregnant Mom and Baby, Too","title_page":"Whooping Cough Vaccine Protects Pregnant Mom and Baby, Too","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA vaccine against whooping cough, tetanus and diphtheria safely protects not only a pregnant woman, but her newborn, too, researchers reported Saturday.\nThe vaccine has routinely been given to pregnant women for about a year but experts say it’s important to continually review anything given to expectant mothers.\nThe issue’s also topical with recent outbreaks of whooping cough linked to people who refuse vaccines and reports that have left doctors fearing that newer vaccines might not be fully effective. Newborns too young to have been vaccinated are extremely vulnerable and can die from whooping cough, also known as pertussis.\nDr. Carol Baker and Dr. Flor Munoz of the Baylor College of Medicine in Houston gave the combined vaccine, called Tdap, to 33 pregnant women and they gave a dummy shot to 15 more women.\nThe moms-to-be suffered no serious side effects and the babies in both groups were all born healthy. The babies whose mothers were vaccinated had antibodies in their blood at levels that should protect against the infections, Baker and Munoz reported in the Journal of the American Medical Association.\n“In 2012, the United States experienced the most severe pertussis epidemic in more than half a century, with nearly 42,000 reported cases,” they wrote. “The highest incidence of pertussis and its associated complications continue to occur among infants.”\nWhooping cough is caused by a bacterial infection. It gets its name from the nagging cough it causes that can make children gasp for air, making a distinctive whooping sound. But it’s not so serious in adults and they may not realize that a persistent cough is being caused by pertussis.","url":"https://www.nbcnews.com/health/kids-health/whooping-cough-vaccine-protects-pregnant-mom-baby-too-n96016"}
