{"authors":["Jerome Hudson"],"date_download":"2018-10-30 21:49:02","date_modify":"2018-10-30 21:49:02","date_publish":"2016-02-02 19:09:16","description":"The View co-host Whoopi Goldberg has, again, trashed the phrase \"African-American\" and those who choose to \"hyphenate\" America.","filename":"data/vaneerConsumption/WhoopiGoldbergUnloadsonPCCultureDontHyphenateAmerica.json","image_url":"https://media.breitbart.com/media/2016/02/Whoopi-Goldberg-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_02_02__1540936142.html","title":"Whoopi Goldberg Unloads on PC Culture: Don't 'Hyphenate' America","title_page":"Whoopi Goldberg Unloads on PC Culture: Don't 'Hyphenate' America | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The View co-host Whoopi Goldberg has, again, trashed the phrase “African-American” and those who choose to “hyphenate” America.\nA heated conversation about diversity in the entertainment industry left Goldberg confused and frustrated over separatist labels and racial identity. “I can’t keep up with it,” Goldberg said. “I went from being colored to being a negro to being black to African-American.”\n“I figured I would land on American,” Goldberg said.\nThe actress and comedian’s comments Monday echo previous statements she made on the subject of race in America.\n“You know what uh-uh! This is my country,” Goldberg said last month during a debate about U.S. immigration policy. “My mother, my grandmother, my great-grand folks, we busted ass to be here. I’m an American. I’m not an African-American. I’m not a chick-American. I’m an American!”\n“And you know what, save your tweets,” said Monday while facing the studio audience. “Save your tweets because here’s the deal, here’s the deal. People get all up in arms. I know I’m black. I’ve been black from the moment I was born. I’m very clear about it.”\nGoldberg insists that there’s a diminishing affect anytime someone uses the term “African-American” to describe her or black people.\n“Any time you hyphenate American, any time you put something in front of it, it’s like you’re not a real American,” she said. “Well, I’m a whole lot of all-American. This is my country and I’m an American. Save your tweets and save your hate mail because you know in this case I don’t care.”\nFollow Jerome Hudson on Twitter @jeromeehudson.","url":"https://www.breitbart.com/entertainment/2016/02/02/whoopi-goldberg-unloads-on-pc-culture-dont-hyphenate-america/"}
