{"authors":["Lindsay Denninger"],"date_download":"2018-10-31 01:42:33","date_modify":"2018-10-31 01:42:33","date_publish":"2018-09-14 16:45:11","description":"Netflix poked fun of itself and its never-ending ilk of whodunnit crime series with American Vandal, but viewers were there for it. Who knew a show about drawing penises all over a town could be so smart and, most importantly, so popular? Now,…","filename":"data/vaneerConsumption/WhoPlaysKevinMcClainOnAmericanVandalTravisTopeMayBeThePerpetratorOfPoop.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/da03cb40-5c22-484a-bb7a-d27c0dbb7c9b-av_201_110000_r.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_who-plays-kevin-mcclain-on-american-vandal-travis-tope-may-be-the-perpetrator-of-poop-11848363_1540950153.html","title":"Who Plays Kevin McClain On 'American Vandal'? Travis Tope May Be The Perpetrator Of Poop","title_page":"Who Plays Kevin McClain On 'American Vandal'? Travis Tope May Be The Perpetrator Of Poop","title_rss":"NULL","source_domain":"bustle.com","text":"Netflix poked fun of itself and its never-ending ilk of whodunnit crime series with American Vandal, but viewers were there for it. Who knew a show about drawing penises all over a town could be so smart and, most importantly, so popular? Now, Season 2 of American Vandal is upon us, with a different story and a new cast of characters. Who plays Kevin McClain on American Vandal? Travis Tope is in the middle of the action, but did his character do the crime? Will he do the time?\nAccording to a Netflix description of the show, Travis Tope plays Kevin McClain, a high school junior that’s been expelled for allegedly being the “Turd Burglar,” a criminal who is perpetrating a host of fecal-related crimes in a Catholic school. As Netflix says in a press release, “Is justice being served? Is the system rigged against the disenfranchised? And who is The Turd Burglar?” Yes, American Vandal has moved on from graffiti to defecation, and it’s probably going to be as clever and funny as before (and grosser, too). These questions posed by Netflix are important ones, and hopefully, they’ll all come to light by the end of Season 2.\nKevin Winter/Getty Images Entertainment/Getty Images\nYou may recognize Tope from a host of roles that span from movies to television. According to his IMDB, he played Joe Harper on Boardwalk Empire; Chris Truby in Men, Women & Children; and Charlie Miller in Independence Day: Resurgence. He’s also appeared on shows like NCIS: Los Angeles; Battle Creek; and Last Man Standing. The only other info about Kevin (whose character was originally called Ethan) I could find was from Deadline, saying that Kevin is “fedora-wearing” [and] “pocket-watch carrying,” so from the sounds of it, Kevin is very different than the other kids at his wealthy Catholic school. Different enough to be framed for a crime he didn’t commit, perhaps? We'll all just have to watch Season 2 of American Vandal to find out.\nIf you didn't watch Season 1 of American Vandal, you're not going to be totally left in the dark here — there's no need to catch up. Season 2, according to the trailer, aspiring documentarian Peter Maldonado took on out the penis-drawing drama in his own high school, painstakingly investigating who had the cause, time, and, most importantly, motive to enact a reign of phallic graffiti terror in his high school.\nNetflix on YouTube\nIn Season 2, Peter is off to take on a new challenge — to get to the bottom (pun intended) of a situation that everyone involved calls the \"Brown Out.\" It involves a school lunch, laxatives, and some really disgusting footage.\nBut whodunnit? That's something we may never know, considering that the first season of American Vandal did the typical thing that true-crime documentaries tend to do — let viewers reach their own conclusions. It could do the same in Season 2, never really letting viewers know if Kevin McClain got away with the perfect crime or if he simply was in the wrong place at the wrong time.","url":"https://www.bustle.com/p/who-plays-kevin-mcclain-on-american-vandal-travis-tope-may-be-the-perpetrator-of-poop-11848363"}
