{"authors":["Jack O'Keeffe"],"date_download":"2018-10-31 01:46:34","date_modify":"2018-10-31 01:46:34","date_publish":"2018-09-14 11:00:54","description":"American Vandal Season 2 asks a lot of questions. Who is the Turd Burglar? Why is Chloé fighting so hard to defend Kevin McClain? But the most important of all the questions might be: who plays Hot Janitor on American Vandal? Season of the satirical…","filename":"data/vaneerConsumption/WhoPlaysHotJanitorInAmericanVandalSeason2ThisJanitorIsTheSteamiestPartOfTheShowsSophomoreEffort.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/0e1d3c2c-1286-4fa4-aacd-da10e4dd0259-av_201_110000_r.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_who-plays-hot-janitor-in-american-vandal-season-2-this-janitor-is-the-steamiest-part-of-the-shows-sophomore-effort-11912925_1540950394.html","title":"Who Plays Hot Janitor In 'American Vandal' Season 2? This Janitor Is The Steamiest Part Of The Show's Sophomore Effort","title_page":"Who Plays Hot Janitor In 'American Vandal' Season 2? This Janitor Is The Steamiest Part Of The Show's Sophomore Effort","title_rss":"NULL","source_domain":"bustle.com","text":"American Vandal Season 2 asks a lot of questions. Who is the Turd Burglar? Why is Chloé fighting so hard to defend Kevin McClain? But the most important of all the questions might be: who plays Hot Janitor on American Vandal? Season of the satirical docuseries swaps out nearly all of the cast from Season 1, save for filmmakers Peter Maldonado and Sam Ecklund, and moves the setting to St. Bernadine Catholic High School. While most of the school's employers are unremarkable when it comes to physical appearance, students and teacher are smitten at the sight of Hot Janitor, played by actor Cayleb Long.\nLong, like many of the actors that make up the world of American Vandal, isn't a recognizable name. Yet, of course. Among his IMDB credits, the most popular project he's been a part of was the 2015 film The Intern, starring Anne Hathaway and Robert DeNiro, in which Long played an uncredited tech guy. American Vandal may be Long's most visible acting role yet — and what a role it is. Hot Janitor himself doesn't take up much space in the narrative of the show, but the show's detour to exploring the mythos of Hot Janitor is one of the higher moments, introduced in various Snapchats and Insta Stories the students take to the tune of Ginuwine's \"Pony.\" He even has his own Instagram account.\nHot Janitor earned the name exactly as one would imagine — by being a janitor who also happens to be really really hot. Or at least the most attractive janitor. The students of St. Bernadine Catholic High School are smitten with Hot Janitor, and its implied that some of the teachers are as well in their interviews.\nHot Janitor is essentially what Kraz from American Vandal Season 1 sees when he looks in the mirror, without being far too involved with the students of the school that he works at. While Hot Janitor may be the apple of the student's eyes, Hot Janitor doesn't make much of the attention and keeps to himself, which makes his sudden disappearance from St. Bernadine all the more shocking.\nNot only is Hot Janitor absent from his former role as Janitor, but when Peter and Sam try to track him down, it seems he's gone completely off the grid. While a disappearance in the wake of a supposed school cover-up may be suspicious, Hot Janitor's absence from social media is only indicative of a person who wants to live a life free of Twitter, Instagram, or any of the other social networks that the students of American Vandal use to terrorize each other.\nIn the end, Hot Janitor provides some crucial information that tip off Peter and Sam into the events that took place in the Teacher's Lounge on December 4 to help with the investigation, and is seen no more. As quickly as Hot Janitor was introduced into our lives, so too has he vanished, content to collect flora in the woods and provide people with the occasional shrooms hookup. Cayleb Long may not have been the star of American Vandal Season 2, but long after the case of the Turd Burglar has been forgotten, the legend of Hot Janitor will surely live on.","url":"https://www.bustle.com/p/who-plays-hot-janitor-in-american-vandal-season-2-this-janitor-is-the-steamiest-part-of-the-shows-sophomore-effort-11912925"}
