{"authors":[],"date_download":"2018-10-30 18:57:10","date_modify":"2018-10-30 18:57:10","date_publish":"2016-03-30 00:34:00","description":"You don't have to be young. You don't have to be model-thin. But if you are thinking about pursuing consistent work as an extra on movie and...","filename":"data/vaneerConsumption/WhosgettingthejobsinGeorgiasfilmindustry.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/30/Images/photos.medleyphoto.9212450.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_employment_who-get_5eefaff84823868b93dd3c5528bc1e21__1540925830.html","title":"Who's getting the jobs in Georgia's film industry?","title_page":"Where are the plum jobs for Georgians in the TV and film industry","title_rss":"NULL","source_domain":"ajc.com","text":"You don't have to be young. You don't have to be model-thin. But if you are thinking about pursuing consistent work as an extra on movie and television productions being filmed in Atlanta, the two unyielding requirements are to report to work early and have an open, flexible schedule.\nIn fact, there's a saying that's been around forever, but nowhere is it more timely than with Atlanta casting directors: \"If you're early, you're on time. If you're on time, you're late. If you're late, you're fired.\" Take note. Casting directors certainly do. And they won't book you a second time if you ever tarnish their credibility and professionalism by arriving late or failing to show.\nRose Locke co-founded an Atlanta-based casting company in 2010 and has never been disappointed in the number of productions eager to have a Georgia backdrop.\n\"There's always changes in the cycle of what we do,\" said Locke.\nEach production is different and, therefore, background actors need to be able to change their look to portray a different role. For example, extras who work on the set of \"Dirty Grandpa\" wouldn't necessarily be typecast for the \"Hunger Games\" series. That's not to say they couldn't work on both productions, but they must be willing to accept direction from the wardrobe, hair and makeup departments.\nLocke also feels there are so many productions being filmed in Atlanta, the background work isn't age driven. However, she says it typically breaks down into three categories: ages 18-25, 30-45 and individuals who are retired. Of the three, Locke believes the middle group is the toughest to fill. When screening submissions, she says she considers how old an individual looks before glancing at the person's actual age, but admits photographs can be deceiving.\n» 8 ways to increase your chances of making money as a film extra in Georgia «\n\"There have been times we've asked people to submit pictures holding a piece of paper with a date on it to be certain the picture is current and not Photoshopped,\" said Locke. Of course, opportunity can vary as much as the photos. If a director likes what he sees on camera, an extra could end up with a speaking line or more substantial role.\n\"There's always an opportunity for people to get upgraded on set,\" said Locke. \"We had three extras upgraded to speaking roles on set ('Babydriver') just this week. It doesn't happen every day, but it does happen.\"\nCynthia Fritts Stillwell, a Georgia native, began her casting career in Savannah before moving her company to Atlanta in the 1980s. She eventually went on to work in Los Angeles and New York. Her credits include \"Fried Green Tomatoes,\" \"Remember the Titans,\" \"Trip to Bountiful\" and, most recently, \"Selma.\"\n\"There were 72 roles in 'Selma,'\" Stillwell said. \"The parts ranged from day players to weekly to major roles. I auditioned over 600 people and I fought for Georgia-based talent to be cast. In the end, 60 of the 72 roles were filled by regional actors.\"\nStillwell admits she's noticed the same trend many Georgia actors and crew members have cited; and that's plum jobs going to people who move to the Atlanta area from New York and Los Angeles. That's in direct conflict with Georgia's generous tax incentive package offering the television and film producers up to 30 percent in tax breaks to make their blockbusters here. Georgia Gov. Nathan Deal implemented the incentives in 2008 with the intention of boosting Georgia's economy and creating more jobs for residents. No one can deny it's done that, but many Georgia actors say the higher paying jobs go to transplants from New York and L.A.\n\"We love our brothers and sisters from New York and L.A.,\" Stillwell said with a smile. \"We just don't want them to take away our jobs.\" She believes the talent is here and she spends a majority of her evenings taking in plays at local theaters, looking for talent to add to her \"tapestry of faces.\"\n» 10 reasons to seek a job in Atlanta’s TV and film industry «\nThere's also an elevated push throughout the state to train more residents for jobs in the film industry. One is the City of Atlanta Entertainment Training Program, which offers admission on a rolling basis. A current list of classes and workshops can also be found by clicking this link to the Georgia Department of Economic Development website. A majority of the state's technical colleges have also added or expanded their film production programs.\nIn addition, the state posts a list of current productions being filmed in Georgia and up-to-date job information on its Help Wanted Hotline page.\nHowever, one issue looms which can only be played out in time. Over the past few years, many Atlanta extras who consistently work as background artists have become SAG elibgle, which means they can join the union. It is a catch-22.\nIn comparison to cities like Los Angles and New York, Georgia is a right-to-work state. Background artists who join the Screen Actors Guild‐American Federation of Television and Radio Artists, or SAG-AFTRA, could easily lose work to non-union actors based strictly on wages. In other words, union background extras make $148 per 8-hour workday, which is equivalent to $18.50 an hour.\nIn comparison, a non-union background extra in Atlanta makes on average $8 an hour. Producers are saving $10.50 per hour for every background extra when they decide to film in Georgia. In an industry where employees average around six figures a year, a background extra humbly makes about $10,000.\n» A guide to where celebrities hang out in Atlanta «","url":"https://www.ajc.com/business/employment/who-getting-the-jobs-georgia-film-industry/kELNXsScDeSRRsIMmvA0pL/"}
