{"authors":[],"date_download":"2018-10-30 20:48:51","date_modify":"2018-10-30 20:48:51","date_publish":"2018-08-17 10:00:00","description":"A federal investigation into Atlanta City Hall corruption is steaming up, so columnist Bill Torpy suggests \"scoundrels\" cut a deal while they can.","filename":"data/vaneerConsumption/Whosnextasfederalprobesteamsup.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/17/Images/newsEngin.22657611_081618-WD-Bribery-hearings-JE-02.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_torpy-large-who-_b4e67d3845568bdf4fcdffe790123ef7__1540932531.html","title":"Who's next as federal probe steams up?","title_page":"Atlanta City Hall scandal: Who's next as federal probe steams up?","title_rss":"NULL","source_domain":"ajc.com","text":"Another one bites the dust at Atlanta City Hall. This time, it’s former Mayor Kasim Reed’s deputy chief of staff, a highly educated City Hall veteran who pocketed bribes but insists she didn’t know what they were at the time.\nOh well, I suppose the concept of corruption takes a minute to sink in on some people.\nKatrina Taylor-Parks stood trembling before a federal judge Wednesday and owned up to accepting a couple of $2,000 pops from a crooked businessman to bring him into the city vendor fold.\nThe slow march of justice has netted the second guilty plea from a high-ranking city official. The first was former city procurement director Adam Smith, just the right guy to enroll if you wanted to make some easy cash on the down low.\nAnother indicted former city official, the Rev. Mitzi Bickers, the political operator who helped Hizzoner win a tight election in 2009, also appeared in court Wednesday. Her legal team asked a judge for more time because these corruption cases are real hard to prepare for given the mountains of paperwork. They were granted a three-month extension to figure out what they will do.\nBickers is charged with taking up to $2 million in bribes from two contractors who got $17 million in city work but are now wearing orange jumpsuits. Bickers’ lawyer, Drew Findling, who helped Clayton County Sheriff Victor Hill beat a ton of state corruption charges a few years back, insists they are gearing up for trial.\nThey may also be playing hard to get, buying time so the feds can sweeten up a deal for Bickers to cooperate. Findling, a fine attorney, surely knows that winning over a Clayton jury is a lot more manageable than beating the feds in an 11-count indictment that includes tax charges. As an attorney, you have to worry that one of those 11 legal torpedoes might get through, especially with a client who suddenly had a pile of extra cash on her hands.\nThomas Holloman III, who runs the criminal division at the IRS office in Atlanta, spoke of an “alleged culture of pay-to-play politics at the highest level within the previous administration.” He added that City Hall during Reed’s years was “truly open for business.”\nThe feds have subpoenaed records pertaining to Reed but have made no accusations, and Reed has always insisted that this has nothing to do with him. It’s unclear where the feds are aiming their 3-year-old investigation, although they usually aim up, not down, when cutting deals.\nSmith and Taylor-Parks have cut deals, and U.S. Attorney BJay Pak is looking for more.\nAfter Taylor-Parks’ plea, Pak stood in front of the courthouse waving a Get Out of Jail card to urge the next City Hall denizen to drop a dime on a fellow conspirator.\n“They may worry the next knock on their door may be federal agents,” Pak said, glaring into the cameras. “To them: The question is not if, but when we’re coming.”\nSo, get on the bus while you can, scoundrels! You can reduce your criminal liability or even snag some much-coveted immunity.\n“But you must act now when you still have the choice,” Pak added, sounding like a late-night infomercial pitchman urging viewers to “act before midnight tonight!”\nPak said the revolving door of bribery scandals — this is the third is 25 years — is taking its toll on public perception of City Hall. In fact, the feds might do well to build a holding cell at Trinity Avenue.\nOliver Halle, a retired FBI agent, said getting co-conspirators to cooperate with authorities is the lifeblood of the investigative bidness. Halle was the agent who started the five-year investigation that netted 10 city officials and contractors before getting former Mayor Bill Campbell.\nHe said the current case is not unlike the Campbell case, in that the feds move glacially and methodically.\nHalle, who spent 17 of his 28 years with the FBI working public corruption cases, said determining why some public servants go bad was a puzzle he could never solve.\nOne Atlanta official, sitting in prison after giving up a good life, simply told Halle, “I don’t know why I did it. I just don’t know why.”\nOthers, Halle said, “have a sense of entitlement. They feel they’re worth more than they’re being paid.”\nTaylor-Parks made north of $200,000, so she wasn’t aching for cash. Her job, in her own words, included “most legislative actions, administration change, finalizing billion-dollar deals, and working on behalf of the mayor.”\nIn court, federal prosecutor Jeffrey Davis told the judge that Taylor-Parks regularly met with a vendor, hooking him up with high-ranking City Hall honchos, calling them on his behalf, helping him get a sole-source contract and just generally showing him love when it came to circumventing the city’s bureaucracy.\nShe got an untold amount of money — “thousands,” prosecutors say — from the vendor, whom the city paid about $100,000 from January to July 2013.\nUsing emails and a database of city payments, my AJC colleagues determined that the vendor was a wireless internet company that got a contract at Piedmont Park and was controlled by Paul Marshall.\nMarshall was a buddy of Taylor-Parks from their days a decade ago when they got master’s degrees together at Georgia Tech.\nIn September 2013, the Securities and Exchange Commission accused Marshall of swindling investors out of a couple of million dollars. His dealings at City Hall seemingly ended about that time. My guess is that Taylor-Parks realized her old classmate was radioactive, and she had to cut him loose.\nMarshall is now serving time for fraud.\nTaylor-Parks will now likely join him. The knock finally came to her door.","url":"https://www.ajc.com/news/local/torpy-large-who-get-burned-next-city-hall-scandal-steams/ut3VX7YkFovtvQGbDVBDTI/"}
