{"authors":["Quentin Letts For The Daily Mail"],"date_download":"2018-10-22 22:32:08","date_modify":"2018-10-22 22:32:08","date_publish":"2017-03-10 01:00:22","description":"Imelda Staunton (pictured) gives an impressive performance in a revival of Edward Albee’s Who’s Afraid Of Virginia Woolf?. This is great acting. Yet I dislike Albee’s play, writes QUENTIN LETTS.","filename":"data/vaneerConsumption/WhosAfraidofVirginiaWoolfreviewedbyQUENTINLETTS.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1DAF9200000578-0-image-a-39_1489107559747.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299518_QUENTIN-LETTS-review-s-Afraid-Virginia-Woolf_1540247528.html","title":"Who's Afraid of Virginia Woolf? reviewed by QUENTIN LETTS","title_page":"Who's Afraid of Virginia Woolf? reviewed by QUENTIN LETTS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Who's Afraid of Virginia Woolf?\nRating:\nConleth Hill and Imelda Staunton give impressive performances in a revival of Edward Albee’s Who’s Afraid Of Virginia Woolf?. This is great acting. Yet I dislike Albee’s play.\nIt is bleak, excessive, repetitive. Listening to drunks in real life is boring enough. Watching them depicted on stage for an evening that lasts three and a quarter hours may feel like a penitence.\nThis is the one which begins with unhappily-married, middle-aged Martha and George returning home after a long, boozy night.\nMiss Staunton’s Martha is a taut fistful of energy: a Betty Ford hairstyle, an ankle that swings with feline intent.\nWe are in 1960s New England in the shrivelling world of middle-rank academia. Sarcastic George is about to go to bed when the equally acid Martha announces she has asked a young couple from the party to come back for a drink.\nOver the next few hours the four drink spirits, fight, flirt, tell lies, play mind-games and generally make themselves (and us) miserable. Mr Albee presents an American elite in cyclical self-harm, pummelling its livers, dribbling away its lives without children, love or faith.\nMr Hill’s George, to look at, could be a fat Ed Balls. George is slow-burn, his vengefulness simmering.\nImogen Poots and Luke Treadaway play the younger couple in Edward Albee’s play\nMiss Staunton’s Martha is a taut fistful of energy: a Betty Ford hairstyle, an ankle that swings with feline intent. Mr Hill’s George, to look at, could be a fat Ed Balls. George is slow-burn, his vengefulness simmering. The two of them fight partly out of boredom. ‘Martha and I are merely exercising,’ he sighs to their visitors after one vicious outburst. ‘It can get pretty bouncy around here.’ By ‘bouncy’ he means cruel.\nIf nihilism is your bag, director Albee’s your man. But I couldn’t escape Monday’s preview fast enough\nImogen Poots and Luke Treadaway play the younger couple. In Tom Pye’s design, Martha and George’s living room is a cluttered, saggy sort of pit, unkempt but comfortable.\nJames Macdonald directs. If nihilism is your bag, Albee’s your man. But I couldn’t escape Monday’s preview fast enough.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299518/QUENTIN-LETTS-review-s-Afraid-Virginia-Woolf.html"}
