{"authors":["Quoctrung Bui"],"date_download":"2018-10-23 05:25:40","date_modify":"2018-10-23 05:25:40","date_publish":"2014-08-27 00:00:00","description":"What is the typical American workday? We take a look at how working hours change according to job type.","filename":"data/vaneerConsumption/WhosInTheOfficeTheAmericanWorkdayInOneGraph.json","image_url":"https://media.npr.org/assets/img/2014/08/26/commuting_wide-718d8ffbc9dd47f51a727b6e21bb9dab7234f6dd.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_money_2014_08_27_343415569_whos-in-the-office-the-american-workday-in-one-graph_1540272340.html","title":"Who's In The Office? The American Workday In One Graph","title_page":"Who's In The Office? The American Workday In One Graph : Planet Money : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Who's In The Office? The American Workday In One Graph\nResearchers often look at the number of hours worked, but rarely do they ask the question of when. Fortunately, the government conducts an annual study called the American Time Use Survey that tracks how people spend their days.\nThe interactive graph below shows the share of workers who say they're working in a given hour, grouped by occupation. Play with the different job categories to see how the average workdays differ from one another.\nThe conventional workday remains pretty strong. The majority of people are at work from 9 a.m. to 5 p.m., with a small break in the middle of the day for lunch.\nThe graph shows that construction workers take the lunch hour the most seriously, with the largest drop in workers at noon (as measured from peak to midday trough).\nNot surprisingly, servers and cooks have a schedule that's essentially the opposite of all other occupations. Their hours peak during lunch and hold steady well into the evening.\nThe only occupation where a large share of workers are up at 3 a.m. is protective services (like police officers, firefighters and private detectives). Even among blue collar workers, working at 3 a.m. is a relatively rare occurrence.\nStill, Americans work more night and weekend hours than people in other advanced economies, according to Dan Hamermesh and Elena Stancanelli's forthcoming paper. They found that about 27 percent of Americans have worked between 10 p.m. and 6 a.m. at least once a week, compared with 19 percent in the U.K. and 13 percent in Germany.\nBut there are limits to the data. For white collar work, the line between life and work can be blurred. Tasks like late-night emails and dinners with clients throw a wrench into how work hours are measured overall.","url":"https://www.npr.org/sections/money/2014/08/27/343415569/whos-in-the-office-the-american-workday-in-one-graph"}
