{"authors":[],"date_download":"2018-10-30 21:30:33","date_modify":"2018-10-30 21:30:33","date_publish":"2014-09-01 16:47:00","description":"In a word: Jennifer Lawrence. Alright, that was two words. But who else is really to blame for this mess? In case you missed the news, nude full frontals |","filename":"data/vaneerConsumption/WhostoBlameforNudePhotosofJenniferLawrenceLeaking.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Hollywood/2014/05/21/lawrence/Lawrence.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_09_01__1540935033.html","title":"Who's to Blame for Nude Photos of Jennifer Lawrence Leaking?","title_page":"Who's to Blame for Nude Photos of Jennifer Lawrence Leaking? | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In a word: Jennifer Lawrence. Alright, that was two words. But who else is really to blame for this mess? In case you missed the news, nude full frontals of the Hunger Games actress are doing the rounds today after a hacker, who says he got in to Apple’s iCloud service, dumped a load of them on the net.\nApple is notoriously bad at cloud services. Its MobileMe service, a collection of online tools, was a disaster and had to be canned. And, if you’ve ever tried to sync passwords across Apple devices, well: you probably already know what I mean. At least, that was the case for years. I haven’t had the balls to try recently.\nOne of the reasons Apple bought Beats Audio was that Beats had a functioning cloud streaming service for music; Cupertino’s own developers have struggled for years to write software that actually works across its own range of devices.\nConsumers will be a bit more wary about syncing their photo libraries over the internet – or even taking photos at all – on their iPhones, after this. And yet I don’t think Apple should bear the brunt of the criticism. Why? Because it’s not just Apple services implicated, and because someone as famous as Jennifer Lawrence is negligent to the point of complicity by having snaps like that stored on internet-enabled devices.\nShe is one of the most famous women in the world. She earns a fortune for, among other things, being hot. Is there a straight man on the planet who hasn’t – if you’ll forgive my crudeness – thought about what it might be like? Hell, I’m as gay as they come and even I’ve thought about it.\nThat being so, it’s stunning, isn’t it, that no one in Lawrence’s support team thought to be more careful about content being uploaded to servers over which they have no control. It’s not hard to turn off syncing services, and there’s no reason why someone with Lawrence’s wealth can’t hire someone to do it.\nThe other thing that strikes me is: she’s Jennifer Lawrence! Why does she need to take sexually explicit photos of herself at all? It’s not like she wants for male attention, and I find it hard to believe she’s posting them on dating sites or sending them via Snapchat. Other stars go to extraordinary lengths to get their rocks off while protecting their privacy.\nLet’s remember, malice and titillation are the currencies of the internet. Trolls and hackers live for attention and to humiliate other people – especially famous people. It is skull-crushingly dumb to imagine you can have dirty snaps of yourself out there on the internet, or on some big Silicon Valley company’s servers, that will stay private forever.\nI don’t think, by the way, that “cloud computing” – which is the name given to software that sits on the internet, instead of your computer, like Google Docs or business software such as Salesforce – will be much damaged by the scandal. People don’t make the link between nude celeb photo scandals and web architecture.\nPerhaps they should: can any cloud company really say they do everything possible to avoid these kinds of leaks? Apple must bear some of the blame for the gap in its security that allowed this breach. I hope its CEO, Tim Cook, is writing a letter of apology to Jennifer Lawrence, and the other celebrities affected, as I type this.\nThen again, we shouldn’t be so conceited as to imagine there are hackers out there trying to get into our personal data. (With the exception of credit card details, obviously.) In the nicest possible way, your blurry photos from an Ibizan nightclub just aren’t that interesting to the rest of the world.\nWhat I think will be remembered from this mess – and, by the way, there are more leaks to come, according to the hacker – is how incredibly stupid the richest and most famous people in the world can be. Really the only thing you need to do, as a Hollywood star and global sex symbol, is make sure naked pictures of you don’t show up on the internet. Assuming, of course, that you don’t actually want them out there.\nThere’s no evidence to suggest that’s the case with Lawrence. I’m sure she’s mortified. But we can all take a lesson from this. If you’re even a little bit famous, and you’re going to take pictures of yourself in a state of undress – if you really, absolutely have to – buy yourself a Polaroid camera and share them in person, in private.\nBecause, if you don’t, chances are somewhere, some day, your nudie pics will get an audience far larger than you intended.","url":"https://www.breitbart.com/europe/2014/09/01/who-s-to-blame-for-nude-photos-of-jennifer-lawrence-leaking-on-the-internet/"}
