{"authors":["Joseph D. Lyons"],"date_download":"2018-10-31 00:01:43","date_modify":"2018-10-31 00:01:43","date_publish":"2018-10-28 14:58:14","description":"Sunday morning — a day after the deadliest attack on the Jewish community in the United States, ever — the names of those killed were released by officials. At a press conference, Karl Williams, chief medical examiner for Allegheny County,…","filename":"data/vaneerConsumption/WhoTheVictimsOfThePittsburghSynagogueShootingWereAndHowToHelpTheirFamilies.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/28/15f3cf50-7cf1-4635-95d8-82df7409eeb5-getty-1054280192.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_who-the-victims-of-the-pittsburgh-synagogue-shooting-were-how-to-help-their-families-13009387_1540944103.html","title":"Who The Victims Of The Pittsburgh Synagogue Shooting Were And How To Help Their Families","title_page":"Who The Victims Of The Pittsburgh Synagogue Shooting Were And How To Help Their Families","title_rss":"NULL","source_domain":"bustle.com","text":"Sunday morning — a day after the deadliest attack on the Jewish community in the United States, ever — the names of those killed were released by officials. At a press conference, Karl Williams, chief medical examiner for Allegheny County, identified who the Pittsburgh synagogue shooting victims were, and there's already a way to help. Following the anti-Semitic attack, supporters of the congregation have organized a GoFundMe to help the families of the victims and survivors.\nThere were 11 people killed, and six more were wounded. Victims included married couples, brothers, and members of the community as old as 97. They were all attending service at Tree of Life synagogue when a gunman entered on Saturday morning shouting anti-Semitic slurs. The names of the dead, according to officials, are:\nJoyce Fienberg, 75\nRichard Gottfried, 65\nRose Mallinger, 97\nJerry Rabinowitz, 66\nCecil Rosenthal, 59\nDavid Rosenthal, 54\nBernice Simon, 84\nSylvan Simon, 87\nDaniel Stein, 71\nMelvin Wax, 88\nIrving Younger, 69\nOnline, the support for the synagogue and the families of those killed is already coming in quickly. A GoFundMe fundraiser raised nearly $300,000 as of Sunday morning with a goal of $1 million.\n\"This fundraiser is meant to help the congregation with the physical damages to the building, as well as the survivors and the victims’ families,\" the organizer wrote. \"Respond to this hateful act with your act of love today. All funds raised will directly go to the Tree of Life Congregation from GoFundMe, and there is no third party intermediary.\"\nLittle more is known about the individuals who were killed. What is clear is why they were targeted. \"Our hearts break for the families of those killed and injured at the Tree of Life Synagogue, and for the entire Jewish community of Pittsburgh,\" Jonathan Greenblatt, CEO and national director of the Anti-Defamation League said in a statement. \"We believe this is the deadliest attack on the Jewish community in the history of the United States. We are actively engaged with law enforcement to support their investigation and call on authorities to investigate this as a hate crime.\"\nPublic officials have responded to the attacks vocally. \"The first thing you do is take care of the victims,\" Pittsburgh Bill Mayor Peduto told Today’s Willie Geist on NBC Sunday:\nWe fight hate with love. We fight it with compassion. We fight it with an understanding that a neighborhood like Squirrel Hill is the most diverse in all of Western Pennsylvania, is a welcoming community that welcomes everyone. It's a community whose foundation is based on that understanding.\nThere are other fundraisers, too, including one started by two Muslim groups in solidarity. Celebrate Mercy and MPower Change, two Muslim-American nonprofit organizations, began a crowdfunding campaign on the site LaunchGood. The campaign is called, \"Muslims Unite to Help Pittsburgh Synagogue Shooting Victims.\"\n\"The Muslim-American community extends its hands to help the shooting victims, whether it is the injured victims or the Jewish families who have lost loved ones,\" the campaign page reads, as a message of unity. \"We wish to respond to evil with good, as our faith instructs us, and send a powerful message of compassion through action.\"\nAs of Sunday nearly $50,000 had already been raised there, too. Nothing will bring back the loved ones lost, but immediate costs like funerals will be supported.","url":"https://www.bustle.com/p/who-the-victims-of-the-pittsburgh-synagogue-shooting-were-how-to-help-their-families-13009387"}
