{"authors":["Allison Piwowarski"],"date_download":"2018-10-30 23:13:19","date_modify":"2018-10-30 23:13:19","date_publish":"2014-08-13 21:59:09","description":"Leaving the Big Brother house is no easy feat. Leaving the Big Brother house when you still can watch the show live with America would be downright frustrating. With this past Thursday marking the beginning of sending the houseguests to the Jury…","filename":"data/vaneerConsumption/WhoWillWinBigBrother16FormerHouseguestAmberGivesUsHerPrediction.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/cbe14950-55fc-4f56-a1cf-a9e922d06c22.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35077-who-will-win-big-brother-16-former-houseguest-amber-gives-us-her-prediction_1540941199.html","title":"Who Will Win 'Big Brother 16'? Former Houseguest Amber Gives Us Her Prediction","title_page":"Who Will Win 'Big Brother 16'? Former Houseguest Amber Gives Us Her Prediction","title_rss":"NULL","source_domain":"bustle.com","text":"Leaving the Big Brother house is no easy feat. Leaving the Big Brother house when you still can watch the show live with America would be downright frustrating. With this past Thursday marking the beginning of sending the houseguests to the Jury House, only five previously evicted players are left screaming at their television screens as their former houseguests lie, betray, and evict. At least that is the case for recent evictee Amber Borzotra, who told me that watching Wednesday's episode left her feeling like she was still playing the Big Brother game.\n\"I'm kind of nervous to watch them,\" she says of new Big Brother episodes. I don't know what is going to be said, what's going to be talked about.\" Now that she is out, and back into the real world, Amber gets to start watching from a different perspective. Because once you're out of the house, all of those whispered conversations that we, as viewers, watch the houseguests so awkwardly walk in on, are exposed for what they really are, and that's usually game play.\nSo now that she is out of the house, and has a better idea of who is running the game, who does Amber think will walk away with the $500,000? \"Derrick has a good chance just because of the game he is playing,\" she says. After Thursday's episode where Derrick decided the house was going to save Zach from eviction, there was no doubt he is one of the most dangerous players in the game.\"\nBut that doesn't mean she's rooting for him. \"I really want Donny to win,\" she gushes when I ask who she wants to see take home the prize. \"I love Donny, I have a soft spot for Donny. I had a good relationship with Donny since Day 1,\" she continues, confirming America's love of Donny as well.\nDonny isn't the only houseguest she is rooting for. Cody and Amber's relationship was that of an honest one, no matter how much it angered Caleb to see them together. \"I'm rooting for Cody, too, because he was a friend of mine,\" she says. Sorry, Caleb.\nAnd even though Amber's cheering for those two, she looks forward to when the game is over, so the houseguests can get to know each other outside of the house. \"You really don't know someone until they are out of the house,\" she explains. Although for her, what we saw was the real Amber. \"That's who I am outside of the house, that's what I promised myself going inside the house, that I was just going to be me 100 percent.\" And although being the real Amber didn't win her the prize, Amber has left with her head held high, and a summer full of great memories — that all of America got to see.\nImages: CBS","url":"https://www.bustle.com/articles/35077-who-will-win-big-brother-16-former-houseguest-amber-gives-us-her-prediction"}
