{"authors":[],"date_download":"2018-10-30 20:22:30","date_modify":"2018-10-30 20:22:30","date_publish":"2015-08-28 15:38:06","description":"Christopher Jamal Starks, a 22-year-old junior at Savannah State University, was shot and killed late Thursday on campus in the student center.","filename":"data/vaneerConsumption/WhowasChristopherStarks.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/08/28/Images/photos.medleyphoto.8042084-34d1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_breaking-news_who-was-christopher-starks__1540930950.html","title":"Who was Christopher Starks?","title_page":"Who was Christopher Starks?","title_rss":"NULL","source_domain":"ajc.com","text":"Christopher Jamal Starks, a 22-year-old junior at Savannah State University, was shot and killed late Thursday on campus in the student center. The gunman remained on the loose Friday morning. Here’s more information on Starks:\nBorn: Aug. 17, 1993. Starks was killed 10 days after turning 22.\nHigh school: Starks graduated in 2012 from Miller Grove High School in Lithonia, where he played football and competed in track and field. As a senior, Starks had 26 receptions for 453 yards as a wide receiver, but also had 16 tackles on defense. He signed a scholarship to play football at Appalachian State University.\nStarks was a good student who also sang in the school chorus, Miller Grove football coach Damien Wimes said Friday.\n“He was just a great kid, very well-rounded,” Wimes said.\nWimes, a close friend of Starks’ father, said he had known Starks since he was about 5 years old. But he was older before he decided to give football a try.\n“It was just so natural to him,” Wimes said.\nCollege: Starks played defensive back at Appalachian State before he later transferred to Savannah State. He was a junior at the time of his death.\nMusic: Starks was an aspiring rapper who performed under the stage name “Booley Boo.” An Atlanta audio engineer posted on Twitter that he had recently recorded Starks at his studio. Booley Boo’s first video is scheduled to be released in September, according to social media posts.\nFamily: Starks is survived by his parents and a younger brother, a freshman football player at Miller Grove.\n— Please return for updates.","url":"https://www.ajc.com/news/breaking-news/who-was-christopher-starks/Ik8TwqSn4rQUhEJQtvqB3N/"}
