{"authors":["Olivia Oran"],"date_download":"2018-10-31 00:35:41","date_modify":"2018-10-31 00:35:41","date_publish":"2016-12-01 00:00:00","description":"President and COO Gary Cohn was widely considered Blankfein's heir apparent but is now a candidate to lead the White House budget office.","filename":"data/vaneerConsumption/WhowillreplaceLloydBlankfeinatGoldmanSachs.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_who-will-replace-lloyd-blankfein-at-goldman-sachs-2016-12_1540946141.html","title":"Who will replace Lloyd Blankfein at Goldman Sachs","title_page":"    Who will replace Lloyd Blankfein at Goldman Sachs - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Lloyd Blankfein. Goldman Sachs Goldman Sachs Group Inc is again facing questions about who would succeed longtime Chief Executive Officer Lloyd Blankfein when he eventually steps down.\nThe Wall Street investment bank's president and chief operating officer, Gary Cohn, was widely considered Blankfein's heir apparent but is now a candidate to lead the White House budget office.\nMeanwhile, Michael Sherwood, who has also been floated over the years as a Blankfein successor, retired as Goldman's head of European operations last week..\nWhile Cohn has not yet been officially picked for a role in the White House, his talks with President-elect Donald Trump cast light again on succession planning at Goldman.\nThe recent developments also may give rise to a new group of leaders at the bank, most of whom have spent more than 20 years of their careers there.\nTo be sure, Blankfein, who has been CEO since 2006, has shown no signs that he will step down soon, even after a cancer battle.\nUnlike other Wall Street firms that have had significant turnover in their upper ranks, Goldman's leadership has remained remarkably stable over the years. Some Goldman executives have privately lamented that this has created stagnation for the next generation of leaders.\nCohn runs the bank's day-to-day operations and rose up the ranks on the trading floor withBlankfein, who has the second-longest tenure as a current top executive of a major Wall Street bank behind JPMorgan Chase & Co CEO Jamie Dimon.\nIf Cohn does join the Trump administration, his role as Goldman president may be split, according to people familiar with the matter. Chief Financial Officer Harvey Schwartz and investment banking co-head David Solomon are likely candidates, the sources added.\nA Goldman spokesman declined to comment.\nSchwartz, who joined Goldman in 1997 and has been CFO for three years, is known as a capable and cautious risk-manager. Like Cohn, he is a veteran of the company's trading floor.\nSolomon, meanwhile, is a Bear Stearns veteran who joined Goldman in 1999. He climbed the management ladder quickly, a rarity at a bank that typically promotes employees at a slow pace. Soon after Blankfein became CEO, Solomon assumed his current role, where he helps to run Goldman's mergers and capital-raising businesses.\nPablo Salame, who is co-head of the bank's trading unit, and Stephen Scherr, CEO of Goldman Sachs Bank USA, are mentioned as potential replacements for Schwartz if he is promoted, some of the sources said.\nSalame joined Goldman in 1996 and has held various trading positions in both fixed income and equities in New York and London.\nScherr, who is also Goldman's head of strategy, is responsible for building out consumer banking for the company. He started at Goldman as an associate in 1993.\nChief Accounting Officer and Controller Sarah Smith is also a contender for CFO, the sources added.","url":"https://www.businessinsider.com/who-will-replace-lloyd-blankfein-at-goldman-sachs-2016-12"}
