{"authors":["Myra Butterworth For Mailonline"],"date_download":"2018-10-23 00:36:22","date_modify":"2018-10-23 00:36:22","date_publish":"2016-01-11 10:10:03","description":"The housemates need only pay a 'rent they can afford' to enjoy the Grade II listed property in East London, says the generous homeowner and businessman Rupert Hunt.","filename":"data/vaneerConsumption/WhowantstolivewithamillionairePropertyentrepreneurseekstwohousematesinvitedtoonlypaytherenttheycanafford.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/08/18/2FECF75900000578-0-image-a-21_1452276944468.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/property_article-3390773_Who-wants-live-millionaire-Property-entrepreneur-seeks-two-housemates-invited-pay-rent-afford_1540254982.html","title":"Who wants to live with a millionaire? Property entrepreneur seeks two housemates invited to 'only pay the rent they can afford'","title_page":"Who wants to live with a millionaire? Property entrepreneur seeks two housemates invited to 'only pay the rent they can afford' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"With many tenants barely able to scrap January's rent together, the chance of living in a luxury six bedroom in London's hipster Spitalfields for a minimal rent may seem like an impossible dream.\nBut that's exactly what is being offered by entrepreneur and lonely homeowner Rupert Hunt who is using his own site SpareRoom.co.uk to find people to share his £3m home.\nRupert Hunt, the founder of SpareRoom.co.uk is looking for new housemates after splitting with his wife\nThe Georgian property in London's Spitalfields is spread across five floors and has six bedrooms\nThe £3m house is 300 years old and boasts a kitchen with an Aga and a living area with an original fireplace\nMr Hunt will let his new housemates pay whatever they can afford in rent - even if it is only £200 a month\nMr Hunt founded the multi-million pound business SpareRoom.co.uk more than a decade ago\nThe average rent in Spitalfields is £2,284 a month, according to the property website Zoopla.\nBut rather than spend thousands of pounds renting a room in the area, Mr Hunt is offering tenants to pay 'whatever they can afford'.\nHe said: 'I ended up living on my own a couple of years ago after I split up from my wife, so I decided to use SpareRoom to find a couple of housemates.\n'To be honest I saw it entirely as a chance to learn something about the business, but I ended up learning that sharing with the right people beats living on your own any day. So, now my last housemate is leaving, I've decided to do it again.\nHe went on to explain that the new tenants could pay as little as £200 a month.\n'I'm open to living with pretty much anyone, as long as we get on and they add something interesting to the dynamic of the house,' he said.\n'That's why I've taken a \"pay what you can afford\" approach. For me it's all about the people so, if the person I think will make the best housemate can only afford £200 a month, that's what they'll pay.\nThe house can be 'a little spooky at night' warns Mr Hunt, who 'chickened out' of staying at the property on the night he moved in\nMr Hunt continued: 'It'll be fun to see what people make of the house too. It's 300 years old, so can be a little spooky at night - I have to admit, on my first night there I chickened out and stayed in a hotel round the corner.'\nThe Georgian property is spread across five floors and boasts a grand piano, Aga and a taxidermy bear. It has been Mr Hunt's home since 2013.\nIt is in prime celebrity spotting territory, with both One Direction and David Tenant having filmed in the street. It has also been a location for Great Expectations, The Woman in Black and the new British film Suffragette.","url":"https://www.dailymail.co.uk/property/article-3390773/Who-wants-live-millionaire-Property-entrepreneur-seeks-two-housemates-invited-pay-rent-afford.html"}
