{"authors":["Malaka Gharib"],"date_download":"2018-10-22 22:00:31","date_modify":"2018-10-22 22:00:31","date_publish":"2016-10-19 00:00:00","description":"A former punk rocker, a former mayor and a multilingual epidemiologist are among the six nominees vying for the top job at the World Health Organization.","filename":"data/vaneerConsumption/WhoWillBeTheNextLeaderOfWHO.json","image_url":"https://media.npr.org/assets/img/2016/10/19/candidate-grid3_wide-c580f58b29f15007f0b8214c5a0b979a2afec37e.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_goatsandsoda_2016_10_19_497939433_who-will-be-the-next-leader-of-who_1540245631.html","title":"Who Will Be The Next Leader Of WHO?","title_page":"Who Will Be The Next Leader Of WHO: Get To Know The Six Candidates : Goats and Soda : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Who Will Be The Next Leader Of WHO?\nEnlarge this image toggle caption Getty Images, AP and WHO Getty Images, AP and WHO\nWho will be the World Health Organization's next director-general? In September, the U.N. agency announced the six nominees, four men and two women, ranging from a cardiologist from Pakistan to a former punk rocker from Hungary. Over the next few months, WHO member-states will whittle down the list to one final candidate, who will succeed the current director, Dr. Margaret Chan, in July 2017.\nIn a series of interviews this month published by The Lancet, the candidates outlined their health priorities. For the most part, they're on the same page: They want WHO to mount faster and more effective responses to epidemics and humanitarian emergencies, to address the impact of climate change on health, and to deal with the threat of antimicrobial resistance.\nBut they definitely bring different skills and experience to the table. Here's a brief look at each contender:\nFlavia Bustreo, Italy\nThe doctor and epidemiologist is currently the assistant director-general for family, women's and children's health at WHO. Before that, she ran the agency's maternal, newborn and child health program.\n\"As the only WHO internal candidate, I bring in-depth management experience and extensive knowledge of the organization — the pitfalls and dynamics and the strengths and weaknesses — and have driven reforms and innovation, mainstreaming of gender, equity, and human rights across the entire organization,\" she told The Lancet.\nHer official WHO bio takes note of her lingual skills: Bustreo speaks five languages: English, French, Spanish, Portuguese and Italian and has studied Arabic and Russian.\nPhilippe Douste-Blazy, France\nDouste-Blazy, the under secretary-general of the U.N., was the former French minister of health and minister of foreign affairs. And he founded UNITAID, the U.N. agency that helps reduce the cost of HIV/AIDS, TB and malaria meds by raising funds in creative ways, like convincing airlines to donate to the cause by adding $1 to tickets.\nWhile he says those jobs have given him skills in diplomacy, politics and innovation, a job from his home region of France has taught him a lot, too.\n\"As a former mayor of Toulouse, I have managed an annual budget of $1.5 billion and 30 000 employees, comparable to the budget and exceeding the workforce of WHO. I will bring strong administrative and management experience to this role,\" he told The Lancet.\nThis year, he's a visiting professor at Harvard, teaching global health at the T.H. Chan school of public health.\nTedros Adhanom Ghebreyesus, Ethiopia\nCurrently the Ethiopian minister of foreign affairs, Ghebreyesus was previously the country's minister of health. He's the only candidate who is not a medical doctor (he has a Ph.D. in community health). But he believes that the challenges he's faced have prepared him for the post at WHO.\n\"I have learned what it takes to create real and sustainable change. I led the revitalization of weak health systems at Ethiopia's national and community levels; mobilized unprecedented human and financial resources; and catalyzed large-scale responses to health emergencies,\" he told The Lancet.\nA father of five, he was named one of Africa's 100 most influential people in the New African Magazine in 2015 for transforming Ethiopia's health system by deploying massive numbers of health workers.\nDavid Nabarro, United Kingdom\nNabarro, a 40-year veteran of public health, has held leadership positions at the U.N. and WHO, with a specialty in stopping the spread of disease. Currently, he oversees the U.N.'s approach to the cholera epidemic in Haiti. And in 2014, he did the same for the Ebola epidemic in West Africa.\n\"I ... have experience [in] transforming work on outbreaks and emergencies. I offer a safe pair of hands in crises and am effective at bringing different actors together so they work in synergy,\" he told The Lancet.\nThe medical doctor has worked in places like East Africa, Nepal and Iraq. Last year, he won the Helen Keller Humanitarian Award for his work in fighting malnutrition and Ebola.\nSania Nishtar, Pakistan\nA trained cardiologist based in Islamabad, Nishtar is the co-chair of WHO's commission on ending childhood obesity. She's also the founder and president of Heartfile, a think tank that focuses on public health in her country. She believes her perspective as a Pakistani and a woman will help bring diversity to WHO.\n\"I am a bridge between the Muslim world and the west and have the confidence of both developed and developing countries,\" she told The Lancet. \"As a woman leader and change agent, I am particularly gender-sensitive ... I can bring diverse voices to the negotiating table.\"\nNishtar is the subject of a 2016 documentary from the U.K. called Choked Pipes, which follows her work on bringing health care to the under-served in Pakistan.\nMiklós Szócska, Hungary\nSzócska is the founder of the Health Services Management Training Centre, a Hungarian health policy think tank supported by WHO and the World Bank. He's also the former Hungarian minister of state for health, where he helped enforce a ban on smoking in public spaces, limit trans fats in foods, and introduce a tax food and beverages with added sugar and salt.\nIn his statement to The Lancet, Szócska said he couldn't pass any of those big policies without being a team player. \"I habitually do my job working in teams, and as public health interventions are collaborative efforts, I am ready to mobilize WHO and the best public health experts ... to support our decisions and actions,\" he said.\nHe definitely has a past life different from the other candidates. In the early 80s, Szócska was a member of a punk rock band called ETA, where he wrote politically charged songs with vulgar lyrics — but told the Hungarian press that these songs of youthful rebellion wouldn't be appropriate today.","url":"https://www.npr.org/sections/goatsandsoda/2016/10/19/497939433/who-will-be-the-next-leader-of-who"}
