{"authors":["Sportsmail Reporters"],"date_download":"2018-10-23 01:10:54","date_modify":"2018-10-23 01:10:54","date_publish":"2017-03-16 10:57:26","description":"We asked Sportsmail reporters who they believe will lift the famously big-eared Champions League trophy this season. Will it be Barcelona? Will it be Leicester? Here is what they had to say...","filename":"data/vaneerConsumption/WhowillwintheChampionsLeague2017Sportsmaildecides.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53956A00000578-0-image-a-24_1489663989236.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319556_Who-win-Champions-League-2017-Sportsmail-decides_1540257054.html","title":"Who will win the Champions League 2017? Sportsmail decides","title_page":"Who will win the Champions League 2017? Sportsmail decides | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Champions League last 16 provided some of the greatest entertainment the tournament has ever seen with more goals (62) across the eight ties than ever before.\nWith the quarter-finalists now decided and the much-anticipated draw taking place on Friday, talk of the potential winners is set to step into overdrive.\nSo, we asked Sportsmail's reporters who they believe will lift the famously big-eared trophy this season. Here is what they had to say...\nThe Champions League trophy will be presented to the winners after the final on June 3\nAt 33/1, Premier League champions Leicester City are the rank outsiders for the title\nRiath Al-Samarrai - Bayern Munich\nThat demolition of Arsenal said more about the Germans than it did about the side they battered. They are brilliant and one that is cantering through the Bundesliga, while Barca and Real Madrid are wrestling away in Spain.\nThat, presumably, will work to their advantage. But how cruel on Pep Guardiola if they do it – it wouldn’t be a great look if the seasons immediately before and after his reign yielded the trophy he failed to deliver.\nBayern Munich can take it easy in the Bundesliga and save it all for the Champions League\nSami Mokbel - Barcelona\nName on the trophy...simple. Comebacks like last week's against Paris Saint-Germain happen for a reason. It's written in the stars. And if destiny isn't enough then there's Lionel Messi, Neymar and Luis Suarez.\nJoe Bernstein - Juventus\nI don't think Barcelona or Leicester should be allowed to win on grounds of high morality (Suarez diving, Vardy play-acting etc). Real Madrid can't because holders never retain the Champions League. Carlo Ancelotti at Bayern is a Euro expert but there's a whiff of being yesterday's man.\nIt's time for a less obvious winner which leaves Atletico Madrid, Monaco, Borussia Dortmund and Juventus. Of those, Juve and Atletico have the meanest defences. If I have to name one, I'll go for the Italians.\nThe immovable object will hold sway over the unstoppable force.\nJuventus' strong defence should overcome the best attacking forces in the Champions League\nAdam Shergold - Bayern Munich\nBayern Munich would be my tip to win it this year. They have the nous of Carlo Ancelotti in their dug-out, a man who has won the European Cup/Champions League twice as a player and three times as manager.\nAs they demonstrated in their 10-2 mauling of Arsenal in the last 16, they possess a consistent streak of ruthlessness that many of their rivals lack. Bayern also boast an incredible depth to their squad - Thomas Muller didn't even get off the bench in the second leg against the Gunners.\nBayern coach Carlo Ancelotti has the know-how when it comes to winning European titles\nThe other thing working in their favour is that they're 10 points clear at the top of the Bundesliga, meaning they can fully concentrate on winning the Champions League.\nBarcelona and Real Madrid, their main rivals to win the competition, are also locked together in a draining domestic title fight, while Bayern could probably afford to rest a few players in certain games ahead of European ties.\nAdam Crafton - Real Madrid\nReal Madrid are unbeaten in 57 of the 61 La Liga and Champions League games that Zinedine Zidane has managed since he took over from Rafa Benitez in January last year.\nHe won the Champions League inside his first five months as manager and he might just start to receive the credit he deserves if he can become the first coach to successfully defend the trophy.\nReal Madrid are unbeaten in 57 of 61 La Liga and European games under Zinedine Zidane\nRob Draper - Bayern Munich\nFirstly, there's Carlo Ancelotti; it's just what he does. Secondly Philipp Lahm and Xabi Alonso have announced their retirement at the end of the season.\nThere is no chance those enormously influential, professional and gifted players are going to mess up their finale. In short they have the manager, the players and the mentality needed.\nMatt Barlow - Barcelona\nPerhaps not the complete unit they once were but the comeback victory against PSG was an illustration of their frightening attacking power, desire and refusal to accept defeat.\nBarcelona are not as complete as they once were but their comeback vs PSG was frightening\nSome might say also an example of the leniency they enjoy from referees, especially at the Nou Camp. That comes in handy, too.\nMoreover they have the ability to tear apart any team, players experienced in the business end of the Champions League and the added emotion of Luis Enrique on his farewell tour.\nPete Jenson - Atletico Madrid\nI was going to say 'a team from Madrid' but I suppose I need to be a bit more specific. After twice losing the final to Real Madrid I think Atletico can go all the way this time.\nTheir domestic season is over, the focus is solely in Europe. They can save their best players for the remaining five games.\nIt would help if they can either draw Real Madrid over two legs or if someone else can eliminate them - Diego Simeone's nerves couldn't take a third derby final.\nAtletico Madrid could win the Champions League, so long as they don't play Real in the final\nChris Wheeler - Bayern Munich\nWith a 10-point lead at the top of the Bundesliga, the formidable Germans can approach the quarter-finals free of domestic concerns following their 10-2 aggregate win over Arsenal in the last 16.\nBayern have hit top form at the right time, going on an 18-match unbeaten run that includes 16 wins.\nAnd in Carlo Ancelotti, a three-time Champions League-winning coach, they have the know-how to go all the way.","url":"https://www.dailymail.co.uk/sport/football/article-4319556/Who-win-Champions-League-2017-Sportsmail-decides.html"}
