{"authors":["Will Martin"],"date_download":"2018-10-30 21:00:20","date_modify":"2018-10-30 21:00:20","date_publish":"2016-12-23 00:00:00","description":"Monte dei Paschi di Siena is on the brink of a government bailout after last minute attempts to rescue it using private money failed.","filename":"data/vaneerConsumption/WhyarepeopleworriedaboutMontedeiPaschidiSiena.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_why-are-people-worried-about-monte-dei-paschi-di-siena-2016-12_1540933220.html","title":"Why are people worried about Monte dei Paschi di Siena?","title_page":"    Why are people worried about Monte dei Paschi di Siena? - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Wikimedia Commons/Theodore Gericault The world's oldest bank is in the spotlight again.\nMonte dei Paschi di Siena, the 544-year old Italian bank that has caused countless sleepless nights for investors and politicians alike confirmed on Friday that it will accept a fresh bailout from the central government.\nThis comes after the bank failed to secure an anchor investor for its offer of new shares.\nThis in turn, dissuaded other institutions from putting money into the €5 billion (£4.2 billion, $5.2 billion) capital raise the bank needs to stave off collapse, two sources cited by Reuters said.\nMonte dei Paschi had pinned its hopes on Qatar's sovereign wealth fund investing €1 billion in its cash call, but after that failed, the Italian government has stepped in to help out.\nPolitical problems\nPerhaps the biggest issue facing the fresh bailout of Monte dei Paschi — it will be the bank's third in recent decades — is that it will fall foul of strict laws from the European Union put in place after the financial crisis to prevent huge state-funded bailouts like the ones seen at RBS and Lloyds here in the UK.\nThe measures are ostensibly there to protect taxpayers from losses, and to prevent another sovereign debt crisis in the eurozone like the one seen from 2009 onward.\nReplacing bailouts in the eurozone are so-called bail ins, when creditors face compulsory losses before any form of state aid comes into play.\nMonte dei Paschi's share price has dropped more than 99.9% from its pre-financial crisis level. Bank of America Merrill Lynch\nThe problem facing Italy is that a disproportionate number of creditors in Italian banks are not the institutional investors that tend to be the holders of bank debt, but are just regular people who bank with Monte dei Paschi.\nMany were sold MPS bonds as the equivalent to savings accounts, so if the government had opted for a bail-in it would effectively wipeout the life savings of millions of Italians.\nAny way you look at it, that would have been political suicide for the newly appointed prime minister Paolo Gentiloni and the Italian government.\nThat leaves the bailout as the only real option for Italy. The Italian government has now approved a €20 billion package to support the broader banking sector in the country, which will begin with Monte dei Paschi.\nThis in turn risks the ire of Brussels, and could lead to Italy facing sanctions from the eurozone's powers that be.\nAny punishment from the EU would most likely lead to a rise in already growing eurosceptic sentiment within Italy, which as the eurozone's third largest economy and one of the founding members of the euro, is a vital pillar of the European project.\nFormer comedian Beppe Grillo's Five Star Movement, the populist movement that claims not to be a political party and does not fit into the traditional right-left paradigm, has gained significant support over the past year, with the party winning the mayoralty of the capital Rome.\nFive Star Movement co-founder Beppe Grillo Reuters / Giorgio Perottino\nFive Star picked up a big coup when former Prime Minister Matteo Renzi's constitutional reform referendum was rejected earlier in December.\nEurosceptic parties across the continent seized on Renzi's loss as another rejection of the establishment. The vote was not about Europe in any significant way, and in fact by rejecting the reforms, Italians effectively backed the status quo and the establishment.\nWith populism sweeping Europe as a rejection of what many view as the over centralised approach in the 28-nation bloc— soon to be 27 after Brexit — punitive action towards the Italian government from Brussels following the bailout of Monte dei Paschi would only stoke the flames of populism even more, and give rise to further calls for Italy to become the second nation to leave the EU.\nA fresh crisis in Europe?\nThis is an argument touched upon by Nobel Prize-winning economist Joseph Stiglitz, who told Business Insider in July that the problems in Italy's banking system are endemic of the unnecessary rigidity within the eurozone's rules.\n\"It illustrates one of themes of my book, namely that having a single currency that works well given the diversity of Europe is really hard. And you have to have rules and regulations and politicians that are sensitive to this diversity. The fact is that in most countries the holders of the bonds are sophisticated people who have made returns in excess of the safe rate that represents the risk,\" he said.\n\"Italy represents a case where for a variety of historical reasons — and perhaps marketing — among the bondholders there appear to be a lot of ordinary individuals. If that is the case, which it appears to be, when you make them bear the cost you are really going after depositors, like happened in Cyprus, which I think the consensus was was a bad idea.\n\"A rule that works most of the time, that you ought to let the bondholders bear the cost looks like it may not be the right rule for Italy.\"\n\"This is a case where I think the European rigidity may have very high costs both for democracy and for Italy, and for in the end, if there's a referendum, the future of the eurozone.\"\nReuters/Stefano Rellandini\nLet's be clear. Italy will not be leaving the European Union any time soon. A little-known article of the Italian constitution means that it is almost impossible to imagine this happening. Article 75 of Italy's written constitution enshrines the fact that Italy cannot hold a referendum on anything related to international treaties.\n\"No referendum may be held on a law regulating taxes, the budget, amnesty or pardon, or a law ratifying an international treaty,\" the article states.\nMembership of both the European Union and the euro, are by definition international in nature, and as a result, for Italy to give its people a say on leaving either, the constitution would have to be changed. Obviously, that is no easy task and would require a strongly eurosceptic government with a serious will to leave the EU.\nThis could feasibly happen if Five Star were to come to power in the near future, but they'd need to command a two-thirds majority in the Italian parliament. Neither of these outcomes seem particularly likely as it stands.\nMonte dei Paschi may be about to trigger a fresh crisis in Europe, but do not expect the eurozone to collapse any time soon.","url":"https://www.businessinsider.com/why-are-people-worried-about-monte-dei-paschi-di-siena-2016-12"}
