{"authors":["Julia Teen"],"date_download":"2018-10-30 23:38:53","date_modify":"2018-10-30 23:38:53","date_publish":"2014-08-13 15:38:27","description":"Happy Left-Handers Day! Personally, I’ve never considered being part of this group, which makes up only 10 percent of the population, to be anything other than truly special. In my creative, left-handed opinion, we lefties are simply more unique…","filename":"data/vaneerConsumption/WhyArePeopleLeftHandedScientistsArentSureButWeLeftiesKnowThese11Struggles.json","image_url":"https://imgix.bustle.com/rehost/2017/10/4/e57f1a38-c8a7-44d0-a973-8f6e1e249146.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_21909-why-are-people-left-handed-scientists-arent-sure-but-we-lefties-know-these-11-struggles_1540942733.html","title":"Why Are People Left Handed? Scientists Aren't Sure, But We Lefties Know These 11 Struggles","title_page":"Why Are People Left Handed? Scientists Aren't Sure, But We Lefties Know These 11 Struggles","title_rss":"NULL","source_domain":"bustle.com","text":"Happy Left-Handers Day! Personally, I’ve never considered being part of this group, which makes up only 10 percent of the population, to be anything other than truly special. In my creative, left-handed opinion, we lefties are simply more unique than right-handed folk.\nSo what’s so awesome about being left-handed? Uh, we’re only total renegades, who, practically from birth, decided we were going to be different in a way that still puzzles everyone. (Even scientists still aren't sure why some people are lefties, though they think a single gene could control the left-right preference in humans. Unfortunately, they still can't figure out what that gene is.)\nWhatever the cause of left-handedness, studies show that we're certainly a different breed. It’s even been said that we're more creative thinkers and better problem solvers ... though as a collective, we also tend to be more forgetful. (Personally, that’s a pretty accurate analysis of my personality.)\nWhile it's rare these days to be persecuted over being left-handed, we still tend to get screwed over by our right-hand-dominant society in some aspects of everyday life. If you're left-handed, you know what I'm talking about. There are some struggles only my fellow lefties will understand.\nInk Stains\nDuring high school, it was perfectly normal for the entire back length of your left hand to be blue.\nChalkboards\nBERTRAND GUAY/AFP/Getty Images\nTrying to write a sentence without smudging anything is a pretty much impossible feat.\nSporting Goods Cost Waaaay More\nMARK RALSTON/AFP/Getty Images\nLooking for women's left-handed golf clubs, or a softball glove? Yeaaaah, that's going to cost you.\nScissors\nSeriously. Even the simple task of cutting a piece of paper is harder for us.\nThree-Ring Binders\nNo way. Not even going to happen.\nEating Dinner With Other People\nYour protruding elbow is inevitably going to get in the way of your right-handed table companion. Everyone else picks up their glass from the right … except you. Your left hand instinctively reaches out to grab the nearest glass — even if it’s not your own. Whoops.\nKeyboards\nKIRILL KUDRYAVTSEV/AFP/Getty Images\nYou've mastered the art of crossing over your hands when you need to punch in numbers now. At least you can use a mouse and eat at the same time. Try doing that, righties!\nCan Openers\nIt’s unfair that you need to avoid canned food at all costs.\nFountain Pens\nINDRANIL MUKHERJEE/AFP/Getty Images\nLefties push the pen nib, causing it to go scratchy on the page, unlike right-handers, who pull the pen nib for perfectly flowing ink.\nSlicing Bread Straight\nJustin Sullivan/Getty Images News/Getty Images\nIt's not your fault. Most serrated kitchen knives are right-handed, with the serrations sitting only on one side of the knife. Lefties have to use this backwards, and are left with jagged slices of bread.\nChoreographed Dances\nJean Chung/Getty Images Entertainment/Getty Images\nIn dance classes and workouts, you are naturally predisposed to starting with your left foot first, whereas everyone else skews right. The results can be awkward.","url":"https://www.bustle.com/articles/21909-why-are-people-left-handed-scientists-arent-sure-but-we-lefties-know-these-11-struggles"}
