{"authors":["Nicole Pomarico"],"date_download":"2018-10-31 01:42:13","date_modify":"2018-10-31 01:42:13","date_publish":"2018-08-28 02:21:14","description":"Despite the fact that Kevin and Astrid have had one of the most low-key relationships on Bachelor in Paradise this season (and have recently decided to be exclusive), they had their first bump in the road on Monday night's episode. But fortunately,…","filename":"data/vaneerConsumption/WhyAstridKevinsConversationAboutTherapyOnBachelorinParadiseIsSoImportant.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/caa98e2b-ffd1-4744-934c-0524b98cc259-149577_2299.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_why-astrid-kevins-conversation-about-therapy-on-bachelor-in-paradise-is-so-important-10258460_1540950133.html","title":"Why Astrid & Kevin's Conversation About Therapy On 'Bachelor in Paradise' Is So Important","title_page":"Why Astrid & Kevin's Conversation About Therapy On 'Bachelor in Paradise' Is So Important","title_rss":"NULL","source_domain":"bustle.com","text":"Despite the fact that Kevin and Astrid have had one of the most low-key relationships on Bachelor in Paradise this season (and have recently decided to be exclusive), they had their first bump in the road on Monday night's episode. But fortunately, it led to something good for them both — and for everyone watching. Astrid and Kevin had an open discussion about therapy, anxiety, and their hesitations in a new relationship, and it was so refreshing to see on reality TV.\nThe situation between them came to a boiling point when Kevin started picking at Astrid about how he wished she'd dated other guys in Paradise before settling down with him, because how else would she know she truly wants to be with Kevin above anyone else? Understandably, this really upset Astrid, because as far as she was concerned, it seemed like things were going well between them, and like she said, she didn't feel she needed to date other people to find out she had real feelings for Kevin.\nThat led to a bit of a breakdown, but fortunately, the breakdown led to one of the most honest and open talks about mental health on a Bachelor franchise show so far. Usually, the action centers around people just ignoring all of human emotions that someone might go through while getting into a relationship, on TV, no less. Or use the drama as a plot point to turn someone into a villain, victim, or both. This was really different.\nOnce they sat down to talk, Kevin admitted that his baggage from past relationships was keeping him from being able to fully trust Astrid, especially since two of his biggest heartbreaks took place from relationships he found on reality TV (most recently with Ashley Iaconetti after Bachelor Winter Games, which he told Astrid was \"the most heartbroken I've ever been\").\nBut although he was very clear about how anxious being in a new relationship is making him, Kevin was also open about the fact that he is seeking treatment for it, saying that he goes to therapy twice a week to cope with his feelings and even apologized to Astrid for his behavior. Good for Kevin for being honest — and good for BiP for showing this conversation.\nObviously, mental health and receiving treatment for issues like anxiety is hard to talk about, especially in front of TV cameras, but the more shows like this one bring these issues to the forefront, the less taboo these subjects will become and the more honestly people, on TV or not, can talk about them.\nAnd for the record, Kevin wasn't the only one feeling anxious about how serious their relationship had gotten so quickly, waiting for the bottom to fall out. \"This is real to me. Very real. As much as you're confused I'm very confused too,\" Astrid told him. \"I didn't expect this at all . I don't know how to make sense of all my feelings so I shut down because I don't know how to process what's happening.\"\nEven though both Kevin and Astrid have a lot of emotional baggage to unpack together, it does seem like it's something they're willing to work at and tackle head on. If they're able to keep having frank conversations like this and keep the lines of communication open, they might actually have a chance at making their relationship work long after their time in paradise ends.","url":"https://www.bustle.com/p/why-astrid-kevins-conversation-about-therapy-on-bachelor-in-paradise-is-so-important-10258460"}
