{"authors":[],"date_download":"2018-10-22 21:50:06","date_modify":"2018-10-22 21:50:06","date_publish":"2014-05-08 14:04:43","description":"China claims virtually the entire South China Sea and has begun acting on plans to drill for what is thought to be a wealth of oil there.","filename":"data/vaneerConsumption/WhyAreChinaandVietnamatLoggerheadsOveranOilRig.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/428916/140508-vietnam_0958_a86372ecaaaed578d2c99a884b72f786.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_energy_why-are-china-vietnam-loggerheads-over-oil-rig-n100311_1540245006.html","title":"Why Are China and Vietnam at Loggerheads Over an Oil Rig?","title_page":"Why Are China and Vietnam at Loggerheads Over an Oil Rig?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nChina has towed a deep sea drilling rig to a spot off Vietnam's coast in waters claimed by both. The rig has been escorted by a reported 70 Chinese craft that have rammed Vietnamese ships and fended them off with water cannons, raising tensions between the nations to their highest in years.\nQ: Why is China doing this?\nA: China claims virtually the entire South China Sea and has begun acting on announced plans to drill for what is thought to be a wealth of oil and natural gas beneath those waters. The moves may also be a test of Vietnam's ability and resolve to defend its own claims, along with Washington's insistence on freedom of navigation there.\nQ: Where is the rig?\nA: China has placed its oil rig about 130 nautical miles off Vietnam's coast in waters already identified by Hanoi for exploration but not yet offered to foreign petroleum companies. Vietnam argues the territory is clearly within its continental shelf. China's argument is based on its historic claim to most of the South China Sea and on the rig's proximity to nearby Paracel Islands, which are also disputed.","url":"https://www.nbcnews.com/business/energy/why-are-china-vietnam-loggerheads-over-oil-rig-n100311"}
