{"authors":["Chris Cutmore For Mailonline"],"date_download":"2018-10-23 02:53:15","date_modify":"2018-10-23 02:53:15","date_publish":"2017-03-16 13:30:16","description":"Premier League teams, are the richest in the world by some distance, but keep failing among Europe’s elite. Sportsmail's CHRIS CUTMORE takes a closer look at the problem…","filename":"data/vaneerConsumption/WhyareEnglishclubssobadintheChampionsLeague.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E4F485400000578-0-image-a-14_1489671007230.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4320230_Why-English-clubs-bad-Champions-League_1540263195.html","title":"Why are English clubs so bad in the Champions League?","title_page":"Why are English clubs so bad in the Champions League? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"And then there was one. Leicester are the only English team left in the Champions League this season, and does anyone really expect Craig Shakespeare to lead them any further? Possibly the same number of people who expected them to win the title last year; but whatever the answer, no-one at the Emirates, Etihad or White Hart Lane will care. It’s hand-wringing time again.\nSo, just why do Premier League teams, the richest in the world by some distance, keep failing among Europe’s elite? Having asked that question, you might at this point either be inclined to some serious soul-searching, or alternatively trot outside to bang your head against a brick wall. It really is becoming a tiresome question.\nBut so long as English clubs keep failing – some embarrassingly so – in a competition that they expected to succeed in, that question will keep being asked. So let’s take a closer look at the problem…\nPep Guardiola shows his frustration while watching Manchester City lose at Monaco\nWhat's wrong then?\nThe bald statistics. Between 2005 and 2011, English clubs were the giants of European football: Liverpool beat AC Milan in Istanbul, while only Barcelona were able to stop Arsenal in 2006 and Manchester United in 2009 and 2011. In 2007 and 2009, the Premier League accounted for three of the four semi-finalists. Chelsea, despite not winning the trophy, were the continent’s most consistent performers, even giving as good as they got against the mighty Barca.\nRoman Abramovich finally claimed the big prize in 2012, ironically with his weakest team, but that triumph masked the start of the decline of English clubs in Europe. Since 2012, there has been no English winner, and barely a semi-finalist. Spain, meanwhile, boast five of the last six finalists in the competition.\nThe line-up of quarter-finalists since 2012 makes for startling reading. In the last six seasons, Spain has provided 17 of the 48 teams. Germany are next with 10, but England (five) are well behind, lagging even behind France, whose league is derided by many. Even Turkey and Cyprus have managed one team each in the quarter-finals in that time.\nTo put it another way, in the past four seasons the entire Premier League has provided four Champions League semi-finalists, the same number as Atletico Madrid alone, Spain’s fourth-most successful club, whose resources pale against the might of Barcelona and Real Madrid.\nTottenham crashed out of the Champions League at the group stage earlier this season\nSo why the decline?\nThe arguments have been heard many times before, and these are the most well-trodden:\nPremier League clubs suffer from the increased intensity and strength in depth of their domestic competitions in comparison with their major Continental rivals.\nPremier League clubs suffer from having no winter break, which allows Continental rivals to refresh physically and mentally ahead of the Champions League’s return in the new year.\nIs there any truth in that?\nPlenty. Just ask Gareth Bale, arguably the man most qualified of all to speak on the subject, having starred for Tottenham in Europe during the Premier League’s glory years before moving to Real Madrid and winning the Champions League twice in the last three years.\n‘Every game in the Premier League you have to be at 100 per cent for 90 minutes or you will lose,’ he told Sportsmail recently. ‘In Spain, you can be up at half-time against the bottom club and take your foot off the gas. You can rest players and take people off. If you try for 45 minutes you won’t win a match in the Premier League.’\n‘Obviously the winter break is massive. In England you’ll play four or five games and we don’t play any. You don’t get many rest days and it really does burn you out for a long time after that.’\n‘It’s nice to really get away from it, mentally as well as physically.\n‘Spanish teams definitely know they have this edge over the English. Every country does: Spain, Italy, Germany, they all have the winter break.’\nGareth Bale, in action against Napoli, says in Spain 'you can take your foot off the gas'\nThat sounds pretty compelling evidence.\nNot half. Also consider this: when the Premier League dominated Europe, principally between 2005 and 2009, the English teams who qualified for the Champions League were the same every year: Manchester United, Arsenal, Chelsea and Liverpool -- the Big Four.\nSince then the spending power of Manchester City and intermittent rise of Tottenham has provided more competition for the previously established elite. Put simply, while the Big Four qualified for the Champions League every year, they routinely did well in the competition; now they are having to battle far harder to qualify, they are struggling against Europe’s elite.\nDon’t Bayern Munich ever struggle to qualify?\nYes, Ingolstadt, Hoffenheim and FC Koln routinely challenge their fragile grip on the German crown.\nI see your point.\nThe lack of distractions works the other way too: Chelsea do not have to play in Europe this year, and are enjoying their finest season since their players all gave up trying for Jose Mourinho; Leicester won that extraordinary title with nothing else to focus on last season.\nOK, case closed then.\nNot quite - there are still more possibilities for explaining the English malaise.\nSuch as?\nWell, there is the subject that constantly vexes the biggest football brains in England.\nHow Raheem Sterling is able to grow such a luxuriant beard almost overnight?\nNo, silly. Tactics.\nThe breath mints?\nThat just about sums up this country’s confusion over the subject.\nCHAMPIONS LEAGUE QUARTER-FINALISTS BY COUNTRY IN LAST SIX YEARS Spain 17, Germany 10, France 7, England 5, Italy 4, Portugal 3, Turkey 1, Cyprus 1\nHow so?\nWell, for a number of years, the English failure in Europe was blamed on tactical naivety. The play was too focused on how to beat Premier League teams, namely prioritising physical prowess and a gung-ho attitude, without due care and attention on ‘smart’ play, more of a balance between defence and attack (see Manchester United, then Arsenal, then City) and finding formations to beat technically superior European opponents.\nThis year, however, there are some voices claiming that Premier League teams are not playing ‘English’ enough, being too passive and technical, and using Leicester’s progress to the quarter-finals using 4-4-2, wingers, physicality and a high-energy pressing game, as evidence.\nThat is confusing.\nYes, although Gary Neville provided a strong argument for English clubs going back to the more ‘English’ way last season. ‘My biggest concern is that when you watch some of the better teams in Europe they actually look tougher mentally, better physically and have more intensity. Sometimes we’re watching a game on a Saturday or Sunday and we’re thinking it’s exciting and it’s fast paced. That’s correct but when you get into the Champions League it’s a different level so what we think is fast-paced doesn’t work when you’re up there. The better teams can apply high pressure all game and I’m not sure we’ve got enough teams who can do that. We’ve got to increase the intensity of our big games in this country which will then reflect on the Wednesday nights when we go into Europe.’\nSo, Premier League clubs suffer in Europe because of the intensity of the domestic League, but in order to beat Barcelona and Co they need to up their intensity?\nBit of a Catch-22, isn’t it?\nSevilla offer an intriguing insight into the difficulty of balancing the pursuit of glory both home and away. Under Unai Emery, they won the Europa League three times in succession but never troubled Barca or Real Madrid in La Liga; this season, under Jorge Sampaoli, they are genuine title contenders but were just knocked out of the Champions League by Leicester.\nLeicester pulled off a huge shock by beating Sevilla in the Champions League this week\nAren't they one of that rubbish lot from the Premier League?\nExactly. And speaking of rubbish, there is another reason why Premier League clubs have been failing in Europe.\nGo on…\nWell, basically, they just aren’t good enough.\nOh. Right. Sounds simple when you put it like that.\nIt’s the unavoidable truth, sadly. Just because the Premier League is the richest league – and probably the most competitive, passionate and entertaining – does not mean that it is entitled to be the best.\nTake Manchester City, for instance. They have spent £122m on central defenders in the last three seasons - £40million on Eliaquim Mangala, £35m on Nicolas Otamendi and £47m on John Stones – yet looked without a single defender of top class in conceding six goals over two legs against Monaco. Price tags are hugely inflated for Premier League buyers, leading to bigger expectation and more disappointment when the results don’t come.\nIsn’t Pep Guardiola fixing that?\nThat’s another issue. City displayed the same worrying weakness at the back that led to Guardiola leaving Bayern without winning the Champions League. His dogmatic footballing philosophy – possession-based, attacking football first, all else later – looks to have cost City again this year.\nThat sounds familiar.\nYou might be thinking of Arsenal, and Arsene Wenger. Their Champions League defeats are so repetitive that it’s gone beyond a joke now, to anybody but Tottenham fans.\nAlexis Sanchez and Arsene Wenger can't hide their disgust at Arsenal's latest defeat in Europe\nThe other English clubs have big weaknesses too, and have had for some time now. Chelsea’s players only seem to play when they feel like it, Tottenham seem overawed by Europe (and their temporary home of Wembley), Manchester United are still recovering from the retirement of Sir Alex Ferguson (three years later) while Liverpool’s only recent Champions League campaign - a vast disappointment - came directly after the loss of their talisman, Luis Suarez.\nDoesn’t sound like a recipe for success.\nNo. Especially given the emergence Barcelona, Real Madrid and Bayern Munich as the Champions League’s three superpowers. At least two of them have been among the semi-finalists every year since 2012, while all three have been in the last four twice. There is little room around Europe’s top table right now, given their excellence.\nSo how do they do it?\nThey have the best players for a start: Messi, Ronaldo, Robben of course but also Neymar, Kroos, Alonso, Busquets, Marcelo, Lewandowski… the list goes on and on.\nTheir complete dominance of the vast majority of their domestic rivals also allows them to be fresh for the biggest Champions League games, and that is a luxury the Premier League clubs will never be afforded in the current climate.\nJust ask Gareth Bale.","url":"https://www.dailymail.co.uk/sport/football/article-4320230/Why-English-clubs-bad-Champions-League.html"}
