{"authors":[],"date_download":"2018-10-22 21:26:33","date_modify":"2018-10-22 21:26:33","date_publish":"2014-05-07 12:04:11","description":"Recent estimates put Alibaba's value between $150 billion to $200 billion. That suggests the IPO could raise up to $15 billion.","filename":"data/vaneerConsumption/WhyAlibabaCouldEndUpBeingWorth200Billion.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/425541/140507-alibaba-0800_7e69659aa1d03f0fa539dea2ebd60567.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_markets_why-alibaba-could-end-being-worth-200-billion-n99031_1540243593.html","title":"Why Alibaba Could End Up Being Worth $200 Billion","title_page":"Why Alibaba Could End Up Being Worth $200 Billion","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAlibaba has finally filed for a U.S. initial public offering which will see it become the largest Chinese firm to list in New York. The question now is how much will the e-commerce giant be valued at when it starts trading.\nRecent estimates put Alibaba's value between $150 billion to $200 billion. That suggests the IPO could raise up to $15 billion, making it one of the biggest tech IPOs since Facebook listed its shares in 2012.\n\"There's going to be no trouble at all with this thing having a market cap of over $200 billion in my opinion after looking at the numbers. And there's a fair chance that in three or four years, it could be the most valuable company in the world,\" said Larry Haverty, a portfolio manager at Gabelli Funds.\n\"Alibaba is a one-off,\" he added. \"U.S. investors have rarely seen a company with these kinds of growth characteristics. You have massive scale and profit growth and enormous market share.\"\nThe company, co-founded by former English schoolteacher Jack Ma, had listed revenue of $5.66 billion and net income of $2.85 billion for the nine months that ended December 31.\nIt handled over 1.5 trillion yuan, or about $248 billion, of transactions for 231 million active users across its three main Chinese online marketplaces last year, more than Amazon and eBay together, according to Reuters.\nStill, Alibaba's U.S. trading debut will take place at a time when high-flying stocks such as Twitter have fallen back to earth.\n\"The big guessing game is the valuation of the company when it starts to trade. Most people believe this is a company that is worth between $150 (billion) and $160 billion,\" Eric Jackson, founder and managing partner at Ironfire Capital in Toronto, told CNBC.\n\"It's a one-in-10-years company. In some ways people will look past the macro-environment of the moment or sell-off in momentum stocks and see this company as a unique, high–growth company,\" he added.","url":"https://www.nbcnews.com/business/markets/why-alibaba-could-end-being-worth-200-billion-n99031"}
