{"authors":[],"date_download":"2018-10-30 21:05:54","date_modify":"2018-10-30 21:05:54","date_publish":"2016-12-06 21:56:00","description":"Consider staying put in Atlanta for New Year's Eve: Atlanta was named one of the top cities to celebrate New Year's Eve by personal finance site WalletHub","filename":"data/vaneerConsumption/WhyAtlantaisatopplacetocelebrate.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/06/Images/GettyImages-503043562-RbledRtmJiD1wBrvXCnGAWN-680x383%40AccessAtlanta.com.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/events_other_holiday_atlant_37acd52970d85399b9e0252a49c066ad__1540933554.html","title":"Why Atlanta is a top place to celebrate","title_page":"New Year's Eve 2016: Why Atlanta is a top place to celebrate","title_rss":"NULL","source_domain":"ajc.com","text":"With New Year's Eve right around the corner, you may be scrambling to find an exciting city to ring in the new year.\nBut consider staying put right here in Atlanta, because the metro was just named one of the top cities to celebrate New Year's Eve by personal finance site WalletHub.\nTo identify the best places to celebrate, WalletHub analysts compared the 100 most populated cities across three key dimensions including 1. entertainment and food, 2. costs and 3. safety and accessibility.\nThe cities were then given an overall score out of 100 points based on the dimensions.\nWith an overall score of 71.9, Atlanta ranked No. 3, behind Orlando, Florida, and San Francisco.\nAtlanta ranked in the top 10 for number of nightlife options per capita, legality of fireworks, number of New Year's Eve festivals, performances and galas per capita, number of restaurants per capita and luxury shopping.\nLooking for a party in the metro area? Consider these New Year's Eve celebrations.\n1. Orlando, Florida\n2. San Francisco, California\n3. Atlanta, Georgia\n4. Denver, Colorado\n5. Buffalo, New York\n6. Cincinnati, Ohio\n7. Miami, Florida\n8. St. Louis, Missouri\n9. Pittsburgh, Pennsylvania\n10. Las Vegas, Nevada\nLearn more about the study and its methodology at WalletHub.com.","url":"https://www.ajc.com/events/other/holiday/atlanta-named-one-the-best-places-celebrate-new-year-eve/f77UWNAlH6sofhDnYezCqN/"}
