{"authors":[],"date_download":"2018-10-22 21:29:07","date_modify":"2018-10-22 21:29:07","date_publish":"2014-05-07 12:43:49","description":"All of the attention focused on the kidnappings could have an unintended consequence: giving Boko Haram – and its leader – a public relations boost.","filename":"data/vaneerConsumption/WhyBringBackOurGirlsPlaysIntoBokoHaramsHands.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/426021/140507-nigeria-girls-abducted-mn-930_1390bafcbda5b73e36c43341092f337a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_why-bringbackourgirls-plays-boko-harams-hands-n99091_1540243747.html","title":"Why #BringBackOurGirls Plays Into Boko Haram's Hands","title_page":"Why #BringBackOurGirls Plays Into Boko Haram's Hands","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe plight of nearly 300 Nigerian schoolgirls kidnapped by the Boko Haram terrorist organization has gone from a national tragedy to an international crisis.\nAs weeks have passed, #BringBackOurGirls has reverberated on social media and rallies have been held in cities around the world. The U.S. confirmed Tuesday it was sending assistance and the U.K. has offered help as well. Nigerian police later announced a $300,000 reward for information on the girls' whereabouts.\nHere’s a look at the conditions that led to the kidnappings and the challenges around rescuing them.\nBRUTALITY OVERLOOKED - UNTIL NOW\nBoko Haram’s violent tactics are nothing new.\nThe group - whose name means “Western education is sinful” - has been waging a bloody campaign in northeast Nigeria for years, destroying churches, kidnapping scores of people and burning down schools, sometimes with the students locked inside.\n\"If an act like this brings attention, this is what you have to replicate or top to bring more attention\"\nBoko Haram’s brutal methods landed them on the State Department’s list of terrorist organizations and the U.S. government has offered a $7 million reward for information on leader Abubakar Shekau’s whereabouts.\nThe group has been blamed for more than 1,500 deaths this year alone – but the schoolgirls’ kidnapping clearly has touched a nerve – which could encourage Boko Haram to carry out similarly brazen attacks.\n“Terror organizations are political beings and they’re all about attracting attention and bringing attention to their cause,” said Raffaello Pantucci, senior research fellow at London's Royal United Services Institute think tank. “If an act like this brings attention, this is what you have to replicate or top to bring more attention.”\nTRACKING THEM DOWN\nThe rescue operation faces numerous challenges, not least of which is the damage caused by passage of time.\n“International attention to this has caught on very late and it’s perfectly possible that it’s now too late to get the whole group back,” Pantucci said.\nExperts believe the girls have been split up into smaller groups and moved into forested parts of the area where Boko Haram knows the terrain and has the upper hand against security forces.\n\"It could be years – if not decades – before all of the girls are accounted for\"\nBoko Haram's leader, Abubakar Shekau, has threatened to sell the girls in the market; he could also distribute them as gifts or rewards to Boko Haram’s expanding membership.\n“It could be years – if not decades – before all of the girls are accounted for,” said Jacob Zenn, analyst of African affairs for the Washington, D.C.-based Jamestown Foundation.\nPaying ransoms for the girls – which in recent years have yielded millions for terrorist outfits such as Ansaru, a Boko Haram splinter group – would be fraught with complications, given that any funds turned over would likely be pumped right back into arms and weapons for the group to carry out similar attacks.\nThere’s also the grim fact that many hostages have died in botched rescue attempts, and the possibility that Boko Haram also could use the schoolgirls as human shields.\nIf the girls have been separated into small groups – as many experts suspect – that would mean Nigeria’s security forces could be looking at dozens of separate rescues, a daunting prospect for the country’s military.\n“It’s not as simple as just saying we’re ready now, we’re going to do it,” Zenn said. “Even if they did decide to tackle Boko Haram, it’s not clear that they even have the resources.”\nCAVING TO PRESSURE\nWhile the international community has long urged Nigeria’s president to do more to choke off Boko Haram, the fiercely sovereign country mostly has insisted on going it alone – until now.\nThe Nigerian government’s military strategy has largely been about containing Boko Haram in the northeast, according to Pantucci.\n“They seemed to act as if this is just a problem that they have and they have to manage it rather than eradicate it,” Pantucci said. With the international attention around the girl’s kidnapping, “they realize this strategy doesn’t work,” he added\nPresident Barack Obama told NBC News’ Al Roker that Nigeria has accepted the U.S. offer of help from military and law-enforcement officials.\nSecretary of State John Kerry said that a joint intelligence cell would be set up at the U.S. embassy in Nigeria and would begin work \"immediately.\"\nOUTMATCHED AND OUTWILLED?\nBoko Haram has, by some estimates, several thousand members armed with everything from rocket-propelled grenades to anti-aircraft missiles.\n“It’s like fighting a militia or a fairly small army,” Zenn said, pointing to recent attacks that showed sophisticated planning and organization. “Boko Haram knows the terrain in the northeast and has sophisticated weaponry, including tanks, to do battle with even the most sophisticated army,” Zenn said.\n\"He's finally gotten placed on the world stage and this is his time to act\"\nNigeria’s military has thus far been unable to control the areas of the country where Boko Haram runs rampant - and the measures it has taken have come under fierce criticism.\nThe security forces have been accused of heavy-handed tactics against suspected militants, and the United Nations warned that the military may have committed human rights violations in its attempts to neuter the organization.\nThat heavy-handed approach could be helping Boko Haram attract recruits because some northerners fear the military as much as the militants.\nATTENTION A DOUBLE-EDGED SWORD\nAll of the attention focused on the kidnappings could have an unintended consequence: giving Boko Haram – and its leader – a public relations boost.\nAfter years of calling out to al Qaeda and taunting world leaders from Barack Obama to United Nations Secreatary-General Ban Ki-Moon, the outcry over the kidnappings has finally put Shekau in the spotlight.\n“This is what Shekau always wanted,” Zenn said. “He’s finally gotten placed on the world stage and this is his time to act.”\nZenn said that Boko Haram’s recent claims of responsibility for attacks outside its traditional northeast stronghold demonstrate that Shekau has more resources at his disposal – and is not afraid to use them.\nThat could mean bombings in Lagos or Abuja, like the one Boko Haram claimed responsibility for last month. Nearly six dozen people died in that attack.\nOr, he might revel in his new-found profile and dare the U.S. to take him on. If the U.S. takes the bait, it could push more al Qaeda sympathizers into Shekau’s corner by painting him as a defender against an American invasion – and boost his stature within terror networks.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/why-bringbackourgirls-plays-boko-harams-hands-n99091"}
