{"authors":[],"date_download":"2018-10-30 01:13:57","date_modify":"2018-10-30 01:13:57","date_publish":"2014-05-23 00:00:00","description":null,"filename":"data/vaneerConsumption/WhybothMarkCubanandJesseJacksonarefrightenedbyblackswearinghoodies.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_05_why_both_mark_cuban_and_jesse_jackson_are_frightened_by_blacks_wearing_hoodies__1540862037.html","title":"Why both Mark Cuban and Jesse Jackson are frightened by blacks wearing hoodies","title_page":"Why both Mark Cuban and Jesse Jackson are frightened by blacks wearing hoodies","title_rss":"NULL","source_domain":"americanthinker.com","text":"Tech entrepreneur, basketball team owner and one shrewd businessman, Mark Cuban g enerated some controversy when he publicly stated what many people think.\nHe then said, “If I see a black kid in a hoodie, and it’s late at night, I’m walking to the other side of the street. If on that side of the street there’s a guy that has tattoos all over his face — white guy, bald head, tattoos everywhere — I’m walking back to the other side of the street.” And the list goes on, of stereotypes that we all live up to and are fearful of. And, so, in my businesses, (I) try not to be hypocritical. I know that I’m not perfect. I know that I live in a glass house and it’s not appropriate for me to throw stones. And so when I run into bigotry — in organizations I control — I try to find solutions. I’ll work with people. I’ll send them to training, I’ll send them to sensitivity training. I’ll try to give them a chance to improve themselves because I think helping people improve their lives, helping people engage with people they may fear or may not understand, and helping people realize that while we all have our prejudices and bigotries ... We have to learn that it’s an issue that we have to control. It’s part of my responsibility as an entrepreneur to try to solve it, not just to kick the problem down the road. It does my company no good, does my customers no good, does society no good if my response to somebody in their racism or their bigotry is to say ‘It’s not right for you to be here. Go take your attitude somewhere else.’\nAlthough he refused to reveal how he will vote concerning the ouster of Donald Sterling from the NBA, reveal it, Cuban merely said\nthere’s no law against stupid. I’m the one guy who says don’t force the stupid people to be quiet. I want to know who the morons are.”\nAround the time Cuban was speaking, a principal of a mostly black Chicago high school located in a neighborhood which has recently seen an influx of Mexican immigrants; warned students:\nThe principal of Curie High School has put out a warning to students and parents to leave immediately after school and use a different route after six shootings in 48 hours in nearby neighborhoods. (snip) Curie High School wants students to leave that campus immediately after school, no hanging out outside. It also reminds students to be more aware of their surroundings.\nThat day, a Chicago headline stated \"At Least 10 Shot Across Chicago On Tuesday.\"\nExcept for one Hispanic neighborhood, the other shootings occurred in predominantly black areas. The suspects weren't identified so it is unknown whether any of them had hoodies...or tattoos.\nCertainly other school administrators around the country have issued similar warnings for similar reasons. Are they racist or just trying to protect their charges?\nAs civil rights icon and race hustler entrepreneur Rev Jesse Jackson Senior admitted 20 years ago,\nThere is nothing more painful to me at this stage in my life than to walk down the street and hear footsteps and start thinking about robbery. Then look around and see somebody white and feel relieved.... After all we have been through. Just to think we can't walk down our own streets, how humiliating.\nIt is more than humiliating; it is tragic, it is deadly. And that's not racist, that's the truth.","url":"https://www.americanthinker.com/blog/2014/05/why_both_mark_cuban_and_jesse_jackson_are_frightened_by_blacks_wearing_hoodies_.html"}
