{"authors":[],"date_download":"2018-10-23 01:07:17","date_modify":"2018-10-23 01:07:17","date_publish":"2016-03-15 00:00:00","description":"Even before he became \"BuzzFeed Andrew,\" Andrew Kaczynski spent hours a day scouring archives for political research. Now the 26-year-old leads a team bringing controversies and scoops to the public.","filename":"data/vaneerConsumption/WhyCampaignsShouldFearTheseFour20SomethingsNPR.json","image_url":"https://media.npr.org/assets/img/2016/03/14/160313_newsroom_42-1-_wide-261223037d1451d42aa1bbbe9582adc7de81acca.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=470374457_1540256837.html","title":"Why Campaigns Should Fear These Four 20-Somethings : NPR","title_page":"BuzzFeed's 'K-File': Why Campaigns Should Fear These Four 20-Somethings : NPR","title_rss":"NULL","source_domain":"npr.org","text":"RENEE MONTAGNE, HOST:\nAnd politicians are generally on notice that their opponents can hold them accountable through deep dives into their records - a practice called oppo research. Now, as NPR's David Folkenflik reports, candidates for the White House have also found themselves trying to dodge a buzz saw called BuzzFeed.\nDAVID FOLKENFLIK, BYLINE: Remember when Hillary Clinton tried to connect with Latino voters by asserting all four of her grandparents were immigrants?\n(SOUNDBITE OF ARCHIVED RECORDING)\nHILLARY CLINTON: All my grandparents, you know, came over here. And...\nFOLKENFLIK: Yeah, BuzzFeed disproved that, in part through a check on ancestry.com. The Clinton campaign had to walk it back. Only one grandparent was an immigrant. Donald Trump claims he consistently opposed the U.S.-led invasion of Iraq, despite no record of him doing so. BuzzFeed came up with this gem from \"The Howard Stern Show\" in 2002.\n(SOUNDBITE OF RADIO SHOW, \"THE HOWARD STERN SHOW\")\nDONALD TRUMP: We have an idea who the enemy is. And a lot of times, the politicians don't want to tell you that.\nHOWARD STERN: So are you for invading Iraq?\nTRUMP: Yeah, I guess so. You know, I wish it was - I wish the first time it was done correctly.\nFOLKENFLIK: So not consistently opposed to the invasion. BuzzFeed has grown past its roots as a viral site focused on lists and gifs. And it has earned credibility among more traditional journalists with some strong political reporting from the campaign trail. Now BuzzFeed is offering a new multi-media form of accountability journalism, repeatedly revealing the candidates' contradictions, hypocrisies, misstatements and, at times, flat-out weirdness. Sometimes its posts stand alone. Sometimes they propel longer reported pieces. Andrew Kaczynski is the leader of BuzzFeed's four-person K-file team.\nANDREW KACZYNSKI: To, like, truly understand who these people are, you have to, like, absorb all of their information from their life.\nFOLKENFLIK: Kaczynski wears a baseball cap backwards in the newsroom. His Twitter avatar involves a cartoon BuzzFeed icon smoking a cigar. And at 26 years old, he is the grizzled veteran of the team. One of his colleagues recently earned a degree from Columbia's Graduate School of Journalism. BuzzFeed editor-in-chief Ben Smith jokes that won't be held against him. Kaczynski and the K-File team have collectively watched an estimated 3,000 hours of video during this political season and filed hundreds of requests under the Freedom of Information Act.\nKACZYNSKI: And once you've done that with all of these people, whether it's Hillary Clinton or, like, Donald Trump - when things happen, you can, like, very quickly connect them.\nFOLKENFLIK: Those connections have had an effect. Mitt Romney's speech denouncing Trump relied several times on the research generated by BuzzFeed's K-File team. Trump spent days fielding pointed questions when Kaczynski found two instances where former Ku Klux Klan leader David Duke called for followers to support Trump's candidacy. Democrat Bernie Sanders found himself on the defensive over 30-year-old comments on a Vermont public-access channel praising the Castro regime in Cuba. And the K-File team made a meal of Ben Carson, in one instance unearthing this from a commencement address in 1998.\n(SOUNDBITE OF SPEECH)\nBEN CARSON: My own personal theory is that Joseph built the pyramids in order to store grain. Now, all the archaeologists think that they were made for the pharaoh's graves. But...\nFOLKENFLIK: Might want to go with the archaeologists on that one. Kaczynski's approach evolved while a student at St. John's University in Queens, N.Y. during the last presidential cycle.\nKACZYNSKI: I was just very interested in, like, learning who is Mitt Romney behind whatever his campaign rhetoric is - who he was at the time. And it was very much like going through it and picking out what other people would find interesting as well.\nFOLKENFLIK: So you're in your room. You're watching all of this stuff for hours. And your friends are saying what exactly?\nKACZYNSKI: I don't really have friends. I'd just moved to New York. I was living in a Russian family's basement. So no one was really saying anything. My girlfriend was, like, very surprised that it was getting pick-up.\nFOLKENFLIK: So at least she's like, you're a dork, but you've got some kind of logic behind it.\nKACZYNSKI: Yeah, yeah, basically.\nFOLKENFLIK: Kaczynski found tape of Romney years earlier calling himself a progressive while appealing to Massachusetts voters. He slapped it up on YouTube and tweeted out a link. This time around, mainstream news organizations often jump on BuzzFeed's leads.\n(SOUNDBITE OF ARCHIVED RECORDING)\nDON LEMON: Secretary Clinton, in 1996 you used the term super-predators to describe some young kids. Some feel like it was racial code. Was it? And where you wrong to use that term?\nFOLKENFLIK: That's CNN's Don Lemon basing a question at a Democratic debate on a K-File report. Clinton's reaction...\n(SOUNDBITE OF ARCHIVED RECORDING)\nCLINTON: I think it was a poor choice of words. I never used it before. I haven't used it since. I would not use it again.\nFOLKENFLIK: Katherine Miller says that the dynamic amounts to a one-two punch of old media and new. She's BuzzFeed's political editor.\nKATHERINE MILLER: Having it appear on CNN is a good thing because, you know, we don't have access to Donald Trump. We can't get into his events. We don't have press access to him. So we can't grill him on any particular issue.\nFOLKENFLIK: Yet millions of Americans read BuzzFeed.\nMILLER: We've been able to do posts that a lot of people see in a lot of ways, particularly through mobile on Facebook. And in that way, we're kind of getting the best of both worlds in terms of being able to have that presented to a candidate and also be read by a lot of people.\nFOLKENFLIK: Andrew Kaczynski loves the hunt but winces when thinking about his prey.\nKACZYNSKI: Sometimes politicians do, like, generally change their opinions on things. And there have been, like - they have moved with the times. But other times, like, it just comes off as so cynical and political that it can be somewhat disheartening.\nFOLKENFLIK: The funny thing is, if you ask Kaczynski who his audience is, he'll tell you it's the politicians themselves. So folks, you've been warned. David Folkenflik, NPR News, New York.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=470374457"}
