{"authors":["Brakkton Booker"],"date_download":"2018-10-23 01:07:15","date_modify":"2018-10-23 01:07:15","date_publish":"2018-07-12 00:00:00","description":"The Charlotte Housing Authority requires that people who get housing subsidies work — and the program is considered a success story. But helping people become self-sufficient remains a challenge.","filename":"data/vaneerConsumption/WhyCharlotteIsOneOfBenCarsonsModelsForHUDsWorkRequirements.json","image_url":"https://media.npr.org/assets/img/2018/07/11/ap_18178501779834_wide-21b0eaadb0831ebfcb43c9cfac3f2ec0996ae213.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_07_12_627621845_why-charlotte-is-one-of-ben-carsons-models-for-hud-s-work-requirements_1540256835.html","title":"Why Charlotte Is One Of Ben Carson's Models For HUD's Work Requirements","title_page":"Why Charlotte Is One Of Ben Carson's Models For HUD's Work Requirements : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Why Charlotte Is One Of Ben Carson's Models For HUD's Work Requirements\nEnlarge this image toggle caption Alex Brandon/AP Alex Brandon/AP\nWhen Housing and Urban Development Secretary Ben Carson was crafting his rent reform proposal for Americans living on housing assistance earlier this year, he spoke to leaders at the Charlotte Housing Authority in North Carolina about their work requirements.\nThe \"Making Affordable Housing Work Act\" would allow housing authorities more flexibility to impose work requirements on tenants, which Carson said helps promote self-sufficiency.\nThat's why the secretary homed in on Charlotte. CHA has been requiring that tenants work since 2011, and is widely praised for its success in providing supportive services in the form of education, training and help finding assistance for child care and transportation, which all make it easier for tenants to find work and earn more money.\nBut some question whether Charlotte's model can work in other cities.\n\"This is my start\"\nCHA is one of 39 public housing authorities out of more than 3,400 across the U.S. that participate in a demonstration project known as Moving to Work. It allows authorities the leeway to use federal HUD funds to experiment and tailor strategies based on local needs.\nCharlotte requires able-bodied adults ages 18 to 61 to work 20 hours a week. If residents can't find work, then they can volunteer or must enroll in job training.\nPaulette Culbreth, a resident with Charlotte Housing since 2003, hopes to be one of the city's success stories.\nShe lives in Southside Homes, a sprawling development with nearly 400 units in Charlotte's South End neighborhood.\n\"[There] wasn't no support at the beginning with Charlotte Housing with me,\" Culbreth said. \"So I was pretty much on my own.\"\nAnd, for Culbreth, life has been a challenge at times.\nShe was a single mom, has spent time in jail, and has battled drugs and alcohol over the years. Now the 45-year-old grandmother says her life is moving in a positive direction.\nCulbreth is enrolled in Charlotte Housing's supportive services program and is assigned a case manager who helps her stay on track with life and work goals.\nEnlarge this image toggle caption Brakkton Booker/NPR Brakkton Booker/NPR\nShe completed a financial literacy class, and earns $12.50 an hour as a part-time jobs coach with the authority, connecting other residents with employment training and benefits programs.\nOn one side of her modestly decorated work cubicle, Culbreth has messages of inspiration, including signs that read \"Family is Forever\" and \"Thank You For Being You.\" On the other side is a certificate recognizing her completion of a two-week program that covered skills for the workplace.\n\"I never had a desk of my own,\" Culbreth said. \"It's a wonderful feeling. This is my start.\"\nAcross the street from her workplace is the two bedroom unit she shares with her daughter and two grandsons. Culbreth pays 30 percent of her adjusted income towards rent, which comes out to roughly $188 per month.\nShe recently started a class to receive her property leasing agent certification. Culbreth has plans to find full-time work and make more money. Some of her long-term plans are laid out on a vision board she keeps by her bed.\n\"That's my house, my Lamborghini and my yacht,\" Culbreth said with a chuckle. \"And I'm going to be celebrating that in 15 years.\"\nMoving to self-sufficiency remains a challenge\nDon't dwell on those particulars.\nThe real focus should be on the fact that Culbreth is brimming with confidence and striving to set an example for her family, according to William Rohe. He has done extensive research on Charlotte's work requirements as director of the Center for Urban and Regional Studies at the University of North Carolina at Chapel Hill.\n\"The people who have gotten jobs have typically gotten low-wage jobs and part-times jobs,\" Rohe said. \"With that kind of salary you're really not going to be able to afford rent on the private market.\"\nNational Explaining The Possible Changes To Public Housing Explaining The Possible Changes To Public Housing Listen · 3:52 3:52\nRohe said Charlotte has become a \"mini-boom town\" over the last decade as a number of banks are headquartered there, including financial giant Bank of America.\nCharlotte's population continues making affordable housing scarce. One bedroom apartments on the private market rent for more than $1,200 per month, according to the apartment trend website RentJungle.\n\"It's made it much more difficult over the last 10 years for lower income people to be able to find units that they can afford within the city of Charlotte,\" Rohe said.\nSo given all these factors, how many tenants subject to Charlotte Housing Authority work requirements have moved to self-sufficiency?\n\"Well the answer to that is, not many,\" Rohe said.\nMarket rate v. affordable housing\nCharlotte Housing first began imposing work requirements on a handful of properties seven years ago, and expanded their supportive services with work requirements to all properties, including housing choice voucher recipients last June.\nOfficials say of the approximately 22,000 residents it serves at any given time, some 800 families have moved out of public housing, including 107 families that have moved into home ownership.\nCHA adds it has only had two evictions related to work noncompliance.\n\"We were very specific about our program being more of a supportive services program,\" said A. Fulton Meachem, president and CEO of the Charlotte Housing Authority, who spoke to Carson about his program ahead of HUD's rent reform announcement in April.\n\"Just asking someone to go to work has not been successful I believe,\" Meachem said. \"Giving them the support they need to go to work, I do think that works and we're proving that [it] can work here in Charlotte.\"\nNational Public Housing Crisis Threatens Illinois River Town's Existence Public Housing Crisis Threatens Illinois River Town's Existence Listen · 4:58 4:58\nHe adds that Charlotte's vibrant economy helps the success rate connecting tenants with jobs and that their model may not work for every housing authority. He also points out that the work requirements are not intended to be punitive, but encouraging.\n\"I don't feel like individuals should be on a term limit when the issue is they are working,\" Meachem said. \"But even with them doing the things that they're supposed to do, they can't afford what people would define as the market rate. That's not their fault.\"\nCharlotte is like many housing authorities across the country, with a waiting lists that stretch on for years. Officials say it currently stands at approximately 18,000. It last opened its list in 2014, receiving more than 31,000 in a week.\nSo should HUD push other housing authorities to follow Charlotte's work requirement model?\nRohe, at the Center for Urban and Regional Studies, says emphatically, no.\n\"To have a blanket, every housing authority has to do this would be an absolute disaster,\" he says.\nHe added, if work requirements lead to a lot of evictions, then it really becomes counterproductive.\nLate last month, Carson defended his \"Making Affordable Housing Work Act\" proposal at a House Financial Services Committee hearing, saying the \"proposal is a starting point in the conversation\" about rent reform.\nIn addition to work requirements, the plan also called for increasing the amount people living in public housing pay toward their rent. For some of America's neediest families rents would triple, jumping from a minimum of $50 per month to $150.\nThanks to Congress' move to increase HUD's budget above the administration's initial request, Carson said during a recent panel discussion at the Bipartisan Policy Center that the rent increase portion of his plan was no longer \"urgent.\"","url":"https://www.npr.org/2018/07/12/627621845/why-charlotte-is-one-of-ben-carsons-models-for-hud-s-work-requirements"}
