{"authors":[],"date_download":"2018-10-30 18:02:42","date_modify":"2018-10-30 18:02:42","date_publish":"2018-07-30 19:45:00","description":"Comic book artist Afua Richardson’s work takes her from superheroes to Rep. John Lewis' role in civil rights movement","filename":"data/vaneerConsumption/WhycomicbookartistAfuaRichardsonsstarisrising.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/30/Images/newsEngin.22507355_080518-sla-Afua-Artist-HS02.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_arts--theater_cacfea2d156dfe597afc99ec83874af9__1540922562.html","title":"Why comic book artist Afua Richardson's star is rising","title_page":"Why comic book artist Afua Richardson's star is rising","title_rss":"NULL","source_domain":"ajc.com","text":"Six feet tall in her red platforms and brilliant sunflower-yellow dress, Afua Richardson sails into My Parents’ Basement with an arm full of comic books and her portfolio over her shoulder.\nThe restaurant/tavern/comic book store in Avondale Estates is appropriately dolled-up for Richardson’s arrival, with a poster featuring one of the artist’s paintings of a glamorous femme fatale, and a display of her prints and greeting cards for sale.\nThe new graphic memoir, “Run,” by Rep. John Lewis is illustrated by Stone Mountain artist Afua Richardson. The book begins in 1965, just after the Voting Rights Act is passed, and demonstrates that the fight for civil rights isn’t over. The first volume is due next year, but Richardson recently received some samples of advance pages from the publisher. CONTRIBUTED BY ABRAMS COMIC ARTS (The Atlanta Journal-Constitution)\nTim Ensor, co-owner of the establishment, is ready with the news that Richardson, 38, has just won an Eisner Award the previous Saturday at the San Diego Comic Con, for her work as illustrator of “Black Panther: World of Wakanda.” But this isn’t the coolest thing happening right now in the World of Afua.\nThe big news is cradled in her right arm. The Stone Mountain resident is carrying a stack of samplers from “Run: Book One.” These are advance copies of a few pages from the latest graphic novel by U.S. Rep. John Lewis. Richardson is the proud illustrator of the new book, and she’s signed a stack of the samples for Ensor.\nPeople familiar with the 2013 graphic novel “March” and its two sequels already know that Lewis’ illustrated history of his role in the civil rights movement became a sensation. Despite critics who thought a “comic book” was too pulpy for an elder statesman’s story, it triumphed on the New York Times best-seller list. The third installation went on to win the National Book Award, a first for a graphic novel.\n“Run: Book One” begins where “March” left off, two days after the passage of the Voting Rights Act in 1965, when Lewis encounters one of the biggest Klan parades in decades, in Americus, Ga. It traces the collapse of the Student Nonviolent Coordinating Committee, and Lewis’ launch into public office.\nAfua Richardson of Stone Mountain visited her friends at the Avondale Estates bar/restaurant/comics store called My Parents’ Basement to bring some advance copies of a sampler from her in-progress graphic novel, “Run.” Working with Rep. John Lewis, she’s illustrating the latest installment in his multivolume memoir about his experiences in the civil rights movement. HYOSUB SHIN / HSHIN@AJC.COM (The Atlanta Journal-Constitution)\nRELATED: Rep. John Lewis released from hospital after weekend of observation.\nCo-written by Lewis and his policy adviser and digital director Andrew Aydin, the “March” trilogy was illustrated in a brooding black and white by North Little Rock native Nate Powell. Powell will draw the first 10 pages of “Run,” but then will hand over the inkwell to Richardson. The first volume is expected next year.\nIt’s a big job (she still has 55 pages to produce by October), and Aydin predicts it will have a profound impact on Richardson’s career. “Your life is going to change. You’re going to have a totally different experience from here on out,” he said, predicting that her renown will go far beyond her Black Panther fame.\nComic book artist Afua Richardson strikes a superhero pose surrounded by the inventory at My Parents’ Basement, a restaurant/comic book store in Avondale Estates. HYOSUB SHIN / HSHIN@AJC.COM (The Atlanta Journal-Constitution)\nCan she handle it? “She’s been training her whole life for this,” said husband Camron Wiltshire.\nLike Powell, who started out as a drummer, Richardson actually planned to be a musician. She grew up on 153rd Street in Harlem, and began playing the flute at age 9, performing in Carnegie Hall with a citywide orchestra at age 11. “I was a quiet kid,” she said, untying her elbow-length dreads and ordering a snack of tater tots. “I sang, but that was the only time you heard me. I joined the band; I was a band nerd.”\nShe began working in high school to help support the family, and continued scuffling afterward, as telemarketer, secretary, caterer, model, jingle singer and vocalist in a menagerie of ensembles, including a Rose Royce cover band. She even appeared on the Jimmy Fallon show as a backup singer.\nA sketcher since she was little, the young woman also saw that her future might be in art rather than music. She took online art classes and taught herself how to use Adobe Illustrator whenever she had access to an office computer.\nRichardson first drew for Marvel in 2006, shortly before she moved to Atlanta from New York and gained some attention with her work on “Genius,” a 2014 Top Cow comic about a military prodigy who happens to be a 17-year-old black girl from South Central, L.A.\nAround that time, she also shared a panel with Aydin at a black comic arts festival in Los Angeles.\nAfua Richardson has gained fame in the comics world for hwer artwork in “Black Panther: World of Wakanda,” a series that just won an Eisner Award. CONTRIBUTED: AFUA RICHARDSON\n“I liked her style. I particularly liked her ability to do likenesses,” said Aydin, speaking from Lewis’ Washington, D.C., office. “More than anything, I liked the way she gave time to young people.”\nAydin noticed that whenever a kid approached Richardson’s table at a convention, she would step around the table, crouch down until she was at eye level, and give all the attention in the world to the youngster.\n“I don’t think she’s ever attempted anything of this length before.”\nCongressman John Lewis tours new Civil Rights museum\nPowell, who hands her his blessing along with the torch, said he’s excited to see a black woman’s perspective brought to this story. Richardson is well-equipped for the responsibility. “She’s better than me at isolating and minimizing the pictorial content in a panel into a more stark, single, graphic image,” he said from his home in Bloomington, Ind. “I’m more panel heavy.”\n“Run,” the new John Lewis-penned memoir of the civil rights movement, which is coming out next year, will be illustrated by Stone Mountain resident Afua Richardson. CONTRIBUTED: ABRAMS COMIC ARTS\nShe’s learned about racist violence from her grandmother in Alabama, who was arrested and jailed for registering to vote, and from her father, who was attacked for walking to school.\n“Her father has experienced a lot of the racism depicted in the book,” said Wiltshire, a muralist and a mixed martial arts competitor. “He’s a very sweet and gentle, considerate man, he’s very well-educated, he’s self-made, and I think it’s wonderful that she can pay tribute to his spirit and his resilience.”\nHer style is fluid, painterly. She is influenced by anime and is a delicate colorist. Restricting herself to the black and white of “Run” has been a learning experience. “It’s a good challenge to study value,” she said.\nRichardson started the project using brush and ink, but switched to digital art to be able to move faster, and also to incorporate the revisions that flowed in from Washington.\nEven her digital art is painterly. She scans individual brushstrokes into Adobe Illustrator, so that she works from a lexicon of her own gestures. “I turn my computer into a digital brush.”\nUnlike some comics fans, she’s nothing but happy about the thunderous success of comics-based movies, especially the slew of Marvel superheroes (including Black Panther) who have become box-office gold. The exposure has given comics new life.\n“Once the rights to X-Men were released, the floodgates opened,” she said. “It provided more of a financial base, opening up comics to a new audience.”\nShe’s had dinner with Aydin and John Lewis in New York, but her access to the congressman has been limited, and she’s worked — as did Powell — from visual reference materials, photographs and newsreels of the 1960s.\nLewis, she said, “is a very gentle and quiet man until he gets on stage. Then he’s filled with so much fire. He reserves his energy for the right moment.”\nAfua Richardson’s moment is now. She will talk about her new project at Dragon Con over Labor Day weekend, Aug. 30-Sept. 3. Go to Dragoncon.org for more information.\nAFUA RICHARDSON IN HER OWN WORDS\nOn the lack of black superheroes in comics:\n“I often hear people complain about representation in comics. The way I see it, if the heroes in the books you buy don’t represent who you want to read about, then you can support the artist who does. I see it as an opportunity to get innovative and fill a need. Get creative, not angry.”\nOn busty female superheroes and their skimpy costumes:\n“I’m put on a lot of panels about women in comics, with legendary creators like Joyce Chin and Gail Simone (artist and writer of Red Sonja and other works), and their point is that if the costume fits the personality of the superhero, it will work. Audacious and lascivious characters dress accordingly. Red Sonja, for example, has no couth. She understands that if she wears a metallic bikini, it will distract her opponent and she can cut off their head. When a character is shy or reserved, a revealing and impractical costume is not good storytelling because it’s not believable.”\nOn black anger:\n“I always end up being the opposing voice to the anger … I understand it. But it doesn’t often lead to a solution. In Harlem when I was growing up, many blacks who lived near me had this idea what ‘white people’ are like, but we didn’t live around them to verify that. I went to school with a mixed group of kids, and it was illuminating. I learned that we’re all just individuals who share culture according to our geography and family. We’re not a hive mind. Everyone has a different path; some paths are just harder than others.”\nOn modeling:\n“Somebody once told me, ‘You’d be the next Naomi Campbell if you lost 15 pounds,’ but you know what? I like eating. I’d rather be asked to be part of a campaign because I do something noteworthy, not just because of my face.”","url":"https://www.ajc.com/entertainment/arts--theater/comic-book-artist-work-takes-her-from-superheroes-civil-rights/LMEvGy1vCrJjkw0RKtctyJ/"}
