{"authors":["Natalia Lusinski"],"date_download":"2018-10-31 01:48:15","date_modify":"2018-10-31 01:48:15","date_publish":"2018-09-11 14:00:55","description":"You’ve likely heard of the human papillomavirus, also known as HPV. While both women and men can be vaccinated against it, the virus can only officially be detected in women, not men. If you're wondering why men can't be tested for HPV — yet —…","filename":"data/vaneerConsumption/WhyCantMenBeTestedForHPVTheMostCommonSTIIsStillOnlyTestedForInWomen.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/7/a39e4ebc-8803-4392-a7b7-88d29e6314ac-zaeh_bustle_apr2016-572.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_why-cant-men-be-tested-for-hpv-the-most-common-sti-is-still-only-tested-for-in-women-10231928_1540950495.html","title":"Why Can’t Men Be Tested For HPV? The Most Common STI Is Still Only Tested For In Women","title_page":"Why Can’t Men Be Tested For HPV? The Most Common STI Is Still Only Tested For In Women","title_rss":"NULL","source_domain":"bustle.com","text":"You’ve likely heard of the human papillomavirus, also known as HPV. While both women and men can be vaccinated against it, the virus can only officially be detected in women, not men. If you're wondering why men can't be tested for HPV — yet — that’s a great question. But first, it’s important to understand the intricacies that make up HPV.\nHPV is the most common STI in the U.S. According to the Centers for Disease Control and Prevention (CDC), approximately one in four people — that's nearly 80 million people — are currently infected with HPV, and about 14 million people become newly infected each year. While condoms can help lower your chances of getting HPV, they may not fully protect you.\nAnother caveat of HPV is that you don’t even necessarily have to have sex to get it. A 2015 study published in the journal Sexual Health found that HPV can be transmitted in other ways, too, such as from hands touching genitals. In fact, the research found that HPV was in the genital tract of up to 51 percent of female virgins. However, HPV is usually spread through vaginal or anal sex, although via oral sex is possible, too. And, the person you get it from may not even be exhibiting any symptoms — namely, genital warts. In addition, you can have it for years before showing symptoms, so you may never know when exactly you got it, let alone from who. If you factor this in, along with the number of people who are too afraid to admit they have it, the number of people with HPV is likely even higher.\nBut as common as HPV is, it's highly stigmatized and often misunderstood. It can affect women and men in serious ways, leading to bigger health issues like cervical and anal cancers, Lawrence A. Siegel, clinical sexologist and certified sexuality educator at the Modern Institutes for Sex Therapy Training and Sage Institute for Family Development, tells Bustle.\nSo why, then, are women the only ones who can be tested for HPV when it occurs in men, too, and some of those men are giving it to women — often without even knowing it?\nThe Different Types Of HPV\nWhen it comes to types of HPV strains, there are several dozen of them. “There are over 100 HPVs out there, and almost half of them can be sexually transmitted,” Siegel says. “At some point, it is believed that virtually all sexually active adults will have some type of HPV.” However, for most people, the body is able to clear HPV and it won’t really have any impact, he says. According to the Foundation for Women’s Cancer, the average length of an HPV infection is between four and 20 months, and it often clears up on its own within two years.\nHowever, it’s also important to keep in mind that HPV is divided into low-risk and high-risk types. “Low-risk HPVs generally are responsible for warts, particularly genital or anal warts, while high-risk HPVs are generally related to cancers, mostly cervical and anal,” Siegel says. And, given that the CDC says most cases of cervical cancer are caused by HPV, the absence of a test for men has a direct impact on women’s health.\nThe Complications Of HPV\nAndrew Zaeh for Bustle\n“There are many types of HPV, some more high-risk than others at increasing your chance of getting cervical, oral, or anal cancers,” Dr. Sherry A. Ross, women’s health expert and author of she-ology. The Definitive Guide to Women’s Intimate Health. Period., tells Bustle. According to the CDC, HPV is thought to be responsible for more than 90 percent of cervical and anal cancers.\nFor men, HPV may lead to genital warts, but certain strains can lead to cancer of the penis, anus, or throat, Dr. Ross says. The cancer-causing HPV will not exhibit warts. Instead, other symptoms may appear, such as anal bleeding, itching, pain, or discharge, to indicate a man might have cancer of the anus. Penile cancer symptoms can include ­changes in color, skin thickening, or a sore or growth on the penis. ­Meanwhile, a constant sore throat or ear pain could indicate cancers of the oropharynx.\nWhat's more, a recent study among adults ages 18 to 69 in the journal Annals of Internal Medicine found that oral HPV is increasing among American men, which can lead to head and neck cancers. Oral HPV is found in the mouth and throat and is often linked to oral sex. In the U.S., oral HPV is much more common in men versus women: 11 million men compared to 3.2 million women. “There is no approved HPV test to see if HPV is in the mouth or throat,” Dr. Ross says. “Sadly, there is no way to prevent HPV from being transmitted to the mouth and throat — even if a dental dam or condom is being used.”\nHence, the fact that there is no HPV test available for men is cause for concern, to say the least. And, it might seem questionable, that there’s no way to test men for HPV, when it can clearly affect not only their health, but their partner’s health, too. So why isn't there a way to test for HPV in men?\nWhy Experts Say There's No HPV Test For Men\nSince there is no official HPV test for men, it is not easy to detect. While HPV is often found in women during a cervical Pap smear screening test, men do not have regular pelvic or genital examinations, Dr. Ross says. “There is no approved test to detect HPV in men,” she says. “Men who contract HPV rarely develop any symptoms, and it is often impossible to detect on male genitals.”\nOne reason why there may be no test for men has to do with anatomy, according to Siegel. “Part of the reason is due to the fact that tissue on the penis and in the anus is tougher than cervical tissue, which can be swabbed and tested in women,” he says. “While the cervix is a singular area that can be swabbed and tested during something like a Pap test, this is not the case with either a penis or an anus.”\nThat's not to say all testing is impossible, though. Anal Pap smear testing can be done for men who are high-risk or have anal sex regularly, Dr. Ross says. And that's not the only option. Adina Nack, Ph.D., who was diagnosed with a cervical HPV infection at the age of 20 and also wrote a book to help other women with HPV feel less stigmatized, Damaged Goods?: Women Living With Incurable Sexually Transmitted Diseases, says there are other ways to check, too. “In a sense, there is an HPV test for men: Whenever a biopsy is taken from a male patient’s oral cavity, genital, or anal area, that sample is analyzed for pathology in a lab, which can confirm HPV infection,” she tells Bustle. “Then, if there’s an infection, the type of HPV can be confirmed.”\nAnd, she says, there's more research being done to make HPV testing in men more accessible. “Researchers at Johns Hopkins have developed saliva and blood tests which can help predict the recurrence of HPV-related oral cancers,” she says. “Scientists are also working on saliva and blood tests to diagnosis first-time HPV oral infections.”\n“The value of testing men for HPV is debatable — meaning, what do we do with the information that a male is HPV positive?”\nBut some experts say the issue isn't just about being able to test for HPV in men — it's about being more proactive with prevention in the first place. “The value of testing men for HPV is debatable — meaning, what do we do with the information that a male is HPV positive?” Dr. Shoma Datta, founder of DT Gynecology: Aesthetics & Rejuvenation, tells Bustle. “Most men are HPV positive at some point in their lives, and, most commonly, an HPV infection will be cleared from the system without causing a problem. Some say this info is important to limit transmission to a partner, but since HPV is so common, safe sex practices should always be practiced regardless.” Instead, Dr. Datta believes that HPV vaccination is key.\nThe Importance Of Getting The HPV Vaccine\nAndrew Zaeh for Bustle\nAccording to the CDC, every year in the U.S., HPV causes 33,700 cancers in men and women. However, most of the cancers, about 31,200, can be prevented from developing — by getting an HPV vaccination. Dr. Ross says that getting vaccinated is key when it comes to lowering your risk of contracting HPV. “The current HPV vaccine can reduce your risk of developing these types of cancers by 90 percent,” she says.\nGardisil 9 is the HPV vaccine which helps protect against nine types of HPV. Although it is recommended for men and women ages 9 to 26, some exceptions regarding age may sometimes apply. And, according to Dr. Ross, men should “absolutely” get the HPV vaccine. “Every year, 8,000 boys and men get cancers caused by HPV involving the throat, penis, and anus, and the current HPV vaccine can reduce the risk of developing these types of cancers by 90 percent,” she says.\n\"The hope is that boys and girls get the vaccine before they become sexually active,” Dr. Ross tells Bustle. But though it is the “hope,” this is clearly not always the case.\nNot Many Men Are Getting The HPV Vaccine\nWhen it comes to HPV vaccinations, not everyone is getting them. According to the CDC, only 43 percent of teens have received all the recommended doses of the HPV vaccine. What's more, Dr. Nack says that, according to 2017 data, only 10 percent of U.S. men had been vaccinated against HPV. “But, men should be getting vaccinated because, while fears of cervical cancer motivated female HPV vaccination, that’s not the only cancer caused by this STI,” she says. “The combined U.S. death rates for HPV-related oral, anal, and penile cancers are at least twice that of cervical cancers.”\nAccording to a new seven-year study of medical claims by the Blue Cross Blue Shield Association (BCBSA) Health of America Report, although HPV vaccination rates have risen substantially, just 29 percent of adolescents received a first dose of the vaccine by their 13th birthday. BCBSA also commissioned a survey of more than 700 parents of adolescents ages 10 to 13 and found that more than half said they have not vaccinated their child against HPV.\n“All in all, the conversation around HPV has to begin with getting vaccinated before you become sexually active.”\nThe top four reasons parents gave for this were: Being concerned about adverse side effects, not thinking their child is at risk, not knowing their child needed an HPV vaccination, and concerns about the vaccine promoting sexual activity — which other studies have proved false. According to the survey, 72 percent of the parents said they know the HPV vaccine is for both men and women, although 41 percent still will not have their son vaccinated because they are not in favor of it.\n“If everyone has access to getting their child vaccinated by age 13, we could eradicate precancerous conditions and cancer, not only involving the cervix for women but also the anus, penis, head, neck, throat for men,” Dr. Ross says. She says other health risks associated with HPV could be eradicated, too. “All in all, the conversation around HPV has to begin with getting vaccinated before you become sexually active,” she says.\nGetting Rid Of The Stigma\nAndrew Zaeh for Bustle\nThe key to increasing the prevention of HPV is increasing the discussion about it. “It’s been found that many doctors are still uncomfortable talking about HPV with their male and female patients,” Dr. Ross says. She says that women regularly see a gynecologist for annual pelvic exams, Pap smears, STI testing, and for discussing birth control renewal and options. Men, on the other hand, don’t regularly see a health care provider with the same frequency as women— or get tested for STIs as often. “Men are not having these important yearly conversations with their health care providers discussing STI and HPV testing and prevention, yet they should,” she says.\nDr. Nack, too, feels more discussions about HPV need to happen, which will make a diagnosis less stigmatizing. “There are individual and public health benefits from us talking openly about how you can go on to live a healthy and happy life after contracting a sexually transmitted infection, even one that is medically incurable, like HPV,” she says. But sometimes, people with HPV feel shame about their diagnosis — and that prevents them from talking about it. “Sadly, HPV has damaged not only their health, but also their self-esteem and their relationships,” Dr. Nack says. “An infected person has reason to fear that others who find out about their STD will view them negatively. This could make them less likely to tell their current and future sexual partners about their STD status, leading to more infections.”\nAs you can see, even though there is no official HPV test for men, there are several ways both men and women can be more cautious sexually when it comes to HPV — and, in this case, knowledge is definitely power.","url":"https://www.bustle.com/p/why-cant-men-be-tested-for-hpv-the-most-common-sti-is-still-only-tested-for-in-women-10231928"}
