{"authors":[],"date_download":"2018-10-22 21:38:38","date_modify":"2018-10-22 21:38:38","date_publish":"2014-05-07 20:56:18","description":"When the good guys on TV want to find someone,they instantly locate that person via their cellphone signal. In real life, it's not quite so easy.","filename":"data/vaneerConsumption/WhyCalling911OnYourCellisNotAlwaysaGoodIdea.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/427326/140507-911-cellphone-1622_474cc7b320c49b0f6d704997d2b13d00.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_security_why-calling-911-your-cell-not-always-good-idea-n99736_1540244318.html","title":"Why Calling 911 On Your Cell is Not Always a Good Idea","title_page":"Why Calling 911 On Your Cell is Not Always a Good Idea","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nYou feel safe having that cellphone with you. If there's ever an emergency — no matter where you are — you can call 911 for help.\nUnfortunately, that sense of security is partly an illusion.\nYour wireless device has a big limitation: It doesn't give the 911 operator your exact location. So if you can't talk — which is often the case in a medical emergency or a crime in progress — it may be difficult or impossible for emergency responders to find you in time.\n\"It's a public safety hazard that is largely unrecognized,\" said Jamie Barnett, director of the Find Me 911 Coalition. \"People's lives are at risk right now because they cannot count on 911 being able to find them when they call from a cell phone.\"\nOn TV crime dramas, when the good guys want to find someone, they simply go to their computers and instantly locate that person via their cellphone signal. In real life, it's not quite so easy.\nIf you're outdoors, and your phone's GPS chip can connect with satellites above or the phone hits a series of cell towers on the ground, the 911 operator will know your latitude and longitude—within 50 meters or so—most of the time.\nRead More: Data at risk as Americans don't protect smartphones\nBut make that emergency call from inside a building — where it's hard for your phone to \"see\" the satellites and cell signals tend to bounce around a lot — and your location information could be off by 100 meters or more.\n\"We have to do better,\" said Todd Piett, chief product officer with Rave Mobile Safety. \"In most cities, just a few meters can mean the difference between several buildings and that can be the difference between life and death.\"\nAnd then there are those unfortunate situations where the location information turns out to be way off.\n\"We can find out the when, the why and the how once we get there. But we need to know where there is,\" Souder said. On June 16, 2013, Mary Thomas was in an apartment on the upper east side of Manhattan when she had a stroke. She was able to call 911, but her speech was slurred and she couldn't tell the dispatcher where she was. Because she was inside a high rise, the location information provided by the cell tower was way off. It took nearly eight hours to find her. Remarkably, Thomas was still alive when medics arrived and she was rushed to the hospital. Read More: Cell phone thefts soar as advocates hail 'kill switch' This is an extreme example, but far from an isolated case. The Find Me 911 Coalition recently surveyed emergency dispatchers in all 50 states and found that most (82 percent) do not have a great deal of confidence in the location data automatically displayed for wireless calls. More than half (54 percent) said that information is regularly inaccurate. The problem is only going to get worse The Federal Communications Commission (FCC) estimates that more than 70 percent of all calls to 911 centers now come from wireless phones — that's more than 400,000 calls a day. The majority of these calls (64 percent) are made indoors. And these numbers are sure to go up as even more people pull the plug on their land-line phone service at home. The FCC has heard the complaints—and the horror stories—and has acknowledged the potential threat to public safety. In a speech last year, FCC Commissioner Jessica Rosenworcel said that \"if you call 911 from a wireless phone indoors, cross your fingers, because FCC location standards for emergency calls do not apply indoors.\" \"In most cities, just a few meters can mean the difference between several buildings and that can be the difference between life and death.\"","url":"https://www.nbcnews.com/tech/security/why-calling-911-your-cell-not-always-good-idea-n99736"}
