{"authors":[],"date_download":"2018-10-30 14:32:58","date_modify":"2018-10-30 14:32:58","date_publish":"2015-05-19 00:00:00","description":null,"filename":"data/vaneerConsumption/Whydogaysneedahomosexualrodeo.json","image_url":"https://www.americanthinker.com/images/bucket/2015-05/194673.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_05_why_do_gays_need_a_homosexual_rodeo_comments_1540909978.html","title":"Why do gays need a homosexual rodeo?","title_page":"Blog: Why do gays need a homosexual rodeo?","title_rss":"NULL","source_domain":"americanthinker.com","text":"I love rodeos. But because I'm heterosexual, I want to make sure that the rodeo I'm going to is a heterosexual one. How ridiculous does the previous sentence sound? And yet, homosexuals feel the burning need in their loins to have a rodeo that is just for them, just like the homosexual Olympics and homosexual choirs. And the media feels a special need to cover them. I don't think there is a gay way to mount and ride a bull. There is no gay way to do chute dogging, or mutton bashing, is there? Team roping and whip cracking don't have any special significance to gays, do they? So why do gays need their own rodeo? I have two theories. The first is for social reasons. Gays want gay-only events so they can find other people to hook up with. George Takei, \"Mr. Sulu\" from Star Trek, met his partner after he joined a homosexual jogging club. Yes, there are homosexual jogging clubs. (And perhaps... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/05/why_do_gays_need_a_homosexual_rodeo_comments.html"}
ady stream of pro-homosexual propaganda in the schools and the media and the popular culture, but that still isn't enough for the left, so homosexuality must be pushed through every aspect of life, even ones like rodeos that have nothing to do with sexuality at all. I would not be surprised in the future if supermarkets and drug stores start having \"gay aisles\" with phallic products, if office supply stores sell gay pens and paper, and if Apple stores sell gay versions of the iPhone, all in an effort to push that agenda into every aspect of our lives.\nContestants at the International Gay Rodeo in Arkansas, a Bible Belt state with a same-sex marriage ban on its books, competed in events from barrel racing to bull riding on the soft soil of a fairground that looked like just any small-scale rodeo held throughout the United States\nDid it really look like just any other rodeo? You decide. Have a look at the photos below. Keep in mind that these are pictures from the actual article, pictures that are supposed to show the rodeo in a positive light:\nI've always wondered: why do cowboy outfits always have the zippers on the back?\nThis reminds me of those old cigarette commercials with the Marlboro Man! This could be the Marlboro...Person!\nHey, isn't it customary to offer your seat to a lady?\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/05/why_do_gays_need_a_homosexual_rodeo.html"}
