{"authors":[],"date_download":"2018-10-23 01:07:53","date_modify":"2018-10-23 01:07:53","date_publish":"2016-03-30 00:00:00","description":"There are two key words to understand Trump's thinking: \"fairness\" and \"leverage.\" He believes a possible brokered convention and complex delegate allocation rules tilt the process against him.","filename":"data/vaneerConsumption/WhyDonaldTrumpReversedHisPledgeToSupportTheGOPNominee.json","image_url":"https://media.npr.org/assets/img/2016/03/30/gettyimages-518053848_wide-3a65796853203c1c385e6b2f38e92ae1ecfe497f.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=472394248_1540256873.html","title":"Why Donald Trump Reversed His Pledge To Support The GOP Nominee","title_page":"Why Donald Trump Reversed His Pledge To Support The GOP Nominee : NPR","title_rss":"NULL","source_domain":"npr.org","text":"AUDIE CORNISH, HOST:\nDonald Trump had pledged to support the eventual Republican nominee, whoever it is. But last night on CNN, when Trump was asked if he's still honoring that pledge, here's what he said.\n(SOUNDBITE OF ARCHIVED RECORDING)\nDONALD TRUMP: No, I don't anymore. Look.\nANDERSON COOPER: You don't.\nTRUMP: No. We'll see who it is.\nCORNISH: NPR political editor Domenico Montanaro joins us now to help figure out what's going on here.\nDOMENICO MONTANARO, BYLINE: (Laughter).\nCORNISH: Welcome to the studio, Domenico.\nMONTANARO: Good afternoon.\nCORNISH: So Donald Trump actually struggled with this question at the beginning of the campaign but eventually settled on saying that he would support the nominee whoever it was. So take us back. What happened here?\nMONTANARO: So you might remember back to that very first Republican debate, that Fox News debate where they were asked if anyone on the stage would be willing to raise their hand to say that they would not pledge to support the nominee and run Independent. Donald Trump was the only one to raise his hand. He was asked five different ways within the span of a minute and a half whether or not he would change his position, and he said no. He totally understood what he was doing.\nA month later, though, he met with the Republican National Committee Chairman, Reince Priebus, and he did change his mind. He came out. You might remember the - at Trump Tower with - holding up the pledge - 62-word pledge with a big Sharpie of his name signed on it, saying that he's totally pledging (laughter) to support the nominee.\nHe's been asked about it again and again at debates since then - back in December. Earlier this month, even, he's said all along, he's been treated fairly by the party. That seemed to be his one caveat - about whether or not he'd be treated fairly - and again has pledged to support the nominee. Except last night, he decided not to.\nCORNISH: OK, we're a lot further along, though, in the primary season - right? - getting close to the convention.\nMONTANARO: (Laughter).\nCORNISH: What's the motivation for Trump reversing his position now?\nMONTANARO: Well, a couple words for you - fairness and leverage. These are two of the things with Donald Trump. He sees the finish line here, but he also sees a giant hurdle being erected at the end of that line. There's the stop-Trump movement, this never-Trump movement.\nIt's pretty simple for him. He has the most votes, so he believes he should be the nominee. If there are 1,237 delegates to be the nominee - remember; he said that that was a, quote, \"very random number.\" He thinks you should be the - have the most votes. You should be the nominee.\nIt's not a very random number (laughter). It's majority of the delegates to the convention. He thinks those rules are unfair. The other rules earlier this week he tried to sue or threaten to sue in Louisiana because he got the most votes in Louisiana, but then Ted Cruz is probably going to wind up with more delegates in Louisiana. So he thinks these rules have been unfair. Both Kasich and Cruz have started to imply that they'd have a hard time supporting Trump if he's the nominee, so why should he support them, goes his logic.\nThe whole point here, again, about leverage - Trump feels like he has this one big thing that he can hold over the party's head because they think that if he were to run as a third-party nominee in the fall, that that would imperil their candidate.\nCORNISH: OK, crawling out of the weeds of delegate math here...\nMONTANARO: (Laughter).\nCORNISH: Just this afternoon, Donald Trump went out on a limb on another sensitive issue - abortion. What happened?\nMONTANARO: He did. And in an interview, like you said, with MSNBC that's airing tonight, Trump was asked what it would mean to ban abortion and, specifically, if a woman who received an illegal abortion should be punished. And he said there has to be some form of punishment. Now, this has set off a firestorm, as you can imagine, on the right and the left. Of course, on the left, you've got people like Hillary Clinton saying just when you thought it couldn't get worse - Bernie called it shameful.\nBut Ted Cruz and John Kasich too said that you shouldn't punish women. And this is something that - you saw the March for Life even today came out to say that that is not the way that the pro-life movement believes that they should go. Most Republicans who are, quote, unquote, \"pro-life\" or antiabortion rights will say that maybe you should punish abortion providers, but they rarely, if ever, talk about punishing women.\nCORNISH: That's NPR political editor Domenico Montanaro. Thank you so much.\nMONTANARO: Thank you.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=472394248"}
