{"authors":["Emma Madden"],"date_download":"2018-10-31 01:52:39","date_modify":"2018-10-31 01:52:39","date_publish":"2018-09-06 10:41:03","description":"Roxanne Pallett has been dominating headlines for quitting Celebrity Big Brother after making false accusations of assault against Ryan Thomas. Now, despite trying to take a step back, she's about to be thrown back into the spotlight again. You see,…","filename":"data/vaneerConsumption/WhyDidRoxannePallettQuitCelebrityIslandWithBearGryllsSheLeftTheShowAfterJustFiveDays.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/1ab19254-dfa5-4bfe-8bf9-a8091c868505-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_why-did-roxanne-pallett-quit-celebrity-island-with-bear-grylls-she-left-the-show-after-just-five-days-11761652_1540950759.html","title":"Why Did Roxanne Pallett Quit 'Celebrity Island With Bear Grylls'? She Left The Show After Just Five Days","title_page":"Why Did Roxanne Pallett Quit 'Celebrity Island With Bear Grylls'? She Left The Show After Just Five Days","title_rss":"NULL","source_domain":"bustle.com","text":"Roxanne Pallett has been dominating headlines for quitting Celebrity Big Brother after making false accusations of assault against Ryan Thomas. Now, despite trying to take a step back, she's about to be thrown back into the spotlight again. You see, before entering the house, she took part in Celebrity Island with Bear Grylls. However, her stint on that show didn't go to plan as she walked out after five days. But why did Roxanne Pallett quit Celebrity Island with Bear Grylls?\nThe six-part series, which Thomas competed in last year with girlfriend Lucy Mecklenburgh, was filmed earlier this year. Pallett took part along with a string of other celebs including TOWIE's Pete Wicks, Love Island's Montana Brown, and actor Martin Kemp. The show sees the famous contestants work together to survive living on a deserted Pacific island.\nApparently, Pallett quit after she and her fellow castaways built a camp fire to keep warm. A source told The Sun Online that the smoke triggered a memory from her teenage years. They said: \"Roxanne, her grandmother and mum were involved in a house fire in the middle of the night when she was 16.\n\"Roxanne and her family were rescued by emergency services after being trapped in the house for a substantial amount of time. Roxanne suffered smoke inhalation and her mum was hospitalised for months as she lost her sight, this later returned after lengthy medical care.\"\nI have reached out to Pallett's rep for comment, but am yet to hear back. However, it's believed that the actress lasted just five days on the island before telling producers she wanted to leave.\nChannel 4\nThe news comes less than a week after she quit Celebrity Big Brother. She has since given two TV interviews about her decision to leave and the false allegations she made against Thomas.\nDuring her exit chat with Emma Willis, Pallett and apologised for accusing Ryan of assaulting her \"like a boxer would punch a bag\" and branded herself \"the most hated woman in Britain.\" She said: \"It’s the title I feel everyone’s giving me at the moment, and all I can do is own it, accept it, and apologise, and try to take each day now bettering all of those things that I’m realising.\"\nOpening up about why she said what she did, the actress said: \"How it felt when he did it, it hurt. I can’t prove a feeling, no one can. And the more I thought about it, it became heightened, and I convinced myself he meant to do that. And when I watched it back — the first thing I did when I got back was watch that, and immediately I realised.\"\nBig Brother UK on YouTube\nPallett then added: \"I think it’s because I didn’t think he liked me, and the feeling I had afterwards was almost like, I convinced myself that it was done with malice, and it wasn’t, and I know it wasn’t now.\"\nMany people have expressed anger towards Pallett because of the allegations she made, as it was clear that Thomas was being playful when he made physical contact with her. Although Pallett now agrees that he wasn't being aggressive or violent as she initially claimed, and has said that she \"got it wrong\", Women's Aid head of campaigns and public affairs Sian Hawkins previously told Bustle that because she is a former victim of domestic violence, the incident involving Thomas may have brought back \"frightening\" memories. She said: \"It is so important for us to show understanding and empathy for someone who is clearly upset by certain behaviours rather than blaming them for overreacting.\"\nStuart C. Wilson/Getty Images Entertainment/Getty Images\nWhile people have every right to feel however they choose about Pallett, the online abuse really does need to stop. As pointed out by Women's Aid, it is worth bearing in mind that Pallett is a domestic violence survivor and there is a very real possibility that a painful memory was triggered.\nCelebrity Island with Bear Grylls starts this Sunday on Channel 4 at 9 p.m.","url":"https://www.bustle.com/p/why-did-roxanne-pallett-quit-celebrity-island-with-bear-grylls-she-left-the-show-after-just-five-days-11761652"}
