{"authors":["Lindsay Denninger"],"date_download":"2018-10-31 01:42:48","date_modify":"2018-10-31 01:42:48","date_publish":"2018-08-28 00:55:48","description":"Being on Bachelor In Paradise isn't easy to begin with, but, as in the case of wrestler and all-around amazing dude Kenny, it's even more difficult when there's a child at home waiting for you. Kenny was all-in on Bachelor In Paradise — he had a…","filename":"data/vaneerConsumption/WhyDidKennyLeaveBachelorInParadiseHeDecidedToPutHisFamilyFirstAgain.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/986ac2bb-7da3-40dc-a08c-8914dff63985-kenny.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_why-did-kenny-leave-bachelor-in-paradise-he-decided-to-put-his-family-first-again-10258099_1540950168.html","title":"Why Did Kenny Leave 'Bachelor In Paradise'? He Decided To Put His Family First, Again","title_page":"Why Did Kenny Leave 'Bachelor In Paradise'? He Decided To Put His Family First, Again","title_rss":"NULL","source_domain":"bustle.com","text":"Being on Bachelor In Paradise isn't easy to begin with, but, as in the case of wrestler and all-around amazing dude Kenny, it's even more difficult when there's a child at home waiting for you. Kenny was all-in on Bachelor In Paradise — he had a connection with Annaliese, he went out on a few dates, and he was having a good time. Unfortunately, he had to call it quits. Why did Kenny leave Bachelor In Paradise? He wouldn't miss an important milestone for his daughter.\nViewers met Kenny on Rachel Lindsay's season of The Bachelorette, and he was unfortunately embroiled in some pretty ugly stuff with Lee, a guy who published a lot of racist tweets and then sort of apologized for them after the show wrapped. Kenny wouldn't let himself be baited as the \"angry black man,\" and he eventually got sent home on Rachel's two-on-one date. That's why having Kenny on Bachelor In Paradise was such a delight — viewers got a deeper glimpse at the amateur wrestler, the man literally behind a mask (he's not a lucha libre wrestler or anything, but he does play a character, so roll with it). He had great dates with women like Krystal and Annaliese, but ultimately, Kenny had to leave Paradise because of his daughter, McKenzie. She had an important dance recital, and he refused to miss her big day.\nNow, we saw Kenny shed some tears on The Bachelorette, so it wasn't surprising when the man got emotional over the prospect of not seeing his daughter in her special moment. And so, with much chagrin, Kenny opted to leave Mexico and head home. He can go on Paradise again, if ABC will have him. But he can only have so many moments with his daughter. Twitter, of course, had a lot of feelings about Kenny leaving, since he's just such a seemingly nice dude.\nPeople Understood\nKenny is a delight, and he's a great dad. One could argue that he could have just stayed home and not gone on Bachelor In Paradise if he was so worried about his kid, but don't single dads and moms deserve love, too? Kenny could have easily found someone to love and headed home so as not to miss McKenzie's show. But he didn't — at least not this fast — and so he put daughter over the stupid whims of a stupid television show. That's a good dad and a great person right there.\nAnnaliese was pretty broken up about the fact that Kenny was leaving, but perhaps these two can connect in the real world. Is there a rule that all loving must be done on Bachelor In Paradise or not done at all? For now, Kenny was a responsible, loving adult that did what was best for his daughter. She's the one who's going to remember Kenny was there for her recital, and she (and he!) are going to treasure those memories together. Bravo on Kenny, and I hope he finds someone to love soon.","url":"https://www.bustle.com/p/why-did-kenny-leave-bachelor-in-paradise-he-decided-to-put-his-family-first-again-10258099"}
