{"authors":["Linette Lopez"],"date_download":"2018-10-30 23:44:58","date_modify":"2018-10-30 23:44:58","date_publish":"2016-12-05 00:00:00","description":"There's a ton of social science behind why some kind of people forget the things they've said. Hint: It's because they're lying.","filename":"data/vaneerConsumption/WhyDonaldTrumpcantseemtorememberanythinghesaid.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_why-donald-trump-cant-seem-to-remember-anything-he-said-2016-12_1540943098.html","title":"Why Donald Trump can't seem to remember anything he said","title_page":"    Why Donald Trump can't seem to remember anything he said - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Republican presidential candidate Donald Trump speaks on the USS Iowa in San Pedro, Los Angeles, California, United States September 15, 2015. Reuters Last weekend, Gail Collins over at the New York Times wrote a rather playful column about the fact that Donald Trump doesn't seem to remember things very well.\nShe used a great example. While giving a speech in Indiana last week Trump admitted that he'd had a rather massive memory lapse. On the campaign trail he promised to save jobs at a United Technologies owned Carrier gas furnace factory that were set to be shipped to Mexico.\nBut apparently Trump had no recollection that he repeatedly made this promise until he heard about it on TV.\n\"From now on I'm going to try to think of him as a little bit like my dog, Frieda. Frieda is extremely intelligent, but her memory is only good for about 90 seconds,\" Collins wrote.\nA plausible explanation for Trump's apparently short memory is actually quite serious. Social science research tells us the reason some people have blurry memories is that they're engaging in dishonest behavior: like when they're making campaign promises.\nUnethical amnesia\nAccording to research from professors Maryam Kouchaki at Northwestern and Francesca Gino at Harvard, when people lie and cheat, their brain helps them forget that they did it.\nThey call it \"unethical amnesia.\"\nHere's how they described it in a recent research paper [emphasis ours]:\n\"We identify a consistent reduction in the clarity and vividness of people's memory of their past unethical actions, which explains why they behave dishonestly repeatedly over time. Across nine studies using diverse sample populations and more than 2,100 participants, we find that, as compared with people who engaged in ethical behavior and those who engaged in positive or negative actions, people who acted unethically are the least likely to remember the details of their actions.\n\"That is, people experience unethical amnesia: unethical actions tend to be forgotten and, when remembered, memories of unethical behavior become less clear and vivid over time than memories of other types of behaviors. Our findings advance the science of dishonesty, memory, and decision making.\"\nKouchaki and Gino tested this by getting thousands of participants to play a game. One group was told they could cheat, another was told they could not. Time and time again the group that was told they could cheat had more trouble remembering details of the game than those who did not.\nAnd what's more interesting here is that when cheaters were told they had to play the game again without cheating, they were more likely to cheat anyway.\nIn other words, cheating begets more cheating. Liars continue to lie. It becomes a habit, and it's hard to break because it's easy to feel okay about it — it's easy to forget you were out of line in the first place.\nReflection\nThe way to combat this kind of unethical amnesia before bad behavior turns into a habit is to reflect. But we know Trump doesn't like to do that.\nBack in 2014 he sat down for 5 taped hours of interviewing with Pulitzer Prize winning journalist, Michael D'Antonio for a biography called \"The Truth About Trump.\" In October, the New York Times published some of those recordings on its podcast 'The Run Up.'\n\"I don't like talking about the past,\" Trump said on tape, later adding, \"It's all about the present and the future.\"\nThis tendency likely contributes generously to his inability to remember things he's done. When D'Antonio asked him about the meaning of life Trump said, \"I don't like to analyze myself because I might not like what I see.\"\nIt was an incredibly candid admission — one that speaks clearly to Kouchaki and Gino's research. Trump prefers to think of himself as a straight talk kind of guy, not a constant grifter. A lack of reflection helps him to uphold that image in his mind.\nWhat it doesn't help him (or anyone who does this) do is learn from his mistakes. Quite a loss indeed.","url":"https://www.businessinsider.com/why-donald-trump-cant-seem-to-remember-anything-he-said-2016-12"}
