{"authors":["Megan C. Hills"],"date_download":"2018-10-31 01:47:59","date_modify":"2018-10-31 01:47:59","date_publish":"2018-09-11 15:06:36","description":"Another one bites the dust. Although Jack Fincham and Dani Dyer seem to be doing just fine following their Love Island 2018 win, their fellow Islanders aren’t having that much luck unfortunately. For example, Samira Mighty and Frankie Foster called…","filename":"data/vaneerConsumption/WhyDidLoveIslandsLauraPaulBreakupTheReportedReasonForTheirSplitSoundsUnderstandable.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/4656eeaa-dccf-4a92-b2bb-40123469d941-shutterstock_9771002aj.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_why-did-love-islands-laura-paul-breakup-the-reported-reason-for-their-split-sounds-understandable-11867405_1540950479.html","title":"Why Did 'Love Island's Laura & Paul Breakup? The Reported Reason For Their Split Sounds Understandable","title_page":"Why Did 'Love Island's Laura & Paul Breakup? The Reported Reason For Their Split Sounds Understandable","title_rss":"NULL","source_domain":"bustle.com","text":"Another one bites the dust. Although Jack Fincham and Dani Dyer seem to be doing just fine following their Love Island 2018 win, their fellow Islanders aren’t having that much luck unfortunately. For example, Samira Mighty and Frankie Foster called it quits earlier this year and Dr Alex and Alexandra didn’t even make it out of the villa before their romantic hopes were dashed. And now, according to a new report, another couple have parted ways and will be joining the lonely hearts’ club. So why did Love Island's Laura and Paul breakup?\nBustle have reached out to their agent and I’ll update you if I hear anything back (fingers crossed it's good news). In the meantime however, The Sun is reporting that the runners-up have split after their busy work schedules made seeing one another a nightmare.\nAn insider told the paper, \"Laura and Paul have been so busy since the show finished and both had holidays planned without each other — so have ended up spending a lot of time apart. Paul went to New York for modelling work and on to Burning Man while Laura enjoyed some time back in Dubai where she lived before signing up to Love Island.”\nBut what about that public appearance they made last Saturday in Huddersfield, you might ask? They seemed just fine in their Instagram stories as they danced up a storm, right? \"They saw each other on Saturday night but only for a personal appearance and things weren’t the same between them so they have decided to cool off their romance,\" the source revealed. \"Neither of them will be ready to speak about their split in public just yet but they may well do later this week once it has sunk in,\" they finished.\nDevastating, TBH. Laura A. was one of my favourites on the show and I want the world for her. It turns out this might not have completely come out of thin air however, The Sun revealed she and Paul were photographed having a spat outside the Cuckoo Club. The outlet reported that they left in separate cars, which is never a good sign.\nIf their Instagram feeds are anything to go by, both Laura and Paul seem to have cooled off earlier than we thought. The last picture of the pair together on Laura's account (below) was posted at the end of August, while you had to go way back to August 14 for even a glimpse of Laura on Paul's account.\nLaura and Paul starting dating in the last couple of weeks of Love Island, after she was sadly fobbed off by her fellow Islander Wes Nelson in favour of Megan Barton-Hanson.\nWhile she initially was quite cold towards Wes and Megan (and who wouldn’t be honestly), she eventually wound up making up with Megan after saying she “didn’t blame [her]” for what had happened. On the other hand, she flat out rejected Wes’ apology on the show in a moment that went viral. She told Wes, “I don’t forgive you...You can go now.”\nI stan a straight-talking queen. Whether she and Paul have broken up, she’s a gal who deserves the world and here’s hoping somebody worthy steps up to the plate.","url":"https://www.bustle.com/p/why-did-love-islands-laura-paul-breakup-the-reported-reason-for-their-split-sounds-understandable-11867405"}
