{"authors":["Dennis Green"],"date_download":"2018-10-30 20:52:57","date_modify":"2018-10-30 20:52:57","date_publish":"2016-12-25 00:00:00","description":"As cellphones and later smartphones started becoming more common, the watch suddenly seemed old-fashioned. That needs to stop.","filename":"data/vaneerConsumption/Whyeveryguyshouldwearawatch.json","image_url":"https://amp.businessinsider.com/images/569e738ac08a80872f8b999c-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_why-every-guy-should-wear-a-watch-2016-12_1540932777.html","title":"Why every guy should wear a watch","title_page":"    Why every guy should wear a watch - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A quality watch will never go out of style. Shutterstock A lamentable shift has happened in the last few decades: Watches have all but disappeared from men's wrists.\nOnce upon a time, a watch was essential, something men and women alike put on their wrists every morning and took off only at night before bed. It was a necessity, or else you wouldn't know the time of day, and you'd be late for all of your meetings.\nAs cellphones and, later, smartphones started becoming more common, the watch suddenly seemed old-fashioned.\nWho needs a watch when you can just pull out your phone to check the time on a sleek digital display? Millennials probably never even got into the habit of wearing a watch, and for men, that's a shame.\nWomen are offered a myriad of wrist decorations to choose from, but a watch is the only accessory that a man can truly wear every day. You can build a collection, swap them out for different outfits, change straps to suit the occasion, and find one that's perfectly suited to you and your lifestyle.\nIt's your own signature piece — something that you wear so often that people end up identifying it with you. It's an outlet of expression you can use even when weighed down by a suit and tie or otherwise super-picky dress code. An item that you alone chose: a shorthand for your values as a person.\nEven a smartwatch is better than no watch — though, depending on the model, it will send its own unique message. When you don't wear a watch, you're missing out on that opportunity.\nOn days I forget my watch, my outfit feels incomplete, like it's missing something. A watch can really tie it all together like a bow on a gift. Now, I'm no technological skeptic — I love my iPhone, I'm addicted to Spotify, and for me, Snapchat is less a social network than a hobby.\nStill, a watch on the wrist holds tangible benefits for the wearer that go beyond telling the time. In fact, I rarely find myself looking down at my watch to actually find out what time it is. In 2016, it's more a constant reminder of time than a functional time-telling device.\nMore to the point, it reminds you that time is constantly moving and slipping away. Don't procrastinate, don't spend time on things you don't enjoy doing, and remember that time is limited — so you better get living and doing all those things you're planning to do. A smartphone just doesn't call this to mind in such an immediate or tangible way.\nThose hour, minute, and second hands on your watch won't stop until it dies. Neither should you.","url":"https://www.businessinsider.com/why-every-guy-should-wear-a-watch-2016-12"}
