{"authors":["Dennis Green"],"date_download":"2018-10-30 21:29:15","date_modify":"2018-10-30 21:29:15","date_publish":"2016-12-20 00:00:00","description":"It's always worth it.","filename":"data/vaneerConsumption/Whyexpensiveluggageisworthbuying.json","image_url":"https://amp.businessinsider.com/images/58583a36a1a45e95648b5b10-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_why-expensive-luggage-is-worth-buying-2016-12_1540934955.html","title":"Why expensive luggage is worth buying","title_page":"    Why expensive luggage is worth buying - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A sturdy suitcase is an investment in yourself and your travel experience. Shutterstock Traveling can be stressful. For both frequent and occasional travelers, the trick to survival is to minimize the number of things that can go wrong, thereby lessening potential stress along the way.\nAnd there's no better way to lessen travel-related stress than to ensure that your constant rolling companion keeps doing what it's supposed to do throughout your trip. Your suitcase is inarguably the most important thing you have with you when you travel — save your passport, of course.\nI learned this the hard way. I once purchased a bag for no more than $40 from a mid-range department store in the middle of a sale. I thought I got a great deal, even if I had never heard of the brand.\nWhen the bag arrived, it seemed decent. It was stylish and light, with a plastic hard shell, and it had plenty of pockets inside. Perfect for an international trip, I thought. I was pretty proud of myself.\nIt turned out to be junk. Fast forward to my return home, when I had to drag the bag a mile and a half through London streets on my way to catch a train to the airport. And I really do mean drag — somehow, one of the wheels' axles had broken, and I was forced to drag the suitcase in addition to carrying my duffle bag. I was on a tight schedule. This was not ideal. It was stressful. Imagine the situation.\nI also had to drag that bag through the train station, the airport, the airport tram, customs and passport control, and then another airport. The bag went straight back to that mid-range department store, which promptly let me return it, much to my relief.\nFor my next trip, I'll be choosing something a lot more sturdy: maybe a suitcase by Travelpro (the brand flight crews swear by), Briggs and Riley (which comes with a lifetime warranty, including damage caused by airlines), or Rimowa (a luxury brand that's a favorite of celebrities).\nRimowa bags, which start at $400. Darren McCollester/Getty Images for RIMOWA\nIn the past, it seemed prudent to avoid spending a lot of money on luggage, since it was frequently lost, misplaced, or stolen. Now, high-tech luggage trackers can make that less of a worry, and airlines are losing bags a lot less often.\nCheaping out is just not worth it anymore. Not when you're 1,000 miles from home and the only things you have with you are in a flimsy container that is scraping its stuck wheel against historic cobblestone streets. It's hard to take in the sights when you're trying to ensure your belongings are still with you.\nA sturdy suitcase is an investment in yourself and your travel experience. (Which, people tell me, is supposed to be enjoyable.)\nBe kind to yourself — you're worth it.","url":"https://www.businessinsider.com/why-expensive-luggage-is-worth-buying-2016-12"}
