{"authors":[],"date_download":"2018-10-22 20:34:41","date_modify":"2018-10-22 20:34:41","date_publish":"2016-04-25 00:00:00","description":"Mercury is widely regarded as one of the best singers in rock history. Now, a recent study aims to explain why the late Queen frontman's voice was so special.","filename":"data/vaneerConsumption/WhyFreddieMercurysVoiceWasSoGreatAsExplainedByScience.json","image_url":"https://media.npr.org/assets/img/2016/04/25/gettyimages-117619430_wide-99dc063495cc528d4b647dd289cad9b770ddd411.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=475611808_1540240481.html","title":"Why Freddie Mercury's Voice Was So Great, As Explained By Science","title_page":"Why Freddie Mercury's Voice Was So Great, As Explained By Science : NPR","title_rss":"NULL","source_domain":"npr.org","text":"KELLY MCEVERS, HOST:\nYou can hate Queen. You can love Queen. But almost everyone agrees Freddie Mercury had a set of pipes.\n(SOUNDBITE OF SONG, \"BOHEMIAN RHAPSODY\")\nQUEEN: (Singing) Mama, didn't mean to make you cry. If I'm not back again this time tomorrow, carry on, carry on as if nothing really matters.\nMCEVERS: The late frontman for the legendary group died almost 25 years ago, yet he is still regarded as one of the best rock singers ever. What made him so great? Well, a research team in Europe wanted to figure out the science behind his voice. Christian Herbst was part of the team who just released a study on Freddie Mercury, and he joins us now via Skype from Salzburg, Austria. Welcome to the show.\nCHRISTIAN HERBST: Hello. It's a pleasure to be here.\nMCEVERS: So whose idea was this and why did you choose Freddie Mercury?\nHERBST: Well, it was my idea. The Austrian radio asked me to give an interview about Freddie Mercury and tell them some bits about his singing some six years ago. And this kind of developed into a larger project. And the other reason, of course, is Freddie Mercury is a most exquisite singer with a fantastic singing technique. And as a singing teacher and biophysicist that, of course, intrigues me.\nMCEVERS: And so what did you discover? I mean, were there any surprises?\nHERBST: The most important thing, I think, is what we found about his vibrato. Usually, you can sing a straight tune, but, particularly opera singers, they try to modulate the fundamental frequencies. So they make the tone, if you like, a bit more vibrant. Now, typically in opera singers, this vibrato has a frequency of about 5.56 hertz. And Freddie Mercury's is higher, and it's also more irregular. And that kind of creates a very typical vocal fingerprint.\nMCEVERS: We actually have a clip of him singing \"We Are The Champions\" without the full mix, just the isolated voice. Would that be something we could listen to and hear that?\nHERBST: Yeah.\n(SOUNDBITE OF SONG, \"WE ARE THE CHAMPIONS\")\nFREDDIE MERCURY: (Singing) I've paid my dues.\nHERBST: You heard it right there.\n(SOUNDBITE OF SONG, \"WE ARE THE CHAMPIONS\")\nMERCURY: (Singing) Time after time.\nHERBST: And again.\n(SOUNDBITE OF SONG, \"WE ARE THE CHAMPIONS\")\nMERCURY: (Singing) I've done my sentence, but committed no crime.\nHERBST: And again, very pronounced.\n(SOUNDBITE OF SONG, \"WE ARE THE CHAMPIONS\")\nMERCURY: (Singing) And bad mistakes, I've made a few.\nMCEVERS: Oh.\n(SOUNDBITE OF SONG, \"WE ARE THE CHAMPIONS\")\nMERCURY: (Singing) I've had myself...\nMCEVERS: So like on crime...\nHERBST: Yeah.\nMCEVERS: ...And yeah...\n(SOUNDBITE OF SONG, \"WE ARE THE CHAMPIONS\")\nMERCURY: (Singing) But I've come through.\nQUEEN: (Singing) And I need to go on and on and on and on.\nMERCURY: (Singing) We are the champions, my friends.\nMCEVERS: Wow. That just gave me chills. I mean, I'm like - I feel like I'm listening to it in a different way.\nHERBST: Exactly. And once you tuned into that, you cannot get rid of it.\n(SOUNDBITE OF SONG, \"WE ARE THE CHAMPIONS\")\nQUEEN: (Singing) No time for losers because we are the champions of the world.\nMCEVERS: You know, after all this research, did Freddie Mercury know that this was what he was doing?\nHERBST: I don't know. From my experience, most singers - most good singers - do not know what they are doing and how they do it. And I think that's the way it should be actually because for them it destroys the magic.\nMCEVERS: Right.\nHERBST: It's just for science to mop it up and to explain it in a way and for pedagogs actually to - for singing teachers to actually understand how it's done.\nMCEVERS: Christian Herbst, thank you very much.\nHERBST: Thank you.\nMCEVERS: Christian Herbst is an Austrian voice scientist. He's also one of the authors of a recent study analyzing Freddie Mercury's voice. It was published in the journal Logopedics Phoniatrics Vocology. And here's some more Freddie Mercury's vibrato just for you.\n(SOUNDBITE OF SONG, \"SOMEBODY TO LOVE\")\nQUEEN: Somebody to love. Find me somebody to love.\n[POST-BROADCAST CORRECTION: Christian Herbst misspoke, referring to Freddie Mercury's vibrato frequency as higher when he meant to say faster.]\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=475611808"}
