{"authors":[],"date_download":"2018-10-30 20:49:03","date_modify":"2018-10-30 20:49:03","date_publish":"2018-08-22 10:49:00","description":"A Clarkston church's expansion plan has critics warning about noise and traffic, and Muslim immigrants decrying the goal as religious conversion.","filename":"data/vaneerConsumption/WhyfoesprayaGeorgiachurchsexpansionplanfails.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/22/Images/newsEngin.22773925_Clarkston-sign.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_torpy-large-chur_9061303cce8b31aefd6093866679a27a__1540932543.html","title":"Why foes pray a Georgia church's expansion plan fails","title_page":"Why foes pray a Georgia church's expansion plan fails | Torpy","title_rss":"NULL","source_domain":"ajc.com","text":"Naturally, there were soccer fields involved in the development dispute in Clarkston, the old Southern town that has become the civic embodiment of immigration in America.\nA decade ago, the city was made (in)famous by a New York Times article — and a best-selling book — recounting the story of the Fugees, the plucky soccer team consisting of young refugees. The story described the impact of thousands of refugees pouring into this bewildered community and local pushback when the team was not allowed to play on a local field.\nThe new saga involves almost four square blocks near downtown owned by the old Clarkston International Bible Church, a Southern Baptist church that has embraced the city’s new neighbors with evangelical zeal.\nLast year, the church was bought by the North American Mission Board (NAMB), a Southern Baptist arm set up to “impact North America with the Gospel of Jesus Christ through evangelism and church planting.”\nResidents allege a small cadre of city officials, led by Mayor Ted Terry, secretly worked with NAMB to create a $15 million mega-complex that would convert a gym to a worship center and then demolish the old church. A site plan created in the process listed all sorts of goodies, such as a thrift store, missionary housing, a training hub, retail, a gym, a playground, a pavilion, parking lots and four soccer fields.\n“We’re calling this the Church that ate Clarkston,” said Karen Feltz-Eddington, a neighbor and former council person who is a leader of the effort to limit the expansion. “We call this a religious taking.”\nA recent community meeting with a church representative had residents voicing age-old concerns about parking, noise, traffic, home values and overbuilding.\n“It’s like putting a size 16 foot in a size 10 shoe,” resident Susan Hood told me. She’s a former DeKalb County planning employee who has compiled documents concerning the project.\n“They have invested here and want to do good things,” she said. “But because you’re doing good things doesn’t legitimize all you are doing.”\nBut there’s another undercurrent of sentiment in the opposition: At the recent hearing, a couple of Muslim immigrants complained the church wasn’t coming to help them, it was coming to convert them to Christianity.\nAs word came that a local Clarkston church was expanding, Susan Hood (from left), Beverly Burks and Karen Feltz-Eddington started asking questions. (BILL TORPY / AJC)\nTerry, the liberal second-term mayor, 35-year-old hipster, ambitious do-gooder, and recent recipient of grooming aid on the TV show “Queer Eye for the Straight Guy,” said the church services would benefit the city.\nThe mayor said he smells xenophobia, NIMBYism and even “white privilege” in the opposition — and some in the opposition are former city officials.\n“I didn’t see too many young families opposing the plan,” Terry said. “‘Preserve our neighborhood’ is code words for ‘We don’t want those people near us.’”\n“People say the Southern Baptist Convention is bigots, racists, anti-gay. I understand that feeling,” he said. But he called the religious organization handling the effort, a group called Send Relief, “the more charitable, open-minded wing of the Baptist tent.”\nYou know, the reasonable Baptists.\nTerry described how anti-Baptist bias might be fueling the opposition: “There’s a new mosque being built around the corner. It’s interesting that no neighbors were knocking on doors asking that it not be built.”\nHuh? I’m confused. If they were xenophobes, wouldn’t they be screaming about Muslims?\n“There’s a coalition that’s emerged,” he responded. “There’s my Bernie Sanders friends saying, ‘We don’t want them converting refugees.’ And others are saying, ‘We don’t want them in our backyard.’ It’s an odd bedfellows thing here.”\nClarkston Mayor Ted Terry in 2014 at the Georgia Capitol in Atlanta, where he spoke about the benefits refugees bring to Georgia. (David Tulis / AJC Special)\nBeverly Burks, one of those questioning the mayor, smiled and rubbed her brown arm when hearing of Terry’s explanation that old white folks oppose the plan.\n“We’re not an opposition group,” said Burks, a former councilwoman who ran unsuccessfully against Terry last fall. “We’re a community group left out of the process. Until we organized, they didn’t take us seriously.”\nClarkston calls itself “the most ethnically diverse square mile in America.” Nearly 6,000 of its 13,000 residents are foreign-born.\nDavid Melber, president of Send Relief, which is creating service centers across the country, said his group is trying a “holistic approach” to help those in the area, not necessarily just immigrants. As to concerns about proselytizing, Melber said the church recently passed out 2,500 book bags for back-to-school. And no one had to hear about Jesus.\nMelber said the site plan circulating through Clarkston was simply a wish list put to paper. The four soccer fields built on newly purchased property near existing homes won’t happen. The plans, he said, are being changed as the church listens to community pushback and concerns.\nSoccer fields were slated for this wooded property recently purchased by a Clarkston church. Resident pushback has tempered that. (BILL TORPY / AJC)\nIn December, church members asked the city to allow them to convert the gym to a worship center. Buried in those plans was the “wish list.”\nBut city officials kept it quiet, never mentioning demolition permits or any details about the plans, residents say. Terry said he thought the proposal was not necessarily serious, so he didn’t need to go public.\n“I asked (church officials) to have a public hearing before they act,” Terry said. “They admitted they screwed up. They should have done this months ago before they started demolishing things.”\nBurks said Terry was abdicating his mayoral responsibilities. “If this was impacting our city,” she reasoned, “then why is he pushing (responsibility for making info public) back on the church?”\nIt did have a ring of throwing the church guys under the bus, but all’s fair in politics.\nIn June, resident Feltz-Eddington caught wind of the church’s plans and rang the alarm, bringing a roomful of residents to a July council meeting.\nAnnoyed by the public outpouring, Terry texted the woman, chiding her for fomenting an angry mob. And he rescinded his invitation to have her over for a paella dinner.\nIn Clarkston, that’s a real dis.","url":"https://www.ajc.com/news/local/torpy-large-church-expansion-plan-something-devilish-disguise/7vjxOMkv6YHPiQIg8w7nwK/"}
