{"authors":[],"date_download":"2018-10-22 20:37:25","date_modify":"2018-10-22 20:37:25","date_publish":"2014-06-02 14:42:42","description":"Google is planning on launching a fleet of 180 satellites into space, according to the Wall Street Journal.","filename":"data/vaneerConsumption/WhyGoogleMightSpend3BilliononaFleetofSatellites.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/481436/satellitelaunch_49633863471812a4051e259c4d4050fe.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_tech-news_why-google-might-spend-3-billion-fleet-satellites-n120256_1540240645.html","title":"Why Google Might Spend $3 Billion on a Fleet of Satellites","title_page":"Why Google Might Spend $3 Billion on a Fleet of Satellites ","title_rss":"NULL","source_domain":"nbcnews.com","text":"With a network of 180 satellites, Google would have “complete global coverage,” Farrar said, and would likely supplement their coverage in certain areas with its balloons and drones.\nGoogle would not comment directly on the Wall Street Journal report.\n\"Internet connectivity significantly improves people's lives,\" Google said through a spokesperson. \"Yet two thirds of the world have no access at all. It's why we're so focused on new technologies — from Project Loon to Titan Aerospace—that have the potential to bring hundreds of millions more people online in the coming years.”\nSize Matters\nThe more satellites that can be fit on a single rocket, the cheaper it is to send those satellites into space.\nFor Google’s plan to fit its budget, the company will have to figure out how to pack more capacity into a smaller package. O3b Networks, the satellite start-up backed by Google, is currently working with 1,500-pound satellites that can provide broadband Internet connectivity. O3b’s first four satellites were launched last June from French Guiana atop a Russian-built Soyuz rocket.\nGoogle reportedly wants satellites that weigh just 250 pounds — and is said to be hiring engineers from Space Systems/Loral, a satellite-building company, to work on the project. If Google could use satellites that small for telecommunications, it would be a “radical advance” in the field, Farrar said.\nThat means the pressure is on Greg Wyler, head of the Google project and founder of O3b Networks, to find a way to fit more capacity on smaller satellites.\nGoogle is also reportedly hoping to use new flat-panel antennas that can track satellites without moving parts. Those antennas cost hundreds of dollars, compared to the tens of thousands of dollars that previous systems cost.\nA Truly World Wide Web\nWhile a network of 180 satellites would technically cover the entire Earth, the focus would be on providing Internet access to developing countries.\nFacebook has similar goals. It bought its own drone company, Ascenta, in March to help with its Internet.org project, whose stated mission is to make \"Internet access available to the next 5 billion people.\"","url":"https://www.nbcnews.com/tech/tech-news/why-google-might-spend-3-billion-fleet-satellites-n120256"}
