{"authors":["Jocelyn Wiener","Dan Morain","David Gorn","Amita Sharma"],"date_download":"2018-10-30 23:09:47","date_modify":"2018-10-30 23:09:47","date_publish":"2018-08-30 01:34:53","description":"The Legislature's struggle this year to pass even one partial solution to untreated mental illness highlights the complexity that surrounds conservatorship.","filename":"data/vaneerConsumption/WhyisitsohardtogetmentallyillCaliforniansintotreatment.json","image_url":"https://calmatters.org/wp-content/uploads/9499597534_cbda28046a_o-e1535607247369.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940987.html","title":"Why is it so hard to get mentally ill Californians into treatment?","title_page":"Why is it so hard to get mentally ill Californians into treatment? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"For years, Diane Shinstock watched her adult son deteriorate on the streets. Suffering from severe schizophrenia, he slept under stairwells and bushes, screamed at passersby and was arrested for throwing rocks at cars.\nSometimes he refused the housing options he was offered. Sometimes he got kicked out of places for bad behavior. Shinstock, who lives in Roseville and works on disability issues for the state of California, begged mental health officials to place him under conservatorship—essentially, depriving him of his personal liberty because he was so sick that he couldn’t provide for his most basic personal needs of food, clothing and shelter.\nBut county officials told her, she said, that under state law, her son could not be conserved; because he chose to live on the streets, he did not fit the criteria for “gravely disabled.”\n“I was devastated,” she said. “I cried for days.”\nSo Shinstock—along with her husband Joe, a policy consultant who works for Republican leadership in the Assembly—set out to change state law. Their uphill battle illustrates the complex philosophical, legal and ethical questions that surround conservatorship in California.\nWhat responsibility does government have to protect people with serious mental illnesses who refuse treatment? How should it balance the right to liberty with the need for care?\nAt the heart of the long effort to answer these questions is a law signed in 1967 by then-Gov. Ronald Reagan. Aimed at safeguarding the civil rights of one of society’s most vulnerable populations, the Lanterman-Petris-Short Act put an end to the inappropriate and often indefinite institutionalization of people with mental illnesses and developmental disabilities.\nIt also provided them with legal protections, such as the now-familiar rules in California limiting involuntary holds on people deemed a danger to themselves or others to 72 hours, better known as a 5150 hold.\nThose who want to change the law, like Shinstock, believe Lanterman-Petris-Short’s protections too often prevent very sick people from accessing the help they need. Others say people who suffer from mental illness need better care and support from society, not intrusions on their civil liberties. If the state wants to help those with serious mental health issues, they say, it should address the housing crisis and the under-resourced community mental health systems.\nIt’s an argument that has repeatedly stymied bills to force seriously mentally ill people to get care. This year, several were proposed. At the moment, only one—Senate Bill 1045—is left.\nSB 1045 would create a 5-year, opt-in pilot program for San Francisco, Los Angeles and San Diego Counties, making it easier to conserve individuals with serious mental illness and substance abuse disorders who refuse treatment and have been detained frequently by police. Counties would have to prove that they could provide housing and wraparound services before they could participate.\nDiane Shinstock and her husband worked on a second bill with Assemblyman Phillip Chen, a Republican from Brea. That bill, Assembly Bill 2156, would have expanded the definition of “gravely disabled” to include a person’s capacity to make informed decisions about food, clothing, shelter and medical care. (Current laws don’t speak to decision-making capacity, and their criteria don’t include medical care.)\nMeanwhile, The Steinberg Institute, a nonprofit focusing on mental health policy, co-sponsored a third bill. Assembly Bill 1971 didn’t address decision-making, but also would have made it easier to conserve people with mental illnesses who refused medical treatment.\nThe volume of proposals demonstrated the hunger for solutions, said Adriana Ruelas, the institute’s government affairs director. “We have to do something,” she said.\nBut opponents of the various bills say it does no good, and perhaps does harm, to force people into care that is insufficient.\nWithout enough long-term services and housing in place, people who are conserved could easily just end up back on the streets with even worse mental health and substance abuse disorders, said Jennifer Friedenbach, executive director of the Coalition on Homelessness in San Francisco.\n“Instead of correcting the system, it’s expanding the part of the system that works the least,” she said. “If we want increased resources, let’s just fund them. Why are we wasting a bunch of money on a court process when we can just give them the care they need?”\nJen Flory, a policy advocate with the Western Center on Law & Poverty, agrees.\n“We understand it’s a crisis,” she said. But without better services and housing that is accessible to people with criminal backgrounds, making it easier to conserve mentally ill people is just another false promise.\n“Until we solve that problem about where someone will actually live, we are concerned about taking their rights away,” she said.\nSen. Scott Wiener, a San Francisco Democrat and author of SB 1045, argues that rights already are being taken away from people with serious mental illnesses—by the criminal justice system.\n“We do have a very large conservatorship program in California—it’s called jail,” he said.\nWiener said the idea for his bill originated with San Francisco’s Department of Public Health, which would see chronically homeless, severely mentally ill and drug addicted people come in again and again on 72-hour involuntary holds. By the time these holds were up, many individuals would be coherent enough that a judge would let them go. Before long, the same people would be picked up again.\nUnder Wiener’s bill, judges could consider individuals’ histories of involuntary holds when deciding whether to conserve them. To participate, a county would need to prove that it has enough housing and resources to fully support the conserved individuals.\nWiener estimates the bill will impact between 50 and 100 people in San Francisco who are already well-known to the department. “This is not about broadly conserving large numbers of homeless people,” he said.\nBesides the philosophical debate about civil liberties and housing, the various bills were pushed and pulled by the practicalities of lawmaking. Shinstock’s bill redefining “gravely disabled,” for instance, was folded into AB 1971, the similar bill being pushed by The Steinberg Institute.\nBut then AB 1971, which initially would have made conservatorship easier statewide, was scaled back to be just a pilot project in Los Angeles. That created a new legal concern: How could “gravely disabled” be defined differently in Los Angeles County than everywhere else?\nThat and other amendments prompted Shinstock to formally withdraw as a supporter. Then AB 1971 also ran into opposition from the California Hospital Association.\nSheree Lowe, the association’s vice president of behavioral health, said she worried the measure would increase the number of individuals being brought in on involuntary holds, without changing legal requirements that hospitals obtain consent before providing treatment to individuals. Last week, the bill was pulled back by its authors.\nThat left SB 1045, the Wiener proposal to change the process by which mentally ill people can be conserved. It passed the Senate and Assembly and was sent to the governor for a signature or veto this week.\nThe Hospital Association’s Lowe said her association supports SB 1045, since it focuses on individuals who are already frequent users of the system, and because the county Boards of Supervisors would be involved in conservatorships.\nConcerns have been raised, though, about funding for public guardians’ offices. Scarlet Hughes, executive director of the California Association of Public Administrators, Public Guardians and Public Conservators says her group isn’t opposing SB 1045, since it’s a pilot impacting only a few counties. But she doesn’t want “another unfunded mandate” either.\nShe also said she worries that there are not enough community placements for conserved individuals, meaning that increasing numbers of people would be stuck in locked facilities waiting for a spot. In recent years, many board and care homes have closed, she said.\n“This is a 50-year-old problem that has just gotten worse every year,” she said. “Now we’re at a crisis point.”\nWhen her son was a child, Diane Shinstock said, he was a sweet and kind little boy who loved his younger sisters and was good with the family pets. He played Little League baseball, joined the Boy Scouts and loved to make pancakes. If Diane was sick, he was the one who came to check on her.\nBut, early on, he would go into out-of-control rages. He was diagnosed with depression at 8, bipolar disorder at 9. At 10, he was enrolled in a day treatment program. At 21, he was hospitalized with his first psychotic break.\nIn the 12 years since, Shinstock said, she has watched her son, now 33, cycle among hospitals, the streets and jails. For several years he was conserved. The locked facilities and board and care homes where he stayed were often depressing, and sometimes disgusting. She understands why people wouldn’t want to live there.\n“I had a hard time being there for an hour,” she said.\nAfter the county determined that he didn’t need to be conserved anymore, her son ended up homeless in 2013. In 2016, after a series of charges for disturbing the peace and disorderly conduct, he cut off an ankle monitor and landed in jail.\nHe spent the better part of 15 months in solitary confinement, ostensibly for his own protection, and because he was unmedicated, his mental health “deteriorated to an extreme degree,” said Shinstock. By this past January, he was so emaciated that he was unrecognizable, she said.\nOnly then did the county agree to conserve him again. She doesn’t know how long it will last this time.\n“Regardless of what we call it,” she said, “he needs help.”","url":"https://calmatters.org/articles/california-homeless-mental-illness-conservatorship-law/"}
