{"authors":["Sage Young"],"date_download":"2018-10-31 01:38:53","date_modify":"2018-10-31 01:38:53","date_publish":"2018-08-29 16:40:10","description":"British actor Ruth Wilson got her big break portraying the eponymous and introverted governess in a 2006 Jane Eyre miniseries, and over a decade later, she still seeks out inscrutable — and even frustrating — women to play. From Alison in The…","filename":"data/vaneerConsumption/WhyItWasEasierForRuthWilsonToPlayAPsychopathThanHerOwnGrandmother.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/652e71ce-b9f2-4f07-a11a-dd8094ea3b6b-_header-ruth-wilson.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_why-it-was-easier-for-ruth-wilson-to-play-a-psychopath-than-her-own-grandmother-10246055_1540949933.html","title":"Why It Was Easier For Ruth Wilson To Play A Psychopath Than Her Own Grandmother","title_page":"Why It Was Easier For Ruth Wilson To Play A Psychopath Than Her Own Grandmother","title_rss":"NULL","source_domain":"bustle.com","text":"British actor Ruth Wilson got her big break portraying the eponymous and introverted governess in a 2006 Jane Eyre miniseries, and over a decade later, she still seeks out inscrutable — and even frustrating — women to play. From Alison in The Affair, whose choices befuddled Wilson and audiences alike, to Caroline Ayres, the buttoned-up \"spinster\" daughter of a formerly aristocratic family in the new dramatic horror film The Little Stranger, Wilson's chosen roles (and she has many lined up for the next several months) exemplify her eagerness to find what's relatable in the most inaccessible characters. Because as much as you may have screamed at Alison through your TV as she drifted from bad relationship to bad relationship, it was Wilson’s performance that dug into the pain and loss behind those difficult-to-defend decisions.\nPerched on a leather couch with a bag of trail mix at Bustle HQ, Wilson is as approachable as her characters are not. Yet there’s something about her piercing blue eyes and striking smile that’s almost otherworldly, which may account somewhat for why she’s often cast as women who are both powerful and misunderstood.\nLater this year, audiences will see Wilson in perhaps the most challenging and certainly her most personal role yet — that of her own grandmother. Mrs. Wilson, which will air on PBS in the U.S. as part of its Masterpiece series, is a wild but true story based on her grandmother Alison Wilson's memoir, which describes a shocking discovery she made after the death of her husband, the popular author of spy thrillers Alexander Wilson. She learned that Alexander had had three other wives, and children by all of them; oh, and that he had been employed as a British spy.\nBen Ritter/Bustle\nNow in a position to tell her grandparents' story, Wilson embraced the strangeness of digging into the psyche of her grandmother, a constant figure in her life whom she nonetheless describes as \"not a warm woman.\"\nIt wasn’t about making her more lovable. That’s not what I mean by 'protecting,' I actually mean the opposite.\n\"She was always right around the corner from my house, so I saw her a lot, but she was quite hard to get to know,\" Wilson says. \"She held so much back that we didn’t know about.\" Preparing to play her gave the actor new insight into why she was so guarded. Though the series is based on her grandmother's memoir, Wilson and the rest of the creative team ended up piecing together even more about her grandfather's life only after her grandmother's death. Being involved in the production from the beginning is partially why Wilson feels so protective of the project. In addition to executive producing the series, she ultimately concluded that the only way to do right by her grandmother and her story was for her to play her and otherwise be as involved in the project as possible. And Wilson was determined not to gloss over the more imperfect or difficult aspects of the story.\n\"It wasn’t about making her more lovable. That’s not what I mean by 'protecting,' I actually mean the opposite,\" Wilson explains. \"She had some form of complicity in this. Even if she didn’t know it, she was in denial for a lot of her life, and I think that’s really important to show because then you understand what her journey is.\"\nIt's evident that Wilson did not want someone to take this painful part of her family history and twist it by turning her grandmother into a victim. She believes that, on some level, her grandmother allowed her grandfather to deceive her. But that doesn't mean she doesn't have empathy for her. While there were moments on set that were surreal, like when Wilson had to \"give birth\" to her own father (\"F*cking weird, man,\" she says), there were others when the grief and anguish took over and the experience became very real.\n\"I’d be sitting in a scene and ... I’d feel overwhelmed with kind of sadness for [my grandmother] and what she must have gone through,\" the actor recalls. \"It was a really profound experience, because it made me sit in my grandmother’s experience.\"\nBen Ritter/Bustle\nIn The Little Stranger, which is director Lenny Abrahamson's follow-up to the Academy Award-winning Room, Wilson is living in the experience of someone who, though fictional, also exhibits the \"stiff upper lip\" for which the Brits are known. The film, out Aug. 31, is a moody, atmospheric variation on the haunted house narrative — in this case, the house in question is a grand mansion that's fallen into disarray as the family's financial health has deteriorated, causing violent and disturbing events to terrorize both the surviving Ayres and a local village doctor (Domhnall Gleeson) who befriends them. Wilson says the script \"unnerved\" her, and that she appreciated the way in which the story — set after World War II — paints a picture of Britons with status that's much different than the romantic, aspirational depictions that are so popular in other period dramas.\n\"Actually, the world is changing, and [the aristocracy are] failing to keep up with the progress with the other classes,\" Wilson says. \"So for me, that was really fascinating. These are the kind of eccentric British aristocrats that you do get, but they’re not often put on screen. And so it felt a bit like Grey Gardens mixed with The Others.\"\nThat sense of propriety and reserve made Caroline a bit of an enigma to Wilson, which of course is why she wanted to play her. Enigmas are kind of her thing.\n\"She has got so many layers to her, and she can be different things at different times,\" she says. Serving as a nurse during the war gave Caroline \"purpose,\" \"function,\" and \"economic independence,\" Wilson explains, but after the war was over she was thrust back into the \"suffocating\" environment that she'd briefly escaped. Marriage could alter her circumstances, but for most of the film, Caroline keeps her own desires from the audience, and perhaps even from herself. It's up to Wilson's performance to make the audience empathize with Caroline despite the murkiness of her intentions.\nBen Ritter/Bustle Ben Ritter/Bustle\nMuch more blatant in her wanting is Mrs. Coulter, the famous literary villain Wilson will be taking on in the upcoming BBC adaptation of Philip Pullman's acclaimed His Dark Materials book trilogy. She’s the foil to Logan breakout Dafne Keen’s character Lyra, the young ward of a university who discovers the existence of parallel worlds, making her a target of her own reality's patriarchal religious society and their determination to keep that discovery a secret.\nWilson compares Mrs. Coulter to the White Queen in the Chronicles of Narnia, a villainess who pops in and out of the story and whose motivations can be difficult to pin down. So, with the blessing of Pullman, the new adaptation is expanding her character, meaning that even fans of the novels will see the terrifying woman as they never have before. \"She kind of remains enigmatic and distant and you don’t really get to know her [in the books],\" she says. \"So, in this [series], we sit with her a bit more.\"\nThe series also marks Wilson's first time working within the fantasy genre, and one major conceit of the story means that she's been making good friends with her own dedicated puppeteer. In His Dark Materials, people are born with daemons, the physical manifestations of their souls. Mrs. Coulter's takes the form of a rather menacing golden primate, the final version of which will be a combination of puppeteering and CGI. (\"I've loved building a relationship with my monkey,\" Wilson laughs.) It's a fitting symbol for an agent of the church who'll stop at nothing to maintain the status quo, even forcibly separating children from their own daemons — a fate considered worse than death. Why does Mrs. Coulter pursue that mission with such fervor? It seems like the series and Wilson’s performances may come to a different conclusion than the books, though hunger for power and zealotry will certainly still be a factor.\nBen Ritter/Bustle\nWilson, who was raised Catholic but no longer practices, doesn't see the series as an indictment of organized religion, despite its subject matter. (Ahead of the release of the feature film adaptation of the first novel, the Catholic League called the book \"an assault on the Catholic church.\") People are \"really scared of that strand of the book,\" she says, adding that she finds the theme to be universal, not specific.\n\"I understand why people have religion, why they have organized religion, why they need it, why they need the community,\" she says. \"But it’s just another form of government. It’s another form of organizing people and controlling people and it’s abused for that reason. And the abuses that happen in all those kinds of structures are, at the moment, really being opened up and revealed.\"\nTo me that would have been a real, true, feminist ending.\nThe actor doesn't mention the #MeToo movement by name as she talks about how power is used to control people, but feminism and power dynamics are on her mind when we briefly discuss her recent exit from the Showtime series, The Affair, for which Wilson won a Golden Globe, ahead of its fifth and final season. (The Affair spoilers ahead.) Though Alison's death initially looked like a suicide to the audience, it was revealed that she was actually murdered by Ben, her married lover.\n\"She dies at the hands of an angry man, it’s so depressing,\" Wilson says, underlining what little influence she had on the character's end. It was the actor's hope that Alison, who lost a child before the events of the series began, could stop repeating her old mistakes. \"I just felt like she was trying to find a solution through a relationship, and for me, it was like, the woman had to go out alone,\" she explains. \"And to me that would have been a real, true, feminist ending.\" As for why she left the show, Wilson says she's \"not allowed to talk about it.\"\nAs gloomy as that ending was, the coming months will also find Wilson returning to the role that's been the most fun for her: Alice Morgan, Luther's lovably murderous psychopath. The character, presumed dead in the show, is returning in some capacity to Series 5 of the British crime thriller, starring Idris Elba as the titular detective. While she can't divulge the circumstances surrounding Alice's comeback, Wilson does say that getting back into her skin is a \"relief\" from some of her other work.\nShe’s not burdened by the same emotional guilt or flaws that I usually have to play, which are hard.\nBen Ritter/Bustle\n\"She has no conscience in a way. Or she does, but she’s not burdened by the same emotional guilt or flaws that I usually have to play, which are hard,\" Wilson says. \"Where she’s like, 'Pff, whatever.'\" The actor roots for Alice, and understands why audiences do, too. \"She has her sort of little rules and she’s like, 'You step over that, you will die. But that’s your problem!'\"\nAlice and Luther have a cat-and-mouse relationship that turns into a mutually beneficial one over the course of the show. In addition to having a infectious zest for life, the criminal is also fiercely loyal to him. There’s a fair amount of sexual tension, too. According to the actor, picking that dynamic back up was a cinch.\n\"Me and Idris get on,\" Wilson enthuses. \"It’s lovely coming back to an old acting partner ... It develops, it gets further along each time, how we can push each other.\"\nAnd, by the way, if Elba passes on that high-profile franchise he's rumored to be up for, Wilson will gladly take it. \"I’d love to play Bond!\" she says. \"Have a few martinis, a bit of driving really fast. I'd love to do a ski chase.\"\nBut don't hold your breath for Wilson to play someone as uncomplicated as 007. They may not be easy to get to know, but the characters she's tackled so far in her career are absolutely worth the effort.\nHair by Anthony Campbell for Campbell and Campbell Salon at Starworks Artists\nMakeup by Gita Bass at The Wall Group","url":"https://www.bustle.com/p/why-it-was-easier-for-ruth-wilson-to-play-a-psychopath-than-her-own-grandmother-10246055"}
