{"authors":["Nell Greenfieldboyce"],"date_download":"2018-10-22 23:07:42","date_modify":"2018-10-22 23:07:42","date_publish":"2015-10-29 00:00:00","description":"In the past decade, the Gulf of Maine warmed faster than 99.9 percent of the global ocean. The rapid warming explains why recent fishing policies failed to rebuild the cod population, a study finds.","filename":"data/vaneerConsumption/WhyIsItSoHardToSaveGulfOfMaineCodTheyreInHotWater.json","image_url":"https://media.npr.org/assets/img/2015/10/29/pershing2hr_wide-ba892c6fcba5c9863482a88ff49ad37f08d6de6a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thesalt_2015_10_29_451942641_why-is-it-so-hard-to-save-gulf-of-maine-cod-theyre-in-hot-water_1540249662.html","title":"Why Is It So Hard To Save Gulf Of Maine Cod? They're In Hot Water","title_page":"Why Is It So Hard To Save Gulf Of Maine Cod? They're In Hot Water : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Why Is It So Hard To Save Gulf Of Maine Cod? They're In Hot Water\nEnlarge this image toggle caption Gulf of Maine Research Institute Gulf of Maine Research Institute\nCod was once so plentiful in New England that legend had it you could walk across the local waters by stepping on the backs of the fish.\nNow, though, this tasty species is in such trouble there that cod fishing is practically shut down.\nAnd scientists say it looks like rapid warming in the Gulf of Maine explains why regulators' recent efforts to help the cod while allowing fishing were a failure.\n\"Year after year, as they looked at the population, they realized that there were fewer cod than they expected there to be,\" says Andrew Pershing, an oceanographer at the Gulf of Maine Research Institute. \"They thought that they should be rebuilding, but they were actually declining.\"\nAt the same time the cod were mysteriously failing to rebound, he says, strange things were happening on the shores of Maine. People were finding seahorses, which almost never go that far north.\n\"We had squid we don't normally find here,\" recalls Pershing, \"we had species like black sea bass that are normally found around Long Island that were hanging out in the lobster traps here in Maine.\"\nThese oddities were happening because the Gulf of Maine was warming. In the journal Science, Pershing and his colleagues say the warming was also hurting the cod — and managers didn't take it into account when setting their fishing quotas. That means even if people didn't exceed their quotas, too much cod got taken.\n\"In really warm years, every female cod produces fewer babies than we would expect, and we also see that the young fish are less likely to survive and become adults,\" says Pershing.\nEcosystems all around the world are warming up due to global climate change, says Pershing, but the Gulf of Maine is ahead of the curve. Over the past decade, it's warmed faster than 99.9 percent of the global ocean.\n\"That happened so fast that the people that were managing this very important fishery were not able to keep up with the changes,\" he says.\nEnlarge this image toggle caption Gulf of Maine Research Institute Gulf of Maine Research Institute\nWhile fishery managers tend to make decisions based on past experience, he thinks that won't cut it when the environment is changing in truly unusual ways.\nPatrick Sullivan, a fishery management expert at Cornell University, says it's tough to say what lessons managers should take from this experience with cod.\n\"The challenge, of course, is should we have known this, would we have known this? And in that sense it's challenging to say that we actually should have done something different here,\" notes Sullivan.\nHe says it's no easy job to predict how an environment will change — or how the fish will react.\nStill, he was pleased that the researchers who did this study say it looks like cod will be able to persist in the Gulf of Maine, despite the warming trend.\n\"I was actually encouraged that, through appropriate management, if we take into account the environmental change, that these stocks can be rebuilt within a reasonable amount of time,\" says Sullivan.\nBut Pershing says rebuilding will look different in 2020 than it would in 1990.\n\"Even with the lowest warming that we could find out of any of the climate model runs, we still end up with a population that's only about a half of what the population should have had in the 1990s,\" says Pershing. \"We're headed for a Gulf of Maine where there still should be cod, but where there will be fewer cod than there used to be. They will be a much smaller part of this ecosystem than they were 20 years ago.\"","url":"https://www.npr.org/sections/thesalt/2015/10/29/451942641/why-is-it-so-hard-to-save-gulf-of-maine-cod-theyre-in-hot-water"}
