{"authors":["Amy Sciarretto"],"date_download":"2018-10-30 23:50:12","date_modify":"2018-10-30 23:50:12","date_publish":"2014-08-12 23:00:01","description":"I worked in NYC, commuting from New Jersey, for over a decade. Working as a publicist in the music business at a rock 'n' roll record label meant I (luckily) could wear jeans and rock tees to the office whenever I wished. I could dress them up or…","filename":"data/vaneerConsumption/WhyIWorkFromHomeButIStillDressForADayAtTheOffice.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/c620ca0a-63e2-47ef-ac08-7c946086ed71.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35403-why-i-work-from-home-but-i-still-dress-for-a-day-at-the-office_1540943412.html","title":"Why I Work From Home But I Still Dress For A Day At The Office","title_page":"Why I Work From Home But I Still Dress For A Day At The Office","title_rss":"NULL","source_domain":"bustle.com","text":"I worked in NYC, commuting from New Jersey, for over a decade. Working as a publicist in the music business at a rock 'n' roll record label meant I (luckily) could wear jeans and rock tees to the office whenever I wished. I could dress them up or down as I pleased, depending on the day and its events. I, too, could be punk rock at work and not be penalized for it. However, if I was meeting with a key writer or booker, I would take care to fancy it up for the day, throw on a dress, and present myself as pro-yet-edgy, in that order. If I had a post-work meeting for drinks or a show to attend, I could tailor my day's outfit to transition for the night's events.\nFor the past two years, I have worked at home, from my condo in New Jersey, which I previously did little more than sleep in, since commuting, working in NYC, and enjoying the nightlife ate so many hours of my day.\nI launched my own music PR firm, in addition to writing about fashion and beauty, and sometimes I don't leave the house as often as I'd like anymore. BTW, I don't \"freelance\"; I'm an Inc., yo! I get prickly about that term, even though it's not a bad word and I don't believe in freelance shaming. Do it right and it can be lucrative and liberating.\nBut back to the matter at hand. Working from home can present a fashion conundrum. If I'm not going out or have no concrete plans after work hours, why bother getting dressed or putting effort into how I look, right? If only the mailman or the post office clerk or my neighbors who also work from home are the only people to see me, big deal, right?\nWrong!\nDespite the fact that my office is the guest room situated between my bedroom and the living room, I don't roll out of bed and get to it. It's funny since every time I explain to someone that I work from my home office, the typical and repeated response is some variation of \"How awesome! You can work on the couch, in your pajamas all day.\"\nUm, no. No effing way! It's like Mean Girls. You can't sit with us if wear sweatpants to school. Or a disgusting vest, according to Regina George. The point is that I do self-impose rules to keep myself stylishly sharp.\nSince working from home can often blur the lines between work life and non-work life, I remain disciplined and adhere to a routine, following the same beauty and fashion regime as if I were planning to hoof it into the city that day. If I sat around in PJs all day, I would feel like a sloth with no delineation or demarcation between each facet of my life.\nPlus, I have to wash my hair daily or it's a greasy, oily mess. Seriously, it looks like I haven't washed it for a week. I hate that feeling, so I have to shower as soon as I wake up to feel fresh and clean, especially with my mane.\nSo, yeah, I shower by 7AM, put on makeup (usually a smoky eye or a cat eye with pink gloss), feed my dog, get dressed (often in skinny jeans and a peasant top, a simple t-shirt dress, or leggings with a tee that I custom cut from shapeless blobs to create more femme silhouettes), and head into my office to work. It's an insanely short commute, for sure. But even if I have no lunches or meetings planned in the Dirty Jer-Z, I still face the day with my face on.\nI also love pairing items from my closet to create my outfit for the day, something I have loved doing since I was a student in Catholic grade school. When we are allowed to have \"casual days\" and ditch our uniforms, I took great pleasure and care in selecting an outfit for non-uni days. That hasn't waned. I love fashion and tweaking my personal style on a daily basis. I love clothes and getting dressed, no matter the occasion.\nI specifically bought an ergonomic chair and a swanky, glass-topped desk from Room & Board so that my office space would be chic and professional. They were not cheap items, either, so I knew that in addition to having them look pretty, I would force myself to use 'em, instead of plopping on the couch.\nGetting dressed for the day isn't an exertion of any extra effort. Plus, it makes me feel good. I feel a surge of creativity when I create morning makeup looks, so it gets my juices flowing for the workday. It's all psychosomatic, but it works for me.\nI just can't slum it in sweats or I feel useless. Granted, I am probably wearing jeans, but I am still attired for a day of doing stuff and getting shizzy done, not a day of lounging around. To get in a work mindset, I have to dress the part. If you find yourself in a fashion rut because you work from home, too, you can find some inspiration with this style guide!\nI remain beholden to a routine and I don't veer from it. It's a bit rigid, I admit, but it also makes me super productive. I used to think, \"I could never work from home or be my own boss.\" But two years in, I am doing both those things, yet I still act as though I work in the city and for someone else. It keeps me on my game, both mentally and fashionably.\nImages: Giphy (4)","url":"https://www.bustle.com/articles/35403-why-i-work-from-home-but-i-still-dress-for-a-day-at-the-office"}
