{"authors":[],"date_download":"2018-10-30 21:13:17","date_modify":"2018-10-30 21:13:17","date_publish":"2015-10-06 21:57:24","description":"I hired black porn star Jovan Jordan to protect me from feminist bomb threats at a GamerGate meetup.","filename":"data/vaneerConsumption/WhyIHiredABlackPornStarAsABombThreatBodyguard.json","image_url":"https://media.breitbart.com/media/2015/10/CQgXjHRXAAAy42j.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_10_06__1540933997.html","title":"Why I Hired A Black Porn Star As A Bomb Threat Bodyguard","title_page":"Why I Hired A Black Porn Star As A Bomb Threat Bodyguard","title_rss":"NULL","source_domain":"breitbart.com","text":"As Breitbart readers will know by now, video games are serious business. Over the past year, I’ve been the target of not one but two bomb threats, just because I wanted to talk about gaming.\nSo when I was invited to another meetup of gamers in Los Angeles this past weekend, I decided I needed protection. Over 6 feet of protection, specifically, with rippling black muscles and an unfathomably gigantic appendage. Enter Jovan Jordan.\nYes, I hired a black porn star to protect me at a GamerGate meetup. Haters and losers will accuse me of being a vain, exhibitionist homosexual attention-seeker with a fetish for black men, blowing his expense budget on trivial, ego-feeding social media bait. I don’t know where they get their ideas.\nMy modesty is only outstripped by my thriftiness, you see, and my well-known love of updog. I’d never do anything for attention. Hey, are you still looking? Right here darling, on me, thanks.\nFeminist complain about “cyber violence,” but I’ve been the target of actual bomb threats, ones that have been deemed credible by the police – unlike Anita Sarkeesian’s.\nSure, most of the threats come from either edgy teenagers, blue-haired bra-burners or the fans of former Jeopardy! winners, and aren’t serious in the slightest. I mean, feminists can barely tie their own shoelaces. Do you really think they can wire a detonator? Honestly, these guys struggle with Twitter.\nBut that doesn’t mean I’m not scared by them. I’m a delicate soul, after all. Just look at how scared I am in the footage below, taken from the last GamerGate bomb threat in Miami.\nDespite Jovan’s hunky, broody, rippling presence, I was a nervous mess walking into the GamerGate meetup. For some reason, the attendees didn’t notice my distress, and started cheering, laughing, and taking videos. I still can’t get over how anyone can be so insensitive to other people’s feelings. Surely the blind terror on my face was plain for all to see? I was clutching my pearl necklace from the minute I arrived.\nPerhaps it’s because in the footage above I was so terrified I entered a fugue state where I don’t look at all terrified and my hair is amazing. Also, the selfies were purely to help the police identify the body, and for history – the most handsome man ever to be blown up being a record I will one day certainly hold if I keep pissing people off the way I do.\nI hired porn star @JovanJordanXXX as my bomb threat bodyguard for #GGinLA and guess what–no bomb threats! pic.twitter.com/79loaDYbVb — Milo Yiannopoulos (@Nero) October 4, 2015\nNo doubt people are still wondering why I hired a porn star, and not a regular bodyguard. But isn’t it obvious? My most ardent haters are feminists, and their fear of penises is well-known. It was vital, therefore, that I sought the services of a man believed to have the biggest dick in the porn industry.\nThey fear both actual minorities and the patriarchy, and Jovan Jordan was the most magnificent specimen I could find of both – and also quite a badass, and the perfect gentleman.\nIn a topsy-turvy world where tropes are reversed and up is down, where those who claim to support social justice are bullies and liars and where the “misogynist harassers” are actually the loveliest person you could ever hope to meet, is it any wonder that in my distress I would be rescued by… a black knight?\nSome readers may be left undecided that my choice was effective. A hung jury on Jovan! But, I assure you, it stretches the limits of credibility to disbelieve that he was capable of defending me with every inch of his manhood.\nAnd it worked! Jovan and his penis kept the mad feminists away, just as I predicted. See, I knew a member that size would scare off any sex negative-feminist scold, and send them home to read 50 Shades of Grey in the tub with their common-law husband, a terrified shower-head.\nTo sceptics who think this was all some kind of stunt, I say this. Would I really hire a porn star with my bodyguard allowance just because I find online threats to be a joke and it’s a hilarious way to get attention? Does that sound like me at all? Thank you.\nI only hope that other critics of feminism realise the effectiveness of this strategy, and make a point of advertising their large penises ahead of public meetings. No ulterior motive here, I’m just trying to help.\nFollow Milo Yiannopoulos (@Nero) on Twitter and Facebook. He’s a hoot! Android users can download Milo Alert! to be notified about new articles when they are published.","url":"https://www.breitbart.com/the-media/2015/10/06/why-i-hired-a-6-ft-6-black-porn-star-to-protect-me-at-a-video-game-meetup/"}
