{"authors":["Laken Howard"],"date_download":"2018-10-31 01:50:01","date_modify":"2018-10-31 01:50:01","date_publish":"2018-09-11 14:00:54","description":"When you think about what it means to take care of your sexual health, a few images probably come to mind — remembering to take your birth control pill, always insisting on using protection, or going in for a routine STI screening. But as great as…","filename":"data/vaneerConsumption/WhyIsSexualHealthAWomansResponsibilityGenderBiasAffectsSTIPregnancyPreventionToo.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/1e73b22c-bbf2-467e-830d-b541f00ef947-2t4a0018.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_why-is-sexual-health-a-womans-responsibility-gender-bias-affects-sti-pregnancy-prevention-too-10082353_1540950601.html","title":"Why Is Sexual Health A Woman’s Responsibility? Gender Bias Affects STI & Pregnancy Prevention, Too","title_page":"Why Is Sexual Health A Woman’s Responsibility? Gender Bias Affects STI & Pregnancy Prevention, Too","title_rss":"NULL","source_domain":"bustle.com","text":"When you think about what it means to take care of your sexual health, a few images probably come to mind — remembering to take your birth control pill, always insisting on using protection, or going in for a routine STI screening. But as great as all those things are, there’s one serious problem: in relationships between men and women, it's often on women to do them. According to a new Bustle Trends Group survey of 226 women ages 18-34 and of different sexual orientations, 57 percent said they feel more involved in pregnancy and STI prevention than their partner — but a majority (54 percent) expressed a desire for their partner to do more on that front. As one participant put it, \"Birth control (in my experiences) is heavily considered a woman's responsibility. If a woman has had multiple partners, she is often shamed for it.\"\nIt's not uncommon for much of the heavy lifting when it comes to maintaining sexual health to fall on women, whether that’s in the form of having an IUD inserted or thinking ahead and getting the HPV vaccine (which, until very recently, was almost exclusively marketed toward girls). So why is it that women who sleep with men are often the ones who take the reins when it comes to managing matters of sexual health? The most obvious answer is that women who can bear children simply have more at stake — an accidental pregnancy — thus they need to be more proactive and thoughtful about things like birth control and using protection. But that's not the full story.\n\"The fact that so many women bear the responsibility for sexual health is a conundrum,\" Xanet Pailet, sex and intimacy coach, tells Bustle. \"Part of me feels that it’s related to the patriarchal society that we still live in and the fact that at least with respect to birth control, only women can get pregnant. I strongly suspect that if men could experience abortions and childbirth, we’d be having a completely different conversation. I could also argue that it is our primary responsibility to take care of our own bodies so it make[s] sense that women are more concerned about birth control issues than men.\"\nCan Men Be More Involved In Birth Control?\nWhen talking specifically about managing birth control, there's currently not a lot that men alone can do — outside of something drastic and permanent like getting a vasectomy — because of the fact that male contraceptives simply don't exist yet. While we’re getting closer to seeing male birth control on the market, we’re not quite there yet. Part of that can be attributed to gender politics: when the World Health Organization commissioned a trial for a promising form of male birth control, it was stopped when the men participating in the trial complained about all the side effects they were facing... yet women have been living with the side effects of birth control for decades. Then there's the reality that, from a biological standpoint, developing male hormonal contraception is a bit trickier.\n\"The testicles are isolated from the rest of the body, so it's difficult to devise a pill that would cross those barriers and have an effect upon male fertility,\" Dr. Samuel Malloy, medical director at Dr Felix, a registered online pharmacy, tells Bustle. \"Female birth control is much more straightforward. There are several hormones involved in the menstrual cycle, and modulating just one of these can disrupt fertility, without having a huge effect upon the rest of the body. In men, the disruption of one hormone — testosterone — could have a dramatic effect upon the rest of the body, so it is much harder to make a safe and effective male contraceptive pill.\"\nUntil science catches up and gives us as many safe options for hormonal male birth control as women currently have, there’s really only one method of contraception and STI prevention that men have the power to control for themselves: using male condoms. Unfortunately, condoms aren't nearly as effective as other methods of birth control: when used correctly, they're only about 85 percent effective at preventing pregnancy, according to Planned Parenthood.\nThat's not to mention the fact that many men are averse to using condoms because they either find them uncomfortable or allege that it \"doesn't feel the same.\" According to the SKYN Condoms 2018 Millennial Sex Survey of about 4,000 millennials, just over half of men (56 percent) said they use condoms \"always\" or \"most of the time\" — and the scary part is that this figure is actually a 16 percent increase since last year's Millennial Sex Survey.\n\"Going to the doc is seen as not a 'manly' thing to do and I really feel that men have been taken out of the sexual health conversation.\"\nSo what does this mean for women who sleep with men? When a woman is faced with a male partner who doesn't want to use condoms, this yet again places the responsibility of sexual health on her. She can either use an alternative like a female condom, have unprotected sex — something that would be even riskier for her than for her partner due to the risk of pregnancy — or make the decision to safeguard against accidental pregnancy by buying the morning after pill... which then leaves her (not her partner) to deal with the often unpleasant physical side effects.\nHow Gender Bias Impacts STI Prevention\nBut birth control isn't the only area of sexual health where women are taking on more than their fair share: women also tend to take more responsibility for things like STI testing and prevention. Only 39 percent of women surveyed by Bustle Trends Group said they feel their partner is equally involved in STI and pregnancy prevention as they are. Part of that might be explained by the fact that sexually active women are encouraged to get regular Pap smears, which often include an STI panel — whereas most men aren't regularly getting a sexual health check-up. According to data from the CDC from 2015, only around 60 percent of men aged 18-29 had talked to a health care professional about their own health in the last year, compared to over 80 percent of women in the same age group. And according to a study published by the National Institutes of Health (NIH) study of 594 adolescents, 70 percent of women reported receiving an STI test in the past year, versus just 37 percent of men. The majority of these tests occurred during a routine health care visit.\n\"Going to the doc is seen as not a 'manly' thing to do and I really feel that men have been taken out of the sexual health conversation,\" Heather Alberda, AASECT certified sexuality educator, tells Bustle. \"Many clinics and services are geared towards women and servicing men is an after-thought, and that has to change. Expecting men to take ownership of their sexual health should be the norm and developing programs and services that allow them to do that need to be created, and in creating those programs and services we need to as health care providers be seeking out men and their input.\"\nCurrently, the CDC only recommends yearly tests for STIs like chlamydia and gonorrhea for sexually active women and men having sex with men (MSM); getting these same tests is not recommended for straight men. According to Dr. Malloy, though, there are a few reasons for this gender bias in STI testing recommendations. For one, he says, the female anatomy is more susceptible to infection, and women much more commonly experience symptom-less STIs.\n\"Women are more likely to confuse STI symptoms for another common infection, such as a fungal infection,\" Dr. Malloy says. \"As female genitals are largely internal, it can be much harder for women to see their symptoms, including sores. A woman cannot see inside her vagina herself, and she may simply not notice external sores if she cannot see them without a mirror... Men often will get discharge or obvious sores from STIs, but with women discharge can be normal and they may experience no symptoms of STIs at all, especially [gonorrhea] and chlamydia.\"\nBut, while it's certainly important that sexually active women continue to be tested regularly for STIs, that doesn't mean men — especially single men or men with multiple partners — shouldn't also get accustomed to having regular STI screens, not just for the sake of their health, but as a way to help their female partner(s) carry the responsibility of protecting sexual health.\nAs one participant in the Bustle Trends Group survey says, \"Guys are always SO shocked when I ask them to get tested if they've never been. I don't ask for their number [of sexual partners]! I get tested every year but they make me [feel] guilty for asking the same of them.\"\nThere's such a stigma around the idea of getting an STI that it can be scary just to think about getting tested. But even though it might not be ~fun~ to incorporate regular STI screens into your routine, part of being a responsible sexually active adult means being proactive about your sexual health — not simply waiting around for a female partner to get her annual Pap smear and inform you that you'd better get tested, too.\nWhat We Can Do To Share The Responsibility Of Sexual Health\nSo what's the bottom line? In relationships, the responsibility of sexual health should be carried by both partners, whether that means being proactive about STI testing or even just being open to talking about different birth control options, if pregnancy prevention is a concern. In relationships between men and women, if both partners can communicate about matters pertaining to sexual health, hopefully that might help lead to the end of some of the harmful, gendered stigmas that surround the topic of sexual health and sexuality in general.\n\"While people of all genders take a risk when they don't take care of their sexual health, women are unfortunately faced with a higher risk of social stigma.\"\n\"Women are seen as less sexual beings in society, which keeps us from being able to talk about issues without some form of shaming from others,\" one woman in the Bustle Trends Group survey said.\nSo how do we put an end to this sexual stigma? \"While people of all genders take a risk when they don't take care of their sexual health, women are unfortunately faced with a higher risk of social stigma,\" Alicia Sinclair, sexuality educator & CEO of b-Vibe, Le Wand, and The Cowgirl, tells Bustle. \"For example, if both a man and a woman in a ... couple contract an STI, which one is more likely to be shamed, or called ‘dirty?' Part of working towards ending sexual stigma is disrupting these gendered views on what it means to be a sexual being.\"\nOf course, there's one easy way we can all change how society treats (and stigmatizes) sexual health: by getting more comfortable talking about it. The Bustle Trends Group survey found that only 54 percent of women are \"extremely likely\" to discuss STIs with a new partner, and 21 percent wait until they become exclusive with a partner to talk about STIs (which is pretty counterintuitive, since having multiple partners means, if anything, it's more important to discuss these things). It can seem scary or daunting to have these kinds of conversations, but part of being a sexually active adult means being mature enough to have those tough talks — even (or perhaps especially) if you're just getting to know someone romantically or sexually.\n\"People feel uncomfortable talking to partners about sexual health because we aren't taught how to do it,\" Rena McDaniel, certified sex therapist for LifeStyles and SKYN Condoms, tells Bustle. \"The idea of talking to partners about things like birth control, barriers, and STIs feels scary and unsexy. However, much of the awkwardness comes from how awkward the partners feel talking about sexual health rather than the conversation itself. If you come to a conversation about sexual health like it is no big deal and with confidence, much of the awkwardness immediately goes away.\"\nUltimately, just because women have the most at stake — pregnancy or the risk of getting cervical cancer from an untreated STI, for example — doesn't mean it's fair for them to do all the emotional labor that comes with maintaining sexual health. In relationships, it should be on both partners to communicate and make sure they're working as a team to maintain strong sexual health, and individuals not in relationships should be taking the initiative to keep up with their sexual health, regardless of their gender. If more men who sleep with women become proactive about taking care of their sexual health — and if everyone gets more comfortable talking about it — then the future of sexual health will look brighter for *all* of us.","url":"https://www.bustle.com/p/why-is-sexual-health-a-womans-responsibility-gender-bias-affects-sti-pregnancy-prevention-too-10082353"}
