{"authors":["Colin Fernandez","Science Correspondent For The Daily Mail"],"date_download":"2018-10-23 02:49:31","date_modify":"2018-10-23 02:49:31","date_publish":"2016-01-28 18:05:46","description":"The New York researchers say their findings highlight the importance of diet when trying to lose weight - because metabolism changes mean we become less effective at burning calories.","filename":"data/vaneerConsumption/WhyjoggingtoloseweightWONTworkinthelongterm.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30ACC06800000578-0-image-a-11_1454003813371.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3421330_Why-jogging-lose-weight-WON-T-work-long-term-Fat-burning-effect-exercise-reduces-time-bodies-used-strain_1540262971.html","title":"Why jogging to lose weight WON'T work in the long term","title_page":"Why jogging to lose weight WON'T work in the long term | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For many of us wanting to shed the pounds, a gym membership can seem the obvious solution.\nBut in the long term, it may not be as effective as you'd like, scientists warn.\nWhile pounding the treadmill and pumping iron will initially reduce your spare tyre, the effect of exercise reduces over time as your body gets used to the strain.\nChanges in metabolism then mean that work-outs start to become less effective at burning calories as the body becomes more efficient.\nWhile pounding the treadmill and pumping iron will initially help with weight loss, the effect of exercise reduces over time as the body gets used to the strain\nPeople who start rigorous exercise programmes to shed the pounds often report their rate of weight loss declines after a few months.\nTo investigate the phenomenon, researchers at the City University of New York measured the daily energy expenditure and activity levels of more than 300 men and women over a week.\nThey found that above a certain threshold of activity, the extra work people put in had no effect on the number of calories they burned up.\nThis, they say, reinforces the importance of diet when trying to lose weight.\nLead scientist Dr Herman Pontzer said: ‘Exercise is really important for your health. That’s the first thing I mention to anyone asking about the implications of this work for exercise.\n‘There is tons of evidence that exercise is important for keeping our bodies and minds healthy, and this work does nothing to change that message.\nKEY FINDINGS FROM THE STUDY While moderately active people burned about 200 more calories each day than most sedentary people, those who did higher levels of exercise saw no extra benefit. ‘The most physically active people expended the same amount of calories each day as people who were only moderately active,’ Dr Pontzer said. The research suggests there is a ‘sweet spot’ for physical activity. While too little is unhealthy, too much causes the body to make big metabolic adjustments in order to adapt.\n‘What our work adds is that we also need to focus on diet, particularly when it comes to managing our weight and preventing or reversing unhealthy weight gain.’\nSome of the reduction in lost calories in people who exercise is down to adjusting their bodies while resting – there is evidence that people who exercise vigorously fidget less.\nBut a further part of the reduction is thought to be bodily changes.\nThe researchers propose this energy reduction may explain why exercise is good for us as it could reduce the amount of energy the body expends on inflammation and harmful activity such as when one’s own immune system attacks one’s own body.\nDr Pontzer decided to explore the link between activity and energy expenditure after working among the Hadza, a community of traditional hunter-gatherers in northern Tanzania.\nHe said: ‘The Hadza are incredibly active, walking long distances each day and doing a lot of hard physical work as part of their everyday life.\n‘Despite these high activity levels, we found that they had similar daily energy expenditures to people living more sedentary, modernised lifestyles in the United States and Europe. That was a real surprise.’\nWhile moderately active people burned about 200 more calories each day than most sedentary people, those who did higher levels of exercise saw no extra benefit\nThe new research, published in the journal Current Biology, showed a weak but measurable effect of physical activity on daily energy expenditure, but this did not apply to everyone.\nWhile moderately active people burned about 200 more calories each day than most sedentary people, those who did higher levels of exercise saw no extra benefit.\n‘The most physically active people expended the same amount of calories each day as people who were only moderately active,’ Dr Pontzer said.\nThe research suggests there is a ‘sweet spot’ for physical activity. While too little is unhealthy, too much causes the body to make big metabolic adjustments in order to adapt.","url":"https://www.dailymail.co.uk/health/article-3421330/Why-jogging-lose-weight-WON-T-work-long-term-Fat-burning-effect-exercise-reduces-time-bodies-used-strain.html"}
