{"authors":["Keertana Sastry"],"date_download":"2018-10-30 22:38:51","date_modify":"2018-10-30 22:38:51","date_publish":"2014-08-14 21:05:38","description":"A few months have passed now since Season 3 of Scandal ended and all I've done since is wait for Season 4 to begin. And thanks to all of the loose ends left by the show, the wait has been excruciating. One of the biggest surprises of the Scandal…","filename":"data/vaneerConsumption/WhyJakeOliviaTogetherWhenScandalSeason4ReturnsMakesSenseKinda.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/b26e7623-157f-4181-b7a2-ae80dde5bfe9.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35750-why-jake-olivia-together-when-scandal-season-4-returns-makes-sense-kinda_1540939131.html","title":"Why Jake & Olivia Together When 'Scandal' Season 4 Returns Makes Sense... Kinda","title_page":"Why Jake & Olivia Together When 'Scandal' Season 4 Returns Makes Sense... Kinda","title_rss":"NULL","source_domain":"bustle.com","text":"A few months have passed now since Season 3 of Scandal ended and all I've done since is wait for Season 4 to begin. And thanks to all of the loose ends left by the show, the wait has been excruciating. One of the biggest surprises of the Scandal Season 3 finale was Olivia Pope boarding a plane to leave DC with Jake Ballard to \"stand in the sun\" as she believed she was the scandal that needed to fixed in her old life. But this semi-happy ending for Olivia and Jake can't last long, can it? TVGuide spoke to Shonda Rhimes about the ending and where Olivia and the show would pick back up for Season 4, and her answer was a giant tease, as per usual.\nShonda explained that when the show returns, the time and location of Season 4 is \"surprising.\" Now there's already been speculation about where in the world Olivia Pope is, but I'm curious to know if Jake is still by her side. That would truly be \"surprising.\" But I need to know now: Is the couple actually together? Is the presence of Fitz ever looming?\nOlivia made it very clear in the finale that while Jake would be boarding the plane with her, she was still in love with another man —Fitz. It would seem that sound byte would deter Olivia and Jake from getting together in Season 4, but there are a few different ways this could shake out.\n1. Jake And Olivia Are In A Relationship But Olivia Still Thinks Of Fitz\nThis outcome would be heartbreaking to watch when Season 4 begins because we've already seen Jake's devastation the first time around. While Jake loves Olivia dearly and has (for the most part) always tried to protect her and care for her, it doesn't seem like Olivia can return the favor. To see him trying to be in a loving relationship with Olivia and have her continue, only to keep Fitz on her mind the whole time, would be incredibly difficult for Jake.\n2. Jake & Olivia Are Not In A Relationship But Could Be One Day\nHonestly, I would be fine with this scenario. Jake and Olivia needed to \"stand in the sun,\" but that doesn't mean they need to be together to do so. Perhaps saving Jake from the B6-13 life will help him move on while still serving Olivia as a sort of glorified bodyguard. Maybe if Jake isn't begging for a relationship, Olivia will finally see (on her own) that she needs to move on from Fitz and finally accept Jake.\n3. Jake & Olivia Are Not Even Geographically Together Anymore\nIt's possible that Jake just hitched a ride with Olivia and got dropped off somewhere else. Getting on a plane together is not proof that they have stayed together in the period leading up to the time jump. While I don't think Olivia would be okay with leaving Jake to fend for himself, there's a part of me that is intrigued to see where both parties could end up if this scenario occurs. It's flashback time, Shonda!\nImages: Ron Tom/ABC; popeandballard/Tumblr (2), awesomelyluvvie.com (GIF)","url":"https://www.bustle.com/articles/35750-why-jake-olivia-together-when-scandal-season-4-returns-makes-sense-kinda"}
