{"authors":["Abc News","Emily Shapiro","More Matthew","More Emily"],"date_download":"2018-10-30 00:57:38","date_modify":"2018-10-30 00:57:38","date_publish":"2018-10-29 08:23:48","description":"\"I’m trying to make some sense of this.\"","filename":"data/vaneerConsumption/WhyJewishhospitalpresidentcheckedoninjuredsynagogueshootingsuspect.json","image_url":"https://s.abcnews.com/images/US/synagogue-1-gty-er-181028_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/US_jewish-hospital-presiden_757465ee99a01aeff29218c5f524cd4c_story_id=58823836_1540861058.html","title":"Why Jewish hospital president checked on injured synagogue shooting suspect","title_page":"Why Jewish hospital president checked on injured synagogue shooting suspect - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Dr. Jeff Cohen, President of Allegheny General Hospital, lives down the street from Pittsburgh's Tree of Life synagogue, and heard the gunshots and chaos that unfolded when a gunman carried out an anti-Semitic mass shooting inside the house of worship Saturday.\nAfter suspect Robert Bowers was injured in an exchange of gunfire with police, the man accused of gunning down 11 worshippers was taken to Cohen's hospital for treatment.\nCohen, who is Jewish, went to see Bowers in his hospital room, hours after the suspect allegedly shouted to SWAT officers that he wanted \"all Jews to die.\"\nAlexandra Wimley/Pittsburgh Post-Gazette via AP\n\"I stopped to see him, I just asked him how he was doing. Was he in pain, and he said no, he was fine,\" Cohen told ABC News. \"He asked me who I was. I said 'I’m Dr. Cohen, I’m the president of the hospital.' I turned around and left.\"\n\"The FBI agent that was guarding [Bowers] said, 'I don’t know if I could have done that.' I said, 'I’m sure if you were in my shoes, I’m sure you could of,'\" Cohen recalled.\n\"I thought it was important to at least talk to him and meet him,\" Cohen explained. \"You can’t on one hand say we should talk to each other, and then I don’t talk to him. So you lead by example and I’m the leader of the hospital and I have a powerful voice in the community.\"\nAndrew Caballero-Reynolds/AFP/Getty Images\n\"Where did I get the strength? I don’t know. I think some of it comes from the actions of the people around me,\" Cohen said. \"It comes from my mother-in-law, who [is a member of the Tree of Life synagogue and] sat with [the victims who were killed] every day. It came from being part of a community. It came from taking care of people for a long period of time.\"\nBrendan Smialowski /AFP/Getty Images\n\"I’m trying to make some sense of this,\" he said.\nCohen wasn't alone in his actions.\nA Jewish nurse and Jewish doctor cared for Bowers at Allegheny General Hospital, he said.\n\"We have a very simple mission at [Allegheny General Hospital] and I imagine it’s exactly the same at the other hospitals in the area: we’re here to take care sick people. We’re not here to judge you,\" Cohen said. \"We’re not here to ask do you have insurance or do you not have insurance. We’re here to take care of people that need our help.\"","url":"https://abcnews.go.com/US/jewish-hospital-president-checked-injured-synagogue-shooting-suspect/story?id=58823836"}
