{"authors":["Genevieve Van Voorhis"],"date_download":"2018-10-31 00:02:23","date_modify":"2018-10-31 00:02:23","date_publish":"2018-10-28 16:00:30","description":"She may have first sashayed into the hearts of fans playing McKinley High's queen bee, Kitty Wilde, on Glee, but today, fans most likely know Becca Tobin from Ladygang. What started as a podcast about celebrities, pop culture, and feminism, is about…","filename":"data/vaneerConsumption/WhyLadygangHostBeccaTobinShouldBeAVeryFamiliarFace.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/23/68581bf0-2056-43a7-bcab-8310e13fd6aa-getty-160154870.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_why-ladygang-host-becca-tobin-should-be-a-very-familiar-face-12637047_1540944143.html","title":"Why 'Ladygang' Host Becca Tobin Should Be A *Very* Familiar Face","title_page":"Why 'Ladygang' Host Becca Tobin Should Be A *Very* Familiar Face","title_rss":"NULL","source_domain":"bustle.com","text":"She may have first sashayed into the hearts of fans playing McKinley High's queen bee, Kitty Wilde, on Glee, but today, fans most likely know Becca Tobin from Ladygang. What started as a podcast about celebrities, pop culture, and feminism, is about to get its own version of the Hollywood treatment. That's right, Ladygang is being adapted into a TV series, and it premieres on E! Oct. 28.\nTobin will continue to co-host the series along with the other two original Ladygangers, Keltie Knight and Jac Vanek. While all three women are known for being witty and winsome fashionistas, Tobin describes herself as \"an American actress, singer, dancer, blogger and smart ass,\" per the official LadyGang website.\nOriginally from Marietta, Georgia, Tobin attended the American Musical and Dramatic Academy (AMDA) in New York City. She graduated in 2005, and then went on to pursue her career both onstage and in film. Before becoming Kitty Wilde, Tobin appeared in Broadway musical Rock of Ages in 2009, where she played the understudy for the lead role of Sherrie, Broadway World reports. According to her IMDB page, she also had a small part in the series Wiener & Wiener that same year. Following that, she appeared in both Drop Dead Diva and Mystery Girls, and then multiple TV movies. In 2011, she even toured with the Trans-Siberian Orchestra as a vocalist, according to an announcement on the AMDA website. However, Ladygang will be her first foray into unscripted TV.\nPresley Ann/Getty Images Entertainment/Getty Images\nWhen she's not interviewing celebrities about the current state of affairs in Hollywood, Tobin can generally be found posting to her personal style blog, JuneMoss.com. \"June Moss is a place where I get to show my personal style,\" Tobin writes on her \"about\" page. \"The blog is named after my two style icons: My Granny June, the pioneer of 'High Low' (ex. pairing a five dollar necklace with Chanel shoes) and Kate Moss…no explanation necessary.\"\nIn a 2015 interview with Glamour, Tobin revealed why she started JuneMoss in the first place. \"I started it in September 2012 as more of a hobby than anything else,\" she began. \"A really good friend of mine is a talented photographer, and I've always loved fashion and styling my own outfits, so we decided to collaborate. I also wanted my fans to get to see my personal style since I spent so much time in a cheerleading uniform on-screen.\"\nE! Entertainment on YouTube\nIn December 2016, Tobin tied the knot with entrepreneur Zach Martin at a beautiful winter ceremony in Jackson Hole, Wyoming. The wedding featured a tower of donuts and multiple Glee cast members; Jane Lynch even officiated the ceremony! The couple currently lives in Los Angeles, and, per the Ladygang episode from Oct. 9, are \"thinking about thinking about trying [to get pregnant].\" That being said, don't expect to see Tobin pushing a stroller around just yet. With Ladygang hitting the small screen and her own personal brand getting ready to take center stage, she's got a whirlwind few months ahead of her.","url":"https://www.bustle.com/p/why-ladygang-host-becca-tobin-should-be-a-very-familiar-face-12637047"}
