{"authors":[],"date_download":"2018-10-30 19:47:46","date_modify":"2018-10-30 19:47:46","date_publish":"2018-08-14 09:00:00","description":"Morehouse president makes move to improve customer service","filename":"data/vaneerConsumption/WhyMorehousepresidentmovedintofreshmandorm.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/14/Images/newsEngin.22712375_081618-morehouse-prez-HS01.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_morehouse-presid_3ea27aa98177fb54c92cf1ab65341abd__1540928866.html","title":"Why Morehouse president moved into freshman dorm","title_page":"Why Morehouse president moved into freshman dorm","title_rss":"NULL","source_domain":"ajc.com","text":"Two nights in a dorm room is by no means a long stay, but Morehouse President David A. Thomas is hoping it is enough to begin to understand his newest customers — freshmen — and what they need, expect from their experience.\nAnd so there he was last week in Room 116 of Graves Hall, a five-story brick building that once housed all that was and is Morehouse College, getting a glimpse of a day in the life of a Morehouse freshman, surrounded, of course, by Morehouse men.\nThe president will be the first in decades to not be an alum.\nHe’d barely crossed the threshold and dropped his black duffel bag on the twin bed when Marcus Washington, residential adviser, launched into his spiel, a laundry list of do’s and don’t. Do fill out the three forms left on his desk. Do make note of the condition of the room. And do sign the key agreement. And don’t even think about having a visitor before the college’s October homecoming.\nThomas, who assumed office as president in January, won’t be here until homecoming but nods in agreement as a half-dozen reporters and photographers laugh.\nFor him, this move is both serious and symbolic. It is also very personal. You might have read some of that story in this newspaper earlier this year.\nFrom the time he was a little kid, Thomas wanted just two things: to become president of the United States and to go to Morehouse.\nRELATED | Morehouse valedictorian headed to Harvard Law School\nHe was a poor kid from a working-class family in Kansas City, Mo. No one in his family had ever gone to college, but he’d read somewhere that slain civil rights leader Martin Luther King Jr. was a Morehouse grad.\nHe knew, too, that he did not want to be a janitor like his father. He’d done that. Swept floors. Cleaned toilets.\n“You hate this?” his father would say to him, studying his face as he pushed a mop. “If you go to college, you won’t have to.”\nThomas began to take note of other men in the community, at his church who’d gone to Morehouse, his dream school.\nHe was a standout at his high school, a star student with a bright future. When it came time to apply for college, Morehouse was his first choice. Yale was second but only because his counselor insisted he had a backup plan. He and his parents hadn’t even heard of the school before then.\nMorehouse President David A. Thomas wears a neck keychain with his room key after he moved into his room at historic Graves Hall in Morehouse College on Aug. 7. Thomas moved into a dormitory for two days, his way of launching a historic capital campaign to raise money for student scholarships so deserving students will not be shut out of a Morehouse education because they can’t afford tuition. HYOSUB SHIN / HSHIN@AJC.COM (The Atlanta Journal-Constitution)\nIt was a good thing he had a backup plan. Yale offered young Thomas a full ride. Morehouse did not offer him a scholarship.\nHe was disappointed, but when he graduated from Paseo High School in 1974, family finances dictated his college choice. Yale it was.\nEven after he’d moved on, Thomas never forgot the dream, keeping up with Morehouse in newspapers, magazines, word-of-mouth.\nFour years later, he graduated, earning a bachelor’s degree in administrative sciences, and then three master’s degrees: one at Columbia University and two at Yale.\nHe’d eventually earn a Ph.D., too, at his alma mater and then work as an assistant professor at the Wharton School of Business at the University of Pennsylvania before heading to Harvard and then Georgetown University.\nHarvard lured him back once more last year for a dream job as the H. Naylor Fitzhugh Professor of Business Administration, and that’s when Morehouse came calling. The HBCU wanted a new president.\nWas he interested?\nMorehouse President David A. Thomas moved into his room at historic Graves Hall in Morehouse College on Aug. 7 to sample dorm life for two days. Thomas was accepted to Morehouse College as a high school senior, but his working-class family could not afford the price of tuition. He went to Yale on scholarship instead, but he never forgot the disappointment he felt not being able to attend his dream college. HYOSUB SHIN / HSHIN@AJC.COM (The Atlanta Journal-Constitution)\nDecades had passed since he’d fancied himself a president, but this was his chance.\nIn October, Thomas said yes, becoming the 12th president of the all-male college.\nWith both Yale and Columbia degrees, and tenure as a Harvard University professor with more than 20 years in the classroom, you’d think Thomas would’ve made peace with why his route to Morehouse was a circuitous one.\nIn some ways, he has. He’s grateful for having gotten through undergrad without a mountain of loan debt. But all these years later, he can’t help thinking what his life might have been had he made this stop at Morehouse first, and more recently, of the thousands of students who like him have to make the hard decision not to attend their preferred college because they, too, can’t afford tuition.\n“I want there to be no more David Thomases,” he said.\nThat right there is the fuel feeding a historic capital campaign the president plans to launch soon to raise money for student scholarships and hopefully make the school less dependent on tuition for its fiscal health.\n“In today’s environment, you can’t do what colleges did decades ago and keep raising tuition,” he said. “The public is not accepting of it nor are the parents who are making decisions about where to send their children.”\nRELATED | Morehouse’s new president discusses long to-do list\nWith tuition the only source of revenue, Thomas said, it becomes more and more difficult to not just offer scholarships, but to maintain a high-quality faculty and physical plant and secure the college’s future.\n“That really requires us to build an endowment for our scholarships that will get to at least $200 million,” he said.\nPlus, that will increase the college’s credit score and increase student access to Morehouse across the economic spectrum.\nEach week, Gracie Bonds Staples will bring you a perspective on life in the Atlanta area. Life with Gracie runs online Tuesday, Thursday and alternating Fridays. (The Atlanta Journal-Constitution)\nNinety-five percent of Morehouse 2,175 students receive some type of financial aid.\nTuition at the private college is $24,565 ($47,952 including all costs), putting it far beyond many students’ reach.\nBut why a sleepover in the freshman dorm?\nSince his term began on Jan. 1, 2018, Thomas had been asking his staff to put the experience of students first when making decisions and make the effort to provide consistent, reliable customer care. That includes quality food in the dining hall, responding quickly to concerns, and thinking of each other as customers.\n“I wouldn’t call it service so much as care and providing it in a way that lets them know we care about them and respect them,” Thomas said.\nTwo nights at Graves Hall won’t likely cover the extraordinary scope of student life, but you have to appreciate Thomas’ efforts.\nAs president of this iconic place, the esteemed school he once dreamed of attending, he’s excited to be here. But he feels a certain heaviness, when he steps from his home, walks down the hill toward campus, and sees students crisscrossing the school yard.\nHe knows that one of them could be his MLK, the man in the black-and-white photo above his bed.\nThat means he has to get this right. If it means two nights in a freshman dorm, then so be it.\nFind Gracie on Facebook (www.facebook.com/graciestaplesajc/) and Twitter (@GStaples_AJC) or email her at gstaples@ajc.com.","url":"https://www.ajc.com/lifestyles/morehouse-president-wants-tuition-play-smaller-role-who-can/0H2PxW4sq0KZi60ixRoHvK/"}
