{"authors":["Lia Beck"],"date_download":"2018-10-31 01:47:39","date_modify":"2018-10-31 01:47:39","date_publish":"2018-08-27 18:22:49","description":"The Duke and Duchess of Sussex have reportedly taken a major step in their relationship. No, they're not expecting a baby. No, they didn't get to that point in their marriage where you start dressing alike. No, they didn't bring back The Tig as a…","filename":"data/vaneerConsumption/WhyMeghanMarklePrinceHarryAdoptingALabradorRetrieverIsIdealForRoyalLiving.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/ba6766d3-f219-444c-9f3d-28bad9198d1a-getty-1000569650.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_why-meghan-markle-prince-harry-adopting-a-labrador-retriever-is-ideal-for-royal-living-10247038_1540950459.html","title":"Why Meghan Markle & Prince Harry Adopting A Labrador Retriever Is Ideal For Royal Living","title_page":"Why Meghan Markle & Prince Harry Adopting A Labrador Retriever Is Ideal For Royal Living","title_rss":"NULL","source_domain":"bustle.com","text":"The Duke and Duchess of Sussex have reportedly taken a major step in their relationship. No, they're not expecting a baby. No, they didn't get to that point in their marriage where you start dressing alike. No, they didn't bring back The Tig as a couple's blog. According to People, Prince Harry and Meghan Markle adopted a Labrador retriever together. Cute! (The Tig should still come back, though.)\nAccording to People, the couple reportedly adopted the dog at the beginning of summer, and it is \"believed to be a Labrador.\" Since they haven't confirmed the news yet, we unfortunately don't know the dog's name. If this news is true, the new dog would be the second pet in the Sussex household, in addition to a beagle named Guy (who Markle had adopted prior to her marriage into the royal family). She also had a dog named Bogart who didn't make the trip to England seemingly for health reasons, and now lives with friends in the U.S. Markle said during her and Harry's post-engagement interview, \"I have two dogs that I've had for quite a long time — both my rescue pups — and one is now staying with very close friends and my other little guy is, yes, he's in the U.K. He's been here for awhile.\"\nIf Markle and Harry did get a new Labrador, it seems like a good choice of breed for them and their royal lifestyle for a number of reasons. And, according to a source who spoke with Daily Mail, the dog is adjusting nicely. \"The dog is already happily ensconced at their cottage. Like the Sussexes, the dog will divide its time between the palace and their country home in the Cotswolds.\"\nWell, isn't that just fancy-shmancy. Aside from this dog having high-class tastes, here's some more reasons a lab was a fine decision for the newlyweds.\nTheir Temperament\nLabs are outgoing, friendly, and affectionate, according to the American Kennel Club. As a royal couple, they need a dog who is well behaved and not doing anything that could stir up controversy. Can you imagine if it leaked that their dog chewed up a piece of antique furniture or wouldn't stop barking at Princess Charlotte?\nThey Have A History With England\nLabs have roots in Newfoundland, but many of them were taken to England in the 1800s. The AKC site explains, \"The breed began its steady climb to supreme popularity in the early 1800s, when Labs were spotted by English nobles visiting Canada. These sporting earls and lords returned to England with fine specimens of 'Labrador dogs.'\" According to The Kennel Club, \"One of the early patrons of the breed, the Earl of Malmesbury gave the breed its name.\"\nThey Need A Lot Of Exercise\nThe royals own a lot of land, and when they aren't on tour or going to a ton of events, it's probably nice to relax away from the public eye with just a dog and a big field of grass, right? I'm picturing an idyllic English morning featuring misty air, wellies, and a hot cup of tea while playing fetch, but who knows what their dog walks really look like.\nThey're Popular\nLabradors are the most popular dogs in the U.K. and in the U.S. It's just a good look.\nThey Get Along Well With Other Dogs\nThis is important because Guy the beagle has been running the show and he doesn't need anyone stealing his thunder or causing a ruckus.\nIf Markle and Harry did adopt a lab, it sounds like they made a good choice. And also they need to share pics very soon. Maybe on The Tig., Vol. II? I don't know, I'm just throwing ideas out there.","url":"https://www.bustle.com/p/why-meghan-markle-prince-harry-adopting-a-labrador-retriever-is-ideal-for-royal-living-10247038"}
