{"authors":["Angela Chen"],"date_download":"2018-10-31 01:42:11","date_modify":"2018-10-31 01:42:11","date_publish":"2018-08-28 02:25:52","description":"On Monday, the first lady left a leafy legacy on White House grounds. But the reason behind why Melania Trump planted an Eisenhower oak sapling has to do with a particular piece of White House history likely unknown to the public.\nDecked out in a…","filename":"data/vaneerConsumption/WhyMelaniaTrumpPlantedAnEisenhowerOakConnectsBackToAFunPieceOfWhiteHouseHistory.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/78f2544c-f9f2-4d62-8da7-ac0d3992ba42-getty-1024643604.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_why-melania-trump-planted-eisenhower-oak-connects-back-to-a-fun-piece-of-white-house-history-10258496_1540950131.html","title":"Why Melania Trump Planted An Eisenhower Oak Connects Back To A Fun Piece Of White House History","title_page":"Why Melania Trump Planted An Eisenhower Oak Connects Back To A Fun Piece Of White House History","title_rss":"NULL","source_domain":"bustle.com","text":"On Monday, the first lady left a leafy legacy on White House grounds. But the reason behind why Melania Trump planted an Eisenhower oak sapling has to do with a particular piece of White House history likely unknown to the public.\nDecked out in a bright yellow floral skirt and pink stilettos, Trump helped shovel dirt on a sapling that originated from an Eisenhower-era tree. She wasn't the only political figure there though; descendents of past presidents joined her on the southern area of the White House, Voice of America reported via the Associated Press.\n\"I had the honor to contribute to the beautiful & historic at White House grounds today by planting a sapling from the Eisenhower Oak,\" Trump wrote on Twitter. \"Thank you to White House History for organizing the #PresidentialSites and to the previous first family descendants who joined us today.\"\nThe sapling, estimated to be as high as 14 feet, came from an original oak tree originating from Eisenhower's years in office, which ran from 1953 to 1961. According to the AP, that massive oak tree still stands, watching over a garden in the East Wing created by former first lady Jacqueline Kennedy. Trump's sapling takes the place of a tree that was knocked over during a turbulent windstorm earlier this year.\n“We’re honored to make a place here for another historical monument,” the first lady said, according to the AP. “It’s a very special day.”\nWhite House History, the organization that Trump thanked in her tweet, is a non-profit White House Historical Association founded in 1961 dedicated to enhancing the understanding and enjoyment of the Executive Mansion, according to its Twitter bio.\nTrump was flanked by two presidential descendants during the occasion: Mary Jean Eisenhower, a granddaughter of President Dwight D. Eisenhower, and Richard Emory Gatchell, Jr., a fifth-generation grandson of President James Monroe. Gatchell, Jr.'s appearance is timely: 2018 is the 200th anniversary of Monroe's move into a newly-constructed White House after the War of 1812 which saw the British burned it down.\nAccording to the AP, Trump gave her appreciation to the National Park Service for maintaining the White House grounds and keeping it in “beautiful shape and the whole of America in good shape.”\n“It's a beautiful tree that we will plant today,” she said, according to the AP, before the group each picked up golden shovels to scoop dirt into the area around the base of the sapling.\nTrump also wished the White House Historical Association “good luck” with its summit, Voice of America reported. Her two guests are among the many descendants of presidents in Washington, D.C. this week for a summit hosted by the White House Historical Association, according to ABC News. Its members were among the small crowd that gathered for the ceremonial tree planting, which was planned to go hand-in-hand with the White House Historical Association’s Presidential Sites Summit. The meeting, which stretches over four days in Washington, is a gathering of leaders from more than 100 presidential sites nationwide, the AP reported.\nWith the symbolism of past presidential figures there to support her sapling's place on the grounds, Trump's legacy among the greenery of the White House already has some solid roots.","url":"https://www.bustle.com/p/why-melania-trump-planted-eisenhower-oak-connects-back-to-a-fun-piece-of-white-house-history-10258496"}
