{"authors":["Shankar Vedantam","Jennifer Schmidt","Maggie Penman","Renee Klahr","Parth Shah","Rhaina Cohen","Tara Boyle"],"date_download":"2018-10-22 20:02:27","date_modify":"2018-10-22 20:02:27","date_publish":"2018-07-27 00:00:00","description":"Decades ago, a group of women accused a prominent playwright of sexual misconduct. For the most part, the complaints went nowhere. In 2017, more women came forward. This time, people listened.","filename":"data/vaneerConsumption/WhyNow.json","image_url":"https://media.npr.org/assets/img/2018/07/27/img_0230_wide-ae2ebf972aff2e0bd495cbd725954300f7b72b40.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_07_27_633199277_why-now_1540238547.html","title":"Why Now?","title_page":"Why Now? | Hidden Brain  : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Why Now? The Psychological Forces Behind A Cultural Reckoning: Understanding #MeToo\nHide caption In 1989, The Gloucester Daily Times reviewed The Widow's Blind Date, written by Israel Horovitz (center). It's a play that depicts a woman confronting her rapists. Jocelyn Meinhardt (right), who worked on the play at the time, says she was sexually assaulted by Horovitz. Previous Next Gloucester Daily Times\nHide caption Laura Crook is pictured outside her home in Gloucester, Mass., last fall. She was in her 20s when she performed in Israel Horovitz's 1990 production of Strong-Man's Weak Child. Crook is one of six women who accused Horovitz of sexual misconduct in 1993. Previous Next Courtesy of Patrice Howard\nHide caption In the 1990s, Laura Crook performed in the Israel Horovitz plays Strong-Man's Weak Child and North Shore Fish. Crook says Horovitz assaulted her on multiple occasions. Previous Next Courtesy of Laura Crook\nHide caption Poster for Israel Horovitz's production of North Shore Fish, whose cast included actor Laura Crook. Crook was one of the women who anonymously accused Horovitz of sexual misconduct in 1993. Previous Next Courtesy of Laura Crook\nHide caption Jana Mestecky was an assistant and later stage manager for Israel Horovitz in the 1990s. Mestecky says during that time, Horovitz kissed and groped her against her will. Previous Next Courtesy of Jana Mestecky\nHide caption Jana Mestecky (left) poses for a cast photo during production of the play Des rats et des hommes, directed by Israel Horovitz (front, third from left). The photo appeared in the French magazine, L'Avant-Scène, in 1994. Previous Next Courtesy of Jana Mestecky\nHide caption Maia Ermansons met Israel Horovitz (pictured) when she was 11, and thought of him as a mentor and grandfatherly figure. In 2016 — a decade after this picture was taken — she called him out in a Facebook post and accused him of sexually assaulting her when she was 21. During the encounter, she says Horovitz told her, \"Maia, no great woman ever became great by being a good girl.\" Previous Next Courtesy of Maia Ermansons\nHide caption Maia Ermansons accused Israel Horovitz of sexually assaulting her in a Facebook post in 2016. Previous Next via Facebook\nHide caption We reached out to Israel Horovitz via email, phone, and mailed letters. Over email, he declined an interview, but said he finds sexual violence against women to be \"abhorrent and intolerable.\" Previous Next via Hidden Brain 1 of 9 i View slideshow\nNearly a quarter century ago, a group of women accused a prominent playwright of sexual misconduct. A Boston newspaper published allegations of sexual harassment, unwanted touching and forced kissing. For the most part, the complaints went nowhere.\nIn 2017, more women came forward with accusations. This time, people listened.\nOn this episode of Hidden Brain, we explore the story through the lens of social science and ask, \"Why Now?\"\nWhat has changed in our minds and in our culture so that allegations of sexual harassment and assault are being taken so much more seriously than they were in prior decades?\nA note for listeners: This story includes descriptions of sexual harassment and assault. It may not be suitable for all listeners.\nFurther reading:\nPrivate Truths, Public Lies by Timur Kuran\n\"Norm Perception as a Vehicle for Social Change\" by Margaret E. Tankard and Betsy Levy Paluck\n\"Has Trump's Presidency Triggered the Movement Against Sexual Harassment?\" by Ashwini Tambe\nHidden Brain is hosted by Shankar Vedantam and produced by Jennifer Schmidt, Rhaina Cohen, Parth Shah, Laura Kwerel, and Adhiti Bandlamudi. Our supervising producer is Tara Boyle. You can also follow us on Twitter @hiddenbrain, and listen for Hidden Brain stories each week on your local public radio station.","url":"https://www.npr.org/2018/07/27/633199277/why-now"}
