{"authors":[],"date_download":"2018-10-30 18:07:11","date_modify":"2018-10-30 18:07:11","date_publish":"2016-01-09 18:39:00","description":"The use of hazard lights while driving is legal in Georgia, but one police department strongly discourages using them.","filename":"data/vaneerConsumption/Whypolicesaydontusehazardlightswhiledriving.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/WHIO/2016/08/31/Videos/3753698.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_why-you-should-n_aa72dfded7e30f0ae090174eab986da6__1540922831.html","title":"Why police say don't use hazard lights while driving","title_page":"Atlanta weather: Why police say don't use hazard lights while driving","title_rss":"NULL","source_domain":"ajc.com","text":"A metro Atlanta police department is advising drivers to not use hazard lights while driving, even in the rain or snow.\nIn Georgia, the use of hazard lights is permitted while driving statewide.\n» Atlanta weather: Forecast, news and updates\nBut some jurisdictions have put out calls urging drivers to not use their hazard lights while driving.\nTraffic Law Tuesday Do you use your Hazard Lights in the rain? Using your hazard lights while driving is illegal in... Posted by Johns Creek Police Department on Tuesday, January 5, 2016\nJohns Creek police warned on Facebook that using hazard lights may actually signal to other drivers that you are stopped or stalled on the road. Hazard lights can reduce the ability to see if the vehicles ahead are braking and confuse other drivers.\nHazard lights also \"turn off your ability to use your turn signals,\" the police department wrote in its 2016 post.\nInstead of using hazard lights while driving, consider not driving at all until road conditions improve, the police department advises.\n\"If you cannot see, pull over to a safe place and wait (until) driving conditions are better,\" the department wrote. \"Your flashers should only be used while your vehicle is stopped or disabled on the roadway or shoulder. This is a sign for emergency services that someone is in need of assistance.\"","url":"https://www.ajc.com/news/local/why-you-should-never-use-your-hazard-lights-while-driving/C1RAPrN7n1DrgAGJqUNuiJ/"}
