{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-23 05:52:13","date_modify":"2018-10-23 05:52:13","date_publish":"2017-03-16 16:31:06","description":"Exhibition curator Eleri Lynn believes the late Princess consciously ditched New Romantic ruffles and puffy sleeves because she thought they looked unflattering in press photographs.","filename":"data/vaneerConsumption/WhyPrincessDianaditchedpuffysleeves.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E556EAD00000578-0-image-a-41_1489680718141.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4320552_Why-Princess-Diana-ditched-puffy-sleeves_1540273933.html","title":"Why Princess Diana ditched puffy sleeves","title_page":"Why Princess Diana ditched puffy sleeves | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was the era of perms, power suits and polka dots, so it's no wonder some of the biggest trends to emerge from the 1980s look flattering with hindsight.\nAnd it has now been revealed why one of the decade's biggest fashion figureheads, Princess Diana, eventually turned her back on puffy sleeves and oversized ruffles in favour of a more slimline silhouette.\nEleri Lynn, the curator behind a new exhibition on the late Princess of Wales' wardrobe, believes the royal ultimately came to realise that they made her look bad in photographs.\nScroll down for video\nStyle evolution: Curator Eleri Lynn believes Diana ditched puffy sleeves ( 1983, left) for a more slimline silhouette (1987, right) after realising they weren't flattering in photographs\nExplaining why Diana, who was killed in a car crash in 1997, moved away from the New Romantic look, Ms Lynn said: 'I think she realised the frills and the ruffles that she was so partial to didn't work particularly well in press photographs.\n'It gave a cluttered overall appearance and we know that she did read her own reviews. So around that time you see a real change in her silhouette as it becomes much more sophisticated, much more sleek.'\nShe added that the more subtle embellishments Diana later embraced 'popped' when the camera flash turned on them.\nMs Lynn was discussing some of her most memorable ensembles on BBC's Woman's Hour on Thursday with fashion historian Amber Butchart.\nRipping up the rulebook: The pair also discussed Diana's headline-grabbing 'tuxedo dress' by Belleville Sasson, worn to a performance of the Marriage of Figaro in 1989\nDiana pictured in 1982, left and 1997, right, eventually ditched the New Romantic look for more form-fitted outfits and subtle embellishments that 'popped' under the camera flash\nThe duo also looked at Diana's so-called 'tuxedo dress' by Belleville Sasson, worn to a performance of the Marriage of Figaro in 1989.\nMs Lynn praised the 'theatricality' in the princess's wardrobe and said: 'When she had learned the unwritten rules of royal dressing, she started to break them.\n'The Royal family traditionally wear black only in mourning but Diana particularly liked wearing back. It suited her very much, she was 5ft 10in and blonde and looked great in these colours.'\nThe late Princess's fashion sense has been described as 'subversive', with curator Elleri Lynn pointing out that traditionally the Royal family only wore black during mourning\nShe added: '[Diana] was the first female member of the Royal family to be pictured wearing trousers for example for evening events, which she often wore with jackets and ties - which is quite a bold look even today. And I think not something which is typically expected of a princess.'\nAmber agreed that it was an 'interesting choice' for a princess, saying: 'Historically, tuxedo wearing was seen as slightly subversive for women. This goes back to Hollywood in the 1930s, Marlene Dietrich wearing a tuxedo smouldering on screen in films like Morocco.\n'There is a slight frisson to this mixture of masculine styling for womenswear, and so it does make it a very unusual and bold choice for a princess.'","url":"https://www.dailymail.co.uk/femail/article-4320552/Why-Princess-Diana-ditched-puffy-sleeves.html"}
