{"authors":[],"date_download":"2018-10-30 01:25:33","date_modify":"2018-10-30 01:25:33","date_publish":"2015-07-31 08:00:00","description":null,"filename":"data/vaneerConsumption/WhyProficiencyTestingMattersinEducation.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/07/Mokapu_Elementary_moves_ahead_of_the_power_curve_150422-M-NV020-001-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862733.html","title":"Why Proficiency Testing Matters in Education","title_page":"Why Proficiency Testing Matters in EducationThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Recent controversies over Common Core standards have intensified the debate over high-stakes K-12 academic testing that became a national issue with President Bush’s No Child Left Behind Act.\nHolding schools accountable for children’s academic performance is simple common sense. A child who struggles to read in fourth grade is four times more likely to drop out of school; if he cannot comprehend his textbooks he cannot learn science, civics, and history. The student falls further and further behind.\nLikewise, a student without an understanding of numbers in the early grades will not be prepared for algebra in later grades. Success in algebra is a key indicator of success in post-secondary education.\nEach state determines proficiency standards for reading and math, and each state measures whether students are meeting them on annual tests. This means that, including the District of Columbia, we have 51 different markers for proficiency. The question then becomes whether each state is setting the bar high enough. In other words, when a student achieves a proficient score on a state test, is he in fact really proficient in the subject? Or was the test too easy or the passing score set too low in order to inflate results?\nThe answer can be found by comparing results on state tests with results from the National Assessment of Educational Progress (NAEP). NAEP is widely recognized as the gold standard for measuring academic progress in the states. Every two years, a representative sample of students from each state is administered the same high-quality assessments in reading and math, and all are graded by the same objective standard. NAEP sets the bar for proficiency at in-depth, working knowledge of the subject.\nThe comparisons show most states are setting their proficiency requirements lower than NAEP. Eighty-eight percent of Ohio fourth graders, for example, were deemed proficient in reading on the 2012-13 state tests. But only 37 percent of the state’s fourth graders achieved proficiency on NAEP in 2013. That “proficiency gap” of 51 percentage points suggests Ohio is setting the bar too low.\nSuch proficiency gaps are widespread. In 2013, there were 20 states with more than a 40 percentage point gap between the number of fourth graders designated as proficient readers on state tests versus the NAEP results. Thirty-five states have proficiency gaps of 20 percentage points or more in eighth grade math.\nA few states do expect more of their students, such as New York, which actually sets the proficiency bar higher than NAEP.\nJudging only by state results, you might think Georgia’s students are far ahead of their counterparts in New York. In Georgia, 97 percent of eighth graders and 93 percent of fourth graders earned proficiency scores on the state reading tests, whereas only 34 percent of eighth graders and 30 percent of fourth graders in New York earned proficiency on their state reading tests.\nOn the NAEP, however, the New York students actually are slightly ahead of their Georgia counterparts. This is why some consider NAEP to be a truth serum.\nSetting low proficiency expectations inflates the perception of students’ academic success, which in turn conveys a false impression to parents and taxpayers. The federal Elementary and Secondary Education Act gave states incentives to lower standards in order to avoid sanctions. Ultimately, this practice is dishonest, deceiving both parents and taxpayers.\nExpecting more of students is a difficult but necessary direction for all states. It is easier for political leaders and education bureaucracies to trumpet success than to explain failure. But when success is claimed but not achieved, children ultimately will pay the price. They can find themselves in college remediation courses, unable to pass the Armed Forces Qualification Test, or ill-prepared for a career.\nWhen three-fourths of the nation’s high school graduates do not test college-ready in English, reading, math, and science on the ACT, educators obviously are not being truthful with them when they hand them a high school diploma and tell them they are ready for the next step in life. And when taxpayers have invested more than $100,000 in that diploma, they have been shortchanged as well.\nThe 21st century global economy demands knowledge and skills. Failing to prepare our children for it imperils the nation’s well-being. Proficiency matters. We should demand nothing less of our schools.","url":"https://spectator.org/63635_why-proficiency-testing-matters-education-2/"}
