{"authors":[],"date_download":"2018-10-22 22:17:36","date_modify":"2018-10-22 22:17:36","date_publish":"2014-06-09 16:37:56","description":"Days before the World Cup kicks off, sponsors say corruption allegations about the 2022 tournament in Qatar are damaging soccer's reputation.","filename":"data/vaneerConsumption/WhyQatarCorruptionProbeCouldEclipseSoccerWorldCupinBrazil.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/496916/140609-world-cup-brazil-soccer-1245p_235cc99528365acc3007e20938ca41b7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_world-cup_why-qatar-corruption-probe-could-eclipse-soccer-world-cup-brazil-n126376_1540246656.html","title":"Why Qatar Corruption Probe Could Eclipse Soccer World Cup in Brazil","title_page":"Why Qatar Corruption Probe Could Eclipse Soccer World Cup in Brazil","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDays before soccer's World Cup kicks off in Brazil, commercial sponsors including Coca-Cola, Adidas, Visa and Sony have warned that corruption allegations engulfing the 2022 tournament in Qatar are damaging the reputation of the game.\nThe sport’s governing body FIFA was on the defensive Monday after Britain’s Sunday Times newspaper published for a second week what it says are leaked documents showing bribes were paid to secure the event for Qatar, which the Gulf emirate denies.\nFIFA was already investigating the circumstances surrounding Qatar’s bid, controversial ever since it was announced four years ago.\nA tiny country with no domestic soccer tradition, Qatar experiences extreme heat in the summer weeks when the tournament is held. That means the 2022 World Cup could be temporarily switched to a winter date, creating scheduling headaches for European soccer clubs and broadcasters.\n“We seemed to have reached a tipping point where the big commercial sponsors have to make a public comment,” said Simon Chadwick, professor of sport business strategy at Britain’s Coventry University. “This matter seems to be becoming so serious that silence is not an option.”\nThe deepening crisis could not have come at a worse time for FIFA, which is making last-minute preparations in Sao Paulo for Thursday’s opening game between the host nation and Croatia.\nOn Sunday, four of FIFA's top-tier sponsors — among six who will pay a collective $700 million over four years toward this World Cup — spoke out about persistent corruption allegations.\n\"The negative tenor of the public debate around FIFA at the moment is neither good for football nor for FIFA and its partners,\" said Adidas, the World Cup ball provider since 1970.\nVisa called on FIFA to \"maintain strong ethical standards and operate with transparency.\"\n\"Anything that detracts from the mission and ideals of the FIFA World Cup is a concern to us,\" Coca-Cola said in a statement, \"but we are confident that FIFA is taking these allegations very seriously and is investigating them thoroughly.\"","url":"https://www.nbcnews.com/storyline/world-cup/why-qatar-corruption-probe-could-eclipse-soccer-world-cup-brazil-n126376"}
