{"authors":["Quoctrung Bui"],"date_download":"2018-10-23 05:25:35","date_modify":"2018-10-23 05:25:35","date_publish":"2014-08-21 00:00:00","description":"Restaurants and hotels are posting new job openings faster than they can fill them. This is a promising sign for the economy.","filename":"data/vaneerConsumption/WhyRestaurantAndHotelWorkersMaySoonGetARaise.json","image_url":"https://media.npr.org/assets/img/2014/08/21/3885114485_e886e998d1_z_wide-fac284086c9a1a518cd9724a79fcac6dca7fe304.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_money_2014_08_21_341631776_why-restaurant-and-hotel-workers-may-soon-get-a-raise_1540272335.html","title":"Why Restaurant And Hotel Workers May Soon Get A Raise","title_page":"Why Restaurant And Hotel Workers May Soon Get A Raise : Planet Money : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Why Restaurant And Hotel Workers May Soon Get A Raise\nRestaurants and hotels are posting new job openings faster than they can fill them. This is a promising sign for the economy.\nMany jobs in the hospitality industry have low pay but don't require specialized skills. So they often serve as a stopgap for people between jobs. In periods when the broader job market is bleak, jobs in this sector tend to get snapped up quickly.\nThe growing number of unfilled restaurant and hotel jobs implies that many potential workers are finding other jobs or looking at these postings and saying, \"Meh, maybe I can do better.\"\nAfter adjusting for inflation, wages in the sector are lower today than they were four years ago. But that could change. If those job postings go unfilled for long enough, employers may offer higher salaries to lure more or better applicants.\nIt's worth noting that this territory hasn't yet been rigorously explored by economists because this particular data set only goes back to 2000, which isn't long enough to fully understand the relationships between job postings, hirings and wages.\nThis data set was brought to our attention by a blog post Dean Baker wrote a few days ago.","url":"https://www.npr.org/sections/money/2014/08/21/341631776/why-restaurant-and-hotel-workers-may-soon-get-a-raise"}
