{"authors":[],"date_download":"2018-10-22 21:03:36","date_modify":"2018-10-22 21:03:36","date_publish":"2014-05-05 20:49:01","description":"Florida and Arizona have the weather, but when it comes to quality of life, South Dakota tops a new list of Best States for Retirement.","filename":"data/vaneerConsumption/WhySouthDakotaistheNewFloridaforRetirees.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/421716/140505-south-dakota-retire-mms-1658_b275a31c8bd642a9cca8ffd428d115db.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_retirement_why-south-dakota-new-florida-retirees-n97576_1540242216.html","title":"Why South Dakota is the New Florida for Retirees","title_page":"Why South Dakota is the New Florida for Retirees","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFlorida and Arizona definitely have the weather going for them, but when it comes to quality of life, South Dakota tops the new list of Best States for Retirement from Bankrate.com.\nThe state has a lot going for it: a low cost of living, low crime rate, low tax burden, quality health care, and the people who live there are happy with their communities.\nThe rest of the top five best states to retire are: Colorado, Utah, North Dakota and Wyoming. Arizona (16) and Florida (39) didn't even make the top 10.\n\"While the states that ranked highly may not be thought of as typical retiree havens, seniors should consider more than sunshine when choosing a place for their golden years,\" said Bankrate.com research and statistics analyst Chris Kahn in a statement.\nBoth Dakotas made it into Bankrate's top 10 for the second year in a row.\nThe five states that rated the lowest based on the Bankrate.com analysis are Hawaii, Arkansas, Alaska, West Virginia and New York (which came in at number 50).\nOf course, no one decides where to retire based on a survey of a few data points, such as weather or taxes. In many cases, the move is made to be near family. But if you are considering places to relocate when you retire, you might want to compare how various states rate on some of these factors.\nYou can find the complete survey results at: Best places to retire.","url":"https://www.nbcnews.com/business/retirement/why-south-dakota-new-florida-retirees-n97576"}
