{"authors":["Felicia Mello","Amita Sharma","Guest Commentary","Dan Morain"],"date_download":"2018-10-30 22:44:17","date_modify":"2018-10-30 22:44:17","date_publish":"2018-08-23 01:54:46","description":"The idea of a Cal State campus has captured the imagination of the Central Valley city of Stockton. But it's an open question whether California lawmakers and the California State University system will enable that.","filename":"data/vaneerConsumption/WhyStocktonbelievesaCalStatecouldsealitscomeback.json","image_url":"https://calmatters.org/wp-content/uploads/CALMATTERS_EDISON_HIGH-e1534989135386.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939457.html","title":"Why Stockton believes a Cal State could seal its comeback","title_page":"Why Stockton believes a Cal State could seal its comeback | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"When Jesus Andrade looks out over the barren asphalt of the San Joaquin County fairgrounds, he doesn’t just see the smattering of swap meet vendors setting up their stalls, or the smoke rising from a nearby homeless encampment. The Stockton city councilman also envisions football fields and science labs, part of a future California State University campus that he hopes would bring his city some economic opportunity.\nIt’s a long shot. Yet the idea of luring a 24th Cal State campus has captured the imagination of many in this Central Valley community of 300,000, trickling down from city leaders to discussions in grocery stores and high school English classes.\nOnce known mainly as a bankruptcy-stricken foreclosure capital with high crime rates, Stockton today is drawing national attention for its millennial mayor, Michael Tubbs, and his experiments with universal basic income and avant-garde violence-prevention policies. Crime is down somewhat, though the city still ranks among the most dangerous in the country. Artist lofts are sprouting downtown and Amazon is scheduled to open a 1,000-employee distribution center this year.\nLocal elected officials see a potential Cal State campus as the climax of Stockton’s redemption story—a chance to boost local businesses and create a college-going culture among the city’s youth.\n“All of the investment that is happening around universities is skipping us, and we’re one of the largest metros in the state,” says Andrade. “It’s just a huge oversight.”\nWhether decision-makers in California’s Capitol agree is an open question. While the CSU turned away more than 30,000 qualified applicants last school year because campuses were oversubscribed, a recent report by the state’s Legislative Analyst’s Office said if existing space were efficiently used, no new campuses would be needed.\nDemocrat Gavin Newsom, the frontrunner in this year’s governor’s race, endorsed the idea of a CSU Stockton on the campaign trail. Lawmakers will decide this month on a bill by Stockton Assemblywoman Susan Eggman that would place a $7 billion bond measure for the CSU and University of California systems on the 2020 ballot—$4 billion to shore up aging buildings and another $3 billion for new campuses.\nEggman calls Stockton an “educational desert”; with Lodi, it forms the largest metropolitan area in California without a public four-year university. That’s a challenge for the many Stockton students who come from close-knit immigrant and low-income families and want to stay home to save money or help with household responsibilities. Local options are slim, including San Joaquin Delta College—a community college—and University of the Pacific, a $48,000-a-year private college that feels worlds apart from the rest of Stockton, with its verdant lawns and Tudor-style buildings.\nA CSU Stockton could provide another choice for young Stocktonians like Derek Okazaki, who graduated from south Stockton’s Edison High School in 2012 with his mind set on a four-year college. The senior class president earned admission to University of the Pacific, but a large scholarship he was banking on didn’t come through, and he decided to attend Delta instead.\n“Financially, it was the best situation to put myself in,” he said. Six years later, he’s still working on transferring to a four-year school.\nSome students who do leave town for school describe barely making it over what seemed to them impossible hurdles. Eila Madrigal, 17, almost didn’t submit her application to UC Davis after her father was deported to Mexico last fall. A mentor from a community organization convinced the Franklin High School graduate to send it in; now she’s heading there this year as a first-generation student, which is both thrilling and “scary.”\n“I’m not sure what exactly I’m getting myself into,” she said, “especially since no one at my house knows what I’m supposed to be doing.”\nSuch doubts derail the college plans of many Stockton Unified School District students, said Barbara Greenwood, the lead guidance counselor at Edison. The high school’s campus is undergoing a multimillion-dollar renovation, with new buildings named after destination schools such as Davis and Berkeley. University fight songs play in the hallways during passing periods.\nA new $20 million scholarship fund, paid for with philanthropic dollars, will offer all graduates of the district $1,000 per year to attend a four-year college starting with the class of 2019. But only 18 percent of Edison students currently choose to do so, compared with about 45 percent of high-school graduates nationwide.\nGreenwood believes that’s partly because of the difficulties students face commuting to nearby CSU campuses like Sacramento and Stanislaus. Most don’t drive, whether because they don’t own a car, couldn’t pay for driver’s training, or are undocumented. Living on campus poses still more challenges.\n“Financial aid doesn’t kick in until they get there,” said Greenwood. “In the meantime, they need sheets and towels and computers and access to a printer. Parents look at that and say, ‘We just don’t have it. You can stay here.’ ”\nThe challenges at Edison reflect Stockton’s stubborn north-south divide. A freeway sliced through town in the 1970s, cutting south Stockton off from the city’s port and downtown. While the city sprawled northward, the downtown languished. Working-class residents on the south side found seasonal and informal employment.\nWarehouses and shipping centers have sprung up close to the nearby airport since the recession, but Andrade, whose district is in south Stockton, says a survey by his office found only 14 percent of his constituents are employed there. A university campus in his district—at the fairgrounds site, for instance—could bring maintenance, janitorial and food service jobs, he imagines, and more traffic to businesses like Orlando’s Market, one of only a few places to buy groceries near the housing projects where he grew up.\nSome in the city have different ideas. Stockton’s draft general plan shows an education and enterprise zone about eight miles north of the city center, with space for a single large employer surrounded by homes and retail. It sits on land owned by the Spanos development company, a major backer of the drive for a new CSU.\nA campus near downtown “would completely change the economic future of this city,” said Paula Sheil, a former newspaper reporter who teaches English at Delta. “Whereas on the north side, it will continue the status quo.”\nSheil runs a writing and book publishing center downtown, in a former bank building with soaring ceilings and murals on the walls. It’s part of a halting but noticeable renaissance in a city center still riddled with boarded-up storefronts and sawed off parking meters. Native Stocktonians who left to start their careers are returning, mingling with newcomers priced out of the Bay Area. New businesses include a streetwear shop, custom furniture studio and brewery.\nA CSU campus could hasten that reversal of the city’s brain drain, said Tubbs, the mayor. “We need to build Stockton as a community that you don’t have to flee from. You can stay right here, get educated, and give back.”\nBut will it happen? California’s public universities struggle to maintain the campuses they already have. CSU has shown little enthusiasm for developing new ones, and is backing alternate legislation that would ask voters only for $4 billion to repair and expand existing facilities, split evenly between the system and the University of California.\n“Earning a degree from a CSU campus has provided life-changing opportunities for nearly four million people,” CSU spokesperson Toni Molle said in a statement when asked about a Stockton campus. “So it is completely understandable that legislators would seek to provide the people of Stockton additional opportunities to earn a high-quality public education.”\nCSU Stanislaus operates a satellite campus in Stockton that enrolls just under 900 students.\nIn the past, students would often have to complete their degrees at the university’s Turlock campus. But a new partnership with Delta will allow transfer students to finish BAs in three majors—liberal studies, psychology and business administration—without having to leave Stockton.\nFaimous Harrison, the center’s dean, says he’s working with employers to develop new programs in high-demand fields such as computer science and health care management. Expanding the Stockton satellite offerings could help convey the community demand, paving the way for a standalone university, he said.\nStill, questions abound: Would students from surrounding communities want to come study in Stockton? Will one of the other, wealthier cities lobbying for a new campus, including Chula Vista and Concord, get there first?\n“We’ve always been the stepchildren of Sacramento,” said Doug Wilhoit, a fifth-generation Stocktonian who heads the city’s Chamber of Commerce. A CSU campus would help provide local businesses with an educated workforce, a longstanding challenge, but he doesn’t think he’ll see it in his lifetime.\nAfter the University of California built its newest campus in Merced, the city saw the largest personal income growth of any region in the country between 2012 and 2016, according to Governing magazine. The housing market has a one percent vacancy rate, said Mayor Mike Murphy, and historic buildings in the city’s downtown are being rehabbed into a boutique hotel and student housing.\n“Universities are among the most recession-proof businesses to have in your community, and the jobs tend to be higher income,” said Patrick Adler, a research associate at the Martin Prosperity Institute in Toronto who studies the relationship between universities and local economies.\nUniversities can also disrupt local communities by creating gentrification, said Adler. But, he added, those effects are likely to be muted with a university like the CSU, which attracts working-class students and hires faculty at modest salaries. Success in a place like Stockton would depend on “building the kinds of soft institutions that you need so that the knowledge generated in university can be absorbed by the local community, and the resources in the community can be absorbed by the university.”\nOn a recent afternoon at the Stockton Schools Initiative, a local non-profit, a group of Edison students gathered around a table to brainstorm what a CSU campus in Stockton might look like. Junior Edwin Lynn started sketching on a whiteboard, and an outline took shape: Classrooms for engineering and photography classes. A wellness center. Statues of Martin Luther King, Jr., Malcolm X and Colin Kaepernick. A museum of San Joaquin Delta history.\n“There should be a beautiful setting where people in town can come take their prom pictures,” said senior Rogelio Rivera, a budding photographer. “We don’t have any tourism like that in Stockton.”\nNot all the high schoolers said they planned to attend college. But as they added their ideas to the sketch, their excitement mounted.\n“Being able to be with your family and get the education you want,” said Lynn, “that’s something serious.”\nThis story and other higher education coverage are supported by the College Futures Foundation.","url":"https://calmatters.org/articles/how-a-cal-state-campus-would-help-stockton-comeback/"}
