{"authors":["Emma Mcgowan"],"date_download":"2018-10-31 01:50:02","date_modify":"2018-10-31 01:50:02","date_publish":"2018-09-11 14:00:53","description":"Have you ever said someone has a “clean bill of health” or that they’re “clean,” when you mean to say they don’t have an STI? Probably, right? They’re pretty common terms, and people often use the word \"clean\" to describe someone’s STI status. The…","filename":"data/vaneerConsumption/WhySayingSomeoneHasACleanBillOfHealthIsSoDangerous.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/5/4e183443-c821-4bfc-8a8e-c323ba36eebe-zaeh_bustle_oct2015-268.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_why-saying-someone-has-a-clean-bill-of-health-is-so-dangerous-10047944_1540950602.html","title":"Why Saying Someone Has A “Clean Bill Of Health” Is So Dangerous","title_page":"Why Saying Someone Has A “Clean Bill Of Health” Is So Dangerous","title_rss":"NULL","source_domain":"bustle.com","text":"Have you ever said someone has a “clean bill of health” or that they’re “clean,” when you mean to say they don’t have an STI? Probably, right? They’re pretty common terms, and people often use the word \"clean\" to describe someone’s STI status. The problem with that, however, is that it perpetuates the idea that someone who has an STI is “dirty,” while someone who doesn’t is “clean.” As a sex educator, I see this as a big problem. Let me explain.\nFirst, we have to talk about what STI stigma is and what it looks like. STI stigma is the prejudice against people who have or have had an STI. It’s perpetuated by the idea that sex — particularly sex outside of marriage or with multiple partners — is dirty and morally wrong. Under that belief system, a person who has sex outside certain specifications is morally wrong, and therefore any illness they pick up from sex is a moral failing.\nBut if you don’t believe that sex outside of marriage, sex with multiple partners, or sex between people of the same gender is morally wrong, then insisting that STIs are a moral failing just doesn’t make sense. And a lot of people who do believe that there’s nothing wrong with those kinds of sex find themselves judging themselves or others when they hear about an STI diagnosis.\n“Stigma around STIs isn't just perpetuated by a lack of education, but also by a lack of consideration in the language we use when talking about them,” Laureen HD, a YouTube content creator who takes the shame out of living with an STI, tells Bustle. “For example, saying ‘I'm clean’ to mean ‘I'm STI-free’ wrongfully implies that people with STIs are dirty, or that STIs have anything to do with someone's personal hygiene.”\nUsing the clean/dirty dichotomy when discussing STI status can also be extremely isolating for those who have received a diagnosis. In a recent Bustle Trends Group survey of 226 millennial women ages 18 to 34, one participant said that addressing STIs as \"dirty\" takes away from the fact that they're so common. \"[The biggest stigma around women's sexual health is] that we’re dirty if we’ve had something and that we’re the 'only' one,\" she tells Bustle. \"[...] We need to support each other, not put each other down.\"\nAnd saying someone is “clean” isn’t the only common phrase that perpetuates STI stigma. Kae Burdo, a sex educator and advisory council member of The Effing Foundation for Sex-Positivity, says that they can’t stand it when people say things like “glitter is the herpes of the craft world.”\n“I have HSV-1 and have several partners and loved ones with HSV-2,” Burdo says. “... [H]erpes is no big f*cking deal. And it's a sh*tty joke that I often hear made in sex-positive communities (queer, burlesque, etc.) which makes it even more hurtful.”\nAshley Batz/Bustle\nUsing stigmatizing language — even unintentionally — and judging people for having or having had an STI perpetuates sex negativity. If you recognize yourself as someone who passes judgment about an STI diagnosis (and let’s be real: most of us have), take a minute to think about where that judgment comes from. Do you really believe that a person with an STI is dirty? Do you believe that their sexual choices were wrong? Why? Are those really your beliefs, or are they beliefs you picked up somewhere else?\nThe reality is, human beings give each other germs. Sometimes we give them to each other with our mouths. Sometimes we give them to each other with our hands. And, sometimes, we give them to each other with our genitals. If you don’t think that accidentally passing on the flu or a stomach bug is a moral failing, then why would you think that accidentally passing on chlamydia or HPV is?\n\"It's hard to admit to having had an STI, there's so many gross assumptions about promiscuity and uncleanliness.\"\nAnd while STI stigma sucks because it truly hurts people, it’s also dangerous because it keeps people from talking about their status, getting tested, and telling partners when they have something.\n\"It's hard to admit to having had an STI, there's so many gross assumptions about promiscuity and uncleanliness,\" one Bustle Trends Group survey participant says.\nEven the seemingly harmless jokes can prevent someone from disclosing. “Herpes is especially picked on by culture,” Laureen HD says. \"And even though jokes like, ‘what happens in Vegas stays in Vegas, except for herpes. That sh*t will come back with you,’ are coined by movies, using them in conversations perpetuates the idea that STIs are to be made fun of. The issue with that is that it discourages people with STIs to feel confident disclosing their status to potential partners and get their consent before being intimate with them.”\nAshley Batz/Bustle\nBecause while most STI infections have little to no visible symptoms, some do. Some — including chlamydia, gonorrhea, and syphilis — can lead to infertility in people with uteruses, if not treated. Others — like HIV — can result in death. So while an STI that’s caught quickly can be dealt with and have minimal long-term health effects, an STI that isn’t caught and isn’t treated can have really serious consequences.\n“Ultimately, language empowers disclosure,” Laureen HD says. “Disclosure empowers consent. And consent is everything for healthy and fulfilling relationships.”\nSo, let's start talking — but let's also make sure we're doing so in a way that feels empowering, not stigmatizing.","url":"https://www.bustle.com/p/why-saying-someone-has-a-clean-bill-of-health-is-so-dangerous-10047944"}
