{"authors":["Jennifer Brett"],"date_download":"2018-10-30 17:51:35","date_modify":"2018-10-30 17:51:35","date_publish":"2016-05-24 06:57:22","description":"Tyler Perry just sold his 17-acre spread along the Chattahoochee River, a formidable estate with&nbs...","filename":"data/vaneerConsumption/WhyTylerPerrysoldhis175millionAtlantaestate.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/02/02/Images/WPIMAGE_cmgajcbuzz_8534.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_why-tyler-perry-sold-his-million-atlanta-estate__1540921895.html","title":"Why Tyler Perry sold his $17.5 million Atlanta estate","title_page":"Why Tyler Perry sold his $17.5 million Atlanta estate","title_rss":"NULL","source_domain":"ajc.com","text":"Tyler Perry just sold his 17-acre spread along the Chattahoochee River, a formidable estate with gym, spa, home theater, underground ballroom with catering kitchen, formal and informal gardens, lighted tennis court, guard house and caretakers’ suite. Why? He wanted more land. MORE - Take a video tour of Tyler Perry's former home\nGetty Images\nTyler Perry shares his personal story in moving Tuskegee University speech\nTyler Perry posts terrifying photo from movie set\nWatch Tyler Perry get into character\nInstagram hottie Brock O’Hurn stars in Tyler Perry’s next movie\n\"I wanted more land so I bought more land outside of the city,\" he told E! News on a promotional tour for \"Teenage Mutant Ninja Turtles: Out of the Shadows,\" which will be released June 2. \"It's the same distance to the studio as my old house, but now I can have horses and pigs and organic vegetables.\"\nHe's reportedly building on about 1,000 acres in Douglas County, a far cry from his humble start in Atlanta.\n“I had just moved to Atlanta to try to launch this play, so I went to work,” he said during his Tuskegee University commencement address. “I managed to save $12,000 and I put the show up working in used car, as a bill collector (proceeds from a tax return). I thought 1,200 people would show up that weekend but only 30 showed up. My car payment, rent, everything was tied up in it so I ended up homeless with no money and nothing to my name.”\nHe wasn’t dissuaded.\n“From 1992, to 93, to 94, I was doing one show a year,” he said. “I kept on doing the play. Every year it would fail, until 1998, the seventh year of me trying. I was about to give up and walk away.”\nHis mother suggested he try to get a job at the phone company, with steady pay and good benefits. Then he started hearing from audience members who shared how his words moved them.\n“My life shifted after that,” he said. “My intention became, how do I serve other people? How do I lift other people?","url":"https://www.ajc.com/blog/buzz/why-tyler-perry-sold-his-million-atlanta-estate/a1kryRc4w6dhbn8wJMNS7K/"}
