{"authors":[],"date_download":"2018-10-30 14:33:08","date_modify":"2018-10-30 14:33:08","date_publish":"2015-05-27 00:00:00","description":null,"filename":"data/vaneerConsumption/WhytheFrenchbanonveilsisessential.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_05_why_the_french_ban_on_veils_is_essential_comments_1540909988.html","title":"Why the French ban on veils is essential","title_page":"Blog: Why the French ban on veils is essential","title_rss":"NULL","source_domain":"americanthinker.com","text":"The New York Times ran a sob story about the ban on wearing veils in France: Malek Layouni was not thinking about her Muslim faith, or her head scarf, as she took her excited 9-year-old son to an amusement site near Paris. But, as it turned out, it was all that mattered. Local officials blocked her path to the inflatable toys on a temporary beach, pointing at regulations that prohibit dogs, drunks and symbols of religion. And that meant barring women who wear head scarves. Mrs. Layouni still blushes with humiliation at being turned away in front of friends and neighbors, and at having no answer for her son, who kept asking her, “What did we do wrong?” Oh no! The poor Muslim woman was humiliated! But wait, there's more! More than 10 years after France passed its first anti-veil law restricting young girls from wearing veils in public schools, the head coverings of observant Muslim women, from colorful silk scarves to black... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/05/why_the_french_ban_on_veils_is_essential_comments.html"}
matized and split this tidy village of modest homes as friends lined up on one side or the other. “My husband said that I lost my inner light,” said Mrs. Layouni, with a sigh[.]\nNo more inner light! Do you think that's the most important thing that victims of radical Islamic intolerance have lost?\nIt's curious, because in all the articles I read about the unrest in France, I never read about women persecuted for wearing veils, as this article implies happens all the time. No, all the articles I read discuss the husbands and sons of the women in veils, who go around smashing Jewish businesses and killing people they think are Jewish, or who murder those who draw cartoons that offends them, or who go to the Middle East to fight for the Islamic State. On the other hand, I never hear about massacres of veiled women (except perhaps at the hands of other radical Muslims in Iraq and Syria).\nAsk yourself how many Muslim women have been beaten or murdered for wearing veils (zero), and then how many Jewish people have been beaten or killed for wearing yarmulkes, or shopping in a Jewish store (an alarming and increasing number). Then you will know where the true problem lies.\nDo you know what country banned veils long before France did? Turkey! Turkey, the Muslim nation. The reason Turkey banned the veil (which has been reintroduced now that the Islamofascists have taken over) was because once some women started to wear it, other women felt strong pressure from intolerant radicals to do the same. It's a form of creeping fundamentalism.\nI don't think the veil would be as much of a problem if the husbands and sons of the veil-wearers weren't going out killing people on a regular basis. But the veil had come to symbolize the intolerance of fundamentalist Islam as it is practiced by many French Muslim immigrants, and many people fear that it represents creeping sharia law. French people think that once the immigrants get in large enough numbers, they too will be required to dress the same way.\nDo you think this is an alarmist exaggeration? Just read about the sharia patrols that have already started in countries all over Europe. The ban on veils should stay, and even be expanded.\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/05/why_the_french_ban_on_veils_is_essential.html"}
