{"authors":[],"date_download":"2018-10-22 21:11:07","date_modify":"2018-10-22 21:11:07","date_publish":"2014-06-04 14:40:35","description":"Study argues that wage growth for the average household has been thwarted more by changes in government policies than by global forces.","filename":"data/vaneerConsumption/WhytheWealthGapBlameGovernmentNewStudyArgues.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/486861/140604-wagegap_1036_0dd94ca5237e03d430a4de49591bf168.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_economy_why-wealth-gap-blame-government-new-study-argues-n122351_1540242667.html","title":"Why the Wealth Gap? Blame Government, New Study Argues","title_page":"Why the Wealth Gap? Blame Government, New Study Argues","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThere's little debate that wages for the average American household have stalled and wealth is flowing to the top of the income ladder.\nThere's less consensus about why—and what should be done about it.\nA new study analyzing more than three decades of wage data argues that government policies (such as the failure to have the minimum wage track inflation) go further toward explaining the expanding wealth gap in America than globalization, new technologies or gaps in education or training.\n\"There's a lot of uncertainty about the rise in inequality, but we've changed a lot of government policies over the last generation that have pretty predictable effects on wages,\" said co-author Josh Bivens, policy director at the Economic Policy Institute, a Washington think tank devoted to helping low- and middle-income households.\nThose policies have become a key focus of the Obama administration, which is proposing an increase in the federal minimum wage — to $10.10 an hour from the current $7.25 — as part of a broader agenda of boosting paychecks for lower- and middle-income households.\nThe new paper, being unveiled Wednesday at an event featuring Labor Secretary Thomas Perez, is the opening salvo in an EPI research campaign to focus on wage inequality.\nAt the root of the debate is a question economists have sought to explain for decades: the abrupt disconnect in the late 1970s between the overall productivity of the U.S. economy and wage gains for the average worker.\nFrom 1948 to 1979, both hourly wages and productivity roughly doubled. But from 1979 to 2013, productivity rose 65 percent while average hourly compensation rose just 8 percent, according to the EPI.\nAnd those at the bottom and middle of the income ladder saw little of those gains, according to the analysis, because most wage growth has flowed to the top 1 percent of earners.\nMany economists have blamed the rapid rise in globalization, which allowed American companies to move operations to countries where labor is cheaper. Others have cited the rise of technology — from factory floor robots to smartphones — that have allowed employers to squeeze more work out of the same number of workers.\nThe authors of the paper argue that wage growth for the average household has been thwarted more by changes in government policies than by global forces like technology, however.\nAmong those is the failure to update the federal minimum wage to keep up with inflation. In real terms, the spending power of a federal minimum wage has fallen to levels last seen in the 1960s.\nBut the authors also cite Federal Reserve policies that have favored low inflation over high employment and easing regulations governing overtime and the use of contract workers.","url":"https://www.nbcnews.com/business/economy/why-wealth-gap-blame-government-new-study-argues-n122351"}
