{"authors":[],"date_download":"2018-10-30 14:18:59","date_modify":"2018-10-30 14:18:59","date_publish":"2017-03-18 00:00:00","description":null,"filename":"data/vaneerConsumption/WhytheFederalGovernmentIsBroke.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2017_03_why_the_federal_government_is_broke_1540909139.html","title":"Why the Federal Government Is Broke","title_page":"Why the Federal Government Is Broke","title_rss":"NULL","source_domain":"americanthinker.com","text":"Politicians of both parties have continuously added programs that benefit some people and which the politicians promise will be paid for. Once programs start, they are hard to stop because there are always some beneficiaries who will be hurt.\nThe federal budget in FY 2007 was around $2.7 Trillion. By FY 2017 it had soared to $4.1 Trillion -- but it has never been enough.\nEven though politicians promise the programs will be paid for, they obviously aren’t, which is why we owe 20 trillion dollars and have tens of trillions of dollars in unfunded liabilities. They either borrow or add new taxes and fees to pay for new programs and to fund previous underfunding. There is always some service or product they can tax. It is very easy to use other people’s money or to borrow to buy votes.\nMany times they promise to tax the rich, but most often they end up putting in additional taxes on which focus on income earners in higher brackets -- people who don’t have the scale of resources to hire teams of experts, structure income in ways that minimize tax liability, and hire lobbyists. But for the poor and low income, taxes may weigh even heavier, in the form of consumption taxes on essentials. With outgo always exceeding income unless they spend very carefully, each new tax increase is a challenge.\nGovernment entities at all levels steal money from motor fuel taxes and then complain that they don’t have enough money for roads and bridges. Instead of spending the money on its intended uses, they say they need to raise fuel taxes. The latest excuse is that all those government-subsidized electric cars is cutting into gasoline tax revenue. So those gasoline taxes have to be increased.\nRecently Philadelphia instituted a heavy (and heavily regressive) sugary drink tax.\nFrom a Facebook post, the Philadelphia sugary drink tax implemented today damn, between that & Pennsylvania gas tax no wonder folk revolted pic.twitter.com/ZUtmufCyQn — SalenaZito (@SalenaZito) January 2, 2017\nSales crashed by as much as half, because lower income people consume a disproportional share of soft drinks, and they had to give them up. Social engineering, no doubt. But the politicians didn’t collect what they thought and stores and distributors started laying off people. Instead of the mayor recognizing the problem, the mayor called employers greedy.\nBasically, through it all there has been little concern for the common man and taxpayer. It is always “How can we get more money for the government?” Surveys have shown that fewer than half of Americans can come up with $1,000 to pay for an emergency. Politicians don’t care, as they continue to raise taxes and fees and make more promises.\nAs the politicians and government bureaucrats have enhanced their power by buying votes with government programs, they have also enriched themselves with great salaries and benefits, have protected their power by drawing voting maps to protect incumbents, have written campaign finance laws to ward off competition and have made sure that term limits don’t make it on the ballot. None of that is done for us or our children.\nWhat the powerful politicians can’t handle is an outsider like Trump who is not beholden to either party. Entrenched politicians of both parties, therefore, seek to destroy him each and every day. They must protect themselves. They do not want someone who will actually cut duplicate and unaffordable programs.\nObviously, the powerful politicians from both parties are responsible for the disastrous fiscal condition the country is in, but almost equally complicit are the significant majority of the media who support the massive spending and tax levels almost 100% of the time. They deride any attempt to cut or freeze as mean and disastrous. The media willingly trots out victims of any cuts because victims are the currency of progressives. Find some new victims and presto! there is a need for another government program.\nMaking people dependent on government enriches the governing class and provides them with job security. The media compliantly calls anyone who wants to make government smaller and cut taxes mean-spirited, inhuman, stupid, or sums up those characteristics with the expression “right wing extremist.” They never label anyone who wants government to get bigger and more powerful a “left wing extremist.”\nEconomies collapse because government gets too big and powerful, not because the people have too much power. It appears that we have a chance to give some of the power of the purse back to the people. If we don’t do it now, we never will. If the media actually cared about future generations they would be terrified of too much power going to the government. They certainly wouldn’t want to make future generations completely dependent on government.","url":"https://www.americanthinker.com/articles/2017/03/why_the_federal_government_is_broke.html"}
