{"authors":[],"date_download":"2018-10-30 01:23:50","date_modify":"2018-10-30 01:23:50","date_publish":"2016-08-29 00:19:57","description":null,"filename":"data/vaneerConsumption/WhytheMilitaryIndustrialComplexLovesHillary.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/08/1024px-thumbnail1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862630.html","title":"Why the Military-Industrial Complex Loves Hillary","title_page":"Why the Military-Industrial Complex Loves HillaryThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Military contractors are overwhelmingly favoring Hillary Clinton for president with their political contributions this year. Though Republicans normally enjoy a slight fundraising advantage here, she currently leads Donald Trump 5-to-1 among donations from employees of the top 25 firms in this extremely lucrative, highly government dependent industry.\nAn article in Politico last week tried to put a good face on this for Clinton. One consultant called Trump a “totally unknown quantity” and “scary.” Unnamed “defense watchers” say that Clinton “offers what weapons makers crave most: predictability.”\nThat is one way of putting it. Another thing Clinton offers wealthy donors of all industries is ready access. Wall Street firms didn’t pay hundreds of thousands of dollars a pop because they were smitten with her silver tongue, after all. They knew that she would be going back into “public service” soon at a fairly high level. They wanted to leverage that service.\nThe latest scandal related to then-Secretary Clinton’s emails and the Clinton Foundation has to do with the fact that a large percentage of Foundation donors who wanted face time with the Secretary of State were shown right into her office.\nThough maybe calling it a “scandal” is too short-sighted a way of looking at it. Sure, a Clinton spokesman did say to Politico that defense contributions make up only “a small fraction of the overall fundraising totals,” but it’s not like they’re giving that money back. And the story could in fact serve as an inducement to potential defense donors to pony up the maximum allowable if they want the next President Clinton to hear them out in the Oval Office, and perhaps stay over in the Lincoln Bedroom.\nAnother way in which Clinton is predictable which defense contractors would — let’s us just say — not object to is her marked preference for shock-and-awe. As a Senator from New York, she backed President George W. Bush’s invasion of Iraq. As Secretary of State, she was the most forceful voice urging America to intervene in Libya, which Barack Obama now admits was possibly the worst call of his presidency. Clinton has no such second thoughts. “We came, we saw, he died,” she joked of the death of Muammar Gaddafi.\nThe Libyan intervention took a North African country led by a strongman who had made his peace with America and turned it into a base for both al Qaeda and ISIS. An American ambassador was murdered there by jihadis on the eve of an election. Clinton’s State Department did everything it could to change the subject by blaming it on one weird anti-Muslim filmmaker in this country.\nNevertheless, several prominent foreign policy oriented neoconservatives have signed onto Clinton’s campaign, with some reason. After all, as noted in the memorable, only slightly exaggerated title of one Cato Institute podcast, “Hillary Backed 9 of the last 7 U.S. Military Interventions.” Wall Street Journal columnist Peggy Noonan said of Clinton (and also Trump) that she has no “informed or deeply felt sense of the tragedy of war.”\nClinton was a voice for intervention even as First Lady, reportedly agreeing to talk to Bill again after his intern problems only if he would commence bombing Serbia. That’s the kind of predictability that big defense contractors can surely appreciate.\nYet these companies also understand that many American voters view the preference as slightly unseemly, like they’re trying to root for war by rooting for a particularly hawkish candidate rather than simply working to supply our military’s legitimate needs. A Lockheed Martin spokesman told the paper, “As a corporation we have a longstanding practice of not participating in presidential election campaigns,” and insisted, “Any contributions made by our employees is personal and not associated with the corporation.”\nIn the event of Clinton’s election, however, one doubts that fig leaf will stay in place for long.","url":"https://spectator.org/why-the-military-industrial-complex-loves-hillary/"}
