{"authors":[],"date_download":"2018-10-31 00:04:52","date_modify":"2018-10-31 00:04:52","date_publish":"2016-09-19 00:00:00","description":"The mounting debt California faces in covering public employees' pensions can be traced back to the dot-com bubble in the late 1990s — when the state chose to make these benefits a lot more generous. That decision proved to have lasting implications.","filename":"data/vaneerConsumption/WhyTheDotComBubbleIsKeyToUnderstandingCaliforniasGrowingPublicEmployeePensionDebt.json","image_url":"https://www.capradio.org/media/7620762/GrayDavisLATimes.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/capradio.org/articles_2016_09_19__1540944292.html","title":"Why The Dot-Com Bubble Is Key To Understanding California’s Growing Public Employee Pension Debt","title_page":"\r\n        Why The Dot-Com Bubble Is Key To Understanding California’s Growing Public Employee Pension Debt - capradio.org\r\n    ","title_rss":"NULL","source_domain":"calmatters.org","text":"Ashley Gross | Capital Public Radio\nThis story is part of a collaboration with Capital Public Radio, The Los Angeles Times and CALMatters. Read more stories at: http://latimes.com/pensions.\nCalifornia faces a mounting public employee pension debt. In his State of the State address, Gov. Jerry Brown said the liabilities are “so massive that it’s tempting to ignore them,” but he said people in the state can’t turn away from these obligations promised years ago.\nTo figure out how California got in this situation, it’s helpful to rewind the clock to the late 1990s, back to the days of the dot-com bubble. That’s when the state and local governments chose to make pension benefits a lot more generous. It’s a decision that turned out to have lasting implications.\nThe end of the 1990s was a time when a lot of people got obsessed with the stock market. People were clamoring for shares of internet companies such as theglobe.com, which helped people create personalized web sites. Its stock surged 606 percent on its first day of trading in November 1998. It didn’t matter if the companies were making money – theglobe.com wasn’t.\n“Stocks were moving and going up, up, up, up,” said Michael Liedtke, a technology reporter for the Associated Press in San Francisco. “It seemed like there was no correction – it was just like this intoxicating feeling coming throughout the Bay Area.”\nLiedtke said people were so excited about the internet that venture capitalists were shoveling money into e-commerce startups, which in turn spent lavishly on TV ads, showered employees with stock options and hired big-name bands for parties.\n“They hired the B-52s to play at launch parties,” Liedtke said. “You see tech conferences now with big bands, but these are like little startups no one heard of.”\nSo what’s the connection between the B-52s and government worker pensions? The California Public Employees’ Retirement System, CalPERS – the largest public pension fund in the country – was riding high on the stock market boom. It had done so well that state and local agencies were able to put less and less money into the fund. That, plus political change in Sacramento, opened the door to boosting pension benefits.\nIn 1998, Gray Davis became the first Democrat to be elected governor in 16 years, gaining office with support from public sector unions.\nIn a recent interview with the Los Angeles Times and CALmatters.org, Davis said when CalPERS pushed for a bill that would let state workers retire at younger ages with more money, it seemed reasonable.\n“Most of the people that I care about – the nurses, the firefighters, the teachers – didn’t fare very well over those 16 years,” Davis said. “So if there was a way in which I could compensate them and we could afford it, I wanted to do that.”\nCould the state afford it? CalPERS said yes. The agency passed around a brochure to lawmakers saying that the burden wouldn’t fall to taxpayers. Stock market gains would cover the cost of the sweetened pension benefits. Davis said he took that with a grain of salt, but overall he thought the plan was sustainable.\n“When I looked at what happened in our economy over the preceding five years and I got a sense of what was going to happen in Silicon Valley, I was very close to them, I really believed that we were on the doorstep of a very robust, lasting economy,” Davis said.\nSo in 1999, he signed the bill, SB 400. The new law boosted pension benefits as much as 50 percent for some state workers. Highway patrol officers could retire at age 50, and with enough years of service, some could potentially draw a pension almost equal to a full salary. Local governments boosted their own pension benefits as well.\nBut of course, an economy built on money-losing e-commerce startups hit the skids not long after SB 400 was signed. One by one, dot-coms closed their doors. Pets.com, famous for its dog sock puppet TV ads, announced in late 2000 that it was shutting down. By summer 2001, the online grocery business Webvan Group Inc. said it was filing for bankruptcy.\nStarting with the year 2000, the Standard and Poor’s 500 Index fell three years in a row.\nPublic sector employees have continued to pay into the system. But as CalPERS’ investment returns suffered in the dot-com crash and then the Great Recession, taxpayer contributions rose. Taxpayers have put about $90 billion into CalPERS since the year 2000. Even that hasn’t been enough. The agency said it still needs more than $93 billion at least to strike even.\nJoe Nation, a professor of the practice of public policy at Stanford University and a former Democratic member of the California State Assembly, said he’s not sure taxpayers are willing to keep shouldering that burden.\n“I think voters are starting to say, `Wait a minute. We keep raising taxes – where’s it going?’” Nation said. “Well, to a great extent, it’s going to public employee compensation and to pensions, specifically. And I think at some point, voters are going to say, `Not anymore.’”\nNation said one thing Californians should not count on is another stock market bubble to bail the system out.","url":"http://www.capradio.org/articles/2016/09/19/why-the-dot-com-bubble-is-key-to-understanding-californias-growing-public-employee-pension-debt/"}
