{"authors":[],"date_download":"2018-10-30 01:00:39","date_modify":"2018-10-30 01:00:39","date_publish":"2018-07-15 14:18:14","description":null,"filename":"data/vaneerConsumption/WhytheMeltdownOverKavanaugh.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/Chuck_Grassley_greets_Brett_Kavanaugh.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861239.html","title":"Why the Meltdown Over Kavanaugh","title_page":"Why the Meltdown Over KavanaughThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The end of the world is coming. At least, that is what the Left believes will happen if the Senate confirms Brett Kavanaugh to the Supreme Court. It will be the legal equivalent of Armageddon. Head for the hills, or Canada, for refuge!\nNo doubt the appointment matters. Right-leaning presidents have squandered many opportunities to move, if not transform, the high court. The activist Warren Court was essentially a Republican court, including Earl Warren, William Brennan, and Harry Blackmun. The terrible GOP nominations continued: John Paul Stevens and David Souter were particularly awful picks, social engineers determined to remake society in their preferred image.\nSandra Day O’Connor and Anthony Kennedy were center-right, but not interested in ending the Supreme Court’s role as a continuing constitutional convention. Chief Justice John Roberts worries more about the body’s image than the Constitution, saving Obamacare based on grounds (the mandate was a tax) even Democrats didn’t take seriously. The retiring Kennedy took occasional flights of fancy when he sought to help people figure out what it meant to be a human being in the universe, as opposed to articulating what the Constitution meant.\nIn contrast, the last Democratic appointee who moved noticeably rightward may have been Byron White, nominated by President John F. Kennedy. President Lyndon Johnson’s, Bill Clinton’s, and Barack Obama’s choices performed as expected: promote a “living” Constitution which upholds most every expansion of federal power and transforms society into a liberal nirvana. Where leftish jurists do best is when they advocate vigorously applying the few constitutional provisions which they like — such as free speech and search and seizure. Most everything else in the Constitution, contend liberal justices, has been transcended by history.\nThe Right has a broad jurisprudential vision rooted in the text and history of the Constitution. That is, it should mean roughly what it was believed to mean at the time. There is a mix of factors: text, drafters’ intent, and political compromise at the time. Not everything is clear, sometimes general principles aren’t easy to apply decades in the future to different circumstances, and the political process is messy and full of compromise. Nevertheless, if the document, whether Constitution or statute, doesn’t have a reasonably fixed meaning, why bother with it? Just admit judges can do what they want.\nWhich is the essence of liberal jurisprudence.\nWhatever the theory, and there are many, its essence is that jurists should override what those drafting and implementing the document intended to achieve. Of course, laws and even constitutions need to be adapted to changing circumstances. But there is a prescribed way of amending the Constitution, which results in a similar sort of compromise as the original document. The courts have become a short-cut, a super-legislative branch that can eliminate the need for political debate or majority support. Convince five members of the Supreme Court that history is moving in a particular direction and, voila!, society gets there today instead of at an uncertain date in the future.\nWhich is why the Left is going into meltdown over the nomination of Judge Kavanaugh. I worry about his view of civil liberties and executive power, and wonder if he might lean too far in Justice Roberts’ direction, seeking to keep decisions at the micro level. There is an argument for incremental change, but given how radically leftward the high court has shifted over time, a bit more speed in reverse seems appropriate.\nNevertheless, Kavanaugh is a talented, intelligent, principled, and well-respected jurist. Yale’s Akhil Reed Amar called the appointment “superb” and argued that Kavanaugh “commands wide and deep respect among scholars, lawyers and jurists.” Another Yale law professor, Amy Chua, wrote of his mentoring for women: more than half of his clerks have been women.\nIf the Left wants to block him, it should explain why his jurisprudential vision is flawed. But activists don’t have a judicial philosophy. Rather, they care only about results. They see the high court as a battleground, another government institution to be seized in the endless fight to transform everyone around them into progressive automatons. Never do they imagine that maybe, just maybe, the Constitution does not mandate their vision of utopia, but rather, leaves that fight up to the political process.\nThe charges are hot and heavy. Kavanaugh will hurt the vulnerable. “Destroy the civil rights of low-income black children.” Turn back the clock for gays. “Favor the wealthy and powerful.” Threaten Obamacare. Undermine “our democratic institutions.” Endanger “our fundamental rights.” Encourage discrimination. Undermine “our civil rights.” Enable Republicans “to suppress the vote.” Harm “the lives of working people” for decades. “Protect corporations at the expense of workers” and “allow corporations and the wealthy to buy elections.” Hurt people’s “health, safety, and the environment.” Be “hostile to health care for millions, opposed to the CFPB and corporate accountability.” Put abortion, “affordable health care, labor unions, and civil rights … on the chopping block.”\nOverall Kavanaugh is a “threat to our democracy.” He would treat the president as “above the law” and act as “a barrier to preventing” the Mueller investigation from “subpoenaing the president.” Kavanaugh would end legal abortion in America. Which means that his appointment would act as a “death sentence for thousands of women in the United States.” Indeed, he poses a “threat” and “people will die if he is confirmed.” But not just thousands: the nomination “will threaten the lives of millions of Americans for decades to come.” Why, “civilization as we know it today is at risk,” since the president “is using this nomination as a destructive tool on a generation of progress for workers, women, LBGT people, communities of color and families, and to radically reverse the course of American justice and democracy.”\nWow, Judge Kavanaugh apparently has quite an agenda. All because he doesn’t believe Supreme Court justices are de facto legislators. America will end up a desolate wasteland.\nOr, maybe so-called progressives could try to convince Americans to back their positions in events called elections. Like happened with Presidents Clinton and Obama. And the Democratic House headed by Nancy Pelosi and Democratic Senate headed by Harry Reid.\nIndeed, New York Times columnist David Leonhardt made a startling admission: the nomination is not the big battle. Rather, “the great political fights are still ahead.” On the specific policies. “Progressives can still win many of these issues. They simply will have to do so in a small-d democratic way, by winning elections,” he explained.\nIf Brett Kavanaugh is confirmed, he will push the American constitutional system back toward its original balance. That is what so scares, even panics, the Left. It has come to expect judges to impose what voters don’t want. If the high court abandons its legislative role, liberal activists will have to convince voters to endorse social engineering directed against the American people.\nWelcome to democracy. In a constitutional republic.","url":"https://spectator.org/why-the-meltdown-over-kavanaugh/"}
