{"authors":[],"date_download":"2018-10-22 22:26:21","date_modify":"2018-10-22 22:26:21","date_publish":"2014-05-10 03:18:42","description":"\"No active discussions\" over use of U.S. drones to hunt Boko Haram kidnappers and hostages.","filename":"data/vaneerConsumption/WhyUSDronesArentFlyingOverNigeriaAndWhatTheyCouldDoifTheyWere.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/433696/140509-mq-drone-2314_6cac41a5934e1b3e22150c2886e2f975.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_why-u-s-drones-aren-t-flying-over-nigeria-what-n102031_1540247181.html","title":"Why U.S. Drones Aren't Flying Over Nigeria (And What They Could Do if They Were)","title_page":"Why U.S. Drones Aren't Flying Over Nigeria (And What They Could Do if They Were)","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThough U.S. officials have offered to do everything possible to aid in the search for more than 200 kidnapped schoolgirls, the Nigerian government has yet to accept drone flights over its restive northeast corner, U.S. officials say.\nThe reason why the Nigerian government has not requested the remotely piloted U.S. surveillance drones is not clear.\nFrustration over the inaction was evident at a Pentagon briefing Friday.\n“There are no active discussions” with the Nigerian government about the use of “unmanned aerial surveillance,” or drones, said Rear Adm. John Kirby.\nIn fact, Kirby said, the relatively small “coordination team” of U.S. military, law enforcement FBI and intelligence officials is the only offer of assistance that the Nigerian government has accepted. Kirby declined to say what else may have been offered and rejected by the Nigerians, saying only, “We urge them (Nigerians) to use all resources at their disposal.”\n“No permission, no flights.”\nPrivately, a U.S. official familiar with U.S. intelligence options in the region, confirmed Kirby’s statement to NBC News that no drones have flown in pursuit of the missing girls. “No, not yet,” said the official , speaking on condition of anonymity. “No permission, no flights.”\nThe U.S. would have to get permission as well from neighboring countries -- Cameroon, Chad and possibly Congo – because the mission would also almost certainly involve overflights there, where Boko Haram troops also are active. “They cross those borders daily,” said one U.S. intelligence official.\nEven without drones, experts and U.S. officials say, Washington has other hi-tech spy technology that could help in the search.\nDr. Jeffrey T. Richelson, author of the forthcoming “U.S. Intelligence Community,” a compendium of Washington’s intelligence capabilities, said the drone is the ideal platform for tracking Boko Haram and possibly locating the girls, who were abducted on April 14 from a state-run boarding school in Chibok.\n“Drones have both the loitering capability and the stealth capability for a mission like this,” said Richelson. “You can keep a location in constant view rather than intermittent surveillance that you get with satellites.”\nThe U.S. has an agreement with the government of neighboring Niger to fly drones out of Niamey airport -- less than 1,000 miles west of the kidnapping site. But intelligence sources say it's not clear whether any drones are currently at the airport. One official noted it would take some time to set up support operations in any case.\nU.S. officials confirm that Predator drones have flown out of Niamey previously for missions to track members of Al Qaeda in the Islamic Maghreb, a terrorist group based in nearby Mali.\nThe U.S. also could fly longer-range Global Hawks or MQ-9s on missions from as far away as the United Arab Emirates or England.\nEyes and ears in the sky\nWhile some analysts have questioned the utility of using reconnaissance drones over the dense jungle where Boko Haram is believed to be holding the girls, Richelson said they have superior capabilities over aircraft or satellites.\n“It's possible to equip (drones) with a fairly large variety of intelligence-collection packages, including a variety of imaging sensors as well as eavesdropping equipment,” he said. Richelson said those could include visible-light sensors, capable of picking out objects as small as guns; infrared sensors and phased array radar sensors, capable of observing movements or gatherings at night; and hyper-spectral image sensors, which can detect “when ground has been disturbed, vegetation has been cut.” The latter are “highly useful in forest areas” like the Sambisa Forest, a Boko Haram stronghold, said Richelson.\nElectronic eavesdropping packages also could pick up communications that “travel by air ... walkie-talkie traffic, cell or satellite phones” and other forms of communication.\nRichelson said that Global Hawks would be the most effective drones, as they can remain aloft for long periods of time. During that period, they can image up to 40,000 square miles of the targeted area without being detected, he said.\nAnother expert said the flying abilities of second-generation drones are extraordinary.\n“Global Hawk can loiter for 60 hours,” said William M. Arkin, co-author of “Secret America,” a book on secret U.S. intelligence bases around the world. “Same with the MQ-9. The Predator can loiter for 22 hours at 500 miles per hour.”\nAn MQ-9 Reaper drone flying at Creech Air Force Base in Indian Springs, Nev. ETHAN MILLER / AFP - Getty Images file\nThey also have a longer range -- up to 9,500 miles – and can fly as high as 60,000 feet, meaning, “It's no longer a matter of having to be close in,” he said.\nIn other words, these “super drones” could be dispatched from their home base in al-Dharfa in the United Arab Emirates, or other bases where they have previously been stationed: Molesworth in England; Djibouti in west Africa; or Sigonella, Sicily, he said.\nArkin also dismissed the idea that the U.S. would be reluctant to commit such a valuable asset to Nigeria.\n“We have excess capacity now,” he said, estimating that the U.S. now has an inventory of two dozen Global Hawks alone.\nLow-orbit spy satellites\nAs valuable as the drones would be, Arkin said there is a new class of tactical spy satellites that fly in orbits a mere 55 miles above the Earth's surface that could prove even more useful.\nThe ORS and TacSat satellites, which are used regularly over Afghanistan, could be quickly repositioned over Nigeria, without the need to get permission to use airspace of countries in the region.\n“They do have hyper-spectral capabilities. They can give you data on where the ground was disturbed,” said Arkin, adding that he believes the U.S. currently has six such satellites in orbit. “They also have an interesting feature that allows them to slow down (in orbit).They are game changers. Compared to them, drones are limited.”\nRichelson agreed, but said traditional higher-altitude spy satellites would be required to “get close to continuous coverage, reduce the gaps between (when) something is overhead.” But he that would require cooperation among a variety of countries, he said, including Russia, France and Israel, among others to maximize coverage.\nFollow NBC News Investigations on Twitter and Facebook.\nArkin and Richelson also said spy satellites, both conventional and the new lower orbit models, come with archives. If the U.S. had any positioned over west Africa at the time the girls were grabbed, for example, analysts could go back and see if the satellite’s data might provide valuable clues as to the hostages’ fate.\nRichelson noted that spy satellites also have played a role in unmasking war crimes. In 1995, CIA analysts found photographic evidence from satellites of Bosnian Serb military units lining up 8,000 men and boys in front of mass graves in the Bosnian city of Srebrenica.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/why-u-s-drones-aren-t-flying-over-nigeria-what-n102031"}
