{"authors":[],"date_download":"2018-10-22 22:13:27","date_modify":"2018-10-22 22:13:27","date_publish":"2014-05-07 16:34:36","description":"A former marketing manager spells out key things to know about Latinos in his book \"The ABC's and Ñ of America's Cultural Evolution\"","filename":"data/vaneerConsumption/WhyUnderstandingtheLatinoMarketPaysOff.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/426841/140507-jim-estrada-1329_6f98c6eaad9461db056e777e04a7bbd7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_why-understanding-latino-market-pays-n99406_1540246407.html","title":"Why Understanding the Latino Market Pays Off","title_page":"Why Understanding the Latino Market Pays Off","title_rss":"NULL","source_domain":"nbcnews.com","text":"U.S. Hispanic consumer purchasing power is currently at $1.2 trillion and growing. There are only 13 countries in the world which produce goods and services greater than the buying power of U.S. Latinos, and Hispanics are more apt to buy a new car than the general population.\n\"What you don't know can hurt you,\" says Jim Estrada in his book, \"The ABCs and Ñ of America's Cultural Evolution,\" saying it's certainly true when it comes to the Latino market and community.\n\"We don't have many marketing people trained in cultural relevance, much less cultural competence,\" he said in an interview about his book.\nEstrada, a former marketing manager for several companies including Anheuser-Busch and McDonald's, thinks many in the business world are missing crucial opportunities. A Nielsen study recently stated the future U.S. economy will depend on Hispanics \"and the social and cultural shifts expected to accompany their continued growth.\"\n“If you look at companies that lead in diversity, they are the most profitable. It is about adaptation to the marketplace.”\nCultural awareness is profitable, stressed Estrada. In Chicago, the largely Latino neighborhood of La Villita has become one of the city’s largest sources of sales tax revenue. In Los Angeles in 2005, first-generation immigrants founded 22 of the city's fastest-growing companies, some of which now have a national presence. These include the eateries El Pollo Loco and Panda Express and the retailer Forever 21. In New York City, foreign-born residents are nearly a third of the population, but represent almost half of the self-employed and entrepreneurs.\nEthnic marketing is an area of expertise that is sorely lacking in the United States, but several industries are doing it well, including the beverage and automotive industries, he said. “If you look at companies that lead in diversity, they are the most profitable. It is about adaptation to the marketplace,” Estrada said.","url":"https://www.nbcnews.com/news/latino/why-understanding-latino-market-pays-n99406"}
