{"authors":[],"date_download":"2018-10-30 14:35:38","date_modify":"2018-10-30 14:35:38","date_publish":"2014-10-17 00:00:00","description":null,"filename":"data/vaneerConsumption/WhywontObamaimposeaflightbanfromEbolastrickennations.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_10_10_17_2014_7_1_1540910138.html","title":"Why won't Obama impose a flight ban from Ebola-stricken nations?","title_page":"Why won't Obama impose a flight ban from Ebola-stricken nations?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Why won't Obama impose a flight ban from Ebola-stricken nations?\nAs America’s Ebola panic spreads and demands mount to impose a flight ban on nations in Africa where Ebola is spreading, Barack Obama is adamant that he will not impose one. Other nations in Africa have imposed such a ban and credit the closing of their borders for the protection afforded their people and for stopping the spread of Ebola into their nations. British Airways has canceled all flights into and out of affected nations. But President Obama won’t order such a ban, though he has the authority to do so (not that he ever cares about laws if they get in the way of his agenda).\nPerhaps he sees himself a citizen of the world and would not punish nations in Africa who have suffered from being colonized by the West. He did call himself a citizen of the world in 2008 - while overseas. Given testimony delivered this week by CDC head Tom Frieden it does seem that President Obama is the person preventing the ban from being imposed , ignoring the will –again-of the vast majority of Americans who see such an action as being a sensible precaution, especially given the incompetence so pervasive in our government. Protests have started across from the White House, complete with Hazmat-costumed people :\nVarious doctors see the rationale for protecting Americans by taking this step. Perhaps, Barack Obama thinks he knows more than they do about science and epidemics and virology. After all, his ego is one of his most prominent character traits and flaws. And he not infrequently boasts of his superiority. A few years ago he did compare himself to the likes of Lincoln and FDR. He also said: “I think that I’m a better speechwriter than my speechwriters. I know more about policies on any particular issue than my policy directors. And I’ll tell you right now that I’m gonna think I’m a better political director than my political director.” Also, don’t forget that Obama considers his judgment superior to that of his generals, his Secretary of State and head of the CIA. He ignored their recommendations regarding Afghanistan, Syria, Iraq and ISIS. He also considers himself a better general and geopolitical strategists than anyone else. He even decides where to attack in Syria. This isn’t Stratego or a video game. Obama’s ego is damaging the health and safety of Americans. So maybe he also thinks he is a better epidemiologist than the epidemiologists.","url":"https://www.americanthinker.com/blog/2014/10/10_17_2014_7_1.html"}
