{"authors":["Alice Broster"],"date_download":"2018-10-31 01:40:38","date_modify":"2018-10-31 01:40:38","date_publish":"2018-08-28 13:59:33","description":"Celebrity Big Brother never fails to serve some real gossip — and this year has been no exception. Just a few days ago, one of the loudest housemates disappeared from our screens without a trace, and we've yet to find out exactly why. I mean…","filename":"data/vaneerConsumption/WhyWasRodrigoAlvesRemovedFromCelebrityBigBrotherHisSuddenDisappearanceHasRaisedQuestions.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/3f02fc17-80c0-4dda-aea5-5599c84aa63b-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_why-was-rodrigo-alves-removed-from-celebrity-big-brother-his-sudden-disappearance-has-raised-questions-10259223_1540950038.html","title":"Why Was Rodrigo Alves Removed From 'Celebrity Big Brother'? His Sudden Disappearance Has Raised Questions","title_page":"Why Was Rodrigo Alves Removed From 'Celebrity Big Brother'? His Sudden Disappearance Has Raised Questions","title_rss":"NULL","source_domain":"bustle.com","text":"Celebrity Big Brother never fails to serve some real gossip — and this year has been no exception. Just a few days ago, one of the loudest housemates disappeared from our screens without a trace, and we've yet to find out exactly why. I mean seriously, what the heck happened? He wasn't voted out by the public and he wasn't given a backdoor eviction, so why was Rodrigo Alves removed from Celebrity Big Brother?\nHe was last seen on screen entering the Diary Room during Friday night's episode. But then, just like that, by the following morning, he was gone. On Saturday (August 25), the Celebrity Big Brother official Twitter handle confirmed that Rodrigo would not be returning. He was not taken to a second house and it was not some kind of secret task. Rodrigo had left the building.\nThe news came just four days after the broadcast regulator Ofcom received upward of 1,000 complaints about Rodrigo for using the N-word twice whilst talking to his fellow housemate Dan Osborne. Afterwards, Big Brother bosses issued him an \"official warning,” however, producers opted not to remove him from the house. At the time, Rodrigo said of his language: \"I obviously regret that, the fact that I used the N-word. That was not necessary at all. It was just excitement, I'd had quite a lot to drink.\"\nHowever, if this wasn't the reason he was kicked out of the house, then what was? Well, the plot thickens. According to the Sun Online, Big Brother decided to remove Rodrigo from the house because of \"seriously inappropriate\" behaviour.\nA TV insider who spoke to the newspaper said: \"Rodrigo behaved seriously inappropriately inside the house. It came to the attention of producers who watched the footage back. After a discussion they decided the only course of action would be to remove him from the house.\"\nI decided to reach out to a Channel 5 rep to see if they could elaborate any further on what the alleged offensive behaviour was. However, they were not able to reveal any additional details. Instead, a spokesperson for the show tells me: \"After a further incident, Rodrigo has been removed from the Big Brother house and will not be returning.\"\nShutterstock\nFrustratingly for fans, it looks like we won't be getting answers any time soon. According to The Sun, Big Brother bosses have ruled that they will not broadcast what Rodrigo did or said because it was so shocking. Whatever it was that went down that night, it was reportedly so bad that it is not suitable for television. And apparently, this is why Rodrigo had to be removed from the house immediately without explanation.\nHowever, during an interview with MailOnline, Rodrigo insisted that he was not removed from the house. On the contrary, he claims that he left the house by choice because he'd had enough. In fact, he reckons he \"demanded to leave.\" He told the website: \"I was going to scale the wall if I wasn't allowed to leave. I didn't like it. My co-stars were boring, dirty, and I had nothing in common with them. I was claustrophobic. I had to get up early and stay up late. I didn't understand why people were in there.\"\nStuart C. Wilson/Getty Images Entertainment/Getty Images\nSo, what's the truth? I reached out to a representative of Rodrigo to find out, however, his rep did not comment.\nThere appears to be two version of events here; Rodrigo’s and Channel 5’s. Who should we believe? Well while there is no concrete reasoning as to why Rodrigo was removed right now, there is one thing we know for sure; historically, things never stay quiet regarding Celebrity Big Brother controversies. In my opinion, everything will be revealed in due course. For the time being, one thing I’m certain of is that whatever went down, it was dramatic and shocking AF, regardless of who was to blame. I will therefore be assuming position in front of Twitter with some popcorn until the tea is spilt.","url":"https://www.bustle.com/p/why-was-rodrigo-alves-removed-from-celebrity-big-brother-his-sudden-disappearance-has-raised-questions-10259223"}
