{"authors":["Pamela Geller"],"date_download":"2018-10-30 18:41:35","date_modify":"2018-10-30 18:41:35","date_publish":"2015-06-02 15:41:43","description":"The Supreme Court ruled Monday in favor of Samantha Elauf, a Muslim woman who sued for discrimination after not being hired by Abercrombie & Fitch, because her insistence on wearing the Muslim hijab conflicted with their dress code. |","filename":"data/vaneerConsumption/WhyWouldaDevoutMuslimWanttoWorkatAbercrombieandFitch.json","image_url":"https://media.breitbart.com/media/2015/06/ap_samantha-elauf_ap-photo-1024x752.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_02__1540924895.html","title":"Why Would a Devout Muslim Want to Work at Abercrombie and Fitch?","title_page":"Why Would a Devout Muslim Want to Work at Abercrombie and Fitch? | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Supreme Court ruled Monday in favor of Samantha Elauf, a Muslim woman who sued for discrimination after not being hired by Abercrombie & Fitch, because her insistence on wearing the Muslim hijab conflicted with their dress code.\nJustice Antonin Scalia said of the 8-1 ruling, “This is really easy” – but neither he nor the Justices who voted with him showed any indication of realizing what was really at stake in this case.\nShe won an award of $20,000 in 2011, but a Court of Appeals overturned that, with the judge explaining: “Ms. Elauf never informed Abercrombie before its hiring decision that she wore her head scarf, or ‘hijab,’ for religious reasons.” The Supremes should have taken the hint. They didn’t.\nWhy didn’t she? It wasn’t inconsequential, at least not for her. She spent the ensuing years suing, losing, suing again, appealing until her case reached the highest court in the land. So why didn’t she mention it? What was her agenda? That is perfectly clear now.\nI ask you: what devout Muslim girl would want to work for a firm that peddles erotic, sexy clothes and soft-porn images? Their catalogue is not allowed in many homes. Many parents have rightly judged that it is too racy for their teenage daughters. So what is the pious hijabed one Samantha Elauf doing wanting a job like that?\nIt was all a set up. Why would Elauf want to work there? In order to force another major American business to accommodate Islamic norms – and this time, that sinister agenda won the aid of the United States Supreme Court.\nIt is more than suspect that this devout Muslim woman sought a career at Abercrombie & Fitch. Abercrombie & Fitch’s images in its advertising are soft porn. Why doesn’t Samantha Elauf apply for a job modeling for Larry Flynt’s magazine?\nWhat she sought was a lawsuit — litigation jihad, as evidenced by the participation of the Hamas-tied Council on American-Islamic Relations (CAIR), designated a terror organization by the United Arab Emirates, in her suit.\nHamas-CAIR pursues these “discrimination” lawsuits all around the country, pressing American workplaces to change the way they operate to accommodate Islamic norms. The goal is to establish and reinforce the principle that anywhere American cultural mores conflict with sharia, it is Americanism that has to give way.\nThis is exactly the pattern that I meticulously document in my must-read primer, Stop the Islamization of America.\nAnd now the Supreme Court’s decision will ensure that there will be many more such cases, just as the mainstream media’s refusal to run Muhammad cartoons because Muslims kill over them only ensures that there will be more violent threats, more bloody demands for submission. Demands for accommodation result in…more demands.\nTake, for example, the Hertz company. Hertz bent over backwards to accommodate its Muslim workers: they have prayer rooms, prayer times, etc. They just didn’t want the Muslim workers leaving work to pray outside of scheduled break times. Mind you, they could easily pray before or after work, but no. This imposes Islam on everyone else – just as Samantha Elauf wanted to do at Abercrombie & Fitch by demanding that they change their dress code and give up their right to set the public tone of their own company. After the initial surrender on Hertz’s part, Muslim workers began suing Hertz, charging “Islamophobia.”\nStar Transport was sued for rightfully terminating two Muslims who refused to do their job. If these Muslim truck drivers didn’t want to deliver alcohol, then they shouldn’t have taken a job in which part of their duties would be to deliver alcohol. It’s that simple.\nA Muslim woman sued Children’s Hospital Boston after being fired for refusing to get a flu shot. If you don’t want to take the necessary steps to work in a hospital and adhere to the rules to insure the health of the public at large, then don’t work in a children’s hospital.\nA New Mexico Muslima sued Planet Fitness over its headgear safety rules. Obviously headgear is prohibited in this gym because it presents a safety hazard. But people’s safety be damned. This suit mirrored the melee that ensued at a New York Playland Park when park officials adhered to their safety rules in order to keep park attendees free from harm. Muslim visitors got angry that the park was enforcing its ban on headgear by prohibiting the women from wearing their traditional head coverings on some rides.\nA Muslim woman who worked as a hostess at a Disneyland restaurant sued Disney. Like Elauf, Imane Boudlal wore the hijab, but the garment violated Disney’s dress code. Disney offered up a compromise hat for her to wear, but Boudlal refused, of course. It wasn’t about hijab; otherwise the cute cowboy hat that Disneyland offered Boudlal would have been fine (everyone on the floor at Disney wears costumes). It was about imposing Islam on the secular marketplace.\nYou’ll notice, big companies are always targeted. Hertz, Heinz, Target, Wal-Mart, Disney, and now Abercrombie & Fitch. Why? To set precedents.\nAnd in all these cases, the company bent over backwards to accommodate these demands. But that’s always taken as a sign of weakness, and accommodation gives way to more demands.\nPamela Geller is the President of the American Freedom Defense Initiative (AFDI), publisher ofPamelaGeller.com and author of The Post-American Presidency: The Obama Administration’s War on America and Stop the Islamization of America: A Practical Guide to the Resistance. Follow her on Twitter here. Like her on Facebook here.","url":"https://www.breitbart.com/national-security/2015/06/02/why-would-a-devout-muslim-want-to-work-at-abercrombie-and-fitch/"}
