{"authors":["Imogen Blake For Mailonline"],"date_download":"2018-10-23 03:00:15","date_modify":"2018-10-23 03:00:15","date_publish":"2017-03-16 13:36:27","description":"The egg rack is usually in the door of the fridge, the warmest part of the appliance so to make sure eggs last a long time, experts advise to keep them in the main part of the fridge.","filename":"data/vaneerConsumption/WhyyoushouldNEVERkeepeggsonthatrackinthefridge.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E546E9200000578-0-image-a-19_1489670686717.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_food_article-4319952_Why-NEVER-eggs-rack-fridge_1540263615.html","title":"Why you should NEVER keep eggs on that rack in the fridge","title_page":"Why you should NEVER keep eggs on that rack in the fridge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Most fridges have a specially designed rack in the door where you can put your eggs.\nBut experts have now revealed in a new guide that this is the last place where you should keep your eggs if you want them to stay fresh for longer.\nAnd as for red wine, if you've been keeping opened bottles in the cupboard, then you've been storing them wrong.\nThis is the ultimate guide to where you should really keep your groceries.\nFrom left to right: Cordials and squashes can be kept in the cupboard; bananas should be kept away from other fruit on the counter; eggs should be kept in the fridge along with tomato ketchup and red wine; while cucumbers should be stored on the kitchen worktop\nMost of us may put fresh vegetables and fruit in the fridge, but not all of them belong there, according to MuscleFood.com.\nCucumbers, tomatoes and bananas should all be kept on the kitchen counter, while apples and grapes should be kept chilled.\nWHERE TO STORE YOUR GROCERIES Cucumbers: Fridge Bananas: Kitchen counter Butter: Fridge Eggs: Fridge Chocolate: Cupboard Preserves once opened: Fridge Peanut butter: Cupboard Potatoes: Cupboard Cordials: Cupboard Bread: In plastic bag at room temp Tomatoes: Kitchen counter Red wine: Fridge Mayo: Fridge Ketchup: Cupboard Apples and grapes: Fridge Soy sauce: Cupboard Onions: Cupboard Fruit squash: Cupboard\nRead on for the ultimate guide to where you should keep your groceries.\nEGGS\nNever put eggs on an egg rack, even though fridges commonly design one to fit in the inside door of the appliance. Cucumbers will go watery if you keep them in the fridge\nEggs should go in the fridge - but never use the egg rack inside the door. The constant changes in temperature as the door opens and closes will make them go off quicker.\nInstead keep them in the main body of the fridge.\nBREAD\nBread should be stored at room temperature, enclosed in a plastic bag.\nTwo days after opening, move to the freezer wrapped in plastic freezer bags or foil.\nNEVER store bread in the fridge. This makes the bread go stale quicker.\nCUCUMBERS\nNever put your cucumbers in the fridge - they could end up with chill injuries, making it watery and mushy and affecting the taste and texture.\nFor best results, leave on your kitchen worktop. If they start to go soft, you can then move them to the fridge.\nBANANAS\nThe gas that bananas let off that causes other fruits to ripen is called called ethylene. If you have particularly hard fruits you want to ripen quickly, put them by some bananas\nBananas never go in the fridge, unless they’re over ripe and you want them to last a little longer.\nThe best place for them is in a fruit bowl by themselves. Bananas ripen quickly and let off a gas which can cause other fruit to spoil so they're best in a fruit bowl by themselves.\nTOMATOES\nMost of us store tomatoes in the salad drawer of the fridge but if you want them to taste their best, leave on the kitchen worktop.\nIf they start to become too soft, move them into the fridge.\nBUTTER\nFor short-term storage, butter is fine kept in a butter dish on the kitchen counter.\nBut if you want to preserve it for longer, it is recommended that you keep it in the fridge.\nIf you like smooth butter that’s easily spreadable, a great tip would be to cut small sections off for the butter dish, and keep the rest of it in the fridge.\nRED WINE\nWine buffs may disagree but actually once opened, red wine is best at a slightly chilled temperature\nAlthough many people prefer to store red wine in the cupboard after opening, it is actually better to keep it in the fridge.\nStoring red wine at warmer temperatures slows down chemical reactions, including oxidation, which is bad for an open bottle.\nCHOCOLATE\nNever refrigerate chocolate. Chocolate absorbs odours from the fridge and moisture in the fridge can discolour it.\nStore chocolate in a cool, dry place, away from anywhere that it could melt.\nKETCHUP\nTwitter went into meltdown in January with people divided about whether to keep ketchup in the fridge or cupboard. Experts say to keep it in the cupboard until it's opened\nA controversy erupted on Twitter earlier this year about where to keep the condiment, but once opened ketchup should be stored in the fridge.\nStoring it at room temperature can damage the quality of the product. The high acid content means the appearance and texture will begin to deteriorate if not left in the fridge.\nMAYONNAISE\nCommercially produced mayonnaise should be kept in the fridge. The product contains eggs and cream, which wouldn’t be best to store at room temperature.\nJAMS\nJams, marmalade and pickles should also be put in the fridge once opened. Prior to opening, they’re fine in a dark, cool kitchen cupboard.\nPEANUT BUTTER AND SOY SAUCE\nThese can be safely stored in a cupboard even when opened. Peanut butter lasts up to three months and soy sauce three years.\nAPPLES AND GRAPES\nDon't keep your apples in the fruit bowl: they last much longer in the fridge. Fruit squashes on the other hand don't need to be kept in the fridge even after they've been opened\nMost of us put them straight in the fruit bowl but apples and grapes should both be left in the fridge.\nDon’t wash them before putting them in – the excess water speeds up the fruit's decomposition.\nPOTATOES AND ONIONS\nVegetables such as potatoes, onions and winter squash can all be stored in a cool, dry place.\nShallots and garlic can be left out of the fridge for around two weeks.\nCORDIAL\nDespite many people storing cordials and fruit squash in the fridge, they are fine left in the kitchen cupboard.\nMost fruit cordials contain preservatives such as potassium sorbate or sulphites, which are designed to be stored on shelves.","url":"https://www.dailymail.co.uk/femail/food/article-4319952/Why-NEVER-eggs-rack-fridge.html"}
