{"authors":["Laurel Rosenhall","Dan Morain","Robbie Short"],"date_download":"2018-10-30 23:16:50","date_modify":"2018-10-30 23:16:50","date_publish":"2016-03-16 08:00:00","description":"Democracy has a price. And at the moment, it’s higher than ever in California. With a presidential election coming up this fall, dozens of groups are","filename":"data/vaneerConsumption/Whyyoursignatureisworthmorethanever.json","image_url":"https://calmatters.org/wp-content/uploads/favicon-150x150.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540941410.html","title":"Why your signature is worth more than ever","title_page":"Why your signature is worth more than ever | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Democracy has a price. And at the moment, it’s higher than ever in California.\nWith a presidential election coming up this fall, dozens of groups are trying to get measures on the ballot — asking voters to sanction recreational marijuana, stiffen gun controls, increase cigarette taxes and pass numerous other laws.\nThe competition among them has created an unprecedented situation in California that’s driving up the cost of gathering the signatures necessary to get on the ballot. Some campaigns are paying double the rate of a typical year. It means that more than ever, access to the ballot is reserved for those with the most money.\n“I fully anticipate the prices will go higher and higher and it will definitely have an impact,” said Bill Carrick, a political consultant who recently stopped gathering signatures for a measure that sought to raise commercial property taxes to pay for services for the poor.\n“The ballot measures backed by large groups with access to financial resources, they will continue to pay high prices. But the more grassroots people are not going to have a chance at all.”\nIt’s another sign that California’s system of direct democracy has evolved far from its populist roots. When the state adopted the system more than 100 years ago, the goal was to empower citizens to make laws themselves and circumvent the powerful interests that held sway over the Legislature. Instead, ballot initiatives today are so expensive they are now primarily used by the same interests they were meant to avoid.\nIn past years, it would have cost $2 million to $3 million to collect enough signatures to qualify a constitutional amendment for the ballot, said Mike Arno, owner of Arno Petition Consultants. This year it will be more like $5 million to $7 million.\n“I’ve been doing this since 1979 and this is the weirdest year yet,” Arno said. “Everybody is experiencing horrendous pressure.”\nSeven measures already have enough signatures to get on the November ballot. Another 79 petitions have been approved to collect signatures. Campaign officials predict that voters will weigh in on about 20 measures this fall — more than double the number in most recent elections.\nOnly four companies in the state do the bulk of the work to manage petitions and hire crews to get signatures. And as the clock ticks closer to spring deadlines for getting on the ballot, competition for signatures is intensifying.\nThree factors combined to cause this year’s glut. First, higher turnout in a presidential election year tends to favor Democrats, encouraging left-leaning political causes that want to be on the ballot. Second, the Legislature decided a few years ago to prohibit initiatives on the June ballot, moving all of them to November.\nThe third factor is this year’s low threshold for the number of signatures it takes to qualify a measure for the ballot. The number is determined by votes cast in the last gubernatorial election, which was a record low in 2014.\nExacerbating pressure on the crowded field is a 2013 court ruling that limited where petitions can be circulated. Campaigns can no longer stand outside many grocery stores so they’re competing to find new places to nab voters.\n“There’s a perfect storm of factors that came together to raise the prices across the board,” said Dan Newman, a political consultant who is running campaigns for a gun safety ballot measure and Gov. Jerry Brown’s effort to change criminal sentencing.\nThe big money politics involving the cost of signature-gathering surfaced recently in a battle between the tobacco lobby and a coalition of health and labor groups pushing a ballot measure to raise the tax on cigarettes. Lobbyists for the Altria cigarette company threatened to spike signature-gathering prices to keep the $2-per-pack cigarette tax off the ballot, said Dustin Corcoran, head of the California Medical Association, one of the groups sponsoring the measure. They would do it by paying more than double the current price for signatures for a competing measure and hiring up all the signature-gathering firms.\n“They made clear that their goal was to drive up the signature price to make it impossible for us to qualify the $2 tax for the ballot,” Corcoran said.\nAltria lobbyists did not return calls for this story.\nDirect democracy has spawned an industry of political professionals who make a living from each step of the process. Most of the folks who stand on street corners asking you to sign petitions are paid for each signature they get. The price is fluid, depending on how hard it is to explain the measure to voters, how tight the deadline is to get signatures and how many other campaigns are vying for the service.\nIn recent election years, campaigns would typically pay about a dollar or two per signature. This year, many campaigns are paying $3 to $4. That raises the cost of putting an initiative on the ballot by between $2 million and $4 million because of the large number of signatures campaigns must submit.\n“It means a higher amount of money you’ve budgeted for your campaign is going for signature-gathering as opposed to voter contact later on. That’s unfortunate,” said Gale Kaufman, a political consultant who is running campaigns to legalize marijuana and extend income taxes approved four years ago by Proposition 30.\nBoth of those measures were among the stack of clipboards Joseph Maxhimer carried under his arm as he strolled the streets near the state Capitol this week on the hunt for signatures.\n“How ya doin today?” Maxhimer said as he approached hurried commuters. “Would you like to sign to support education? Legalize marijuana? Tobacco tax?”\nReactions\nA reader suggests a 21st-century change to California’s signature-gathering rules. Read his letter here.\nA reader says Oregon has a better model for gathering signatures. Read her letter here.","url":"https://calmatters.org/articles/why-your-signature-is-worth-more-than-ever/"}
