{"authors":[],"date_download":"2018-10-30 14:23:53","date_modify":"2018-10-30 14:23:53","date_publish":"2016-08-01 13:24:00","description":"Georgia law forbids motorists from driving past a stopped school bus. Motorists caught violating the law will pay a hefty fine.","filename":"data/vaneerConsumption/Whyyoushouldneverdrivepastaschoolbus.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/08/10/Images/photos.medleyphoto.7885526.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_why-you-should-n_38542b2401eb476753c5a29fd6b2d4cf__1540909433.html","title":"Why you should never drive past a school bus","title_page":"Georgia traffic law: Why you should never drive past a school bus","title_rss":"NULL","source_domain":"ajc.com","text":"Officials warn drivers: Stop for a school bus or pay a hefty fine.\nWhen a school bus stops and flashes its signals, all traffic in both directions must come to a halt, according to Georgia law.\nState law requires motorists traveling in both directions to stop for school buses that are loading and unloading (lights flashing and stop arm extended), unless the road is divided by a median. If there is a median, the vehicles traveling in the opposite direction of the bus aren’t required to stop.\nDrivers who violate the law will be fined $300 for the first offense. Motorists accumulate six points on their driving record for each violation, according to Georgia Department of Public Safety.\n» Interactive quiz: Find out how well you know the traffic rules about school bus safety\nWhen it is appropriate or illegal to pass a school bus? (AJC Graphic)\nIn an effort to crack down on violators, some metro Atlanta school districts have installed cameras on school buses to catch motorists in the act.\nClayton County, Cobb County, Decatur, Gwinnett County, Marietta and Atlanta are among the school districts that are using school bus cameras that film traffic violations.\nFulton County approved a proposal for school bus cameras in March.\n“Our children are really at risk,” Fulton County Commission Chairman John Eaves said at a meeting in March.\nGwinnett officials said the county issued 23,307 citations and collected about $2 million in fines in 2015 by using the news camera system.\n» Read the excuses motorists gave to a judge after being caught by school bus cameras","url":"https://www.ajc.com/news/local/why-you-should-never-drive-past-stopped-school-bus-georgia/SfpBlGUwBFGB5eQt1HsKpK/"}
