{"authors":["Lisa Ryan For Dailymail.Com"],"date_download":"2018-10-23 03:02:24","date_modify":"2018-10-23 03:02:24","date_publish":"2016-01-11 15:30:59","description":"Columbia University and Mt. Sinai Medical Center experts told Daily Mail Online how hormones cause the darkening of penises and nipples for men - and areolas and labia for women.","filename":"data/vaneerConsumption/Whyyourpenisandnipplesaredarkerthantherestofyourskin.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/08/19/2FED2A8400000578-0-image-a-6_1452280639680.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3390863_Revealed-penis-nipples-darker-rest-skin-Sex-hormones-trigger-pigmentation-puberty-sign-diabetes_1540263744.html","title":"Why your penis and nipples are darker than the rest of your skin","title_page":"Why your penis and nipples are darker than the rest of your skin | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"estrogen can cause a woman's labia and aerola to darken\nHave you ever wondered why your genitals are darker than the rest of your body?\nRegardless of race, a person's penis and nipples, areolas and labia are naturally a shade or two deeper in color than their skin.\nAnd the reason? Darkening occurs during puberty, experts told Daily Mail Online.\nAs sex hormones surge through the body they stimulate the production of melanin - the amino acid responsible for hair and skin color.\nThe result is for the skin on a man's penis and nipples and a woman's areolas and labia, to darken.\nWhile the process is a natural one, experts warn, any further darkening in adulthood could be a sign of the chronic illness, diabetes.\nDr Lindsey Bordone, a dermatologist at Columbia University Medical Center in New York, told Daily Mail Online: ‘Your skin can darken in certain areas when your sugars are very high – and you’re developing diabetes.’\nIt's common for men and women to have genitals and nipples that are darker than the rest of their skin, experts reveal. The change in pigmentation largely occur because sex hormones stimulate production of melanin during puberty\nIn childhood a person generally has lighter pigmentation all over – regardless of race.\nFor instance, some people are born with blonde hair that later turns brown.\nDr Bordone said: ‘When girls are young, their nipples are light. And as they get older, hormones have an effect and the nipples darken.\n‘It’s very similar for boys.’\nBut, when puberty kicks in, women experience an increase in estrogen, while men experience an influx of testosterone.\nThose hormones regulate melanocytes – which are skin cells that produce melanin, said Dr Cameron Rokhsar, an associate clinical professor of dermatology at Mt. Sinai Medical Center in New York.\nYour skin can darken in certain areas when your sugars are very high – and you’re developing diabetes Dr Lindsey Bordone, a dermatologist at Columbia University Medical Center\nDr Rokhsar told Daily Mail Online: ‘Hormones regulate the way melanocytes produce their pigment.\n‘Those can have an effect on the way the skin in that area pigments, so generally that area is darker.’\nHormones can also affect pigmentation in adulthood, especially in women.\nWhen a woman is pregnant – or goes on birth control pills – she can experience heightened levels of estrogen.\nThat increase in hormones can cause pigmentation in a woman's face.\nDr Rokhsar added: ‘In pregnancy, women can also develop a dark line on their abdomen.’\nFurthermore, external factors – especially friction – can affect pigmentation after puberty.\nWhen the skin experiences friction, it naturally thickens to protect itself, she explained.\nSkin darkening can also occur because of friction, for the skin naturally thickens to protect itself. But, darkening can also be a sign of health problems, such as diabetes and obesity\nAnd so, genital darkening occurs in men who wear tight clothing, shave their genitals or experience an itch or infection that results in rubbing and scratching.\nThis darkening can particularly affect athletes, because their genital area undergoes constant friction from running or jumping.\nDr Bordone said: ‘Around the sides of the scrotum or the inner thighs, a lot of times men will have darkening of the skin if they’re active.’\nBut even though darkening is natural, it can also be a symptom of larger health issues.\nWhen a person gains weight, he or she can experience acanthosis nigricans, which is a skin condition that leads to velvety discolorations in the groin and other areas, according to Dr Rokhsar.\nAdditionally, certain discolorations are indicative of increased levels of insulin.","url":"https://www.dailymail.co.uk/health/article-3390863/Revealed-penis-nipples-darker-rest-skin-Sex-hormones-trigger-pigmentation-puberty-sign-diabetes.html"}
