{"authors":["Alexandra Thompson Health Reporter For Mailonline"],"date_download":"2018-10-23 00:03:55","date_modify":"2018-10-23 00:03:55","date_publish":"2017-04-26 09:16:03","description":"Scientists found that nasal mucus' rich reservoir of 'good' bacteria prevents cavity-causing bacteria from sticking to teeth and may be nature's way of saying we are deficient.","filename":"data/vaneerConsumption/WhyYOUshouldpickyournoseandeatthebogies.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D64F600000578-0-image-a-11_1493194211216.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4446602_Why-pick-nose-eat-it_1540253035.html","title":"Why YOU should pick your nose and eat the bogies","title_page":"Why YOU should pick your nose and eat the bogies | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"We're taught from a young age that picking our nose is a disgusting habit.\nNot only do we think its unhygienic, but having a good rummage could tear our nostrils' fragile skin, as well as increasing the risk of developing a painful sinus infection.\nYet, a study has revealed people who pick their noses may actually be healthier - giving good reason for children to carry on with the disgusting habit.\nAustrian lung specialist Professor Friedrich Bischinger, said: 'Eating the dry remains of what you pull out is a great way of strengthening the body's immune system. Medically it makes great sense and is a perfectly natural thing to do.\n'In terms of the immune system, the nose is a filter in which a great deal of bacteria are collected, and when this mixture arrives in the intestines it works just like a medicine.'\nPicking your nose and eating it may strengthen your immune system - and could prevent HIV\n'GOOD' BACTERIA 1) SKIN BACTERIA: Micrococcus luteus In 2013, Norwegian researchers found M. luteus can absorb the same wavelengths that trigger skin cancers. 2) GUT BACTERIA: Bifidobacterium animalis B. animalis lives in the intestine. It enhances immunity, fights tumour growth, improves digestions and may lower cholesterol. 3) DAIRY BACTERIA: Streptococcus thermophilus S. thermophilus is used as a probiotic and relieves abdominal cramps, diarrhoea, nausea and other lactose intolerance symptoms.\nScientists found that nasal mucus' rich reservoir of 'good' bacteria prevents cavity-causing bacteria from sticking to teeth.\nPublished in the American Society for Microbiology, their findings also suggest snot could defend against respiratory infections, stomach ulcers and even HIV.\nThe researchers are working on a synthetic mucus toothpaste to harvest snot's dental benefits, Kidspot reports.\nBogie-inspired chewing gum may also be in the pipeline.\nThis builds on previous research that suggests our obsession with hygiene has led to an increase in allergies and autoimmune disorders, such as arthritis.\nYet, feasting on some nasal mucus may be perfectly naturally.\nDr Scott Napper, professor of biochemistry, the University of Saskatchewan, Canada, said: ‘Nature pushes us to do different things because it is to our advantage to have certain behaviours, to consume different types of foods.\n'So maybe when you have an urge to pick your nose and eat it, you should just go with nature.\n'From an evolutionary perspective, we evolved under very dirty conditions and maybe this desire to keep our environment and our behaviours sterile isn't actually working to our advantage,' CBC News reported.","url":"https://www.dailymail.co.uk/health/article-4446602/Why-pick-nose-eat-it.html"}
