{"authors":["Press Association"],"date_download":"2018-10-23 03:07:01","date_modify":"2018-10-23 03:07:01","date_publish":"2017-04-26 14:29:23","description":"The 24-year-old has profited from Sam Billings´ departure to the Indian Premier League.","filename":"data/vaneerConsumption/WicketkeeperAdamRousesignsnewKentdeal.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/14/wire-465449-1493213365-104_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447832_Wicketkeeper-Adam-Rouse-signs-new-Kent-deal_1540264021.html","title":"Wicketkeeper Adam Rouse signs new Kent deal","title_page":"Wicketkeeper Adam Rouse signs new Kent deal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former Hampshire and Gloucestershire wicketkeeper Adam Rouse has signed a new contract at Kent.\nThe 24-year-old has profited from Sam Billings’ departure to the Indian Premier League and struck a career-best unbeaten 95 in Kent’s recent Specsavers County Championship Division Two win over Derbyshire.\nRouse told the club’s official website: “I’m really happy to have committed my future to Kent, and delighted that the club have shown faith in me.\n“I’m enjoying my role right now and with Sam Billings away it’s given me a nice opportunity to figure out my game and develop as a player.\n“The coaches and I spoke a lot in the winter about my targets, and my main aim now is to push for a regular first-team spot in all formats; whether that is with the gloves or just with the bat.”\nHead coach Matt Walker added: “He’s kept brilliantly and scored some vital runs since he joined the club.\nAdam Rouse at the crease for Kent (John Walton/PA)\n“Adam worked very hard this winter and has never had a full pre-season preparation so far in his career.\n“Adam has shown some great signs in the last 18 months and he is a very popular character in our dressing room.”","url":"https://www.dailymail.co.uk/wires/pa/article-4447832/Wicketkeeper-Adam-Rouse-signs-new-Kent-deal.html"}
