{"authors":["Matilda Rudd For Daily Mail Australia"],"date_download":"2018-10-22 23:31:56","date_modify":"2018-10-22 23:31:56","date_publish":"2017-03-10 03:16:09","description":"Peter Von Maltzahn was selling his peach-coloured Kombi for $39,500. He couldn't bare to keep it after making so many memories with his late wife in it, so sold it for half the price to travelling couple.","filename":"data/vaneerConsumption/WidowersellsKombitocoupleonconditiontocherishit.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/04/3E1FC84700000578-0-image-a-26_1489119843097.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4299566_Widower-sells-van-couple-condition-cherish-it_1540251116.html","title":"Widower sells Kombi to couple on condition to cherish it","title_page":"Widower sells Kombi to couple on condition to cherish it | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A widower has given his $39,500 Kombi van away for half price to a young couple after they agreed to his one condition.\nElise Cook, 26, and her husband Domenic, 29, have moved out of their South Australian home and are now living in the van, named 'Scout', after they promised its owner Peter Von Maltzahn that they would have 'many, many' adventures in it like he enjoyed with his late wife.\nElise was dreaming of experiencing 'van life' the day she googled 'Volkswagen Kombi' in 2015.\nElise Cook, 26, owes one special widower for her 'van life' purchase back in 2015\n'Scout', the name of the couples peach-coloured van, has taken them right across Australia running their winery business\nBut it wasn't always looking like a sure thing: 'Most of the vintage VW vans for sale in South Australia read along the lines of “great family van, starts sometimes…” or “moves when in neutral”\nHer husband was aware of her goal of getting away from it all, with photos of the idyllic movement becoming increasingly popular on Instagram.\n'Occasionally I would scroll through sale ads online much in the same way one dreams about winning the lottery,' Ms Cook told Daily Mail Australia.\n'Most of the vintage VW vans for sale in South Australia read along the lines of “great family van, starts sometimes…” or “moves when in neutral\".\n'While these vans sounded like a great time as soon as I saw the ad for \"'Scout'' I had to calm my racing heart.\n'A Westfalia campervan in beautiful condition, no rust, a V6 Holden engine that has her running like a dream and strong enough to tow a caravan, a completely original interior, and one owner since the year she was made in 1972.'\nThe pair have added quirky interior decorations but haven't altered the overall design of the Kombi\n'I somehow convinced Dom to come and look with me - just to look. He repeated about twenty five times on the way there that I should by no means get my hopes up, as this van was way out of our budget,' said Ms Cook\nWhen they met the Kombi's owner Peter Von Maltzahn the three swapped stories about their adventures and how incredible a van is for getting around\nThe only problem was the price. It was on sale for $39,500 and too expensive for the young couple to afford.\n'I somehow convinced Dom to come and look with me - just to look. He repeated about twenty five times on the way there that I should by no means get my hopes up, as this van was way out of our budget, completely impossible and off the cards,' she said.\nWhen they met Mr Von Maltzahn the three swapped stories about their adventures and how incredible a van is for getting around.\nThe Dutch-South African owner bought the Kombi in 1972 after marrying his wife in Germany. They travelled right across Europe in the van before bringing it to South Africa where they lived for many years.\nThe Kombi comes with a life time guarantee that the married couple must go on 'many, many adventures'\nWhen they met the Kombi's owner Peter Von Maltzahn the three swapped stories about their adventures and how incredible a van is for getting around\nTwenty five years ago the pair moved to Australia and started a family, bringing their beloved Kombi with them.\nMs Cook said: 'He told us it had been places and seen things that would make the most seasoned traveller envious.\n'We left, grateful to have met Peter and his beautiful van, but unable to put an offer in.'\nJust over a week later Mr Von Maltzahn called the couple and asked them to come and take another look.\nElise Cook, 26, loves the 'van lifestyle' the couple have created and posts about her experiences on social media\nA bed sits in the back of the Kombi while the front houses some of their kitchen utensils and appliances\n'We drove there, with Dom again tenderly telling me not to get my hopes up, we couldn’t afford it right now, and please not to start crying again,' said Ms Cook of the day they bought Scout\n'We drove there, with Dom again tenderly telling me not to get my hopes up, we couldn’t afford it right now, and please not to start crying again.\nPeter told the pair he had received two offers for his original asking price.\n'My heart sank. Why were we here?' thought Ms Cook.\n'He told us that both the offers where from men who were collectors. His van would sit in a shed, collecting dust, or on display, or perhaps even have some work done to spruce her up.\n'He asked us, in all seriousness, what we could afford. While I sat at the table silently, my heart racing, Dom said to Peter that he meant no offence, but the most we could spend was around half of what he was asking.'\nThe couple ended up paying half of the original asking price for the van\nElise and Domenic have moved out of their South Australian home and are now living in the van, named 'Scout' because Mr Von Maltzahn told them it was for 'scouting around'\n'He told us that the idea of the Kombi going to a young married couple, beginning their lives together, just like he and his wife when they bought it together back in '72, meant so much to him'\nThat's when Mr Von Maltzahn revealed the true reason for the sale.\n'His wife, with whom he’d shared every van experience, had recently passed away.\n'Peter's daughters, now adults, had finally agreed and understood why he couldn’t bear to keep the van. Too many memories held within it, and the time had come.\n'He told us that the idea of the Kombi going to a young married couple, beginning their lives together, just like he and his wife when they bought it together back in '72, meant so much more to him.\n'With tears in his eyes he told us he would accept our offer, but only on one condition.\n'I told him we would do anything. He said, \"You have to promise me you'll have adventures and when you have your own children you have to take them on many, many adventures”,' Ms Cook said.\nNo day is the same in their van Scout with the couple enjoying long talks with other van-goers and getting bogged more than once\n'I can’t say I’ve ever sat behind the wheel of our Kombi without feeling an overwhelming sense of happiness. Hand to heart it happens every time,' said Ms Cook\nElise's husband Domenic initially told her 'not to get her hopes up' because the van was out of their budget\nThe couple, who paid just $19,500 for the peach-coloured vehicle, instantly agreed.\nElise and Domenic plan to travel around Australia in the van this year while running their winery, Down The Rabbit Hole.\n'I can’t say I’ve ever sat behind the wheel of our Kombi without feeling an overwhelming sense of happiness. Hand to heart it happens every time.\n'It’s not just that people stop and smile at me as we drive leisurely by, or that she brings a sense of freedom reminiscent of a Bob Marley number, or that every time I pass a fellow Kombi owner there are friendly waves exchanged, or that she’s made life a constant holiday... it’s not even the fact that the big bay window provides a fantastic view of whatever we’re passing.\n'It’s because the day we drove her home, she became part of our little family,' said Ms Cook.\nIt hasn't always been easy living in the van but it has certainly brought the pair closer\nThey can't wait to go back to Peter Von Maltzahn and tell him exactly what kind of adventures they've been on\nA stray possum bashing on their Kombi bay window is just one of the crazier stories Elise and Domenic can tell Peter about when they meet up with him again\nIt hasn't always been easy living in the van but it has certainly brought the pair closer.\n'One night we camped in a very remote location with nothing and no one for miles. We woke to discover a little black car parked right next to us. I thought it was super odd and started to imagine scenes out of a horror movie.\n'We fell back asleep and then both woke when we heard something on the front door. Dom has previously put me to sleep by telling me it was okay, he was there to protect me.\nUh-oh! 'My legs felt like they were going to give way but I kept telling myself, \"I am not going down without a fight\" said Ms Cook one night when the couple encountered a possum\nThe van is a great way to meet people and tell stories said the 26-year-old business owner\nWhat started as a pipe dream became a reality when Elise Cook met Peter Von Maltzahn\n'Well he was straight under the covers while I climbed into the front with our kitchen knife and torch. My legs felt like they were going to give way but I kept telling myself, \"I am not going down without a fight.\" I was totally convinced we were living out my worst nightmare.\n'When I lifted the curtain and flicked on the torch, I was met with two huge eyes staring straight me. I screamed. It was the biggest possum I had ever seen! Turns out the other car just thought we looked friendly in our Kombi and would make a good sleeping buddy.\n'So yes. Many adventures,' she said.","url":"https://www.dailymail.co.uk/femail/article-4299566/Widower-sells-van-couple-condition-cherish-it.html"}
