{"authors":["Associated Press"],"date_download":"2018-10-22 20:39:43","date_modify":"2018-10-22 20:39:43","date_publish":"2016-01-28 02:39:37","description":"CHICAGO (AP) — The widow of a disgraced Illinois police officer who staged his suicide to appear he was gunned down in the line of duty, sparking an intensiv...","filename":"data/vaneerConsumption/WifeofIllinoisofficerwhostagedsuicideindicted.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:1bbb9e914f23452c89bcd37bb95bc9f1-2vdWmEltwXfba0ce28e6322e8eb1-585_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419969_Wife-Illinois-officer-staged-suicide-indicted_1540240783.html","title":"Wife of Illinois officer who staged suicide indicted","title_page":"Wife of Illinois officer who staged suicide indicted | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Wife of Illinois officer who staged suicide indicted\nCHICAGO (AP) — The widow of a disgraced Illinois police officer who staged his suicide to appear he was gunned down in the line of duty, sparking an intensive manhunt, was indicted Wednesday on charges of assisting her husband in siphoning money from a youth program.\nMelodie Gliniewicz, 51, turned herself in at the Lake County Sheriff's Office when she learned of the grand jury indictment, said Detective Christopher Covelli, a sheriff's office spokesman. She was taken to the county jail Wednesday afternoon. Her bond was set at $50,000.\nHer husband, Fox Lake Police Lt. Charles Joseph Gliniewicz, died Sept. 1. Authorities said he shot himself because he feared discovery of embezzlement from the Fox Lake Police Explorer Post.\nFILE - In this Sept. 2, 2015 file photo, Melodie Gliniewicz, the wife of Fox Lake Police Lt. Charles Joseph Gliniewicz, leaves with her family during a vigil to honor her husband in Fox Lake, Ill. Authorities later said Gliniewicz staged his suicide to look like a homicide after embezzling from a youth program. On Wednesday, Jan. 27, 2016, a grand jury indicted Melodie Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit. (AP Photo/Nam Y. Huh, File)\nThe officer's death touched off a manhunt involving hundreds of officers and raised fears that several killers were on the loose in northern Illinois. Joe Gliniewicz was initially hailed as a community hero and praised for his work with the youth program. At the time, Melodie Gliniewicz's tearfully told hundreds of people gathered at a candlelight vigil that Gliniewicz had been her \"hero' and her \"rock.\"\nTwo months after Gliniewicz' death, authorities announced that he had killed himself after embezzling from the village's Police Explorer program for seven years, prompting tough questions about why it had taken so long to reach that conclusion.\nThe Lake County State's Attorney's office said in announcing the indictment of Melodie Gliniewicz that money from the police explorer's account was used for expenses including more than 400 restaurant charges, personal payments to a Starbucks and a local theater as well as a trip to Hawaii.\n\"The investigation revealed money was withdrawn from the police explorer account over the course of several years,\" Lake County Undersheriff Ray Rose said.\nMelodie Gliniewicz was indicted on charges of money laundering and disbursing charitable funds without authority and for personal benefit.\nJoe Gliniewicz had run the Explorer program for teens interested in possible careers in law enforcement. Authorities said Melodie Gliniewicz served as an adviser to the Explorer Post and had a fiduciary role with the program's finances.\nIn November, an official with knowledge of the investigation provided to the media some of the text and Facebook messages exchanged between the officer and his family. In one message on April 14, a worried Joe Gliniewicz and his wife discussed whether someone would review the finances of the explorer program.\n\"...maybe we need to hide the funds some how,\" Melodie Gliniewicz said in one of those messages.\nIn a statement, attorneys for Melodie Gliniewicz vehemently denied that she took part in her husband's scheme. \"Melodie is a victim of her husband's secret action and looks forward to her day in court to show the world her innocence,\" said the law firm of Kelleher & Buckley.\nCovelli said the couple's son, D.J. Gliniewicz, was not a suspect in the financial scheme and the son had \"no idea the money was coming from this account.\"\n\"Fox Lake, all of Lake County, and quite frankly the entire country have been through a mix of emotions throughout the Gliniewicz investigations,\" said Lake County Sheriff Mark Curran. \"It is my hope the community can continue healing and rebuilding.\"\n___\nThis story was corrected to move the dateline to Chicago from Fox Lake, Ill.\n___\nWriter Carla K. Johnson contributed to this report.\nMelodie Gliniewicz, right, of Antioch,Ill., appears at the Lake County sheriff's office after she was indicted in Waukegan, Ill., by a Lake County grand jury. The grand jury on Wednesday, Jan. 27, 2016, indicted the 51-year-old Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit. (Gilbert R. Boucher II/Daily Herald via AP)\nMelodie Gliniewicz, right, of Antioch,Ill., appears at the Lake County sheriff's office after she was indicted in Waukegan, Ill., by a Lake County grand jury. The grand jury on Wednesday, Jan. 27, 2016, indicted the 51-year-old Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit. (Gilbert R. Boucher II/Daily Herald via AP)\nDetective Chris Covelli, left, of the Lake County Sheriff's office speaks aabout the wife of disgraced Fox Lake police Lt. Charles Joseph Gliniewicz. Melodie Gliniewicz, 51, of Antioch,Ill., appeared at the Lake County sheriff's office after she was indicted in Waukegan, Ill., by a Lake County grand jury. The grand jury on Wednesday, Jan. 27, 2016, indicted the 51-year-old Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit. (Mark Welsh/Daily Herald via AP)\nMelodie Gliniewicz, 51, of Antioch,Ill., appears at the Lake County sheriff's office after she was indicted in Waukegan, Ill., by a Lake County grand jury. The grand jury on Wednesday, Jan. 27, 2016, indicted the 51-year-old Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit. (Mark Welsh/Daily Herald via AP)\nMelodie Gliniewicz, 51, of Antioch,Ill., appears at the Lake County sheriff's office after she was indicted in Waukegan, Ill., by a Lake County grand jury. The grand jury on Wednesday, Jan. 27, 2016, indicted the 51-year-old Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit. (Mark Welsh/Daily Herald via AP)\nMelodie Gliniewicz, 51, of Antioch,Ill., appearars at the Lake County sheriff's office after she was indicted in Waukegan, Ill., by a Lake County grand jury. The grand jury on Wednesday, Jan. 27, 2016, indicted the 51-year-old Gliniewicz on felony counts of money laundering and disbursing charitable funds without authority for personal benefit. (Mark Welsh/Daily Herald via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3419969/Wife-Illinois-officer-staged-suicide-indicted.html"}
