{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 18:27:07","date_modify":"2018-10-30 18:27:07","date_publish":"2015-04-19 14:45:12","description":"Wife of Gyrocopter Pilot arrested in D.C. Says Husband is 'A Patriot'","filename":"data/vaneerConsumption/WifeofGyrocopterPilotarrestedinDCSaysHusbandisAPatriot.json","image_url":"https://media.breitbart.com/media/2015/04/gyrocopter-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_19__1540924027.html","title":"Wife of Gyrocopter Pilot arrested in D.C. Says Husband is 'A Patriot'","title_page":"Wife of Gyrocopter Pilot arrested in D.C. Says Husband is 'A Patriot'","title_rss":"NULL","source_domain":"breitbart.com","text":"The wife of a Florida man who was arrested after he landed a one-man gyrocopter on the west lawn of the U.S. Capitol building to protest money in politics insists that her husband is a patriot.\nWhile she says that she was not aware that her husband was going to attempt the illegal flight to Washington, Alena Hughes nonetheless believes that her husband is a “patriot” who “loves his country.”\n“I think he’s a patriot and I’m proud of him,” Mrs. Hughes told the media.\nStill, the whole incident has been “stressful,” Alena said.\nDoug Hughes, 61, a post office employee from Tampa Bay, Florida, told Capitol police that his gyrocopter mission was to highlight “money in politics” and he intended to deliver a letter to each member of Congress to urge them to initiate campaign finance reform.\nSince his arrest, the 61-year-old also claimed that the 2012 suicide of his son, John Joseph, also motivated him to make his protest flight.\nHughes hired an attorney in Washington, but Mrs. Hughes also hired Paul Carr, her own attorney, just in case.\nMrs. Hughes’ attorney had an interesting take on Mr. Hughes’ actions. “Tell me what restrictions mailmen have to deliver mail,” Carr said. The attorney went on saying, “He has a right to deliver mail. In fact, it’s his obligation.”\nPurportedly getting money out of politics has been a long-time goal of the left-wing. But Hughes is fighting against several Supreme Court decisions that holds that donating to politicians and political causes equates to a protected right of free speech.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com","url":"https://www.breitbart.com/politics/2015/04/19/wife-of-gyrocopter-pilot-arrested-in-d-c-says-husband-is-a-patriot/"}
