{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-22 23:22:37","date_modify":"2018-10-22 23:22:37","date_publish":"2016-01-28 12:12:02","description":"Retired bank manager Raymond Shepherd, 76, and his wife Paula Shepherd, 70, were found dead next to each other on the bedroom floor of their home in Locks Heath, Hampshire.","filename":"data/vaneerConsumption/Wifesodistraughtatfindinghusbandsbodyshediednexttohim.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA8B8F00000578-0-image-a-21_1453986482715.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420825_Wife-distraught-finding-husband-s-body-gave-live-died-him_1540250557.html","title":"Wife 'so distraught at finding husband's body she died next to him'","title_page":"Wife 'so distraught at finding husband's body she died next to him' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A devoted wife who found the body of her husband in their home was so heartbroken she may have 'given up' the will to live and died next to him, an inquest heard today.\nRetired bank manager Raymond Shepherd, 76, and his wife Paula Shepherd, 70, were found dead next to each other on the bedroom floor of their home in Locks Heath, Hampshire in April last year.\nWhen police were called to the house after an estate agent raised the alarm, they discovered bloodstains in the hallway between the bedroom and bathroom of their bungalow home.\nRaymond and Paula Shepherd were found dead next to each other in their Hampshire home in April last year\nThey found the body of Mr Shepherd, which had badly decayed, was partially covered with a duvet while Mrs Shepherd was lying next to him on the floor in her night dress.\nA coroner today said housewife Mrs Shepherd must have 'collapsed' after seeing her husband's body, adding: 'She couldn't see a future without him.'\nThe couple, who were married for over 40 years and regularly went on cruises abroad, had a history of ill health, Portsmouth Coroner's Court heard.\nAddressing Mr Shepherd's daughter Alison White, senior coroner David Horsley said: 'Your father has had an episode, perhaps linked to his heart disease and has died.\n'Your step mother saw him as the anchor and I think she's sadly gone to pieces. It's a strong possibility to me that she's given up.\n'Her world had collapsed totally without him. They had been together a long time and I think she couldn't see a future without him.\n'I'm satisfied her death, like his, is due to natural causes. We can't imagine what went on in the time between the deaths and it's such a tragedy.'\nHe concluded they died from natural causes.\nThe couple were found next to each other on the bedroom floor of their home in Locks Heath, Hampshire\nThe last people to see the couple alive were paramedics on March 18 last year when they were called after Mr Shepherd, who used a mobility scooter, fell at home.\nTheir bodies were eventually discovered when estate agent Suzanne Ashman, who was handling the sale of their home, raised the alarm on April 7 - 20 days later.\nShe told the inquest the Shepherds had failed to answer any correspondence over the sale of their home, which was due to go ahead a week earlier on April 1.\nMr Shepherd's daughter Alison White also visited their home on Easter Sunday during that time because it was 'unusual' for her father and stepmother not to give her children an Easter egg.\nBut because the couple were so well travelled and often went on cruises 'at the drop of a hat', no one suspected the tragic events which had unfolded.\nMr Shepherd's daughter Alison White (left) attended the inquest this week. A coroner told her he believed her step mother had 'collapsed' with grief after finding her husband's body\nMrs Ashman said when she arrived at their home on April 7 to check on their welfare, there was no that anyone was in.\nShe said: 'I walked down the side of the property and there was a small window open. I was walking when I hit a smell of something not very nice.\n'I was hoping it was drains so I went back to the front of the bungalow, I unlocked the door and I went into the porch.\n'There were a few bits of post on the floor so I put them on a chair in the porch.\n'It was really dark in there. The smell hit me and I didn't go over the threshold. It looked like there were blood stains in between the bedroom and bathroom.\n'I said to my colleague, who said we should go further, that it could be a crime scene.'\nHampshire Constabulary's major crime team determined there were no suspicious circumstances surrounding their deaths.\nThe inquest heard 5ft 7in Mr Shepherd was diabetic, suffered from gout and arthritis, had a pacemaker fitted and was confined to a wheelchair.\nHe had a knee and hip replacement but his GP said he would be unlikely to survive any future operations under general anaesthetic.\nMeanwhile Mrs Shepherd, who was about 5ft 4in, was diagnosed with epilepsy and had recently suffered a seizure before her death.\nDr Basil Purdue, a consultant pathologist, said of Mrs Shepherd: 'It seems certain she survived him by quite a number of days.\n'The placing of a duvet may suggest some attempt on her behalf of covering him up.\n'It isn't clear why she didn't summon help, but the imminent house move and the sudden realisation of losing her partner may have rendered her seriously confused which would account for her actions.'\nHe added: 'It may be she despaired and chose to lay by her husband, having a final seizure, and she may have given up the will to live.\n'But I don't want to speculate too far. The circumstances were very distressing for her and that stress may have been enough to precipitate a seizure that ultimately proved fatal.'","url":"https://www.dailymail.co.uk/news/article-3420825/Wife-distraught-finding-husband-s-body-gave-live-died-him.html"}
