{"authors":["Charlie Nash"],"date_download":"2018-10-30 18:51:27","date_modify":"2018-10-30 18:51:27","date_publish":"2016-07-22 16:02:58","description":"WikiLeaks have released 19,252 leaked emails from the US Democratic National Committee today, in the latest of their DNC/Clinton leaks.","filename":"data/vaneerConsumption/WikiLeaksReleaseOver19000LeakedEmailsFromTheDemocraticNationalCommittee.json","image_url":"https://media.breitbart.com/media/2016/07/wikileaks.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_07_22__1540925487.html","title":"WikiLeaks Release Over 19,000 Leaked Emails From The Democratic National Committee","title_page":"WikiLeaks Release Over 19,000 Leaked Emails From The Democratic National Committee | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WikiLeaks have released 19,252 leaked emails from the US Democratic National Committee today, adding to their collection of leaked emails from the Democratic Party and its presidential candidate Hillary Clinton.\n“Today, Friday 22 July 2016 at 10:30am EDT, WikiLeaks releases 19,252 emails and 8,034 attachments from the top of the US Democratic National Committee — part one of our new Hillary Leaks series” announced WikiLeaks on their website.\nThe leaks come from the accounts of seven key figures in the DNC: Communications Director Luis Miranda (10770 emails), National Finance Director Jordon Kaplan (3797 emails), Finance Chief of Staff Scott Comer (3095 emails), Finanace Director of Data & Strategic Initiatives Daniel Parrish (1472 emails), Finance Director Allen Zachary (1611 emails), Senior Advisor Andrew Wright (938 emails) and Northern California Finance Director Robert (Erik) Stowe (751 emails). The emails cover the period from January last year until 25 May this year.\nVisitors to the site can navigate the nearly 20,000 emails and attachments by using a search bar that allows users to input keywords that may appear in the documents.\nWikiLeaks previously released over 1,000 Iraq war related emails sent both from and to Democratic presidential candidate Hillary Clinton earlier this month, and released another searchable database of over 30,000 leaked emails from Clinton’s private server in March.\nIn June, WikiLeaks founder Julian Assange announced his plans to release enough evidence to indict Clinton, and branded the Democratic candidate as “a bit of problem for freedom of the press” after she attempted to prosecute the site.\nCharlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.","url":"https://www.breitbart.com/tech/2016/07/22/wikileaks-release-19000-leaked-emails-democratic-national-committee/"}
