{"authors":["Kipp Jones"],"date_download":"2018-10-30 19:38:02","date_modify":"2018-10-30 19:38:02","date_publish":"2015-04-18 18:50:50","description":"Leonardo DiCaprio is again being accused of hypocrisy after reports that he boarded a private jet six times in a six-week period last year.","filename":"data/vaneerConsumption/WikileaksEnvironmentalistLeonardoDiCaprioFlewPrivateJet6Timesin6Weeks.json","image_url":"https://media.breitbart.com/media/2015/03/Leonardo-DiCaprio-AP-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_04_18__1540928282.html","title":"Wikileaks: Environmentalist Leonardo DiCaprio Flew Private Jet 6 Times in 6 Weeks","title_page":"Wikileaks: Environmentalist Leonardo DiCaprio Flew Private Jet 6 Times in 6 Weeks | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hollywood superstar and staunch environmentalist Leonardo DiCaprio is again being accused of practicing hypocrisy after it was reported he boarded a private jet six separate times in a six-week period last year.\nWhile things for Sony Pictures may have finally blown over publicly in the months since the hacking scandal that overtook the studio in November, Thursday, Wikileaks published a searchable database of 173,132 emails and 30,287 separate documents taken from Sony last year.\nRadar Online reports some of the documents included corporate travel records for the studio, and they show that DiCaprio took six roundtrip private jet flights during April and May 2014, all paid for by Sony.\nAccording to the leaked docs, 0n April 17, 2014, Leo flew from Los Angeles to New York at a cost of $63,000 for a filmmaker’s meeting that, it was noted, could only be done in person.\nTen days later, his then-girlfriend Toni Garrn was listed as a guest on the return flight to Los Angeles, with an additional cost of $63,000, plus $3,000 in food catering and $300 spent on car service.\nOn May 4, Leo again flew from Los Angeles to New York, this time at a cost of $37,306.60, plus $1,506.60 in catering and $800 in car service. The site reports that trip was also listed as a “meeting.”\nHe then went back to Los Angeles on May 31, at a cost of $55,000. His mother Irmelin DiCaprio and friend Lukas Haas were also listed as expected passengers, per Radar Online.\nIt was announced in March that DiCaprio had partnered up with Netflix to create a series of environmental and conservation-themed documentaries, which are planned to air exclusively on the streaming service.\nJust two weeks ago, he went public with plans to transform his uninhabited private island off the coast of Belize into an eco-resort and conservation area, with hopes of “healing” the property and pampering its wealthy guests.\nLast September, Leo addressed the United Nations regarding climate change, where he said:\nI believe humankind has looked at climate change in that same way: as if it were a fiction, happening to someone else’s planet, as if pretending that climate change wasn’t real would somehow make it go away. …. None of this is rhetoric, and none of it is hysteria. It is fact. The scientific community knows it, Industry and governments know it, even the United States military knows it. The chief of the US navy’s Pacific command, admiral Samuel Locklear, recently said that climate change is our single greatest security threat.\nAs reported by Radar Online, in 2014, the Natural Resources Defense Council called The Wolf of Wall Street actor a “hypocrite” for traveling the world on private jets and mega-yachts, as seen in this video:","url":"https://www.breitbart.com/entertainment/2015/04/18/wikileaks-environmentalist-leonardo-dicaprio-flew-private-jet-6-times-in-6-weeks/"}
