{"authors":["Breitbart News"],"date_download":"2018-10-30 19:14:05","date_modify":"2018-10-30 19:14:05","date_publish":"2016-11-08 00:49:32","description":"A new email from Wikileaks shows the husband of CNN VP Virginia Moseley periodically sharing information with Hillary Clinton's campaign chairman John Podesta before the network publicly reported it. | Media","filename":"data/vaneerConsumption/WikileaksCNNExecsHusbandGavePodestaInsideInformation.json","image_url":"https://media.breitbart.com/media/2016/11/john-podesta-virginia-moseley-cnn-tom-nides.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2016_11_07__1540926845.html","title":"Wikileaks: CNN Exec's Husband Gave Podesta Inside Information","title_page":"Wikileaks: CNN Exec's Husband Gave Podesta Inside Information | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A new email from Wikileaks shows the husband of CNN VP Virginia Moseley periodically sharing information with Hillary Clinton’s campaign chairman John Podesta before the network publicly reported it.\nFrom the Daily Caller News Foundation:\nAn email released by WikiLeaks on Sunday shows that the husband of CNN vice president and [deputy] Washington bureau chief Virginia Moseley tipped the Clinton campaign off to a favorable poll just before its release last September.\n“Good CNN poll coming,” Thomas Nides, Moseley’s husband, wrote to Clinton campaign chairman John Podesta in a Sept. 20, 2015 email.\nNides served as deputy secretary of state under Clinton and is currently vice president at Morgan Stanley. His name has been floated for a possible high-level spot in a Clinton White House.\n“I’ll look forward to how that is spun,” Podesta responded to Nides, who remains close to Clinton. The email exchange was hacked from Podesta’s Gmail account.\nIt is not clear if Nides obtained the results of that particular poll from Moseley. But other email exchanges between Nides and Podesta show that he did obtain other poll results from his wife.\nRead the rest of the story here.","url":"https://www.breitbart.com/the-media/2016/11/07/wikileaks-cnn-execs-husband-gave-podesta-inside-information/"}
