{"authors":["Charlie Spiering"],"date_download":"2018-10-30 19:09:53","date_modify":"2018-10-30 19:09:53","date_publish":"2016-10-14 13:50:10","description":"Clinton campaign workers understood that such a speech would be a nightmare for her campaign, but Hillary was insistent that Bill be allowed to continue. | Politics","filename":"data/vaneerConsumption/WikiLeaksHillaryClintonTriedToSaveWallStreetSpeechAfterCampaignLaunch.json","image_url":"https://media.breitbart.com/media/2016/10/GettyImages-609580658.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_14__1540926593.html","title":"WikiLeaks: Hillary Clinton Tried To Save Wall Street Speech After Campaign Launch","title_page":"WikiLeaks: Hillary Clinton Tried To Save Wall Street Speech After Campaign Launch | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hillary Clinton staffers struggled to cancel a Bill Clinton speech to a wealthy Wall Street banking company, just days after she announced for president.\nCampaign workers understood that such a speech would be a nightmare for her campaign, but Hillary was insistent that Bill be allowed to continue.\n“Morgan Stanley is coming down–so we’re good to go,” campaign manager Robby Mook emailed John Podesta, Jennifer Palmieri, and Huma Abedin, on March 12, 2015.\nBut Abedin warned that Hillary Clinton would not be pleased, particularly after learning that Podesta was involved in getting the speech canceled.\n“HRC very strongly did not want him to cancel that particular speech,” she said. “I will have to tell her that WJC chose to cancel it, not that we asked.”\nMook argued that it would be a political risk, saying that Clinton’s speech would be “begging for a bad rollout.”\n“I would suggest that if she is determined to keep this speech that she talk with John because this is a very big deal in my view,” he wrote.\nHe continued:\nI know this is not the answer she wants, but I feel very strongly that doing the speech is a mistake–the data are very clear on the potential consequences. It will be three days after she’s announced and on her first day in Iowa, where caucus goes have a sharply more negative view of Wall Street than the rest of the electorate. Wall Street ranks first for Iowans among a list of institutions that “take advantage of every day Americans”, scoring twice as high as the general election electorate. I recognize the sacrifice and dissapointment (sic) that cancelling (sic) will create, but it’s a very consequential unforced error and could plague us in stories for months. People would (rightfully) ask how we let it happen.\nA half an hour later, Abedin emailed to note that Clinton finally agreed to cancel.\n“Just raised with her again. We are good to cancel esp if WJC is ok with it,” she wrote. “Just needed a cool down period.”","url":"https://www.breitbart.com/politics/2016/10/14/wikileaks-hillary-clinton-insisted-bill-clinton-wall-street-speech-campaign-launch/"}
