{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:13:31","date_modify":"2018-10-30 20:13:31","date_publish":"2016-10-12 15:46:54","description":"Emails written by Hillary Clinton’s now-campaign manager John Podesta and released by WikiLeaks show that in February of 2012, Podesta and the president of Voices for Progress discussed how to “plant the seeds of revolution” within the Catholic Church. | Politics","filename":"data/vaneerConsumption/WikiLeaksCatholicChurchMiddleAgesDictatorshipNeedRevolutionAgainstBishops.json","image_url":"https://media.breitbart.com/media/2016/10/GettyImages-610643318.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_12__1540930411.html","title":"WikiLeaks: Catholic Church ‘Middle Ages Dictatorship,’ Need ‘Revolution’ Against Bishops","title_page":"WikiLeaks: Catholic Church ‘Middle Ages Dictatorship,’ Need ‘Revolution’ Against Bishops | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sandy Newman, president of Voices for Progress wrote to Podesta in an email thread with the subject, “Opening for a Catholic Spring? Just musing…”\nHi, John,\nThis whole controversy with the bishops opposing contraceptive coverage even though 98% of Catholic women (and their conjugal partners) have used contraception has me thinking . . . There needs to be a Catholic Spring, in which Catholics themselves demand the end of a middle ages dictatorship and the beginning of a little democracy and respect for gender equality in the Catholic church. Is contraceptive coverage an issue around which that could happen. The Bishops will undoubtedly continue the fight. Does the Catholic Hospital Association support of the Administration’s new policy, together with “the 98%” create an opportunity?\nOf course, this idea may just reveal my total lack of understanding of the Catholic church, the economic power it can bring to bear against nuns and priests who count on it for their maintenance, etc. Even if the idea isn’t crazy, I don’t qualify to be involved and I have not thought at all about how one would “plant the seeds of the revolution,” or who would plant them. Just wondering . . .\nHoping you’re well, and getting to focus your time in the ways you want.\nSandy Newman, President\nVoices for Progress","url":"https://www.breitbart.com/politics/2016/10/12/wikileaks-catholic-church-middle-ages-dictatorship-need-revolution-bishops/"}
