{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 18:52:05","date_modify":"2018-10-30 18:52:05","date_publish":"2016-06-14 16:45:39","description":"Julian Assange claimed on Sunday that he is preparing to release another slate of emails recovered from Hillary Clinton's private server.","filename":"data/vaneerConsumption/WikileaksPlanningtoReleaseEnoughEvidencetoIndictHillaryClinton.json","image_url":"https://media.breitbart.com/media/2016/06/hillary-clinton-lip-bite-associated-press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_06_14__1540925525.html","title":"Wikileaks Planning to Release 'Enough Evidence' to Indict Hillary Clinton","title_page":"Wikileaks Planning to Release 'Enough Evidence' to Indict Hillary Clinton | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Julian Assange, the founder of Wikileaks, claimed on Sunday that he is preparing to release another slate of emails recovered from Hillary Clinton’s private server that could possibly provide enough evidence for her indictment.\nAssange’s comments came in an interview on ITV’s Peston on Sunday. He claimed that Wikileaks is preparing “upcoming leaks in relation to Hillary Clinton … We have emails pending publication, that is correct,” Assange said.\nAlthough Assange doesn’t believe that United States Attorney General Loretta Lynch will indict Hillary, he believes that “the FBI can push for concessions from the new Clinton government in exchange for its lack of indictment.”\n“She’s not going to indict Hillary Clinton, that’s not possible. It’s not going to happen. But the FBI can push for concessions from a Clinton government,” Assange said.\nAssange accused Silicon Valley giant Google of helping Clinton during the Benghazi scandal and with her presidential campaign. Assange claimed that Google “is intensely aligned with US exceptionalism” and believes that Google itself is hoping for a Clinton victory in November.\nAssange also called Clinton a “liberal war hawk,” citing emails in which she advocated for overthrow of Muammar Gaddafi in Libya. “They predicted that the postwar outcome would be something like it is … she has a long history of being a liberal war hawk,” Assange said.\nAssange believes that Clinton is starting to feel the pressure from organizations like Wikileaks who have demanded her to be more transparent. “She has pushed for the prosecution of Wikileaks,” Assange noted about Clinton. “We do see her as a bit of problem for freedom of the press more generally.”\nTom Ciccotta writes about Free Speech and Intellectual Diversity for Breitbart. You can follow him on Twitter @tciccotta or on Facebook. You can email him at tciccotta@breitbart.com","url":"https://www.breitbart.com/tech/2016/06/14/wikileaks-plans-release-hillary-clintons-emails/"}
