{"authors":[],"date_download":"2018-10-23 00:56:25","date_modify":"2018-10-23 00:56:25","date_publish":"2015-07-11 00:00:00","description":"Thousands of fires are burning in the continent's northwest, sending smoke as far as Tennessee. Some blame a brewing El Niño for the unprecedented start to the season; others point to climate change.","filename":"data/vaneerConsumption/WildfiresInCanadaAndAlaskaDriveThousandsFromHomes.json","image_url":"https://media.npr.org/assets/img/2015/07/11/ap_395879008730_wide-208313e9b06ca8d2306b971712ad3a09f2f54f52.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=421995880_1540256185.html","title":"Wildfires In Canada And Alaska Drive Thousands From Homes","title_page":"Wildfires In Canada And Alaska Drive Thousands From Homes : NPR","title_rss":"NULL","source_domain":"npr.org","text":"WADE GOODWYN, HOST:\nIt's fire season in North America, which also means it smoke season. This smoke has blanketed parts of Wisconsin and North Dakota. It's triggered air alerts in Minnesota and Montana and muddied skies as far south as Tennessee and Colorado. It's even worse at the source.\n(SOUNDBITE OF NEWS REPORTS)\nUNIDENTIFIED REPORTER #1: An already terrible fire season in Western Canada got a whole lot worse today.\nUNIDENTIFIED REPORTER #2: Several serious interface blazes have leapt to life in the last 24 hours.\nUNIDENTIFIED REPORTER #3: Most of these fires are remote, but a few are creeping closer to cities and towns.\nGOODWYN: In Canada, thousands of people have been evacuated from their homes because of air quality, others because of actual flames, as the country deals with an unprecedented start to the fire season. NPR's Nathan Rott reports.\nNATHAN ROTT, BYLINE: There are literally thousands of wildfires that have been burning in the conifers and spruce of Canada's boreal forests - some big, some small, most in rural, hard-to-reach places. In British Columbia, many of the fires are just being monitored, seen only from above by flights or with satellite imagery, which shows about half of the province covered in white smoke. In Saskatchewan, the fires are more threatening. They're growing into each other, combining, even as...\n(SOUNDBITE OF HELICOPTER)\nROTT: ...Fire crews and aircraft work through thick clouds of smoke that have forced more than 10,000 people to evacuate. In total, more than 10,000 square miles have burned in Canada. That's roughly the size of Massachusetts. Kerry Anderson is a research scientist with the Canadian Forest Service.\nKERRY ANDERSON: The situation in Canada is extreme right now - or, specifically, in Western Canada. Western Canada has seen about three times the area that's normally burned for this time of year.\nROTT: And that's stretched firefighting resources thin.\nANDERSON: Pretty much all the resources in Canada are tapped out. They're all on the fire line, and now we're bringing in resources internationally from in Mexico, Australia, New Zealand.\nROTT: With more recent requests for help put into South Africa, France and the U.S. The Canadian government has even scrambled their armed forces to help, putting several battalions worth of soldiers through a crash course on fire suppression and sending them out on the fire line.\nANDERSON: That's what we have to do in these sorts of situations.\nROTT: And it's not just in Canada. Alaska's fire season is off to a historic start as well. Record-high temperatures in much of the state combined with a three-day lightning storm sparked more than 300 fires late last month. Those have since grown to burn more than 3 million acres. Sam Harrel is with the BLM Alaska Fire Service\nSAM HARREL: There's an awful lot of landscape in Alaska, and a good portion of it is experiencing a lot of land fires right now.\nROTT: Some weather and climate scientists are blaming the increase in fire activity on the developing El Nino weather pattern, saying it caused a dry winter and a hot spring. Mike Flanagan, a professor of wildland fire at the University of Alberta, says it's bigger than that. If you look at Canada's fire numbers, he says...\nMIKE FLANAGAN: Our area burned has doubled since the early '70s, using a running average of about 10 years.\nROTT: And that's despite improvements in firefighting technology and resources. That's why, he says, this year isn't a one-off because of El Nino but part of a larger trend driven by human-caused climate change, which is particularly problematic in the North. Even if the fire activity slows in the coming weeks, as is expected...\nFLANAGAN: With the deep organic materials that you'll find in Alaska and boreal Canada, it's not unheard of for fires to burn meters deep and survive winters and then pop up the next spring.\nROTT: In other words, he says, some of the fires that are burning now may still be burning this time next year. Nathan Rott, NPR News.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=421995880"}
