{"authors":["Taylor Maple"],"date_download":"2018-10-31 01:48:23","date_modify":"2018-10-31 01:48:23","date_publish":"2018-09-14 03:00:52","description":"BoJack Horseman is a show that seems, on its surface, like a wacky, raunchy, nonsensical animated comedy, and in many ways, it truly is. But beneath that outer layer is a core that has portrayed struggles with depression, addiction, sexuality, and…","filename":"data/vaneerConsumption/WillBoJackHorsemanReturnForSeason6TheLatestsEpisodesOfTheDarkComedyAlreadyHaveRaveReviews.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/ecdc4658-d304-4efb-8dd8-d4a9493c4a27-91455644-fa7d-40a7-9081-b51da38649e4.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-bojack-horseman-return-for-season-6-the-latests-episodes-of-the-dark-comedy-already-have-rave-reviews-11859794_1540950503.html","title":"Will ‘BoJack Horseman’ Return For Season 6? The Latests Episodes Of The Dark Comedy Already Have Rave Reviews","title_page":"Will ‘BoJack Horseman’ Return For Season 6? The Latests Episodes Of The Dark Comedy Already Have Rave Reviews","title_rss":"NULL","source_domain":"bustle.com","text":"BoJack Horseman is a show that seems, on its surface, like a wacky, raunchy, nonsensical animated comedy, and in many ways, it truly is. But beneath that outer layer is a core that has portrayed struggles with depression, addiction, sexuality, and love in a way that few projects ever have, and viewers can't get enough. As BoJack Horseman Season 5 debuts on Netflix this weekend, fans who have become endeared to the show and its titular character will be ready for more in no time — so will BoJack Horseman return for Season 6?\nThe truth is, we don't know yet, but we also probably won't have to wait too long for a solid answer. Variety reported last year in late September that the series had been renewed by Netflix just a couple weeks after Season 4 debuted, so a new announcement might not be too far off. And given the excitement surrounding the show and its previous renewal, it almost feels like a given that Netflix will order more from BoJack.\nThe comedy, which follows former '90s sitcom star BoJack as he tries to keep his inner demons at bay while cultivating a comeback career, has really resonated with some fans in a big way. \"The thing that makes this show so brilliant is its ability to balance ridiculousness with the darker themes so well,\" wrote Reddit user arhanv. \"It's saturated with animal puns and random wacky sh*t but it's also one of the most accurate depictions of depression on TV right now.\"\nAnd it's not just anonymous internet fans who have sung their praises of BoJack. The series as a whole has a wildly high 92 percent positive Rotten Tomato score among critics, and that jumps to 94 percent positive when polling solely regular audience members. And even before Season 5 debuted, several outlets published glowing reviews, many of which noting that while BoJack could easily have been just another addition to the ranks of familiar adult animation, it's become so much more.\nEntertainment Weekly's Darren Franich said that the new BoJack season \"confirms its status as Netflix’s best TV show, a brash showbiz satire that’s also a religious act of small-screen devotion.\" And last week, IndieWire's Liz Shannon Miller called BoJack \"a show unafraid to take chances, to try new things, to acknowledge criticism, and to work to get better — all factors that speak to humanity operating at its very best.\"\nCreator Raphael Bob Waksberg told SlashFilm.com that BoJack was always meant to be more of an overarcing narrative than other animated comedies have tended to be — the viewer isn't meant to skip around within a season, or watch episodes out of order. They're meant to strap in for a real, meaningful, consequential experience, making every plot turn even more poignant.\n\"At the end of every episode, the damage that is done retains and the next episode will carry over the emotional story,\" he said. \"It’ll carry over even literally. If someone punches a hole in a wall, the next time we see that wall, there’s going to be a hole in it. The world doesn’t get fixed automatically. I think Netflix gave us an amazing opportunity to do that.\"\nAnyone who's watched even a few episodes of BoJack will know it's something special. It's a show that'll have you laughing through the tears you shed just a few seconds before, and that has created flawed, frustrating, authentic characters you can't help but root for.","url":"https://www.bustle.com/p/will-bojack-horseman-return-for-season-6-the-latests-episodes-of-the-dark-comedy-already-have-rave-reviews-11859794"}
