{"authors":["Tai Gooden"],"date_download":"2018-10-31 01:46:38","date_modify":"2018-10-31 01:46:38","date_publish":"2018-09-14 11:00:53","description":"Netflix is adding to its anime arsenal with Last Hope, premiering on September 14. The futuristic tale follows Leon Lau (Tomoaki Maeno), a scientist who nearly wiped humanity in 2031 after a quantum reactor accident and tries to correct his mistakes…","filename":"data/vaneerConsumption/WillLastHopeReturnForSeason2TheRobotAnimeHasAnEpicStoryToTell.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/12/1149b2b6-95b1-4260-80da-8cef4155fafe-last-hope-2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-last-hope-return-for-season-2-the-robot-anime-has-epic-story-to-tell-11892870_1540950398.html","title":"Will 'Last Hope' Return For Season 2? The Robot Anime Has An Epic Story To Tell","title_page":"Will 'Last Hope' Return For Season 2? The Robot Anime Has An Epic Story To Tell","title_rss":"NULL","source_domain":"bustle.com","text":"Netflix is adding to its anime arsenal with Last Hope, premiering on September 14. The futuristic tale follows Leon Lau (Tomoaki Maeno), a scientist who nearly wiped humanity in 2031 after a quantum reactor accident and tries to correct his mistakes seven years later. The robot heavy animated series will definitely capture the interest of viewers who love shows like Voltron: Legendary Defender, but will Last Hope return for Season 2? According to its Netflix homepage, the September debut is only Part 1 of this story, so there is definitely more to come in the future. There’s no specification on the total number of parts that Last Hope is supposed to have but at least fans can be certain that there is more than one chapter to this story.\nCrunchyroll reported that Last Hope originally debuted on Netflix in Japan only in March 2018 under the name Jūshinki Pandora. Per the show’s Japanese page, Episode 25 will be released on September 13. There’s no indication about how many episodes are in a season or how much of this action will be covered in Part 1 of Last Hope, but it does mean that there is a substantial amount of story to follow. But, the official trailer is packed with enough actions to make fans want to tune in and possibly come back for more in the future.\nNetflix\nThe trailer starts by giving background info about what went down in 2031, which is known as the Xianglong Crisis. The aforementioned accident is shown, including a release of massive energy from a reactor that caused a change in the environment. This energy affected most living things besides humans as well as machines.\nThe clip introduces Leon and a mysterious and dangerous biomechanical enemy as B.R.A.I. (Biological Revolutionary of Accelerated Intelligence) that poses a major threat to humans. But, an elite human force known as Pandora comes together to fight back with machines that can morph into anthropomorphic forms similar to Voltron, the Transformers, and even the infamous Power Rangers' fighting machine known as the Megazord. The animation moves fast and packs in a lot of action that viewers can barely absorb at one time.\nNetflix\nMain character Queenie Yo (Kana Hanazawa) also makes an appearance in the trailer and it's clear that she is a leader. According to World Without Horizons, Queenie is a dojo trained warrior who works as a bounty hunter to take down B.R.A.I. In the article, Hanazawa expressed her happiness about the role and said she admires her character. “The Queenie that I will be playing is a warrior who carries an intense rage and grief within her,” said Hanazawa. “I would love to get to know a girl like her.”\nIn typical anime fashion, Queenie is drawn with large breasts, but her cosplay worthy outfit doesn’t unnecessarily sexualize her body. It will be interesting to find out more about the team and how they all work together to stop this war of machines.\nLast Hope seems interesting mix of futurism, ecology, and biology with a bleak, dystopian feel. And, it’s a great way to fill the gap between now and the impending avalanche of fall TV shows in a couple of weeks. The best part is, there is more story to be told about this world on the brink of destruction by mutated machines.","url":"https://www.bustle.com/p/will-last-hope-return-for-season-2-the-robot-anime-has-epic-story-to-tell-11892870"}
