{"authors":["Kipp Jones"],"date_download":"2018-10-30 18:53:18","date_modify":"2018-10-30 18:53:18","date_publish":"2016-04-29 17:23:00","description":"Will Ferrell has canceled plans to star in and produce a comedic film mocking President Ronald Reagan’s tragic battle with Alzheimer’s disease. | Entertainment","filename":"data/vaneerConsumption/WillFerrellBacksOutofFilmMockingReagansAlzheimers.json","image_url":"https://media.breitbart.com/media/2016/04/Ferrel-Post-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_04_29__1540925598.html","title":"Will Ferrell Backs Out of Film Mocking Reagan's Alzheimer's","title_page":"Will Ferrell Backs Out of Film Mocking Reagan's Alzheimer's | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Will Ferrell has canceled plans to star in and produce a comedic film mocking President Ronald Reagan’s tragic battle with Alzheimer’s disease.\nPage Six reported Friday that Ferrell backed out of the controversial film, titled Reagan, following a major backlash from the public outraged by the attempt to mock the late president’s struggle with Alzheimer’s.\nA spokesperson for the actor said Friday, “The REAGAN script is one of a number of scripts that had been submitted to Will Ferrell which he had considered. While it is by no means a ‘Alzheimer’s comedy’ as has been suggested, Mr. Ferrell is not pursuing this project.”\nVariety first reported on Wednesday that Ferrell, 48, was slated to play the 40th president in the film, which was described as a “hilarious political satire.”\nThe film’s script is set in 1984, shortly after Reagan won a landslide reelection for his second term. It is centered on a young aide who must convince the mentally diminished President Reagan that he is an actor playing the president in a movie.\nFerrell also reportedly had plans to produce the film under his Gary Sanchez Productions company.\nPatti Davis, Reagan’s daughter, wrote an open letter to Ferrell on Thursday highlighting the pain and devastation caused by Alzheimer’s disease and challenging the actor to explain how the disease is suitable for comedic material.\n“Alzheimer’s doesn’t care if you are President of the United States or a dockworker,” she wrote in the letter. “It steals what is most precious to a human being – memories, connections, the familiar landmarks of a lifetime that we all come to rely on to hold our place secure in this world and keep us linked to those we have come to know and love.”\nShe continued: “I watched as fear invaded my father’s eyes — this man who was never afraid of anything. I heard his voice tremble as he stood in the living room and said, ‘I don’t know where I am.’ I watched helplessly as he reached for memories, for words, that were suddenly out of reach and moving farther away. For ten long years he drifted – past the memories that marked his life, past all that was familiar … and mercifully, finally past the fear.”\nDavis added: “Perhaps for your comedy you would like to visit some dementia facilities. I have – I didn’t find anything comedic there, and my hope would be that if you’re a decent human being, you wouldn’t either.”\nDavis also noted her work with other families who have experienced the pain of Alzheimer’s disease. “Twice a week I run a support group called Beyond Alzheimer’s for caregivers and family members of those with Alzheimer’s and dementia,” she wrote. “I look into haunted eyes that remind me of my own when my father was ill. I listen to stories of helplessness and loss and am continually moved by the bravery of those who wake up every morning not knowing who their loved one will be that day, or what will be lost. The only certainty with Alzheimer’s is that more will be lost and the disease will always win in the end.”\nDavis closed her letter by asking Ferrell, “Perhaps you would like to explain to [these families] how this disease is suitable material for a comedy.”\nPresident Reagan’s son Michael Reagan also commented on the project.\n#Alzheimers is not a comedy to the 5 million people who are suffering with the decease,it first robs you of your mind and then it kills you — Michael Reagan (@ReaganWorld) April 29, 2016\nJames Rosebush, a former Reagan staffer, told Fox & Friends on Friday morning Reagan did not suffer from Alzheimer’s while in office. Rosebush discerned Ferrell’s film as “an egregious attempt to rewrite presidential history, which to paraphrase Ronald Reagan, ‘will fall on the ash heap of history.’”\nAccording to Page Six, he added: “The timing of this is especially spurious as it falls only weeks after [Nancy Reagan’s] passing, which had millions of people mourning her and also attributing her with the grace that she delivered in taking care of him in his last ten years.”\nWill Ferrell has not publicly commented on the now-canceled project.","url":"https://www.breitbart.com/entertainment/2016/04/29/will-ferrell-backs-film-mocking-reagan-alzheimers/"}
