{"authors":[],"date_download":"2018-10-30 18:23:02","date_modify":"2018-10-30 18:23:02","date_publish":"2018-10-30 17:39:36","description":"William Daniels, the actor known for playing George Feeny on “Boy Meets World,”&nbs...","filename":"data/vaneerConsumption/WilliamDanielsMrFeenyonBoyMeetsWorldstopsburglaryinhis.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/10/30/Images/GettyImages-916779782.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_celebrity-new_7a6d160c44cf31bc89e405aa6d7f186a__1540923782.html","title":"William Daniels, Mr. Feeny on 'Boy Meets World,' stops burglary in his","title_page":"William Daniels, Mr. Feeny on 'Boy Meets World,' stops burglary in his","title_rss":"NULL","source_domain":"ajc.com","text":"William Daniels, the actor known for playing George Feeny on “Boy Meets World,” Dr. Mark Craig on “St. Elsewhere” and the voice of Kitt in “Knight Rider,” thwarted a burglary in his home Saturday, KABC reported.\n>> Read more trending news\nThe 91-year-old was home in Los Angeles with his wife, actress Bonnie Bartlett, 89, when the attempted burglary happened.\nDaniels quickly turned on lights in the house when the suspect forced open a front door, a spokesperson for the Los Angeles Police Department confirmed to KABC Tuesday.\n“Luckily, Mr. Daniels was able to frighten away the person and the LAPD quickly responded,” Daniels’ publicist said in a statement to KABC. “They are both well. Mr. Daniels thanks all his fans for their concern.”\nPeople reported that Daniels’ former “Boy Meets World” co-star, Will Friedle, tweeted in response to the news.\n“Don’t ever mess with Mr. Feeny!” he wrote.\nDespite a number of burglaries and attempted burglaries of celebrity homes in L.A., police do not believe Daniels and Bartlett were targeted.\nLAPD public information officer Rosario Herrera told BuzzFeed News the suspect is still at large.","url":"https://www.ajc.com/entertainment/celebrity-news/william-daniels-feeny-boy-meets-world-stops-burglary-his-home/nY5FPCxvt6tXcw4LpU4XcO/"}
