{"authors":["Emma Madden"],"date_download":"2018-10-31 01:41:44","date_modify":"2018-10-31 01:41:44","date_publish":"2018-08-28 07:18:22","description":"It's barely been a week of remembering what life was like before the fiery demon in the sky made us all sweaty and chafey. After one of England's most persistent heatwaves in memory, this week Brits welcomed the rain like Gene Kelly swinging around…","filename":"data/vaneerConsumption/WillBritainHaveALongSummerNewReportsFromTheMetOfficeSayItsLikely.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/72e64d3c-100a-40fb-b09c-805346078ad1-getty-453201706.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-britain-have-a-long-summer-new-reports-from-the-met-office-say-its-likely-10252500_1540950104.html","title":"Will Britain Have A Long Summer? New Reports From The Met Office Say It's Likely","title_page":"Will Britain Have A Long Summer? New Reports From The Met Office Say It's Likely","title_rss":"NULL","source_domain":"bustle.com","text":"It's barely been a week of remembering what life was like before the fiery demon in the sky made us all sweaty and chafey. After one of England's most persistent heatwaves in memory, this week Brits welcomed the rain like Gene Kelly swinging around on lamp posts. But this damp spell might not last for long, as Britain is about to have a long summer according to reports. If you savoured the sun like it was an unending birthday, this'll be good news for you. But those of you who had to spend the heatwave in their freezer, you might want to prepare yourself as you could be back in cooling action.\nThe Met Office has said that we can expect an unseasonably warm and dry September, with temperatures predicted to surpass the month's average. Met Office forecaster Emma Smith has told Mirror that “Wednesday’s cold front sees rain break up as it moves south, but high pressure from Thursday sees most places dry with sunny spells.\" This is expected to last for a while, as Smith says that \"temperatures could be into the low or mid-20s in spells until mid or late September, which is warm or very warm for the year\".\nMatthew Baker/Getty Images News/Getty Images\nAccording to Birmingham Live, the sunshine is likely to continue into November, giving us three extra months to soak in the vitamin D. While it's unlikely that Britain will experience the same intense heat as it did earlier this summer, you won't need to reorganise your winter wardrobe right away, which is something many people will certainly be thankful for.\nAnd while you probably hear these kinds of predictions every year, this one's actually very likely. The Met's forecast model shows that there's around a 80 to 100 percent chance of above average temperatures over the next few months. It's down to the warming of eastern Pacific sea temperatures, or what's known as \"El Nino.\" The Met says that this usually occurs once every few years, and it affects temperatures on a global scale, and Britain will be feeling it rather acutely in the next few months.\nJack Taylor/Getty Images News/Getty Images\nBut in typical British fashion, it's likely that this extra long warm spell will be followed by storms. \"This will kick-start the end of the drought, especially in Wales and western England,\" AccuWeather's Tyler Roys told The Express. While it's likely that much of Scotland will get a whole lot of rain, \"At most, a few storms will impact the Isles. The active period this season will be further south, with storms resulting from the remains of tropical systems,\" Roys says.\nSo, get in all the beach days you can. Britain's summer is going to last even longer than most have anticipated. Keep the ice lollies handy. Since the nation's about to have a long summer, who knows what this year's final months will look like. At this rate you might even see Santa hats at the beach in the style of an Australian Christmas. Well, maybe not, but I can dream.","url":"https://www.bustle.com/p/will-britain-have-a-long-summer-new-reports-from-the-met-office-say-its-likely-10252500"}
