{"authors":["Taylor Maple"],"date_download":"2018-10-31 01:46:39","date_modify":"2018-10-31 01:46:39","date_publish":"2018-09-14 11:00:53","description":"From Norm Macdonald's early days on Saturday Night Live decades ago, to his more recent standup specials, and now his forthcoming show, the comic has long been a staple in the comedy industry. His new Netflix talk program debuts this week, but will…","filename":"data/vaneerConsumption/WillNormMacDonaldsShowReturnControversySwirlsAroundItsStarJustBeforeThePremiere.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/12/1f983d9f-9438-4edb-bb0a-26c15372d769-getty-82169022.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-norm-macdonalds-show-return-controversy-swirls-around-its-star-just-before-the-premiere-11890390_1540950399.html","title":"Will Norm MacDonald’s Show Return? Controversy Swirls Around Its Star Just Before The Premiere","title_page":"Will Norm MacDonald’s Show Return? Controversy Swirls Around Its Star Just Before The Premiere","title_rss":"NULL","source_domain":"bustle.com","text":"From Norm Macdonald's early days on Saturday Night Live decades ago, to his more recent standup specials, and now his forthcoming show, the comic has long been a staple in the comedy industry. His new Netflix talk program debuts this week, but will Norm Macdonald's show return for a second season?\nIt's too soon to tell, and Netflix can be kind of unpredictable with these things. The streaming service doesn't release viewership numbers, but it does enjoy a certain kind of freedom to let shows continue that wouldn't survive on other, more traditional networks. That's not to say it never gives the axe — other comedy series like The Break With Michelle Wolf and The Joel McHale Show were both canceled last month, according to Deadline.\nBut when Macdonald's star-studded lineup was released, it seemed like that alone could send the show to the front of the pack. According to Entertainment Weekly, Jane Fonda, Dave Letterman, David Spade and Drew Barrymore are among the first to join the comic onstage for a short and friendly kind of conversation we're used to seeing on these kinds of shows.\nThe same EW piece said that while the show and its host were still finding its footing, there were obvious bright spots. \"'Love' seems like a strong word, but there’s a lot to enjoy here,\" it read.\nNetflix on YouTube\nBut that doesn't mean its success is a done deal — not many reviews have been published ahead of its debut, and some that have are not as pleased as others. Audra Schroeder for the Daily Dot wrote that the show might be a little old fashioned, and a little out of touch. \"After a while the white noise of two comedy guys talking about the old days made me tune out,\" she said.\nAnd of course, while not necessarily directly related to the show's success, Macdonald's recent comments in an interview with The Hollywood Reporter have brought about their own share of controversy around the comic himself. \"I'm happy the #MeToo movement has slowed down a little bit,\" he told the outlet before noting how much he feels friends Louis CK and Roseanne Barr have lost. \"There are very few people that have gone through what they have, losing everything in a day,\" he continued. Of course, people will go, 'What about the victims?' But you know what? The victims didn't have to go through that.\"\nMacdonald apologized on Twitter, as shown above, and said he was sorry if he minimized the pain of the victims or appeared to defend what Louis CK and Roseanne did. But the comments did result in his booting from a scheduled appearance on the Tonight Show, according to Rolling Stone. Macdonald appeared on Howard Stern's radio show on Wednesday in an attempt to clear the air. According to THR, he intended his comments to be more about Roseanne — who had her show canceled after racist comments — and not about the #MeToo movement and C.K.\n\"I am completely behind the #MeToo movement... #MeToo is what you want for your daughters and you want that to be the future world, of course,\" he said, per the THR report. \"And I meet all kinds of women with terrible stories of what's happened to them. So, I wasn't talking about the victims. They asked me about Roseanne.\"\nNetflix will likely take into account both viewership numbers and public attitude toward Macdonald when the time comes to renew or pass on another season of Norm Macdonald Has A Show. So for now, the jury is still out.","url":"https://www.bustle.com/p/will-norm-macdonalds-show-return-controversy-swirls-around-its-star-just-before-the-premiere-11890390"}
