{"authors":["Darren Boyle For Mailonline"],"date_download":"2018-10-23 01:33:12","date_modify":"2018-10-23 01:33:12","date_publish":"2017-03-10 09:54:36","description":"Arnold Schwarzenegger's staff have refused to rule out the possibility that the Terminator star is considering a run for the Senate in 2018 bringing him to the national political stage.","filename":"data/vaneerConsumption/WillArnoldSchwarzeneggerlaunchaSenatebid.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22ED2D00000578-0-image-a-2_1489150594116.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300566_Will-Governator-launch-Senate-bid_1540258392.html","title":"Will Arnold Schwarzenegger launch a Senate bid?","title_page":"Will Arnold Schwarzenegger launch a Senate bid? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hollywood veteran and former California governor Arnold Schwarzenegger is reportedly considering a run for the Senate after being 'fired' from the Celebrity Apprentice.\nRepublican sources in California believe the movie star may re-enter the political sphere as a direct challenge to his nemesis President Donald Trump.\nThe pair have been involved in a Twitter war over the ratings of the Celebrity Apprentice.\nArnold Schwarzenegger, pictured in Los Angeles on Thursday, is thought to be considering a run for the Senate in 2018. They believe he may re-enter the political fray to challenge nemesis Donald Trump\nThe star, who was sacked from the Celebrity Apprentice has been engaged in a Twitter spat with president Donald Trump about the show's ratings\nTrump claimed: 'Arnold Schwarzenegger isn't voluntarily leaving the Apprentice, he was fired by his bad (pathetic) ratings, not by me. Sad end to great show.'\nSchwarzenegger replied: 'You should think about hiring a new joke writer and a fact checker.'\nAccording to Politico, Schwarzenegger could run in the 2018 US Senate race against the incumbent Democrat Dianne Feinstein - who will be 85.\nDue to his status, Schwarzenegger would instantly become one of the most prominent members of the Republican party.\nA spokesman for the Terminator star said: 'Right now Gov. Schwarzenegger’s focus is on using his platform to bring some sensibility and coherency to Washington by fighting for redistricting reform, like we did in California. We are keeping all of our options open as far as how we can accomplish that.'\nGOP political consultant Luis Alvarado said: 'In politics after Donald Trump, nothing is crazy any longer. We’re in the third dimension here. Arnold Schwarzenegger, who actually has more political experience than Trump, would certainly seem to fit a mold to what some of the electorate would find attractive.\n'Donald Trump has had the ability to manipulate all the news and cameras to him, and Arnold Schwarzenegger would be like kryptonite, or an anti-matter device, that would somehow restore balance in this universe of madness.'\nSchwarzenegger served as governor of California between 2003 and 2010, in which time he introduced some stringent environmental laws.\nThe actor, unlike Trump, is a firm believer in Climate Change science and introduced the Global Warming Solutions Act in 2006.\nSchwarzenegger can run for the Senate, even though he was born in Austria, as he has been a US citizen for more than nine years.\nBut he can't compete for the White House, as he wasn't born in America.","url":"https://www.dailymail.co.uk/news/article-4300566/Will-Governator-launch-Senate-bid.html"}
