{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:40:31","date_modify":"2018-10-30 21:40:31","date_publish":"2015-04-16 20:05:32","description":"Conservatives in Arizona intend to primary five-term incumbent Senator John McCain. But it isn't yet clear whether Rep. Matt Salmon will step up to challenge McCain. |","filename":"data/vaneerConsumption/WillRepMattSalmonChallengeJohnMcCaininArizonaNoDecisionYet.json","image_url":"https://media.breitbart.com/media/2015/01/matt-salmon-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_16__1540935631.html","title":"Will Rep. Matt Salmon Challenge John McCain in Arizona? No Decision Yet","title_page":"Will Rep. Matt Salmon Challenge John McCain in Arizona? No Decision Yet | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Conservatives in Arizona intend to primary five-term incumbent Senator John McCain. But it isn’t yet clear whether Rep. Matt Salmon will step up to challenge his Republican counterpart.\nSalmon’s name has been offered with other potential candidates, including fellow Representative David Schweikert and Arizona State Senator Kelli Ward.\nSchweikert has pretty much taken himself out of the running, having told the Arizona Republic he was leaning away from a potential McCain challenge. “It’s not definite,” he said, before adding that his wife, “has put her foot down.” Ward, noted as a “rising star” in the Republican Party, has been heavily encouraged to run. She has started an exploratory committee to consider the challenge.\nSalmon is being coy, telling the Hill that he’s not in or out of the Senate race. In fact, he hasn’t yet announced whether he will run for re-election to the House. Arizona GOP party leaders aren’t surprised. They tell The Hill Salmon could delay a decision until the Fall.\nMcCain seems to understand he’ll face a primary challenger, since he’s angered constituents back home. Arizona Republicans officially censured McCain for being to liberal in early 2014. Just before officially announcing his intention to run for re-election, McCain urged supporters to stock his campaign war chest. “I’m going to be the target of a wide array of powerful groups,” he admitted, adding his campaign would face a “unique set of challenges.”\nSalmon’s current position in the House is his second stint in the seat. He temporarily abdicated the position after a self-declared term limit forced him to step down in 2000. In the interim Salmon ran for Governor, only to be narrowly topped by Janet Napolitano in 2002. He lobbied before returning to the House seat.\nNapolitano at one time garnered support from a peculiar group called “Republicans for Napolitano” which the Hill reports included McCain allies.\nSome say Salmon’s gubernatorial campaign gave him positive name ID statewide, which would be important against an inststution like McCain. Other Arizonans suggest Salmon would be better slated to challenge Sen. Jeff Flake in a future election. It was Flake that Salmon replaced in 2012 when Flake chose to run for Senate. Flake could face heat in a future re-election bid over issues including a committee vote to advance confirmation of Obama-nominated Attorney General candidate Loretta Lynch.\nFlake suggested in an interview with the Hill that Salmon could be maintaining a sense of mystery over whether he will run as a strategic move to further increase his own name ID. While Flake was once rumored as a potential challenger to McCain, but he chose rather to run for the other Arizona Senate seat. He won it in 2012, ten years after the Senate rumors arose. CNN quoted Flake in 2003 on why he said he chose not to challenge McCain, “I’d love to be in the Senate, but quite frankly I could not beat John McCain.”\nFlake more recently told the Hill, “Sometimes you let it run just to build up your name ID.”\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2015/04/16/will-rep-matt-salmon-challenge-john-mccain-in-arizona-no-decision-yet/"}
