{"authors":[],"date_download":"2018-10-30 21:50:45","date_modify":"2018-10-30 21:50:45","date_publish":"2016-12-30 05:00:00","description":"The beginning of each new year is a time that is ripe with possibilities.","filename":"data/vaneerConsumption/Willthenewyearbringchangestoyourcareer.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/30/Images/newsEngin.17178251_123116-Puls-career-Crider-01.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/classifieds_jobs_will-the-new-year-bring-changes-your-career__1540936245.html","title":"Will the new year bring changes to your career?","title_page":"Will the new year bring changes to your career?","title_rss":"NULL","source_domain":"ajc.com","text":"The beginning of each new year is a time that is ripe with possibilities. Traditionally, people use this occasion for reflection and self-examination. Resolutions are made and very often “career” is on the agenda of things to pursue, improve or perhaps change course.\nDepending on where you are in life (and in your career) there are certain things you can do to ensure that making and keeping a job-related resolution goes smoothly.\nWe touched base with five experts that include managers and human resources staff at Northside Hospital and Emory St. Joseph’s Hospital.\nThose weighing in with practical advice are\nAlison Crider, Manager, Emory St. Joseph Talent Acquisition;\nLauren A. Marianacci RN BSN, Emory Saint Joseph’s Hospital Specialty Director Critical Care & Emergency Services;\nMark Rosenthal, Manager, Human Resources Operations, Northside Hospital;\nLori Anne Roberson, Manager, Talent Acquisition, Northside Hospital\nLee Feldpausch, Director, Radiology, Rehabilitation Services, The Spine & Pain Treatment Centers, Northside Hospital.\nWe questioned this panel about best practices for job evaluation and a job search; particularly at three different career stages.\nWe asked for advice for those just entering the job market in healthcare, those who may be considering a lateral move to another organization and those who may be looking to advance at their current place of employment.\nJust starting out\nIf you are considering a career in healthcare but haven’t gotten to the education stage, Crider says that finding a mentor and utilizing career counselors to assess the best options for education can be helpful.\nMarianacci adds, “In the medical field when I see candidates come in with volunteer hours and completed mission work it demonstrates to me they have a passion for caring for people.”\n“For the new graduate nurses, we encourage them to complete their senior practicum on a unit that interest them with the intent of hiring into that unit post-graduation. In these situations, the staff on that unit have the ability to assess the potential new graduate as a student and see if it would be a long term success.”\nRoberson adds, “Seek guidance from someone already in the field to ensure the institution you are considering is recognized as an industry leader and they can facilitate educational success.”\nShe also recommends checking with any national organizations to see if a particular school or specialty stands out as well as engaging with social media groups that relate to your field of interest.\nIf you’ve gotten your degree and you’re seeking a position in the field, networking with other professionals as well as asking some tough personal questions can help smooth the path to that first job in the industry.\nCrider says that planning and organizing are essential, including determining the top three areas of healthcare you wish to pursue. She recommends strategic networking. She says that it helps to align yourself with professionals in your area of interest and develop those key relationships.\nRosenthal also supports networking as means of assessing what areas of healthcare to pursue. He also recommends serious online networking, including doing research and reaching out to other professionals on LinkedIn via their inmail feature. He also recommends using Glassdoor to find out more about potential employers.\nWhen it comes to networking, he also advises, “Do not ask specifically if they have any open job opportunities, rather ask them for names of key professionals they would recommend you contact to discuss any known career opportunities. The thought here is just discussing contacts will signal you are in the job market therefore you do not need to ask them if they have any jobs, if they have jobs they will offer them to you.”\nMarianacci also suggests self-assessment as a tool for determining what you might be best suited for. Ask yourself the following:\n• What kind of environment do you want to work in… hospital, doctor’s office, urgent care?\n• Are you interested in direct patient care?\n• Are you flexible with your schedule, shifts, amount of time you are able to work?\n• How much physical activity are you able to do?\n• What are your salary requirements?\nYour résumé\nNaturally, a résumé or CV is critical to a successful job search but often it’s hard to know just what information is key to include.\nCrider says that functional is best. She points out that skill sets, experience and accomplishments are more important to emphasize than dates.\nMarianacci adds that a résumé should be honest and accurate. She says, “The candidate should have the ability to discuss any of the skills or experiences listed. If the candidate is a new graduate, I like to see any volunteer work or mission trips they have done.”\nRosenthal also recommends providing a 2-3 sentence opening summary of each position held and then list in bullet form the measurable accomplishments. He says a good résumé is well-balanced and includes professional and community organization involvement.\nIf you are updating a CV after gaining some work experience, Feldpausch says that you should place more detail on recent accomplishments…at least the last 3-5 years. Also, try and show how your accomplishments brought value to the organizations you worked for.\nThe interview\nThe interview process is just as critical as a well-written résumé and to make a good impression, it is important to arrive on time, dressed professionally. Have copies of your CV in hand and show that you’ve done your homework by asking relevant questions about the position and the organization.\nMarianacci also says, “Be prepared for a behavioral interview, most organizations are utilizing this technique as well as potential panel interviews with varied staff members. They are looking to see how you respond and behave in a given situation.”\nNo matter whether you are a “newbie” just considering a healthcare occupation, or a seasoned veteran in mid-career, having a good résumé and polished interview skills are important.\nMid-career moves\nMore seasoned professionals often find another set of challenges when maneuvering into a new job\nFor example, you might find yourself dealing with a less than stellar job evaluation. Is there a way to mitigate any damage from this and focus on the positive?\nCrider says that honesty is best. She says you can use it as an opportunity to discuss how you were able to learn and grow from the experience.\nRoberson points out that it is important to accept feedback and develop a plan for improvement. She says, “Strive to reverse the negative evaluation and show subsequent strengths in that area. We all make mistakes to learn. The key is not making them again.”\nMarianacci also adds, “Most organizations have policies surrounding evaluations and disciplinary actions. If you receive a negative evaluation; ask your manager for an action plan, or a performance improvement plan. These are put in place to help employees succeed while providing them a detailed outline of what needs to be accomplished. You can always comment on the reply section of your evaluation if you agree or disagree. And lastly, ask for a follow up meeting in three months to document your progress.”\nAnother tricky situation is whether or not to ask for a recommendation from a current employer if you are thinking of leaving for another organization.\nCrider says that if you have a good relationship, then absolutely! She says that a good organization does fight for retention but then again, they understand that life happens.\nAnd, what about that age-old dilemma…how to ask for a raise?\nMarianacci recommends having an outline of work and projects completed.\n“I would present work that was completed on councils or committees and simply ask my manager to review my compensation.”\nIf you are looking to move up in your current organization, there are also things to consider.\nOne is whether or not it will be necessary to obtain additional certifications and/or education.\nResearch the position fully, find out what the requirements are and then discuss with your manager the ways to meet these requirements while fulfilling current duties.\nAnother thing to think about is whether or not you are temperamentally suited to the position.\nRoberson recommends speaking to others in the position you seek to understand the full spectrum of responsibilities.\nThen, she says, “Evaluate your current position. Are you satisfied and content? Determine if it meets your career goal. Oftentimes, willingness to accept additional responsibility and succeeding can turn into the fast track to advance to a more desirable position.”\nTo stay or move on?\nFinally, sometimes a good old “Pros and Cons” list can help you determine whether or not you want to change positions or move up at a current position.\nHere are some of the metrics you should consider:\nJob responsibilities\nWork environment\nBenefit package (including retirement and continuing education)\nPotential to advance after hire\nFinancial standing of the prospective employer\nPatient satisfaction\nEmployee engagement\nOrganization’s quality outcomes\nCrider offers this piece of final advice, “[A] person needs to have a passion for what they do. Everything in between is great and important, but if you don’t love what you do and love getting up most days to go to work then you may need to reevaluate your career. If this is clear, then it is easy to build a future résumé on what will make oneself happy. Relationships and building successful ones are key to development. Always surround yourself with people that are smarter than you and learn from them. Do not be afraid of mistakes. Mistakes are just opportunities. Don’t be afraid to ask questions and to offer insight to the organization.”\n“You want people to know your name. You want people to trust your skills and talent.”","url":"https://www.ajc.com/classifieds/jobs/will-the-new-year-bring-changes-your-career/0hgK1VDnYQwf8DM1tJyvwK/"}
