{"authors":[],"date_download":"2018-10-30 14:23:24","date_modify":"2018-10-30 14:23:24","date_publish":"2016-08-16 00:00:00","description":null,"filename":"data/vaneerConsumption/Williesnottheonlyslickoneinthehousehold.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_08_willies_not_the_only_slick_one_in_the_household_1540909404.html","title":"Willie’s not the only slick one in the household","title_page":"Willie’s not the only slick one in the household","title_rss":"NULL","source_domain":"americanthinker.com","text":"Willie’s not the only slick one in the household\nHillary Clinton just pulled off a stealth operation to fix a problem with one of her numerous lying narratives. Per a report at TheBlaze, from September 2015 to February 2016, Clinton’s “campus sexual assault” web page stated the following: “I want to send a message to every survivor of sexual assault: Don’t let anyone silence your voice. You have a right to be heard. You have the right to be believed, and we’re with you.” But there was a wee problem for Clinton (and I do mean “wee,” since the MSM care little about the truth as they work 24/7 to make sure this felon is elected president): Juanita Broaddrick.\nIn January of this year, Broaddrick tweeted the following: “I was 35 years old when Bill Clinton, Ark. Attorney General raped me and Hillary tried to silence me. I am now 73….it never goes away.” The month after Broaddrick sent out the tweet, Clinton amended her standing-shoulder-to-shoulder-with-the-sisterhood statement. The new statement that was rolled out in February and remains current as of this writing states: “I want to send a message to every survivor of sexual assault: Don’t let anyone silence your voice. You have a right to be heard.” Oh, I see. V ictims of sexual assault no longer have a right to be believed. Hmm. Could this have anything to do with the fact that Clinton’s original statement put her in a bit of a jam (and I do mean “bit,” since the MSM care little about the truth as they work 24/7 to make sure this felon is elected president) since she’s always played the role of dutiful wife, covering up her husband’s sexual exploits? In the Clintons’ world, Juanita Broaddrick (among others) had no right to be believed. Clinton, the supposed champion of women, is no such champion. As with all things Clinton, it is a lie. From her personal life as Bill’s enabler to her work as a defense attorney when she laughed about getting a pedophile off the hook while assassinating the character of the 12-year-old victim to her plan to import record numbers of Muslims to America that will certainly be no boon to American women, or anyone else, for that matter, to her presence on the world stage, where she has ties to countries that oppress women in unthinkable ways (here, here, here, here, here, here, here, here, and here), she is a disaster of the first magnitude. Any conservative and/or Republican who plans to sit this election out, this is the evil (and it’s just a little snapshot of it) they will be ushering into the Oval Office. It’s time for everyone to climb down off his high horse. It’s okay. No questions asked. Let’s get going. It’s Donald Trump or this horrid woman who has not a single plan for America, for our future, for any of our lives that is good. It will be evil as far as the eye can see. Believe me.","url":"https://www.americanthinker.com/blog/2016/08/willies_not_the_only_slick_one_in_the_household.html"}
