{"authors":["Pauline Bartolone","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:53:56","date_modify":"2018-10-30 22:53:56","date_publish":"2015-11-22 08:00:00","description":"After the City of Los Angeles passed an ordinance this summer to increase the minimum wage to $15 an hour by 2020, Richard LoGuercio spent the following","filename":"data/vaneerConsumption/WillCaliforniawagehikesreplaceworkerswithmachines.json","image_url":"https://calmatters.org/wp-content/uploads/dishwashers.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940036.html","title":"Will California wage hikes replace workers with machines?","title_page":"Will California wage hikes replace workers with machines? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"After the City of Los Angeles passed an ordinance this summer to increase the minimum wage to $15 an hour by 2020, Richard LoGuercio spent the following weekend driving around a nearby city, looking for warehouses to move his business.\n“I am just screwed,” said LoGuercio, owner and president of Town and Country Event Rentals in Van Nuys, which employs 450 people, more than half of whom earn between $10 to $13 an hour. Moving his shop to another county could help him escape the mandated wage increase.\n“Labor has kind of become our enemy, because it’s just so high,” he said.\nWhen the minimum wage goes up to $15 an hour, LoGuercio estimates his labor costs will increase by 62 percent. He says he fears his labor costs may rise even further because his more experienced workers will need to be paid more than a new employee.\n“I’m in favor of (raising) the minimum wage, but not so much and not so fast,” said LoGuercio, who says he’s weighing his options for cutting labor costs.\n“Wherever technology can help, that’s where we’re looking into.”\nAfter the minimum wage ordinance was approved, LoGuercio invested in a $150,000 industrial dishwasher he had been eyeing to save on utility costs. The machine will also allow him to stop paying six to eight people who earn $10 to $11 an hour washing dishes. LoGuercio expects to recoup his costs in nine months, and save a couple of hundred thousand dollars a year going forward.\n“It’s a start,” he said.\nEmployers: Minimum wage increases will put more machines in the workplace\nEmployer groups opposed to raising the minimum wage say labor costs are already driving decisions to replace human labor with technology. They say higher minimum wages will accelerate automation trends in the workplace.\nBut economists say even when jobs are replaced by technology, overall employment may not suffer.\nMachines are already doing what humans had done for decades in supermarkets and some restaurants; shoppers can pay using self-checkout kiosks, and diners at Chili’s can order baby back ribs on a tabletop tablet.\nThe California Restaurant Association says self-ordering could become more common if the minimum wage is increased to $15 statewide, a scenario proposed in competing initiatives currently trying to qualify for the 2016 November ballot.\n“When you’re talking about a 60 percent increase in the minimum wage over a short period of time, that absolutely is a game changer,” said Jot Condie, chief executive and president of the restaurant association. “They’re all planning” on ways to cut costs, including buying pre-chopped ingredients, sourcing food from international sources instead of local farmers, or hiring more discriminately.\n“If they haven’t adopted technology, they are absolutely looking at technology as an option, a way to cut costs,” Condie said.\nKiosks and tablets are most likely to be seen in fast-food restaurants — but that’s not just because of labor costs, Condie said. Technology helps deliver food more quickly.\nFarmers may grow what can be mechanized\nWhen it comes to agriculture, the California Farm Bureau Federation says it’s like any other industry that employs large numbers of low-skilled workers; growers look for “every opportunity” to cut labor costs, and technology is part of that.\nBryan Little, director of employment policy at the farm bureau, said for the past 25 years, more and more agricultural products -– including tomatoes, raisins and nuts -– are being harvested by machine. As labor costs go up, Little said, farmers decide what to grow partly on how easily production can be mechanized.\n“There’s a lot more interest in growing almonds, walnuts, pistachios, other types of tree nuts that can be harvested with a crew of four or five people,” said Little, explaining that machines can shake nuts from a tree, without harming color or texture. Not so for a strawberry or melons.\nHe said if there were a statewide $15 minimum wage, farming would likely become more mechanized.\n“You’d see more interest in developing commodities that can be machine harvested, or (growers) changing to commodities that lend themselves to machine harvesting,” Little said.\nWhen automation happens, it may not be so bad\nRecent economic research suggests that job loss does occur following minimum wage increases, but the losses are evened out by other job gains.\nChicago-area economists who analyzed employment data between 1999 and 2009 found for every 10 percent increase in the minimum wage, low-wage jobs that involve routine cognitive tasks -– such as cashiers — declined 1.5 percent a year or two after the hike. The researchers inferred the decline was caused by technology replacing workers.\n“At the same time, there was this employment growth in jobs that are not easily replaced by technology, “ said Brian Phelan, assistant professor of economics at the Driehaus College of Business at DePaul University.\nBut Phelan says the kinds of increases being proposed and implemented in California could accelerate automation in the workplace. The balance between job losses and gains he found in more modest minimum wage increases may not hold in other wage hike scenarios.\nHowever, a different economist says the falling price of technology, not minimum wage increases, is a more significant driver of automation in the workplace.\n“Increasing the minimum wage to $15 isn’t going to change very much at all,” said Michael Reich, economics professor and director of the Institute for Research on Labor and Employment at UC Berkeley.\n“It (would) be a little bump on the road compared to the big effects of the cheapening price of technology.”\nReich said technological substitution in the workplace is not necessarily a net job destroyer. A firm could expand and hire more workers. Or jobs may reappear in other industries. In restaurants, former cashiers could be trained as cooks.\n“It means the job has been displaced, but not necessarily the worker,” he said.\nPreparing for the Los Angeles minimum wage increase\nBack at Town and Country Event Rentals in Los Angeles, owner LoGuercio is still crunching numbers about how his manual-labor heavy, service-oriented business will account for the $15 wage increase by 2020.\n“If I could find robots … to load trucks, I would do that,” LoGuercio said.\nHe hasn’t decided what he’ll do with the workers who used to be dishwashers, but he may move them to other jobs within the company. He’s also looking into an online ordering system, which would eliminate the need for one or two office positions.\nBut LoGuercio says, he has acquired one new “expensive” worker because of Los Angeles’ wage increase: a chief financial officer. While he says he considers himself an experienced entrepreneur, when it comes to figuring out the variables created by the upcoming wage increase, he needs help.\n“I’m not that smart.”","url":"https://calmatters.org/articles/will-california-wage-hikes-replace-workers-with-machines/"}
