{"authors":["Alani Vargas"],"date_download":"2018-10-31 01:53:16","date_modify":"2018-10-31 01:53:16","date_publish":"2018-08-27 15:56:34","description":"It's been a while. Almost too long since the last glimpse of Game of Thrones news or footage. Or new anything. This time last year, the seventh season was just finishing up, and there was no promise of a new episode until 2019. But HBO just gave…","filename":"data/vaneerConsumption/WillJonAryaReuniteInGameOfThronesNewSeason8FootageTeasesAStarkFamilyHomecomingVIDEO.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/f0c5ec1a-1a44-434f-913f-66098ad29a4b-63f38aaab0ee09337e31d21c54adbefd913e1553d24aca0154b7bfea0a91a924a97f45e8b28a94502b546b8a638e6c7f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-jon-arya-reunite-in-game-of-thrones-new-season-8-footage-teases-a-stark-family-homecoming-video-10244186_1540950796.html","title":"Will Jon & Arya Reunite In 'Game Of Thrones'? New Season 8 Footage Teases A Stark Family Homecoming - VIDEO","title_page":"Will Jon & Arya Reunite In 'Game Of Thrones'? New Season 8 Footage Teases A Stark Family Homecoming — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"It's been a while. Almost too long since the last glimpse of Game of Thrones news or footage. Or new anything. This time last year, the seventh season was just finishing up, and there was no promise of a new episode until 2019. But HBO just gave fans a new, brief look at the upcoming final season with some new Game of Thrones footage. While fleeting, it's at least something for obsessed fans to hang onto until the actual release of the trailer. And, the footage raised one very important question for fans: will Jon Snow and Arya reunite in Game of Thrones Season 8?\nFans of the show are understandably very hungry for this new content, and even though it's literally two seconds, it shows a very important Stark family reunion. But, it isn't quite the reunion everyone has been hoping for. The footage aired on HBO before the season finale of Sharp Objects as part of a promo for their slate of original shows, which included new footage and first looks at upcoming seasons of Big Little Lies, True Detective, and more. There is previous footage from GoT fans will recognize in the clip — fire-swords, Jon Snow on a ledge, and Daenerys asking, \"Shall we begin?\" But the new bit comes at about the 1:10 mark in the new HBO sizzle reel, it shows Jon embrace Sansa. Fans were none too pleased that this was all they got after such a long time.\nHBO on YouTube\nThe new footage appears to be from when Sansa and Jon will reunite after Jon's time fighting the White Walkers with Daenerys (though nothing is certain). And judging by Sansa's glare, she is not at all excited about her new could-be-sister-in-law-and-possible-future-queen showing up at Winterfell. Imagine what look she'll give when she — along with everyone — finds out Jon and Daenerys are actually related.\nOf course, Jon and Sansa previously had an emotional reunion, so some fans weren't pleased when they found out the Stark reunion in the new Game of Thrones Season 8 footage was between Jon and Sansa, not Jon and Arya. Arya and Jon haven't seen each other since Season 1, when they had a pretty close brother-sister relationship, and they only narrowly missed each other in Season 7, which frustrated some. Still, seeing Jon with at least one of his sisters is promising. And, if he's reuniting with Sansa, one can hope that he will also be seeing Arya, as last time fans saw the Stark girls, they were together. Then again, knowing GoT, there won't be a lot of time for family time even if he and Arya are finally reunited. He made it, he's home, and now there are bigger things to focus on such as Cersei in the south, or Daenerys and her relation to Jon and the fact that maybe she could be pregnant now. Complicated doesn't even begin to cover it.\nEither way, fans are here. For. It!\nOf course, the new footage also had fans wondering when, exactly, Game of Thrones Season 8 will premiere. HBO has yet to announce an official premiere date; however, Entertainment Weekly confirmed that the show will premiere it's last season at the first half of 2019. There had been rumors that it was delayed, but EW reports that \"HBO expects the show will air all its episodes in time for the 2019 Emmy eligibility cut off.\" That Emmy cut off is at the end of April, early May. So, if everything goes according to plan, fans have less than a year to wait before they can see the Jon and Sansa reunion teased in the new footage as well as (hopefully) a Jon and Arya moment. All in all, it looks like the next, and final, season is shaping up to be the most epic yet.","url":"https://www.bustle.com/p/will-jon-arya-reunite-in-game-of-thrones-new-season-8-footage-teases-a-stark-family-homecoming-video-10244186"}
