{"authors":["Kristie Rohwedder"],"date_download":"2018-10-31 01:43:01","date_modify":"2018-10-31 01:43:01","date_publish":"2018-08-27 22:59:13","description":"SUR's younger brother is open for business and ready for its closeup. Bravo megastar and revered restauranteur Lisa Vanderpump recently told Entertainment Tonight that Tom Tom will be on Vanderpump Rules Season 7, because duh. Tom Tom officially…","filename":"data/vaneerConsumption/WillTomTomBeOnVanderpumpRulesLisaVanderpumpHintedAtHowOftenTheBarWillAppearVIDEO.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/5c4ca6f4-f562-41d3-8dd8-e8f2a4d86044-getty-996814584.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-tom-tom-be-on-vanderpump-rules-lisa-vanderpump-hinted-at-how-often-the-bar-will-appear-video-10257440_1540950181.html","title":"Will Tom Tom Be On ‘Vanderpump Rules’? Lisa Vanderpump Hinted At How Often The Bar Will Appear - VIDEO","title_page":"Will Tom Tom Be On ‘Vanderpump Rules’? Lisa Vanderpump Hinted At How Often The Bar Will Appear — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"SUR's younger brother is open for business and ready for its closeup. Bravo megastar and revered restauranteur Lisa Vanderpump recently told Entertainment Tonight that Tom Tom will be on Vanderpump Rules Season 7, because duh. Tom Tom officially opened the second week of August, Vanderpump Rules Season 7 has been filming all summer, so uh, please grab a calculator. Go ahead and do the Sexy Unique Math.\nTiming aside, Pump Rules wouldn’t spend all of Season 6 showing us devoted fans the dry ice, sweat, and beers that went into LVP, Ken Todd, Tom Sandoval, and Tom Schwartz’s bar but then rein it on Season 7. Time and time again, Pump Rules has proven to be a perfect reality TV show, and a perfect reality show wouldn't let us get invested in something like the Tom Tom saga only to not show us the Sexy Unique Resolution. You can't put the toothpaste back in the tube. Especially when that toothpaste is full of absinthe and habanero crystals.\nFret not, SUR heads: Though Tom Tom’s launch will definitely be part of Season 7, this does not mean the restaurant where the reality show began has stepped down from its throne. LVP’s Sexy Unique Restaurant remains at the center of Pump Rules, the Sexy Unique Sun the Pump Rules cast orbits.\nEntertainment Tonight on YouTube\nAs Vanderpump told Entertainment Tonight,\n“With Tom Tom, you know, it's going to be slightly different. The main focus of the story has always been on SUR, and I think that’s the root of Vanderpump Rules. But yeah, of course we covered a lot of [Tom Tom]. And I think also the viewer will be fascinated just by watching the progress.”\nYes, Tom Tom will be part of the forthcoming season (because, once again, duh), but it will not overthrow the restaurant where this whole adventure began; it sounds like Pump Rules is still very much SUR's series. When Entertainment Tonight asked LVP if the members of the Pump Rules cast might pivot away from SUR and start spending more time at Tom Tom, the Real Housewives of Beverly Hills star replied,\n“Well, that’ll be another season. I mean, we’re coming to the end of filming quite a few months, as you know. I think you’ll see [Tom Tom] play out and you’ll see the development and the design.”\nAh, right. The RHOBH spinoff began filming at the beginning of the summer, and Tom Tom wasn’t even open for business until a few weeks ago. So even if the cast wanted to spend all of Season 7 hanging out at Tom Tom instead of SUR, it’d basically be one Season 6 progress party after another. A progress party is fun and all, but sometimes you aren't in the mood to drink out of a plastic cup and keep an eye out for any exposed nails.\nSometimes you are in the mood to plop down on a velour armchair, chow down on deep fried goat cheese balls, knock back some sangria, and bask in SUR's fuchsia glow.\nThankfully, there's room for SUR and Tom Tom on this great series. What an embar—SUR-sment of riches.","url":"https://www.bustle.com/p/will-tom-tom-be-on-vanderpump-rules-lisa-vanderpump-hinted-at-how-often-the-bar-will-appear-video-10257440"}
