{"authors":["Compiled Democrat-Gazette Staff Wire Reports"],"date_download":"2018-10-30 21:18:11","date_modify":"2018-10-30 21:18:11","date_publish":"2016-07-01 00:00:00","description":"Attorney General Loretta Lynch, conceding that her airport meeting with former President Bill Clinton this week had cast a shadow over a federal investigation of Hillary Clinton's personal email account, said Friday that she would accept whatever recommendations career prosecutors and the FBI director make about whether to press charges in the case.","filename":"data/vaneerConsumption/WillacceptfindingsonClintonAGsays.json","image_url":"https://media.arkansasonline.com/img/photos/2016/07/01/resized_250499-aptopix-campaign-2016_jenk_1-21441_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_jul_02__1540934291.html","title":"Will accept findings on Clinton, AG says","title_page":"Will accept findings on Clinton, AG says","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Attorney General Loretta Lynch said Friday that her airport encounter with former President Bill Clinton was a purely social encounter. “He said hello and we basically said hello, and congratulated him on his grandchildren, as people do,” she said. “That led to a conversation about those grandchildren.” - Photo by AP / JORDAN CURET\nWASHINGTON -- Attorney General Loretta Lynch, conceding that her airport meeting with former President Bill Clinton this week had cast a shadow over a federal investigation of Hillary Clinton's personal email account, said Friday that she would accept whatever recommendations career prosecutors and the FBI director make about whether to press charges in the case.\nPhoto by DON RYAN / AP\nFormer President Bill Clinton, shown here May 5, declined to comment on Attorney General Loretta Lynch’s remarks about their meeting.\n\"I will be accepting their recommendations,\" Lynch said in an appearance at the Aspen Ideas Festival in Colorado. She said, \"The case will be resolved by the same team that has been working on it from the beginning.\"\nThe attorney general said she had decided several months ago to defer to the recommendations of her staff and of the director of the FBI because her status as a political appointee sitting in judgment on a politically charged case would raise questions of a conflict of interest.\nThe meeting with Bill Clinton, she acknowledged, only deepened those questions, and she said she felt compelled to publicly explain her reasoning to try to put concerns to rest.\n\"I think that people have a whole host of reasons to have questions about how we in government do our business and how we handle business and how we handle matters,\" Lynch said. \"And I think that, again, I understand that my meeting on the plane with former President Clinton could give them another reason to have questions and concerns.\"\nWhile she insisted that the meeting was a purely social encounter, Lynch said, \"I certainly wouldn't do it again.\"\nLynch described the questions raised by her meeting as personally distressing for her because they stained the reputation of the Justice Department.\n\"The fact that the meeting that I had is now casting a shadow over how people are going to view that work is something that I take seriously and deeply and painfully,\" she said.\nRepublicans said the meeting, which took place at the Phoenix airport, had compromised the independence of the investigation as the FBI was winding it down. Some called for Lynch to recuse herself, but she did not take herself off the case.\nLynch said she wants to handle the Clinton investigation like any other case. Since the attorney general often follows the recommendations of career prosecutors, Lynch is keeping the regular process largely intact.\nThe FBI is investigating whether the presumptive Democratic presidential nominee, her aides or anyone else broke the law by setting up a private email server for her to use as secretary of state. Internal investigators have concluded that the server was used to send classified information, and Republicans have seized on the matter to question Clinton's judgment.\nFor the Justice Department, the central question is whether the conduct met the legal standard for the crime of mishandling classified information.\nLynch said the meeting with Bill Clinton was unplanned, largely social and did not touch on the email investigation. She suggested that he walked uninvited from his plane to her government plane, both of which were parked on a tarmac at Phoenix Sky Harbor International Airport. Clinton first appointed Lynch as a U.S. attorney in 1999.\n\"He said hello and we basically said hello, and congratulated him on his grandchildren, as people do,\" she said Friday. \"That led to a conversation about those grandchildren.\"\nLynch's account has not mollified Republican lawmakers, who said the meeting raised questions about the integrity of the government's investigation.\n\"In light of the apparent conflicts of interest, I have called repeatedly on Attorney General Lynch to appoint a special counsel to ensure the investigation is as far from politics as possible,\" Sen. John Cornyn, R-Texas, and a member of the Judiciary Committee, said in a statement released Thursday.\nThe meeting created an awkward situation for Lynch, a veteran prosecutor who was nominated from outside Washington's normal political circles. In her confirmation, her allies repeatedly sought to contrast her with her predecessor, Eric Holder, an outspoken liberal voice in the administration who clashed frequently with Republicans who accused him of politicizing the office.\nHer reassurance that she will not overrule her investigators is significant. When the FBI sought to bring felony charges against David Petraeus, the former CIA director, for mishandling classified information and lying about it, Holder stepped in and reduced the charge to a misdemeanor. That decision created a deep -- and public -- rift.\nThe FBI is expected to make a recommendation to the Justice Department in the coming weeks, though agents have yet to interview Hillary Clinton. While some legal experts said they believed that criminal indictments in the case were unlikely, the investigation continues to cast a shadow over her campaign.\nDonald Trump, the presumptive Republican presidential nominee, seized on the private encounter, describing it in a radio interview as a \"sneak\" meeting and saying it exposed the rigged nature of the process.\n\"Bill's meeting was probably initiated and demanded by Hillary,\" Trump tweeted, without offering evidence. \"Does anybody really believe that meeting was just a coincidence?\"\nCongressional Republicans also seized on the meeting between the former president and the attorney general.\nRep. Steve Scalise of Louisiana, the third-ranking House Republican, said Lynch should recuse herself entirely from the case and appoint a special prosecutor. Lynch had said she would still be briefed on the investigation and review the results but let the career officials make the call on whether a prosecution should go ahead.\n\"The notion that the prosecutor, the person who runs the Justice Department, would spend 30 minutes in a private conversation with the spouse of someone her department is investigating raises all sorts of red flags, and even Democrats have admitted it,\" GOP Sen. Marco Rubio of Florida said on Miami 610 WIOD Radio.\nSen. Chris Coons, a Democrat from Delaware, admitted on CNN's New Day that the meeting \"doesn't send the right signal.\" While he said he believed that Lynch was an independent prosecutor, \"I think she should have steered clear, even of a brief, casual, social meeting with the former president.\"\nThe Clinton campaign declined to comment on Lynch's remarks. Bill Clinton also declined through spokesmen to comment on Lynch's remarks.\nBeyond the day-to-day workings of the Justice Department, there is precedent for explicitly relying on career officials to make politically charged decisions. When the Justice Department was considering whether to recommend sanctions against former George W. Bush administration lawyers who approved waterboarding, Holder relied on his most senior career prosecutor to make the decision. No sanctions were recommended.\nInformation for this article was contributed by Mark Landler and Matt Apuzzo of The New York Times and by Eric Tucker of The Associated Press.\nA Section on 07/02/2016","url":"https://www.arkansasonline.com/news/2016/jul/02/will-accept-findings-on-clinton-ag-says/"}
