{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 18:53:22","date_modify":"2018-10-30 18:53:22","date_publish":"2016-04-27 22:49:48","description":"Funnyman Will Ferrell is set to play former president Ronald Reagan in a new comedy film that sees the 40th president of the United States stricken with dementia in his second term in office. | Entertainment","filename":"data/vaneerConsumption/WillFerrelltoPlayRonaldReaganwithDementiainNewComedy.json","image_url":"https://media.breitbart.com/media/2016/04/Will-Ferrell.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_04_27__1540925602.html","title":"Will Ferrell to Play Ronald Reagan with Dementia in New Comedy","title_page":"Will Ferrell to Play Ronald Reagan with Dementia in New Comedy | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Funnyman Will Ferrell is set to play former president Ronald Reagan in a new comedy film that sees the 40th president of the United States stricken with dementia in his second term in office.\nAccording to Variety, the 48-year-old actor will star as Reagan in the fictionalized film about the former president.\nThe story — described as a “hilarious political satire” — is set shortly after Reagan wins a second term in a landslide in 1984. As the president suffers from dementia, a young intern must convince him that he is an actor in a movie where he is playing the president.\nThe script hails from TV and short film actor-writer Mike Rosolio.\nIn addition to starring, Ferrell will also produce the project under his Gary Sanchez Productions outfit. Gary Sanchez has produced most of Ferrell’s comedy films, including Step Brothers, Anchorman 2, Get Hard, Daddy’s Home and The Boss.\nNo director is currently attached to the project.\nPresident Reagan was diagnosed with Alzheimer’s disease in 1994, five years after he left office. The left viciously attacked him during the later years of his life, questioning whether he had presided over the country in a weakened state of mind. The fact that the film’s plot appears to center on Reagan’s mental health seems like yet another attempt to discredit him despite his impressive achievements as one of the greatest president’s in American history. It is especially upsetting given the film was greenlit so soon after the death of Nancy Reagan, who was a tireless defender of her husband’s legacy in office.\nReagan landed on the 2015 Black List, an annual list of the best unproduced screenplays in Hollywood. In February, Black List Live! hosted a live read of Reagan at Hollywood’s Montalban Theatre, with Girls star Lena Dunham in the role of iconic Reagan speechwriter Peggy Noonan and John Cho (Star Trek) as the young aide to the president.\nAccording to Deadline, former First Lady Nancy Reagan does not appear in the script, though her astrologer does.\nFerrell has tried his hand at political acting before; he played George W. Bush in the popular one-man Broadway show (and later HBO special) You’re Welcome America, and previously starred in the political comedy The Campaign alongside Zach Galifianakis.\nFerrell is also the co-founder of liberal comedy outlet Funny or Die, along with friend and frequent collaborator Adam McKay.\nFollow Daniel Nussbaum on Twitter: @dznussbaum","url":"https://www.breitbart.com/entertainment/2016/04/27/will-ferrell-play-ronald-reagan-dementia-new-movie/"}
