{"authors":[],"date_download":"2018-10-30 19:34:14","date_modify":"2018-10-30 19:34:14","date_publish":"2018-08-29 18:16:00","description":"When the College Football Playoff selection committee released its first set of rankings last season...","filename":"data/vaneerConsumption/WillnonconferenceschedulehurtGeorgiasplayoffchances.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/07/Videos/4433514.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_will-non-conference-_0131b04ddeb101462ee96f61fb660769__1540928054.html","title":"Will non-conference schedule hurt Georgia's playoff chances?","title_page":"Will non-conference schedule hurt Georgia's playoff chances?","title_rss":"NULL","source_domain":"ajc.com","text":"When the College Football Playoff selection committee released its first set of rankings last season, Georgia was No. 1. And the committee made it clear why: because the Bulldogs had chosen to schedule a tough game at Notre Dame – and won.\nGeorgia doesn’t have such a marquee game on its non-conference schedule this season.\nFar from it, in fact.\nThe Bulldogs play eight SEC games and Georgia Tech each season, leaving flexibility to schedule three other non-conference opponents. This season, those three are Austin Peay in Saturday’s opener, Middle Tennessee on Sept. 15 and Massachusetts on Nov. 17 – none of which will impress the playoff committee (or most UGA fans, for that matter).\nIf Georgia goes undefeated and wins the SEC championship, its schedule won’t matter; it will be in the playoff. But if the Bulldogs are on the bubble – say, one of two or three teams vying for the fourth spot in the playoff – the weak non-conference schedule could be costly, given the selection committee’s instruction that playoff-aspiring teams should bolster their out-of-league competition.\nIn general, Georgia’s program under coach Kirby Smart seems to be heeding that mandate. But this season is a glaring exception.\n“Kirby is really clear that he wants to schedule two non-conference Power 5 opponents whenever it’s possible,” said Georgia athletic director Greg McGarity, meaning Tech and another opponent from the five power conferences. “But there are some years where it just doesn’t work out.\n“Our desire is at every opportunity to play two Power 5 (non-SEC) opponents – sometimes it’s a home-and-home game; sometimes it’s a neutral-site game. But there are just so many factors that go into scheduling that you try to get the best matchup that works for both teams.”\nNext season, one of Georgia’s non-conference games will be against Notre Dame in Athens. In 2020 and 2022, Georgia has games against Virginia and Oregon, respectively, both in Atlanta’s Chick-fil-A Kickoff event. In 2025 and 2026, the Bulldogs have a home-and-home series with UCLA. Discussions are underway with marquee opponents, including Texas and Clemson, regarding future games.\n“We’re trying to reach out to institutions to first see if they would like to play a home-and-home series, but if not, certainly at a neutral site,” McGarity said. “The destination is really important (in home-and-home games). We’ve talked about going to iconic venues.\n“We would love to play a home-and-home with Texas, because our fans would be excited to go to Austin. Josh (Lee, director of football operations) is in touch with a lot of schools that bring that prestige to fans’ trips to a destination they can really get hyped up about.”\nThe Notre Dame and UCLA series were scheduled before Smart became Georgia’s coach after the 2015 season. At that point, it was fairly late in the scheduling process to add a major opponent for 2018. But it wasn’t impossible: Saturday’s Auburn-Washington matchup, for example, was put together in late 2016.\nAside from the Georgia Tech game, Georgia has had a second Power 5 non-SEC opponent in nine of the past 12 years – Colorado in 2006, Oklahoma State in 2007, Arizona State in 2008, Oklahoma State in 2009, Colorado in 2010, Clemson in 2013 and 2014, North Carolina in 2016 and Notre Dame last season.\nFor now, of course, Smart doesn’t want the focus to be on who Georgia is or isn’t playing.\n“We tell our guys all the time we play to a standard,” Smart said. “It doesn't matter whether we're playing Florida, Austin Peay, South Carolina. … Our standard is to go out and dominate the opponent physically, mentally, wear them down.\n“When we go out to practice, we’re trying to be the best team in the country so that when we get in the game we can dominate people physically and not really worry about the scoreboard or who we’re playing.”","url":"https://www.ajc.com/sports/will-non-conference-schedule-hurt-georgia-playoff-chances/m4GZdh5K4QmSXxFA0j9PuL/"}
