{"authors":["Lydia Willgress For Mailonline"],"date_download":"2018-10-22 23:29:42","date_modify":"2018-10-22 23:29:42","date_publish":"2016-01-29 11:24:30","description":"The 47-year-old, who last week announced he will not be attending this year's ceremony in LA, claimed the industry is regressing over its attitude towards race while speaking on Good Morning Britain.","filename":"data/vaneerConsumption/WillSmithwarnsHollywoodisregressingoveritsattitudetowardsrace.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B09A5A00000578-0-image-a-18_1454066532783.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422535_It-s-criminal-Smith-warns-Hollywood-regressing-attitude-race-insists-Oscars-boycott-not-didn-t-nominated_1540250982.html","title":"Will Smith warns Hollywood is regressing over its attitude towards race","title_page":"Will Smith warns Hollywood is regressing over its attitude towards race | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Will Smith has slammed Hollywood's 'almost criminal' attitude towards diversity as he insisted his Oscars boycott is nothing to do with not receiving a nomination.\nThe 47-year-old, who last week announced he will not be attending this year's ceremony, claimed the industry is regressing over its attitude towards race.\nThe actor, speaking on Good Morning Britain, also revealed he wants to be 'part of the solution' as the diversity row continued following the release of this year's nominations.\nScroll down for video\nWill Smith has slammed Hollywood's 'almost criminal' attitude towards diversity as he insisted his Oscars boycott is nothing to do with not receiving a nomination. He made the comments on ITV'S Good Morning Britain (interview pictured above)\nIn a clearly emotional interview, the actor touched on subjects including the Oscars, diversity and race. He is pictured on Good Morning Britain\nSpeaking on the ITV show, he said: '[My Oscars boycott] has nothing to do with me being nominated or not or wanting to win awards or not. That's so frivolous.\n'For me the issue is, I believe diversity is America's superpower. I think that's what makes our country great and special.\n'If the image coming out of Hollywood narrows, it's almost criminal. It's like we're narrowing the collective American imagination and that to me is the issue.'\nMr Smith, who is currently promoting his new film Concussion, refused to blame anyone for the attitude towards diversity.\nThe 47-year-old, who last week announced he will not be attending this year's ceremony, claimed the industry is regressing over its attitude towards race. He is pictured arriving at Radio 2 this morning to promote his new film Concussion\nThe actor, who made the comments on Good Morning Britain, also revealed he wants to be 'part of the solution' as the row over race continued following the release of this year's nominations. He is pictured signing autographs at Radio 2 this morning\nHe said: 'This is not about us and them, it's about we.\n'I'm a member of the Academy, so this is a problem that we all have to solve collectively. For me the only reason it's an issue this year is because it feels like a regression.\n'There is something happening in our country that's being reflected in Hollywood, that's being reflected in the Academy that I for one want to be a part of making the adjustment. I want to be part of the solution.'\nHis comments come after this year's Oscars nominations were released and only included white actors in the major categories.\nHe was prompted to boycott the ceremony after his wife Jada Pinkett Smith released a video on Facebook urging people not to go. The couple are pictured together at the 86th annual Academy Awards last year\nHe was prompted to boycott the ceremony after his wife Jada Pinkett Smith released a video on Facebook urging people not to go.\nHer call to action was also picked up by other prominent figures including David Oyelowo, Idris Elba and Whoopi Goldberg, who publicly criticized the Academy for failing to include minorities in this year’s list of nominees.\nMany people expected Mr Smith to pick up a lead actor nomination for his role in Concussion.","url":"https://www.dailymail.co.uk/news/article-3422535/It-s-criminal-Smith-warns-Hollywood-regressing-attitude-race-insists-Oscars-boycott-not-didn-t-nominated.html"}
