{"authors":["Associated Press"],"date_download":"2018-10-22 22:21:57","date_modify":"2018-10-22 22:21:57","date_publish":"2017-03-16 03:14:14","description":"HOUSTON (AP) - Lou Williams scored 30 points against his former team and James Harden had his 17th triple-double of the season to lead the Houston Rockets...","filename":"data/vaneerConsumption/WilliamsHardensendRocketsto139100winoverLakers.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/03/wire-226087-1489634059-567_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318748_Williams-Harden-send-Rockets-139-100-win-Lakers_1540246917.html","title":"Williams, Harden send Rockets to 139-100 win over Lakers","title_page":"Williams, Harden send Rockets to 139-100 win over Lakers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"HOUSTON (AP) - Lou Williams scored 30 points against his former team and James Harden had his 17th triple-double of the season to lead the Houston Rockets over the Los Angeles Lakers 139-100 on Wednesday night.\nHarden had 18 points, 13 assists and 12 rebounds as Houston handed the Lakers their 11th loss in 12 games.\nWilliams broke out of a recent shooting slump against his ex-teammates. Houston sent Corey Brewer and a first-round draft pick to Los Angeles in a trade for Williams three weeks ago.\nHouston Rockets' Montrezl Harrell (5) dunks against the Los Angeles Lakers during the second half of an NBA basketball game Wednesday, March 15, 2017, in Houston. The Rockets won 139-100. (AP Photo/David J. Phillip)\nThe deal paid off for the Rockets on Wednesday night as Williams went 7 for 9 from beyond the arc and made his first seven field goal attempts, including four straight 3-pointers.\nMeanwhile, Brewer had four points in 21 minutes.\nWith D'Angelo Russell struggling to find a rhythm and in foul trouble much of the game, Los Angeles leaned heavily on Julius Randle, who gave Houston fits all night. Randle muscled his way into the paint for 32 points and eight rebounds.\nRookie forward Brandon Ingram and Jordan Clarkson both scored 18 points for Los Angeles.\nBut the Rockets' 3-point shooting proved overwhelming for the young Lakers as Houston drained 18 of 43 from outside the arc (41.9 percent).\nHouston led 66-52 at halftime and outscored the Lakers in every quarter. Houston won by 39 points, the same margin of victory as the last time it played the Lakers, a 134-95 rout in Los Angeles on Dec. 7.\nNick Young was back in the starting lineup for the Lakers, but his shooting woes continued. Young went 0 for 9 from the field, including 0 for 7 from 3-point territory.\nTIP-INS\nLakers: Russell fouled out when he was called for an offensive foul with seven minutes remaining. ... Former Rockets Brewer, Tyler Ennis, Thomas Robinson, Tarik Black and Metta World Peace all played in the game for Los Angeles.\nRockets: Houston has won nine of its last 11 against the Lakers and taken four straight season series for the first time in franchise history. . Harden had nine of Houston's 19 turnovers, largely on wild passes.\nUP NEXT\nLakers: Host the Milwaukee Bucks on Friday.\nRockets: Visit the New Orleans Pelicans on Friday.\nHouston Rockets' Clint Capela (15) goes up to dunk as Los Angeles Lakers' Corey Brewer defends during the first half of an NBA basketball game Wednesday, March 15, 2017, in Houston. (AP Photo/David J. Phillip)\nHouston Rockets' James Harden (13) goes up for a shot against the Los Angeles Lakers during the first half of an NBA basketball game Wednesday, March 15, 2017, in Houston. (AP Photo/David J. Phillip)\nLos Angeles Lakers' Julius Randle (30) goes up for a shot as Houston Rockets' Trevor Ariza (1) defends during the first half of an NBA basketball game Wednesday, March 15, 2017, in Houston. (AP Photo/David J. Phillip)\nLos Angeles Lakers' Jordan Clarkson (6) goes up for a shot as Houston Rockets' Nene (42) defends during the first half of an NBA basketball game Wednesday, March 15, 2017, in Houston. (AP Photo/David J. Phillip)\nLos Angeles Lakers coach Luke Walton questions the officials during the first half of the team's NBA basketball game against the Houston Rockets on Wednesday, March 15, 2017, in Houston. (AP Photo/David J. Phillip)\nLos Angeles Lakers' David Nwaba (10) goes up for a shot as Houston Rockets' James Harden, right, defends during the second half of an NBA basketball game Wednesday, March 15, 2017, in Houston. (AP Photo/David J. Phillip)\nLos Angeles Lakers' David Nwaba (10) goes up for a shot as Houston Rockets' James Harden watches during the second half of an NBA basketball game Wednesday, March 15, 2017, in Houston. (AP Photo/David J. Phillip)\nHouston Rockets' Lou Williams (12) shoots as Los Angeles Lakers' David Nwaba (10) defends during the second half of an NBA basketball game Wednesday, March 15, 2017, in Houston. The Rockets won 139-100. (AP Photo/David J. Phillip)\nHouston Rockets' James Harden celebrates after a Sam Dekker dunk against the Los Angeles Lakers during the second half of an NBA basketball game Wednesday, March 15, 2017, in Houston. The Rockets won 139-100. (AP Photo/David J. Phillip)","url":"https://www.dailymail.co.uk/wires/ap/article-4318748/Williams-Harden-send-Rockets-139-100-win-Lakers.html"}
