{"authors":["Associated Press"],"date_download":"2018-10-23 00:07:57","date_modify":"2018-10-23 00:07:57","date_publish":"2016-01-28 13:40:33","description":"LONDON (AP) — Claire Williams still feels like a \"little girl\" during talks with the male-dominated titans of Formula One and she has set herself a mission f...","filename":"data/vaneerConsumption/WilliamsfeelslikelittlegirlinF1wantstobebraver.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420947_Williams-feels-like-little-girl-F1-wants-braver_1540253277.html","title":"Williams feels like 'little girl' in F1, wants to be braver","title_page":"Williams feels like 'little girl' in F1, wants to be braver | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Williams feels like 'little girl' in F1, wants to be braver\nLONDON (AP) — Claire Williams still feels like a \"little girl\" during talks with the male-dominated titans of Formula One and she has set herself a mission for the new season: Be braver and fight more for her team.\nThe 39-year-old Williams is preparing for her fourth season as deputy team principal of Williams, in day-to-day control under her father Frank.\n\"Our sport is very male dominated and sometimes I am the only girl in the room,\" Williams said at a Sport Industry Group event for future leaders. \"I sit in a room with the likes of (F1 commercial supremo) Bernie Ecclestone, (FIA President) Jean Todt, (Red Bull's) Christian Horner, (Mercedes') Toto Wolf. All these amazingly big names in our sport.\n\"I sometimes feel like I'm the little girl in the room ... sometimes I wish, when I'm responsible for fighting for my team and my team's position within our sport, (I'm) perhaps sometimes braver.\"\nWilliams won a combined 16 drivers' and constructors' titles in the 1980s and 90s but the team has not enjoyed similar glory in this century.\nWilliams reflected late Wednesday on inheriting a team on the \"way out\" but one she \"did not want to see die.\" The Mercedes-powered team has gone on to finish third in the constructors' championship for the last two years, despite having the fifth-biggest budget in the series at around $150 million.\nWithin Williams, though, there remains a sense of inferiority, despite being eclipsed by only Mercedes and Ferrari in 2015.\n\"I hate the expression 'underdog' — we have always been regarded as that,\" she said. \"I don't think you can call a team that's won 16 world championships an underdog. One of my other missions is to try and eliminate, eradicate this badge we have of 'underdog' because I actually think it can be very demoralizing for the people that work for you.\n\"We have 550 people and I have to try and inspire those people to go out and give blood, sweat, and tears, because that's what it takes if you are going to win in sport.\"\nAsked what she would prefer Williams to be known as rather than underdogs, Williams responded in a flash: \"Winners.\"\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3420947/Williams-feels-like-little-girl-F1-wants-braver.html"}
