{"authors":["Kayla Blanton"],"date_download":"2018-10-31 01:42:22","date_modify":"2018-10-31 01:42:22","date_publish":"2018-09-14 17:26:09","description":"We've watched Daniela, Olivia, Hannah, Ping, Nadine, Caroline, Ashley, Shanina, and Devon navigate their runway-walking lives for seven whole hour-long episodes. Now that the season finale is airing this week, fans will likely want to figure out if…","filename":"data/vaneerConsumption/WillModelSquadReturnForASecondSeasonItEndedWithSomeControversy.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/12/44942c24-03b2-4831-bdc7-7a4f291d715c-nup_184190_0297.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-model-squad-return-for-a-second-season-it-ended-with-some-controversy-11889894_1540950142.html","title":"Will 'Model Squad' Return For A Second Season? It Ended With Some Controversy","title_page":"Will 'Model Squad' Return For A Second Season? It Ended With Some Controversy","title_rss":"NULL","source_domain":"bustle.com","text":"We've watched Daniela, Olivia, Hannah, Ping, Nadine, Caroline, Ashley, Shanina, and Devon navigate their runway-walking lives for seven whole hour-long episodes. Now that the season finale is airing this week, fans will likely want to figure out if Model Squad will return for Season 2, or if the eight-part docuseries was just a one time thing.\nHere's to hoping that these beauty queens haven't graced your TV screens for the last time just yet, but whether or not they will reappear in a second season of Model Squad is unclear. E! has yet to confirm a renewal of the show, and none of the models have let out a peep of information regarding the future of the show. The reality of it is, it's unlikely that their busy, inconsistent lives will allow for continued filming, especially in the lead up to fashion week season. The life and schedule of a successful model is truly unpredictable.\nWith that said, the premiere season has revealed a lot of complex issues and happenings that go on behind the scenes of the modeling industry that so many people might have been unaware of, so there are surely more experiences to be documented in a second season. It just may not feature the same cast of girls. But when you think about it, a fresh batch of up-and-coming talent could make the show that much more interesting as it evolves.\nAs fans have learned, a career as a model is no walk in the park, and there are times when the pressure is more than even the best of the best can handle. Viewers watched Ping face stress in a position where youth was valued over her experience, Ashley make a cross-country move, Olivia shoot for the stars with a Sports Illustrated cover, and Caroline crumbles under pressure. Not to mention, the women have undergone their fair share of drama together. And of course, where there is drama, there is a larger story to be told.\nThat was the case in particular with the now-viral conversation among the women about diversity in fashion and modeling, which, is a timely and relevant topic. It's also one you'd think, by now, would be easily understood. But according to this clip, that's not exactly the case.\n\"I used to get bullied,\" Shanina Shaik, whose mother is Lithuanian and father is half Pakistani, half Arab, says to her fellow models in the video. \"Because of my skin color I wasn’t gonna be able to do high fashion. A lot of black girls would have to miss Milan because they weren’t able to walk in the shows because they don’t want girls of that colour.\" Most of the women nod in solidarity and agreement, except for Devon.\n\"I literally f*cking went through hell and literally lived in different countries like every other month, and didn’t speak that language,\" Devon, who is white, says in response to Shanina. \"I didn’t speak Paris, didn’t speak Italian. And I did that for like, two years.\" She goes on to complain about the upkeep of her blonde hair color. \"You know how hard it is to be blonde?\" she says. \"I have to get a highlight every month! Do you know how expensive that is?\"\nWhile it is true that reality TV is edited for dramatic effect, it's still hard to believe that those words came from Devon in a serious manner. She has since issued an apology on social media:\n\"I want to apologize for what I said. It goes without saying, that the comments in the show are incredibly insensitive,\" she wrote on Twitter. \"The majority of the conversation was edited and if a peer of mine wanted to discuss such a serious subject, I would never follow it with a joke ... I respect, honor [sic] and admire all of those breaking barriers and working to forge a new and inclusive community both in and outside of the modelling industry. I hope that I can continue to learn from others, I am always trying to be a better version of myself.\"\nSounds like some of the model squad has some soul searching to do — surely fans would love to see it come to fruition in a brand new season.","url":"https://www.bustle.com/p/will-model-squad-return-for-a-second-season-it-ended-with-some-controversy-11889894"}
