{"authors":["Julie Cart","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:08:37","date_modify":"2018-10-31 00:08:37","date_publish":"2017-04-07 21:56:36","description":"The California Democratic party's 'supermajority' was mightily tested with the nail-biting passage of a $52 billion transportation package, that will add 12 cents to the price of gasoline. What does that bode for another supermajority vote that could raise gas prices: the reauthorization of the the state's landmark climate change legislation, cap-and-trade?","filename":"data/vaneerConsumption/WillDemocratsgetanothersupermajorityvotethatcouldraisegasprices.json","image_url":"https://calmatters.org/wp-content/uploads/Air_pollution_smoke_rising_from_plant_tower-1024x672.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944517.html","title":"Will Democrats get another supermajority vote that could raise gas prices?","title_page":"Will Democrats get another supermajority vote that could raise gas prices? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The power of the California Democratic party’s ‘supermajority’ was mightily tested Thursday, with the nail-biting passage of a $52 billion transportation package, that will add 12 cents to the price of gasoline.\nWhat does that bode for the other big lift coming up in the legislature, the reauthorization of the the state’s landmark climate change legislation, cap-and-trade? The carbon auction system survived a court challenge Thursday—with the California appeals court affirming the legality of the program—but it’s an open question whether cap and trade can survive a bruising political battle and the likelihood of tacking on more to the price of gas at the pump.\nThe transportation bill was a squeaker, passing Thursday with a bare minimum of votes in both the Senate and Assembly. Last-minute concessions dragged the package over the line, but at the cost of exhaustion and, for some, distasteful compromise.\nIf an infrastructure funding bill is such a difficult sell, what does that mean for the future of cap-and-trade, which will require another two-thirds vote to pass?\n“Any two-thirds vote is difficult,” said Senator Bob Wieckowski (D-Fremont), who chairs the Senate Environmental Quality Committee. “With cap-and-trade, since 25 percent of money goes to disadvantaged communities, it’s a little lighter lift versus transportation package. That said, it’s still two-thirds.”\nSupporters of cap and trade are seeking a supermajority vote this year to affirm the program’s legal standing and eliminate doubts that have reduced participation in the state’s carbon market, which has allowed companies to trade permits at auction since 2012.\nThe original law, AB32, has a 2020 deadline for meeting its target of reducing greenhouse gas emissions to 1990 levels, and that has opened questions as to whether it can operate past that date. Critics say that the law is a an illegal tax because it passed with a simple majority vote. A two-thirds vote to extend the program would resolve both questions.\nThe court also settled the tax point, although there are other potential legal challenges ahead.\nCap and Trade Explained in Two and a Half Minutes from CALmatters on Vimeo.\nLegislators are still discussing whether to extend AB32 as it exists or to shape an entirely new bill, possibly with an emphasis on environmental justice issues. There are varying versions of what a new or rejiggered cap-and-trade program might look like—continuing the carbon auctions or converting to a carbon tax. Those developments are open ended.\nBut if the program is extended in its current form, the price of allowances could greatly increase, according to a nonpartisan analysis. Depending on allowance prices, the cost of gas could rise from 15 to 73 cents per gallon by 2031, according to the Legislative Analyst’s Office.\nLegislators are understandably sensitive to a dramatic hike in gasoline prices, a core pocketbook issue for voters.\nSenator Ted Gaines (R-El Dorado), who voted against the transportation bill, said permanent gas taxes hurt the most vulnerable.\n“There seems to be some confusion in the legislature about the war on poverty,” Gaines said in a statement. “We should be fighting to end it, not create it. But with this new gas tax we will be serving up poverty by the gallon to millions of families and businesses around the state.”\nIn any event, cap-and-trade lived to fight another day, thanks to a 2-1 ruling from the 3rd District Court of Appeal in Sacramento, which agreed with the state Air Resources Board that it has the authority to regulate polluters. The years-long case had clouded the future of cap-and-trade, with sluggish interest in the state’s auctions. The February quarterly allowance auction was another bust, with just 16.5 percent of the emission allowances sold. The next auction is in May.\nAnalysts say that the future for cap-and-trade will not be truly assured until it is enshrined in law and not subject to continual legal challenges. Gov. Brown as asked the legislature to reauthorize the program with a two-thirds vote, but even the Democrat-heavy state house is not committing to anything. Yet.","url":"https://calmatters.org/articles/will-democrats-get-another-supermajority-vote-raise-gas-prices/"}
