{"authors":["Rebecca Patton"],"date_download":"2018-10-31 01:42:31","date_modify":"2018-10-31 01:42:31","date_publish":"2018-09-14 16:58:38","description":"Animation, fantasy, and dragon aficionados will be happy to learn that The Dragon Prince arrived Friday, Sept. 14 on Netflix. The animated series centers around three kids: Callum (Jack De Sena), Ezran (Sasha Rojen), and Rayla (Paula Burrows). Rayla…","filename":"data/vaneerConsumption/WillTheDragonPrinceReturnforSeason2NetflixsNewAnimatedFantasyInvolvesDragonsElvesandMagic.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/3fd877ae-4be6-41dc-839e-7cfb8082696d-callumrayla.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-the-dragon-prince-return-for-season-2-netflixs-new-animated-fantasy-involves-dragons-elves-magic-11897996_1540950151.html","title":"Will 'The Dragon Prince' Return for Season 2? Netflix's New Animated Fantasy Involves Dragons, Elves, and Magic","title_page":"Will 'The Dragon Prince' Return for Season 2? Netflix's New Animated Fantasy Involves Dragons, Elves, and Magic","title_rss":"NULL","source_domain":"bustle.com","text":"Animation, fantasy, and dragon aficionados will be happy to learn that The Dragon Prince arrived Friday, Sept. 14 on Netflix. The animated series centers around three kids: Callum (Jack De Sena), Ezran (Sasha Rojen), and Rayla (Paula Burrows). Rayla is an elven assassin, according to the Netflix synopsis, but she teams up with Callum and Ezran, who are both human, after they make an exciting discovery. But will The Dragon Prince return for Season 2, or should fans just expect these first nine episodes?\nThe Dragon Prince was created by Aaron Ehasz and Justin Richmond, per Polygon. Ehasz was a writer and producer on Avatar: The Last Airbender, so fans of Aang, Katara, and Sokka should try out The Dragon Prince. \"One of our main goals was to make something Avatar fans would love,\" Ehasz said in an interview with Vice. Ehasz was also a writer on Futurama, so his repertoire spans from heartwarming children's fantasy to jaded, meta-comedy. As for co-creator Justin Richmond, he worked on the Uncharted video games, according to the same Vice article. The two also created the production company Wonderstorm with Justin Santistevan, per their website. Wonderstorm produced The Dragon Prince, which is clear from the trailer's opening credits.\nNetflix\nAudiences learn more about the show's universe from its Netflix Media page: \"In the magical land of Xadia, magic comes from six primal sources: the Sun, the Moon, the Stars, the Sky, the Earth, and the Ocean. But when human mages create a seventh kind of magic, Dark Magic — they begin capturing and harvesting the unique magical creatures they need as ingredients. This sparks a catastrophic war between Xadia and the Human Kingdoms.\" The premise sounds like something that fans of the Inheritance book series, The Legend of Zelda video games, and (of course) Avatar: The Last Airbender will love.\nIt's clear in the trailer that the moon shadow elves are at war with the humans, and Rayla explains why. \"Humans cut down the king of the dragons and destroyed his only egg, the Dragon Prince,\" she says. \"Justice will not be denied.\" However, the elven assassin teams up with Callum and Ezran after they discover a shimmering dragon egg. \"This changes everything,\" she exclaims. \"It's up to us now,\" Callum says in the trailer. \"We have to return this egg to Xadia.\"\nNetflix\nAccording to The Dragon Prince's Twitter account, the adorable yellow and turquoise creature that hangs around with the three adventurers is named Bait. The cocky humans whom audiences see briefly in the trailer are Claudia and Soren, who are 16 and 18, respectively. \"Well, I'm going to find a way to stop them,\" Claudia boasts. \"After all, unstoppable is just another kind of stoppable.\" \"No, that's not really right,\" a character named Viren says.\n\"The stakes are real, and the show is grounded in that,\" Executive producer and director Giancarlo Volpe said at FanExpo 2018, according to the same Polygon article. \"But then you follow it through the point of view of kids who are jovial and comedic. There’s doom and gloom in the background, adults having serious conversation, and the kids — whether they want to or not — become part of that greater conflict.\" Indeed, these three kids and their fat, perpetually grumpy Bait strike a similarly comedic tone to Aang and his adorable flying bison, Appa. But although they're just children, they're forced into a very grown-up situation by going on a serious quest.\nNetflix\nSantistevan told Utah publication Deseret News that a lot of fantasy is too adult for many children — especially the younger ones. For that reason, The Dragon Prince is meant to be family friendly. \"The early goal was: Could this be the audience’s first great epic fantasy?\" he said. \"Can we be Game of Thrones before they’re watching Game of Thrones? Could we create a world that was more diverse and deeper than what they were getting on some of the kids' networks?\" If their show is anything like what the trailer implies, then Wonderstorm succeeded.\nNetflix on YouTube\nThat being said, it's simply too soon to say whether The Dragon Prince will return for more seasons. For one thing, the series was only announced in July 2018, per Deadline, and Netflix has made no Season 2 announcements yet. According to the same Vice article, the animation is a blended 2D-3D, and since the show is painstakingly animated, it will likely take a long time to make any subsequent seasons. But if The Dragon Prince is anything like Avatar, fans will be clamoring for more, and it won't be long until the fan art and cosplay starts rolling in. In fact, it's already started.","url":"https://www.bustle.com/p/will-the-dragon-prince-return-for-season-2-netflixs-new-animated-fantasy-involves-dragons-elves-magic-11897996"}
