{"authors":["Rebecca Patton"],"date_download":"2018-10-31 00:02:38","date_modify":"2018-10-31 00:02:38","date_publish":"2018-10-28 11:00:29","description":"Starz has achieved something truly impressive with its documentary series, America to Me, which wraps up on Sunday, Oct. 28. The series has followed the 2015-2016 school year at Oak Park and River Forest High School (OPRF), zeroing in on several…","filename":"data/vaneerConsumption/WillAmericatoMeBeReturningforSeason2ThisDocuseriesFollowedOneYearinaChicagoSuburbHighSchool.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/26/567237a9-9da7-4bd2-84e2-fbfbe49beeb5-d27f7f9a-6a96-46b1-a55e-c08925073938.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-america-to-me-be-returning-for-season-2-this-docuseries-followed-one-year-in-a-chicago-suburb-high-school-13003541_1540944158.html","title":"Will 'America to Me' Be Returning for Season 2? This Docuseries Followed One Year in a Chicago Suburb High School","title_page":"Will 'America to Me' Be Returning for Season 2? This Docuseries Followed One Year in a Chicago Suburb High School","title_rss":"NULL","source_domain":"bustle.com","text":"Starz has achieved something truly impressive with its documentary series, America to Me, which wraps up on Sunday, Oct. 28. The series has followed the 2015-2016 school year at Oak Park and River Forest High School (OPRF), zeroing in on several students, faculty members, and parents during that time. Directed by documentarian Steve James, the series sought to uncover racial and socioeconomic disparities at the public school, which is located outside Chicago, Illinois. And while the series succeeded in what it set out to do, it's too soon to tell whether America to Me will return for Season 2.\nThe filmmakers followed mainly black students (although there are two white students introduced later on) throughout the school year, including Ke'Shawn Kumsa, Kendale McCoy, Charles Donalson Jr., and Tiara Oliphant, among others. These kids were at various stages of their high school careers and participated in different clubs, like spoken word, wrestling, baseball, cheerleading, and more.\nAccording to an interview James did with the Hollywood Reporter, it was difficult figuring out which subjects to follow. \"[T]he administration made it clear to us that for legal/confidentiality reasons, we couldn't go to teachers and ask for recommendations of students to approach,\" he explained. \"So we put out the word in the community, on social media, through parents and people we know because we live there, and then that led to some people coming forward.\"\nStarz\nChanti Relf, a junior at the time the documentary was filmed, is half-black, half-Vietnamese. In the documentary, the teenager is struggling with their non-binary identity and how to express that to their parents. Jada Buford, a black senior, was depicted making documentaries about topics like colorism and black women's hair; however, she was often met with opposition from her classmates and even her teachers. Kendale, a senior at the time, was involved in both the drumline and wrestling team, and it's a wonderful moment when his team wins the state title in Episode 8.\nHowever, another important documentary subject in America to Me was English teacher Jessica Stovall, who was passionate about leveling the racial playing field at her school. She tried to implement a teacher feedback program called Woven, but received pushback from the administration, much to her dismay. While ORPF is considered a liberal, diverse school, it becomes clear over the course of the series the kinds of micro-aggressions that have built up, allowing for students of color to fall behind.\nThere were certainly uncomfortable conversations caught on camera, including one between Aaron Podolner, a physics teacher who considered himself to be \"woke\" when it came to his black students, and senior Jada. Podolner has received a fair bit of criticism, which he addressed in an interview with the Hollywood Reporter. \"So what we first saw was this kind of supercut of all of our scenes,\" he said. \"So it was nice, like, in 35 minutes I saw myself making mistakes, I saw myself trying too hard, but I saw myself learning some lessons by the end. But of course, we're still like three weeks away from me learning some lessons!\"\nAccording to an interview in Vanity Fair, director Steve James lives in Oak Park and sent his kids to OPRF. He and his team received permission to create the documentary back in 2014, despite the fierce opposition of principal Nathaniel Rouse, and superintendent, Steven Isoye, per the piece. \"I don’t think there’s any way that anyone could have come in from outside, no matter who they were,\" James said. \"Once it was put out there that we wanted to make this film, I think there were a lot of people in the community thought it was a good idea. I think there was this feeling that this was a chance to hold a mirror up that would tell us something.\"\nThat being said, there was a fair amount of pushback. \"There were things that we were prevented from doing throughout the school year, but because it's a huge school, with so much going on, we got a lot,\" James told the Chicago Tribune. \"I think your sense watching the series is that we're kind of everywhere we want to be, even though we weren't everywhere we wanted to be.\"\nTibrina Hobson/Getty Images Entertainment/Getty Images\nThe final product was a nuanced, introspective race at a diverse public school that nevertheless has a considerable achievement gap. And while the series was filmed during the 2015-2016 school year, there has been no announcement for any future iterations of the series. And even if there will be more, it would likely take a considerable amount of time to film.\nSo even if America to Me does return, audiences should expect a long wait between seasons. But even as a standalone, it's still an incredibly powerful, pragmatic look at race in the U.S. through Gen Z's perspective.","url":"https://www.bustle.com/p/will-america-to-me-be-returning-for-season-2-this-docuseries-followed-one-year-in-a-chicago-suburb-high-school-13003541"}
