{"authors":["Jack O'Keeffe"],"date_download":"2018-10-31 01:46:46","date_modify":"2018-10-31 01:46:46","date_publish":"2018-09-14 11:00:52","description":"American Vandal's second season premieres on September 14, 2018, exploring the reign of terror enacted by a prankster known as \"The Turd Burglar\" at St. Bernardine Catholic High School. Featuring a brand new storyline at a brand new school, while…","filename":"data/vaneerConsumption/WillAmericanVandalReturnForSeason3ThereAreSoManyMoreFakeCrimesToExplore.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/10/accf19c4-450c-4009-9209-56d912a0f00c-av_206_371475_r.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-american-vandal-return-for-season-3-there-are-so-many-more-fake-crimes-to-explore-11862356_1540950406.html","title":"Will 'American Vandal' Return For Season 3? There Are So Many More Fake Crimes To Explore","title_page":"Will 'American Vandal' Return For Season 3? There Are So Many More Fake Crimes To Explore","title_rss":"NULL","source_domain":"bustle.com","text":"American Vandal's second season premieres on September 14, 2018, exploring the reign of terror enacted by a prankster known as \"The Turd Burglar\" at St. Bernardine Catholic High School. Featuring a brand new storyline at a brand new school, while still featuring the same documentarians behind the show's first season, the show's new setting suggests that American Vandal could be going to different places every season. While Netflix has yet to announce whether or not American Vandal will return for Season 3, the first two seasons have established a pattern that fans can expect future seasons to follow if renewed for another round.\nUPDATE: Netflix has canceled American Vandal, according to The Hollywood Reporter.\nEARLIER: Few may have expected a show whose first season centered around solving the mystery of \"Who Drew The D*cks\" to become one of the most incisive and biting satires of youth culture onscreen, but the first American Vandal surprised audiences with its combination of juvenile jokes and mature analysis on how children are denied the ability to improve themselves by their elders. Season 2 continues that trend by examining the stress of having to balance the politics of social media with the universal struggles of attending high school, all against the backdrop of a laxative-mad prankster jeopardizing the health of the school's students.\nWhile there are no publicly announced plans for Season 3, the constants present in the show's first two seasons allow viewers to place their best guesses at what the show will look like in the future.\nThere Will Probably Be A New Educational Setting\nSeason 1 tackled the ecosystem of public schools, and Season 2 takes a deep dive into the going-ons of a private Catholic school, so it's fair to guess that the show will continue to switch up the setting each season and hopping around various educational institutions. American Vandal Season 3 could explore the specific worlds of a Technical High School or a Performing Arts High School, or aim its sights at college culture. There are tons of options.\nThere Will Be A New, Crude Crime\nIt's anyone's guess what kind of crude and complicated mystery the writers of the show could concoct for Season 3. They've already exhausted phallic graffiti and fecal felons in their first two seasons, meaning that Season 3 may have to get especially creative.\nThere Will Likely Be A Surprising Poignancy\nNetflix on YouTube\nBy the time that Season 1 started exploring the effect that the filming of American Vandal was having on its subjects, it was clear that the show was more than a simple true crime parody. As much as crude jokes and high school is part of American Vandal's voice, the show wouldn't be itself if it didn't take an honest look at the struggles that face modern teenagers.\nAmerican Vandal hasn't been guaranteed a Season 3, but the show would have to fall pretty far to go from being a Peabody Award winner to being canceled by Netflix. Until the show's creators run out of schools to visit or disgusting crimes to solve, fans should expect to see more iterations of the American Vandal formula in the future.","url":"https://www.bustle.com/p/will-american-vandal-return-for-season-3-there-are-so-many-more-fake-crimes-to-explore-11862356"}
