{"authors":["Associated Press"],"date_download":"2018-10-22 23:10:44","date_modify":"2018-10-22 23:10:44","date_publish":"2016-01-28 11:52:36","description":"MELBOURNE, Australia (AP) — When Serena Williams plays as well as she did in the semifinals of the Australian Open, there's little an opponent can do to chal...","filename":"data/vaneerConsumption/Williamsreaches7thAustralianOpenfinalindominantform.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:c4e6b1ada33e40f5a9e94f634c4d57f2-4vVdYopwYQ7f641721b07acceac8-546_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420807_Williams-reaches-7th-Australian-Open-final-dominant-form_1540249844.html","title":"Williams reaches 7th Australian Open final in dominant form","title_page":"Williams reaches 7th Australian Open final in dominant form | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Williams reaches 7th Australian Open final in dominant form\nMELBOURNE, Australia (AP) — When Serena Williams plays as well as she did in the semifinals of the Australian Open, there's little an opponent can do to challenge her. Even one who's soon to be ranked No. 3 in the world, just two places behind her.\n\"I was just standing there kind of watching her play,\" the fourth-seeded Agnieszka Radwanska said after her 6-0, 6-4 drubbing by Williams on Thursday. \"There was just no mistake. Unbelievable serve. Everything, she was going for it. I couldn't do much. Not at all, actually.\"\nIt's been a familiar feeling among the players Williams has brushed aside on the way to the final, her seventh at Melbourne Park. She's been so dominant at the Australian Open this year, in fact, she's reached the final without losing a set — something she's never achieved in 15 previous appearances.\nSerena Williams of the United States celebrates after defeating Agnieszka Radwanska of Poland in their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Vincent Thian)\nShe has dropped just 26 games in six matches, a number she has bettered just four times at the Grand Slams in her career.\nWilliams seems as surprised as anyone by how well she's playing. She didn't expect to be so sharp after taking a four-month hiatus following last year's U.S. Open — a necessary break, she said, to recharge after coming just two matches shy of a calendar-year Grand Slam.\nBut as she's demonstrated many times in her career, putting the tennis rackets away for a while obviously agrees with her.\n\"I was extra busy on my new collection that I'm starting,\" said Williams, a some-times fashion designer, who is wearing one of own designs — a neon-yellow crop-top with pleated skirt — on the court in Melbourne. \"But I needed it. I needed time off just to, like, take a minute and just chill and re-heal, get ready.\"\nWilliams certainly looks refreshed — both physically and mentally. She hurried through the first set against Radwanska in 20 minutes, winning all but seven points and allowing Radwanska just one winner while smacking 18 of her own.\nHer performance was so complete, 18-time major winner Chris Evert asked her fellow TV commentators on ESPN, \"How can you say she's not the greatest of all time when she plays like this?\"\nAlthough her level dipped in the second set, Williams got the decisive break in the ninth game to go up 5-4 and then closed out the match in a brisk 64 minutes. Radwanska had played a much more competitive set, but still finished with a 42-to-4 deficit in total winners.\n\"She goes on court and she just wants to kill it,\" Radwanska said. \"I don't think anyone can really play on that kind of level at all.\"\nIt was a different story at the majors last season when Williams came out flat and fell behind at the start of many matches before staging late, dramatic comebacks. She's trying to make things easier on herself this year.\n\"I just really wanted to focus on when I first walk out there to be ready to go from the first point, then that way I don't necessarily have to play from behind,\" she said, before adding for emphasis, \"which I can do clearly, and I proved that last year.\"\n\"But I wanted to prove that I can play also ahead this year.\"\nThis is an ominous sign for Williams' opponent on Saturday, Angelique Kerber, is into her first Grand Slam final. Williams will be aiming for her 22nd major title, tying her with another German, Steffi Graf.\n\"I will go out there, try to enjoy my first final, try to beat Serena,\" she said. \"I must play my best tennis to have a chance.\"\nSerena Williams of the United States celebrates after defeating Agnieszka Radwanska of Poland during their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Rick Rycroft)\nSerena Williams of the United States celebrates after defeating Agnieszka Radwanska of Poland during in semifinal match at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Vincent Thian)","url":"https://www.dailymail.co.uk/wires/ap/article-3420807/Williams-reaches-7th-Australian-Open-final-dominant-form.html"}
