{"authors":["Chris Arnold"],"date_download":"2018-10-23 05:53:16","date_modify":"2018-10-23 05:53:16","date_publish":"2015-04-21 00:00:00","description":"Proposed federal rules are designed to make sure that financial advisers put their clients' interests ahead of their own. But experts worry that loopholes may weaken those consumer protections.","filename":"data/vaneerConsumption/WillNewRetirementRulesProtectAmericansFromWallStreet.json","image_url":"https://media.npr.org/assets/img/2015/04/21/ap144921224785_wide-119090bf9d544eddd5972fa0e8695d3c9a1914ca.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_04_21_401049273_will-new-retirement-rules-protect-americans-from-wall-street_1540273996.html","title":"Will New Retirement Rules Protect Americans From Wall Street?","title_page":"Will New Retirement Rules Protect Americans From Wall Street? : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Will New Retirement Rules Protect Americans From Wall Street?\nEnlarge this image toggle caption Nick Ut/AP Nick Ut/AP\nSaving enough money to retire can be tough. But it's next to impossible if a financial adviser is steering the client into bad investments — and getting big commissions in return. And according to the Obama administration, that's exactly what too many advisers have been doing.\nMillions of Americans trying to save for retirement have ended up with investments where high fees cripple their returns over time. U.S. Labor Secretary Tom Perez says much of that is due to bad advice.\n\"I hear story after story of people who trusted their adviser,\" Perez says. Clients thought the adviser was looking out for their best interests, but \"they weren't,\" he says.\nThe 'Corrosive Power' Of Hidden Fees\nPerez says many financial advisers do right by their clients, but some give conflicted advice that hurts American workers. For example, an adviser might get a much bigger commission if he or she gets the client to invest in a mutual fund with fees that are very high, as opposed to a lower-fee fund that would be a better investment. Over time, those fees are very damaging.\nPerez says \"the corrosive power\" of fine print, hidden fees and \"backdoor fees\" means that \"quite literally billions of dollars is being lost\" in Americans' retirement accounts. So the Department of Labor has released proposed new rules requiring financial advisers to put the clients' interests above their own.\nExperts Worry About Potential Loopholes\nThis is the first week that the public can submit comments on the new rules. In industry terms, the goal is to hold people who offer financial advice for retirement accounts to a legally binding \"fiduciary standard.\" The current standard for many professionals in the industry is weaker than that.\n\"This is one of the most important pieces of consumer protection regulation that we can put in place for the American people,\" Perez says. \"They should have a right when they go to get this financial advice that the person giving them this advice is looking out for their interests first.\"\nIt sounds like a laudable goal. But the proposed rule is more than 100 pages long. Many experts are concerned that loopholes could wind up in the midst of all that rule-making language.\nDavid Swensen, Yale University's chief investment officer, says he's hopeful the final rule will make a big difference for millions of Americans. But he says, \"I think the biggest threat to this rule is Wall Street's reaction.\" He adds, \"[It] will clearly cost Wall Street in terms of the bottom line, and they're going to fight it tooth and nail.\"\nThat's because if advisers had to act as true fiduciaries they wouldn't be steering clients into mutual funds or other investment vehicles with very high fees.\nSo how effective will the new regulations be? At least some experts think the financial industry's lobbying has already weakened them.\n\"It's obvious that industry basically got to them,\" says Kent Smetters, an economist at the University of Pennsylvania's Wharton School. He says the new rules have a very big loophole written into them already.\n'A Big Grenade' In The Room\nSmetters zeroed in on a part of the new rule called the \"Best Interest Contract Exemption,\" which he says will allow financial advisers to opt out of much of the rule and still get commissions for getting clients to invest in overpriced mutual funds.\n\"It essentially throws a big grenade into the room,\" he says. \"It's not just a small little hole. The industry can drive a Mack truck through it and it really allows them to essentially continue business as usual.\"\nPerez says he looks forward to talking with Smetters, but says, \"I think we have put in place appropriate guardrails.\"\nThe Securities Industry and Financial Markets Association declined requests for an interview. The group has warned that an overly burdensome rule could raise costs for average Americans. It says it's reviewing the details of the proposal.","url":"https://www.npr.org/2015/04/21/401049273/will-new-retirement-rules-protect-americans-from-wall-street"}
