{"authors":["Press Association"],"date_download":"2018-10-23 00:09:16","date_modify":"2018-10-23 00:09:16","date_publish":"2016-01-29 12:53:56","description":"Hollywood actor Will Smith has spoken about the Oscar controversy, saying it is not a racial issue but rather a reflection of a much broader problem in the U...","filename":"data/vaneerConsumption/Willsmithoscarsrowgoesbeyondrace.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-8331f786-b755-4437-b71f-e6e577fcba7b-4PuZeKVXE7cd9005b2c876a0dcb8-338_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421988_Will-Smith-Oscars-row-goes-race_1540253356.html","title":"Will smith: oscars row goes beyond race","title_page":"Will smith: oscars row goes beyond race | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Will Smith: Oscars row goes beyond race\nHollywood actor Will Smith has spoken about the Oscar controversy, saying it is not a racial issue but rather a reflection of a much broader problem in the United States.\nThe 47-year-old star explained his decision not to attend this year's ceremony as the Academy of Motion Picture Arts and Sciences has faced criticism and calls for a boycott over its all-white line-up of acting nominees.\nHe was speaking following a screening of his movie Concussion held at London's Ham Yard Hotel, which was hosted by Good Morning Britain's Susanna Reid and saw former rugby union player Brian Moore also join the discussion.\nWill Smith says the all-white Oscars nomination list controversy is a much broader issue\n\"First and foremost it's not us and them, I'm a member of the Academy, so it's we, so to me there's a problem that we as a community, a family, have to solve together,\" he said.\n\"Secondarily it's not a racial issue, to me this is not a civil rights issue, this isn't a black and white issue, the beauty of America is in our diversity that is what the country has always been founded and most successful is when everyone comes in and adds their voice and their ingenuity and initiative.\"\nMany expected the Fresh Prince star to pick up a lead actor nomination for his role in Concussion, which was inspired by and documents the struggle of Nigerian forensic pathologist Dr Bennet Omalu against America's National Football League (NFL).\nOmalu was the first doctor to publish his findings of a condition called Chronic Traumatic Encephalopathy (CTE), the brain trauma caused by repeated knocks to the head that American football players suffer over the years.\nSmith said: \"T o me it's a much broader issue than an award or an award show, it's about a somewhat regressive slide towards separatism and racial and religious exclusion on a much broader American level and I believe that the situation with the Academy Awards and with Hollywood is a bit of a reflection of a much broader problem.\"\nThe Independence Day star said he was \"deeply proud to be American\" and when Barack Obama was elected president it was \"one of the highlights of my existence\".\nAsked by Reid if he would be making a movie about Mr Obama when his current run as president ended, the charismatic star joked: \"We've talked about and he said the reason he thought I'd be good at it is because we have matching ears.\"\nHe said nothing was confirmed and that Mr Obama had to \"write the end of the story, so as soon he finishes writing the ending, it's something I would love to do\".","url":"https://www.dailymail.co.uk/wires/pa/article-3421988/Will-Smith-Oscars-row-goes-race.html"}
