{"authors":["Tai Gooden"],"date_download":"2018-10-31 01:47:23","date_modify":"2018-10-31 01:47:23","date_publish":"2018-08-27 19:15:53","description":"Reality dating TV shows are somehow still on the rise. The Proposal Season 1 finale airs on Aug. 27 and will be the final round for competitive bachelors and bachelorettes to find love in 60 seconds by finessing their way into a mysterious person’s…","filename":"data/vaneerConsumption/WillTheProposalReturnForSeason2TheDatingShowDealtWithATroublingAccusation.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/cf4087a7-f9e2-40c1-8ac7-b74cb79e10d8-149336_109_0051.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-the-proposal-return-for-season-2-the-dating-show-dealt-with-a-troubling-accusation-10248833_1540950443.html","title":"Will ‘The Proposal’ Return For Season 2? The Dating Show Dealt With A Troubling Accusation","title_page":"Will ‘The Proposal’ Return For Season 2? The Dating Show Dealt With A Troubling Accusation","title_rss":"NULL","source_domain":"bustle.com","text":"Reality dating TV shows are somehow still on the rise. The Proposal Season 1 finale airs on Aug. 27 and will be the final round for competitive bachelors and bachelorettes to find love in 60 seconds by finessing their way into a mysterious person’s heart — possibly snagging a new spouse on national television. This concept puts an interesting twist on the typical setup, but will The Proposal return for Season 2? There hasn’t been any official renewal announcement from ABC yet, but fans will hopefully get an answer soon.\nThe network was already dominating Monday nights with shows like Bachelor In Paradise, The Bachelor, and The Bachelorette, so it is no surprise that they would want to keep the party going with The Proposal, from the same Executive Producer. The spinoff takes competition dating to a new level and ups the stakes considerably. Because the contestants really have no clue whose heart they are even trying to win before they're really involved. And, it can't be easy to convince someone to marry you in one hour.\nAccording to Deadline, The Proposal is holding steady in terms of viewership with over 3 million fans tuning in each week to catch the latest showdown. These numbers are surprisingly solid considering the show’s rocky start due to a disturbing accusation.\nByron Cohen/ABC\nWarning: This section contains information about sexual assault, which some may find triggering.\nPeople reported that a male contestant named Michael J. Friday was accused of sexual misconduct shortly after The Proposal’s June debut. Erica Denae Meshke detailed her alleged sexual assault on her Facebook page and encouraged readers to share her post with others. In her statement, she said she met Friday via Tinder in November 2017 and they later set up an in-person meeting.\nShe alleged that when she met Friday in the lobby of an apartment complex, he showed up with two other men and left her with them. Meshke claimed her drinks were spiked, and that they assaulted her. She also claimed Friday acknowledged his wrongdoing that evening when she ran into him at a bar and confronted him about the above incident. According to her, he made excuses for his actions and the conversation escalated into an unresolved argument.\nThis claim led to ABC cancelling The Proposal’s second episode and later releasing a joint statement to Bustle with Warner Horizon Productions to ensure the public that the allegations were being taken seriously. The statement reads:\n“An allegation has been made against a contestant on next week’s episode of The Proposal. While the accusation was not related to the contestant’s appearance on the program, we take it very seriously. ABC and the producers of The Proposal are pulling the episode while this matter is under review.”\nFriday hasn’t made a public statement about the accusations yet and he has not been charged regarding the accusation. His episode never aired.\nBut, this accusation hasn’t seemed to affect the show’s popularity among Bachelor Nation fans. So it is possible that The Proposal may return for another season.\nThe fate of this show remains to be seen, but until then fans will get one last shot to see hyped-up speed dating (and proposals) during the finale. And if it does return, hopefully the next round of contestants will be well-vetted people who are looking for love on an nontraditional (and extremely speedy) path.\nIf you or someone you know has been sexually assaulted, call the National Sexual Assault Telephone Hotline at 800-656-HOPE (4673) or visit online.rainn.org.","url":"https://www.bustle.com/p/will-the-proposal-return-for-season-2-the-dating-show-dealt-with-a-troubling-accusation-10248833"}
