{"authors":[],"date_download":"2018-10-30 20:32:49","date_modify":"2018-10-30 20:32:49","date_publish":"2014-10-19 12:00:00","description":"Driverless vehicles are a Pandora’s box of possibilities, capable of altering the routines of daily life in astounding and unpredictable ways.","filename":"data/vaneerConsumption/WilldriverlesscarsgetoffthestartinglineinGeorgia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/MyAJC/2014/10/19/Images/photos.medleyphoto.6284038.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_will-driverless-cars-get-off-the-starting-line-georgia__1540931569.html","title":"Will driverless cars get off the starting line in Georgia?","title_page":"Will driverless cars get off the starting line in Georgia?","title_rss":"NULL","source_domain":"ajc.com","text":"Driverless vehicles are a Pandora’s box of possibilities, capable of altering the routines of daily life in astounding and unpredictable ways.\nBut should Georgia open the box? And if so, under what conditions?\nA state legislative study committee, having its second meeting Monday, is confronting such questions as it considers how (or whether) to regulate unmanned cars. Driverless vehicles could become mainstream in five to seven years, since they’re already in development by Google and almost every major automaker.\nHow much could these vehicles change your life? Consider: Would you object to a long commute if you no longer had to watch the road? What if the car, and not you, could take the kids to school or soccer practice? If you’re lounging in the back seat with a book, and your car crashes, could the accident be your fault?\nFew states are ready for change of this magnitude.\nJason Wagner, who researches autonomous vehicles at the Texas Transportation Institute, began talking to state transportation agencies about a year and a half ago to scope out potential issues.\n“Some were aware of the technology, but they were a minority,” Wagner said. “Most were either unaware or had barely heard about it on the periphery. There was not enough attention being paid to it as should be or could be.”\nSo far, laws on driverless vehicles have been enacted in four states (Nevada, California, Florida and Michigan) and the District of Columbia, said Yaniv Heled, a law professor at Georgia State University.\nAutonomous vehicles come with varying levels of autonomy. The highest, Level 4, would be like Google cars that have no steering wheel, gas pedal or brake. Such fully autonomous cars are guided by radar, GPS and laser systems.\nMany luxury cars on the market today are already at Level 2, meaning they offer some autonomy, such as automatic cruise control, autonomous braking and lane centering.\nIn Georgia, state Sen. Josh McKoon, R-Columbus, introduced legislation in February that would have defined and regulated testing of autonomous vehicles. The bill never came to a vote. Instead, the House created a study committee that is tasked with finding a way to regulate driverless technology without inhibiting its development or deterring potential auto industry investment in Georgia.\nThe committee is considering numerous issues. Among them:\nLiability in case of an accident.\nPrivacy and availability of data collected from driverless vehicles.\nSecurity and protection from hacking.\nPossible changes to criminal laws.\nIn their first committee meeting last month, lawmakers seemed most concerned with who would pay for property and personal damage in the event of an accident.\nOver time, the law in Georgia has developed to the point where liability is shared among the driver, manufacturer and the jurisdiction where an accident occurs. However, the driver is usually primarily responsible. That could change if nobody is at the wheel. Or the law could be written so that liability falls to the owner of the vehicle by default, regardless of whether the owner was in control when a crash occurred.\n“If we can establish those answers, we can be at a place where innovators can make calculated risks of how to put new technology out there,” said state Rep. Ed Setzler, a Republican from Acworth who is on the committee.\nOne person eagerly awaiting clarity on driverless vehicle regulations is Fayette County Commission Chairman Steve Brown. His Board of Commissioners approved a resolution in July authorizing the county as a pilot site for their design, development and testing.\nBrown said he has spoken with Google about the possibility of testing its cars in Fayette.\nGeorgia Tech, which developed a driverless vehicle in 2007 using a Porsche Cayenne SUV, may also be interested in using the county for research grounds, he said. First, however, the state must grant its blessing for driverless vehicles to operate on state routes that intersect Fayette County roads.\nIn the meantime, competition to attract investment from technology and automobile companies is growing as states realize driverless vehicle technology has the potential to become a multibillion-dollar industry. Johnson County, Iowa, passed a resolution similar to Fayette County’s on the same day as Fayette. And driverless vehicle testing has already been conducted in several states, including California, Nevada and Florida.\n“I thought it was great we jumped out early and we were a leader,” Brown said. “The only problem is we’re not the leader anymore.”","url":"https://www.ajc.com/news/will-driverless-cars-get-off-the-starting-line-georgia/aoebBaYdaQ0Xb0b405qPuM/"}
