{"authors":["Emily Dixon"],"date_download":"2018-10-31 01:50:46","date_modify":"2018-10-31 01:50:46","date_publish":"2018-09-06 11:08:30","description":"Hold your full-sized cardboard cut-outs of Harry Styles a little closer, Directioners, because I've got some bad news. Fans on Twitter have spotted a troubling sign concerning One Direction's potential future reunion — in fact, they're now…","filename":"data/vaneerConsumption/WillOneDirectionGetBackTogetherTheOfficial1DStoreJustShutDownFansAreConcernedAF.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/28fffeb4-995d-44d3-b519-f6780c8099d7-5412279le.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-one-direction-get-back-together-the-official-1d-store-just-shut-down-fans-are-concerned-af-11770748_1540950646.html","title":"Will One Direction Get Back Together? The Official 1D Store Just Shut Down & Fans Are Concerned AF","title_page":"Will One Direction Get Back Together? The Official 1D Store Just Shut Down & Fans Are Concerned AF","title_rss":"NULL","source_domain":"bustle.com","text":"Hold your full-sized cardboard cut-outs of Harry Styles a little closer, Directioners, because I've got some bad news. Fans on Twitter have spotted a troubling sign concerning One Direction's potential future reunion — in fact, they're now speculating it won't happen at all. The band's official merch store went offline earlier this week, to the dismay of fans across the globe. So could this spell the end for our beloved boys? Or will One Direction get back together?\nIt's been an emotionally testing few years for One Direction stans, who've been eagerly scouting for hints of a reunion ever since the band announced their hiatus in August 2015 (as E! reported). But that keening sound you heard in the distance on Monday night? Well, that was the collective wail of millions of Directioners, reacting to tweets by fan accounts revealing that the merch store is no longer online. What could this mean? Most quickly came to the devastating conclusion that the reunion's off, and the dissolution of the merch store is merely the first stage in the complete dismantling of the band's official presence.\nAllow me to warn you in advance: the following tweets from distraught Directioners will definitely tug at your poor, delicate heartstrings.\nThere were, at least, some stubborn optimists, clinging to the beautiful dream of an eventual One Direction reunion.\nHere's the thing: there have, in fact, been several hints this year that One Direction will be returning.\nThe Evening Standard reports that in July, a mysterious tour date for the band appeared on Ticketmaster, claiming they would perform at the Etihad Stadium in Melbourne, Australia, on December 31, 2020. That's ten years after the boys first appeared on The X Factor — a pretty good anniversary for a giant reunion, no? And the show title? The On The Road Again tour. Fitting! According to the Standard, however, the tour date was quickly removed, and a rep for 1D told the paper, \"There are no gigs planned for One Direction currently.\" What kind of cruel torment is this?\nIn June, meanwhile, Liam Payne told the Daily Star, \"It’s amazing that we’re doing our own thing and then, hopefully one day soon, we get back together and have another great time of it, who knows?\" He did indicate he's fully booked up for the next two years though, saying: \"My album comes out at the end of the year and then I’m going on tour in 2019.\" No word on his plans for 2020, though...\nAnd one final cause for hope? Another Liam Payne interview, this time with German publication Promiflash. \"I think it will happen at some point in the distant future. We’ve all spoken about it,\" Payne told the site, as the Cut reports. (Does that include Zayn Malik, Liam? Please tell me it includes Zayn.)\nIn conclusion? Try not to let the fall of the merch store crush your spirits, Directioners. There's hope yet that One Direction will reunite. And that moment, when it arrives, will be perfect.","url":"https://www.bustle.com/p/will-one-direction-get-back-together-the-official-1d-store-just-shut-down-fans-are-concerned-af-11770748"}
