{"authors":["Jessica Taylor"],"date_download":"2018-10-22 23:03:38","date_modify":"2018-10-22 23:03:38","date_publish":"2016-05-10 00:00:00","description":"Sarah Palin is backing the House speaker's GOP primary challenger after Ryan declined to endorse Donald Trump. But primary upsets remain rare and hard to orchestrate.","filename":"data/vaneerConsumption/WillPaulRyanLoseHisGOPPrimaryProbablyNot.json","image_url":"https://media.npr.org/assets/img/2016/05/09/ap_16118699588878_wide-e5a813338ae41ef6263c4e361aeedb4bfbecdb83.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_05_10_477376071_will-paul-ryan-lose-his-gop-primary-probably-not_1540249418.html","title":"Will Paul Ryan Lose His GOP Primary? Probably Not","title_page":"Can Donald Trump And Sarah Palin Oust Paul Ryan From His House Seat?  : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Will Paul Ryan Lose His GOP Primary? Probably Not\nEnlarge this image toggle caption Andrew Harnik/AP Andrew Harnik/AP\nOver the weekend, Sarah Palin had a message for House Speaker Paul Ryan: You're going to pay for not getting on board the Trump Train.\nThe GOP's 2008 vice presidential nominee unleashed on her party's 2012 vice presidential nominee, saying, \"his political career is over but for a miracle because he has so disrespected the will of the people.\"\nPalin is now backing the House speaker's GOP primary challenger. But primary upsets remain rare and difficult to orchestrate.\nThat came in response to Ryan saying last week he wasn't ready to endorse his party's de facto presidential nominee just yet. Ryan hasn't even ruled out endorsing Donald Trump down the line like former rivals Jeb Bush and Lindsey Graham has. In fact, the two will meet later this week.\nBut Ryan's initial hesitancy was enough for Palin to throw her support behind the Wisconsin Republican's little-known primary challenger, Paul Nehlen. Speaking on CNN's State of the Union on Sunday, she predicted that Ryan will be \"Cantored\" — or ousted in a GOP primary, just like then-House Majority Leader Eric Cantor was in a major 2014 upset.\nIs Ryan in danger? Not likely. Two years ago, Cantor was caught unprepared in a primary challenge from college professor Dave Brat. It was a huge primary defeat; Cantor lost by double digits. In hindsight, observers said Cantor had lost focus on his Richmond districts and should have seen seeds of upset brewing as Tea Party activists took control in local GOP leadership. The low-turnout primary in an off-year election with no major races driving the top of the ticket didn't help either.\nThose seeds don't seem to be sowed in Ryan's district. For one, he's in a state that went heavily for Ted Cruz, not Trump, in last month's primary. The Texas senator carried Ryan's district alone by nearly 20 points. And many conservatives in the state, including many influential talk radio hosts, are staunchly anti-Trump. Ryan comes back to his district frequently (one reason he had to be persuaded to take the job as speaker in the first place) and has $7.6 million in his campaign war chest. A recent Marquette Law School poll gave him a 76 percent approval rating among Republicans.\nPalin's own history in supporting primary challengers has been mixed. In fact, she didn't back Brat until after he defeated Cantor.\nIn 2014, despite bluster from Palin and other Tea Party leaders, no sitting GOP senator lost a primary. Chris McDaniel came closest in Mississippi, but Sen. Thad Cochran prevailed in the GOP runoff after an incredibly personal and nasty contest.\nConservatives also didn't succeed in knocking off now-Senate Majority Leader Mitch McConnell in Kentucky as Matt Bevin's much-ballyhooed primary challenge fell short. Bevin did win the open governor's race the following year. Kansas Sen. Pat Roberts survived a primary challenge, as did Tennessee Sen. Lamar Alexander and South Carolina Sen. Lindsey Graham. A primary challenge against then-Speaker John Boehner never gained steam, either.\nDemocrats aren't immune to intraparty turmoil, either. As NPR's Greg Allen recently reported, progressives unhappy with Democratic National Committee Chairwoman Debbie Wasserman Schultz are pushing a primary challenger against the Florida congresswoman.\nAnd as much as Trump's rise represents an anti-Washington fervor, only one incumbent has lost a primary challenge so far this year — Pennsylvania Democratic Rep. Chaka Fattah, who is facing a 29-count federal indictment on charges of bribery and fraud.\nThere are plenty of primaries left this year (most states don't hold their House and Senate primaries at the same time as their presidential contests), so there could still be incumbents ousted. But it's not an easy task — as many as 95 percent of members of Congress are still re-elected.\nPast Upsets\nIn addition to Cantor's ouster, here are some of the biggest recent past primary upsets:\nNed Lamont over Connecticut Sen. Joe Lieberman: The party's 2000 vice presidential nominee suffered a shocking loss in the Democratic primary to Ned Lamont, who hammered Lieberman over his support for the Iraq War. But Lieberman mounted a comeback as an independent candidate and won in November with a lot of help from Republican voters.\nThe party's 2000 vice presidential nominee suffered a shocking loss in the Democratic primary to Ned Lamont, who hammered Lieberman over his support for the Iraq War. But Lieberman mounted a comeback as an independent candidate and won in November with a lot of help from Republican voters. Mike Lee over Utah Sen. Bob Bennett: As the Tea Party wave in 2010 was beginning to swell, this three-term incumbent was among the first casualties. Conservatives took aim at Bennett over his support for the 2008 Wall Street bailout, and it worked. Now-Sen. Mike Lee maneuvered past Bennett at the state GOP convention and denied him a spot on the primary ballot at all.\nAs the Tea Party wave in 2010 was beginning to swell, this three-term incumbent was among the first casualties. Conservatives took aim at Bennett over his support for the 2008 Wall Street bailout, and it worked. Now-Sen. Mike Lee maneuvered past Bennett at the state GOP convention and denied him a spot on the primary ballot at all. Joe Miller over Alaska Sen. Lisa Murkowski: She was the only other incumbent Republican to lose a primary in 2010, but Murkowski's political fate worked out much better than Bennett's did. Even though she fell to the Palin-endorsed Joe Miller, she was able to win the general election as a write-in candidate.\nShe was the only other incumbent Republican to lose a primary in 2010, but Murkowski's political fate worked out much better than Bennett's did. Even though she fell to the Palin-endorsed Joe Miller, she was able to win the general election as a write-in candidate. Richard Mourdock over Indiana Sen. Richard Lugar: In 2012, conservative outside groups worked hard to boost state Treasurer Richard Mourdock over Lugar in the primary, and it worked. Some of Lugar's wounds were self-inflicted, such as not maintaining a permanent residence back in Indiana. But Mourdock proved to be an uneven candidate who came under fire after saying in a debate that pregnancy resulting from rape was \"something God intended to happen.\" Mourdock lost in the general election to Democratic Rep. Joe Donnelly.\nIn 2012, conservative outside groups worked hard to boost state Treasurer Richard Mourdock over Lugar in the primary, and it worked. Some of Lugar's wounds were self-inflicted, such as not maintaining a permanent residence back in Indiana. But Mourdock proved to be an uneven candidate who came under fire after saying in a debate that pregnancy resulting from rape was \"something God intended to happen.\" Mourdock lost in the general election to Democratic Rep. Joe Donnelly. Brad Wenstrup over Ohio Rep. Jean Schmidt : This Republican was the first incumbent to lose her primary in 2012 to podiatrist Brad Wenstrup, who targeted her over her votes to raise the debt ceiling. She had weak primary performances in the past, and with new district lines, she was especially susceptible post-redistricting.\n: This Republican was the first incumbent to lose her primary in 2012 to podiatrist Brad Wenstrup, who targeted her over her votes to raise the debt ceiling. She had weak primary performances in the past, and with new district lines, she was especially susceptible post-redistricting. Ted Yoho over Florida Rep. Cliff Stearns: This 2012 race also wasn't on anyone's radar. Yes, the district lines were new after redistricting, but the 12-term GOP incumbent had a high profile in the House from leading investigations into the Obama administration's energy proposals and government funding of Planned Parenthood. Large animal veterinarian Ted Yoho argued Stearns had simply been in Washington too long, and even ran a TV ad of politicians throwing mud at each other in a pig pen. It worked — and Yoho upset Stearns by fewer than 800 votes.\nThis 2012 race also wasn't on anyone's radar. Yes, the district lines were new after redistricting, but the 12-term GOP incumbent had a high profile in the House from leading investigations into the Obama administration's energy proposals and government funding of Planned Parenthood. Large animal veterinarian Ted Yoho argued Stearns had simply been in Washington too long, and even ran a TV ad of politicians throwing mud at each other in a pig pen. It worked — and Yoho upset Stearns by fewer than 800 votes. Jim Bridenstine over Oklahoma Rep. John Sullivan: This Republican was another incumbent who was swept out in 2012 by Tea Party-backed Jim Bridenstine. The former Navy pilot was underfunded and flew under the radar until the upset, but Sullivan himself admitted he hadn't taken the challenge seriously enough.\nBut primary losses aren't entirely new. According to the Brookings Institution, in 1992 (a post-redistricting year) 19 House incumbents lost primaries, the highest since 1946 when 18 House incumbents were ousted by their party's voters. In 2012, a total of 13 House members lost primaries, though many were due to redistricting and reapportionment.\nThe year 1946 also had the highest number of Senate incumbents who lost their primaries, with six ousted. In 1980, four senators lost their primaries.\nSome older notable upsets:","url":"https://www.npr.org/2016/05/10/477376071/will-paul-ryan-lose-his-gop-primary-probably-not"}
