{"authors":["Aoife Hanna"],"date_download":"2018-10-31 01:45:15","date_modify":"2018-10-31 01:45:15","date_publish":"2018-09-14 14:25:07","description":"Maintaining a major career, transatlantic success, and number one after number one must be pretty exhausting. Still, with fans hungry for more, people are wondering, will Calvin Harris tour the UK in 2019? Well, in short, it's looking pretty…","filename":"data/vaneerConsumption/WillCalvinHarrisTourTheUKin2019YoullHaveToBePreparedToFlyIfYouWantToSeeHimInPerson.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/a7840d5a-a8e7-4369-b709-8732d8b9a3c5-getty-489350165.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-calvin-harris-tour-the-uk-in-2019-youll-have-to-be-prepared-to-fly-if-you-want-to-see-him-in-person-11916902_1540950315.html","title":"Will Calvin Harris Tour The UK in 2019? You'll Have To Be Prepared To Fly If You Want To See Him In Person","title_page":"Will Calvin Harris Tour The UK in 2019? You'll Have To Be Prepared To Fly If You Want To See Him In Person","title_rss":"NULL","source_domain":"bustle.com","text":"Maintaining a major career, transatlantic success, and number one after number one must be pretty exhausting. Still, with fans hungry for more, people are wondering, will Calvin Harris tour the UK in 2019? Well, in short, it's looking pretty unlikely. However, there is some hope — if you're willing to fly to Las Vegas that is.\nSo I personally don't quite gave the bank balance and nowhere near enough credit card heft to book flights BUT, maybe you do. Harris playing three dates in Las Vegas. Oh yeah, VEGAS BABY! The concerts are taking place at Caesar's Palace on Sept. 15, September 21, and also Jan. 1. Now that would be a way to ring in 2019, am I right?\nWhile you might not be able to see Harris on home turf any time soon, he has been releasing some pretty great music of late so who know what the future holds. His recent banger with Sam Smith hit number one in the charts. This is nothing new for Harris, who has had countless huge tunes including the iconic break up tune \"Bounce\" which he released with Kelis, timeless summer anthem \"Summer\", and of course the iconic \"We Found Love\" with Rihanna. Who doesn't want get up and get dancing when they hear that riff? The Guardian described it at the time as \"a gargantuan house riff, the song building slowly before the inevitable hands aloft, glowsticks in the air drop, er, drops\". It was that song in particular which really set his star soaring into the stratosphere and ensured his place in the EDM hall of fame. What is not to like? Catchy electronic housey beats featuring like, literally legend after legend? OMG please just tour RN!\nCalvinHarrisVEVO on YouTube\nCalvin's most recent track with Sam Smith was another well-deserved number one. The incredibly catchy tune is a perfect example of home grown British talent totally nailing it. Yes mate. The video in particular gained a lot of attention because of its inclusive approach. The video features some of the world's most famous Voguers and drag queens sporting looks to die for. Jamari 007, who features in the clip, described in the intro how voguing makes them feel: \"It's just like that let go of like, not having to be somebody I don't want to be at that time\".\nSet in a ballroom environment, there are incredibly talented queer POC showing looks and moves that are literally too much to handle. Seriously, drop everything and watch this RN. You know when you watch a music video and not only the track is on point but also like, you want to actually be there? Yeah, that. This video is an event I would pay to be in. All with Smith's gorge dulcet tones giving me actual chills.\nThere's also a star appearance from Winnie Harlow, the model who is absolutely smashing all preconceived ideas of beauty. Also, any true Madonna fans will recognise Kevin Stea star of the 1991 movie Madonna: Truth Or Dare. The legend of the dancing world has moves that, let's be honest, everyone will try emulate after a few bevs. Shame I won't be doing them at a Calvin Harris concert anytime soon, but fingers crossed for some UK dates next year.","url":"https://www.bustle.com/p/will-calvin-harris-tour-the-uk-in-2019-youll-have-to-be-prepared-to-fly-if-you-want-to-see-him-in-person-11916902"}
