{"authors":[],"date_download":"2018-10-30 14:20:16","date_modify":"2018-10-30 14:20:16","date_publish":"2017-03-08 00:00:00","description":null,"filename":"data/vaneerConsumption/WillSomeoneAskPelosiAbouttheOriginalCostProjectionsofObamacare.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_03_will_someone_ask_pelosi_about_the_original_cost_projections_of_obamacare_comments_1540909216.html","title":"Will Someone Ask Pelosi About the Original Cost Projections of Obamacare?","title_page":"Blog: Will Someone Ask Pelosi About the Original Cost Projections of Obamacare?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Remember when Nancy Pelosi said we must pass Obama Care to see what was in it? We also remember that she and hers said Obamacare would lower the deficit and everyone would be able to keep their doctors and policies if they liked them and the whole thing would lower premiums. Those were all obvious and known lies when they were told, and the media just went along. (The media still reports CBO numbers as if they are gospel). Anyone who disagreed with Democrats in 2009 was told by the media that they didn’t know what they were talking about. When President Obama signed the ACA on March 23, 2010, he said it would cost $940 billion over its first ten years (FY2010- FY 2019). The CBO made that estimate in its analysis completed March 18, 2010. A few days later the CBO lowered its cost projection to $938 billion based on a more detailed analysis. (CBO was so good they could adjust by $2 billion over 10 years.) In March 2012, the CBO updated its Obamacare cost estimate to $1.76... (Read Full Post)","url":"https://www.americanthinker.com/blog/2017/03/will_someone_ask_pelosi_about_the_original_cost_projections_of_obamacare_comments.html"}
an anyone estimated. The CBO estimates were off over 100% in four years. Why are their projections considered accurate on anything? I heard that Nancy Pelosi is complaining that we don’t see the cost of the new Republican proposal. Does anyone remember Obama coming to Congress to ask for almost $1 trillion in additional appropriations in the last seven years to cover the shortfall? Did he ask for permission to transfer other funds to pay for it? Did Pelosi and Reid go to the floor and ask for the additional money and offer to pay for it with offsetting cuts or higher taxes? Does anyone remember the media ever asking any questions as to how the known shortfall was paid for? I am pretty sure none of those things ever happened. Maybe the media should ask Pelosi, Sen. Chuck Schumer, Sen. Dick Durbin along with the media’s favorite Republicans, Sen. John McCain, Sen. Lindsay Graham and Sen. Susan Collins how the almost-one trillion shortfall (so far) has been paid for. My guess is not one of them will be willing to talk about it and most might not even understand the question. Of course most of the media doesn’t know or care about the Trillion shortfall either so they certainly won’t ask the question. After all someone who knows Trump may have talked or shook hands with a Russian last year and that is much more important than a President inappropriately diverting a trillion dollars. President Obama also said in September 2009 that 30 million Americans couldn’t get health care, which is why we needed Obamacare. Today the number is around 28 million so why does everyone repeat the made-up number that an additional 20 million are covered? I will make the projection that the new Republican deal will lower the deficit. I pulled the number out of a hat in the way CBO does. We don’t have to worry about the number being off because the media will just let Trump divert money to pay for it the way they let Obama, won’t they? Why does anyone believe that the government that is off more than 100% in four years on an entitlement program can estimate within one degree on temperatures and can control sea levels and storms if we just give them trillions of dollars? They promise? The truth is Democrats and the media want more power and money for the government and Trump along with the Republicans are making an effort to give the power back to the people. They are taking away the individual and employer mandate and they are giving freedom of choice on what kind of policy people and companies can buy. It is a good start. Nothing is perfect but Obamacare is a disaster cascading towards Armageddon. Why would anyone believe what Pelosi or any Democrat says on the Obamacare replacement when they lied so much on Obamacare itself? Isn’t it interesting that Obama ran up around $10 trillion in debt in eight years while pretending that he was lowering the deficit each year? Is it possible that some of the additional debt could be associated with the massive shortfall on Obamacare that does not appear to have ever gone through the normal budget process? It wouldn’t have been convenient for the public to see the actual cost of Obama Care so it was hidden. The media, who has shown a remarkable lack of curiosity about anything Obama did, was a willing participant in the cover up because they knew and didn’t report on the shortfall. But someone who knew Trump may have talked to a Russian last year and Kelly Conway had her feet on a couch! Now that is important but not a trillion in diverted cash.","url":"https://www.americanthinker.com/blog/2017/03/will_someone_ask_pelosi_about_the_original_cost_projections_of_obamacare.html"}
