{"authors":["Alice Broster"],"date_download":"2018-10-31 01:38:36","date_modify":"2018-10-31 01:38:36","date_publish":"2018-08-28 19:22:34","description":"From the very first episode, Age Before Beauty had me hooked. It has been my favourite TV drama of the summer, and honestly, I can't believe it's coming to an end as of Tuesday (August 29). Gutted. I don't know about you, but I need me some more Bel…","filename":"data/vaneerConsumption/WillThereBeAnAgeBeforeBeautySeries2ThereMustBeMoreToBelWesLoveStory.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/85a58239-b639-492e-8636-7efae53e4ad7-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-there-be-age-before-beauty-series-2-there-must-be-more-to-bel-wes-love-story-10575170_1540949916.html","title":"Will There Be An 'Age Before Beauty' Series 2? There Must Be More To Bel & Wes' Love Story","title_page":"Will There Be An 'Age Before Beauty' Series 2? There Must Be More To Bel & Wes' Love Story","title_rss":"NULL","source_domain":"bustle.com","text":"From the very first episode, Age Before Beauty had me hooked. It has been my favourite TV drama of the summer, and honestly, I can't believe it's coming to an end as of Tuesday (August 29). Gutted. I don't know about you, but I need me some more Bel Finch in my life. So that got me thinking, will there be an Age Before Beauty Series 2? I seriously hope so because I have so many unanswered questions; will Bel end up with Teddy? Is Lorelei pregnant? Will Wes ever get his act together? Come on BBC, help a gal out here.\nIn order to get some answers, I reached out to the show's rep to find out what the deal is. However, when this piece was published, the spokesperson was yet to confirm if Series 2 is indeed in the works. But please watch this space because believe me, this story will be updated as soon as I get a definite yes or no.\nWhile there's no evidence to suggest Age Before Beauty is coming back for a second season 100 percent, the show did open to positive reviews and ratings, which to me, is a positive sign. The Guardian described the programme as \"solid writing, with a solid cast of decent, watchable actors.\" Meanwhile, the Radio Times said the show has \"delivered on the promise of exciting and thought-provoking family saga.\"\nAs for Twitter? Well, the social networking site is known for its brutal honesty — and yet, the reviews that have been pouring in are sweet as pie:\nSo, my hunch is that this isn't the last we've seen of Bel or the Mirrorbel beauty salon. Just saying.\nIn case you were living on Mars over the summer and didn't hear about Age Before Beauty, allow me to fill you in on what the show is about. Brilliantly penned by Poldark writer, Debbie Horsfield, the series tells the story of Bel, played by Polly Walker. After her grown-up kids leave home to start university, she and hubby Wes ( James Murray) suffer with empty nest syndrome, which unintentionally starts to drive a wedge between them. Wes is then introduced to personal trainer Lorelei (Madeleine Mantock), a woman half his age, and the pair end up having an affair. I know what you're thinking — 'how predictable' — but it's honestly not. This is a drama penned by the legendary Horsfield remember, so the plot gets way thicker than that.\nBel pretty quickly finds out about her husband's affair and upon doing so, decides to find out who his other woman is. She does this by going under cover and hiring Lorelei as her personal trainer too. But wait, there's more. It turns out, Wes meeting Lorelei was no accident — it was deliberately arranged by Bel's scheming brother-in-law Teddy (Robson Green), who just so happens to be madly in love with her, despite the fact that he's married to her sister, Leanne (Kelly Harrison).\nI know. It's a lot to take in. But it has made for thoroughly entertaining watching.\nSpeaking to Whats On TV , Walker teased what the finale may have in store for fans. She said: \"The secrets all come out but not in a way that you’d expect and they’re not resolved in a way you’d expect either. It has a very unconventional ending. Trust me, you won’t guess it.\"\nCommenting on the possibility of Season 2, Walker added: \"I’d be up for doing another series. There’s potential for things to go all over the place.\"\nOK, Series 2 needs to happen, people. Walker wants it, I want it, and let's face it, you want it. So, it's over to you, BBC. Come on, give the people what they want.","url":"https://www.bustle.com/p/will-there-be-age-before-beauty-series-2-there-must-be-more-to-bel-wes-love-story-10575170"}
