{"authors":["John Garrison Marks","John Garrison Marks Has A Phd In History Rice University","Is Senior Manager","Strategic Initiatives With The American Association For State","Local History."],"date_download":"2018-10-21 03:29:39","date_modify":"2018-10-21 03:29:39","date_publish":"2018-07-03 10:01:02","description":"What historians need to learn from America's failed bicentennial.","filename":"data/vaneerConsumption/WillAmericas250thbirthdaybringthecountrytogetherorsowevenmoredivision.json","image_url":"https://www.washingtonpost.com/resizer/BcbrUR-j9fFJL9seMS3WcorhjlU=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/C7FLMDCK5Q2S7AHXQNJYBITB5A.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_made-by-history_wp_2018_07_03__1540092579.html","title":"Will America’s 250th birthday bring the country together or sow even more division?","title_page":"Will America’s 250th birthday bring the country together or sow even more division? - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"The wagon train rolled through Pittsburgh in 1976 to mark America’s 200th birthday. (AP)\nJohn Garrison Marks has a PhD in history from Rice University and is senior manager, strategic initiatives with the American Association for State and Local History.\nThis Fourth of July, we need to think about the future of the past. In eight years, the United States will celebrate its 250th birthday — and now is the time to start planning. Before corporations swoop in to turn the commemorative event into a commercialized, whitewashed, nostalgic celebration, historians and history organizations, as well as the interested public, have an opportunity to use this seminal anniversary to promote historical thinking in ways that can help us address the social and political upheavals of today.\nThese same tensions between historical appreciation and commercialization were at the core of debates over the bicentennial celebration in 1976. Planning for the event was just beginning in 1968, when the nation underwent maybe its most traumatic year since the Civil War. The assassinations of Rev. Martin Luther King Jr. and Robert F. Kennedy shook the country; riots, demonstrations and student strikes seemed like everyday occurrences, and the antiwar movement swelled in numbers.\nRussell W. Fridley, former director of the Minnesota Historical Society and then-president of the American Association for State and Local History (AASLH) — the country’s largest professional association for public history institutions and practitioners — contended that, in the “era of social upheavals,” the country needed historians.\nFridley bemoaned that Americans saw historians as merely “attic explorers” with little to offer, except perhaps amusement on a Sunday afternoon. He understood that in a moment of turmoil, Americans needed to understand the relevance of history to the problems plaguing society.\nThe bicentennial of the American Revolution offered an opportunity for the history community — museums, historical societies, scholars, teachers and others — to change public perceptions about the utility of history and “to combat a frozen stereotype of past events.” For a nation struggling to make sense of an increasing tumultuous era, the bicentennial was an opportunity for historians to take center stage in teaching how the American Revolution of 1776 shed light on the social revolutions taking shape in 1968.\nRealizing this promise required historians to overcome the crass commercialism that sold “ill-conceived hoopla” and an uncritical fairy-tale version of the past. But it was not to be.\nThe bicentennial ultimately fell short of Fridley’s aspirations, as federal planners and corporate interests won out. They advanced a celebratory historical narrative and marketed nostalgia, selling lunchboxes, grocery bags and belt buckles rather than promoting an understanding of history.\nTo many ordinary Americans, this commercialism was another example of federal government run amok, prompting criticism of the “buycentennial sellabration” that, in the words of historian Tammy S. Gordon, offered “an uncritical glorification of the Founders as heroes.”\nMany groups and individuals (especially women, African Americans, workers, activists and other groups excluded from previous commemorations) refused to accept this sellout. Instead, they honored whomever they believed embodied the spirit of the Revolution in a more decentralized way.\nThe result was a celebration that did not bring the country together in a meaningful discussion of its past. Rather, it accentuated divisions, segmentation and even apathy. In short, the federal bicentennial commissions failed the public.\nThe country’s history community also squandered an opportunity. The bicentennial planners were disconnected from historians, and the new research they were producing in the academy about how the efforts of women, African Americans, native peoples and others complicated the traditional narrative of the Revolution. This failure of historical engagement pierced Fridley’s dreams that the bicentennial could “bring perspective to a society in turmoil.”\nNow Americans and the historical community have a chance to right this past wrong. Once again, Americans are deeply fractured as turmoil plagues society and planning begins to celebrate a seminal American birthday. Historians, once again, know that history offers a critical lens through which to view the current upheaval.\nThey have undertaken efforts to engage broad audiences and to remind them that “everything has a history.” They’re writing blogs and producing podcasts to connect the past to the present. Hundreds of history organizations across the country have endorsed the History Relevance initiative’s “Value of History” statement.\nWhile the methods may be different, historians still face the same challenge that their predecessors failed to overcome 50 years ago: convincing the public that this history is relevant and that it offers the key to addressing society’s most pressing problems. And once again, the anniversary of the American Revolution provides a critical opportunity for surmounting that challenge.\nUnlike the bicentennial, the U.S. Semiquincentennial Commission is charged with commemorating 250 years of American history, not just the Revolution — a distinction that should allow greater buy-in from communities across the nation. The 250th anniversary task force of the AASLH, where I work, has focused its efforts on building a broad coalition within and beyond the history community and emphasizing the importance of telling an inclusive and relevant story about the past, one in which all Americans can share.\nBut historians, history organizations and the American public can all do more over the next eight years to make this effort count. As Fridley’s failed bicentennial efforts demonstrated, an understanding of and commitment to relevant history isn’t enough to make it a lasting reality.\nWe need action to change public perceptions of history itself. This means researching public attitudes toward history and learning better how to frame and communicate its importance. The history community must also build partnerships to improve the tools for evaluating the impact of our work and for explaining it to policymakers at all levels of government. And the public can continue to push cultural institutions away from the guise of neutrality and toward stronger community engagement. We can all share the message that history isn’t just nice or interesting — it’s essential.\nWith a shared commitment and broad-based effort over the next eight years, we can use the 250th anniversary to affect a lasting change in how U.S. citizens understand and value history.","url":"https://www.washingtonpost.com/news/made-by-history/wp/2018/07/03/will-americas-250th-birthday-bring-the-country-together-or-sow-even-more-division/"}
