{"authors":["Genevieve Van Voorhis"],"date_download":"2018-10-31 01:42:03","date_modify":"2018-10-31 01:42:03","date_publish":"2018-09-14 17:59:52","description":"If you can't get enough of Maya Rudolph's unique brand of bizarre comedy, then you're in luck. She's currently starring in the new Amazon Prime series Forever, which premiered on Sep. 14. Rudolph reunites with fellow SNL alum Fred Armisen, and the…","filename":"data/vaneerConsumption/WillForeverReturnForSeason2TheOffBeatComedyCouldBeIronicallyShortLived.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/1cb78cf1-4c04-4ae1-a0e2-d41b70ec1f41-forever-season-1-uyh_101_01106_rc_rgb.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-forever-return-for-season-2-the-off-beat-comedy-could-be-ironically-short-lived-11872622_1540950123.html","title":"Will ‘Forever’ Return For Season 2? The Off-Beat Comedy Could Be Ironically Short-Lived","title_page":"Will ‘Forever’ Return For Season 2? The Off-Beat Comedy Could Be Ironically Short-Lived","title_rss":"NULL","source_domain":"bustle.com","text":"If you can't get enough of Maya Rudolph's unique brand of bizarre comedy, then you're in luck. She's currently starring in the new Amazon Prime series Forever, which premiered on Sep. 14. Rudolph reunites with fellow SNL alum Fred Armisen, and the pair play a suburban married couple that find themselves pushing the boundaries of their humdrum existence. But is nuanced marital strife and surrealist comedy enough to keep Forever alive for another year? Will Forever return for Season 2?\nAs it currently stands, probably not. Although Amazon hasn't come out to officially renew or cancel the series yet, an Aug. 30 New York Times report indicated that Forever would end after just eight episodes. Rudolph told the publication that series creator Alan Yang wanted Forever to have a definitive ending, which is what attracted her and Armisen to the project in the first place. \"Alan said it was the first time he did a show that had an ending, where he knew where it was going,\" said Rudolph. \"That was a huge light bulb for Fred and myself. We both said, 'Yes, that’s what we want.'\"\nThat was Rudolph's stance on the topic, but for his part, Yang (who also co-writes Master of None with Aziz Ansari) told Vanity Fair's Joy Press that he might actually be open to the idea of continuing Forever with a Season 2, if Amazon Prime is also up for it. \"Yang is leaving the door open for another season of Forever,\" wrote Press, \"if this series about married life and existential turmoil can find its audience. He knows that it is 'a weird show'—and a slow-building one that goes against Amazon’s current mission of creating noisy, Game of Thrones-scale hits.\"\nEven with that awareness, Rolling Stone reviewer Alan Sepinwall points out that Forever might not have had quite enough material to fill out its existing season. \"[E]ven with a lot of plot twists, there’s not quite enough story to fill eight episodes,\" he writes. \"A higher joke quotient might have helped flesh out some of the slow spots.\"\nPrime Video on YouTube\nBut it seems that cramming in more jokes to fill up space simply isn't the vibe Yang was going for in Forever. While Rudolph and Armisen might have gotten famous excelling at sketch comedy on SNL, Yang is trying to do something different with this off-beat, slow-burning dramedy. \"I was most interested in having them play more grounded characters, and play more naturalistic scenes. That’s my taste generally. I know that they're such skilled sketch performers but I just felt like they could do sort of gentler, quieter stuff,\" he told Vanity Fair.\nEven though Forever probably won't last forever, Yang, Rudolph, and Armisen currently have more that enough stuff too keep them busy, even without a Season 2 of the Amazon series. For his part, Yang told Vanity Fair that he's always open to the possibility of bringing Master of None back for Season 3, a prospect which Netflix has also said they'd support. Fred Armisen has two other TV series in the works, and Maya Rudolph is currently filming the animated film The Willoughbys, which has no official release date yet. But of course, if you're really desperate for your fix of old-school Rudolph and Armisen comedic chemistry, there's nothing quite like reruns of old school SNL to keep you laughing for the rest of time.","url":"https://www.bustle.com/p/will-forever-return-for-season-2-the-off-beat-comedy-could-be-ironically-short-lived-11872622"}
