{"authors":["Jefferson Grubbs"],"date_download":"2018-10-30 22:46:26","date_modify":"2018-10-30 22:46:26","date_publish":"2014-08-14 19:00:25","description":"There are lots of reasons to enjoy FOX's crazy-good supernatural drama Sleepy Hollow : the fish-out-of-water comedy, the creepy creature designs, the insane plot twists, etc. But perhaps the single aspect of the show that's most responsible for its…","filename":"data/vaneerConsumption/WillIchabodAbbieDoTheDeedInSleepyHollowSeason2DontGetTooExcited.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e23c28d2-3379-4721-9f50-64e42f2f4cf0.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35724-will-ichabod-abbie-do-the-deed-in-sleepy-hollow-season-2-dont-get-too-excited_1540939586.html","title":"Will Ichabod & Abbie Do The Deed In 'Sleepy Hollow' Season 2? Don't Get Too Excited...","title_page":"Will Ichabod & Abbie Do The Deed In 'Sleepy Hollow' Season 2? Don't Get Too Excited...","title_rss":"NULL","source_domain":"bustle.com","text":"There are lots of reasons to enjoy FOX's crazy-good supernatural drama Sleepy Hollow : the fish-out-of-water comedy, the creepy creature designs, the insane plot twists, etc. But perhaps the single aspect of the show that's most responsible for its success is the pitch perfect chemistry between leads Tom Mison and Nicole Beharie and the birth of IchAbbie 'shipping. As Ichabod Crane, a man living in the future, and Abby Mills, a woman haunted by her past, the actors have a relationship that's one part Odd Couple, one part Lethal Weapon, and all parts Awesome: the Revolutionary War soldier and the modern day cop make a perfect demon-hunting, apocalypse-averting team. So naturally there are viewers out there who are wondering, \"When are they gonna hook up, already?\"\nFirst of all, let's all acknowledge the fact that this isn't something that has to happen. A coed crime-fighting duo don't inherently have to fall into bed together. Just because Mison's and Beharie's personalities complement each other perfectly doesn't mean Sleepy Hollow should degenerate into will-they-won't-they drama in Season 2. Sometimes TV shows shoot themselves in the foot by shoving their heterosexual protagonists together too quickly. (*cough* NewGirl *cough*)\nHeck, in The X-Files — a show that shares more than a little DNA with Sleepy Hollow — Mulder and Scully didn't even kiss until the end of the seventh season. That's a veritable eternity in this day and age of speed-plotting. I'm not saying that the writers need to wait that long to entertain the idea of a romance, but there are plenty of indications that the show's not headed for an IchAbbie hookup anytime soon.\nFor one thing, the writers seem firmly committed to Ichabod's relationship with his wife. (Remember her?) Our old-timey hero finally managed to rescue Katrina from purgatory in the Season 1 finale — only to have her stolen away from him again by his vengeful son Jeremy and given to the Headless Horseman. Ichabod will most likely have enough on his mind trying to find, rescue, and reconcile with his witch-wife to even think about doing the horizontal mambo with Abbie. \"We're going to drop a few bombs this season with Crane and Katrina,\" executive producer Mark Goffman teased at this summer's Television Critics Association press tour.\nAnd the writers aren't the only ones who seem shy when it comes to pushing IchAbbie too quickly. Also at the TCA, Mison joked that the apocalypse was a bit of a \"mood killer\" for any romance on the show, and Beharie noted how \"it’s interesting and kind of fun … that she has a relationship with a man, but it’s not romantic. She’s not defined by some sexual [desire].\" #preach\nEven further complicating Ichabod's love life is the Season 2 addition of Mary Wells, who will be played by Heather Lind of AMC's Turn. The character is described as follows: \"While at first pleasant and sweet, Mary has a darker side — and will prove to be flighty, moody and prone to fits of extreme jealousy.\" And Crane might not be the only with a new romantic complication: One Tree Hill alum Matt Barr has been cast as a bounty hunter who joins Ichabod and Abbie's team, and some fans have already started speculating that he's Abbie's new love interest.\nSadly for IchAbbie shippers, it doesn't seem like true love is in the cards for the pair anytime soon — of the romantic kind, that is. No one can deny the platonic love and deep respect that the partners share, and we hope to see that bond strengthen as they continue to kick horseman ass, take demon names, and prevent Armageddon in Season 2.\nImages: Brownie Harris/FOX (3); headoverfeels","url":"https://www.bustle.com/articles/35724-will-ichabod-abbie-do-the-deed-in-sleepy-hollow-season-2-dont-get-too-excited"}
