{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 22:01:49","date_modify":"2018-10-22 22:01:49","date_publish":"2016-01-11 02:16:58","description":"It is an occasion where Hollywood's hottest couple turn up the heat.","filename":"data/vaneerConsumption/WillSmithandJadateamupwithChanningTatumandJennaattheGoldenGlobes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/30018A8900000578-0-image-a-34_1452474485553.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393205_Will-Smith-wife-Jada-team-Tatums-Hollywood-s-hottest-couples-grace-Golden-Globes_1540245709.html","title":"Will Smith and Jada team up with Channing Tatum and Jenna at the Golden Globes","title_page":"Will Smith and Jada team up with Channing Tatum  and Jenna at the Golden Globes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Forget a movie and dinner - date night in Hollywood is a rather more glamorous affair.\nWill Smith and his wife Jada Pinkett Smith teamed up with the Tatums to steal the show on the Golden Globes red carpet on Sunday.\nThe Fresh Prince and his other half were very much the senior partners in the affair, with a string of box office blockbusters to their name.\nScroll down for video\nReaching boiling point: Channing Tatum, wife Jenna, Jada Pinkett Smith and her husband Will Smith led the way as Hollywood's hottest couples starred at the Golden Globes on Sunday\nWill, who is up for a best actor in a movie drama award for Concussion, looked dapper in a classic tuxedo and leather shoes, while he chose to wear a trendily large bow tie.\nThe 47-year-old said the fact he was unaware of the dangers of American Football was one of the reasons he wanted to make the film, in which he plays a Nigerian doctor who fought against efforts by NFL to suppress his research on the brain damage suffered by professional players.\nThe father of three, whose oldest son played the sport, said: 'I think the big thing was as a parent I wasn't aware of the information so I was nervous that I sent my kids out into something I wasn't educated about.\nSee more Will Smith updates as he and his wife Jada embrace Channing Tatum and his wife\nYou look marvellous darling: The couples could not stop fawning over each other before finally posing up\nPalpable passion: The old magic is still clearly there between Will and his wife of 19 years\nMaking them go green with envy: Jada was definitely an emerald in the rough with this arresting number\nAnd it's goodbye from her: She flashed her enormous wedding sparkler as she bid fans farewell\n'It was something that I had to do to deliver the information.'\nJada, 44, was looking spectacular in an emerald green dress, which boasted a split up the right leg that drew attention to her toned pins.\nBut they were far from the only glamour couple strutting their stuff at the showpiece occasion.\nNo you look better: No doubt the fawning pair could not stop insisting they had been outdone by their rival\nHe really is a Foxcatcher: Channing was smiling like the cat who got the cream as he posed with Jenna\nShe blue them all away: The dancer showcased her powerful and lithe physique in this ostentatious dress\nThe Wilde bunch: Olivia was joined by her trainer-wearing other half Jason Sudeikis\nRearly impressive: Cheeky girl Olivia drew attention to her delightful derriere in this form-fitting dress\nNo wonder she's smiling: The Cowboys And Aliens favourite had easily outshone most of her glamour rivals\nMagic Mike favourite Channing Tatum, 35, and his wife Jenna Dewan Tatum both looked lovely, with the former staying on trendy by wearing a classic tux.\nSupergirl star Jenna, who is the same age as her husband meanwhile was knockout in an ostentatious navy number that boasted an enormous puffy skirt.\nBut the red carpet top dogs were challenged by the sprightly Olivia Wilde, who attended with her beefcake comedy star fiance Jason Sudeikis.\nStar phwoars: Harrison Ford and his wife Calista Flockhart looked fantastic\nLittle and large: Jason Statham was dwarfed by Rosie Huntington-Whiteley while Amy Adams gazed lovingly at Darren Le Gallo\nDamon thrill: The Martian star Matt was overshadowed by his beautiful former barmaid wife Luciana\nCowboys And Aliens favourite Olivia, 31, looked marvellous in a form fitting burgundy number that drew attention to her delightful derriere.\nMan of the moment Harrison Ford, 73, did not go Solo, as he brought along his glamorous much younger wife Calista Flockhart.\nThe 53-year-old looked fantastic in a lacy blue number with baroque embroidery on the torso.\nMaking him go Gaga: The good Lady was stared at lovingly on the red carpet by her beau Taylor Kinney\nGolden oldies: Steve Carell, wife Nancy, Viola Davis, wearing Marchesa, and her husband Julius Tennon looked at least as good as the younger stars\nThey look super: Batman Begins star Christian Bale brought wife Sibi while Avengers favourite Mark Ruffalo attended with Sunrise Coigney\nGlamour couple: Cate Blanchett showed off her handsome playwright husband Andrew Upton\n2016 GOLDEN GLOBE AWARDS WINNERS - FILM Best Performance by an Actress in a Motion Picture Drama Cate Blanchett, Carol Brie Larson, Room Rooney Mara, Carol Saoirse Ronan, Brooklyn Alicia Vikander, The Danish Girl Best Performance by an Actor in a Motion Picture Drama Bryan Cranston, Trumbo Leonardo DiCaprio, The Revenant Michael Fassbender, Steve Jobs Eddie Redmayne, The Danish Girl Will Smith, Concussion Best Performance by an Actor in a Motion Picture Musical or Comedy Christian Bale, The Big Short Steve Carell, The Big Short Matt Damon, The Martian Al Pacino, Danny Collins Mark Ruffalo - Infinitely Polar Bear\nBest Performance by an Actress in a Motion Picture Musical or Comedy Jennifer Lawrence, Joy Melissa McCarthy, Spy Amy Schumer, Trainwreck Maggie Smith, The Lady in the Van Lily Tomlin, Grandma Best Screenplay Motion Picture Josh Singer Charles Randolf The Big Short Steve Jobs Quentin Tarantino, The Hateful Eight Best Original Song Motion Picture Love Me Like You Do, Fifty Shades Of Grey One Kind Of Love, Love and Mercy See You Again, Furious 7 Simple Song #3, Youth Writing's On The Wall, Spectre\nBest Motion Picture - Drama Carol Mad Max: Fury Road The Revenant Room Spotlight Best Motion Picture - Musical or Comedy The Big Short Joy The Martian Spy Trainwreck\nBest Motion Picture - Animated Anomalisa The Good Dinosaur Inside Out The Peanuts Movie Shawn The Sheep Movie\nBest Motion Picture - Foreign Language The Brand New Testament, Belgium The Club, Chile The Fencer, Finland/Germany/ Estonia Mustang, France Son of Saul, Hungary Best Performance by an Actress in a Supporting Role in any Motion Picture Jane Fonda, Youth Jennifer Jason Leigh, The Hateful Eight Helen Mirren, Trumbo Kate Winslet, Steve Jobs Alicia Vinkander, Ex-Machina\nBest Performance by an Actor in a Supporting Role in any Motion Picture Paul Dano, Love & Mercy Idris Elba, Beasts of No Nation Mark Rylance, Bridge of Spies Michael Shannon, 99 Homes Sylvester Stallone, Creed Best Director Motion Picture Todd Haynes, Carol Alejandro G Inarritu, The Revenant Tom McCarthy, Spotlight Ridley Scott, The Martian George Miller, Mad Max:Fury Road\nBest Original Score Motion Picture Carol The Danish Girl The Hateful Eight Steve Jobs The Revenant","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393205/Will-Smith-wife-Jada-team-Tatums-Hollywood-s-hottest-couples-grace-Golden-Globes.html"}
