{"authors":[],"date_download":"2018-10-22 20:34:03","date_modify":"2018-10-22 20:34:03","date_publish":"2014-05-02 13:20:35","description":"Midterms aren't about momentum heading into the next White House contest. They're largely about drop-off voters.","filename":"data/vaneerConsumption/WillBigMidtermLossMean2016TroubleforDems.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/415761/new_hampshire_primary_2012-jpeg-02e2b_99e4c1fbd777c1062aa21a6e1a7edb93.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_will-big-midterm-loss-mean-2016-trouble-dems-n95551_1540240443.html","title":"Will Big Midterm Loss Mean 2016 Trouble for Dems?","title_page":"Will Big Midterm Loss Mean 2016 Trouble for Dems?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIt all comes down to turnout\nDemocrats who are bracing for a rough midterm season might also be worried about this trend -- when a party loses big in a \"Six-Year Itch\" election, it doesn’t fare well in the subsequent presidential contest. Think of the GOP's midterm losses in 1958 and JFK's win two years later. Or the GOP's big defeat in 1974 (Watergate) and Jimmy Carter's win after that. Or the GOP's midterm losses in 2006 and President Obama's White House win in 2008. The one exception to this, of course, took place in 1988, when Republicans held on to the White House, despite suffering midterm losses in 1986 (though don't forget that Democrats were the earlier favorites before the H.W. Bush campaign destroyed Dukakis in the late summer and fall). But in an important piece published earlier this week, political journalist Sasha Issenberg wrote that midterm elections aren't truly about a referendum on the president or about momentum heading into the next White House contest. Instead, he wrote, they're in large part about drop-off voters -- the people who cast votes in presidential elections but not in midterms. Indeed, 130 million voted in the 2012 election; just 90 million voted in 2010.\nWho are the drop-off voters?\nThey’re largely Democrats: Our new NBC/WSJ poll provides some insight into these drop-off voters, and here’s who they are: Democrats -- or more accurately, key blocs of the Democratic and Obama coalitions. Of the voters who said they voted in 2012 but not in 2010, 51% are Democrats (versus 25% Republicans and 17% independents); 61% are female (as opposed to 39% male); 35% are those 18-34 (compared with 28% 35-49, 25% 50-64, and 12% 65 and older); President Obama’s approval with them is 53%-40%; and they prefer a Democratic-controlled Congress by a 22-point margin, 55%-33%. In sum, this explains how the Democrats lost 63 House seats in 2010 but won across the board two years later. “Today the Republican coalition is stacked with the electorate’s most habitual poll-goers—or ‘Reflex’ voters, as we will call them. The Democratic Party claims the lion’s share of drop-off voters, or ‘Unreliables,’” Issenberg writes. So if the ultimate midterm results are largely about turnout, that suggests that whatever happens in November could very well not have an impact on 2016. Yes, it’s a cliché to say elections come down to turnout. But clichés become clichés because they usually are true. And in this case, perhaps, more true than usual.\nProfile of 2012 voters (who didn’t vote in 2010), per the NBC/WSJ poll:\nMale: 39%\nFemale: 61%\n18-34: 35%\n35-49: 28%\n50-64: 25%\n65+: 12%\nDemocrats: 51%\nIndependents: 17%\nRepublicans: 25%\nObama approve: 53%\nObama disapprove: 40%\nPreferring Democrats to control Congress: 55%\nPreferring Republicans to control Congress: 33%\nWhat has changed in 15 years and what hasn’t\n“Tattoos are in, reading the newspaper in print is out among Americans in 2014. Those are some of the findings from the latest NBC/WSJ poll about habits and activities that have changed over the past 15 years -- as well as those that haven't changed. In 1999, just 21% of Americans said that someone in their household had a tattoo. Now? That figure has doubled to 40%. And among those 18 to 34, it’s a whopping 58%. Just 47% of respondents say they currently read the newspaper in print at least three times a week – down from 79 percent who said this 15 years ago in the poll. (Still, 71% today say they read the newspaper either in print or online at least three times a week). But other things haven't changed much from 1999. Today, 69% say they know their neighbors well, versus 73% who said that 15 years ago. Moreover, 58% now report that they have a family dinner at least five times per week, compared with 60% who reported this in 1999. And in 2014, 38% of Americans say that someone in their household has served or is currently serving in the military – slightly down from the 44% who said this 15 years ago.\nBig gains in April jobs report\nThe breaking news from the AP: The economy added 288,000 jobs last month, and the unemployment rate dropped to 6.3% -- the lowest level in five and a half years. And the previous two months were revised upward by a combined 36,000 jobs. The only question is if this pace keeps up for the rest of the year.\nObama meets with Merkel at the White House\nToday at the White House, German Chancellor Angela Merkel meets with President Obama, and the two hold a joint news conference at 11:40 am ET. We’ve said this before, and we’ll say it again: Merkel and Germany are the linchpins in the U.S. effort to see tighter sanctions on Russia regarding its intervention in Ukraine. As long as the president insists that the U.S. can’t afford to get ahead of the Europeans on punishing Russia, then the ball’s in Merkel’s court. What she says today and what she doesn’t will tell us a lot about where the crisis with Russia and Ukraine is headed next.\nFirst Read’s Top 10 GOV takeovers\nLast Friday, we looked at the Top 10 Senate takeovers; today, we’re looking at the Top 10 gubernatorial takeovers. And while our Senate list is dominated by potential GOP pickup opportunities, our gubernatorial list shows a few more Dem pickups, thanks mostly to the fact that the GOP won big in 2010 and many of these incumbent GOP governors are in swing states. The order (from most likely takeovers):\n1. Pennsylvania (R): The most vulnerable governor in the country is Gov. Tom Corbett. The only question is whom Democrats nominate on May 20 to challenge him. And right now, the front-runner in that Democratic contest is businessman Tom Wolf – probably the best possible nominee the Democrats could come up with; somewhat of a technocrat.\n2. Florida (R): Gov. Rick Scott is ALMOST as vulnerable as Corbett; just see that recent Quinnipiac poll showing him trailing Charlie Crist (D) by 10 points. But Scott has three advantages Corbett doesn’t: 1) tons of money to spend, 2) a defined opponent in Crist and 3) a recovering Florida economy.\n3. Arkansas (Open-D): The likely race between two former congressmen -- Mike Ross (D) and Asa Hutchinson (R) -- is shaping up to be a good one. But for now, you have to give the GOP the slight edge given that Arkansas is such a tough state for Democrats. Then again, Sen. Mark Pryor (D-AR) still has a fighting shot in November, and the amount of coordinated money both parties will be dumping in the state guarantees that both statewide races will likely be nailbiters ‘til the end.\n4. Maine (R): The controversial Gov. Paul LePage (R) also is vulnerable in November. But unlike in Pennsylvania and Florida, there’s a legitimate third-party candidate, Eliot Cutler, who could hurt Democrats in a three-way race – just like he did in 2010 when he got 36% of the vote. This time, however, Democrats have a MUCH stronger general election candidate, Rep. Mike Michaud (D-ME). If this were a two-way race, LePage could be in our No. 1 slot.\n5. Illinois (D): Gov. Pat Quinn is the Democrats’ most vulnerable incumbent, and the GOP has a well-financed nominee in Bruce Rauner. But there are two things keeping Quinn alive in this race -- 1) Illinois is a deep-blue state, and 2) Quinn has proven to be a political survivor.\n6. Michigan (R): Given that Michigan has become a bluer and bluer state, Gov. Rick Snyder will face quite the challenge against former Rep. Mark Schauer (D-MI). The question is whether Snyder -- “the one tough nerd” -- still has appeal among independents and crossover Democrats, or if the very aggressive Republicans in the state legislature took that brand away from him.\n7. Connecticut (D): Gov. Dan Malloy will also have a fight on his hands -- probably against 2010 GOP opponent Tom Foley. That race was decided by fewer than 7,000 votes.\n8. Wisconsin (R): Democrats are once again targeting Gov. Scott Walker. And once again, he appears to have a slight edge. Winning this presidential battleground state three times in the past five years would be quite a message to GOP voters in 2016.\n9. Ohio (R): Just like Walker, Gov. John Kasich appears to have the early edge here. And just like in Wisconsin, the outcome could have an impact on 2016. Kasich lucked out in that Democrats didn’t find the A-list candidate they hoped to have, though Ed Fitzgerald will have plenty of resources to keep things close.\n10. (tie) Colorado (D)/South Carolina (R): Colorado Gov. John Hickenlooper (D) and South Carolina Gov. Nikki Haley (R) both have the early polling advantage. But both contests bear watching.\nYes, there are a few other competitive races not in our Top 10, including Georgia and Oregon, where both incumbents have tough records to defend but both incumbents (Republican Deal in Georgia and Democrat Kitzhaber in Oregon) have the advantage of a state that generally leans in their respective party’s direction.\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/will-big-midterm-loss-mean-2016-trouble-dems-n95551"}
