{"authors":["Leah Thomas"],"date_download":"2018-10-31 00:02:39","date_modify":"2018-10-31 00:02:39","date_publish":"2018-10-28 11:00:29","description":"Mention to a casual fan of The Walking Dead that Andrew Lincoln is leaving the AMC series and \"so Rick's gonna die\" is the most common response. Even if that person stopped watching several seasons ago, everyone knows that TWD characters pretty much…","filename":"data/vaneerConsumption/WillMaggieDarylKillRickOnTheWalkingDeadAndrewLincolnsExitHasFansExploringGruesomeOptions.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/25/35d56d2f-7344-4af3-9952-00b89c228b87-twd_904_gp_0612_0020_rt.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_will-maggie-daryl-kill-rick-on-the-walking-dead-andrew-lincolns-exit-has-fans-exploring-gruesome-options-12985064_1540944159.html","title":"Will Maggie & Daryl Kill Rick On 'The Walking Dead'? Andrew Lincoln's Exit Has Fans Exploring Gruesome Options","title_page":"Will Maggie & Daryl Kill Rick On 'The Walking Dead'? Andrew Lincoln's Exit Has Fans Exploring Gruesome Options","title_rss":"NULL","source_domain":"bustle.com","text":"Mention to a casual fan of The Walking Dead that Andrew Lincoln is leaving the AMC series and \"so Rick's gonna die\" is the most common response. Even if that person stopped watching several seasons ago, everyone knows that TWD characters pretty much only leave one way — so it's not surprising that theories about when and how Rick may die are running wild. But one theory, that Maggie and Daryl kill Rick on The Walking Dead, is particularly painful to think about. Their plans to eventually double cross him could be lethal. But could these three really turn on each other that much? It would be devastating given how much they've been through together.\nIf it's Daryl, know that actor Norman Reedus is not on board — at least, not at first, according to an interview the actor did with The Wrap:\n\"And at the end of last season, that very last scene that we shot, it looks like Jesus, Maggie and Daryl are going to turn on Rick. I wasn’t in that scene [at first]. Maybe an hour before that, they’re like, ‘We want to put you in this scene.’ And I was like, ‘What are you talking about? I can’t go against Rick. What are you talking about?’ And they were, ‘Trust us, it’ll play out later.’\"\n\"So I spent my whole hiatus thinking, ‘oh my god, I’m going to kill Rick, or he’s going to kill me,\" the actor added.\nIn that same interview, Reedus also explained that in the world of The Walking Dead, leaders only have followers as long as those followers agree with them. \"[Rick] is sort of blinded by grief and all these other things,\" Reedus said, \"and he has to make this work and for all these reasons but he’s not really listening to the people around him anymore.\"\nThere is one returning character in Season 9 that could be a clue — Shane, presumably in a flashback. Why is Shane back this year? In Season 2, Rick killed his best friend Shane after their post-apocalyptic ideologies were no long simpatico.\nShane was more than willing to kill living humans in order to protect the group, and while Rick loosened his moral stance in later seasons, in the aftermath of \"All Out War\" he's trying to lead with an \"every life matters\" philosophy yet again.\nWith so many former Saviors around, Daryl and Maggie are having trouble seeing eye to eye with their friend. Is, um, is that why Shane's back... to parallel the turn in Daryl and Rick's relationship, and how that conflict lead to one friend killing another? That would be absolutely devastating. Could Maggie kill Rick? Would Maggie kill Rick? It's still more likely that \"The Widow\" takes out Negan than her co-leader, but you never know.\nGene Page/AMC\nIt is always possible that Rick won't die at all. He could just walk away and leave, or be banished to some other corner of the apocalypse. Since character exits are (almost) always deaths on this show, especially for characters this prominent, the writers must have anticipated this kind of speculation. Perhaps the greatest trick The Walking Dead ever pulled is convincing fans that Rick Grimes was going to be killed — but we should all watch his relationship with Daryl and Maggie closely just in case.","url":"https://www.bustle.com/p/will-maggie-daryl-kill-rick-on-the-walking-dead-andrew-lincolns-exit-has-fans-exploring-gruesome-options-12985064"}
