{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 21:24:01","date_modify":"2018-10-30 21:24:01","date_publish":"2018-08-16 19:16:09","description":"Those last days of summer may be closing in on us, with school in session and Labor Day just around...","filename":"data/vaneerConsumption/WinddownthesummerinAtlantawiththesedrinksandbars.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/13/Images/clermont.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_th_e7c7e25634c8920c02318853325ed6d6__1540934641.html","title":"Wind down the summer in Atlanta with these drinks and bars","title_page":"Wind down the summer in Atlanta with these drinks and bars","title_rss":"NULL","source_domain":"ajc.com","text":"Those last days of summer may be closing in on us, with school in session and Labor Day just around the corner, but we’re not ready to abandon the season.\nCue frozen drinks and breezy establishments that offer the best views in town for a proper summer send-off. Here are five places in Atlanta hanging on to summertime.\nLifeguards serving boozy slushies get you into beach mode at King of Pos O4W Beach Bar\nIf you like pina coladas … King of Pops opened a second bar stall at Ponce City Market. Fringed with grass skirting, it is situated in the outside courtyard, next to the rooftop entrance. Beach balls and bartenders dressed as lifeguards instantly put you into vacation mode. Selections of boozy slushies rotate daily, and they have been known to serve pina colada slushies in cored pineapples on special occasions. Vodka-based watermelon-mint is a particularly refreshing and summery slush. You also can get their signature poptails, cocktails with the addition of a spiked popsicle. Their Fresh 75 includes gin, prosecco, lemon, elderflower and an upside down raspberry rosé pop.\n675 Ponce de Leon Ave. NE, Atlanta. 678-732-9321, kingofpops.com.\nPretend the people walking along the Beltline are beachgoers on the shore, and Lingering Shade instantly transports you to a fancy seaside bar in the Hamptons or Montauk. In fact, the cocktails are named for beachy towns. You can sip on a Pawley’s Island with rum, lemon juice and spiced pear liquor in one of the expansive courtyards. A bubbly Nantucket (cranberry liqueur, Cappelleti Aperitivo and prosecco) really complements the coastal ambiance of blue and white rattan bistro chairs, whitewashed walls, and a middle-aged crowd clad in Brooks Brothers. Make sure to ask for free Chex mix. It’s a winner.\n660 Irwin St., Atlanta. 678-215-6776, lingeringshade.com.\nThe hangout on top of the recently renovated Hotel Clermont offers vacation vibes along with panoramic views. The original radio tower is your beacon in neon. Take the elevator up to the patio in the sky, replete with artificial turf, lots of lounging areas, and a concise cocktail menu of tiki-esque drinks, cheap beer and wine. You don’t want to make a lot of decisions on vacation. Everything is refreshing in the plastic rooftop cups while playing giant Jenga, as the sun sets over the city. Take your cup home like a souvenir.\n789 Ponce de Leon Ave., Atlanta. 470-485-0485, hotelclermont.com.\nBermuda, Bahama, come on pretty mama. … Not sure if it includes Tom Cruise-style bottle tossing, but the Endless Summer pop-up at Sun in My Belly is all about laid-back summer vibes. For the third installment of the collaboration with 18.21 bitters, the next theme is “Cocktails and Dreams,” 7-11 p.m. on Aug. 27. Along with food from Dish Dive and OK Yaki Japanese Street Food, bartenders will be slinging Alabama Slammers, Kamikazis and Sex on the Beach.\n2161 College Ave., Atlanta. 404-370-1088, suninmybelly.com.\nIt’s a spritz life. There’s a sweet situation going on along the Beltline in Inman Park every Saturday and Sunday. The artificial turf outside Victory Sandwich Bar is bedecked with orange sling chairs and umbrellas, as the Aperol spritz (Aperol, prosecco, soda) takes over the restaurant’s sidecar for the month of August. The perfect summer combo of bitter and bubbly comes in all forms at Victory — a spritz, a slushie and in a spike soda called Cynola. Pretend you are living a life of leisure looking out from an Italian Villa as you gaze upon Freedom Trail. Play some ping-pong, eat a tiny sandwich or two, and celebrate summer.\n913 Bernina Ave. NE, Atlanta. 404-709-2892, vicsandwich.com.\nRELATED:\nMore metro Atlanta cocktail news\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/the-best-atlanta-bars-and-drinks-for-last-hurrah-before-summer-ends/hOJZEWYYYHrlPBAdJWENVJ/"}
