{"authors":[],"date_download":"2018-10-22 21:42:13","date_modify":"2018-10-22 21:42:13","date_publish":"2014-06-05 23:44:51","description":"Strong winds and flooding led to the deaths of at least three people in the South on Thursday as powerful thunderstorms moved through the region.","filename":"data/vaneerConsumption/WindsFloodingBlamedfor3DeathsinSouth.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/491151/140605-arkansas-storm-1959_c654b377b249e06adc2d66317f56b9d3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_winds-flooding-blamed-3-deaths-south-n124096_1540244533.html","title":"Winds, Flooding Blamed for 3 Deaths in South","title_page":"Winds, Flooding Blamed for 3 Deaths in South","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nLITTLE ROCK, Ark. — Strong winds and flooding led to the deaths of at least three people in the South on Thursday as powerful thunderstorms moved through the region.\nIn Arkansas, two people were killed as strong winds toppled trees. Craighead County Coroner Toby Emerson said one man died in Jonesboro when a tree fell on his home, while Arkansas Department of Emergency Management spokesman Brandon Morris said another person was killed when a tree fell on a van in in the town of Black Rock.\nIn southern Tennessee, a 72-year-old man died Thursday morning when his vehicle was swept downstream as he apparently tried to cross a flooded roadway, according to the Highway Patrol.\nWSMV-TV said a search was underway in Hickman County, Tennessee, for a 6- or 7-year-old child missing after a car became stuck in water Thursday afternoon.\nAfter hitting Arkansas and Tennessee, the storm system was expected to move through Georgia.","url":"https://www.nbcnews.com/news/us-news/winds-flooding-blamed-3-deaths-south-n124096"}
