{"authors":["Associated Press"],"date_download":"2018-10-22 23:36:26","date_modify":"2018-10-22 23:36:26","date_publish":"2017-03-16 07:24:15","description":"BUFFALO, N.Y. (AP) - Sometimes the toughest coaching decisions aren't zone defense or man-to-man, but double breasted or vest?Fashion can be just as...","filename":"data/vaneerConsumption/WinslossesandtiesFashionchoicesimportanttocoaches.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/07/wire-227125-1489649688-32_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319080_Wins-losses-ties-Fashion-choices-important-coaches_1540251386.html","title":"Wins, losses and ties: Fashion choices important to coaches","title_page":"Wins, losses and ties: Fashion choices important to coaches | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BUFFALO, N.Y. (AP) - Sometimes the toughest coaching decisions aren't zone defense or man-to-man, but double breasted or vest?\nFashion can be just as important on the road to the Final Four.\nVillanova's Jay Wright, West Virginia's Bob Huggins and Virginia Tech's Buzz Williams, whose tastes in clothing run from fine Italian silk to polyester, all offered the reasons for their sartorial choices on the sideline ahead of their first-round NCAA Tournament games.\nFILE - In this Dec. 31, 2016, file photo, Villanova coach Jay Wright gives instructions to his players during an NCAA college basketball game against Creighton in Omaha, Neb. Wright is regarded as one of the game's best-dressed coaches and was recently profiled in a GQ Magazine spread. Even his tailor has been doing interviews. (AP Photo/John Peterson, File)\nWright is regarded as one of the game's best-dressed coaches and was recently profiled in a GQ Magazine spread. Even his tailor has been doing interviews.\n\"We've got to get him under control,\" Wright said with a laugh.\nBut Wright takes serious pride in his \"traditional\" look and part of his news conference was devoted to addressing his style compared to that of Notre Dame's Mike Brey and Huggins, who prefer more casual outfits - no tie.\n\"I like Hugs' look,\" Wright said. \"When you wear a nice suit and you're in the huddle and they're sweating on your suit. The guys are dripping on top of you. I'm thinking why am I wearing this nice suit? But it's tradition.\"\nHuggins has worn a non-buttoned top for several years, a look that he joked better complements his body.\n\"I used to wear a tie. I did the whole deal,\" Huggins said. \"I had tie, vest, I mean the whole deal. Probably if you look at pictures of me and Jay early, I was probably better looking back then. Probably dressed better back then. I had been doing it longer, had more money.\n\"The whole story is this: I had a suit and tie on, and we're playing somebody, and I'm at Cincinnati, and I go in, and I'm like I got to put something different on, because I had sweat all of the way through my suit and my vest. They were heavy,\" he said.\n\"So they brought me in a pullover, and I put it on and coached the second half in a pullover, and I was walking in, my AD said, 'I just want to tell you look really good in that pullover. That's what really coaches should wear.' So I started wearing one.\"\nWilliams would like to change into something more, ahem, suitable to his coaching style. He's found himself a target after soaking through his shirt and jacket during games.\nHe keeps a backup suit in case he gets too wet.\n\"What I tried to do is incorporate vests,\" he said. \"It's the silliest thing ever, right? When you get your car fixed, does the mechanic sweat? You know, the guy that builds your house, the carpenter, I think he sweats. And I know it's funny, and I know I'm not the best looking guy in the world, but I'm just working real hard.\n\"All I want to do is help our guys as much as I can. If that means I sweat, who cares. That's kind of the way I feel, so I just wear a vest so it doesn't become viral on Twitter,\" Williams said.\nAfter he spent 15 minutes discussing his team's chances of repeating as national champions, Wright handled a couple pressing questions about his clothing game.\nDouble Windsor? And is pocket square necessary?\n\"Straight Windsor,\" he said. \"No, it's not always necessary. It depends on the outfit.\"\nAnd, the coach.\n___\nFor more AP college basketball coverage: http://collegebasketball.ap.org and http://twitter.com/AP_Top25","url":"https://www.dailymail.co.uk/wires/ap/article-4319080/Wins-losses-ties-Fashion-choices-important-coaches.html"}
