{"authors":[],"date_download":"2018-10-30 18:30:16","date_modify":"2018-10-30 18:30:16","date_publish":"2017-01-04 17:48:00","description":"The first Wednesday in January just sounds really dull.","filename":"data/vaneerConsumption/WinterStormHelena.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/04/Images/newsEngin.17328725_fbi-almanacs.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_perfectly-tri_32d97758b616f2c214bb9d775ec0957d__1540924216.html","title":"Winter Storm Helena","title_page":"Winter Storm Helena","title_rss":"NULL","source_domain":"ajc.com","text":"The first Wednesday in January just sounds really dull.\nIn fact, it’s completely trivial.\nJanuary 4 is National Trivia Day, according to the experts who track such things at the National Day Calendar. Hilariously, after laying out pretty much every trivial bit of information ever about trivia (including that the plural is “trivium” and the first trivia book was published in 1966), they then throw in the not so trivial fact that, “Our research was unable to find the origin of National Trivia Day.”\nBut that’s no reason not to celebrate it anyway (hey, it’s that or — trivia alert! — National Spaghetti Day, which also falls on Jan. 4). Here are five ways to do so:\n1. Play competitive trivia: The metro area is lousy with regular team and invidual competitions. These web sites keep track of what’s going on when and where — including on Wednesdays, so you can appropriately mark the big day: www.teamtrivia.com, www.outspokenentertainment.com and www.dirtysouthtrivia.com (which includes places you can play “Sex, Drugs and Rock N’ Roll trivia.”\nRELATED: Neighborhood guide to trivia nights in Atlanta\n2. Encourage teen trivia: The Forest Park branch of the Clayton County Library System is hosting a National Trivia Day event for teens from 4 p.m. - 5:15 p.m. on Wednesday. Information: Sha’rese Bing sharese.bing@co.clayton.ga.us . The library is located at 4812 West Street, Forest Park, 770-347-0160, www.claytonpl.org\n3. Bone up on winter weather trivia: Just in time for Winter Storm Helena and the end of the world this weekend (we kid, sort of …but there is a possibility of snow here on Friday and Saturday), take this “Are You a Winter Weather Expert” quiz from the Weather Channel.Mixed in with some “the very definition of trivia” questions like one about the coldest temperature ever recorded in the U.S., are some others that touch on things it would definitely be useful to know here. Including the one thing you shouldn’t do if you get stranded in cold weather here this weekend (spoiler alert: Do NOT drink the snow!)\n4. Start training with your family now for this upcoming trivia event: The Dr. Martin Luther King Jr. Movie Evening and Family Trivia Event will take place from 6:30 p.m. - 8 p.m. Jan. 23 at the Atlanta Fulton Public Library System’s Cleveland Avenue/RL Yancy branch. Trivia questions will be drawn from the book series, “Friends of Dr. Martin Luther King Jr.” by Jacqueline James. 47 Cleveland Avenue SW, Atlanta. 404-762-4116, www.afpls.org\n5. Amaze and annoy your friends with all sorts of Georgia-related trivium: Three quizzes from the crack staff of the AJC are really just fonts of wonderfully obscure trivia in disguise. F’rinstance, the “Do You Speak Southern Quiz” will allow you to use the sentence, “That boy ain’t nuttin’ but a suck-egg dog!’ in conversation — and be the only one who knows what that means! Meanwhile, feel free to talk right over the announcers during next Monday’s college football National Championship Game broadcast with wonderfully useless tidbits gleaned from this “How Well Do You Know the Yellow Jackets” quiz, and — don’t feel left out, Dawgs fans!” — this “How Well Do You Know the Georgia-Florida Rivalry” one.","url":"https://www.ajc.com/entertainment/perfectly-trivial-ways-celebrate-national-trivia-day-atlanta/37seF3EW6P0z3JERIHLZ4O/"}
