{"authors":["Associated Press"],"date_download":"2018-10-23 04:47:46","date_modify":"2018-10-23 04:47:46","date_publish":"2016-01-28 20:57:53","description":"Last weekend's blizzard was the fourth most powerful snowstorm to hit the Northeast in at least 66 years, the National Oceanic and Atmospheric Administration announced Thursday.","filename":"data/vaneerConsumption/WinterstormJonasranksasfourthlargestblizzardtohittheNortheast.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/21/3aoGvOj3g96dbb91fde46a742859-0-image-a-18_1454016326322.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421655_Weekend-blizzard-ranks-4th-worst-Northeast-snowstorms_1540270066.html","title":"Winter storm Jonas ranks as fourth largest blizzard to hit the Northeast","title_page":"Winter storm Jonas ranks as fourth largest blizzard to hit the Northeast | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The blizzard started Friday and lasted through Sunday, affecting 102.8million people and about 434,000\nLast weekend's crippling blizzard was the fourth most powerful snowstorm to hit the Northeast in at least 66 years, the National Oceanic and Atmospheric Administration announced Thursday.\nThe agency gave the storm a rating of 7.66 on the Northeast Snowfall Impact Scale, which ranks storms according to inches of snowfall, geographic reach and population affected. That bumps down to No. 5 the Presidents Day weekend storm of 2003, which had a score of 7.50.\nThe blizzard last Friday through Sunday affected 102.8 million people and covered about 434,000 square miles in 26 states, NOAA spokeswoman Maureen O'Leary said.\nAlmost 24 million people saw more than 20 inches of snow and 1.5 million got more than 30 inches, according to National Weather Service meteorologist Paul Kocin, who helped develop the scale. He called the storm a slightly smaller version of a January 1996 blizzard, No. 2 on the list, which covered a similar area.\nThe deadly blizzard Jonas now ranks as the fourth largest blizzard to hit the Northeast. Above, Manhattanites dig out their cars after the blizzard on Sunday\nThe storm also caused ocean surges along the Jersey Shore. Above, rising waters in North Wildwood, New Jersey on Saturday, January 23\n'This storm ranks up there with the great blizzards of the past 100 years in terms of amount of snowfall, size of impacted areas and population affected,' Kocin said in a statement.\nThe scale doesn't take into account other misery metrics, such as storm-related deaths, flight cancellations and power outages.\nA STORM OF HISTORIC PROPORTIONS The agency gave the storm a rating of 7.66 on the Northeast Snowfall Impact Scale, which makes it a category 4 storm. That means its impacts were 'crippling' but not 'extreme.' The scale is based on inches of snowfall, geographic reach and population affected. It doesn't include metrics such as death toll, economic impact or power outages. Nor does it rank a storm's severity in individual metropolitan areas. The January 22-24 storm hit from Mississippi to Maine, affecting 102.8 million people in 26 states. Almost 24 million people saw more than 20 inches of snow and 1.5 million got more than 30 inches.\n'We try to keep the scale as simple as possible,' Kocin explained in a telephone interview.\nThe scale encompasses data going back to 1950. It assigns each storm a numerical value and a category on a five-tier scale ranging from Category 1, 'notable,' to Category 5, 'extreme.' The recent storm's numerical value puts it in Category 4, 'crippling.'\nThe storm dropped snow from Louisiana to Maine and across parts of the southern Midwest. It also caused major coastal flood damage in New Jersey.\nAt least 52 people in 11 states and the District of Columbia died in storm-related incidents including car accidents, carbon monoxide poisoning and heart attacks while shoveling snow.\nOne of the highest snowfall readings was 42 inches, in Glengary, West Virginia, where some counties remained under states of emergency Thursday.\nThis storm was unique for its high level of predictability, Kocin said. Forecasters saw it coming a week in advance and accurately predicted snowfall amounts for most places days ahead of time. Notable exceptions included northern New Jersey and New York City, where snowfall was heavier than initially forecast, he said.\nSeveral transit networks were shut down while the blizzard was in full force, including the Long Island Railroad (LIRR). Workers are seen clearing LIRR tracks on Monday, January 25\nAbove a composite image showing the storm blanketing the Northeast in snow on Friday\nThe most powerful storm on the list is still the so-called Storm of the Century, which dropped more than 30 inches of snow in spots along a swath from Mississippi to Maine in March 1993. That extreme late-winter blast, characterized by NOAA as a superstorm, scored 13.2 on the scale. It affected more than 100 million people and caused more than $2 billion in property damage in 22 states, according to NOAA's website.\nThis weekend's storm's economic impact is still being calculated. Earlier this week, economists at Moody's Analytics pegged the lost economic output to $2.5 billion to $3 billion. That estimate just represents lost income for hourly workers and skipped consumer spending. It doesn't include damage to roads or other infrastructure.\nIn Maryland alone, where officials are seeking federal disaster aid, emergency management officials say they expect tens of millions of dollars in snow removal costs, damage to public property, and emergency measures to protect lives and property.\nBaltimore Mayor Stephanie Rawlings-Blake hasn't put a dollar figure on the recovery efforts, but said 'anytime you have a historic storm, the budget will be historic as well.'\nIn Virginia, Gov. Terry McAuliffe said the storm may turn out to be the state's costliest, wiping out a $200 million snow response budget.\nFederal workers in the Washington area have yet to have a normal day since the snowstorm. The government was closed from noon Friday through Tuesday. On Wednesday and Thursday, federal workers started with a three-hour delay\nSome students in Maryland and Virginia learned that their snow holiday will continue through Friday. Crews in Baltimore and Washington were still working to clear streets, and trash collection remained spotty in places.\nVirginia had the highest death toll — 12 — and state police there reported more than 8,400 calls for assistance.\nAt least five deaths across the region involved people sheltering inside cars that filled with carbon monoxide after their exhaust pipes were covered by snow. They included a 3-year-old girl in Passaic, New Jersey, who succumbed Wednesday, four days after her mother and brother died as her father shoveled snow outside their running car.\nA state of emergency continues through Friday afternoon in four West Virginia counties. The state transportation department says it used about 22,000 tons of road salt in four days.","url":"https://www.dailymail.co.uk/news/article-3421655/Weekend-blizzard-ranks-4th-worst-Northeast-snowstorms.html"}
