{"authors":["Greg Bluestein"],"date_download":"2018-10-30 19:06:50","date_modify":"2018-10-30 19:06:50","date_publish":"2015-02-16 06:00:08","description":"The snow, freezing rain or whatever else that falls upon north Georgia today will test Gov.","filename":"data/vaneerConsumption/WintryblasttestsNathanDealsnewweatherstrategy.json","image_url":"https://politics.myajc.com/rf/image/PortalConfig/np-paid/assets/politics.myajc/images/og-share-icon.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/politics.myajc.com/blog_politics_wintry-blast-_76d925891b7cc737ae68dc3e09bbb499__1540926410.html","title":"Wintry blast tests Nathan Deal's new weather strategy","title_page":"Wintry blast tests Nathan Deal's new weather strategy","title_rss":"NULL","source_domain":"ajc.com","text":"There will be no shortage of mentions of last year’s January storm that left thousands of commuters stranded on roads and students trapped in schools. And with the wintry mix looming, Deal seemed willing to take no chances. He declared 15 counties in north Georgia emergency zones and urged non-essential state workers to stay home.\nIt was poor communication and the slow response of leaders last year that snowballed last year's wintry weather into an unforgettable disaster. Deal and other state officials say they've learned from their mistakes.\nThe winter weather task force appointed by the governor has led to more equipment, a more proactive approach to clearing roads long before the first snowflake falls and promises of better communication with schools, forecasters and the public. A much-ballyhooed brine mix, another recommendation of the task force, has already been sprayed on roads to make it harder for snow and ice to stick.\nThe governor also has a new emergency response chief. Charley English, the long-time head of the Georgia Emergency Management Administration, has been replaced by Jim Butterworth, the former leader of the Georgia National Guard. Less than two months into the job, today's weather presents a test for him also.\n“If we just get rain, some people will say that we over-reacted,\" Butterworth told the AJC's Dan Klepal. \"But I’m in the management business, not the prediction business. And that’s what we are doing.”\nDeal spokesman Brian Robinson said crews spent Sunday pre-treating the roads and highway strike teams were poised even though most forecasts show only rain in most of metro Atlanta. Emergency officials stayed in the loop with meteorologists, he said, and funneled details to superintendents, some of whom closed their classrooms on Monday just in case.\nAnd this time, don't expect Deal's deputies to let him sleep through the night if the weather patterns shift. English apologized last year for not waking the governor up as the forecast grew grave. Robinson said Sunday evening that \"the governor has asked to be informed immediately at any hour\" if a new alert is sounded.\nStay safe, folks.","url":"https://politics.myajc.com/blog/politics/wintry-blast-tests-nathan-deal-new-weather-strategy/4YMP5CEirpGrZuq20JX7qI/"}
