{"authors":[],"date_download":"2018-10-23 00:04:17","date_modify":"2018-10-23 00:04:17","date_publish":"2017-03-16 08:48:14","description":"A senior IOC member apologised on Thursday after he compared the idea of banning doping-tainted Russia from next year's Winter Olympics to the Holocaust.Gian...","filename":"data/vaneerConsumption/WinterOlympicsIOCmemberapologisesforHitlercomment.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/08/wire-227397-1489654095-32_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319268_Winter-Olympics-IOC-member-apologises-Hitler-comment_1540253057.html","title":"Winter Olympics: IOC member apologises for 'Hitler' comment","title_page":"Winter Olympics: IOC member apologises for 'Hitler' comment | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"International Olympic Committee executive board member Gian Franco Kasper\nA senior IOC member apologised on Thursday after he compared the idea of banning doping-tainted Russia from next year's Winter Olympics to the Holocaust.\nGian Franco Kasper, an International Olympic Committee executive board member, said he was \"truly sorry\" for his comments to journalists in Pyeongchang, South Korea.\n\"It was an inappropriate and insensitive comment,\" the 73-year-old Swiss, head of the world winter sports body, said in a statement.\n\"I apologise unreservedly for any offence I have caused. I am truly sorry.\"\nKasper made his controversial remarks earlier on Thursday when asked about the prospect of barring Russia from next year's Winter Olympics in Pyeongchang over its doping record.\nConcerns have been growing that Russia is yet to clean up its act after a report commissioned by the World Anti-Doping Agency (WADA) uncovered systematic, state-sponsored doping, notably at the 2014 Sochi Winter Games.\n\"I'm just against bans or sanctioning of innocent people,\" Kasper said, on the sidelines of an IOC executive board meeting in Pyeongchang.\n\"Like Mr. Hitler did -- all Jews were to be killed, independently of what they did or did not.\"\nWhen challenged about comparing the two situations, Kasper said: \"Why not? Of course it's more extreme. But just the fact that the place you come from makes you guilty, I'm not okay for this, really not.\"\nKasper is among the world's most senior sports officials, as president of the International Ski Federation and the Association of International Olympic Winter Sports Federations.\nHe formerly sat on WADA's executive committee, and has been an IOC member since 2000.\nKasper was speaking as the IOC executive board deliberated proposals for the reform of WADA following calls for a shake-up in the fight against doping.\nThe IOC came under fire last year when it stopped short of banning Russia outright from the Rio Olympics, and instead let individual sports federations decide which Russian athletes could compete.\n\"I'm fully against banning or punishing somebody because of his passport,\" Kasper said.\n\"So next time you have a Mr. Smith who has doped, so all the Smiths of this world, wherever they come from, are automatically banned from participation.\n\"It's... the same (thing). We are here to protect the clean athlete, not punish the clean athlete.\"\nAmong the revelations of WADA's McLaren report were that Russia used a \"mouse hole\" in the wall of its Sochi laboratory to swap tainted urine samples with clean ones overnight.\nWADA chief Craig Reedie warned this week that Russia still had \"significant work\" to do before the suspension of its anti-doping body, RUSADA, is lifted.","url":"https://www.dailymail.co.uk/wires/afp/article-4319268/Winter-Olympics-IOC-member-apologises-Hitler-comment.html"}
