{"authors":[],"date_download":"2018-10-30 01:12:57","date_modify":"2018-10-30 01:12:57","date_publish":"2017-02-10 17:24:04","description":"A new report from KGI Securities analyst Ming-Chi Kuo, named “the best Apple analyst...","filename":"data/vaneerConsumption/Wirelesschargingoverheatingandpriceincrease.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/AP_Top_News/2017/01/31/Images/4d1c693853c84e88bd57b0cf3da41016.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/technology_iphone-leak-conf_178bc6ec1f19aeafcb48f5c84168ae72__1540861977.html","title":"Wireless charging, overheating and price increase","title_page":"iPhone 8 leak: Wireless charging, overheating and price increase","title_rss":"NULL","source_domain":"ajc.com","text":"A new report from KGI Securities analyst Ming-Chi Kuo, named “the best Apple analyst on the planet” by CultofMac.com, reveals new details about the iPhone 8 set to launch this year.\n» RELATED: 7 hidden iPhone tricks you probably never knew about\nAll the new iPhone models introduced in 2017, according to the report obtained by MacRumors.com, will feature wireless charging, a feature previously rumored to be in the works.\nBut Kuo also revealed in the report that the wireless charging feature will produce more heat and a new graphite layer will be added to protect the 3D Touch sensor. The total cost of production for the module will rise between 30-50 percent.\nWhat does that mean for consumers? Though Kuo doesn’t expect users to notice a difference in temperature or overheating, it could mean the new iPhone would cost more than $1,000.\nRead an excerpt from Kuo’s note below, obtained by MacRumors:\n“While we don’t expect general users to notice any difference, lamination of an additional graphite sheet is needed for better thermal control and, thus, steady operation; this is because FPCB is replaced with film, which is more sensitive to temperature change of the 3D touch sensor in OLED iPhone.”\nAccording to ValueWalk.com, the new product is also rumored to feature facial recognition.\nLook out for the iPhone 8, as well as iterative upgrades to the iPhone 7 and iPhone 7 Plus — all expected to have glass casing and wireless charging—in 2017.","url":"https://www.ajc.com/technology/iphone-leak-confirms-wireless-charging-but-reveals-apple-expensive-secrets/rksS3IiTvQgRCtpvfKLmTL/"}
