{"authors":[],"date_download":"2018-10-22 21:54:11","date_modify":"2018-10-22 21:54:11","date_publish":"2014-06-06 21:48:27","description":"Samuel \"Curt\" Johnson III was convicted of fourth-degree sexual assault and disorderly conduct.","filename":"data/vaneerConsumption/WisconsinBillionairePleadsGuiltytoSexualAssaultCharge.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_wisconsin-billionaire-pleads-guilty-sexual-assault-charge-n124951_1540245251.html","title":"Wisconsin Billionaire Pleads Guilty to Sexual Assault Charge","title_page":"Wisconsin Billionaire Pleads Guilty to Sexual Assault Charge","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Wisconsin billionaire pleaded guilty Friday to having repeated sexual assault with a teenage girl, a charge that prosecutors ended up downgrading from a felony to a misdemeanor after they said the victim and her family repeatedly refused to cooperate with them.\nSamuel \"Curt\" Johnson III, whose family has run home-products giant SC Johnson for five generations, was convicted of fourth-degree sexual assault and disorderly conduct. He was sentenced to four months in jail, short of the one-year maximum. He was also fined $6,000.\nIn considering the sentence, Judge Eugene Gasiorkiewicz acknowledged that neither the girl nor her mother wanted a case brought against Johnson. Authorities only became aware of the allegations after the 59-year-old sought counseling at a clinic in Scottsdale, Arizona, where he made an undisclosed comment that triggered a mandatory report.\nThe girl initially told Racine County investigators that Johnson had inappropriate sexual contact with her 15 to 20 times, starting the summer after she finished sixth grade. She said Johnson exposed himself, fondled her under her clothes and kissed her breasts and elsewhere.\nWhen the girl's mother confronted Johnson he denied the allegations, the criminal complaint said. Later the mother repeated the allegations and, after he confirmed that he wasn't being recorded, he acknowledged fondling the girl and apologized for hurting her, the complaint said.\nThe girl and mother would have been the state's two strongest witnesses. But Assistant District Attorney Robert Repischak said they refused to cooperate from the outset, leaving him a flimsy case. In absence of their cooperation, Repischak tried to gain access to Johnson's counseling reports, hoping that details of whatever triggered the counselor's report might have been incriminating enough. But the clinic also fought requests to cooperate, he said.\n\"I would have liked a chance to present the felony case to a jury,\" Repischak told reporters after the hearing. \"But given the state of the case, with little if any evidence, I did was I was able to do.\"\nJohnson worked for SC Johnson decades ago but has had no formal relationship with the company in years. During the hearing Gasiorkiewicz questioned Johnson to make sure he was entering informed guilty pleas. The judge asked if Johnson understood that fourth-degree sexual assault meant Johnson had sexual contact with the girl against her will.\n\"Yes, your honor,\" Johnson said softly. Later, he apologized to the victim and her mother for \"the tremendous hurt I have caused.\"\nJohnson's defense attorneys left the courtroom through a door inaccessible to reporters. Criminal charges were filed in March 2011, but the case was slowed by legal wrangling.\nJohnson's attorneys initially sought access to the girl's medical records to determine whether she reported the alleged assaults during therapy. An appeals court ruled that she couldn't testify in the case until she released her records, and the Wisconsin Supreme Court upheld the decision.\nThe girl and her mother refused to release the records, leaving prosecutors barred from calling the girl as a witness.\nJohnson is the former chairman of Sturtevant-based Diversey Inc., a company once owned by the family that founded SC Johnson. He resigned from Diversey's board in February 2011.\n—The Associated Press","url":"https://www.nbcnews.com/news/crime-courts/wisconsin-billionaire-pleads-guilty-sexual-assault-charge-n124951"}
