{"authors":["Mary Chastain"],"date_download":"2018-10-30 20:00:30","date_modify":"2018-10-30 20:00:30","date_publish":"2015-01-16 17:38:56","description":"One Wisconsin rock station banned all Seattle music. A Seattle suburb banned cheese until after the game. This must mean the rivalry between Seattle and Green Bay is heating up before the Seahawks and Packers showdown on Sunday in the NFC Championship Game. |","filename":"data/vaneerConsumption/WisconsinFMStationBansSeattleBandsAheadofNFCChampionship.json","image_url":"https://media.breitbart.com/media/2015/01/upi_LEEDS-FESTIVAL.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_01_16__1540929630.html","title":"Wisconsin FM Station Bans Seattle Bands Ahead of NFC Championship","title_page":"Wisconsin FM Station Bans Seattle Bands Ahead of NFC Championship | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"One Wisconsin rock station banned all Seattle music. A Seattle suburb banned cheese until after the game.\nThis must mean the rivalry between Seattle and Green Bay is heating up before the Seahawks and Packers showdown on Sunday in the NFC Championship Game.\nMilwaukee’s WLWK-FM, known as The Lake, started the “Say No to Seattle” Campaign. Midday host J. Pat Miller halted all music from Nirvana to Soundgarden to Jimi Hendrix to Heart.\nDouglas Schulze, city manager of Bainbridge Island, ordered a ban of all cheese products at city hall.\n“On Sunday, January 18, 2015, the Seattle Seahawks opponent in the NFC Championship game will be the Green Bay Packers, aka Cheeseheads,” Douglas wrote in his executive order. “Fans of the Green Bay Packers are frequently seen wearing obnoxious wedge-shaped foam hats painted yellow.”\nThe executive order also allows employees to dress all in blue, including all Seahawks gear.\nWhen this news hit Wisconsin, residents feigned to fume. One man said Seattle “should never ban cheese.” Other Packers fans suggested a boycott of coffee. Since it is cold in Wisconsin, fans decided to specifically boycott the famous Seattle brand of coffee.","url":"https://www.breitbart.com/sports/2015/01/16/wisconsin-fm-station-bans-seattle-bands-ahead-of-nfc-championship/"}
