{"authors":["Kiri Blakeley For Dailymail.Com"],"date_download":"2018-10-22 22:43:25","date_modify":"2018-10-22 22:43:25","date_publish":"2017-04-26 05:31:36","description":"Joe Pickett and Nick Prueher are being sued in New York by Gray Television after the pair pretended to be bodybuilders and appeared on Hello Wisconsin.","filename":"data/vaneerConsumption/Wisconsinmorningshowsuespranksters.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/05/3F9C265C00000578-0-image-a-118_1493180549624.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446308_Wisconsin-morning-sues-pranksters_1540248205.html","title":"Wisconsin morning show sues pranksters","title_page":"Wisconsin morning show sues pranksters | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A television station is suing a pair of pranksters for talking their way onto their morning show and pretending to be strongmen.\nJoe Pickett and Nick Prueher got booked on WEAU's Hello Wisconsin on November 29, after they insisted they were a pair of bodybuilders named Chop and Steele.\nThe duo said they were able to lift various household and yard items, including jugs of milk, cement blocks and tires.\nScroll down for video\nThe supposed 'strongman duo' 'Chop' and 'Steele' appeared on Hello Wisconsin in November\nThe pranksters pretended to be bodybuilders who could show people how to pump themselves up with household items\nThe duo did embarrassing things like crush baskets, throw sticks at each other, and hang off each other, all under the guise of physical fitness\nThe fake strongman team got on air by sending the station a press release claiming to be 'Joe 'Chop' Shopsin' and 'Nicholas 'Steele' Stelling.'\nThey said their goal was to 'use their muscles to entertain and educate' and claimed to have appeared on America's Got Talent, Steve Harvey, and at Disneyland.\nThe station was not amused when the pair got on air and 'Chop' discussed the violent outbursts he was prone to while abusing steroids and his wealthy upbringing, while 'Steele' discussed his 'body-image issues' and his impoverished upbringing.'\nAt one point they slapped tennis rackets at each other.\nThey then crushed straw baskets with their feet, while Chop threw sticks at Steele's back.\nThe morning show hosts seemed to not to know quite what to make of the duo, but managed to keep a straight face.\nWEAU didn't find the prank funny and its parent, Gray Television, filed a federal lawsuit this month in New York against Joe Pickett and Nick Prueher, reported The Mercury News.\nThe comedy duo have a website and YouTube channel where they prank people and showcase old videotapes found at garage sales and thrift stores.\n'I guess Gray Television didn't have a sense of humor about this thing, Prueher told the outlet. 'They're trying to scare us, but we're going to fight it because we're well within our rights doing what we did.'\nSimilar to the Hans and Franz bodybuilders of Saturday Night Live, the pair subtly poked fun of strongmen while doing embarrassingly bizarre strength exercises\nThe pair showed how to increase strength while body pressing each other and Chop discussed violent outbursts he would have while on steriods\nJoe Pickett (left) and Nick Prueher of Found Footage Festival are being sued by Gray Television for fraud and copyright infringement\nGray Television is claiming fraud and copyright infringement, asking the court to find that the pair infringed on the copyright of the episode of Hello Wisconsin in which they appeared.\nPrueher admitted the suit was 'a little scary' but also 'amusing.'\n'If they had done… their due diligence, that I feel like is the responsibility of a news organization, they would have known this was a goof, but you know, they didn't,' he said.","url":"https://www.dailymail.co.uk/news/article-4446308/Wisconsin-morning-sues-pranksters.html"}
