{"authors":["Mary Chastain"],"date_download":"2018-10-30 17:59:19","date_modify":"2018-10-30 17:59:19","date_publish":"2015-11-10 02:07:58","description":"Wisconsin Representative Melissa Sargent (D-Madison) believes tampons and maxi pads should be free is public buildings.","filename":"data/vaneerConsumption/WisconsinRepDemandsFreeTamponsinPublicBuildings.json","image_url":"https://media.breitbart.com/media/2015/11/feminine-hygiene-products-Natacha-PisarenkoAP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_09__1540922359.html","title":"Wisconsin Rep. Demands Free Tampons in Public Buildings","title_page":"Wisconsin Rep. Demands Free Tampons in Public Buildings","title_rss":"NULL","source_domain":"breitbart.com","text":"Wisconsin Representative Melissa Sargent (D-Madison) believes tampons and maxi pads should be free is public buildings. Sargent claims a woman spends $70 a year on these products.\n“It is imperative that our society address the stigma, and parity surrounding feminine hygiene,” she wrote on her Facebook page.\nBut the majority of comments do not welcome this legislation.\n“Now you WANT the government in your vagina? Make up your mind,” wrote Phillip Holk.\n“Seriously, do you really think there is a stigma surrounding feminine hygiene?” said Jill Brooks. “This is not the 1950s. I don’t think a woman feels funny asking another woman if she can have a pad or buying it out of a machine. What study was done to come to this conclusion? Or, was it the study that asked, ‘Would you like to get free PERSONAL supplies from your state?’”\nShe also retweeted the account @FreeTheTampons, which is a campaign to put free hygiene products in public restrooms.\nThe UN even invited their founder to address the organization in May about menstrual health policies.\nFounder @NancyKramer invited to the UN to speak about menstrual health policies & advancing reform! #FreeTheTampons pic.twitter.com/IGTCsNFS14 — Free The Tampons (@FreeTheTampons) May 13, 2015\nApparently, Democrat and liberal women believe there is some sort of conspiracy against women due to their menstrual cycle. First it was the birth control pill, now it is tampons and pads. In June, activists in New York demanded more education on the costs of hygiene products because this “stigma has prevented some of the most vulnerable — especially homeless women — from accessing pads and tampons and inhibited others from speaking out about missing school or work.”\nThe New York City Council actually met with these activists to discuss legislation “to decrease health risks, tackle the taboo surrounding menstruation and ‘further women’s equality.’”","url":"https://www.breitbart.com/politics/2015/11/09/wisconsin-lawmaker-demands-free-tampons-public-buildings/"}
