{"authors":[],"date_download":"2018-10-22 21:51:20","date_modify":"2018-10-22 21:51:20","date_publish":"2014-06-06 19:59:20","description":"Gay marriages start, despite confusion over when the ruling takes effect. Also, North Dakota became the final state to have its ban challenged.","filename":"data/vaneerConsumption/WisconsinGayMarriageBanStruckDown.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/493371/140606-gay-marriage-flag-jsw-430p_0d16f2c44b9fcf7f91c8188822900053.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_wisconsin-gay-marriage-ban-struck-down-n124831_1540245080.html","title":"Wisconsin Gay Marriage Ban Struck Down","title_page":"Wisconsin Gay Marriage Ban Struck Down","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA federal judge struck down Wisconsin's ban on same-sex marriage on Friday, ruling it unconstitutional.\nIt wasn't clear whether U.S. District Judge Barbara Crabb's 88-page ruling cleared the way for same-sex marriages to begin immediately.\nBut the ruling makes Wisconsin the 27th state where same-sex couples can marry under law or where a judge has ruled they ought to be allowed to wed.\nThe judge's decision resulted in confusion over whether gay couples could immediately be given marriage licenses.\nClerks in Madison and Milwaukee planned to start marrying same-sex couples despite disagreement over the effect of the ruling. Milwaukee County Executive Chris Abele said he was keeping his courthouse open until 9 p.m. to begin marrying same-sex couples.\n\"I have been waiting decades for this day to finally arrive and we won't make loving couples wait longer than they want to get married,\" Abele said.\nRepublican Attorney General J.B. Van Hollen vowed to appeal the ruling.\nAlso Friday, seven couples filed a federal lawsuit challenging the constitutional ban on same-sex marriage in North Dakota, making it the last state in the country to be sued by couples seeking the right to marry in their home state.\nThe lawsuit challenges both North Dakota's constitutional ban on gay marriage and its refusal to recognize marriages of same-sex couples who legally wed in other states. That means cases are currently pending in all 30 states with gay marriage bans. Judges have overturned several of those bans since the U.S. Supreme Court struck down part of the federal Defense of Marriage Act last year.\nThe 2004 voter-approved constitutional ban on same-sex marriage was passed by 73 percent of voters.\nFiled by Minneapolis attorney Josh Newville, who is also representing six South Dakota couples in a similar case, the lawsuit claims violations on three issues that are guaranteed in the 14th Amendment to the U.S. Constitution: equal protection, due process and right to travel.\nIn 19 states and the District of Columbia, gay couples already can wed, with Oregon and Pennsylvania becoming the latest to join the list when federal judges struck down their bans and officials decided not to appeal.\n— The Associated Press","url":"https://www.nbcnews.com/news/us-news/wisconsin-gay-marriage-ban-struck-down-n124831"}
