{"authors":["Jennifer Newton For Mailonline"],"date_download":"2018-10-23 02:31:09","date_modify":"2018-10-23 02:31:09","date_publish":"2016-01-11 14:49:18","description":"April Gehl from Hilbert High School in Wisconsin, sent a tweet containing a profanity aimed at her local athletic association after they took students to task on disrespectful chanting during matches.","filename":"data/vaneerConsumption/WisconsinHilbertHighschoolbasketballplayerAprilGehlsuspendedovertweet.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300AD16800000578-0-image-a-85_1452522523208.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393990_High-school-basketball-player-suspended-tweet-criticizing-Wisconsin-athletic-association-reminded-students-sporting-behavior_1540261869.html","title":"Wisconsin Hilbert High school basketball player April Gehl suspended over tweet","title_page":"Wisconsin Hilbert High school basketball player April Gehl suspended over tweet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A High School athlete has been suspended from her girls' basketball team after tweeting a profanity aimed at the local school athletic association when they reminded students to show sporting behavior at events.\nApril Gehl is one of the top scorers for the Wolves team at Hilbert High School in Wisconsin and was one of the thousands of students that received an email from the state's interscholastic athletic association.\nThe message took the students to task for what they saw as disrespectful chants during sports even that mock the opposing team or school.\nApril Gehl, who has been suspended from her school's basketball team after tweeting a profanity aimed at the local school athletic association when they reminded students to show sporting behavior at events\nAmong the examples of chants cited were 'You can't do that', 'There's a net there' and 'season's over.'\nThe email was sent to schools last week and was also inlcuded in their daily announcements.\nHowever, Miss Gehl, a five foot ten senior forward, responded by taking to her Twitter account and posting a picture of the email with the caption: 'EAT S*** WIAA.'\nAnd after it was picked up, athletic director at the school Stan Diedrich told her she would be suspended for five games during the winter season.\nMiss Gehl told the Post Crescent: 'I couldn't believe it. I was like \"Really?\" For tweeting my opionion? I thought it was ridiculous.\nDirector of communications at the WIAA confirmed that Miss Gehl's tweet was brought to the attention of the association and they then informed the school via email.\nDirector of communications at the WIAA confirmed that Miss Gehl's tweet, pictured, was brought to the attention of the association and they then informed the school via email\nMiss Gehl added: 'My mom asked to see the email and (Diedrich) showed it to her. Because it came directly from the WIAA, they felt they had to do something, that's why I got punished that way.'\nMiss Gehl's tweet still remains on her Twitter account, and she says she has no intention of deleting it as she has 'already been punished for it.'","url":"https://www.dailymail.co.uk/news/article-3393990/High-school-basketball-player-suspended-tweet-criticizing-Wisconsin-athletic-association-reminded-students-sporting-behavior.html"}
