{"authors":["Scott Neuman"],"date_download":"2018-10-22 21:41:38","date_modify":"2018-10-22 21:41:38","date_publish":"2014-06-19 00:00:00","description":"The governor, who was the subject of a 2012 recall vote, is said to have coordinated fundraising with outside conservative groups in violation of state law.","filename":"data/vaneerConsumption/WisGovScottWalkerAccusedOfIllegalFundraising.json","image_url":"https://media.npr.org/assets/img/2014/06/19/ap326831121515_wide-1b888a3cecda7fadb5029e3d5f1a1c565b192a97.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_06_19_323684698_wisc-gov-scott-walker-accused-of-illegal-fundraising_1540244498.html","title":"Wis. Gov. Scott Walker Accused Of Illegal Fundraising","title_page":"Wis. Gov. Scott Walker Accused Of Illegal Fundraising : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Wis. Gov. Scott Walker Accused Of Illegal Fundraising\nEnlarge this image toggle caption Jeffrey Phelps/AP Jeffrey Phelps/AP\nProsecutors believe that Wisconsin Gov. Scott Walker was at the center of a \"criminal scheme\" to illegally coordinate fundraising with outside conservative groups in violation of state law.\nThe Associated Press reports that \"documents were filed as part of an ongoing lawsuit challenging the probe by the conservative group Wisconsin Club for Growth. They were ordered publicly released Thursday by a federal appeals court judge after prosecutors and the Wisconsin Club for Growth did not object.\"\nThe Wisconsin State Journal reports that prosecutors say Walker and others sought to circumvent state campaign finance and election laws:\n\"They said the coordinated effort involved conservative groups, Walker, his campaign and top allies of the governor, including [Walker campaign adviser and Wisconsin Club for Growth spokesman] R.J. Johnson and Deborah Jordahl. \"The prosecutors allege that Walker and those allies raised money and coordinated spending with about a dozen conservative groups during the recall elections [of 2011 and 2012]. \"They cite a May 2011 email from Walker to prominent national GOP strategist Karl Rove saying that Johnson would lead the coordination. \" 'Bottom-line: R.J. helps keep in place a team that is wildly successful in Wisconsin. We are running 9 recall elections and it will be like 9 congressional markets in every market in the state (and Twin Cities),' Walker wrote to Rove on May 4, 2011, the documents say.\"\nIn February, Club for Growth filed a federal lawsuit hoping to derail the investigation, which at the time was thought to involve Walker.\n\"The scope of the criminal scheme under investigation is expansive,\" lead investigator Francis Schmitz wrote in the Dec. 9 court filing. \"It includes criminal violations of multiple elections laws\" including filing false campaign reports, he wrote, according to the AP.\nBy way of background, the AP writes:","url":"https://www.npr.org/sections/thetwo-way/2014/06/19/323684698/wisc-gov-scott-walker-accused-of-illegal-fundraising"}
