{"authors":["Lauren Grounsell For Daily Mail Australia"],"date_download":"2018-10-22 20:53:33","date_modify":"2018-10-22 20:53:33","date_publish":"2016-01-29 04:44:24","description":"Over-sized coats, wide-leg pants and comfortable knits set the tone for Australian label Witchery's autumn/winter collection. The show featured pieces in keeping with the current seventies trend.","filename":"data/vaneerConsumption/WitcherylaunchitsAutumnWinter2016collectionandkeepthe70strendalive.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/03/30AEC6C400000578-0-image-a-97_1454038821152.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3421731_Witchery-launched-Autumn-Winter-collection-sized-coats-wide-leg-pants-comfortable-knits_1540241613.html","title":"Witchery launch its Autumn/Winter 2016 collection and keep the 70s trend alive","title_page":"Witchery launch its Autumn/Winter 2016 collection and keep the 70s trend alive | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Vintage inspired styles that brought back the Seventies dominated spring/summer runways, and the trend appears to be continuing in to winter.\nAustralian fashion label Witchery launched their autumn/winter collection at Sydney's Carriageworks on Thursday with a mix of monochrome pieces, seventies flair and casual street wear.\nGrey, black and white dominated the runway alongside tailored trench coats and wide-leg pants, with a throw-back to bygone eras apparent with flared sleeves and sheer lace.\nScroll down for video\nBring on winter: Australian label Witchery launched their Autumn/Winter collection in Sydney on Thursday\nLace and layers: Over-sized coats and delicate lace pieces were rife on the runway\nMonochrome: Grey, black and white pieces dominated the autumn/winter runway\nWinter woolies: Woollen coats and tweed pants are wardrobe staples this winter\nWitchery injected a masculine edge in to their collection with over-sized blazers and wide-leg pants.\nThe textured pieces combined woolen trench coats with tweed trousers that were paired with loafer-style footwear.\nTo give the collection a feminine feel, Witchery presented a sheer skirt and billowing sleeved top that they accessorised with an over-sized feather necklace.\nSeventies flair: The collection was in keeping with the current seventies trend and featured flared sleeves\nBold statement: Bell sleeves gave a nod to bygone eras (left) while an all-black ensemble set the trend for winter (right)\nBlack and white: Wide leg pants were a runway staple paired with loafer-style shoes or chunky heels\nWinter wardrobe: Pencil skirts with over-sized buttons and long-sleeved blouses featured\nThey continued the popular seventies trend with a series of flared pieces, wide leg pants and bell sleeves.\nA loose-fitting top with layered flared sleeves gave a nod to bygone eras, but was kept on trend with well-cut tailoring and monochrome colour palette.\nWoolen skirts with over-sized buttons were favoured and paired with delicate lace for a textured look.\nLady in lace: Witchery injected femininity in to the collection with intricate lace pieces\nGreen with envy: Pops of colour broke up the otherwise monochrome collection\nBold patterns: A snakeskin full-sleeved maxi dress paired with thigh-high leather boots made a statement on the runway\nFeminine touch: Lace pieces gave texture to the predominantly monochrome collection\nWitchery stepped away from their monochrome colour palette with a series of patterned and lace pieces.\nThey showed an olive green, snakeskin and a deep burgundy to add a splash of colour to the collection.\nA snakeskin, long-sleeved maxi dress was paired with thigh-high leather boots in a daring ensemble, and they added some femininity to the collection with a high-neck lace dress and intricately detailed lace burgundy top.\nStreet style: Comfy knits, over-sized coats and sneakers set the tone for the upcoming season\nStyle and comfort: They paired tracksuit-style pants with hooded jumpers and woolen coats\nBest foot forward: Sneakers were the epitome of street style\nCasual street wear was rife on the runway.\nSlouched tracksuit pants, over-sized jumpers and thick woolen coats were teamed with black leather sneakers making for a relaxed, comfortable look.\nThe monochrome pieces features ankle-grazing pants layered with hooded jackets and snoods.\nThe men's collection followed suit with an olive green, white and grey colour palette, padded coats and layers.\nFor the men: The colour palette stayed in keeping with the women's collection and featured olive green, grey and white\nCity slicker: The runway show was held in Sydney's Carriageworks","url":"https://www.dailymail.co.uk/femail/article-3421731/Witchery-launched-Autumn-Winter-collection-sized-coats-wide-leg-pants-comfortable-knits.html"}
