{"authors":[],"date_download":"2018-10-30 14:31:26","date_modify":"2018-10-30 14:31:26","date_publish":"2015-07-01 00:00:00","description":null,"filename":"data/vaneerConsumption/WitchdoctorscastingspellsthatturnAfricangirlsintosexslaves.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_witch_doctors_casting_spells_that_turn_african_girls_into_sex_slaves_1540909886.html","title":"Witch doctors 'casting spells' that turn African girls into sex slaves","title_page":"Witch doctors 'casting spells' that turn African girls into sex slaves","title_rss":"NULL","source_domain":"americanthinker.com","text":"The sex slave trade is bad enough, but apparently it gets even worse when witch doctors get into the act. Young Nigerian girls are captured by African witch doctors and have \"spells\" cast on them involving the elaborate use of poultry, and then are sent to Europe to become sex slaves .\n... in a terrifying ritual she was made to undress – they cut her pubic hair and toenails and made her swear over the blood of a chicken that she would never betray her benefactor. Many of the girls have travelled with a lucky charm - a small package that has been prepared and serves as a concrete expression of the agreement. As well as nail clippings and hair it may contain underwear with remains of menstrual blood. Other common objects are kola nuts, 13 bent pieces of metal and soap to symbolise loyalty, the power of the Ogun deity (important for travel) and beauty. (snip) According to urban legend among the women, girls who go back on their symbolic promise become mad, struck dumb or die, one, they say, was found in four pieces on the side of the road. One girl, Precious, told volunteers that she had a goose’s heart in her throat, which she thought would kill her. Italian aid workers have found it is useless to tell girls like Favour that the magic, known in Nigeria as jiu-jiu, has no power.\nOnce they get to places like Italy, they are forced to be prostitutes.\nThere are estimated to be 25,000 Nigerian girls working as prostitutes in Italy and the numbers arriving rose 300 per cent in 2014, experts say. In Turin, which has Italy’s biggest Nigerian population, Paradiso says many women are forced to streetwalk from 10pm to 5am before returning to their homes where they pay rent of €300 a month to live in terrible conditions. She has seen many cases of girls beaten, tortured with cigarettes or hot irons. Other have told how they forced to drink the water in which the other girls have washed their vaginas as a form of humiliation.\nThe spells are being taken seriously, and the Catholic Church has gotten into the act and is fighting back:\n... the Italians have even resorted to get Catholic priests to perform exorcisms on them.\nWhy am I writing about this? Well, one reason is to show that slavery is alive and well in the 21st century. But another reason is that liberals always blame white people in America for slavery, which ended over 150 years ago. But slavery would not have been possible back then unless Africans had enslaved other Africans and sold them to slave traders. Furthermore, most of the slavery that goes on today is run by Africans – both blacks and Arabs. But no one talks about that, because there's no way to blame white people for it. President Obama certainly doesn't talk about it. Neither does Hillary Clinton. This shows that once again, the real concern is not the victims of actual slavery, but another way to perpetuate a politically correct way to attack white people, none of whom living today ever held a slave.\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/07/witch_doctors_casting_spells_that_turn_african_girls_into_sex_slaves.html"}
