{"authors":[],"date_download":"2018-10-30 01:04:52","date_modify":"2018-10-30 01:04:52","date_publish":"2017-04-03 00:00:00","description":null,"filename":"data/vaneerConsumption/WithbadpollsforTrumpbringbackKellyanneConway.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_04_with_bad_polls_for_trump_bring_back_kellyanne_conway_1540861492.html","title":"With bad polls for Trump, bring back Kellyanne Conway","title_page":"With bad polls for Trump, bring back Kellyanne Conway","title_rss":"NULL","source_domain":"americanthinker.com","text":"Just 34% of the public approve of the job President Trump is doing, as his support among Republicans and independents tumbles, according to the April IBD/TIPP poll . Fifty six percent disapprove of the job he's doing. Approval ratings for a president haven't been this low President Bush's last months in office.\nPresident Trump is having a devilish time, and not surprisingly, he has slumped in the polls. The most reliable of all of them, the IBD/TIPP poll, reports that President Trump's approval rating has plunged in the wake of the nonstop tangled Russia inquiry and the failure of Obamacare Lite to pass Congress. IBD writes:\nLast month, 40% of independents approved of the job Trump is doing; just 29% approve today. Among Republicans, Trump's job approval is 74%, which represents a 14-point decline from last month. The latest IBD/TIPP poll was taken from March 24-30, and includes responses from 904 people across the country, giving it a margin of error of +/-3.3 percentage points. Across the board, the poll has bad news for Trump.\nThis is such sad news, given the meritlessness of the Russia \"narrative\" and the obstinacy and willingness to keep the status quo over compromise of the House Freedom Caucus. What's more, Andrew Malcolm reports that the recriminations that have emerged in the wake of these snake-pit hissings is threatening the entire GOP agenda.\nThe good news is that Trump can recover. How do we know this? Because he has, and he knows how. Back during the 2016 presidential campaign, when all sorts of negative stories came out, Trump fought them off with vigor and energy by taking his case to the people. That helped quite a bit. But even more helpful, he re-steered the narrative back to substance and the issues. That was the doing of campaign manager Kellyanne Conway.\nShe knew what would bring Trump back in the polls, and her victory on election night was the final vindication. She's since been buried in the Trump White House somewhere and now needs to be brought out front and center, just as she had been before. She knows how to steer the political white noise back to issues and to the substantial, which is what people care about, and leave the nesting vipers of the D.C. Swamp to eat each other. For that, she should be given wide berth to get this job done.\nThis isn't to say that the nesting viperage activity, led by Susan Rice and the NSC dead-enders, should not be addressed. A hard hand of rule of law would do wonders to chase the others out or force them to behave. There are too many deep-staters busying themselves by undermining Trump and ruining his presidency. They need to be booted out there on the double with busts where necessary.\nIt's time for Trump to be the Big Dog once again. The people demand nothing less.","url":"https://www.americanthinker.com/blog/2017/04/with_bad_polls_for_trump_bring_back_kellyanne_conway.html"}
