{"authors":["Rachel Simon"],"date_download":"2018-10-30 22:46:18","date_modify":"2018-10-30 22:46:18","date_publish":"2014-08-14 19:24:12","description":"There are plenty of reasons to tune into this year's Emmy Awards, coming up in just 11 days: the number of A-list presenters, the Robin Williams tribute, Orange is the New Black's (likely) takeover. The actual races, though, are too uninspired and…","filename":"data/vaneerConsumption/WithTrueDetectiveinEmmysBestLeadDramaActorRaceThisCategoryIstheToughestOfAll.json","image_url":"https://imgix.bustle.com/rehost/2016/11/10/d33da275-8c7f-470d-84b9-8831de7cd197.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35814-with-true-detective-in-emmys-best-lead-drama-actor-race-this-category-is-the-toughest-of_1540939578.html","title":"With 'True Detective' in Emmys' Best Lead Drama Actor Race, This Category Is the Toughest Of All","title_page":"With 'True Detective' in Emmys' Best Lead Drama Actor Race, This Category Is the Toughest Of All","title_rss":"NULL","source_domain":"bustle.com","text":"There are plenty of reasons to tune into this year's Emmy Awards, coming up in just 11 days: the number of A-list presenters, the Robin Williams tribute, Orange is the New Black's (likely) takeover. The actual races, though, are too uninspired and repetitive to be a real incentive — well, all except one. Unlike most years, the 2014 Best Lead Actor in a Drama category is one of the most exciting Emmy competitions in years, and it's all thanks to a little show called True Detective .\nUntil this year, the Best Drama Actor race was as predictable as could be: a cable TV star would win, Jon Hamm would lose, and a couple of those guys from Downton Abbey or Boardwalk Empire would round out the rest. The contenders were always high-quality actors, and the winners always seemed to be deserving of their victories. Still, the race was, well, boring.\nAnd then came True Detective, the eight-episode HBO show, and every Emmy competition it entered was suddenly turned upside down. For some of the categories, like Best Drama Series, the addition of the show made things complicated; wasn't it already hard enough to choose between Game of Thrones and Breaking Bad without adding Detective into the mix? For others, though, like Best Lead Actor, it just made things very, very interesting. Breaking down the toughest race of this year's Emmy Awards:\nFrontrunner: Matthew McConaughey\nTrue Detective's McConaughey is widely considered the favorite to win this race, and for good reason: his performance in the show's eight episodes was transformative, the culmination of a two-year-long \"McConaissance.\" And, if he wins, he'll be one of just a small number of actors who've received both an Oscar and an Emmy in the same year. Personally, though, I wasn't as blown away by the actor in Detective as everyone else; he was certainly good, but good enough to win an Emmy in his race's most competitive year yet? Not in my opinion, but I know that most others disagree.\nBryan Cranston\nMy personal choice for Best Actor, Cranston will likely take home the prize if McConaughey doesn't. His three prior wins might turn some voters off, but then again, the fact that it's Breaking Bad's last chance at the Emmys could convince others to give him the honor. I'd love to see him win for his incredible performance during the show's final season, and if the category's voters don't consist solely of True Detective fans, it's almost certainly going to Cranston.\nKevin Spacey\nI could never get into House of Cards. I thought it was boring and tiresome, and that breaking-the-fourth-wall thing that Spacey's character always did bugged the hell out of me. Yet I couldn't deny that quirky camera angles aside, the show's acting was top-notch, particularly Spacey's fantastic performance as Frank Underwood. He didn't win last year, and likely won't this year — but if he does, it'll certainly be deserved.\nWoody Harrelson\nHarrelson has received far less praise and attention for the show than his Detective co-star, and the oversight is unjust; in my opinion, the actor's performance was just as good as McConaughey's, just more subtle. Yet if a Detective star is going to take home the prize, it's going to be the guy who just won an Oscar, not his Hunger Games-starring partner in crime. Still, you never know — perhaps Emmy voters have a soft spot for the sidekicks.\nJeff Daniels\nIn a normal world, Jeff Daniels would never win this race. He's a fine actor, but the others are better, and his show, The Newsroom is not very good. Yet this is not a normal world, because last year, Daniels won, beating actors that included Cranston, Spacey, and Homeland's Damian Lewis. To be fair, no one seemed more surprised than him. Still, though, this should not happen again. Unfortunately, it might.\nJon Hamm\nJon Hamm will not win. Jon Hamm never wins. Maybe next year, when Cranston's out of the race, he'll have a chance. But let's be real: it's not gonna happen. Sorry, Jon Hamm.\nImages: HBO (4); AMC (2); Netflix","url":"https://www.bustle.com/articles/35814-with-true-detective-in-emmys-best-lead-drama-actor-race-this-category-is-the-toughest-of"}
