{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:45:17","date_modify":"2018-10-30 18:45:17","date_publish":"2014-11-17 14:55:00","description":"With one week to go until the Nov. 24 deadline for a nuclear deal with Iran, there are three possible scenarios: one, a deal that allows Iran to pursue |","filename":"data/vaneerConsumption/WithOneWeektoIranDeadlineAllOutcomesareBad.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Peace/2014/11/17/iran-nuclear-talks-vienna-reutersjpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2014_11_17__1540925117.html","title":"With One Week to Iran Deadline, All Outcomes are Bad","title_page":"With One Week to Iran Deadline, All Outcomes are Bad | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"With one week to go until the Nov. 24 deadline for a nuclear deal with Iran, there are three possible scenarios: one, a deal that allows Iran to pursue nuclear enrichment up to the point of nuclear “breakout,” with sanctions relief and self-congratulations by President Barack Obama; two, no deal at all, as Obama implies that Israel and Congress (not Iran) are to blame; three, yet another extension for talks, as was agreed earlier this year in July.\nAs Michael Ledeen notes at Pajamas Media, there is nothing that Obama would like more than to fly Air Force One to Tehran for an iconic photo-op with the ayatollahs. How Iran’s crushed dissidents would interpret that gesture is unclear. Most would likely see it as a confirmation of what the regime told them in 2009, when it pointed out that the American president was playing golf while their blood ran in the streets of the cities.\nLedeen also points out that George W. Bush administration Secretary of State Condoleeza Rice was only slightly less eager to embrace the regime over a similar deal. The same deceit has worked out for three successive U.S. administrations, so the final outcome is almost immaterial. With a deal, Iran will cheat before the U.S. can think of whether to how to respond. Without a deal, it will just build more centrifuges and wait for the next talks.\nWhat all of this is missing is any sense from the Obama administration that it seeks to weaken the regime. That was the goal of U.S.-Soviet diplomacy, especially under Reagan. The Soviets could obtain things they wanted, like trade and food relief–but only by accepting conditions that eventually led to their internal collapse. In contrast, Obama openly seeks to prop up the regime to achieve “equilibrium” in the Middle East. Buyer, beware.\nSenior Editor-at-Large Joel B. Pollak edits Breitbart California and is the author of the new ebook, Wacko Birds: The Fall (and Rise) of the Tea Party, available for Amazon Kindle.\nFollow Joel on Twitter: @joelpollak","url":"https://www.breitbart.com/national-security/2014/11/17/with-one-week-to-iran-deadline-all-outcomes-are-bad/"}
