{"authors":[],"date_download":"2018-10-30 00:55:32","date_modify":"2018-10-30 00:55:32","date_publish":"2017-01-18 13:53:52","description":null,"filename":"data/vaneerConsumption/WithDeVosHearingSchoolChoiceFinallyTakesCenterStage.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/01/DeVos.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860932.html","title":"With DeVos Hearing, School Choice Finally Takes Center Stage","title_page":"With DeVos Hearing, School Choice Finally Takes Center StageThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The confirmation hearing for President-elect Donald Trump’s pick for U.S. education secretary, Betsy DeVos, has moved school choice to America’s center stage, where it belongs. National School Choice Week, happening during the final week of January, will likely keep the momentum going, as millions of people call for education liberty at events across the country.\nThe message is clear: We need school choice now more than ever.\nIt is school choice that’s at the center of the manufactured DeVos “controversy.” Senate Democrats attacked DeVos at her recent hearings, CNN’s Sara Ganim and Dan Merica report, because she has been “largely a blank slate on college affordability, transgender issues in schools, and for-profit colleges” — issues the government has no business meddling.\nThe biggest black mark CNN is able to bring against DeVos is she has donated money to causes she believes in. “DeVos, who bridges two powerful and wealthy conservative families, has been a prolific Republican donor for decades,” the authors write. “She has given millions to groups that advocate for school privatization and voucher programs, including the American Federation for Children, a group she chaired from 2009 to 2016.”\nBecause she gave “millions to political groups like the Republican National Committee and the Republican National Senatorial Committee and contributed to four senators on the committee overseeing her confirmation,” Democrats are “concerned.” Why weren’t they similarly “concerned” when the Associated Press revealed, “More than half of the people outside the government who met with Hillary Clinton while she was secretary of state gave money — either personally or through companies or groups — to the Clinton Foundation ”?\nIf it’s simply a matter of ethics and a possible conflict of interest, why not replace DeVos with another name from Trump’s list of education secretary candidates? Why not nominate Larry Arnn, president of Hillsdale College, an institution that receives zero federal funding? Surely there can be no controversy there?\nWould liberals be satisfied if an apparently “cleaner” choice was put forward to lead the Department of Education? Of course not. Liberal opposition to conservative principles has never been about making a case for morality through rational dialogue; it’s about one side telling the other their way is superior and must be forced on the rest of us — or else. The opposition to DeVos is an opposition to letting others have a voice, plain and simple.\nIt’s largely the left, after all, who have abandoned classrooms and left schoolchildren with nowhere to go when they don’t get their way in the form of cushy pensions and extravagant benefits packages. It’s liberals who insist education should be controlled at the national level with a one-size-fits-all set of standards and a paralyzing list of regulations. It’s also the left who demands our children attend schools that correspond with their ZIP codes, regardless of the school’s deficiencies or the child’s needs.\nABC News writes, “Trump’s Pick for Education Secretary May Reignite the Education Wars.” Giving people options in the form of school choice can only incite a “war” when there is one side opposed to freedom that uses legislated ideologies to bully those who want something different.\nWe need school choice now more than ever because these bullies, many of them wearing red to protest DeVos’ confirmation, have gained too much power. They and their one-sided agendas have infiltrated our schools and the minds of our young children and show no sign of backing off. In the Chicago area, for instance, students at New Trier High School, a government school, will be subjected to a full day of race-related workshops, seminars, and discussions, where they’ll learn about “white guilt,” “trans-people of color,” and other loaded material. Nonsense like this is taking place in public schools all over America.\nDeVos’ confirmation could be a big step toward diminishing the hold the education establishment has on education policies and on American classrooms. The commitment of the tens of millions of people participating in National School Choice Week because they care about education can make this possible, too.\n“As 2017 promises to bring new growth to educational opportunity around the country, tens of millions of parents, teachers, students, citizens, and community leaders are planning celebrations during National School Choice Week,” Sonoran News reports. “21,392 independently-planned events will take place from January 22–28, including pep rallies, science fairs, school tours, policy forums, and rallies in more than 25 state capitals.”\nThe status quo has failed our children long enough. It’s high time we listened to families and let them decide what education system works best.","url":"https://spectator.org/with-devos-hearing-school-choice-finally-takes-center-stage/"}
