{"authors":["Associated Press"],"date_download":"2018-10-23 04:00:21","date_modify":"2018-10-23 04:00:21","date_publish":"2016-01-11 16:59:26","description":"OMAHA, Nebraska (AP) — Lottery officials say the Powerball jackpot has grown to $1.4 billion, the largest ever in the world, and the drawing is still two day...","filename":"data/vaneerConsumption/WithnoweekendwinnerPowerballjackpotswellsto14B.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:058c41dd0cf244479fae3ed1b7c82348-3WAQP5SaQH704788ebcf7e10b370-21_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394257_With-no-weekend-winner-Powerball-jackpot-swells-1-4B_1540267221.html","title":"With no weekend winner, Powerball jackpot swells to $1.4B","title_page":"With no weekend winner, Powerball jackpot swells to $1.4B | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"With no weekend winner, Powerball jackpot swells to $1.4B\nOMAHA, Nebraska (AP) — Lottery officials say the Powerball jackpot has grown to $1.4 billion, the largest ever in the world, and the drawing is still two days away.\nThe prize could grow even more before Wednesday's drawing if ticket sales remain intense. Officials review the estimate daily.\nThe jackpot is so big that billboards around the country have to advertise the price as $999 million because they're not built to show billions.\nCustomers wait in line at The Last Stop to buy Powerball lottery tickets Sunday, Jan. 10, 2016, in White Hills, Ariz. No ticket matched all six Powerball numbers following the drawing for a record jackpot of nearly $950 million, lottery officials said early Sunday, Jan. 10, boosting the expected payout for the next drawing to a whopping $1.3 billion. (AP Photo/John Locher)\nNo one matched all six Powerball numbers Saturday night.\n\"We've never been at these levels,\" said Texas Lottery executive director Gary Grief, whose state lottery is part of the Multi-State Lottery Association that runs Powerball.\nThe odds to win are one in 292.2 million. Forty-four U.S. states participate.\nThe jackpot has ballooned since its Nov. 4 starting point of $40 million and spurred huge ticket sales.\nBetween Jan. 6 and Saturday's drawings, more than $900 million in Powerball tickets were sold.\n\"It's exponentially greater than any sales that any of the states involved have ever seen,\" Grief said.\nA winner would have the option of being paid through annual payments over 29 years or opting for one smaller cash payment. But 39.6 percent of the lump sum would go to federal income taxes.\n___\nAssociated Press writers Terry Tang in Phoenix and Olga R. Rodriguez in San Francisco contributed to this report.\nSamir Akhter, the owner of Penn Branch Liquor, exchanges money for Powerball tickets, Saturday, Jan. 9, 2016 in Washington. Officials say it's increasingly likely that someone will win the $900 million Powerball jackpot, which grew by $100 million just hours before Saturday night's drawing. (AP Photo/Alex Brandon)\nIn this photo made with a fisheye lens a clerk hands a patron his $10 worth of chances for the upcoming Powerball drawing on Saturday, Jan. 9, 2016, in Cranberry Township, Pa. The Powerball jackpot has reached a record $900 million, with the drawing Saturday night. (AP Photo/Keith Srakocic)\nJulian Perez fills out a Powerball ticket, Saturday, Jan. 9, 2016, in Miami. Officials say it's increasingly likely that someone will win the $900 million Powerball jackpot, which grew by $100 million just hours before Saturday night's drawing. (AP Photo/Lynne Sladky)","url":"https://www.dailymail.co.uk/wires/ap/article-3394257/With-no-weekend-winner-Powerball-jackpot-swells-1-4B.html"}
