{"authors":[],"date_download":"2018-10-30 01:18:13","date_modify":"2018-10-30 01:18:13","date_publish":"2015-09-29 08:00:00","description":null,"filename":"data/vaneerConsumption/WithoutBoehnerExportImportBankIsOver.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2015/09/1024px-Vitoria_-_Graffiti_26_Murals_1127_01.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862293.html","title":"Without Boehner, Export-Import Bank Is Over","title_page":"Without Boehner, Export-Import Bank Is OverThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"As the calendar pages turn from September to October, thoughts shift from summery Independence Day fireworks and Labor Day cookouts to the spooky parade of Halloween trick-or-treaters.\nThis year, coinciding with All Hallows’ Eve, U.S. House of Representatives Speaker John Boehner (R-OH) is retiring, ending a quarter-century career in Congress, which was capped by successfully organizing a historic papal speech to both houses of Congress.\nWith Boehner’s resignation, the Export-Import Bank (Ex-Im) is effectively dead and buried, and lawmakers jockeying to take up his mantle should commit to keeping the zombie crony-capitalist program six feet under.\nBoehner was the only member of House leadership supporting the reauthorization of the Export-Import Bank, a government agency created by President Franklin Delano Roosevelt in 1934 “to remove obstacles to the free flow of interstate and foreign commerce which tend to diminish the amount thereof” and “to reduce and relieve unemployment, to improve standards of labor, and otherwise to rehabilitate industry.”\nEx-Im provided a mechanism for using taxpayer money to guarantee loans to domestic businesses unwilling or unable to obtain loans for exporting goods. Congress rightly opted to allow Ex-Im’s charter to expire at the end of June, which it should have done decades earlier. A bipartisan team of Senate leaders had voted to raise Ex-Im from the dead and reauthorize it as a rider in an unrelated spending bill, but House leaders refused to take up the bill, favoring their own spending bill and leaving Ex-Im to expire on June 30.\nIn April, Boehner warned of dire repercussions if Congress did not reauthorize the Great Depression-era corporate welfare program, telling reporters, “There are thousands of jobs on the line that would disappear pretty quickly if the Ex-Im Bank were to disappear.”\nNearly three months after Ex-Im’s corpse was laid to rest, the spirit of Ex-Im job loss has yet to materialize, like the subject of a failed All Hallows’ Eve séance.\nIn September, General Electric (GE) executives claimed forcing GE to seek private financing of export loans resulted in 400 jobs being outsourced to France, but that isn’t what happened in the real world.\nAs reported by the Washington Examiner, GE had planned to move those jobs, which do not currently exist, to France as early as 2014. GE committed, in writing, to exporting those jobs, as a deal sweetener, swaying French regulators to approve a then-pending purchase of Alstom, a French power generation company.\nSo GE was planning to move U.S. jobs overseas despite receiving a huge amount of Ex-Im encouragement to keep them here. According to research conducted by Mercatus Center Senior Research Fellow Veronique de Rugy, GE was one of Ex-Im’s biggest beneficiaries, receiving a total of $2.6 billion in financial assistance from U.S. taxpayers.\nNot only did Ex-Im fail to prevent GE from moving jobs overseas, the program doesn’t create jobs.\nAccording to a 2011 American Action Fund study of Ex-Im’s economic effects, “For the economy as a whole, export financing merely redistributes jobs across the economy, rather than create more overall jobs.”\nAfter Boehner enters retirement, his replacement should continue to treat taxpayers by resisting the urge to breathe life into Ex-Im’s dusty old bones. Ex-Im is a dead idea, and it should be allowed to rest in peace in the graveyard of failed government interventions.","url":"https://spectator.org/64190_without-boehner-export-import-bank-over/"}
