{"authors":["Associated Press"],"date_download":"2018-10-22 20:37:59","date_modify":"2018-10-22 20:37:59","date_publish":"2016-01-29 02:34:29","description":"SEOUL, South Korea (AP) — Two of the continent's biggest rivals are meeting in the final of the Asian Under-23 Championships on Saturday but Japan and South ...","filename":"data/vaneerConsumption/WithRiospotssecuredJapanSouthKoreaprepareforfinal.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422122_With-Rio-spots-secured-Japan-South-Korea-prepare-final_1540240679.html","title":"With Rio spots secured, Japan-South Korea prepare for final","title_page":"With Rio spots secured, Japan-South Korea prepare for final | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"With Rio spots secured, Japan-South Korea prepare for final\nSEOUL, South Korea (AP) — Two of the continent's biggest rivals are meeting in the final of the Asian Under-23 Championships on Saturday but Japan and South Korea already have what they were seeking from the tournament — places at the 2016 Rio Olympics.\nThe top three in the tournament go to Brazil meaning that when Japan defeated Iraq 2-1 in the first semifinal on Wednesday, Makoto Teguramori's squad earned a sixth appearance on the Olympic stage for their country. South Korea is preparing for an eighth successive Olympic tournament, a record, after defeating host Qatar 3-1.\nReaching Rio is so important for the two powers that each team has released star players to a European club now that qualification is assured. Hwang Hee-chan of Korea and Japan's Takumi Minamino have returned to Austria's Red Bull Salzburg, as agreed before the Under-23 tournament, which is not on FIFA's international match calendar and means clubs are not obliged to release players.\n\"Playing in the Olympics has been my dream since childhood,\" Hwang said before his departure. \"I don't know if I can make the final cut, but I will do the best I can to be selected. I am confident we will win the final (against Japan).\"\nHwang and Minamino will be following closely from a distance, as will millions in their respective countries.\n\"The final has a special significance as Japan are our opponents. We will put in our best efforts to win the championship,\" South Korea captain Yeon Jei-min said. \"We know Japan are very organized. They have some very good players such as Shoya Nakajima, who we have seen score some amazing goals. But we also have a good midfield and we have many players who are capable of scoring goals.\"\nFor South Korea, the Olympics is particularly important with the 2016 team hoping to emulate the exploits of the Taeguk Warriors in London four years ago. Then, guided by 2002 World Cup captain Hong Myung-bo, the Koreans won the bronze-medal match against Japan. As well as the Olympic prize, the medal earned all the players on the roster exemption from their 21 month mandatory military service period.\nThe Japan squad is aiming to put behind it a mixed 2015, when the low point was the senior team's elimination from the Asian Cup at the quarterfinal stage.\n\"We have not succeeded to become an Asian champion,\" coach Teguramori said. \"Also the (senior) team did not become champion in Australia at the Asian Cup so I always talk to the players about becoming an Asian champion.\"\nIt is not just about South Korea and Japan. The winner of the third-place play-off between Qatar and Iraq will also go to Rio.\nFor tournament host Qatar, going to the Olympics is considered vital in terms of the senior team's development as the country prepares to host the 2022 World Cup.\nThe under-23 squad, guided by Spanish coach Felix Sanchez, contains a number of senior internationals such as Abdelkarim Hassan who are expected to form the spine of the host nation's team in 2022. Qatar was perhaps the most impressive performer in this month's tournament before the loss to South Korea, a game that the east Asians won only in the last minutes.","url":"https://www.dailymail.co.uk/wires/ap/article-3422122/With-Rio-spots-secured-Japan-South-Korea-prepare-final.html"}
