{"authors":[],"date_download":"2018-10-22 21:35:02","date_modify":"2018-10-22 21:35:02","date_publish":"2014-05-07 18:16:57","description":"The end of the Dodge Grand Caravan reflects the long, steady decline of the once-popular minivan market.","filename":"data/vaneerConsumption/WithLossofDodgeGrandCaravanMinivanMarketKeepsShrinking.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/426971/dodge-chrysler-minivans-mms_746dc21eddb31bfe23a5fcb3d60d3da0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_autos_loss-dodge-grand-caravan-minivan-market-keeps-shrinking-n99536_1540244102.html","title":"With Loss of Dodge Grand Caravan, Minivan Market Keeps Shrinking","title_page":"With Loss of Dodge Grand Caravan, Minivan Market Keeps Shrinking","title_rss":"NULL","source_domain":"nbcnews.com","text":"Good, new product has traditionally been a way to reinvigorate a weak product segment. But with just a few exceptions, the minivan market hasn’t seen much in recent years. Chrysler’s No. 1 competitor, the Honda Odyssey, added a built-in vacuum cleaner for 2014, but that’s a far cry from such once-revolutionary breakthroughs as sliding doors, foldaway seats and a dozen cup and juice box holders.\nMeanwhile, there are fewer players in the current minivan segment since the mid-1990s, when the segment captured a peak 8.5 percent of the total U.S. automotive market. Chrysler alone has killed off the old Plymouth Voyager and the short-wheelbase Dodge Caravan. Both General Motors and Ford Motor Co. have pulled out of the segment.\nThe only other models now available are the Odyssey, the Toyota Sienna, the Nissan Quest, the Kia Sedona and the Mazda5.\nSend us a photo of your minivan! Upload on our NBC News Business Facebook page or tweet @NBCNewsBusiness #minivan. Tell us what your minivan meant to you, and we'll share your stories and photos in a future post.\nChrysler has been toying with ideas designed to reshape the concept of the minivan for years. It’s a challenge considering the basic functionality demanded by those who love the vehicles forces them to stick with a basic “one-box” design. Chrysler tried to go for a more radical look with the 700C concept of a few years ago, and it remains to be seen if that will influence the styling of the next Town & Country due out in 2016.\nOne thing the maker has confirmed is that the new model will be offered with the minivan segment’s first plug-in hybrid powertrain, which is expected to yield “an estimated 75 mpg,” according to Chrysler brand CEO Al Gardner. And by using the electric motor to drive one axle and the gas engine to power the other, the minivan might offer an unusual all-wheel-drive capability that, analyst Sullivan believes, could further enhance its appeal.\nMeanwhile, with millennials just reaching the age where they’re starting their own families, some analysts believe the 2016 Chrysler Town & Country could come along at precisely the right time for a modest minivan revival.\nThe decision to drop the Dodge version reflects, as much as anything, that brand’s shift to concentrate on its high-performance heritage with models like the Charger and Challenger muscle cars. But in a Q&A session wrapping up Tuesday’s strategy session, FCA CEO Sergio Marchionne cryptically hinted that the Grand Caravan nameplate itself might not go away. That leaves open the possibility that either it could become a second minivan badge for the Chrysler brand or, alternatively, be used for one of the crossover models the Detroit maker is working on as an alternative for folks who want minivan amenities without the segment’s stigma.\nMore from The Detroit Bureau:\n5 Years After Bankruptcy, Chrysler Aiming at Global Growth\nChildren at the Biggest Risk When the Drunk is Their Driver\nMercedes-Benz Launches B-Class Electric, 1st US Battery Car","url":"https://www.nbcnews.com/business/autos/loss-dodge-grand-caravan-minivan-market-keeps-shrinking-n99536"}
