{"authors":["Julie Cart","Dan Morain","Alastair Bland"],"date_download":"2018-10-31 00:04:16","date_modify":"2018-10-31 00:04:16","date_publish":"2016-07-05 08:00:00","description":"The basics of cap and trade What is cap and trade? How do the auctions work? What projects are the auction proceeds paying for? How much has California","filename":"data/vaneerConsumption/Withcapandtradeindoubtkeyquestionsgounanswered.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/kernoilfield-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944256.html","title":"With cap and trade in doubt, key questions go unanswered","title_page":"With cap and trade in doubt, key questions go unanswered | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Assemblyman Brian Jones leaned in to the microphone with a tight smile. It was May, and legislators were debating whether to request an audit of the California Air Resources Board.\nFrustrated that the agency was not more forthcoming about aspects of the cap and trade program it runs, Jones fixed his gaze on the embattled regulator assigned to parry lawmakers’ questions.\n“My experience is: The longer we give CARB to respond, the more unresponsive they become,” said the legislator, a Republican from Santee.\nHis comment touched off a scathing bipartisan scolding over a lack of transparency surrounding cap and trade, the state’s signature climate-change policy, which is intended to help rewind greenhouse gas emissions to 1990 levels within the next four years.\nGetting to 2020, in reverse\nIn Sacramento and elsewhere, fundamental questions about the program’s effectiveness are unanswered, and criticism has been growing over how billions of dollars from auctions of emissions “credits” are doled out. Many of the complaints echo an admonition familiar to schoolchildren: Show your work. Provide the public with a way to track the state’s performance.\nIs cap and trade, which essentially levies fees on major polluters, a success? How do we know? Which companies still exceed their allowed emissions? Which don’t? The air board has consistently said California would reach its emissions targets; how much is cap and trade contributing?\nThese and other issues persist as the program is assailed from legal, political and financial quarters:\nA lawsuit by the California Chamber of Commerce asserts that the price major polluters pay for excessive emissions is an illegal tax. Should the suit prevail, the 2006 law that authorized cap and trade could be voided. New legislation would need approval by two thirds of state lawmakers. That would mean some Republican support — a big ask.\nGov. Jerry Brown’s scooping up of auction proceeds to help fund the state’s controversial high-speed rail project has given cap and trade’s opponents a fulcrum for complaint, and the Legislature has yet to decide whether to extend the law past its 2020 expiration date. That’s not a sure bet.\nThe uncertainty surrounding the future of cap and trade has resounded in the market where emissions credits are bought and sold. Since 2015, each quarterly auction had produced at least $500 million until the one held in May, which yielded only $10 million. A June reserve auction was cancelled after no bidders registered.\nMichael Gibbs, an assistant executive officer at the air board, insisted that cap and trade is working.\n“We can see from the evidence that we are making progress, and moving toward our goals,” Gibbs said in an interview. “We’re getting there.”\nThe agency forecast two years ago that cap and trade would account for about a third of total emissions reductions four years from now. But it’s too soon to say how much improvement so far is attributable to cap and trade.\n“We have a very short data trail on cap and trade at this point, so there is no way to credit specific programs as yet,” agency spokesman Dave Clegern said by email.\nThe program, which began in earnest in 2013 after years of analysis and planning, is only one piece of California’s strategy for fighting climate change. But as the cornerstone of that effort, it is too important to lose, officials say.\nCap and trade, authorized by the landmark legislation signed by then-Gov. Arnold Schwarzenegger, was conceived to motivate firms to reduce their carbon footprints by innovating — upgrading to more energy-efficient equipment and technology.\nThe state sets annual limits, or caps, on the emissions of a wide range of businesses. Those operating above their assigned caps must find ways to function more cleanly or buy allowances from less-polluting businesses that sell credits at auction.\nThe success of the auctions created a deep trough of money — $4 billion so far — that by law must be used to fund projects that lower greenhouse gas emissions or aid disadvantaged communities.\nWhere cap and trade auction proceeds are spent\nThe governor’s rail project has been awarded $850 million from the fund, drawing fire from critics who see only a tenuous connection between the multi-billion-dollar long-term project and overall emissions reduction. And officials have struggled to rationalize other expenditures – forestry and agriculture initiatives and other transportation projects, for example, especially when costs are weighed against the emissions they cut.\nThe non-partisan Legislative Analyst’s Office, which advises lawmakers on financial matters, says that all the projects funded so far will, over their lifetimes, remove a total of about 14 million metric tons of emissions from California’s atmosphere.\nThe state’s annual greenhouse gas emissions in 2014, the latest year for which figures are available, were estimated at 441 million metric tons, continuing a downward trend. If the trend holds, California is likely to meet its goal for 2020: 431 million metric tons. (The U.S. Environmental Protection Agency estimates that an average American home annually releases about 12 metric tons of carbon dioxide – a greenhouse gas.)\nThe analyst’s finding, detailed in a report to the Legislature in April, excluded the high-speed train, which will not be operational for a decade or more. Once it does begin ferrying passengers up and down the state, according to state estimates, it will reduce state carbon emissions by 44 million tons over 50 years – less than 1 million tons a year.\nThe analyst also found that not all projects are cost-efficient. For example, the usual price in the auctions of reducing one metric ton of emissions is $12.73. Although some of the projects funded by auction proceeds are excellent deals, some cost more than 10 times that sum to achieve the same result, according to the report.\nThe cap and trade system was developed with industry at the table.\nCompanies subject to a cap must submit annual pollution reports, and officials say that overall the state’s emissions are declining by about 3 percent a year — a remarkable accomplishment in a growing economy, the air board notes.\nBut there is no mechanism for the public to see whether California companies are reducing their emissions by innovating in the way the law intended or are simply writing checks to continue emitting excess carbon dioxide.\nNor can the public know which companies participate in the auctions, or what the bids are. Those details are kept secret, the regulators say, to prevent illegal price fixing. And officials won’t divulge the location where the online trading is managed.\nSome business interests are at pains to say they support cap and trade, even as they complain about the cost of compliance and object to some planned changes.\nFor example, to ease the transition for companies that must reduce their emissions, the air board grants free allowances, which they may sell at auction, keeping the money. But regulators plan to begin reducing the free credits next year, saying most firms have successfully integrated the cost of compliance into their business plans.\nDorothy Rothrock, President of the California Manufacturers and Technology Assoc., disagreed, saying companies still rely on those subsidies, which help level the playing field.\n“California is making manufacturing inhospitable for any number of reasons,” she said, adding that firms here compete against companies elsewhere that are not subject to the same strict rules.\nBut the helping hand to industry will continue to take a bite out of potential auction proceeds, according to air board projections examined by the state Department of Finance.\nWhich companies receive the free credits, and how many? That’s secret.\n“It’s certainly a challenging time for California climate policy,” said Craig Ebert, president of Climate Action Reserve, a private company that helps businesses with compliance issues. “The tea leaves are murky.”\nIndeed, even the state’s emissions-reduction goals have been called into question. The Legislature’s attorneys concluded that Brown overreached last year when he ordered the air board to ramp them up after 2020.\nBut the governor and the air board are resolute. The agency maintains that it has existing authority to operate the cap and trade system beyond 2020 and is drafting rules for doing so, to be delivered later in the summer.\nGibbs acknowledges that uncertainty “inevitably has some impact” on the cap and trade program, citing the poor showing in the May auction.\n“Understanding what is going to happen post-2020 is fundamental,” Gibbs said. “As those issues get resolved, the uncertainty will be resolved.”\nAdvocates argue that cap and trade is the most effective method of cutting emissions and complements California’s myriad other climate policies.\n“First and foremost, cap and trade is about reducing emissions, capping them, and ensuring that we don’t exceed the amount of emissions we’ve committed to as a state,” said Erica Morehouse, an attorney for the Environmental Defense Fund, a national group.\nCan the state meet its target without cap and trade?\n“It’s still sort of to be determined,” said Ross Brown of the Legislative Analyst’s Office.\n“Even though we are a few years in,” he said, “I don’t know at this point if I could say it’s successful. We aren’t there yet.”","url":"https://calmatters.org/articles/with-cap-and-trade-in-doubt-key-questions-go-unanswered/"}
