{"authors":[],"date_download":"2018-10-23 05:21:53","date_modify":"2018-10-23 05:21:53","date_publish":"2018-07-23 00:00:00","description":"White House stenographers are meant to record every public utterance made by a president, but \"everything changed\" with the Trump administration, says Beck Dorey-Stein.","filename":"data/vaneerConsumption/WithNoOfficialTranscriptTrumpCanMuddleTheTruthNPR.json","image_url":"https://media.npr.org/assets/img/2018/07/20/gettyimages-984682100_wide-a4b99bb086d65c7c5b94d39f53a2b2528e5de58c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=630643035_1540272113.html","title":"With No Official Transcript, Trump Can Muddle The Truth : NPR","title_page":"Ex-White House Stenographer: With No Official Transcript, Trump Can Muddle The Truth : NPR","title_rss":"NULL","source_domain":"npr.org","text":"NOEL KING, HOST:\nAs White House stenographer, it was Beck Dorey-Stein's job to write down every word of every interaction the president had with the press. She did the job for five years starting under President Obama. And then President Trump was elected. Dorey-Stein says she knew, from the day he was inaugurated, things would be different.\nBECK DOREY-STEIN: Trump's inaugural speech had this language that I had never heard before that was so divisive in a way that was terrifying. And so all of my friends actually got to go to the tarmac to say goodbye to President Obama. And I had to stay and type that transcript. And I just remember being like, I'm not going to be able to do this very long. This is so horrifying.\nKING: Beck Dorey-Stein recently wrote about Trump's relationship with stenographers in an op-ed for The New York Times. She told me stenographers used to go everywhere with Obama. But when Trump came into office, everything changed.\nDOREY-STEIN: Even during the transition, there was a lot of chaos. Actually, my boss had to keep going down to the press office and trying to introduce herself. And she couldn't get past, like, this 22-year-old press wrangler who was like, well, I'll have to check back. I'll have to check back. So even for the first interview Trump did as president, there wasn't a stenographer present for that.\nKING: And you were told, at one point, that President Trump does not like being recorded. Is that right?\nDOREY-STEIN: He doesn't like microphones near his face, which makes it very difficult to record him, especially on Air Force One where the plane is loud enough that you really have to have a microphone right up in their face.\nKING: Dorey-Stein wrote in her op-ed that the Trump transition team told one of her colleagues they wouldn't need a stenographer because, a lot of times, there will just be video. But she says it's not enough.\nDOREY-STEIN: So the reason why video is not the same as a stenographer's audio is because, especially if it's media video, they can splice that video. They can change any quote into any quote that they want. And also, I would stay, and I would keep my recorders running just in case a reporter on his way out the door was like, Mr. President, one more thing. We wanted to make sure we had every interaction everywhere that was said. Even if the president didn't answer the question, we made sure to include the question in the transcript just to make sure we had an accurate depiction of what happened.\nKING: Are stenographers allowed to be present during private meetings with the president and other officials? And I'm thinking, of course, of this meeting between President Trump and the Russian president, Vladimir Putin, where one of the big concerns was it was just these two men and their interpreters. No one else was there. As a stenographer, would you have been allowed into that meeting?\nDOREY-STEIN: We're there to protect the president. So if they wanted us, we would have certainly been there. Sometimes though, of course, heads of state are allowed to talk without stenographers present.\nKING: President Trump has a very, very tense relationship with much of the press. He accuses them openly of making things up about him. Do you think he's doing himself a disservice by not using stenographers to basically back him up if he says, you know, CNN is lying? Well, get the stenographer's transcript, and we'll show you. CNN is not telling the truth.\nDOREY-STEIN: He's doing the American people a disservice. It's quite possible President Trump is actually doing it intentionally because if there was a record of what happened, it would be hard for him to muddle the truth as he has been - you know, he's having to walk his words back. And he's able to do that. He has that latitude because he doesn't have a recording. If a stenographer were in the room, all he would have to do is say check the transcript. And it's much easier to muddle the truth when you don't have a transcript.\nKING: Beck Dorey-Stein is a former White House stenographer and author of the new memoir \"From The Corner Of The Oval.\" Beck, thanks for coming on.\nDOREY-STEIN: Thank you for having me.\n(SOUNDBITE OF GOGO PENGUIN'S \"REACTOR\")\nCopyright © 2018 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=630643035"}
