{"authors":[],"date_download":"2018-10-22 22:56:25","date_modify":"2018-10-22 22:56:25","date_publish":"2014-06-11 15:24:33","description":"Conservative Rep. Jeb Hensarling of Texas is being floated as a possible replacement after Cantor's defeat.","filename":"data/vaneerConsumption/WithCantorsOusterRaceforTopHousePostsIsOn.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_39/461316/140522-capitol-building-jms-2049_9d5c9099ee2477b71bd795ac566983de.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_cantors-ouster-race-top-house-posts-n128446_1540248985.html","title":"With Cantor's Ouster, Race for Top House Posts Is On","title_page":"With Cantor's Ouster, Race for Top House Posts Is On ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTop House Republicans are already floating names for the leadership position that House Majority Leader Eric Cantor will leave open when he leaves his post as House Speaker John Boehner’s second-in-command.\nIn an unprecedented surprise defeat, Cantor lost Tuesday night’s Republican primary for his Virginia congressional seat to little-known economics professor David Brat. The shakeup is sure to have dramatic repercussions for the leadership of the party in the House, where Cantor had previously been rumored to be gunning for Boehner’s job if he stepped down.\nRep. Pete Sessions, R-Texas, is actively talking about his interest in the majority leader position, a GOP aide confirmed to NBC News.\nSources close to Deputy Whip Peter Roskam, R-Ill., say he is also running for the third-in-line position of Majority Whip, under the assumption that the current Whip, Rep. Kevin McCarthy of California, will run for Majority Leader.\nAnother name being floated for Majority Leader by is conservative Rep. Jeb Hensarling of Texas, former GOP Conference Chairman and current Chairman of the House Financial Services Committee.\nIn a statement, Hensarling praised Cantor as a “friend and ally on many fronts” and acknowledged that he’s been approached about taking over his post.\n\"I am humbled by the many people who have approached me about serving our Republican Conference in a different capacity in the future. There are many ways to advance the causes of freedom and free enterprise, and I am prayerfully considering the best way I can serve in those efforts,” he said.\nRep. Matt Salmon, an Arizona conservative known to be openly critical of House leadership, mentioned Hensarling and Rep. Jim Jordan of Ohio as possible replacements for Cantor and said that the majority leader's ouster should send a message to Boehner as well.\n\"I think it makes it a lot harder for him to run for Speaker,\" he said of Boehner. \" I think it was a broader message that Republicans better start acting like Republicans and delivering for the base or their going to make us pay for it.\"","url":"https://www.nbcnews.com/politics/congress/cantors-ouster-race-top-house-posts-n128446"}
