{"authors":["Associated Press"],"date_download":"2018-10-23 03:27:57","date_modify":"2018-10-23 03:27:57","date_publish":"2017-04-26 14:50:50","description":"LOS ANGELES (AP) - Ridley Scott insists he is not a nostalgic person, but you wouldn't know that looking at the 2017 movie calendar. Not only are audiences...","filename":"data/vaneerConsumption/WithAlienBladeRunnersequelsScottlooksforward.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/14/wire-465547-1493214655-448_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447922_With-Alien-Blade-Runner-sequels-Scott-looks-forward_1540265277.html","title":"With 'Alien,' 'Blade Runner' sequels, Scott looks forward","title_page":"With 'Alien,' 'Blade Runner' sequels, Scott looks forward | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LOS ANGELES (AP) - Ridley Scott insists he is not a nostalgic person, but you wouldn't know that looking at the 2017 movie calendar. Not only are audiences getting another \"Alien\" movie, \"Alien: Covenant,\" on May 19, but also a long-time-coming \"Blade Runner\" sequel in October.\nScott made his name in Hollywood with \"Alien\" in 1979. It was the kind of genre-busting horror that continues to inspire pale imitations to this day. (Including one this year's Jake Gyllenhaal and Ryan Reynolds space pic \"Life.\") And then, in 1982, his futuristic neo-noir \"Blade Runner\" gave a new aesthetic to our dystopian future. It may have confounded most upon its release, but the sublime mind-bender has gained a cult and eventually popular following over the years.\nWhile the titles might suggest otherwise, Scott says he's more interested in \"what's next.\"\nFILE - In this Feb. 4, 2017 file photo, Ridley Scott, recipient of the Lifetime Achievement in Feature Film Direction Award, poses at the 69th Annual Directors Guild of America Awards in Beverly Hills, Calif. Almost 40 years after \"Alien\" shocked audiences, Ridley Scott is returning to the well that made him a star director with a new terrifying installment, \"Alien: Covenant.\" (Photo by Chris Pizzello/Invision/AP, File)\n\"I never look back,\" Scott said recently by phone. \"I only look forward and think I'm very lucky to be able to do that.\"\nIn fact, he's so focused on what's next that even while talking big ideas about creation and \"Alien: Covenant,\" Scott was doodling an image for scene 103 of his upcoming John Paul Getty kidnapping film, \"All the Money in the World.\"\n\"I can do very good telephone doodles and they actually turn out as storyboards,\" Scott said matter-of-factly. \"I'm storyboarding as we speak. I'm able to do that. It's all in my mind. I think I've got a kind of photographic memory. I was born with it. You either have it or you don't. So that's been quite useful.\"\n\"Alien: Covenant\" is intended to be a sort of bridge between Scott's original \"Alien\" and the 2012 prequel \"Prometheus.\" Scott has wanted to explore the origins of how that creature breathing down Ripley's neck came to be and ask the question that \"Alien\" didn't: Why would anyone make such a monster?\nThe question is brought up in \"Prometheus,\" technically the fifth film in the \"Alien\" universe, but most people who saw the 2012 prequel left feeling deeply confused. Scott is well-aware of this and promises there will be some clarity in \"Covenant.\"\n\"'Prometheus' leaves us with a lot of questions and 'Covenant' answers a lot of those questions,\" he said.\n\"Alien: Covenant\" brings in a new team, the crew of a colony ship, including Katherine Waterston, Billy Crudup and Danny McBride, who believe they've found a paradise. Of course that turns out not to be the case.\nMichael Fassbender's \"Lawrence of Arabia\"-loving android David is back too, as is a new android, Walter, also played by Fassbender, and the monster itself.\n\"We found out that the good old beast was still very popular with the audience, so I decided to reinject some of his presence back into it,\" Scott said. \"It gets pretty gnarly. I'm very pleased with it actually.\"\nScott says audiences can expect some philosophizing and spectacular visuals, including an idea he came up with to solve the problem of how the ship would continue getting and storing power in deep space: Massive sails, about the size of six football fields that can soak up the radiance in space and store it as power.\n\"I discovered recently that's exactly what NASA are doing,\" Scott said. \"You can make a fabric that is stronger than metal and you can fold it up into a massive box and it will fold away like a good sail on a sailing ship so I apply that kind of thinking and there we have it. It works. And then you get it in the hands of the visual effects people and it all looks pretty good. So we're going to send it to NASA to see if I can speed up the process for them.\"\nThat the film is being promoted as an \"Alien\" film rather than a \"Prometheus\" sequel is confounding to some, including Forbes' box office writer Scott Mendelson, who points out that \"Prometheus\" was rather successful. It made over $400 million worldwide against a $130 million budget.\n\"They're selling its relationship to a franchise that is well-known but isn't insanely beloved. It's a geek franchise,\" Mendelson said.\nMendelson added that while nostalgia might sell for some, it's not going to bring in a younger audience with its hard R rating.\nStill, Scott has ideas for at least a few more \"Alien\" installments.\n\"In answering the question 'who, why and when was this thing made and for what reason,' it presents a whole different universe, so the universe starts expanding, which I think is healthy. Why switch it off?\" Scott said. \"What it's leading to is the question of creation. And creation, I don't care who you are, is on everyone's mind.\"\nWhether or not audiences will see that expanded universe will depend on how well \"Covenant\" does. Closer on the horizon is \"Blade Runner 2049,\" which is set 30 years after the original. Scott helped the screenplay and produce, but ceded directing responsibilities over to \"Arrival\" helmer Denis Villeneuve.\nAnd while Scott might not consider himself nostalgic, he is at least a little excited about one crossover moment: The second \"Blade Runner 2049\" trailer is supposed to play in front of \"Alien: Covenant\" showings, which, Scott says drolly, \"will be cool.\"\n___\nFollow AP Film Writer Lindsey Bahr on Twitter: www.twitter.com/ldbahr","url":"https://www.dailymail.co.uk/wires/ap/article-4447922/With-Alien-Blade-Runner-sequels-Scott-looks-forward.html"}
