{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 18:39:10","date_modify":"2018-10-30 18:39:10","date_publish":"2015-04-19 16:18:41","description":"Europol, the EU police agency, has launched a taskforce dedicated to rooting out the people traffickers who last year sent 170,000 illegal migrants in a |","filename":"data/vaneerConsumption/WithNumbersSettoRiseEuropeHuntsfortheGangsthatTrafficked170000PeopleintoEuropeLastYear.json","image_url":"https://media.breitbart.com/media/2015/02/Migrants-Italy-Boat-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_04_19__1540924750.html","title":"With Numbers Set to Rise, Europe Hunts for the Gangs that Trafficked 170,000 People into Europe Last Year","title_page":"With Numbers Set to Rise, Europe Hunts for the Gangs that Trafficked 170,000 People into Europe Last Year | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Europol, the EU police agency, has launched a taskforce dedicated to rooting out the people traffickers who last year sent 170,000 illegal migrants in a perilous journey across the Mediterranean. 3,000 of those shipped across died as overloaded boats sank beneath the waves.\nApproximately 400 migrants, including young children, are thought to have been killed last Sunday when the boat they were on capsized en-route to Italy. It is thought that the boat was made unsteady when the passengers spotted an Italian rescue team approaching and moved about the boat.\nItalian authorities said around 8,500 migrants had been rescued at sea between Friday and Monday last week alone.\nA further 700 are believed to have drowned in the early hours of this morning about 60 miles north of Libya and 120 miles south of the Italian island of Lampedusa, Europe’s closest point to northern Africa.\nBut with the gangs charging migrants as much as £1,800 each to make the crossing, often forcing them to work as slaves in advance to pay for the crossing, the problem is unlikely to go away any time soon.\nThe border between north Africa and southern Europe is currently effectively unpoliced. No EU country has an embassy in Libya, while a £30 million EU border guard training mission has ended in failure.\nRobert Pelton Young, a security adviser with the Migrant Offshore Aid Station, a Malta-based search-and-rescue mission told the Telegraph that the only thing the gangs have to worry about is competition from each other. Competition is so rife that they bid for fares “like budget airlines,” he said.\nPrices vary according to the seaworthiness of the boats. But according to intelligence gained through Italian wiretaps, they also halved during the running of the Italian search and rescue operation Mare Nostrum, which was stopped by the EU last year thanks to fears that it was encouraging trafficking.\nMilitant groups such as ISIS see people trafficking as a rich source of income, and it allows them to smuggle the fighters they need in and out of Europe. Alvaro Rodriguez, a Spanish police inspector with the new Europol unit, told the Telegraph: “Libya has become the priority, but right now it is impossible to coordinate with the different militias and authorities within the Libyan state. Our intelligence overview shows extensive cooperation between militias and smugglers from other nationalities, and there is also a threat from the Islamic State trying to take control.”\nBut gaining intelligence on the gang leaders is difficult with limited access to Libya and northern Africa. The boats captains are merely paid foot-soldiers; one boat carrying 200 passengers which was recently intercepted off the Italian cost was being piloted by a 15 year old boy.\n“Most of the border patrol agencies of southern Europe would like to have smugglers’ names right now, but very few actually do,” says Mark Micallef, of the Times of Malta, which keeps a close eye on the situation. “But we do know that the gangs usually control the territories that they work in, and often have astounding arrays of weaponry. In Libya now, there are even drug groups that have heavy artillery.”\nMr Micallef explained that there were two main trafficking networks currently in play; a smaller one which operates from Tajoura, east of Tripoli, and a larger operating out of Zuwara, close to the Tunisian border. The latter was in operation under Colonel Gaddafi. However, the fall of the dictator created chaos, allowing the trafficking trade to boom. He added that, at the moment, ISIS is not a key player in the region.\nEven if the new taskforce does manage to identify the key players, it is faced with a further problem: “How to arrest people in Libya right now?” askes Inspector Rodriguez. “That is a very good question.”","url":"https://www.breitbart.com/europe/2015/04/19/with-numbers-set-to-rise-europe-hunts-for-the-gangs-that-trafficked-170000-people-into-europe-last-year/"}
