{"authors":["Michelle Moons"],"date_download":"2018-10-30 20:30:48","date_modify":"2018-10-30 20:30:48","date_publish":"2015-11-27 21:03:36","description":"The 20th Annual Blessing of the Fleet was held in Trinidad, California early Thanksgiving morning at the usual start of the crab season.","filename":"data/vaneerConsumption/WithCrabsBannedFishermenJoininBlessingoftheFleet.json","image_url":"https://media.breitbart.com/media/2015/11/Fishing-vessel-San-Francisco-Justin-Sullivan-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_11_27__1540931448.html","title":"With Crabs Banned, Fishermen Join in ‘Blessing of the Fleet'","title_page":"With Crabs Banned, Fishermen Join in ‘Blessing of the Fleet'","title_rss":"NULL","source_domain":"breitbart.com","text":"The 20th Annual Blessing of the Fleet was held in Trinidad, California early Thanksgiving morning at the usual start of the busy season for crab fishing.\nCaptain Art Snyder, Humboldt Bay Sector Commander for the Coast Guard, delivered two low rescue chopper flyovers for the crowd gathered. The Eureka Times-Standard detailed the annual event, held at the Memorial Lighthouse, which stands over what the Standard describes as an ancestral Tsurai village.\nFishing boat owners look forward to the traditional event, according to News Channel 3. The report stated that sixth generation Tsuri Axel Lindgren III gave a customary native blessing–the sixteenth time he has done so.\nA “non-denominational blessing” followed from Alison Berry, Pastor of the United Methodist Church of the Joyful Healer.\nThey may need a miracle: the commercial Dungeness crab season is “closed indefinitely,” according to the report, due to natural toxins that have been detected in the crabs this year.\nThe local Blessing of the Fleet committee made and gifted stripper tools to the captains gathered for the ceremony. “Strippers” are tools crab fishermen use to clean algae and seaweed from crab pot lines, according to the Standard. Captains and crews from 13 vessels took part in the event.\nFourth graders from the Trinidad school draw pictures for the event each year, according to Channel 3. Craig Goucher, owner and captain of a fishing boat, said: “Those are really special to us.”\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/11/27/blessing-of-the-fleet-2015/"}
