{"authors":["David Gorn","Dan Morain","Amita Sharma"],"date_download":"2018-10-30 23:10:28","date_modify":"2018-10-30 23:10:28","date_publish":"2018-09-03 17:22:46","description":"A half-million vehicles a year in California are impounded and sold, many belonging to poor people living in them. A new suit aims to stop cities from towing cars with several overdue parking tickets—saying that puts people on the streets.","filename":"data/vaneerConsumption/WiththousandsofCalifornianslivinginvehicleslawsuitaimstostopcitiesfromtowingtheirhomes.json","image_url":"https://calmatters.org/wp-content/uploads/IMG_E1045-600x450.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540941028.html","title":"With thousands of Californians living in vehicles, lawsuit aims to stop cities from towing their homes","title_page":"With thousands of Californians living in vehicles, lawsuit aims to stop cities from towing their homes | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Sean Kayode says he watched his whole world roll away from him at 3 in the morning.\nKayode had been living in his car in San Francisco about two years. During the early morning March 5, traffic police towed and impounded his black 2005 Mercedes Benz — for having too many overdue parking tickets.\n“I wake up at 3 o’clock in the morning and there was a guy behind me. And I’m like, ‘What are you doing behind my car?’ ” Kayode said, now standing in the lobby of the Next Door homeless shelter in downtown San Francisco. “He says, ‘I’m just waiting for the tow truck to come get you.’ ”\nFor Kayode, who now lives at Next Door, his car wasn’t just a place to sleep, it was how he earned a living, he said, delivering food through Uber Eats. He shakes his head in disbelief at where he was, and where he is now.\n“I am a homeless guy that worked my way out of homelessness,” Kayode said. “Bought my own car. Now you’ve taken my car, taken my job and now giving me food stamps. It doesn’t make sense.”\nAn estimated half million cars a year in California are impounded, unclaimed and sold, according to Jude Pond of the Lawyers’ Committee for Civil Rights in San Francisco. He said many of those cars belonged to poor people living in them.\nPond helped file a lawsuit on Kayode’s behalf to challenge the California law that allows cities to tow a car away if that car has five or more overdue parking tickets. Many cities follow that policy, and Pond said it’s unconstitutional in several ways.\nThe government should not be allowed to take someone’s property without any notice and without a warrant, he said. That’s doubly true because these vehicles weren’t used in a crime, but were towed simply for financial reasons—just to collect fines.\nCities do not issue warnings, outside of the fine print on a parking ticket, that they’re coming to impound a vehicle. Parking officers just show up and take it away. And in the case of the homeless who live in their cars, city officials are taking their temporary home from them, which raises the stakes above the taking of a vehicle, Pond said.\n“We’re hoping that this case sets the precedent that the city should not take people’s only asset, in this case their car, for the purpose of satisfying a debt, based on just outstanding parking tickets,” Pond said.\nIn San Francisco, officers towing a car with a homeless occupant will contact the police department and social services to help that person get services, according to Paul Rose, spokesman for the San Francisco Municipal Transportation Agency, who responded by email.\n“There will be times when the (Homeless Outreach Team) will not be available to respond. If there is no urgency regarding the towing of the vehicle we will make an effort to delay the tow to allow services to respond,” Rose said. “We cannot completely avoid the removal of the vehicle as this would create an unintended exemption for vehicles that are in violation of city or state law.”\nTens of thousands of Californians are living in their cars. Because losing those cars to impoundment can mean the loss of work and home, it can be a tipping point into a life on the streets.\nFor many people, having their car towed for overdue parking tickets is a major annoyance and life disruption. But for homeless people, it’s a permanent loss, because most of them can’t afford to recover their cars.\nThe costs escalate quickly. Offenders must reimburse the tow charge, roughly $500. They also need to pay off their original tickets and the accrued fines on those tickets, which can be $1,000 or more. On top of all of that, it usually costs $71 for every day the car is stored at the tow yard.\nIn Kayode’s case, more than five months after his car was impounded, it would cost him more than $21,000 to get his car back.\nThat’s about $20,000 more than he paid for it.\nOstensibly, the city is towing the car to collect a debt, but in many cases where cars are unclaimed and eventually sold, the city doesn’t make much money on the sale, if anything. That’s because the tow yard has first dibs on any cash collected.\nFor the cities, though, it’s not about the money, according to UCLA political expert Zev Yaroslavsky.\n“It’s the credibility of the restrictions,” Yaroslavsky said. “If the restrictions were not enforced, then no one would comply with them. The reason you and I rush out to the parking meter when it’s about to expire, to put another quarter in there, is because we don’t want to pay $80 for the privilege of having overstayed our welcome by a minute.”\nYaroslavsky spent four decades in local government in Los Angeles, most of it on the county Board of Supervisors. He said he understands why cities hold onto their impound power with both hands.\n“As a local elected official I was never concerned about the revenue stream we were getting out of the parking,” Yaroslavsky said. “It was motivated by getting turnover in the limited parking spaces we had available at curbside.”\nAt the same time, he said, there has to be a middle ground when towing cars from the homeless.\n“It makes absolutely no sense to take a homeless person’s car, confiscating it, impounding it. If you take away their car, they’re going to be on the street. That’s not a benefit to society. Common sense has to be in play.”\nAt the moment, though, the middle ground is hard to find.\nHomeless advocates say cities could make exceptions for extremely low-income citizens–maybe let them hold onto the car, but pay off the tickets in installments.\nSome cities, including San Francisco, have a payment-plan program—but nothing in place to return cars to the homeless or restrict impoundment of those cars in the first place.\nA federal district court judge in San Francisco is expected to hear Kayode’s motion in September for a preliminary injunction to get his car back. A hearing on his lawsuit would be scheduled after a ruling on the injunction.\nOf course, if the preliminary injunction is granted and San Francisco has to return Kayode’s car, he will still technically owe that $21,000 in parking, towing and storage fees until the case is decided.\nKayode, who has been homeless the past six years, looks back on the incident and its aftermath with a mixture of anger and despair.\n“If I have my car, I have my phone. That’s all I need. I can earn money,” Kayode said. “But right now, they are holding my car hostage. What I want to know is, does taking my car from me help the city budget in one way or another? Is my car going to make them or break them?”\nHe stops a moment, looks around the crowded and chaotic lobby of the homeless shelter he now calls home.\n“I am back in the same hole,” Kayode said. “And I don’t have any way to get out.”\nJoin the conversation on our California Dream Facebook group.","url":"https://calmatters.org/articles/lawsuit-homeless-vehicle-tow-california-impound/"}
