{"authors":[],"date_download":"2018-10-22 23:23:51","date_modify":"2018-10-22 23:23:51","date_publish":"2014-11-02 00:00:00","description":"The 18th century Catalan tradition of castelling, the building of human towers, or castles, is undergoing a renaissance today. This has accompanied a rise in Catalan nationalism.","filename":"data/vaneerConsumption/WithHumanPyramidsCatalansReachForIndependence.json","image_url":"https://media.npr.org/assets/img/2014/10/30/human-towers-spain1_wide-69d9c59fa249d8404e0115f9dc6bbca12db283ba.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=357822006_1540250631.html","title":"With Human Pyramids, Catalans Reach For Independence","title_page":"With Human Pyramids, Catalans Reach For Independence : Parallels : NPR","title_rss":"NULL","source_domain":"npr.org","text":"RACHEL MARTIN, HOST:\nThis is WEEKEND EDITION from NPR News. I'm Rachel Martin.\nHow do you build a country from scratch? Well, apparently some Catalonian's in Spain think one way to start is by building human pyramids. Catalonia will hold a symbolic vote on independence next week. And in order to draw attention to the referendum, supporters are literally climbing on top of one another. Human towers for democracy, they call them. Lauren Frayer explains.\nLAUREN FRAYER, BYLINE: Turn a corner in Barcelona this fall and you might find this...\n(SOUNDBITE OF MUSIC)\nFRAYER: A flute band strikes up a traditional Catalan folk song. People fall into formation. And then they start climbing onto each other shoulders.\nANNA ESCOLA: Our goal is to do the human tower. The human tower called castell. It means castle.\nFRAYER: Anna Escola is one of 250 members of her neighborhood Castellers Club. Castell means castle in the Catalan language. They get together every Friday night to build human towers. It's an 18th-century UN-recognized tradition specific to Catalonia. The strongest men and women form a circle, then Anna and her friend Marta Alvarez climb and stand on their shoulders.\nMARTA ALVAREZ: You have to just touch everyone's bodies. You have to have strength but then you have to have equilibrium, as well, and balance. And then when you go back to the floor, I don't know, it's just amazing. It's just amazing.\nUNIDENTIFIED GIRL #1: Yo siete.\nUNIDENTIFIED GIRL #2: Yo ocho.\nFRAYER: It's usually a young girl called an enxaneta who goes all the way to the top, clamoring up eight, nine, even 10 tiers of people.\nUNIDENTIFIED GIRL #1: (Spanish spoken).\nUNIDENTIFIED GIRL #2: (Spanish spoken).\nFRAYER: It's fun. It's cool. You're up there on top of everyone, say some of the girls. They climb in bare feet but wear safety helmets. Once on top, the enxanetas waves to the crowd.\nENRIC UCELAY: They do it just to say, I'm here. If you do with the four fingers, then that's the nationalist sign corresponding to the four stripes or bars of the Catalan flag.\nFRAYER: Local historian Enric Ucelay says human tower building has exploded in popularity with Catalonia's push for independence. It's good practice for building a state, says participant Aureli Bisbe.\nAURELI BISBE: For me, it's like an icon of our culture. It shows that we are capable of working together. That's not an easy thing. I like that our culture is able to do that.\nFRAYER: Catalonia's human towers are popping up at pro-independence rallies across the region as Catalans prepare for the political struggle ahead. For NPR News, I'm Lauren Frayer in Barcelona.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=357822006"}
 Venice, or the Roman era. Catalonia's neighbor, the Valencia region, has a similar tradition.\n\"Before the Romans ever came to the Iberian peninsula, there they were climbing on top of each other,\" says Ucelay. \"Some people claim 1,000-year origins to this tradition, but the evidence is difficult to prove.\"\nCastells are an icon of Catalan culture — a symbol of what citizens can achieve when they work together, says participant Aureli Bisbe.\n\"It shows we are capable of working together to build interesting structures and stuff. That's not an easy thing,\" Bisbe says. \"I like that our culture is able to do that.\"","url":"https://www.npr.org/sections/parallels/2014/10/21/357822006/with-human-pyramids-catalans-reach-for-independence"}
