{"authors":[],"date_download":"2018-10-30 18:32:33","date_modify":"2018-10-30 18:32:33","date_publish":"2017-02-10 22:48:00","description":"When police arrived, Daryl Phillips, 21, was in a car, lay dying in the lap of Chalante Thomas.","filename":"data/vaneerConsumption/WitnesseschargedwithmurderinshootingoutsideDeKalbKroger.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/11/Images/Thomas,%20Chalante_461x289.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_witnesses-charge_7e464eda356bc18edbc8a490fc096e2b__1540924353.html","title":"'Witnesses' charged with murder in shooting outside DeKalb Kroger","title_page":"'Witnesses' charged with murder in shooting outside DeKalb Kroger","title_rss":"NULL","source_domain":"ajc.com","text":"When police arrived, Daryl Phillips, 21, lay dying in a car, his head rested on the lap of Chalante Thomas.\nThomas, also 21, and Demario Cotton, 28, presented themselves to officers as witnesses to only the aftermath of the shooting, according to a newly-released police report. The crime happened in the area of Kroger on Wesley Chapel Road.\nNow, Thomas and Cotton are charged with murder in the Jan. 13 death.\nAsked why, DeKalb police didn’t provide information on the reason for the charges.\nWarrants obtained by The Atlanta Journal-Constitution say the incident was caught on video. The documents also say Phillips was shot several times in the back.\nThomas and Cotton are also charged with armed robbery for allegedly stealing more than an ounce of marijuana with a handgun.\nIn the police report, Thomas and Cotton, referred to repeatedly in the document as “the witnesses,” said they’d planned to meet the victim that night.\nThey said they pulled up to the Kroger around 9 p.m. and heard gunshots while waiting for Phillips, who soon came running, screaming that he’d been shot.\nPhillips got in the car, according to the suspects’ account, and Thomas drove to the parking lot of the Dunkin Donuts nearby.\nThere they called 911.\nPolice separated Thomas from Cotton and spoke with both.\nIn the parking lot near Kroger, an officer found a small amount of marijuana and a red bandanna, the report said.\nThe police quickly heard that the McDonald’s across the lot had security cameras.\nThomas has been in the county jail since last Friday, without bond. Cotton, a Decatur resident, isn’t in the DeKalb jail, but it wasn’t immediately clear Friday if he had been arrested elsewhere.\nNOTE: Due to an apparent error in a law enforcement database, a previous version of this article included a photo incorrectly identified as Cotton.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/witnesses-charged-with-murder-shooting-outside-dekalb-kroger/YaRhnwaftej61otMPkh62K/"}
