{"authors":[],"date_download":"2018-10-22 20:40:10","date_modify":"2018-10-22 20:40:10","date_publish":"2014-05-02 22:26:37","description":"The 21-year-old woman called the police on a teen who planned to bomb his school and kill his family.","filename":"data/vaneerConsumption/WitnessWhoFoiledWasecaBombPlotDoesntThinkShesaHero.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/417626/140502-minn-woman-caller-1918_786c2491ee863c7bb8f85487a3ed1688.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_witness-who-foiled-waseca-bomb-plot-doesnt-think-shes-hero-n96076_1540240810.html","title":"Witness Who Foiled Waseca Bomb Plot Doesn't Think She's a Hero","title_page":"Witness Who Foiled Waseca Bomb Plot Doesn't Think She's a Hero","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe woman credited with foiling a Columbine-style attack at a Minnesota school nearly approached the suspicious teen she saw trudging across her backyard — but she said Friday she's relieved her cousin urged her to call the police instead.\nChelsie Schellhas, 21, was washing dishes when she spotted John David LaDue, 17, cutting through her muddy backyard to get to a nearby storage facility.\n\"This person is either breaking in or he is staying the night there,\" Schellhas said she thought after watching LaDue fiddle with the storage unit lock for 10 minutes. \"Turns out he was making bombs instead,\" she said.\nLaDue was charged Thursday with 10 attempted murder and explosives counts after police determined he was two weeks away from carrying out a plot to kill his family and then bomb Waseca Junior/Senior High School in an effort to murder \"as many students as he could.\"\nSchellhas' first instinct was to question the trespasser, but her cousin encouraged her to call the police, who found three fully functional bombs, bomb-making materials, gunpowder, numerous firearms and hundreds of rounds of ammunition in LaDue's home and the storage locker.\nThe police \"told us it is a good thing we called, and we saved a bunch of people's lives,\" said Schellhas' cousin, Katie Harty.\nBut Schellhas added, \"It is hard for me to believe I am a hero. I didn't take the bomb out of his hands, I just witnessed it,\" she said.\nSchellhas does realize that if police hadn't discovered LaDue's plan, the outcome could have been \"horrible.\"\nShe said that in her small town, everyone has a connection to the school, and such a tragedy would have left the community devastated. \"My cousin would've been dead, my boyfriend's sister, teachers that I have known.\"\nInstead, Waseca residents are heaping messages of thanks on the young woman. \"The flowers I received today — they say 'thank you, from a grateful parent,'\" Schellhas said.\n— Elisha Fieldstadt","url":"https://www.nbcnews.com/news/us-news/witness-who-foiled-waseca-bomb-plot-doesnt-think-shes-hero-n96076"}
