{"authors":[],"date_download":"2018-10-30 18:32:43","date_modify":"2018-10-30 18:32:43","date_publish":"2017-03-06 20:47:00","description":"A suspect accused in the death of a 21-year-old man shot outside a DeKalb County Kroger has been arrested.","filename":"data/vaneerConsumption/WitnessarrestedonmurderchargeinshootingoutsideaKroger.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgSharedContent/2017/03/04/Images/photos.medleyphoto.13412977.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_witness-arrested_3c685b90ef6d5fd08bd969cebbf2d7f5__1540924363.html","title":"'Witness' arrested on murder charge in shooting outside a Kroger","title_page":"'Witness' arrested on murder charge in shooting outside a Kroger","title_rss":"NULL","source_domain":"ajc.com","text":"A suspect accused in the death of a 21-year-old man shot outside a DeKalb County Kroger has been arrested, jail records show.\nDemario Cotton, 28, of Decatur remained held without bond Monday after his Friday arrest. Cotton had been wanted on charges including murder in the Jan. 13 death of Daryl Phillips, who was shot near the grocery store on Wesley Chapel Road.\nFellow suspect Chalante Thomas, 21, was arrested last month.\nThomas and Cotton presented themselves to officers as witnesses to only the aftermath of the shooting, according to a police report. When police arrived, Phillips lay with his head on Thomas’ lap.\nThomas and Cotton said they heard gunshots while waiting for Phillips, and then he came running saying he’d been shot, the report said.\nDeKalb police haven’t said exactly why, but Thomas and Cotton were later identified as suspects.\nWarrants obtained by The Atlanta Journal-Constitution say the shooting was caught on video. The documents also say Phillips was shot several times in the back.\nThomas and Cotton are also charged with armed robbery for allegedly stealing more than an ounce of marijuana with a handgun at the time of the shooting.","url":"https://www.ajc.com/news/local/witness-arrested-murder-charge-shooting-near-dekalb-kroger/7f64kSn5QZ51d53BfVNXEK/"}
