{"authors":[],"date_download":"2018-10-30 18:31:57","date_modify":"2018-10-30 18:31:57","date_publish":"2017-02-20 20:45:00","description":"Three people died and another has life-threatening injuries after a weekend crash between two Camaros on I-285 in DeKalb County.","filename":"data/vaneerConsumption/WitnessrecallsI285wreckthatkilled3.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/10/Images/POLICE%20LIGHTS.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_surrounded-death_df3a281210e325ca21e2ef2f94c8b724__1540924317.html","title":"Witness recalls I-285 wreck that killed 3","title_page":"'Surrounded by death': Witness recalls I-285 wreck that killed 3","title_rss":"NULL","source_domain":"ajc.com","text":"In Ahmad Baldwin’s mind, it plays over from start to finish: Two speeding Chevrolet Camaros. A collision. Screeching metal and smoke covering I-285 in the night as two bodies lay on the road, another in a car.\nBaldwin, a 24-year-old bottling plant worker, was coming home from a shift after midnight Saturday when he saw the wreck. He stayed on the scene near Moreland Avenue while authorities came to find the victims. Three would be pronounced dead, another rushed to the hospital in grave condition.\nBaldwin struggled to comprehend.\n“I was literally surrounded by death and I was the only one who was OK,” he told The Atlanta Journal-Constitution on Monday.\nIt was clear and dry around 12:15 a.m. as Baldwin checked his rearview mirror. He was about to take Exit 51 to go home, but he saw a blue 2015 Chevrolet Camaro 2SS convertible approaching from behind.\nThe car passed Baldwin.\nA silver 2014 Camaro LT coupe followed suit.\nIt looked like they might’ve been racing, Baldwin said, but he couldn’t be sure and wants DeKalb County police to make that call.\nHe just knew they were going fast as the second car changed lanes and the sports cars collided.\nBoth hit the guardrail.\nMarshall Hill, 31, of Decatur, and his passenger in convertible, Phillip Smith, 32, of Lithonia, were ejected. Baldwin said one landed in the road in front of his car, the other behind.\nBaldwin stopped and dialed 911.\nHe got out and saw one man appeared to have died on impact. Blood poured from the face of the other man, whose breathing was labored, whose body seemed to shake slightly.\nBaldwin wished he knew what to do and hoped for the man to make it.\nHe didn’t.\nA woman from the other Camaro, Mariah Page, 22, of Decatur, was trapped inside and pronounced dead at the scene, a police report said.\nBaldwin went home. He didn’t know what to do with himself.\nHe wanted to take a shower, but it didn’t feel right somehow.\n“It was hard to touch my body,” he said, “after seeing all that blood.”\nOver the weekend, he struggled with the repeating images in his mind. The men on the pavement. One of them gone. One of them leaving too fast.\nWho were they?\nBaldwin’s girlfriend searched around on Facebook and found posts about Hill. She found out he was a father and that a GoFundMe page was created to help with the funeral expenses.\nBaldwin saw pictures of the stranger’s life, far removed from the smoke-shrouded highway.\nHe said he’ll be contributing to the funeral.\n“I just feel like, anything I can do to help,” he said. “I literally watched him struggle for his life.”\nHe’s wondered about the last victim, the other driver. The man was Kane Danger, a Decatur resident.\n“I don’t know if he made it,” Baldwin said.\nDeKalb police said Danger, who was driving the Camaro with Page inside, did survive.\nBut he remained hospitalized with life-threatening injuries Monday and Baldwin remained reeling.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/surrounded-death-witness-recalls-285-wreck-that-killed/Q9ZkutEwNrH3RzYFOamOLM/"}
