{"authors":["Erica Tempesta And Charlie Lankston For Dailymail.Com"],"date_download":"2018-10-23 01:47:58","date_modify":"2018-10-23 01:47:58","date_publish":"2016-01-29 15:59:58","description":"The 45-year-old joined fellow Fox News journalists Bret Baier and Chris Wallace to moderate the Republican debate held in Des Moines, Iowa on Thursday night.","filename":"data/vaneerConsumption/WittyTwitteruserslashoutatMegynKellyoverhereyelashes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B3D3D200000578-0-image-a-3_1454081000063.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422836_Every-time-blinks-breeze-Fox-s-Megyn-Kelly-roasted-witty-Twitter-users-ridiculous-eyelashes-modeled-debate_1540259278.html","title":"Witty Twitter users lash out at Megyn Kelly over her eyelashes","title_page":"Witty Twitter users lash out at Megyn Kelly over her eyelashes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"to him as 'the elephant not in the room'\nDonald Trump may have made headlines for skipping Thursday night's Republican debate because of his feud with moderator Megyn Kelly, but it was the Fox News host's eyelashes that ended up commanding a vast amount of attention on the night - at least on Twitter.\nThe 45-year-old joined fellow journalists Bret Baier and Chris Wallace to moderate the seventh Republican presidential primary debate, held in Des Moines, Iowa. And while the debate itself received plenty of coverage in the media, it was Megyn's 'ridiculous' and 'fake' eyelashes that started a social media frenzy.\n'I'm worried Megyn Kelly's eyelashes are going to stab me through the TV,' Mark Hemingway tweeted last night, while Ellis Riojas added: 'Megyn Kelly's eyelashes are longer than this debate #GOPDebate.'\nScroll down for video\nLarger than life: Megyn Kelly's long eyelashes took the internet by storm after Thursday night's Republican presidential primary debate\nOver-the-top? Critics flocked to Twitter to call the Fox News moderator's eyelashes 'ridiculous' and 'fake'\nMaking a sp-lash for all the wrong reasons: Megyn's heavy eye make-up was further accentuated by the addition of dark eyeliner on her top lid\nPoking fun: Mark Hemingway joked that he feared the 45-year-old's long lashes were going to come through his television and cause him bodily harm\nCracking jokes: Ellis Riojas noted that Megyn's eyelashes were longer than the GOP debate itself\nMeanwhile, a Twitter user known as Seth joked: 'Megyn Kelly may take flight, if she bats those fake eyelashes too fast.'\nDuring the debate, Megyn wore a simple black blazer over a plain white top. Her short blonde hair was casually combed back and she sported a neutral share of lipstick, but it was her thick black eyelashes that viewers couldn't get over.\n'Every time Megyn Kelly closes her eyes, she absorbs up to a 1.5ccs of nutrients from insects captured by her eyelashes. #GOPDebate #TYTLive,' Hank Thompson tweeted, while a Twitter user named Kate added: 'Megyn Kelly's eyelashes feel like a YouTube tutorial gone wrong.'\nOthers used Megyn's eyelashes as an opportunity to poke fun at her and the candidates taking part in the debate.\n'Megyn Kelly's false eyelashes are so big, every time she blinks, the breeze wakes up Ben Carson. #GOPDepbate,' Twitter user and Donald fan Rump 2016 wrote.\n'Ben Carson is wondering if Megyn Kelly's fake eyelashes are strong enough to pierce a belt buckle. #LifeTweetingWithoutWatchingTheDebate,' a man known as Gladstone tweeted.\n'Apparently, every time Megyn Kelly gets dissed by Trump, she adds an inch to her fake eyelashes,' another user noted.\nToo much? The Fox News star wore her blonde hair casually combed back and subtle lipstick, but it was her eyelashes that garnered much unwanted attention\nFox News team: Megyn joined fellow journalists Bret Baier (R) and Chris Wallace (L) to moderate the seventh Republican debate\nTake flight: This Twitter user suggested that Megyn's eyelashes were as long as wings\nBug's life: Hank Thompson joked that Megyn's eyelashes were so long that they were catching insects\nAnd Maura Quint added: 'Megyn Kelly's fake eyelashes are so long they could be one of [John] Kasich's attempted answers.'\n'#GOPDebate @FoxNews what's up with @megynkelly ridiculously long eyelashes? They are bimbo-esque! Want to be taken seriously? Be serious!' Julie Davis wrote, while Twitter user GleasonG compared her to a reality TV star.\n'I don't hate Megyn Kelly. But why is she moderating a debate with hair and makeup that makes her look like Khloe Kardasian? #GOPDebate,' the person asked.\nMegyn's beauty look is thought to have been the work of make-up artist Maureen Walsh, who has been working with The Kelly File host for a number of years, and is often the mastermind behind her on-screen beauty looks.\nIn December 2013, the cosmetics expert told the Washington Post that working with Megyn is like 'working on a supermodel every day - a brilliant supermodel,' which could perhaps explain the inspiration behind the rather glamorous make-up look modeled by Megyn during the debate.\nMegyn's eyelashes also sparked a fierce debate on social media about whether the Fox News anchor deserved such a bitter backlash - or whether the uproar over her make-up was a symptom of the same sexism that she has often tried to stand against.\nAfter Anne Lamott tweeted that 'Megyn Kelly's false eyelashes looked terrible, as did Chris Christie's tie, like something your uncle Ed would wear on vacation,' a Twitter user named Barbara argued that she should be focusing on Megyn's accomplishments - not her appearance.\nSimple style: Megan wore a simple black blazer over a white top and silver jewelry to moderate the debate\nThe morning after the night before: On Friday morning, Megyn stepped out bare-faced in New York - without her controversial lashes\nTaking jabs: This Twitter user brought up Megyn's feud with Donald Trump, who skipped the debate because she was moderating\nFeeling breezy: Donald Trump supporter Rump 2016 joked that every time Megyn fluttered her eyelashes she would create a breeze that would wake up Republican presidential candidate Ben Carson\nNon-stop: He also joked about Ben Carson pondering if her eyelashes could 'pierce a belt buckle'\n'@ANNELAMOTT good thing we are teaching our girls that eyelashes are important - @megynkelly is intelligent why not focus on that?' she wrote.\nThe White House Press Corps also noted: 'Twitter reveals how sexist women are re: Megyn Kelly: Why is she wearing false eyelashes, don't like her hair, her make-up is over the top.'\nAnd while Megyn's eyelashes have undoubtedly caused a commotion on Twitter, this isn't the first time she has been criticized for her over-the-top eye make-up.\nShortly after the now-infamous debate during which she first went up against The Donald over his seemingly-sexist treatment of women, Megyn faced similar social media criticism about her choice of over-the-top cosmetics.\n'I skipped Rep. debate, watching lip synch now,' Twitter user Airbag Moments posted on the social media site. 'Why weren't Megyn Kelly's baleen-like fake eyelashes the main #trend?'\nInterestingly, the uproar over Megyn's lengthy lashes comes just one day after Donald took to Twitter to add more fuel to his fiery feud with the Fox News star by tweeting images from a raunchy photoshoot she took part in for GQ Magazine, while labeling her a 'bimbo'.\nKeeping up with Megyn Kelly? This Twitter user compared the host to reality television star Khloe Kardashian\nFighting back: A Twitter user named Barbara responded to Anne Lamott's tweet by noting that people should be focusing on Megyn's accomplishments - not her eyelashes\nAhead of the game: This Twitter user criticized Megyn's 'fake' eyelashes in August after she moderated the first Republican debate (pictured)\nSharing two racy images from the shoot, in which Megyn can be seen posing provocatively in a skin-tight, low-cut black mini dress and sky-high heels, Donald added the caption: 'Criticizes Trump for objectifying women... Poses like this in GQ Magazine.'\n'And this is the bimbo that's asking presidential questions?' he tweeted.\nAnd Donald, who refused to attend Thursday night's Fox News debate because of his ongoing feud with Megyn, choosing instead to host his own fundraiser, didn't stop there.\nThe GOP candidate took the opportunity to further criticize Megyn again in an interview with Fox News host Bill O'Reilly, arguing that she was biased against him.\nDonald has sent out numerous tweets criticizing her since last August, when the reporter tried to pin him down on allegations of misogyny during the first Republican presidential debate.\nHe bristled at the allegations during the debate, but really let fly online, shortly thereafter suggesting that Megyn was so hard on him because she was menstruating - a comment he later insisted had been misinterpreted.\nAnd Megyn faced further backlash on Friday morning after Republican candidate Ted Cruz alleged that she referred to Donald as 'Voldemort' while off-camera.\nOngoing feud: Republican presidential candidate Donald Trump skipped the debate because Megyn was moderating and instead spoke at a veteran's rally in Des Moines that night (pictured)\nThe battle rages on: Donald took to Twitter on Thursday to criticize Megyn for accusing him of objectifying women, despite taking part in a very raunchy photoshoot for GQ Magazine\nThrowing insults: The Republican candidate also referred to Megyn as a 'bimbo' in a tweet posted shortly after he shared the GQ images\nThe feud between the Fox anchor and the leading Republican overshadowed the entire debate – which she began by calling Donald 'the elephant not in the room' – but it was this off-camera insult, that spoke volumes.\nDuring a post-debate interview with Megyn, Cruz even called her out on the comment, telling her, 'Well, you know, you were joking just before we went on air that it was sort of like Voldermort, he who must not be named.'\nMegyn did not deny the comment, smiled, and asked him if there had been a 'pact' not to discuss Donald among the seven GOP candidates on stage.\nThe morning after the debate Fox News spokesperson claimed that Cruz was wrong – and that Megyn had simply said 'he who shall not be named'.\nAnd after the show, the channel today confirmed, she called him 'Voldemort' - the most evil character in the Harry Potter series, who is frequently referred to in the books as 'He Who Must Not Be Named' in the fictional series about wizards - but said it was not intended as an insult.\nToday Fox News said: 'In an off camera exchange, Megyn asked Senator Ted Cruz about the fact that Donald Trump got very little mention from any of them during the debate.\n'She asked him (approximate quote) off camera: \"You seem to be treating Trump like Voldermort – 'he who shall not be named' – did you plan that?'\"","url":"https://www.dailymail.co.uk/femail/article-3422836/Every-time-blinks-breeze-Fox-s-Megyn-Kelly-roasted-witty-Twitter-users-ridiculous-eyelashes-modeled-debate.html"}
