{"authors":["Shyam Dodge For Dailymail.Com"],"date_download":"2018-10-23 03:33:22","date_modify":"2018-10-23 03:33:22","date_publish":"2016-01-29 18:26:30","description":"The two hip hop stars got into an epic feud over social media earlier this week, but clearly is not water under the bridge for Wiz.","filename":"data/vaneerConsumption/WizKhalifacallsoutKanyeWestduringconcertinChilefollowingepicTwitterrow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4AB9700000578-0-image-a-20_1454091748162.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423252_Wiz-Khalifa-calls-Kanye-West-concert-Chile-following-epic-Twitter-row_1540265602.html","title":"Wiz Khalifa calls out Kanye West during concert in Chile following epic Twitter row","title_page":"Wiz Khalifa calls out Kanye West during concert in Chile following epic Twitter row | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Wiz Khalifa is not putting his Twitter row with Kanye West behind him.\nThe 28-year-old called out the Yeezus rapper during a concert in Santiago, Chile on Thursday.\nThe two hip hop stars got into an epic feud over social media earlier this week, but clearly is not water under the bridge for Wiz.\nScroll down for video\nReady to set fire: Wiz Khalifa arrived in Santiago, Chile, on Thursday before calling out Kanye West later that evening at a concert\nThe rapper repeatedly referred to Kanye during his set and at one point, according to TMZ, yelled: 'We coming for you Kanye, you better run n**a!'\nEarlier that same day, the See You Again hitmaker was seen arriving at the airport in skinny jeans.\nHe also took time to sign mementos for fans, but seemed to keep mum on the feud.\nThe feud began when Kanye announced he changed the name of his upcoming album to Waves, which Wiz took umbrage to as he felt it disrespected the legacy of rapper Max B, who was the founder of the Wave sound. He is currently serving 75 years in prison for a deadly armed robbery.\nSee Kanye west updates as Wiz Khalifa calls him out during concert in Chile\nThe rapper repeatedly referred to Kanye during his set and at one point yelled: 'We coming for you Kanye, you better run n**a!'\nWave and Wavy in Max B's world means influential or cool leading many to believe Kanye lifted the name on purpose - including Wiz\nKanye let Wiz's thoughts on the title initially slide but the See You again rapper then tweeted something with 'KK,' in it. Kanye thought he was talking about Kim Kardashian and unleashed - despite it actually being a reference to marijuana.\nIn true Kanye style, he came up with 17 reasons why Wiz needs to know his place including insulting Amber, claiming to 'own' their son Sebastian as well as accusing him of stealing his style from rapper and Kanye protege Kid Cudi.\nWild, wild West: This all started after Kanye (seen here earlier this month) unleashed a tirade at Wiz (pictured 2014) on Twitter on Wednesday\nKanye did however, praise Wiz for his ability to rock skinny jeans whilst claiming to have blazed the fashion path for the slender rapper to do so.\nKanye's epic rant aimed at Wiz including strong words like: 'You let a stripper trap you.'\n'I know you mad every time you look at your child that this girl got you for 18 years [making reference to his big hit Gold Digger].\n'You wouldn’t have a child if it wasn’t for me. Your own Waves? I own your child!'\nBut he threw in a few compliments too in the bizarre outburst, saying: 'I think you dress cool I wish I was skinny and tall... Maybe I couldn’t be skinny and tall but I’ll settle for being the greatest artist of all time as a consolation.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423252/Wiz-Khalifa-calls-Kanye-West-concert-Chile-following-epic-Twitter-row.html"}
