{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-22 21:07:24","date_modify":"2018-10-22 21:07:24","date_publish":"2016-01-11 00:16:14","description":"He's had a tumultuous history with some of the women in his life.","filename":"data/vaneerConsumption/WizKhalifaandhismumarriveontheGoldenGlobes2016redcarpet.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001986F00000578-0-image-a-25_1452475853753.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393136_Wiz-Khalifa-kisses-mom-Peachie-Wimbush-lips-arrrive-Golden-Globes_1540242444.html","title":"Wiz Khalifa and his mum arrive on the Golden Globes 2016 red carpet","title_page":"Wiz Khalifa and his mum arrive on the Golden Globes 2016 red carpet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's had a tumultuous history with some of the women in his life.\nBut the date Wiz Khalia brought to the Golden Globes will always be his number one lady.\nThe 28-year-old arrived on the red carpet on Sunday night with his mom Katie Wimbush.\nScroll down for video\nNumber one lady: Wiz Khalifa brought his mom Katie 'Peachie' Wimbush as his date for the Golden Globes on Sunday\nThe rapper wasn't shy about showing off his affection for his mammy - AKA Peachie - as he planted a kiss for the cameras.\nWiz is hoping to make his mom even prouder, were it possible, as he is in the running for Best Original Song for See You Again from Furious 7.\nHe's up against Ellie Goulding's Love Me Like You Do from Fifty Shades Of Grey; Brian Wilson's One Kind Of Love from Love & Mercy; Sam Smith's Writing's On The Wall from Spectre; and David Lang's Simple Song #3 from Youth.\nSee more of the latest red carpet pictures and video updates from the Golden Globes\nClose: The rapper wasn't shy about showing off his affection for his mammy as he planted a kiss for the cameras\nThe tattooed star scrubbed up in a sharp Tom Brown black suit and white shirt, which he wore with a loosened tie and David Yurman cufflinks.\nThe trousers he kept purposely short to show off his snazzy Gucci loafers.\nPeachie meanwhile matched him in a white blouse and floor-length black skirt.\nThe Black and Yellow hitmaker said it was 'Crazy as heck' to be nominated, adding 'but I’m dealing with it'.\nExpecting a flood? The tattooed star scrubbed up in a sharp Tom Brown black suit and white shirt, which he wore with a loosened tie. The trousers he kept purposely short to show off his snazzy Gucci loafers.\n'It’s a great song for people who are going through something and need to know that everything is going to be alright,' he said outside the Beverly Hilton.\nHe revealed that he has a new album on the way, and that he is gearing up for some more tours.\n'[I've been] Working, hanging out with my son Sebastian. I’ve got my mom here,' he said.\nEx: He revealed his son Sebastian - whom he shares with estranged wife Amber Rose - is growing up fast. (pictured at the 2014 MTV Movie Awards)\nHe also revealed 'Bash' - whom he shares with estranged wife Amber Rose - is growing up fast.\n'That boy is getting big. He’s starting to kick and punch,' adding that 'time outs' were not part of the discipline regimen.\n'Time out? No there’s no time out,' he said. 'I talk to him and explain things.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393136/Wiz-Khalifa-kisses-mom-Peachie-Wimbush-lips-arrrive-Golden-Globes.html"}
