{"authors":["Ian Hanchett"],"date_download":"2018-10-30 22:03:46","date_modify":"2018-10-30 22:03:46","date_publish":"2015-12-10 20:46:13","description":"W. Kamau Bell: White People Need to 'Handle' Trump, He's 'Pinnacle of White Privilege and White Supremacy'","filename":"data/vaneerConsumption/WKamauBellWhitePeopleNeedtoHandleTrumpHesPinnacleofWhitePrivilegeandWhiteSupremacy.json","image_url":"https://media.breitbart.com/media/2015/12/Bell-1210-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_10__1540937026.html","title":"W. Kamau Bell: White People Need to 'Handle' Trump, He's 'Pinnacle of White Privilege and White Supremacy'","title_page":"W. Kamau Bell: White People Need to 'Handle' Trump, He's 'Pinnacle of White Privilege and White Supremacy' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Thursday’s “CNN Newsroom,” comedian W. Kamau Bell argued white people needed to “handle Donald Trump.” He further described Trump as “the pinnacle of white privilege and white supremacy meeting in one place.”\nBell said, “White people, you’ve created race and then off of race, off the back of race, you created racism, and everybody has a racial category, except white people seem to not claim their racial category, which sucks because you’re most of the racial category in this country. And so I consider it my job to handle Ben Carson, Raven-Symoné, random black people on the Internet. It’s your job to handle Donald Trump.”\nBell explained what he meant by pointing to how Rachel Dolezal was handled, stating, “Black people came together. There’s a thing called Black Twitter, I’m sure you’re familiar with. Black Twitter came together to handle Rachel Dolezal. I also wrote a — I wrote blogs about it. I tweeted about it. I talked about it on stage as a comedian, that’s what I do. I’m still talking about it. I’m recognizing the problem, and talking about the problem, and claiming my race when I talk about the problem. I’m not talking about Rachel Dolezal as a human being. I’m talking about her as a fake black person. And I think white people need to talk about Donald Trump as the worst. He’s like the pinnacle of white privilege and white supremacy meeting in one place.” Bell added, “White people have no community. … So, white people, have some white pride, that’s all I’m saying.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/politics/2015/12/10/w-kamau-bell-white-people-need-to-handle-trump-hes-pinnacle-of-white-privilege-and-white-supremacy/"}
