{"authors":["Pa Reporter"],"date_download":"2018-10-22 23:39:29","date_modify":"2018-10-22 23:39:29","date_publish":"2016-01-28 12:46:03","description":"Mike Williamson is set to sign for Wolverhampton Wanderers after the club agreed a fee with Newcastle United. The Magpies had been in talks with Wolves and Sheffield Wednesday.","filename":"data/vaneerConsumption/WolvesbeatSheffieldWednesdayinraceforNewcastlecentrehalfMikeWilliamson.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/2BA8465B00000578-0-image-a-34_1453984985213.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420895_Wolves-beat-Sheffield-Wednesday-race-Newcastle-centre-half-Mike-Williamson_1540251569.html","title":"Wolves beat Sheffield Wednesday in race for Newcastle centre half Mike Williamson","title_page":"Wolves beat Sheffield Wednesday in race for Newcastle centre half Mike Williamson | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mike Williamson is set to sign for Wolverhampton Wanderers after the club agreed a fee with Newcastle United.\nThe Magpies had been in talks with Wolves and Sheffield Wednesday, and Williamson is due in the Midlands on Thursday to seal a move.\nCentre half Williamson, 32, played five games on loan for Wolves between October and November and boss Kenny Jackett has made no secret of his desire to sign him permanently.\nMike Williamson heads home for Newcastle United against Sheffield Wednesday in the League Cup in August\nThe centre half played five games on loan for Wolverhampton Wanderers between October and November\nWolves' 27-year-old left back Scott Golbourne (right) has been allowed to join Bristol City\nLeft back Scott Golbourne has been allowed to join Bristol City and Jackett is delighted to bring Williamson back to Molineux.\n'We are losing one defender and bringing another one in which balances things out, and we are looking forward to Mike being back with us,' he told the club's official site.\n'He made an excellent impact whilst on loan, and brought his considerable experience and leadership to the back four.\n'We will be pleased to secure his services and are looking forward to getting him back here and making another positive impact on the team.'\nWilliamson was recalled by Newcastle from his initial loan spell at Molineux in November to cover for injuries but failed to play after suffering a hamstring problem in training.\nHe has been at St James' Park since joining from Portsmouth in January 2010 and played 170 games, scoring once, but has fallen out of favour under Steve McClaren.","url":"https://www.dailymail.co.uk/sport/football/article-3420895/Wolves-beat-Sheffield-Wednesday-race-Newcastle-centre-half-Mike-Williamson.html"}
