{"authors":["William Bigelow"],"date_download":"2018-10-30 21:20:34","date_modify":"2018-10-30 21:20:34","date_publish":"2015-07-16 17:01:53","description":"The Prius driver who survived the February fatal multivehicle crash in which Bruce Jenner was involved implicitly condemned the ESPY awards for honoring Jenner with the Arthur Ashe Award Wednesday night. |","filename":"data/vaneerConsumption/WomaninJennerCrashBlastsESPYAward.json","image_url":"https://media.breitbart.com/media/2015/07/Overhead-shot-Jenner-car-crash-site-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_07_16__1540934434.html","title":"Woman in Jenner Crash Blasts ESPY Award","title_page":"Woman in Jenner Crash Blasts ESPY Award | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Prius driver who survived the February fatal multivehicle crash in which Bruce Jenner was involved implicitly condemned the ESPY awards for honoring Jenner with the Arthur Ashe Award Wednesday night.\nJessica Steindorff was invited by ESPN to Wednesday’s ESPY Awards as a guest, but that didn’t stop her from articulating her anger at those treating Jenner as a hero. In an exclusive interview with ET, Steindorff said, “I find it difficult to understand how the culture we live in can honor a person who is responsible for taking a life and injuring several others with both an award and a reality show. For an individual who is such a positive role model in many aspects of her life, Caitlyn has failed to do the right thing and take responsibility for her actions.” She added, “I would hope that someone who seems to greatly value the importance of human existence would be more sensitive to the fact that she ended another person’s life. Sadly we are living in a tabloid society.”\nJenner has been hit with two lawsuits over the crash, one from Steindorff stating that Jenner drove “negligently, carelessly, recklessly and wantonly,” and another from two of the stepchildren of the woman who died in the crash.\nAccording to TMZ, law enforcement sources analyzing the video footage of the February crash attributed Jenner’s actions to inattentiveness, and would charge him with misdemeanor vehicular manslaughter at the most. TMZ also stated that the typical reaction of the court to a case such as Jenner’s is to dismiss it.\nAfter the crash, Jenner released a statement, which read: “My heartfelt and deepest sympathies go out to the family and loved ones, and to all of those who were involved or injured in this terrible accident. It is a devastating tragedy, and I cannot pretend to imagine what this family is going through at this time. I am praying for them. I will continue to cooperate in every way possible.”\nJenner did not issue an apology.","url":"https://www.breitbart.com/local/2015/07/16/woman-in-jenner-crash-blasts-espy-award/"}
