{"authors":[],"date_download":"2018-10-30 20:23:46","date_modify":"2018-10-30 20:23:46","date_publish":"2015-11-23 18:26:51","description":"The GBI Monday released the recording of a frantic mother’s chilling call to Coweta County 911 operators, begging for help for her son, who she said was “freaking out” on drugs and being restrained by her husband and son’s girlfriend in a car that had pulled to the side of I-85 Friday night.","filename":"data/vaneerConsumption/Womanbegsforhelpforsoninfrantic911.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_coweta-tase_6a471027fb5505d2fb1dbb3c696d75c2__1540931026.html","title":"Woman begs for help for son in frantic 911...","title_page":"Coweta Taser death: Woman begs for help for son in frantic 911...","title_rss":"NULL","source_domain":"ajc.com","text":"The GBI Monday released the recording of a frantic mother’s chilling call to Coweta County 911 operators, begging for help for her son, who she said was “freaking out” on drugs and being restrained by her husband and son’s girlfriend in a car that had pulled to the side of I-85 Friday night.\nWhen Coweta sheriffs’ deputies arrived on the scene several minutes later, they reportedly struggled with the son, 32-year-old Chase Alan Sherman, and deployed a Taser in an attempt to control the man.\nSherman allegedly continued to resist the deputies and medical personnel until, at some point, he stopped fighting and went into medical distress, according to the GBI. Deputies and EMS performed CPR, and Sherman was taken to a local hospital, where he was pronounced dead.\nIn the 9:07 p.m. call made by Mary Ann Sherman, she told the 911 operator that her son was “crazy, out on some kind of drugs.” She later said he had smoked “spice,” a type of synthetic marijuana.\n“It messed his brain up,” she said.\n“He’s hallucinating; we need help,” Mary Ann Sherman pleaded with the operator. “He’s going to kill us all if we don’t get help.”\nDuring the 10 minute call, which was punctuated by the sounds of several people screaming, she said her son had already bitten his girlfriend “really, really bad” and needed to go to a mental institution.\nThe 911 call ended just as two patrol cars pulled in behind the rental car the family was driving.\nThe incident is under investigation by the GBI. An autopsy on Chase Sherman will be performed at the GBI Medical Examiner’s office in Decatur.\nCoweta sheriff’s Capt. Mark Fenninger told The Atlanta Journal-Constitution Monday that the deputies involved were initially placed on routine paid leave, but have since returned to duty.","url":"https://www.ajc.com/news/crime--law/coweta-taser-death-woman-begs-for-help-for-son-frantic-911-call/EYT1cVnwurQJj9pZu8azoO/"}
