{"authors":["Associated Press"],"date_download":"2018-10-23 05:00:50","date_modify":"2018-10-23 05:00:50","date_publish":"2016-01-28 21:02:22","description":"ELIZABETH, N.J. (AP) — A former New Jersey college student charged with making fake threats against fellow black students asked for probation on Thursday. NJ...","filename":"data/vaneerConsumption/Womanaccusedofmakingthreatstoblacksseeksprobation.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421558_Woman-accused-making-threats-blacks-seeks-probation_1540270850.html","title":"Woman accused of making threats to blacks seeks probation","title_page":"Woman accused of making threats to blacks seeks probation | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Woman accused of making threats to blacks seeks probation\nELIZABETH, N.J. (AP) — A former New Jersey college student charged with making fake threats against fellow black students asked for probation on Thursday.\nNJ.com (http://bit.ly/1QvDSXO) reports an attorney for Kayla-Simone McKelvey, of Union Township, asked a judge to admit her into a pretrial intervention program that would allow her to avoid jail time.\nMcKelvey is charged with creating a false public alarm, which carries a maximum prison term of five years. If she's admitted into the program and completes it, the charge could eventually be expunged from her record.\nAt a December hearing in which she pleaded not guilty, attorney Thomas Ashley said McKelvey was \"quite remorseful\" about the incident.\nProsecutors contend the 24-year-old McKelvey, who is black, participated in a Nov. 17 rally on racial issues at Kean University and then went to a campus library computer and tweeted anonymous threats against black students.\nThey say she returned to the rally and tried to raise awareness about the threats.\nThe rally came in the wake of racial protests at the University of Missouri and other college campuses.\nSecurity was increased at the New Jersey college after the threats were discovered, though classes weren't affected. But the threats did lead a group of black ministers to call for Kean President Dawood Farahi to resign the following day, saying that the threats showed that he hadn't done enough to address alleged racial tension on campus.\nThe school responded that the claims of racial tension were baseless.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3421558/Woman-accused-making-threats-blacks-seeks-probation.html"}
