{"authors":[],"date_download":"2018-10-30 20:33:06","date_modify":"2018-10-30 20:33:06","date_publish":"2015-09-09 21:52:00","description":"A woman who admitted she killed an 85-year-old man in a hit-and-run after her sister had been arrested for the crime is going to prison.","filename":"data/vaneerConsumption/Womangetsprisonforhitandrundeathof85yearoldman.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/05/22/Images/photos.medleyphoto.5283919.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_woman-gets-_f4ed0358e423da786bf1d1430be21191__1540931586.html","title":"Woman gets prison for hit-and-run death of 85-year-old man","title_page":"Woman gets prison for hit-and-run death of 85-year-old man","title_rss":"NULL","source_domain":"ajc.com","text":"A woman who admitted she killed an 85-year-old man in a hit-and-run after her sister had been arrested for the crime is going to prison.\nEsther Escobar was sentenced to 15 years for killing Kanaiyalal P. Patel of Norcross, Channel 2 Action News reported Wednesday.\nGwinnett police initially arrested her sister, Ruth Escobar, for the April 2014 incident. Ruth Escobar was released from Gwinnett County jail and charges against her were dropped when Esther Escobar later claimed she was responsible and investigators confirmed her account.\nA witness saw the driver of a maroon 1999 Ford F-150 pickup truck hit Patel as he was walking across Kings Ridge Drive at the intersection with Singleton Road, police previously said. The witness followed the driver to Oakbrook Pointe Apartments in Norcross and helped officers locate a suspect, and Ruth Escobar was arrested and spent time in jail.\nEsther Escobar was later charged with first-degree vehicular homicide, felony hit-and-run, driving without a valid license, failure to stop at a stop sign, and an equipment violation for the vehicle’s tires not having enough tread, police said.","url":"https://www.ajc.com/news/crime--law/woman-gets-prison-for-hit-and-run-death-year-old-man/WmbVeqf5Xu94KDTmeBpdbP/"}
