{"authors":["Laura House For Daily Mail Australia"],"date_download":"2018-10-22 23:29:56","date_modify":"2018-10-22 23:29:56","date_publish":"2017-04-26 07:46:59","description":"Millie Thomas, 29, from the Sunshine Coast, Queensland, was consumed by the disease for 15 years and several times, was sure it would take her life.","filename":"data/vaneerConsumption/Womanwithanorexia15yearsrecoveredwithhypnotherapy.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/07/3F9CC6F300000578-0-image-a-23_1493186920981.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4446444_Woman-anorexia-15-years-recovered-hypnotherapy_1540250996.html","title":"Woman with anorexia 15 years recovered with hypnotherapy","title_page":"Woman with anorexia 15 years recovered with hypnotherapy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Millie Thomas has spent more than half her life battling anorexia.\nThe 29-year-old, who lives on the Sunshine Coast, Queensland, was consumed by the disease for 15 years and several times, was sure it would take her life.\nNow recovered, Ms Thomas has opened up about the inner turmoil that she faced over the years, the relentless nature of the disease and how she recovered from the brink of death to go on to help others with eating disorders.\nFor Ms Thomas, her eating disorder 'snowballed' when she was 12 after she started at an all girls private school in Auckland.\nMillie Thomas (pictured recently) has spent more than half her life battling anorexia\n'Once I had lost a certain amount of weight the thoughts just took over my body,' she said\n'I felt a little bit vulnerable and like most girls I wanted to fit into the cool crowd. To do this I felt like I had to lose weight for summer,' Ms Thomas told Daily Mail Australia.\n'For me it just blew up from there. I started making my own lunches and then I wasn't eating lunch at all and then I was hiding my dinner and skipping breakfast by saying I had to leave early to go to sport training.\n'I didn't know at the time that people are genetically predisposed to eating disorders so once I had lost a certain amount of weight the thoughts just took over my body.'\nWithin just a few months, Ms Thomas' weight had plummeted and she had fallen deep into the grips of anorexia.\n'At that age people were noticing at school but they didn't know what to do - and I'm sure people also felt as if they said anything it could be detrimental,' Ms Thomas said.\n'I was taken out of school and hospitalised. Doctors got my weight back up but they never changed my anorexic way of thinking, my ED mentality and that is a flaw in the system that still remains today.'\nMs Thomas' family tried everything to help her - from doctors and psychiatrists to psychologists and Narrative Therapy, FBT and CBT - but nothing was getting through.\n'I wasn't living I was existing. I went to school and topped my subjects and was a perfectionist but I barely ate or drank a thing,' Ms Thomas said.\n'I had an image in my head of what I wanted to be but I had no idea that the perception I had of my own body was completely distorted. I was sure I was seeing the correct thing in the mirror,' Ms Thomas said\n'I was counting every single kilojoule I ate each day and while I was seeing psychologists a lot of the time I wasn't mentally ready to give up my desire and drive to be \"thin\".\n'I had an image in my head of what I wanted to be but I had no idea that the perception I had of my own body was completely distorted. I was sure I was seeing the correct thing in the mirror.'\nIf I hadn't expended enough calories I would stand in my room and run on the spot.\nMs Thomas, who battled the illness all the way through school and well into her twenties, described herself as being 'trapped in my thinking'.\n'I was eating but I was eating the exact same thing every single day and I was exercising obsessively,' she explained.\n'I would exercise at the same time every day and if I decided that I needed to do extra the next day I would have to do that same extra exercise again. I would wake up even if I hadn't eaten anything the day before and still had to exercise.'\nBefore bed each night, Ms Thomas would calculate what she had eaten that day - even if it was just three apple slices - and see how many calories she had expended.\n'If I hadn't expended enough calories I would stand in my room and run on the spot,' she said.\nIt got so obsessive that Ms Thomas got six stress fractures in her hips because she had exercised while her body was in a state of malnutrition.\n'It's almost like you are looking down on yourself. You want to get well but what you want becomes this insurmountable, impossible thing to achieve,' she said (pictured recently)\n'It's almost like you are looking down on yourself from above. You want to get well but what you want becomes this insurmountable, impossible thing to achieve,' she said.\n'The eating disorder will always find a way to make you feel bad about yourself.'\nMs Thomas said she reached rock bottom when doctors told her she had just two weeks to live.\n'I was at a point where I didn't want to wake up anymore. I didn't want to deal with the intense hunger or the pain anymore,' she said.\nThe thought of waking up tomorrow to face my reality was all too painfully overwhelming.\n'They told me I would never have children, that my disease was too chronic and enduring and that I would never recover. They told my parents that I wouldn't get better.'\nIn a harrowing blog post, Ms Thomas wrote: 'At that point I was a 27 year old skeleton with the bones of an 80 year old, 4 stress fractures, a weak heart and no menstrual cycle.'\n'I felt broken beyond repair. A lost cause. I was done with struggling through the torment of each day - running for hours on end on an empty stomach, counting out my daily allowance of apple slices and constantly looking for any opportunity to burn just a few more calories.\nMs Thomas moved to the Sunshine Coast with her mother (pictured left) to try hypnotherapy and neuro-linguistic programming where she spent six months of 'learning to live again'\n'The thought of waking up tomorrow to face my reality was all too painfully overwhelming.'\nBut Ms Thomas decided to try her hardest to recover, just one more time.\n'I saw how much it hurt my mum when I said I'd rather die,' Ms Thomas said.\n'I decided I would give it one more go - despite a treatment team telling me I would never reach full recovery and despite having spent 15 years of my life trying all kinds of different treatments.'\nMs Thomas moved to the Sunshine Coast with her mother to try hypnotherapy and neuro-linguistic programming where she spent six months 'learning to live again'.\n'Hypnotherapy was so great for me, she didn't see my case like the doctors did, she just knew I had to \"rewire\" my brain,' she said.\n'She dealt with it like anxiety or OCD and I don't know why it worked but it did. It wasn't easy - it was the hardest thing I've ever done and all of my energy and mental capacity went into recovery.\nMs Thomas said recovery was like starting over - the then 27-year-old using every ounce of her tenacity, courage and strength to beat the illness\n'My thoughts were about food and exercise every second of the day so to change that was a process but within maybe four weeks I was asking to eat again.'\nMs Thomas said recovery was like starting over - the then 27-year-old using every ounce of her tenacity, courage and strength to beat the illness.\nYou have nothing in your life that's not somehow pervaded by the disease.\n'I let Mum take control and knew that I needed to be cared for and within a few months I was a new person,' Ms Thomas said.\n'I was in a different world - I couldn't fathom that this is what it was like to really live, that this is what I had been missing out on this entire time.\n'I would go to the beach and wander along rather than setting off at a certain time and exercising. Anorexia takes away any piece of joy - anything that you are passionate about it ruins it for you.\n'You have nothing in your life that's not somehow pervaded by the disease.'\nMs Thomas decided to take the leap and move to the Sunshine Coast permanently where she is now an a ambassador for EndED, mentors those who suffer from an eating disorder and runs support groups for them and their families.\nMs Thomas decided to take the leap and move to the Sunshine Coast permanently where she is now an a ambassador for EndED and mentors those who suffer from an eating disorder\n'Unless you've been through it you don't get it, I can offer advice that might work,' Ms Thomas said.\n'Psychologists and doctors are often not helping sufferers properly. It's a flawed system. It breaks my heart because I have had people tell me they can't leave the hospital because they know they won't eat when they leave but doctors discharge them anyway.\n'We are fighting for the privacy laws to be changed as well because at the moment, if a patient is 18 and don't want their parents to know their treatment plan or progress, hospitals won't tell them.\n'They are committing people who are mentally unwell and then letting them make all of their own decisions.\nMs Thomas also hopes to break the stigma surrounding eating disorders and stop the shame and guilt felt by both sufferers and their families.\nMs Thomas also hopes to break the stigma surrounding eating disorders and stop the shame and guilt felt by both sufferers and their families\n'Not enough people speak about it and eating disorders are so often swept under the carpet,' Ms Thomas said.\n'I don't want to normalise it I simply want to talk about it. The rates of eating disorders in girls under 12 have shot up by 115 per cent over the past decade worldwide and social media is a frightening contributor to that.'\nI have the ability to empathise and connect with others suffering from mental illness, on a level that most can't.\n'If I had been unwell in the age of social media as it is now I don't think I would have survived.'\nMs Thomas hopes that everything she went through can help others moving forward.\n'Surely there is a reason why I had to go through the hell that I did and I hope I can help people realise what is going on,' Ms Thomas said.\n'Although battling anorexia has stripped me of more than half my life to date; I refuse to be bitter. My journey has given me a unique perspective on the world.\n'I have the ability to empathise and connect with others suffering from mental illness, on a level that most can't.'\nThose who seek support can get in touch with Millie and the EndED team on their website, on Instagram or on their Facebook page.\nIf you need help or support for an eating disorder or body image issue, please call Butterfly's National Helpline on 1800 334 673 or e-mail support@thebutterflyfoundation.org.au","url":"https://www.dailymail.co.uk/femail/article-4446444/Woman-anorexia-15-years-recovered-hypnotherapy.html"}
