{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-23 01:28:53","date_modify":"2018-10-23 01:28:53","date_publish":"2016-01-11 12:32:59","description":"Prachi Agarwal, an Indian beauty blogger, has shared her method for removing nail varnish in a YouTube video. Toothpaste contains ethyl acetate, which is found in nail varnish remover.","filename":"data/vaneerConsumption/WomanremovesnailvarnishusingVaselinelemonjuiceandTOOTHPASTE.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/300A2C3300000578-0-image-a-25_1452515642738.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393604_Woman-removes-glittery-nail-varnish-using-Vaseline-lemon-juice-TOOTHPASTE-three-minute-beauty-hack_1540258133.html","title":"Woman removes nail varnish using Vaseline, lemon juice and TOOTHPASTE","title_page":"Woman removes nail varnish using Vaseline, lemon juice and TOOTHPASTE | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman has revealed an ingenious beauty hack that shows how to remove nail varnish using a blob of toothpaste, Vaseline and lemon juice.\nGlittery nail varnish is notoriously difficult to take off but Prachi Agarwal, an Indian beauty blogger, appears to have come up with a foolproof method for removing it and has shared it in a YouTube video.\nUsing toothpaste and a nail brush, she scrubs off the paint in less than two minutes as it peels off in large, easy chunks.\nUsing a minimal amount of nail varnish removal fluid - which can contain high amounts of acetone - she simply squeezes a blob of normal toothpaste onto a plate.\nShe then mixes it with water using a cotton bud, then applies the mixture to the nails with a plastic nail brush.\nPrachi uses nail varnish remover and wipes to erode the top layer, adding that Vaselines and lemon juice are optional.\nPrachi has devised a method of getting rid of nail varnish using toothpaste, lemon juice and Vaseline\nAfter mixing the ingredients together on a small plate, she applies the mix to a nail brush and begins scrubbing\nThe nail varnish begins to come away in less than two minutes as toothpaste contains ethyl acetate\nShe also stresses that the trick works best for powder glitter-based varnishes.\nShe begins by removing the top coat with regular nail varnish remover and a cotton wool pad, then applies Vaseline to the nails.\nWater and toothpaste are then added to the mix - with an optional squirt of lemon juice for whitening - as the mixture is rubbed onto the nails vigorously using a nail brush.\nIt comes off in large chunks (left) as the toothpaste works its magic, before coming off completely (right)\nAfter just a few seconds, the nail varnish begins to fall off in large chunks. This is because toothpaste contains ethyl acetate, which is also found in nail varnish remover.\nPrachi advises washing your hands afterwards and adding Vaseline again to moisturise the nails and cuticles.\nThe video has racked up almost half a million views.","url":"https://www.dailymail.co.uk/femail/article-3393604/Woman-removes-glittery-nail-varnish-using-Vaseline-lemon-juice-TOOTHPASTE-three-minute-beauty-hack.html"}
