{"authors":["Harvey Day For Mailonline"],"date_download":"2018-10-23 01:18:04","date_modify":"2018-10-23 01:18:04","date_publish":"2017-03-10 09:18:48","description":"Ashleigh Turbitt, from South Shields, spent the cash on clothing, electronic devices, spa breaks, debts and online gambling. Some 151 victims lost at least £46,000 from the trips.","filename":"data/vaneerConsumption/WomanstolefromfamilieswhobookedtripstoDisneyland.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E21C1AF00000578-0-image-a-2_1489136288243.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300446_Woman-stole-families-booked-trips-Disneyland_1540257484.html","title":"Woman stole from families who booked trips to Disneyland","title_page":"Woman stole from families who booked trips to Disneyland | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ashleigh Turbitt, pictured outside Newcastle Crown Court, pocketed thousands of pounds from hard-up families who had booked trips to Disneyland\nConwoman travel agent Ashleigh Turbitt pocketed thousands of pounds from hard-up families who had booked trips to Disneyland and instead spent the money on spa breaks and her own theme park visit.\nRather than using hard-earned money to book coaches, ferries, hotels and tickets for Disneyland Paris, the 26-year-old splashed the cash on herself with spending sprees of up to £14,500 a month.\nTurbitt, from South Shields, spent the cash on clothing, electronic devices, spa breaks, debts, online gambling.\nSome 151 victims lost at least £46,000 from the trips while in total there were 368 people who lost out on holidays.\nTurbitt set up South Shields Day Trips in 2014 and advertised it on social media, including Facebook.\nBut now the fraudster, who ran the scam on a business on Facebook, has walked free from Newcastle Crown Court - because she had a baby nine months ago.\nPaul Cleasby, prosecuting, said: 'The idea was to offer trips to low income families who would or could not otherwise afford trips or holidays.\n'Discounts were offered by the defendant if customers were to pay immediately. This meant those from low income families parting with money they had either borrowed or struggled to save or had got from relatives who had died.'\nTo begin with trips were offered to places including Flamingo Land, Lightwater Valley and Edinburgh Zoo.\nMr Cleasby said: 'These were initially successful and the local community grew to trust her.\n'Such was the success, customers asked her to organise other trips, such as to Harry Potter Land and Euro Disney.\n'The defendant began to advertise Euro Disney trips and the prices were attractive and made them affordable to low income families and those who had never had a holiday in years or were on benefits or had saved for a long time, to treat their families for what was to them a trip of a lifetime.'\nTurbitt, from South Shields, spent the cash on clothing, electronic devices, spa breaks, debts, online gambling\nTurbitt claimed to be able to provide a two night trip to Euro Disney, including for the coach, ferry, hotel and entry tickets, for £329 for a family of three.\nMr Cleasby said: 'Some customers were initially wary of the price, thinking it was too good to be true.\n'They contacted the defendant, who reassured them everything was genuine and above board.\nVICTIMS TELL HOW HOLIDAY JOY TURNED TO TEARS... Their faces lit up when they plucked glitter-filled golden tickets from the Christmas tree and realised they were going on the trip of a lifetime to Disneyland. For Amy Bell's children, aged six and nine, it was the best present they could ever have wished for. Over the next few months, the excitement grew as the big day drew closer and passports were bought along with new clothes for the holiday. And so when the news broke that it was all a con and they had been ripped off by heartless Ashleigh Turbitt, it was a crushing blow. Miss Bell said in a victim impact statement read to Newcastle Crown Court: 'I had to explain to them a wicked woman had lied to me and stolen my money. 'I choked back tears as I told them. Their faces told me they knew how serious this was. They couldn't believe somebody would be so cruel. For Amy Bell's children, aged six and nine, a trip to Disneyland was the best present they could ever have wished for (Stock image) 'This was heartless and wicked and she has no conscience.' Miss Bell had bought the tickets for Disneyland Paris to give to her children at Christmas. Turbitt sent golden tickets in envelopes filled with glitter and Miss Bell hid them in her Christmas tree. She recalled: 'To see my boys' faces when they opened the tickets was wonderful. 'I spent the next few months excitedly planning the trip. I made a shortlist of places to visit, downloaded maps of the park and planned our route to ensure not a moment was wasted.' When Turbitt told Miss Bell the planned trip at Easter would have to be put back, she wasn't too concerned. After it was rescheduled, she had their bags packed two days before they were due to set off but then realised all was not well after reading a post on Facebook. The next day her worst fears were confirmed. She said: 'I broke down in tears. 'I didn't know how I would tell my boys. I felt so angry. I felt I had let my children down. 'When I collected my boys their first words were 'It's holiday time'. They thought we were just a few short hours away from a holiday of a lifetime.' Miss Bell, a student, was one of 43 victims to provide statements outlining the heartbreaking effect 26-year-old Turbitt's fraud had on them. Glynis Chapman said: 'I can still remember feeling physically sick knowing I had to tell my boys we would not be going to Disneyland. 'Ashleigh Turbitt took my money and used it as her own and she has shown absolutely no remorse for the crime. 'When it was reported in the local press, she sarcastically liked all the comments from people she had stolen from.' Kerry Devonport had booked for 18 people to go to Disneyland at Easter 2015, which was then pushed back to the summer. She said: 'The children were, of course, really excited. Two days before we were due to leave we had to break the news to our children that we would not be going on holiday because all of our money had gone. 'The children and ourselves were totally devastated. The girls cried and cried. 'It was a holiday we thought would put smiles on the children's faces. We felt like our heart had been ripped out. 'I collapsed because of the guilt of what I had put the family through.'\n'She claimed to be ATOL and ABTA protected, which was not true.\n'She said she was receiving a government grant to help families with low incomes, again this was not true.\n'Some customers she knew personally and some were reassured because of the successful day trips they and friends had been on.'\nTurbitt set up South Shields Day Trips in 2014 and advertised it on social media, including Facebook. Pictured, the hand-drawn logo on her Facebook page\nMr Cleasby said: 'The reality was she had not booked a single coach nor any hotel accommodation nor ferry crossing nor booked any park tickets.\n'She had got greedy and the money that had been flowing into her account, she kept it for herself, frittering it away on household items and spa breaks.'\nWhen challenged, Turbitt said she couldn't understand it and claimed the money had vanished - but still didn't admit it had vanished into her pockets.\nA Facebook post on the South Shields Day Trip page. Booking.com were not involved in any way\nA total of 368 customers had paid for holidays and not received them, 151 for Disneyland.\nProsecutors cannot prove that all 368 were fraudulent but all of the Disney ones were.\nTurbitt pleaded guilty to fraud by false representation and was given two years suspended for two years with a nine month curfew between 7pm and 7am, 240 hours unpaid work and must pay back £14,513 seized from her, under the Proceeds of Crime Act.\nIn one message, she said she was contacting the police. Booking.com were not involved in any way\nRecorder Keith Miller said the offence would 'ordinarily result in a significant custodial sentence, certainly in the case of a man'.\nGraeme Cook, defending, said: 'She set up this small business to help low income families to have trips to Flamingo Land and Legoland and the like.\n'The trips were going to happen when she started off arranging them, then she began having problems. She has no previous convictions, is remorseful and has three young children.'\nMr Cook added Turbitt has a condition which affects her blood flow and had lost a baby after pregnancy.","url":"https://www.dailymail.co.uk/news/article-4300446/Woman-stole-families-booked-trips-Disneyland.html"}
