{"authors":["Peter Lloyd For Mailonline"],"date_download":"2018-10-23 01:33:33","date_modify":"2018-10-23 01:33:33","date_publish":"2017-03-10 09:54:54","description":"A Serbian woman who went into a coma following a traumatic labour seven years ago has startled doctors by waking up to meet her daughter.","filename":"data/vaneerConsumption/WomanwhofellintoSEVENYEARcomafinallywakesup.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E22A5CD00000578-0-image-a-2_1489146896968.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4300396_Woman-fell-SEVEN-YEAR-coma-finally-wakes-up_1540258413.html","title":"Woman who fell into SEVEN YEAR coma finally wakes up","title_page":"Woman who fell into SEVEN YEAR coma finally wakes up | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman who went into a coma following a traumatic labour seven years ago has astounded doctors by waking up.\nDanijela Kovacevic, from Serbia, gave birth to a baby girl, Marija, in 2009 but lapsed into unconsciousness after developing deadly blood poisoning, sepsis.\nThe 25-year-old, from Indjija in the northern part of the country, remained in a vegetative state for years becoming one of the country's longest-surviving coma patients, but has stunned medics by waking up - and meeting her daughter for the first time.\nThe young girl is now seven years old and, in one particularly heart-warming image, is seen cuddling her mother who appears to gaze back in wonder.\nIt comes after the youngster kept an almost-constant vigil by her parent's bedside.\n'After school, Marija is close to her mama every day,' a family friend says. 'She comforts her, makes her laugh and does not give up the hope that she will touch her and embrace her.'\nScroll down for video\nTogether: Danijela Kovacevic, 25, recently emerged from her vegetative state to meet her daughter Marija, who is now seven years old\nNow, doctors in a German rehabilitation clinic, based in Pforzheim, say she has advanced to the point where she can hold a tablet and pen in her hand, as well as sit up and follow conversations.\nThe progress is a result of extensive physical and speech therapy that stimulates brain cell function.\nSerbia's Republic Health Insurance Fund approved a three-month stay in the facility, but rejected further requests because 'there is no adequate code of the disease'.\nAs a result, her family are trying to inspire donations from well-wishers who can alleviate the financial burden.\nSpecifically, the family claim they needs a further 50,000 Euros (£43,000) for the treatment to continue.\n'These are minor recoveries, but Danijela is much better that before,' her father, Djordje Kovacevic, said. 'She has put on weight, she is more aware and more alive. She reacts, smiles and gets angry.\nMoving: Danijela's daughter, Marija, is seen looking puzzled by her mother's bedside\nRecovering: Danijela in her hospital bed after showing slow, but steady, signs of progress\nBefore the tragedy: Danijela as she was before being struck down by the illness\nTHE GIRL WHO NEVER, EVER GAVE UP Born in 2010, Marija Kovacevic had no idea of the unique situation she was welcomed into. Shortly after her birth, mother Danijela developed sepsis and her heart stopped beating for thirty minutes - causing brain damage. Raised by her maternal grandparents, Djordje and Vesna, Marija then spent almost every day visiting her mother in hospital. 'She knows that her mother sleeps,' a relative said. 'She comforts her, makes her laugh and does not give up the hope that she will touch her and embrace her.'\n'The recovery of three months [which she has undergone so far] is really short,' her father added. A man who breaks an arm needs more than three months of recovery, imagine how much time my daughter needs.'\n'That is because you are [essentially] teaching a kid to do certain things. She had very hard training. She walked 800 metres and that is a big achievement.'\nRealtives have recently started a collection for Danijela’s treatment, but they fear it will not be enough.\nMr Kovacevic added: 'They organised a competition in taekwondo and all the money they gathered was for Danijela’s recovery.\n'They gave us 10,000 Euros (£8,700), but we need 50,000 more.'\nSupport: The 25 year-old sharing a hug with her mother, who is one of her main carers\nDoting dad: The mother-of-one is also seen enjoying a visit from her supportive father\nHappier times: A carefree Danijela seen before her near-death childbirth experience\nAfter school, Marija is close to mama every day. She comforts her, makes her laugh and does not give up the hope that she will touch and embrace her\nMeanwhile, Danijela's paternal grandmother, Mary Vesna, told Serbian magazine Blic that one of the biggest financial costs is, perhaps surprisingly, diapers.\n'We manage as best we can. She needs her diaper changed every three hours, each day, plus food and medicine.\n'The money people donate can help us gather ourselves and focus on her care'.\nProgress: Doctors say she can now hold a tablet in her hand, sit up and follow conversations\nFundraising: Her family are now hoping that they can find £43,000 to continue her treatment\nTHE 7P PILLS THAT CAN FIGHT SEPSIS Blood pressure pills costing just 7p a day could be a major new weapon against sepsis, researchers found in January. A study showed the drugs, called calcium channel blockers, halve the risk of dying from sepsis, which kills more than one in three victims. Millions already take the tablets, which include brands Amlostin, Adizem and Felotens, to lower blood pressure or prevent chest pain caused by angina. Dutch scientists believe the cheap pills could help slash the death toll from sepsis – higher than cancer of the breast, bowel and prostate combined. The news comes after the Mail's successful End The Sepsis Scandal campaign, which resulted in NICE recommending antibiotic treatment within the first hour of symptoms.\nA GoFundMe page, which shows she has achieved $50 of the new $50,000 goal, adds further detail of the young woman's plight.\nA description on the site says: 'Having fallen in love, she decided to give birth to a child at the age of 17, but she got sepsis during childbirth and her heart stopped beating for around half an hour.\n'Thanks to the persistence and knowledge of the anesthesiologist Dr Stanislav Milovanovic, Danijela won the first battle for her life and her heart started beating again.\n'Since then, she has no conscious communication with the environment: she can see, but does not recognise anyone, she can walk only with assistance, she can move her arms, but not the hands. She is unable to speak or to feed herself.'\nA separate Facebook page adds: 'Marija is already 7 years old and is still waiting for her mom to \"wake up\" and play with her.'\nTo donate, visit the fundraising page here","url":"https://www.dailymail.co.uk/health/article-4300396/Woman-fell-SEVEN-YEAR-coma-finally-wakes-up.html"}
