{"authors":[],"date_download":"2018-10-30 21:52:28","date_modify":"2018-10-30 21:52:28","date_publish":"2016-12-20 15:25:00","description":"A woman chased a man after he snatched her Rolex watch off her wrist outside Lenox Square mall...","filename":"data/vaneerConsumption/WomanchasesRolexthiefoutsideLenoxSquare.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/20/Images/lenoxchase%20_20161220024945059_6862704_ver1.0_640_360.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_woman-chases-rolex-thief-outside-lenox-square__1540936348.html","title":"Woman chases Rolex thief outside Lenox Square","title_page":"Woman chases Rolex thief outside Lenox Square","title_rss":"NULL","source_domain":"ajc.com","text":"A woman chased a man after he snatched her Rolex watch off her wrist outside Lenox Square mall, Atlanta police said.\nThe man got away, but the encounter was caught on camera, according to Channel 2 Action News. Police hope someone can help them find the man and two other men who were with him.\nWoman chases thieves after they stole her Rolex, police say (www.accessatlanta.com)\nAccording to an incident report, the trio trailed Oshanna Broxton, 28, to her car as she left the Neiman Marcus department store just before 8 p.m. Nov. 11.\nBroxton told police the men tried to talk to her. She refused to engage, went to her BMW and and threw her shopping bags inside the car.\nThat’s when she noticed two of the men get in a black Land Rover near her and a third wearing a black bubble jacket trying to talk to her again.\nShe got into a “verbal altercation” with the man, according to the incident report. Then, he stole the Rolex and left a small cut on Broxton’s wrist, police said.\nBroxton snapped a picture of the Land Rover’s license plate and ran after the SUV.\nAnyone with information about the theft is asked to call Atlanta police.","url":"https://www.ajc.com/news/woman-chases-rolex-thief-outside-lenox-square/528RO0kge15WzJN6TS0c1K/"}
