{"authors":[],"date_download":"2018-10-22 22:45:46","date_modify":"2018-10-22 22:45:46","date_publish":"2014-05-12 16:45:36","description":"A Massachusetts woman is facing charges of unlawful wiretapping after she allegedly recorded her own arrest via cellphone.","filename":"data/vaneerConsumption/WomanAccusedofWiretappingForAllegedlyRecordingOwnArrest.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/436871/140512-smartphone-woman-records-arrest-1403_da10b774f08fcbf6687ba274750cc0d7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_tech-news_woman-accused-wiretapping-allegedly-recording-own-arrest-n103336_1540248346.html","title":"Woman Accused of Wiretapping For Allegedly Recording Own Arrest","title_page":"Woman Accused of Wiretapping For Allegedly Recording Own Arrest","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Massachusetts woman is facing an unlawful wiretapping charge after she allegedly recorded her own arrest via cellphone.\nThe Springfield Republican reported Monday that police originally arrested Karen Dziewit, 24, on Sunday for disorderly conduct and an open container violation.\nBefore she was arrested, however, police told the newspaper that Dziewit activated the voice recorder on her cellphone, hid it in her purse and secretly taped audio of the encounter.\nPolice discovered the phone, still recording, when they went through her belongings while she was being booked at the station, the Republican reported.\nMassachusetts is a \"two-party consent\" state, which means the law states all parties must be aware that the conversation is being recorded.\nAfter finding the cellphone recording, officials added a charge of unlawful wiretapping to Dziewit's case. She denied all three charges at her arraignment on Monday, and she was released on her own recognizance, the Republican reported. A pretrial hearing was set for July 8.\nWhen contacted by NBC News on Monday, staffers at the Springfield Police Department said the people authorized to comment to press were unavailable.\nMassachusetts is the home of a landmark 2011 case involving the right to record. The First Circuit U.S. Court of Appeals ruled in Glik v. Cunniffe that to arrest someone for recording police activity in public is a violation of First and Fourth Amendment rights.","url":"https://www.nbcnews.com/tech/tech-news/woman-accused-wiretapping-allegedly-recording-own-arrest-n103336"}
