{"authors":[],"date_download":"2018-10-22 21:17:15","date_modify":"2018-10-22 21:17:15","date_publish":"2014-05-06 19:37:41","description":"A 75-year-old Missouri woman on trial in Testified Tuesday she shot her husband almost 40 years ago in a desperate effort to protect her toddler.","filename":"data/vaneerConsumption/Woman75TestifiesatHerWyomingMurderTrial.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/424311/140506-alice-uden-1526_f4c7019a4e99f24ed04c47d25e5cabf5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_woman-75-testifies-her-wyoming-murder-trial-n98516_1540243035.html","title":"Woman, 75, Testifies at Her Wyoming Murder Trial","title_page":"Woman, 75, Testifies at Her Wyoming Murder Trial","title_rss":"NULL","source_domain":"nbcnews.com","text":"Uden had been married to Holtz for only a month or two. A nurse, she met the 24-year-old Vietnam veteran while working in the psychiatric unit of a Veterans Administration hospital.\nProsecutors argue Holtz was asleep when Uden shot him in the back of the head at their Cheyenne trailer home.\nUden's attorneys say her daughter was moments from being attacked by Holtz when Uden saved her. They say Holtz had a long history of violent outbursts and drug use and became abusive soon after they married.\nHoltz had a job driving a taxi at night, Uden said, and flew into a rage when Uden's 2-year-old daughter began crying one morning while he was trying to sleep.\nUden testified Holtz knocked down Uden and stormed into the girl's bedroom. Uden said she grabbed her .22-caliber rifle from a broom closet and shot Holtz in the back of the head, from a couple feet away, as he stood at the crib.\nBut Laramie County District Attorney Scott Homar said Uden had changed her story. He said she previously told investigators she got the gun from a bedroom closet much farther from the crib — and much less readily available in the urgent situation.\n\"That's not the way it happened,\" Uden testified in court. \"I didn't go to that closet.\"\nHomar also asked Uden about a different version of events she told a Wyoming Division of Criminal Investigation agent in a September interview in Christian County, Missouri.\n\"You spontaneously, without being asked, said, 'I was terrified I was him, I was afraid of him, I shot him while he was sleeping?'\" Homar said.\n\"I don't remember,\" Uden said.\nHoltz was Uden's third husband. Investigators recovered his remains last summer from an abandoned mine shaft on a small cattle ranch between Cheyenne and Laramie.\nScott, one of Uden's sons by her first marriage, testified he has been telling police for years that his mother once told him she'd shot Holtz as he slept. He said her words haunted him. Three previous attempts by investigators to find Holtz's remains in the mine, starting in 1989, turned up no more than the bones of dead livestock and pets dumped there over the years.\nScott told jurors last week that the murder trial was the first time he'd seen Uden in 20 years.\nPolice arrested Alice Uden and her fourth and current Gerald Uden, 71, in Missouri in September. Gerald Uden has pleaded guilty to three counts of first-degree murders for shooting his ex-wife and her two children in central Wyoming in 1980.\nProsecutors haven't linked the cases, and neither Gerald Uden nor his case has been mentioned at Alice Uden's trial.\nAlice Uden's four oldest children, including Scott, were living with their father in Illinois at the time of Holtz's death. Uden testified that after she shot Holtz, she drove to the Denver area and left her youngest with her in-laws.\nShe then drove back to Cheyenne, emptied Christmas decorations out of a 55-gallon cardboard barrel and stuffed Holtz's 175-pound body inside, she said. She rolled the barrel onto the trailer porch and into her car trunk.\nAlice Uden said she tied down the trunk and drove the barrel to the Remount Ranch, where she and second husband Donald Prunty were caretakers before Prunty died in 1973.\n- Associated Press","url":"https://www.nbcnews.com/news/us-news/woman-75-testifies-her-wyoming-murder-trial-n98516"}
