{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-23 02:18:48","date_modify":"2018-10-23 02:18:48","date_publish":"2017-03-10 11:17:38","description":"Rachel Crawley, 22, from Lancashire is taking part in Miss Preston 2017 to inspire others after beating severe acne and regaining her confidence. Bullies branded her 'disease face' over skin condition.","filename":"data/vaneerConsumption/WomanwithsevereacnecompetesinMissPreston.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E22340300000578-0-image-a-49_1489142397271.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4300876_Woman-severe-acne-competes-Miss-Preston_1540261128.html","title":"Woman with severe acne competes in Miss Preston","title_page":"Woman with severe acne competes in Miss Preston | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A young woman who suffers severe bouts of acne has beaten bullies who described her face as a 'disease' - after becoming a beauty queen finalist.\nRachel Crawley, 22, from Preston, Lancashire, burrowed herself away and missed Christmas and New Year gatherings because of her breakouts that began when she was just 16.\nAfter setting up an Instagram account to bravely chronicle her skin's journey, the 22-year-old was beaten down by comments including 'disease face', 'Yuk' and others that said, 'Oh my god look at your face'.\nHowever after previously being scouted for the Miss Preston 2017 pageant when she was 18 and turning it down, Rachel is now proud to be in this year's final.\nRachel Crawley, 22, of Lancashire is now a finalist in Miss Preston 2017 after overcoming bullies who taunted her for the severe acne she suffered at the age of 16\nRachel started suffering from severe acne at the age of 16 and over the years her confidence plummeted\nRachel started an Instagram account to document her recovery as she changed her diet to improve her skin\nThe spots and deep acne scars on her jawline knocked Rachel's confidence and she admitted she would 'hate' the person looking back at her in the mirror.\n'My acne was getting me down and I was being horrible to myself,' Rachel said.\n'When I was first asked to enter the pageant, I wasn't confident enough in myself to do it.\n'I stopped going out with my friends and didn't want anyone to see me without make-up.'\nWHAT IS ACNE? Acne is a common condition that makes the skin oily and spotty, and sometimes red and painful. It has multiple triggers, including hormones, polycystic ovary syndrome and certain medications. Over-the-counter gels containing benzoyl peroxide should treat mild outbreaks, but more severe cases may require intervention such as topical antibiotics or taking the pill.\nThe admin assistant added: 'I would look in the mirror and hate the person looking back at me - so I just thought no one else would like me either.\n'I wouldn't go on nights out with my friends because of it - I even didn't go to my Aunt's house on Christmas Day and instead spent the day by myself.\n'Part of me didn't want to cover it up with make-up - I thought it made it worse and so I had really long hair to cover it.'\nHowever, a few years later Rachel decided to change her diet and began to build confidence through her Instagram page.\nThe blonde beauty uploaded her bare face to social media outlets as a 'kind-of therapy' to gauge reaction - after admitting she wouldn't even look people in the eye.\nThe blonde 22-year-old was invited to enter Miss Preston at the age of 18, but didn't have the confidence after being bullied over her skin\nRachel uploaded her bare face to social media outlets as a 'kind-of therapy', after admitting she wouldn't even look people in the eye\nFortunately, despite a few evil trolls on the social media site, young girls suffering from similar skin ailments have called her 'inspiring'.\nRachel, who is single, said: 'Girls need to understand that they are beautiful no matter what.\n'The spots have been replaced by scars but I don't feel I have to cover them up anymore.'\nSpeaking about the trolls, Rachel said: 'Trolls online are just not open minded and I think overall the views and experiences make you a stronger person.\nRachel, who works in law administration, was cruelly branded 'disease face' because of her spots\nRachel is now recovered, but at one point she refused to leave the house on Christmas Day because she so self conscious about her skin\n'Online bullies are just part of the world we live in nowadays - but just don't take any notice.\n'Deep down the Instagram page gave me the confidence to finally apply for the Miss Preston competition after people said I was inspiring.'\nRachel left school in Ashton School, Lancs., in 2011 and went straight into an apprenticeship in law administration.\nRachel hopes that entering Miss Preston will inspire other girls who have previously struggled with their confidence\nRachel cut sugar out of her diet as well as processed foods and has not suffered a breakout of acne since\nA close up of Rachel's skin shows the scarring she was left with after suffering severe acne\nRachel managed to transform her skin herself by changing her diet to eat mainly natural, raw ingredients and avoid sugar.\nShe has now not had a breakout of acne since changing her diet again after Christmas and now wants to finally go through with Miss Preston - four years after being asked.\nMiss Preston will be later crowned in April, but Rachel says she hopes just taking part in competition will help give girls who are shying themselves away the confidence they need.\nRachel was hounded by trolls on social media, but kept sharing her bare-faced selfies to inspire other girls who lack confidence\nSpeaking about the competition, she said: 'Winning would of course be amazing but it's more to show myself I can do it and hopefully give other people confidence to feel good about themselves.'\nAs part of the Miss Preston initiation, Rachel is also running a half marathon for children's charity Variety on April 9.\nShe added: 'I don't want other girls to feel the way I did - and hopefully I can show them they don't have to.'","url":"https://www.dailymail.co.uk/femail/article-4300876/Woman-severe-acne-competes-Miss-Preston.html"}
