{"authors":["Jenny Awford For Daily Mail Australia"],"date_download":"2018-10-23 00:48:58","date_modify":"2018-10-23 00:48:58","date_publish":"2016-01-11 10:39:14","description":"Karen met Martin Whitehead (pictured in red) overseas, fell 'head over heels in love' and then flew him from the UK to Australia where they married months later in a ceremony she paid for.","filename":"data/vaneerConsumption/WomanconfrontshusbandoverclaimshemarriedherforAustralianvisa.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/300974E700000578-0-image-a-13_1452513297473.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393682_Woman-confronts-husband-claims-married-Australian-visa_1540255738.html","title":"Woman confronts husband over claims he married her for Australian visa","title_page":"Woman confronts husband over claims he married her for Australian visa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the moment a wife confronted her 'love rat' husband over claims he only married her for an Australian visa and then cheated on her with eight other women.\nKaren met Martin Whitehead overseas, fell 'head over heels in love' and then flew him from the UK to Australia where they married months later in a ceremony which she paid for.\nBut over Christmas she discovered he had been cheating on her for 18 months with Lisa, who he met on a dating site, and it has since emerged he was romantically linked to a further seven women.\nA Current Affair filmed the moment Karen challenged Mr Whitehead over the allegations, asking him: 'Did you marry me for the visa...you never loved me did you?'\nScroll down for video\nKaren confronted her husband Martin Whitehead (wearing red) over claims he only married her for an Australian visa and then cheated on her with eight other women\nThe couple met overseas, fell 'head over heels in love' and Karen flew him from the UK to Australia where they married months later in a ceremony which she paid for\nShe asked him: 'Why, why did you cheat?' to which he just shrugged, smoked a cigarette and continued filming Karen and a reporter on his iPhone.\n'Not with one, not with two, not with three, not with four.... but with seven plus,' Karen continued.\n'We’re got seven. We’ve got Leisa, Lisa, Simone, Marlene, Sophie. And I’ve got it from every single one of them.'\nBut Mr Whitehead denied that he just married Karen for a permanent residency visa, saying: 'I never married you for no visa.'\nKaren challenged Mr Whitehead over the allegations, asking him: 'Did you marry me for the visa...you never loved me did you?'\nMr Whitehead denied that he just married Karen for a permanent residency visa, saying: 'I never married you for no visa'\nKaren also claimed she spent more than $200,000 on her 'sham' husband during their four-year relationship, including forking out for six holidays, paying for the wedding and buying him a boat.\n'What about what I did for you. You came her with not a single pound in your pocket and I supported you for four years,' she said in the footage.\nKaren told the program: 'He cheated on me, he’s cheated on other women and he’s cheated the system and the system needs to get him out of here now.\n'He’s just a slime, he’s been living about 15 lives, not a double life, about 15 lives.'\nShe discovered her husband had been cheating on her over Christmas when Lisa came round to their marital home to warn her.\nLisa claimed that Mr Whitehead told her he wanted to start a life with her, but that his wife was ‘suicidal’ and he didn’t want to jeopardise his visa.\nKaren also claimed she spent more than $200,000 on her 'sham' husband during their four-year relationship, including forking out for six holidays, paying for the wedding and buying him a boat\nHe allegedly started talking to other women on dating sites just weeks after he tied the knot with Karen\n'I felt awful because I knew deep down I had to do it for her,' Lisa told the show.\n'He told me that he was married, but that he was only with her for the permanent residency visa. I was smitten. I totally believed everything he said.'\nThe pair met on an online dating site just weeks after Mr Whitehead tied the knot with Karen.\nThe Department of Immigration and Border Protection has been told about the allegations and a spokesman said any information is investigated 'thoroughly'.\n'While for privacy reasons, it would be inappropriate to discuss individual cases, any person found to be involved in a false relationship for visa purposes can face serious penalties including prosecution,' a spokesman said.\n'Members of the public who have information about possible visa or migration fraud are encouraged to contact the Department.'","url":"https://www.dailymail.co.uk/news/article-3393682/Woman-confronts-husband-claims-married-Australian-visa.html"}
