{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 18:11:38","date_modify":"2018-10-30 18:11:38","date_publish":"2016-09-12 00:57:06","description":"The woman being kissed by a sailor in Times Square at the end of World War II who was the subject of an iconic V-J Day photo has died.","filename":"data/vaneerConsumption/WomanKissedbySailorinIconicVJDayPhotoDiesat92.json","image_url":"https://media.breitbart.com/media/2016/09/kiss-v-j-day-sailor-nurse-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_11__1540923098.html","title":"Woman Kissed by Sailor in Iconic V-J Day Photo Dies at 92","title_page":"Woman Kissed by Sailor in Iconic V-J Day Photo Dies at 92 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The woman being kissed by a sailor in the heart of Times Square at the end of World War II who was the subject of an iconic V-J Day photo has died.\nGreta Zimmer Friedman died Thursday at a hospital in Richmond, Virginia, at the age of 92, Fox News reported.\n“Friedman was a 21-year-old dental assistant in a nurse’s uniform” when sailor George Mendonza planted a kiss on her on Aug. 14, 1945 — the day Japan surrendered to the United States to end WWII.\n“People spilled into the New York City streets from restaurants, bars and movie theaters” on that day to celebrate the day, known as V-J Day.\nThe iconic photo by Alfred Eisenstaedt is called “V-J Day in Times Square,” but it is more commonly known as “The Kiss.” It was published in Life magazine just a few weeks later.\nAs the photo gained popularity, several people came forward claiming to be the couple in the photo before it was determined that Friedman and Mendonza were the couple.\nOver the years, the image became a cultural icon, but it has also gotten its share of controversy in recent years.\nIn 2014, feminists demanded that a statue version of the couple kissing to commemorate WWII be taken down because they say it depicted sexual assault.\nThey say it depicted sexual assault because Friedman never consented to being kissed, but Friedman has publicly said that she never made a complaint against Mendonza and maintained a friendship with him for years after.\nFriedman is set to be “buried in Arlington National Cemetery, next to her late husband, Dr. Misha Friedman.”","url":"https://www.breitbart.com/politics/2016/09/11/woman-kissed-sailor-iconic-v-j-day-photo-dies-92/"}
