{"authors":[],"date_download":"2018-10-30 20:33:10","date_modify":"2018-10-30 20:33:10","date_publish":"2015-08-27 16:09:08","description":"Hayley Hill, the pregnant 23-year-old who lost her baby when her boyfriend shot her and dumped her from a speeding pickup during a wild police pursuit, has died, Mike Ayers, special agent in charge for the Georgia Bureau of Investigation said.","filename":"data/vaneerConsumption/WomandiesafterlosingbabyinOglethorpeshooting.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/08/27/Images/photos.medleyphoto.8034115.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_woman-dies-_f6687d2097484d1d73e22ea0f37a7c41__1540931590.html","title":"Woman dies after losing baby in Oglethorpe shooting","title_page":"Woman dies after losing baby in Oglethorpe shooting","title_rss":"NULL","source_domain":"ajc.com","text":"Hayley Hill, the pregnant 23-year-old who lost her baby when her boyfriend shot her and dumped her from a speeding pickup during a wild police pursuit, has died, Mike Ayers, special agent in charge for the Georgia Bureau of Investigation said.\nHill had been hospitalized with injuries she sustained during the dramatic and tragic chase that began with a domestic disturbance and ended with a shootout at a remote logging camp.\nRyan Arnold, the man who police allege shot Hill, has been charged with feticide as well as three counts of aggravated assault and kidnapping with bodily injury, according to police. He has not been charged with murder, Ayers said.\nAuthorities say Arnold shot Hill and dumped her from the truck he was driving as police chased him Monday morning in Oglethorpe County.\nThe incident began with a domestic disturbance at a residence in Oglethorpe County on Sunday. Deputies at the scene saw Arnold run away while firing a weapon in the air, the authorities said.\nPolice went back to Arnold’s home Monday, but Arnold, who initially barricaded himself inside, fled with Hill in his truck.\nAfter dumping Hill on the roadway, Arnold led police on a chase in which gunfire was exchanged. Arnold eventually abandoned his truck at a logging site. There, police said, he climbed into a logging truck and ordered the driver, Paul Davis, 58, of Danielsville, to crash through a police roadblock that had been established in the area.\nDavis resisted and Arnold took over, slamming the truck into the police cars himself, according to police. More gunfire was exchanged, and Arnold and Davis were both wounded.\nDavis was shot five times, according to the truck driver’s son. Brandon Davis, who said his father fought Arnold as the 18-wheeler loaded with timber headed toward the blockade.\nIt was still not clear on Thursday whether Davis was shot by police or by Arnold. The GBI is continuing its investigation into the shooting.\nArnold remained in the hospital Thursday, Ayers said.\nHe also said the GBI is performing an autopsy on Hill’s body at its headquarters in Atlanta.","url":"https://www.ajc.com/news/crime--law/woman-dies-after-losing-baby-oglethorpe-shooting/q5ZIpCk76mtvwpZ9nofZPL/"}
