{"authors":["Australian Associated Press"],"date_download":"2018-10-23 03:08:40","date_modify":"2018-10-23 03:08:40","date_publish":"2017-03-10 12:37:43","description":"A woman was seen bursting out a hospital bathroom stating 'I tried to kill my baby' the same day Ashleigh Watterson is alleged to have tried to kill her child, a Brisbane court has heard.","filename":"data/vaneerConsumption/Womanswordsafter21montholddaughterfounddead.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E22752500000578-0-image-a-21_1489144688326.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300886_Woman-s-words-21-month-old-daughter-dead_1540264120.html","title":"Woman's words after 21-month-old daughter found dead","title_page":"Woman's words after 21-month-old daughter found dead | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman was seen bursting out a hospital bathroom stating 'I tried to kill my baby' the same day Ashleigh Watterson is alleged to have tried to kill her child, a court has heard.\nWatterson is on trial in the Brisbane Supreme Court after pleading not guilty to twice attempted murder of her daughter Sarah in late 2010.\nSarah died from undetermined causes in March 2012, aged 21 months.\nAshleigh Watterson (pictured) is on trial in the Brisbane Supreme Court after pleading not guilty to twice attempted murder of her daughter Sarah in late 2010\nPhillip Denmeade, whose daughter was being treated in the same ward as Sarah, told the court on Friday he was watching TV in the parents' lounge when he saw a woman, whose described appearance is similar to Watterson, burst out of the bathroom with a baby.\n'She said 'I tried to kill my baby... it's just breathed',' Mr Denmeade, who added the woman said it in a 'conversational tone', said.\nThe court had earlier heard Watterson had taken Sarah for a walk that same day but when she returned to the ward the child wasn't breathing.\n'I thought she was gone and then she took a breath,' Watterson told a nurse through tears.\n'I was holding her, I looked down and she was blue.\nSarah died from undetermined causes in March 2012, aged 21 months\nThe court had earlier heard Watterson had taken Sarah for a walk that same day but when she returned to the ward the child wasn't breathing\nThe court had heard no medical condition could be identified to explain why Sarah suffered repeated episodes of apnoea - a temporary loss of breathing\n'I went to the toilet, I just wanted to sit with her then she took a breath and I ran down here.'\nThe court heard Watterson told a meeting of medical staff only hours earlier that she wanted a 'not-for-resuscitation' order put in place for her daughter.\nPaediatrician Bruce Goodwin sad while Watterson's request didn't raise his suspicions, he was surprised as it was normally a matter brought up by medical professionals.\nHe said it was also unnecessary for Watterson to decide at the time as they did not yet know the long-term prognosis for Sarah, who was brain damaged from a lack of oxygen.\n'I thought it was unusual at that stage,' Dr Goodwin said.\nHe said he asked Watterson to discuss the matter with Sarah's father, Mark Watterson, who wasn't at the meeting, but she replied they had already agreed they did not want advanced life support.\nThe court had heard no medical condition could be identified to explain why Sarah suffered repeated episodes of apnoea - a temporary loss of breathing - but her injuries meant she would remain like a newborn for the rest of her life.\n'There was no smiling, no purposeful movements, she had very poor vision,' Dr Goodwin said.\nThe trial before Justice Glenn Martin will continue on Monday.","url":"https://www.dailymail.co.uk/news/article-4300886/Woman-s-words-21-month-old-daughter-dead.html"}
