{"authors":[],"date_download":"2018-10-22 21:54:29","date_modify":"2018-10-22 21:54:29","date_publish":"2014-06-06 21:33:25","description":"An Ohio woman whose medical record was posted to Facebook, revealing a syphilis diagnosis, has sued the hospital where she was treated.","filename":"data/vaneerConsumption/WomanSuesAfterSTDDiagnosisPostedonFacebook.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_woman-sues-after-std-diagnosis-posted-facebook-n124936_1540245269.html","title":"Woman Sues After STD Diagnosis Posted on Facebook","title_page":"Woman Sues After STD Diagnosis Posted on Facebook","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAn Ohio woman whose medical record was posted to Facebook, revealing her name and a syphilis diagnosis, has sued the hospital where she was treated and the worker who accessed her information.\nThe 20-year-old Cincinnati woman, who filed the lawsuit this week in Hamilton County court, said that the events of the case were set in motion in September, when she refused to tell her ex-boyfriend why she was being treated at the University of Cincinnati Medical Center.\nHer ex-boyfriend, identified as Raphael Bradley, 28, then contacted another woman he was romantically involved with who worked at the hospital, according to the lawsuit. That woman, identified as Ryan Rawls, looked up the woman's medical record and gave it to Bradley, according to the lawsuit.\nIt was then posted to a Facebook page about allegedly promiscuous women, the lawsuit said.\n\"It couldn't be more egregious in my estimation, and the University of Cincinnati Medical Center owes a duty to their patients to ensure this doesn't happen,\" said Mike Allen, the Cincinnati attorney who's representing the woman who filed the lawsuit. \"They can't hide behind a shield of, 'This employee was acting outside of the scope of their responsibilities.' If that's going to be their defense at trial, I'm looking forward to the trial.\"\nThe Associated Press is not naming the woman who filed the lawsuit because the case involves her private medical records.\nHospital spokeswoman Diana Lara said Friday that Rawls, who worked in the billing department, was fired within days of the hospital learning of the Facebook post last year and that the case was forwarded to federal authorities because Rawls was found to have violated federal privacy laws regarding medical information.\nThere is no record of any federal or local criminal charges pending against her. Rawls had an unlisted number and an attorney has not been listed for her in the lawsuit. Bradley's phone number rang unanswered Friday.\nLee Ann Liska, president and CEO of the hospital, said in a statement that all employees have been reminded that the unauthorized access or sharing of medical records is a betrayal of trust with patients \"and cause for immediate termination.\"\n\"We are outraged that anyone might misuse a position with UC Health to attempt to embarrass or cause harm to another person,\" Liska said. \"This is contrary to our ethic and the training we provide to our associates, and we took immediate action as a result.\"\nThe lawsuit names the hospital, Rawls and Bradley. It seeks a minimum of $25,000, saying that since the Facebook post, the woman has lost friends, been harassed about her medical condition and has suffered extreme emotional distress.\n—The Associated Press","url":"https://www.nbcnews.com/news/crime-courts/woman-sues-after-std-diagnosis-posted-facebook-n124936"}
