{"authors":[],"date_download":"2018-10-30 20:38:17","date_modify":"2018-10-30 20:38:17","date_publish":"2015-10-14 18:32:38","description":"A female driver was rear-ended by a stolen vehicle near Midtown on Sunday — and then carjacked by one of its passengers, Atlanta police said.","filename":"data/vaneerConsumption/WomanrearendedthencarjackednearMidtown6arrestsmade.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_woman-rear-_e8aa9162aa74dba40aff44dc7cbd07cd__1540931897.html","title":"Woman rear-ended - then carjacked - near Midtown; 6 arrests made","title_page":"Woman rear-ended — then carjacked — near Midtown; 6 arrests made","title_rss":"NULL","source_domain":"ajc.com","text":"A female driver was rear-ended by a stolen vehicle near Midtown on Sunday — and then carjacked by one of its passengers, Atlanta police said.\nThe incident, and six subsequent arrests, come amid growing crime concerns among Midtown residents.\nAccording to the police incident report, the victim was driving on Avery Drive NE preparing to turn onto Beverly Road when she was rear-ended by a silver Jeep Liberty with four men inside. The victim got out of her car and attempted to speak with the driver of the Liberty, but he did not roll down his window.\nThe driver-side passenger then got out and “jumped into” the victim’s Ford Escape, police said. Both vehicles drove off.\nThe victim’s purse, iPhone and iPad were inside the car, which has not been recovered. The Jeep Liberty was discovered to be stolen, police said.\nAtlanta police Sgt. Warren Pickard confirmed Wednesday that six arrests had been made in connection with the case, but could not provide further details. It was unclear how all six suspects were tied to the incident.\nOn Tuesday night, Atlanta Mayor Kasim Reed hosted a townhall meeting in Midtown, giving the neighborhood’s residents a chance to express their frustration over the carjackings, robberies and break-ins that many said had become routine.\nAt the meeting, Reed laid out a multi-pronged plan to battle the increase in crime — a plan that includes deploying supervisors to increase the number of officers on the street, as well as a special detail to conduct sweeps around Piedmont Park.\nThat special detail was expected to announce its presence in the park by conducting two “public roll calls” on Wednesday.\n“We want our citizens to know that we are actively engaged in fighting crime in our city, and are aggressively exploring new strategies,” APD spokeswoman Beth Espy said in an email announcing the roll calls.","url":"https://www.ajc.com/news/crime--law/woman-rear-ended-then-carjacked-near-midtown-arrests-made/aQzOF24dujRtJLtX8prDwI/"}
