{"authors":[],"date_download":"2018-10-30 20:16:31","date_modify":"2018-10-30 20:16:31","date_publish":"2016-02-27 00:27:27","description":"Police are looking for a woman who posed as an Emory University Hospital employee to bilk a would-be car buyer out of a few hundreds dollars, Channel 2 Action News reported.","filename":"data/vaneerConsumption/WomanimpersonatesEmoryhospitalworkertoswindlecar.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/02/12/Images/photos.medleyphoto.8289052.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_cops-woman-imper_9777fe0ee7f8bfaef99a9c3c8639f025__1540930591.html","title":"Woman impersonates Emory hospital worker to swindle car...","title_page":"Cops: Woman impersonates Emory hospital worker to swindle car...","title_rss":"NULL","source_domain":"ajc.com","text":"Police are looking for a woman who posed as an Emory University Hospital employee to bilk a would-be car buyer out of a few hundreds dollars, Channel 2 Action News reported.\nSunny Bailey was in the market for a car and turned to Craigslist where she saw an ad for a $1,500 Honda. Bailey told Channel 2 she contacted the seller about the car and felt comfortable meeting with the woman to check out the vehicle.\nOn Feb. 6, Bailey, a mechanic and a friend met the woman at Emory University Hospital’s Midtown campus on Peachtree Street.\n“The woman was dressed just like a nurse or doctor,” Bailey said.\nThe woman allegedly handed Bailey a car key and told her to go to the fourth floor of the parking garage to test drive the car, but said she would need $400 as collateral.\nBailey said she headed into the parking garage before realizing there was no fourth floor. The key was fake, and the woman was long gone.\n“You should have seen the look on my face. Oh my God,” she told Channel 2.\nBailey reported the incident and was able to give police a description of the woman. Emory police told Channel 2 the scheme was all an act and that they have the woman, who changed clothes, on video.\nBailey wasn’t the first victim, police said.","url":"https://www.ajc.com/news/local/cops-woman-impersonates-emory-hospital-worker-swindle-car-buyer/0zwZMcWPXU7HJEHDj5YwgN/"}
