{"authors":["Mark Duell For Mailonline"],"date_download":"2018-10-23 00:27:08","date_modify":"2018-10-23 00:27:08","date_publish":"2017-04-26 10:03:22","description":"Leah Mallett, 18, of Leeds, said she was shocked to remove the ready meal's cardboard sleeve and find the campaign sticker concealed inside on the cellophane.","filename":"data/vaneerConsumption/WomanfindsantimeatstickeronMorrisonsbolognaise.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9DD9CA00000578-0-image-a-37_1493197619320.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446806_Woman-finds-anti-meat-sticker-spaghetti-bolognaise_1540254428.html","title":"Woman finds anti-meat sticker on Morrisons bolognaise","title_page":"Woman finds anti-meat sticker on Morrisons bolognaise | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Beauty therapist Leah Mallett claims she 'felt sick' after being 'emotionally blackmailed'\nA beauty therapist was horrified to discover an 'emotional blackmail' anti-meat sticker proclaiming to be from a cow named Chloe on the packet of her Morrisons spaghetti bolognaise.\nLeah Mallett, 18, said she was shocked to remove the ready meal's cardboard sleeve and find the campaign sticker concealed inside on the cellophane.\nThe note depicted a distressed-looking cow with the words: 'My name was Chloe. I wanted to live! Your \"personal choice\" killed me. DON'T BUY IT!'\nThe meat-eater from Leeds slammed the sticker, which she said she found on her lunch on Friday, as an 'aggressive guerrilla tactic' that was similar to emotional blackmail.\nMiss Mallett said: 'I felt really horrible. Someone had put it there to make them feel like that. I've seen and understand people's opinions on eating meat.\n'But doing something aggressive like that is almost like [emotional] blackmailing. It made me feel quite sick. I didn't really feel like I wanted to eat that meal after that.\nMiss Mallett said she was horrified to remove the cardboard sleeve to an Italian spaghetti Bolognese and discover the 'guerrilla' campaign sticker concealed inside on the cellophane\nMiss Mallett criticised the sticker, which she said she found on her lunch from Morrisons\n'I didn't know what it was at first when I opened it, it didn't look part of the ready meal at all. Then I realised it was a sticker and just saw this picture of a cow.\n'I was really shocked. I called for [my boss] Charlotte to come and have a look.'\nCharlotte Eldon, 32, who has worked with her for two and a half years, was equally taken aback by the image of a sad-eyed cow seemingly accusing them of killing it.\nMs Eldon, from Horsforth, said: 'I didn't know what it was at first. When I picked it up and realised it was a cow I threw it back down. It did shock me. I was scared, almost.\n'For me it was the picture of the cow and how they had written their message. It was very shocking, but also a very aggressive way to get their message across.'\nThe meal was allegedly picked up by Miss Mallett's family at the Morrisons store in Horsforth earlier in the week before she opened it up for her Friday lunch at work.\nThe meal was allegedly picked up by Miss Mallett's family at the Morrisons store in Horsforth, West Yorkshire, earlier in the week before she opened it up for her Friday lunch at work\nSingle Miss Mallett said: 'My dad bought the meals, we usually have them in the freezer. We always shop at Morrisons as it's always known to be good.\n'We've still got a couple more in the freezer at home but I haven't checked them yet to see if they had the stickers too. We contacted Morrisons and they said they were sorry.\nI felt really horrible. Someone had put it there to make them feel like that Leah Mallett\n'We do wonder if anything was resolved - whether they found out if it was a member of staff that had put it there, or if it was a customer. You'd think they could have been caught on CCTV in the shop doing it.'\nHowever, the controversial message has been unsuccessful in converting Miss Mallett and Ms Eldon to a meat-free diet.\nMiss Mallett said: 'It did put me off eating that meal, but it hasn't stopped me eating meat. You'd think they might have gone for some of the more obvious meat products like bacon.'\nA Morrisons spokesman said: 'Somebody has put a sticker for their campaign on the outside of a product in one of our stores. It doesn't appear to be a wider issue than that.'","url":"https://www.dailymail.co.uk/news/article-4446806/Woman-finds-anti-meat-sticker-spaghetti-bolognaise.html"}
