{"authors":[],"date_download":"2018-10-30 20:25:37","date_modify":"2018-10-30 20:25:37","date_publish":"2015-11-17 02:53:22","description":"A woman was run over and killed in a Wal-Mart parking lot in Covington by the man who snatched her purse, police said.","filename":"data/vaneerConsumption/WomanrunoverkilledinWalMartparkinglotafterpurse.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/17/Images/photos.medleyphoto.8397753.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_woman-run-o_5526129f17e39b2b928d2c8b3fa40ce3__1540931137.html","title":"Woman run over, killed in Wal-Mart parking lot after purse...","title_page":"Woman run over, killed in Wal-Mart parking lot after purse...","title_rss":"NULL","source_domain":"ajc.com","text":"A woman was run over and killed in a Wal-Mart parking lot in Covington by the man who snatched her purse, police said.\nOfficers responded to a robbery call Monday around 7:45 p.m. at 10300 Industrial Boulevard, just off Exit 95 on I-20 eastbound.\nWhen they arrived, they found a woman approximately 65 years old who was lying in the parking lot after being struck by a vehicle multiple times, Capt. Craig Treadwell with Covington police told The Atlanta Journal-Constitution.\n“It’s a brutal crime,” he said.\nThe suspect took the woman’s white or tan purse, jumped in his vehicle and ran over her more than once as he escaped, Treadwell said. He fled the scene in a silver or gray mid- to late-1990s Honda Accord that may have a dealer drive-out tag, according to police.\nThe injured woman was transported to Newton Medical Center, where she died, police said. Her name has not been released pending notification of next of kin.\nThe suspect was described as a man with a dark goatee who weighs 250 to 300 pounds, Treadwell said. He was wearing a dark-colored hoodie, blue jeans and white tennis shoes. A woman was in the passenger’s seat of his vehicle as he left the parking lot.\nAuthorities pulled surveillance footage of the parking lot in a search for more information Monday night, Treadwell said.\n“We’re looking for help to solve this,” he said.","url":"https://www.ajc.com/news/crime--law/woman-run-over-killed-wal-mart-parking-lot-after-purse-snatched/svLhwACPQGIFuLEHrw0U8J/"}
