{"authors":["Jennifer Smith For Dailymail.Com"],"date_download":"2018-10-23 05:25:04","date_modify":"2018-10-23 05:25:04","date_publish":"2017-03-16 16:23:04","description":"Police are looking for the woman who lashed out at staff in the fast food restaurant in Jonesboro, Georgia.","filename":"data/vaneerConsumption/WomanthrowsunderseasonedfriesbackatZaxbysstaff.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E559FA000000578-0-image-a-85_1489682235098.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320682_Woman-throws-seasoned-fries-Zaxby-s-staff_1540272304.html","title":"Woman throws 'under seasoned' fries back at Zaxby's staff","title_page":"Woman throws 'under seasoned' fries back at Zaxby's staff | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An outraged Zaxby's customer was filmed hurling her fries at staff because they were under-salted.\nPolice are looking for the woman who lashed out at staff in the fast food restaurant in Jonesboro, Georgia.\nSurveillance footage shows her throwing two meals back at them and also damaging a computer at the register.\nScroll down for video\nThe woman was filmed holding the black tray which contained the fries (left) before hurling it back over the counter at Zaxby's in Jonesboro, Georgia\nPolice told WSBTV that the woman ordered the food to go and paid for it alone.\nThirty seconds after leaving the restaurant, she returned furiously with a male companion to complain.\nShe screamed obscenities at police before launching the food, which she said was under-seasoned, back over the counter.\n'The French fries did not have enough seasoning salt on them,' Detective Stefan Schindller said.\nThe woman then pushed over the computer cash register while her male companion watched on\nThe surveillance footage also showed her shoving the digital cash register before storming out.\nOther customers watched the outburst in shock while the woman's male companion stood calmly beside her.\nDetectives are now trying to find the woman. They say she may face charges for damaging the computer.","url":"https://www.dailymail.co.uk/news/article-4320682/Woman-throws-seasoned-fries-Zaxby-s-staff.html"}
