{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-23 00:54:58","date_modify":"2018-10-23 00:54:58","date_publish":"2016-01-11 11:07:15","description":"Julie Hope, 46, from Stone, Staffordshire, launched an extraordinary fundraising drive to allow Helen Hutchinson, 49, to remain in her family home while paying for £4,000-a-month medication.","filename":"data/vaneerConsumption/WomansfriendlaunchesfundraisingappealtopayfortreatmentcutbytheNHS.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/2FFAB29200000578-0-image-a-5_1452506315017.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3387018_Mother-s-friend-launches-50-000-fundraising-appeal-pay-treatment-cut-NHS-faced-selling-house_1540256098.html","title":"Woman's friend launches fundraising appeal to pay for treatment cut by the NHS","title_page":"Woman's friend launches fundraising appeal to pay for treatment cut by the NHS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman is appealing to the kindness of strangers in a desperate bid to fund life-saving treatment for her friend who has terminal cancer.\nJulie Hope, 46, from Stone, Staffordshire, has launched a Just Giving page to raise £30,000 so that her friend Helen Hutchinson, 49, can pay for cancer treatment that is not available on theNHS and have more time with her young son without selling her house.\nHelen Hutchinson, 49, also from Stone, was diagnosed with bowel cancer in 2012 and despite having an operation to remove the tumour learned last year that the disease had spread to her lungs and was terminal.\nJulie Hope, 46 (right), pictured with Helen Hutchinson, 49 (centre) and a friend, is crowdfunding to raise money for vital cancer treatment so that Helen can stay alive for longer and spend more time with her family\nWriting on her JustGiving page, Julie explains: 'We're raising £30,000 to fund treatment to enable a child to keep his Mum, because because it is not available on the NHS in England.\n'When you are terminally ill you should not be worrying about trying to find monies to fund your own treatment so that you can see your child grow older. There is no price on life.'\nHelen has been paying £2,000 a fortnight for the cancer drug Aflibercept privately just to prolong her life so she has more time with her eight-year-old son Freddie and partner Michael.\nShe's opted for further gruelling treatment rather than 'go on lots of nice holidays' as doctors initially advised her after the told her there was nothing more they could do.\nJulie is hoping, through a series of fundraising pages on JustGiving.com, to raise a total amount of £50,000 which will help fund her friend Helen's treatment after her bowel cancer spread to her lungs\nHelen is mum to Freddie, eight (pictured), and her friend Julie is determined to allow the family more time together by raising money for private cancer treatment\nBut costs are mounting with numerous add-ons to consider such as renting out a room at the private clinic, paying for private prescriptions, and the cost of saline solution used in the treatment.\nJulie, who has known Helen for six years, was heartbroken to hear her friend was considering selling her house so decided to step in.\nShe set up a series of pages on the crowdfunding website JustGiving, and intends to raise £50,000 - a sum that could fund Helen's treatment for over a year.\nJulie told FEMAIL: 'Helen is like an angel on earth. She's always got a smile on her face and everyone has nothing but nice things to say about her.'\nJulie described friend Helen (pictured, with Freddie) as 'an angel on earth' who always has a smile on her face\nThe most recent page has raised just over £1,000, but Julie said people had helped raise a total of more than £37,000 in the last three months, including donations of hundreds of pounds from total strangers\nShe believes this is why people have donated £37,000 - almost 80 per cent of the target - in just three months.\nHelen had exhausted all her savings on the treatment, but she is now able to keep her house and spend more time with her family.\nJulie said that even total strangers had donated hundreds of pounds.\n'It's reinforced my faith in human nature,' she said. 'We don't know how long Helen has left, but the longer she can spend with her son, the better.'\nHelen told the Stoke Sentinel: 'The generosity and love and support has touched mine and my family's hearts. All we can do is thank them which doesn't quite seem enough.'","url":"https://www.dailymail.co.uk/femail/article-3387018/Mother-s-friend-launches-50-000-fundraising-appeal-pay-treatment-cut-NHS-faced-selling-house.html"}
