{"authors":[],"date_download":"2018-10-22 20:58:50","date_modify":"2018-10-22 20:58:50","date_publish":"2014-06-03 20:09:43","description":"The witness, Kathryn McDonough, is serving a prison sentence for lying to investigators about Elizabeth Marriott's 2012 disappearance and death.","filename":"data/vaneerConsumption/WomanSaysExBoyfriendStrangledNewHampshireStudent.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/485276/140603-kathryn-mcdonough-1604_052caaf44f4d5db67a54e172185c381b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_woman-says-ex-boyfriend-strangled-new-hampshire-student-n121641_1540241930.html","title":"Woman Says Ex-Boyfriend Strangled New Hampshire Student","title_page":"Woman Says Ex-Boyfriend Strangled New Hampshire Student","title_rss":"NULL","source_domain":"nbcnews.com","text":"McDonough, 20, is the key witness against 31-year-old Mazzaglia, who is charged with first-degree murder. His trial, which began last week, is plumbing the sexual relationship between McDonough and Mazzaglia, including their obsession with bondage, discipline and sadomasochism and their practice of inviting others to join them.\nMazzaglia's lawyers told jurors that McDonough killed 19-year-old Lizzi Marriott of Westborough, Massachusetts, during rough sex involving restraints. They say Mazzaglia helped dispose of her body and initially took blame out of his obsessive love for McDonough. They say McDonough was the dominatrix, a woman who made Mazzaglia her sexual slave and obsessed with finding another woman to dominate.\nProsecutors portray McDonough as a sexual submissive, dominated in all aspects of their relationship by a man 10 years older than her.\nMcDonough was 17 when she met Mazzaglia at tryouts for a theater production.\nShe testified at length Tuesday about how he pressured her to move in with him while she was still in high school and to sever her ties with \"mother dragon\" — his name for her mother. She said she had intended to move in after she graduated but relented in February when his messages became more ominous.\nShe also testified about their sex life, saying Mazzaglia was always dominant.\nMere months after McDonough graduated, on Oct. 9, 2012, Marriott died in their Dover apartment.\nMarriott had transferred to the University of New Hampshire only weeks earlier to major in marine biology. She was a commuter student, living with her aunt and uncle in Chester during the week and returning home to Westborough most weekends.\nMarriott met McDonough at a department store not far from the UNH campus where they both worked. On the night she died, Marriott texted her girlfriend that she was going over to \"Kat's\" to watch a movie. It was Marriott's last communication.\nMcDonough is serving a 1-1/2 to three-year sentence for conspiracy and hindering prosecution.\nDefense attorney Joachim Barth told jurors during his opening statement that McDonough bargained her concocted story of what happened that night in exchange for time off her sentence, and that testifying against Mazzaglia is part of her plea deal.\nBob Marriott, the victim's father, said at her sentencing last July that the family grudgingly accepted the plea deal to further the prosecution of Mazzaglia.\n--The Associated Press","url":"https://www.nbcnews.com/news/crime-courts/woman-says-ex-boyfriend-strangled-new-hampshire-student-n121641"}
