{"authors":[],"date_download":"2018-10-30 20:08:11","date_modify":"2018-10-30 20:08:11","date_publish":"2017-03-14 21:25:46","description":"DeKalb County police are investigating after a 26-year-old man was gunned down outside an apartment complex.","filename":"data/vaneerConsumption/WomanwalkingdogstumblesupondeadmanatDeKalbapartments.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/MyAJC/2014/12/30/Images/photos.medleyphoto.12253389.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_woman-walking-do_d7c14c42c145ea5bd29a8120beec64b7__1540930091.html","title":"Woman walking dog stumbles upon dead man at DeKalb apartments","title_page":"Woman walking dog stumbles upon dead man at DeKalb apartments","title_rss":"NULL","source_domain":"ajc.com","text":"DeKalb County police are investigating after a 26-year-old man was gunned down outside an apartment complex.\nReginald Poole Jr., of the Dry Branch community in middle Georgia, was found face down in the grass Saturday at the Haverly at Stone Mountain, authorities said Tuesday.\nHe died of a gunshot wound in a homicide at the apartments off Memorial Drive, the medical examiner’s office said.\nA woman told police she was walking her dog around 8 a.m. when she saw the body. She thought he was drunk or sleeping but then saw blood coming from his mouth and called 911, the police report said.\nAnother woman said she heard three gunshots at 3:15 a.m., and saw three men get into an old grey van.\nOne of the men then got something from a Toyota Camry while another yelled: “Hurry up, come on, come on,” the witness said.\nLater in the morning, the van and Camry were gone, but Poole’s Honda Accord remained in the parking lot. The glove compartment was open and in “disarray,” with the car unlocked, the report said.\nThough his address was Dry Branch, the medical examiner’s office believes Poole may have been living in the Stone Mountain area.\nPolice haven’t said if any suspects have been identified.\nFurther information hasn’t been released.","url":"https://www.ajc.com/news/local/woman-walking-dog-stumbles-upon-dead-man-dekalb-apartments/IdWaVfsV4Ke214NkBh01EJ/"}
