{"authors":["Harriet Mallinson For Mailonline"],"date_download":"2018-10-23 01:01:57","date_modify":"2018-10-23 01:01:57","date_publish":"2016-01-28 15:08:44","description":"CCTV footage from a shop in Winnipeg, Canada captured a woman, possibly in pajamas, faking a seizure before stealing a donation box. Some believe she may have been on drugs.","filename":"data/vaneerConsumption/WomaninWinnipegfakesaseizureinashopbeforestealingthedonationbox.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB05CD00000578-0-image-a-80_1453991800708.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420870_Woman-Winnipeg-fakes-seizure-shop-stealing-donation-box_1540256517.html","title":"Woman in Winnipeg fakes a seizure in a shop before stealing the donation box","title_page":"Woman in Winnipeg fakes a seizure in a shop before stealing the donation box | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is shocking moment a woman collapse in a store - only to recover and swipe a donation box when no one is looking.\nT he CCTV footage is filmed in a shop in Winnipeg, Canada and shows the woman, who looks to be dressed in pajamas, as she strides in carrying a bag and a walking stick.\nHowever, a few paces in she seemingly suffers a nasty fit.\nActing? CCTV footage in a shop in Winnipeg, Manitoba, Canada captured a woman striding confidently into a shop and then faking a seizure before stealing a donation box\nWoman down: A few paces in she seemingly suffers a nasty fit. Eyes wild and shaking uncontrollably, she drops her stick and collapses onto the floor\nEyes wild and shaking uncontrollably, she drops her stick and collapses onto the floor.\nShe lies convulsing as a man and a woman rush over to help her.\nThe video then cuts to the woman standing by the till, perhaps 'recovering'.\nWhen a nearby man walks off and she is left alone, her hand rests on the donation box.\nShe casually plays with it and then peers in presumably to see how much is inside.\nDecision made, she downs the walking stick, opens up the bag and slides in the box.\nThe woman then put her bag back on her shoulders and wanders off nonchalantly.\nOnline commentators have been quick to respond: 'That was some bad acting but it looks like she's done this a few times before', and 'the epitome of no shame.'\nSome believe the woman is on drugs: 'Typical dopehead really, stealing for her daily fix. They all get caught'.\nOthers joked: 'She probably swiped that cane from the previous store she went to.'\nWhat's in here? The video cuts to the woman standing by the till, perhaps 'recovering'. When a nearby man walks off and she is left alone, her hand rests on the donation box. She casually plays with it and then peers in presumably to see how much is inside","url":"https://www.dailymail.co.uk/news/article-3420870/Woman-Winnipeg-fakes-seizure-shop-stealing-donation-box.html"}
