{"authors":["Bianca London For Mailonline"],"date_download":"2018-10-23 02:21:29","date_modify":"2018-10-23 02:21:29","date_publish":"2016-01-29 16:46:05","description":"Georgie Aves, 26, from Rotherhithe, London, opted for what she thought was a harmless £1,200 cosmetic treatment to 'rejuvenate' her skin. However, she claims she suffered a reaction to it.","filename":"data/vaneerConsumption/WomanisleftwithfacialcystsandacneafterhavingCO2laserskintreatment.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B407A800000578-0-image-a-82_1454082899375.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422879_Woman-26-left-giant-cysts-acne-covering-face-having-reaction-1-200-chemical-peel-freshen-skin_1540261289.html","title":"Woman is left with facial cysts and acne after having CO2 laser skin treatment","title_page":"Woman is left with facial cysts and acne after having CO2 laser skin treatment | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A design consultant says she is afraid to be seen in public after a reaction to a laser 'chemical peel' facial left her face disfigured with acne.\nGeorgie Aves, 26, from Rotherhithe, London, opted for what she thought was a harmless £1,200 cosmetic treatment to 'rejuvenate' her skin.\nBut the blonde - who was once the life and soul of the party - claims she suffered an allergic reaction and has been left with scars and cysts.\nGeorgie Aves, 26, from London, had C02 laser treatment, which has left her with acne and scaring and now she is afraid to be seen in public after the reaction to a laser 'chemical peel' facial left\nGeorgie, left, before the treatment, and, right, after, opted for what she thought would be a cosmetic treatment to 'rejuvenate' her skin\nNow she struggles to leave her house and says she has even finished with her boyfriend of two years because she can't bare the way she looks.\nGeorgie, who had the treatment at the Harley Street Skin Clinic in London, said: 'I look back at photos before and realise that I didn't even need this treatment - my skin was absolutely fine.\n'I now have permanent scarring on my face and acne that even make-up fails to cover up.\n'My confidence suffered such a blow, I felt as though I had no choice but to push away my boyfriend.\n'I'm truly devastated and can't stand to look in a mirror.'\nGeorgie admits she has always fussed over her appearance and feared her face was getting tired and sagging when she opted to have the treatment.\nShe said: 'I'd notice changes and constantly dwell on them.\n'No one likes to think they are getting older and I guess I couldn't stop thinking about having a freshen up. I just wanted to look my best.'\nThe design consultant now struggles to leave her house and has even finished with her boyfriend of two years because she can't bare the way she looks\nShe said she now looks back at photos before and realises that she didn't even need this treatment and that her skin was absolutely fine, pictured\nGeorgie's skin got worse and she turned into a 'recluse', refusing to go out. She made a panicked call to the clinic, which prescribed antibiotics. Four weeks later, she returned for her second appointment - and says the doctor refused to carry on with the treatment\nLast year she started googling chemical face peels and decided to be treated at Harley Street Skin Clinic.\nIn May she went to the clinic for her first consultation about getting a chemical peel to freshen up her face and was advised that a C02 laser treatment would be best.\nThe three 20-minute sessions - costing £1,200 - promised to laser off the top layer of her skin, taking just 20 minutes a time.\nGeorgie was given an appointment with a doctor who she was told regularly performs the treatment to find out more.\nShe agreed to go ahead, starting the treatment in July.\nGeorgie was warned she would experience mild scabbing and was given an intensive moisturising cream, but assured her skin would be glowing within two weeks.\nBut a fortnight later she alleges the minor scabbing had intensified and she said layers of skin on her face began to peel off and acne started forming.\nGeorgie, pictured before, says she has still not been offered any explanation for the severe reaction\nShe said: 'It was like a scene from a horror movie. I screamed and ran to the bathroom. My face looked terrible and I couldn't stop crying.\n'I tried to convince myself it was just part of the procedure, but when cysts started forming I really began to worry.\n'It just began to get aggressively worst. I couldn't believe what was happening. I could barely look in the mirror. It hurt to touch, it was so painful.'\nGeorgie's skin got worse and she turned into a 'recluse', refusing to go out.\nShe said she made a panicked call to the clinic, which prescribed antibiotics.\nFour weeks later, she returned for her second appointment - and claims that a doctor there refused to carry on with the treatment.\nShe recalled: 'The doctor's face said it all.\n'He was shocked at my reaction and refused to do the second laser treatment. He didn't want to do it over the acne that covered my face.'\nDespite the doctor's response, Georgie went for her delayed second treatment in August - even though she claims her skin was still reacting to the first treatment - and she says she went through 'unbearable' pain.\nGeorgie, left, before, and, right, after, recalls the treatment, saying: 'The doctor's face said it all. He was shocked at my reaction and refused to do the second laser treatment. He didn't want to do it over the acne that covered my face'\nIn May she went to the clinic for her first consultation about getting a chemical peel to freshen up her face and was advised that a C02 laser treatment would be best. Georgie, pictured just after the treatment, was warned she would experience mild scabbing and was given an intensive moisturising cream, but claimed she was assured her skin would be glowing within two weeks\nGeorgie pictured on the day she had the treatment, which developed into painful cysts\nShe said: 'I complained straight away. Tears were running down my face and about 10 minutes in I asked him to stop. He continued telling me to \"bear with it\".'\nSix months on, Georgie says she has been left with severe facial scarring and acne - and is urging other people to 'think twice' before undergoing a cosmetic procedure.\nGeorgie claims she has still not been offered any explanation about her severe reaction.\nShe said: 'I regret having the treatment and messing with my face. It will never be the same again and now that is something I have to see through my reflection every day.'\nA spokesman for the Harley Street Skin Clinic earlier said: 'We consider our patients' wellbeing and satisfaction to be our highest priorities.\n'Before any of our patients undergo treatments they attend at least one consultation where treatment options are discussed in addition to realistic treatment outcomes and possible side effects.\n'No treatment is risk free or guaranteed. All our patients are advised of this in order they can make informed decisions.\n'All our patients also sign consent forms confirming that the Clinic never guarantees the outcome of a treatment and that every patient is different..\n'Despite our high standards a very small number of patients will not be satisfied.\n'In such cases we would hope that they engage with us so that we can resolve any concerns they may have on an informal basis.'","url":"https://www.dailymail.co.uk/femail/article-3422879/Woman-26-left-giant-cysts-acne-covering-face-having-reaction-1-200-chemical-peel-freshen-skin.html"}
