{"authors":["Phoebe Jackson-Edwards For Mail Online"],"date_download":"2018-10-23 00:44:20","date_modify":"2018-10-23 00:44:20","date_publish":"2016-01-28 14:49:24","description":"Liz Walton, 46, from Saltford, Somerset, went through six unsuccessful rounds of IVF treatment. Three years later she fell pregnant naturally and gave birth to a baby girl Willow, now five months.","filename":"data/vaneerConsumption/Womanwhospent30000onfailedIVFfellpregnantnaturally.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AADDCA00000578-0-image-a-22_1453990484025.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420933_Woman-spent-30-000-7-years-failed-IVF-mother-falling-pregnant-naturally_1540255460.html","title":"Woman who spent £30,000 on failed IVF fell pregnant naturally","title_page":"Woman who spent £30,000 on failed IVF fell pregnant naturally | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman who spent her life savings on IVF has finally given birth after falling pregnant naturally.\nLiz Walton, 46, from Saltford, Somerset, was desperate to become a mother but when she struggled to fall pregnant with husband, Greg, 41, they forked out £30,000 on six rounds of IVF.\nAfter seven years of failed attempts the couple gave up on their dream of becoming parents - only for Liz to fall pregnant naturally three years later and give birth to a baby girl, Willow.\nLiz Walton was desperate to become a mother but six rounds of IVF didn't work. Three years later she fell pregnant naturally and had Willow\nLiz and husband Greg from Saltford, Somerset tried to conceive through IVF after tests found that Greg has anti-sperm antibodies, which damage the sperm and make it more difficult for them to fertilise the egg\nWillow is now five months old and her delighted mother has set up a counselling business, Liz Walton Therapy and Coaching, to help other couples with their infertility struggles.\nLiz, who works from home, said: 'After years of struggling to fall pregnant naturally we gave up on our hopes of having a baby.\n'I couldn't take anymore IVF treatment and we had exhausted our savings on six rounds.\n'So when I missed a period I assumed I was starting the menopause, not for one second did I think I'd be pregnant, I couldn't believe it when the test showed a positive blue line.\nLiz and husband Greg spent all of their savings on IVF and when it didn't work they gave up. When Liz missed a period she intitially thought she was menopausal but she was pregnant (pictured)\nLiz, pictured with Willow now five monthsold, said: 'Me and Greg were both in total shock, we'd longed for a baby for so many years and now it was finally happening'\nAlthough they were both thrilled, Liz was worried about becoming an older mother as there were more risks involved. Pictured Willow now five months\n'Me and Greg were both in total shock, we'd longed for a baby for so many years and now it was finally happening.\n'For the first time all the heart ache of failed fertility treatment seemed worthwhile, it was a dream come true and so unexpected.'\nAlthough they were both over the moon, Liz was worried about becoming an older mum as there were more risks involved.\nLiz added: 'The sonographer warned that there was too much fluid at my 12-week scan.\n'We had to wait a couple of months before we knew if there was a chromosome problem, we were both really worried.\nThe sonographer warned at the 12-week scan Liz had too much fluid but after tests they found out the baby was healthy\nLiz said: 'I was thrilled, having a baby was all I wanted and more, I could finally relax and enjoy being pregnant'\n'Thankfully the results showed that everything was normal and at my 20-week scan we found out we were having a girl.\nLiz, who was already a trained therapist, decided to specialise in fertility problems to help other couples who have been through similar struggles\n'I was thrilled, having a baby was all I wanted and more, I could finally relax and enjoy being pregnant.\n'When me and Greg saw her for the first time it was the best moment of our lives. We called her Willow Rose Elizabeth and she weighed 6lbs 6oz.\n'Since having her home it has been such a surreal time, we can't actually believe we're parents.\n'Having Willow is everything we'd ever wanted, she's perfect.\n'Willow is now five months old and has a head full of hair and although we've never had so little sleep in our lives, she's well worth it.\n'Both me and Greg have never felt so happy, she has completed our little family.'\nAfter going through the heartbreak of not being able to conceive for seven years, Liz, who was already a trained therapist, decided to specialise in fertility problems to help other couples who have been through similar struggles.\nLiz added: 'After tests found that Greg has anti-sperm antibodies, which damage the sperm and make it more difficult for them to fertilise the egg, we knew it would be difficult to fall pregnant naturally.\n'We put so much pressure on ourselves to have a baby that everything became very regimented, we focused all our energy on conceiving.\n'And although at this point we didn't have Willow, I thought our experience could help other couples and I wanted to help them as best I could.\n'I've set up my own counselling business whereby I help couples or individuals overcome their different fertility problems.'\nLiz said: 'I'm living proof that really letting go of all the anxiety around conceiving naturally can be solved by changing your mental attitude'\nWillow Rose Elizabeth was born five months ago and weighed 6lbs 6oz. Liz said: 'Although we've never had so little sleep in our lives, she's well worth it'\nLiz gave up on having children of her own and went to India for a spiritual, relaxing holiday before falling pregnant.\nShe added: 'I was a trained therapist but it just so happened that when I returned from India that a lot of the women I saw were also having fertility problems.\n'I knew a lot of the problems they had were mental and could be overcome, I hadn't got Willow at the time but I was really able to relate to their struggles.\n'And three years later I became pregnant, now I'm living proof that really letting go of all the anxiety around conceiving naturally can be solved by changing your mental attitude.","url":"https://www.dailymail.co.uk/femail/article-3420933/Woman-spent-30-000-7-years-failed-IVF-mother-falling-pregnant-naturally.html"}
