{"authors":["Ekin Karasin For Mailonline"],"date_download":"2018-10-23 01:48:49","date_modify":"2018-10-23 01:48:49","date_publish":"2017-04-26 12:29:43","description":"The women marched the two-metre vagina through Sevilla to protest against homophobia in May 2014. They are accused of offending 'religious sentiments' and could face a year in jail.","filename":"data/vaneerConsumption/WomenwhocarriedplasticvaginathroughSpainfacecourt.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9ED16400000578-0-image-a-131_1493206324096.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447386_Women-carried-plastic-vagina-Spain-face-court_1540259329.html","title":"Women who carried plasticvagina through Spain face court","title_page":"Women who carried plasticvagina through Spain face court | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Three feminist protesters who carried a giant plastic vagina through a Spanish city are facing court after the protest was deemed a religious hate crime.\nThe women marched the two-metre vagina through Sevilla to protest against homophobia, during a workers' demonstration in May 2014.\nThis week the Spanish high court overturned a previous ruling that the trio had legitimately used freedom of expression - and branded the march ‘an offence against the Virgin Mary’.\nThree feminist protesters who carried a giant plastic vagina (pictured) through Sevila, Spain, are facing court after the protest was deemed a religious hate crime\nThe women are accused of offending 'religious sentiments' after their procession through the Andalucian city.\nActs which offend ‘the sentiments of members of a religious group’ carry a fine - meaning the women could be jailed for eight to 12 months.\nDuring the march, the Alquerra Feminists group appeared to dress up like a Semana Santa procession while carrying the vagina.\nThe women were pictured wearing black lace face veils and carrying rosary beads, according to Europa Press.\nThe veils, known as mantillas, are commonly worn by devout Catholic women during religious celebrations.\nThe women marched the two-metre vagina through Sevilla to protest against homophobia, during a workers' demonstration in May 2014\nOther women were seen wearing conical hoods worn by members of religious brotherhoods to celebrate Easter.\nHailed as the 'Santísimo Coño Insumiso', or the 'Blessed Rebellious Vagina', they reportedly were protesting against homophobia.\nThe women were protesting during a march organised by the Spanish union the General Workers' Confederation (CGT).\nMiguel Sevillano, head of the CGT in Seville told Europa Press that the women had 'nothing to do' with the union, but added that the women were part of a feminist group.\nFeminist groups have routinely staged demonstration in Spain, to protest the country's abortion laws.","url":"https://www.dailymail.co.uk/news/article-4447386/Women-carried-plastic-vagina-Spain-face-court.html"}
