{"authors":["Rachael Levy"],"date_download":"2018-10-30 20:49:48","date_modify":"2018-10-30 20:49:48","date_publish":"2016-12-26 00:00:00","description":"Women and minorities are badly underrepresented in fund management. What is it like for those who make it?","filename":"data/vaneerConsumption/Womenandminoritiestalkaboutworkinginwhitemalehedgefunds.json","image_url":"https://amp.businessinsider.com/images/56a8bc6558c3239d078b575d-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_we-asked-women-and-minorities-what-its-like-to-work-in-hedge-funds-these-are-their-shocking-stories-2016-10_1540932588.html","title":"Women and minorities talk about working in white male hedge funds","title_page":"    Women and minorities talk about working in white male hedge funds - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Business Insider The money-management industry has a diversity problem.\nMorningstar's global study out earlier this year showed that only one in five mutual-fund managers is a woman - a rate that hasn't budged since 2008.\nIn the US, that number drops to one in 10. The US is a laggard, far behind countries such as Singapore (30%), Portugal (28%), and France (21%).\nFor hedge funds, the numbers are similar: Only 15% of hedge fund CEOs are women. For minorities, the figures are just as lackluster, with only a handful of Latino and African-American managers.\nThere are a lot of reasons for the gap, among them biases, cliquey hiring, and weaker professional networks for women.\nGiven the dire numbers, I wondered what it's like to be a woman, minority — or both — working in the industry. So I started asking around.\nSome spoke of annoying biases — one woman who launched her own fund said she stopped wearing her wedding ring at investor meetings because she grew tired of questions about what her husband did. Others spoke of being ignored for the investment ideas they presented or hearing crass talk about female colleagues.\nMost said their experiences had, on the whole, been otherwise positive. Investing proves a quantifiable measure on which to be measured, something other careers lack, several people mentioned. There are fewer gray areas on which to be measured, the thinking goes, if you can point to a number that proves your performance for the year.\nEveryone asked to be kept anonymous so to not jeopardize their careers. Here are their stories.","url":"https://www.businessinsider.com/we-asked-women-and-minorities-what-its-like-to-work-in-hedge-funds-these-are-their-shocking-stories-2016-10"}
