{"authors":["Associated Press"],"date_download":"2018-10-23 02:10:43","date_modify":"2018-10-23 02:10:43","date_publish":"2016-01-29 16:34:09","description":"BUFFALO, N.Y. (AP) — Kelli Stack greeted last year's talk about a U.S.-based professional women's hockey league with a familiar skepticism. This was hardly t...","filename":"data/vaneerConsumption/Womensprohockeygainingfootholdwith2leagues.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:a09a7f2849d941f3a71968438bd03588-4PuZeKVXE7cd9005b2c876c45c24-535_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423046_Womens-pro-hockey-gaining-foothold-2-leagues_1540260643.html","title":"Women's pro hockey gaining foothold with 2 leagues","title_page":"Women's pro hockey gaining foothold with 2 leagues | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Women's pro hockey gaining foothold with 2 leagues\nBUFFALO, N.Y. (AP) — Kelli Stack greeted last year's talk about a U.S.-based professional women's hockey league with a familiar skepticism.\nThis was hardly the first time the 28-year-old U.S. national team forward had heard buzz about the possibility of earning a paycheck to play hockey, only to have the plan collapse before a puck was dropped.\n\"Every August would roll around, and people would say, 'Oh, did you hear?'\" the former Boston College star said.\nIn this Saturday, Jan. 23, 2016, photo, National Women's Hockey League All-Star Kelli Stack, a forward with the Connecticut Whale, speaks with a reporter at a media event the day before the All-Star game, in Buffalo, N.Y. In just its first year, the upstart U.S.-based National Women's Hockey League beat it's longer-established, Canadian-based counterpart to the punch by paying its players this season. Now the five-team Canadian Women's Hockey League is vowing to start paying its players. The question now is whether two competing leagues are sustainable, with players and officials on both sides of the border suggesting that a merger might be best in the long run (AP Photo/Gary Wiepert)\nThe four-team National Women's Hockey League has so far proved the exception for Stack, who participated in the league's inaugural All-Star game in Buffalo last weekend.\n\"In September or October, we didn't know how long the league would last, if it would make a full year or what,\" she said. \"So to actually have it be real and to be a part of it, it's hard to comprehend.\"\nStack plays for the Stamford-based Connecticut Whale, and makes a league-high $25,000. The minimum salary is $10,000 and there are 72 players getting paid, according to the league's website.\nThe NWHL is the first to pay its players a salary, but it is not the only North American women's league. The Canadian Women's Hockey League is in its eighth season and follows a different business model. The five-team CWHL pays its coaches and general managers, while providing players prize money for winning the regular season and playoff titles.\nFor the first time, the CWHL intends to begin paying its players a regular salary, beginning next year.\nThe CWHL's introduction of player salaries does not come in direct response to the NWHL's emergence. It has instead been part of the league's long-term vision to establish a sustainable model by developing a fan base and building ties with corporate sponsors, including four of the NHL's seven Canadian teams.\n\"For us, it's about growing the whole game, growing a community of hockey, so our plan is dead on target,\" CWHL Commissioner Brenda Andress said. \"It's always a great question, what's the definition of somebody saying, 'I'm a pro league because I pay my players $5,000 or $10,000? Or am I a pro league when I pay them $150,000?'\"\nThe CWHL has made several inroads. Its All-Star game in Toronto last weekend drew 7,000 fans and attracted a television audience of 109,000 on Canada's Sportsnet cable network. Andress called that a \"big, huge statement.\"\nBy comparison, the NWHL drew about 900 fans to its All-Star game in Buffalo, and projected having about 2,000 more watching via a live online stream.\nThe NWHL was borne out of a Dani Rylan's vision to establish a pro league on a business model based on what's essentially a startup venture, relying on investors to fund its launch. Rylan, who is the league commissioner, announced last weekend that the league is financially ready for a second season.\nWhile she has so far delivered on her promises, Rylan remains short on details in regards to who's funding the NWHL, what the league's bottom line resembles and how sustainable it can be with one major corporate sponsor in Dunkin' Donuts.\n\"We were just wrapping up our 2015 numbers and our CFO and I were actually incredibly shocked at how on point we are with our budget and how we're doing a lot better than we thought we would be doing,\" Rylan said.\nBased on each team having a $270,000 salary cap, the NWHL's payroll totals about $1 million and, according to league officials, represents about 85 percent of its budget. Other costs include transportation, with teams traveling by bus, and fees for facilities.\nThe 28-year-old Rylan played college hockey at Northeastern before turning her attention to business after opening a coffee shop in East Harlem, New York.\nRylan first proposed her plan to the CWHL before breaking off on her own and taking the core of the defending champion Boston Blades with her. The Blades were mostly made up of U.S. national team members, who unanimously voted to join the NWHL, which also has teams in Boston, Brooklyn and Buffalo. The CWHL Blades are still playing in Boston with a depleted roster, going 0-19-1 this season.\nThe existence of two leagues reflects the rising popularity of women's hockey.\nUSA Hockey's registration for female players has more than doubled since women's hockey made its debut at the 1998 Nagano Olympics.\nIn 1997-98, there were a little over 28,000 females registered, representing about 7 percent of all U.S. hockey players. In 2014-15, that number jumped to about 70,000 females, which represented 13 percent of all registered players.\nThe question is whether a merger of the two leagues would benefit the game.\nRylan was noncommittal, saying: \"It's a growing relationship and we look to continue to co-exist with them.\"\nWithout going into detail, she adds: \"There's obviously a few more complications to make that a reality.\"\nStack, however, favors a merger even though she was among the players who jumped from the CWHL. Canadian national team star Hayley Wickenheiser caused a stir last weekend when she said there should be only one league, and it should be the CWHL.\nCalgary Flames president and CWHL governor Brian Burke won't argue with Wickenheiser, but he noted this is not a time to be divisive.\n\"I think the more walls we put up, the longer this process is going to take,\" Burke said. \"I'd rather have everyone sit down and figure out something that worked for both sides.\"\nReagan Carey, USA Hockey's director of women's hockey, believes a merger is the best solution, and has had discussions with Hockey Canada and NHL officials.\n\"It's certainly at a tipping point right now for us, and something we need to leverage going into the next Olympics,\" said Carey, referring to the 2018 Games in South Korea. \"We have to work with each other and not against each other, regardless of maybe having some individual different objectives along the way.\"\nAndress, the CWHL commissioner, respects Rylan for what she's accomplished while saying it's up to the two leagues to reach a compromise.\n\"Accolades to a young entrepreneur, a woman who's trying to do something different and creative in her own rights,\" Andress said. \"But at the end of the day, we all know that the best is to work together.\"\n___\nOnline:\nCWHL: http://www.cwhl.ca/view/cwhl\nNWHL: http://nwhl.co/\nIn this Sunday, Jan. 24, 2016, photo, National Women's Hockey League All-Star players take time for a \"selfie\" before the start of an all-star game at Harborcenter in Buffalo, N.Y. In just its first year, the upstart U.S.-based NWHL beat it's longer-established, Canadian-based counterpart to the punch by paying its players this season. Now the five-team Canadian Women's Hockey League is vowing to start paying its players. The question now is whether two competing leagues are sustainable, with players and officials on both sides of the border suggesting that a merger might be best in the long run.(AP Photo/Gary Wiepert)\nIn this Jan. 24, 2016, photo, Buffalo Beauts hockey player Meghan Duggan (10), photographs teammate Megan Bozek (9) with fans before the start of the National Women's Hockey League All-Star game, in Buffalo, N.Y. In just its first year, the upstart U.S.-based National Women's Hockey League beat it's longer-established, Canadian-based counterpart to the punch by paying its players this season. Now the five-team Canadian Women's Hockey League is vowing to start paying its players. The question now is whether two competing leagues are sustainable, with players and officials on both sides of the border suggesting that a merger might be best in the long run. (AP Photo/Gary Wiepert)\nIn this March 19, 2015, file photo, Montreal Canadiens chief executive Geoff Molson and Canadian Women's Hockey League Comissioner Brenda Andress pose with Montreal Stars players, from left, Lisa-Marie Breton-Lebreux, Julie Chu, Noemie Marin, Charline Labonte, Ann-Sophie Bettez, and Cathy Chartrand, right, during a press conference in Montreal. In just its first year, the upstart U.S.-based National Women's Hockey League beat it's longer-established, Canadian-based counterpart to the punch by paying its players this season. Now the five-team Canadian Women's Hockey League is vowing to start paying its players. The question now is whether two competing leagues are sustainable, with players and officials on both sides of the border suggesting that a merger might be best in the long run. (Ryan Remiorz/The Canadian Press via AP, File) MANDATORY CREDIT\nIn this Saturday, Jan. 23, 2016, photo, National Women's Hockey League All-Star captains Hilary Knight, left, and Emily Pfalzer pose holding game pucks in Buffalo, N.Y. In just its first year, the upstart U.S.-based NWHL beat it's longer-established, Canadian-based counterpart to the punch by paying its players this season. Now the five-team Canadian Women's Hockey League is vowing to start paying its players. The question now is whether two competing leagues are sustainable, with players and officials on both sides of the border suggesting that a merger might be best in the long run. (AP Photo/Gary Wiepert)","url":"https://www.dailymail.co.uk/wires/ap/article-3423046/Womens-pro-hockey-gaining-foothold-2-leagues.html"}
