{"authors":["Emma Cueto"],"date_download":"2018-10-30 23:21:35","date_modify":"2018-10-30 23:21:35","date_publish":"2014-08-13 19:52:30","description":"There all kinds of differences between men and women — the amount we're paid, the amount of harassment we get on the Internet, the way we're represented in film and television. And, it seems, how we run marathons. According to a new study, men and…","filename":"data/vaneerConsumption/WomenAreBetterAtMarathonRunningSaysNewStudySortOf.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/1433c157-75bf-46f5-8509-e170a15db73f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35657-women-are-better-at-marathon-running-says-new-study-sort-of_1540941695.html","title":"Women Are Better At Marathon Running, Says New Study. Sort Of.","title_page":"Women Are Better At Marathon Running, Says New Study. Sort Of.","title_rss":"NULL","source_domain":"bustle.com","text":"There all kinds of differences between men and women — the amount we're paid, the amount of harassment we get on the Internet, the way we're represented in film and television. And, it seems, how we run marathons. According to a new study, men and women tend to differ in their approaches to marathons, and though I'm sorry to tell you this guys, women are kind of better at it.\nThe study, which was published in the journal Medicine & Science in Sports & Exercise, looked at data for over 90,000 marathon times from 14 different marathons, and found that the male runners slowed down an average of 16 percent by the end of the race while women slowed down only about 12 percent on average. Additionally, about 14 percent of men had decreased their speed by nearly a third by the end of the marathon, while only 5 percent of women slowed down by the same percentage.\nMoreover, this trend held true across age groups, finishing times, and prior marathon experience.\nSo what's the deal? Well, part of it is physiology. Men tend to burn carbohydrates faster than women, making them more likely to crash part way through the race. But there are also psychological factors. Men, it seems, are less likely to pace themselves from the start of the race, but rather \"start out fast and just hope they can hold on,” according to Dr. Sandra Hunter, senior author of the study. She adds that it's not necessarily a bad thing — sometimes it pays off. But overall, it makes men much more likely to slow their pace significantly by the end of a marathon.\nIn other words, men are at both a mental and physical disadvantage when it comes to marathons. (I'm just kidding guys, but now you know what it feels like to have people say that sort of nonsense.)\nAs Tom McKay at Mic.com points out, there are a lot of metaphors to be found here about how men and women are different — women take things slow and steady while men hurtle headlong towards the finish line. But there's perhaps more to be said about the ways in which women are taught to be cautious, especially when it comes to difficult physical activities. It makes sense women would pick a more conservative pace, given that people's skepticism when it comes to women doing intense things like running marathons teaches us to second guess ourselves.\nI suppose the best thing for everyone would be if women trusted themselves more and men tried to check themselves more. Though, honestly, women do seem to be kicking butt at marathons right now, so who am I to complain too much?","url":"https://www.bustle.com/articles/35657-women-are-better-at-marathon-running-says-new-study-sort-of"}
