{"authors":["Associated Press"],"date_download":"2018-10-22 21:12:58","date_modify":"2018-10-22 21:12:58","date_publish":"2017-03-16 00:49:14","description":"UNITED NATIONS (AP) - Decades of gains for women representatives in national legislatures and top government posts worldwide have slowed to a crawl, growing...","filename":"data/vaneerConsumption/Womensnumbersintoppoliticalpostsstagnating.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318480_Womens-numbers-political-posts-stagnating_1540242778.html","title":"Women's numbers in top political posts stagnating","title_page":"Women's numbers in top political posts stagnating | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"UNITED NATIONS (AP) - Decades of gains for women representatives in national legislatures and top government posts worldwide have slowed to a crawl, growing last year at a rate so modest it would take a half-century to reach equal representation of men and women in parliaments, according to new research released Wednesday.\nThree years ago, national legislatures were on track to hit gender parity in less than two decades, with the average proportion of women parliament members growing 1.5 percent a year.\nLast year's growth was less than half that rate, according to research by the U.N. women's arm and the Inter-Parliamentary Union , an independent group. Meanwhile, the number of women government ministers edged up from 730 to 732, about 18 percent of such jobs globally.\nThe number of women presidents or prime ministers dropped from 19 to 17, though it still has more than doubled since 2005. The figures don't account for the recent ouster of South Korean President Park Geun-hye.\n\"There have been gains in women's political representation, but looking at some of the setbacks that we have witnessed around the world, we can conclude that it cannot be taken for granted that this will continue to increase\" without more robust efforts, IPU Secretary General Martin Chungong said as his group and U.N. Women released the data.\nStill, he said, \"we have reason to be optimistic because many countries have shown that it's possible to increase women's political representation.\"\nA record 53 women presided over parliamentary chambers last year, holding nearly one in five such jobs. Thirty percent of environment ministers were women, up 10 percent in a year. At the same time, the number of men leading women's affairs ministries rose, though women still helmed the vast majority.\nAdvocates say gender parity in high office makes governments more inclusive and representative of their populations and increases attention to women's concerns. A 1995 U.N. women's conference in Beijing set a target of having women holding at least 30 percent of government decision-making posts.\nThe proportion of women in national legislatures has more than doubled in the two decades since, from a global average of 11.3 percent in 1995 to 23.3 percent at the start of this year. Some countries have set quotas to promote women's candidacies.\nAs of Jan. 1, women made up more than half the parliaments of Rwanda and Bolivia and held half or more of the ministries in Bulgaria, France, Nicaragua, Sweden, Canada and Slovenia. Dozens of the United Nations' 193 member states were over the 30-percent threshold in their parliaments, Cabinets or both.","url":"https://www.dailymail.co.uk/wires/ap/article-4318480/Womens-numbers-political-posts-stagnating.html"}
