{"authors":[],"date_download":"2018-10-30 01:12:42","date_modify":"2018-10-30 01:12:42","date_publish":"2017-01-24 00:04:13","description":null,"filename":"data/vaneerConsumption/WomensMarchersUnite.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/01/AngelaDavis.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861962.html","title":"Women’s Marchers, Unite!","title_page":"Women’s Marchers, Unite!The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"“The most important task,” said communist dictator Kim Il Sung in October 1971, in his address to the Democratic Women’s Union of North Korea, “is to revolutionize and working-classize all the women.”\nKim hoisted the torch blazed by glorious female comrades such as Alexandra Kollontai (the Eleanor Roosevelt of the Bolshevik Revolution), Bella Dodd, Rosa Luxemburg, Ethel Rosenberg, Elizabeth Bentley, Lillian Hellman, Betty Freidan, Kate Millett, Angela Davis, and a bevy of true believers. Friedan and Millett were pioneers of the National Organization for Women (NOW). Millett, author of Sexual Politics, her dissertation at the ideological insane asylum known as Columbia University, became a cultural juggernaut when published in 1969. Time magazine hailed Kate as “the Karl Marx of the Women’s Movement.”\nThey were marchers for the revolution. And this past weekend, their ideological sisters lent their support to the Women’s March on Washington, an event that sources like CNN gave maximum publicity — a level of attention that absolutely will not be granted to this week’s March for Life in Washington, where the goal will be to preserve life.\nA list of the sponsors for the Women’s March is illuminating. The two lead organizations, highlighted as the March’s “premier partners,” were Planned Parenthood — America’s preeminent abortion factory — and the Natural Resources Defense Council. As for the latter, if it confuses you why a group of climate comrades would march in lockstep with women whose highest priority is abortion, then you don’t understand the American left. Go to the website of the Women’s March, where “environmental justice” is featured among the leading “Unity Principles,” right up there with “reproductive rights” (read: abortion) and “worker’s rights” and “LGBTQIA rights.”\nBut that was just the start. Arm in arm with the sisters at the Women’s March were two touted “Social Justice Partners,” namely: Emily’s List and NARAL. For these girls, too, “women’s rights” means one thing: abortion. Abortion, abortion, abortion. The holy sacrament in the feminist church.\nThe next major level of sponsors for the Women’s March was an eclectic cabal of fellow travelers and usual suspects: the ACLU, MoveOn.org, the Human Rights Campaign, the American Federation of Teachers, the AFL-CIO, and SEIU, the worst of the government unions.\nAnd then there was a longer list of March “partners,” a Who’s Who of the left: AFSCME, the toxic National Education Association, the National Organization for Women, National Rainbow PUSH Coalition, Occupy Wall Street, the NAACP, the Council on American Islamic Relations, Amnesty International, Greenpeace, the Southern Poverty Law Center, Human Rights Watch, People for the American Way, Americans United for Separation of Church and State, the Sierra Club, the National Urban League, the YWCA, the Center for American Progress, Code Pink, and a litany of Religious Left dupes such as the Federation of Protestant Welfare Agencies, the Unitarian Universality Association, and the heretical Catholics for Free Choice.\nAnd there was a wider panoply of perversity: novel organizations like Free the Nipple, Got a Girl Crush, Pussy Hat Project, and the Georgetown University College Democrats.\nBut alas, most enlightening was another curious collective of sponsors for the Women’s March, one that brings me full circle to the start of this article. The communists and socialists came out: Communist Party USA and the Democratic Socialists of America.\nYes, Communist Party USA was a proud sponsor of the Women’s March on Washington, and the ladies were evidently proud to have them.\nAin’t nothing too left-wing, apparently, for the Women’s Marchers.\nAmong the Bolshevik element, consider some of the high-profile individuals who lent their names. Listed first among honorary co-chairs at the March website was none other than the delightful Angela Davis, where the glowing, lengthy bio somehow avoided mentioning even one word of Ms. Davis’s most notable bona fides: Davis has long been, of course, one of America’s most infamous Marxist-Leninists. Comrade Angela was so high-ranking that she not only met with the worst communist despots in the Soviet Bloc but actually twice ran on Communist Party USA’s presidential ticket. The celebrated recipient of the Lenin Peace Prize, much appreciated by the Kremlin for her advocacy of the Soviet invasions of Czechoslovakia and Afghanistan, ran as vice president of the United States on the Communist Party ticket, alongside longtime CPUSA party secretary and hack Gus Hall. (As I noted in a recent piece for The American Spectator, among those who voted for the Hall-Davis Communist Party presidential ticket was none other than John Brennan, Barack Obama’s CIA director.)\nDavis was one of many tragic academic byproducts of Herbert Marcuse, the leading Frankfurt School cultural Marxist. Marcuse was guru to the 1960s New Left. Davis is arguably Marcuse’s most long-lasting success. He took her under his wing at Brandeis University in the early 1960s. In 1965, she honored her professor by retracing his steps to the University of Frankfurt. He sent her to West Germany to study at his old haunt, the hideous “Institute for Social Research.” She returned in 1967, coming back to America to continue studies with Marcuse as her doctoral adviser. The blooming Bolshevik formally joined Communist Party USA the next year.\nLike any good communist, Davis’s road to the revolution included breaking a few eggs along the way. She was soon pursued on charges of kidnapping, murder, and conspiracy for her suspected role in the August 1970 murder of a prison guard. Like Weather Underground terrorists and Obama buddies Bill Ayers and Bernardine Dohrn, she landed on the FBI’s 10 Most Wanted list. And like Ayers and Dohrn, she escaped jail-time (“guilty as hell, free as a bird!” Ayers boasted), and then spread her wings in academia.\nToday, like her late mentor, Herbert Marcuse, Angela Davis is (naturally) a professor. She lists among her expertise the field of “critical theory,” the formal academic front-name for cultural Marxism. She holds forth on “LGBTQIA” issues to the wide-eyed freshmen whose duped parents hand over their children and lifetime savings to the universities to indoctrinate them.\nOne might think that today’s left would shy away from figures like Davis. But again, anyone who thinks that doesn’t know the left. The likes of Angela Davis are not embarrassments to today’s left; they are heroes. In June 2016, the Elizabeth A. Sackler Center for Feminist Art at the Brooklyn Museum feted Davis with its 2016 Sackler Center First Award, “honoring women who are first in their fields.”\nAmong Angela Davis’s firsts, of course, was to be the first female comrade to run on a communist presidential ticket.\nAnd this past weekend, Davis was listed literally first among the female comrades who were the poster-girls to the Women’s March on Washington. She and her cronies at Communist Party USA and the Democratic Socialists of America must have gotten quite a kick at the legions of oblivious ladies and splendid dupes who joined them in solidarity last weekend — all marching for “women’s rights,” of course. Forward!","url":"https://spectator.org/womens-marchers-unite/"}
