{"authors":["Pam Key"],"date_download":"2018-10-30 18:32:59","date_modify":"2018-10-30 18:32:59","date_publish":"2017-01-15 19:06:58","description":"On this weekend’s broadcast of “Fox New Sunday,” veteran journalist Bob Woodward said the unverified dossier about President-elect Donald Trump and Russia | Video","filename":"data/vaneerConsumption/WoodwardTrumpDossierIsaGarbageDocumentIntelligenceChiefsShouldApologizetoTrump.json","image_url":"https://media.breitbart.com/media/2017/01/woodward.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2017_01_15__1540924379.html","title":"Woodward: Trump Dossier Is a ‘Garbage Document’ — Intelligence Chiefs Should ‘Apologize’ to Trump","title_page":"Woodward: Trump Dossier Is a 'Garbage Document' --- Intelligence Chiefs Should 'Apologize' to Trump | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On this weekend’s broadcast of “Fox New Sunday,” veteran journalist Bob Woodward said the unverified dossier about President-elect Donald Trump and Russia is a “garbage document.”\nWoodward said, “I think what is under reported here is Trump’s point of view on it. You laid it out when those former CIA people said these things about Trump, that he was a recruited agent of the Russians, and a useful fool, they started this in Trump’s mind, He knows the old adage, once a CIA man, always a CIA man. No one came out and said those people shouldn’t be saying those things, So act two is the briefing when this dossier is put out.”\n“I’ve lived in this world for 45 years where you get things and people make allegations, that is a garbage document,” he continued. “It never should have been presented as part of an intelligence briefing. As you suggested, other channels have the White House counsel give it to Trump’s incoming White House counsel. So Trump’s right to be upset about that. I think if you look at the real chronology and the nature of the battle here, those intelligence chiefs who were the best we had, who are terrific and have done great work. I think they made a mistake here. And when people mistakes, they should apologize.”\nFollow Pam Key on Twitter @pamkeyNEN","url":"https://www.breitbart.com/video/2017/01/15/woodward-trump-dossier/"}
