{"authors":["Pam Key"],"date_download":"2018-10-30 18:33:09","date_modify":"2018-10-30 18:33:09","date_publish":"2015-10-19 16:13:38","description":"Woodward: Hilary's Server to Nixon Tape Comparison Becoming More Valid","filename":"data/vaneerConsumption/WoodwardHillarysServertoNixonTapeComparisonBecomingMoreValid.json","image_url":"https://media.breitbart.com/media/2015/02/woodward.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_19__1540924389.html","title":"Woodward: Hillary's Server to Nixon Tape Comparison Becoming More Valid","title_page":"Woodward: Hillary's Server to Nixon Tape Comparison Becoming More Valid | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Monday on MSNBC’s “Morning Joe,” long-time journalist Bob Woodward doubled down on his comparison to Democratic presidential candidate Hillary Clinton’s private email server scandal to former President Richard Nixon’s recorder audio tapes scandal saying it is becoming “more and more valid.”\nExchange as follows:\nMIKA BRZEZINSKI: Who had a server at the basement?\nJOE SCARBOROUGH: Hillary Clinton, she says things…\nBRZEZINSKI: That are not true.\nSCARBOROUGH: …on television that she knows are not true, that her staff knows is not true, that the press knows is not true, that the people following the story know is not true. And — and —like for instance other people that Collin Powell didn’t have a private server he ran all State Department and classified businesses threw —\nWOODWARD: You are talking about a serious FBI investigation… But when she says it’s permitted, you know — when she was secretary of state, they could go — she could tell her driver go 150 miles an hour and in a sense that’s permitted because she could say it. That doesn’t mean you should go 150 miles an hour. And there is — there’s a problem in all of this and we’ve talked before. And I’ve likened some of this to the Nixon tapes. And I think that’s valid and it’s becoming more and more valid. It’s the volume. We’re talking about 60,000 e-mails. I mean let’s take any of our e-mails and look at all of them, and there is always, you know, we remember the smart things we said — we may have said, and we forget the dumb things, but tell me who has not said something dumb or inappropriate on her emails.\nSCARBOROUGH: What happened when the FBI found out what went through her server and the CIA found out, the State Department, they immediately said ‘Oh my God. We have to mark this classified.’ And they backdated it to the moment she tight some of these statements down. Because no — if she’s cree — if she’s generating a document at that moment that has classified information in it, and she sends it. Of course it’s not going to be stamped classified. If Sidney Blumenthal reveals the source, I think it was him, or — if somebody reveals the source of a human intelligence agent on the ground in a war zone in Libya, and it’s not marked classified, that doesn’t somehow make it right that it’s passes through her server and then it’s gets passed on somewhere else.","url":"https://www.breitbart.com/politics/2015/10/19/woodward-hilarys-server-to-nixon-tape-comparison-becoming-more-valid/"}
