{"authors":["Pam Key"],"date_download":"2018-10-30 18:33:18","date_modify":"2018-10-30 18:33:18","date_publish":"2015-02-08 17:29:57","description":"Woodward: Military Upset Susan Rice is Telling Generals How To Fight","filename":"data/vaneerConsumption/WoodwardMilitaryUpsetSusanRiceTellingGeneralsHowToFight.json","image_url":"https://media.breitbart.com/media/2015/02/woodward.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2015_02_08__1540924398.html","title":"Woodward: Military Upset Susan Rice Telling Generals How To Fight","title_page":"Woodward: Military Upset Susan Rice Telling Generals How To Fight | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sunday on Fox News Channel’s “Fox News Sunday,” veteran journalist Bob Woodward said people in the military are complaining to him that the Obama administration has no strategy to defeat ISIS other then having people like Susan Rice “micromanage” military responses.\nWoodward said, “If you talk to people in the White House and the military, I think there’s agreement and John McCain is right and General Flynn is right, there is no strategy. They have not sat down and said this is where we want to go and this is how we want to do it. And the measure of that, when you head into the weeds here, people from the White House are micromanaging the tactical situation on a daily and weekly basis. That’s not their job. They have to kind of do strategic planning and say what do we want to accomplish in the next year.”\nWhen host Chris Wallace asked, “Wait a minute, are you saying that — forgive me, Susan Rice, is telling the generals what to do?” Woodard confirmed it by saying, “And they have got all these people in the White House. You talk to people in the military who are there and they say ‘we are being micromanaged and we’re not given a real plan to say what are we going to do here.’ And it’s not the way to run a war or try to win a war.”\nFollow Pam Key on Twitter @pamkeyNEN","url":"https://www.breitbart.com/video/2015/02/08/woodward-military-upset-susan-rice-telling-generals-how-to-fight/"}
