{"authors":[],"date_download":"2018-10-30 20:10:25","date_modify":"2018-10-30 20:10:25","date_publish":"2017-03-13 17:47:00","description":"Donnell Jones, a 56-year-old Woodstock resident and longtime cook at KFC, was brutalized in DeKalb County.","filename":"data/vaneerConsumption/WoodstockKFCcookfoundtiedupbeatentodeathinDeKalbhotel.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/13/Images/Jones,%20Donnell_330x207.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_woodstock-kfc-co_848e3bc1ccf168be249e71a22478aa96__1540930225.html","title":"Woodstock KFC cook found tied up, beaten to death in DeKalb hotel","title_page":"Woodstock KFC cook found tied up, beaten to death in DeKalb hotel","title_rss":"NULL","source_domain":"ajc.com","text":"DeKalb County police and family are trying to understand why someone would want to hurt Donnell Jones so badly.\nThe 56-year-old Woodstock resident and longtime cook, or as his sister put it “executive chef,” at KFC was brutalized.\nA housekeeper found his body in Room 314 at Economy Inn last Sunday on Wesley Chapel Road south of Decatur. He was on the floor, covered by a blanket, with his wrists tied by shoelaces, according to DeKalb County police.\nHis face had been bashed, apparently stomped in, police said. Officers asked Jones’ mother if he had any scars or marks that could identify him, seemingly because of the condition of his face.\nJones, who folks liked to call “OG,” had a record, with convictions for theft, obstruction and, in 1990, rape.\nBut his younger sister, Bernadette Chaney Sorrell, said those close to him believed he was innocent of rape and he was well-liked in the Woodstock community, where he lived with his mother.\n“Everyone knew him in the community. He touched lives,” she told The Atlanta Journal-Constitution. “It didn’t seem like he would be around someone who would harm him.”\nTaronce Jackson (DeKalb County jail)\nPolice charged a 38-year-old Doraville man with his murder. Taronce Jackson has been in the DeKalb jail without bond since last Thursday.\nSorrell said she’s never heard of him.\nBut when told a witness claimed people had been smoking crack cocaine in the room, the sister said she wasn’t surprised.\nSorrell knew her brother had problems, with addiction often creeping into his life and taking hold. He still managed to hold down his job at the KFC on Bells Ferry Road at Highway 92 and thrive there, she said.\nIt’s not clear how or if drugs played a part in the homicide.\nPolice are still piecing the case together. There is “no word of a clear motive right now,” Maj. Stephen Fore said Monday.\nWhen police searched the room, there was a bloody shoe print on a wall and a size-13 pair of athletic shoes. They were covered in blood, the police report said.\nJackson, who purportedly goes by Slim and has previously been convicted of thefts and trespassing, was seen the next morning without shoes, according to the warrant. A witness told police the shoes in the room were the suspect’s shoes.\nIn other news:\nCrews investigating cause of DeKalb fire. All residents made it out of the building safely.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/woodstock-kfc-cook-found-tied-beaten-death-dekalb-hotel/opmXvTMSDbQpi1Yg7U288L/"}
