{"authors":["Bo Emerson"],"date_download":"2018-10-30 18:01:18","date_modify":"2018-10-30 18:01:18","date_publish":"2016-01-10 21:19:01","description":"In 2015 the Woodruff Arts Center set itself a goal: raise $100 million by 2018.","filename":"data/vaneerConsumption/WoodruffArtsCenternears100milliongoal.json","image_url":"https://www.myajc.com/rf/image_large/Pub/p7/MyAJC/2016/01/10/Images/WPIMAGE_cmgajcartsculture_4579.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/myajc.com/blog_arts-culture_woodruff-_39b117d39a6bfd45e12fdb2ee6a6f45c__1540922478.html","title":"Woodruff Arts Center nears $100 million goal","title_page":"Woodruff Arts Center nears $100 million goal","title_rss":"NULL","source_domain":"ajc.com","text":"+ × One goal of the fund drive is the 2017 renovation of the Alliance Theatre auditorium, which will include the use of ... read more\nIn 2015 the Woodruff Arts Center set itself a goal: raise $100 million by 2018.\nLess than a year later they’re a little ahead of schedule, having raised $94.8 million, according to Virginia Hepner, president and CEO of the center.\nSpeaking Friday at a breakfast meeting of a Buckhead club for business executives, Hepner described how the Transformation Campaign has exceeded expectations, and ways that the campaign will change the Woodruff.\nThe Midtown arts compound, which includes the High Museum, the Alliance Theatre and the Atlanta Symphony Orchestra, is the largest arts organization in Atlanta and the third largest in the country, behind the Kennedy Center and Lincoln Center.\nBut according to Hepner it was overdue for a capital campaign. The infusion of cash will change the Woodruff in these immediate ways:\n• A $22 million makeover of the Alliance Theatre : In 2017, the theater space will be stripped to the bones and rebuilt with state of the art sound and lights, intimate sight-lines and “whisper-quality” acoustics.\n•More free programming: A grant from the Lettie Pate Evans Foundation, already in effect, allows families free activities every Sunday, either at the High, the Alliance or the ASO. “About 14,000 have visited since last June, and many of them have never been to the center before,” said Hepner.\n•A beefed-up endowment: Hepner said the Woodruff’s endowment, now at $400 million, needs to double, to give the center greater freedom from reliance on ticket sales and to offer a chance to develop original material. “We don’t want to be just a touring town,” said Hepner, “we want to create our own art.”\nHepner, a former 25-year executive with Wachovia Bank, said there is more rapport between musicians and management at the ASO, after 2014’s bitter lockout. She praised the center’s new leaders, including Rand Suffolk, the High’s new director, who started in November, and the ASO’s new executive director, Jennifer Barlament, who started last week.\nWhat’s missing? “We have great art but we don’t have enough community engagement,” said Hepner. Plans to redesign other elements of the campus will help invite the city in, she said, adding that there will be additional efforts to improve outreach. “We will be taking art to the people.”","url":"https://www.myajc.com/blog/arts-culture/woodruff-arts-center-nears-100-million-goal/nNiZxrlPnlkO8MhrXK4D9N/"}
