{"authors":[],"date_download":"2018-10-30 17:59:00","date_modify":"2018-10-30 17:59:00","date_publish":"2016-11-02 22:00:00","description":"There’s more good news from the Woodruff Arts Center.","filename":"data/vaneerConsumption/WoodruffArtsCentersucceedsearlyin100millionfunddrive.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/02/Images/newsEngin.16659683_Alliance1_Stage1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_arts--theater_cc6990f29a123ef7162e729d9eb863cd__1540922340.html","title":"Woodruff Arts Center succeeds early in $100 million fund drive","title_page":"Successful Woodruff Arts fund drive to boost High, ASO, Alliance","title_rss":"NULL","source_domain":"ajc.com","text":"There’s more good news from the Woodruff Arts Center.\nIn April 2015, the arts organization, which includes the High Museum, the Atlanta Symphony Orchestra and the Alliance Theatre at its Midtown campus — embarked on a “Transformation Campaign” with a three-year goal of raising $100 million.\nVirginia Hepner, president and CEO of the Woodruff, announced Wednesday that the arts center has met and surpassed its goal 18 months ahead of schedule, raising $110 million with the assistance of familiar individual and corporate partners and a million-dollar gift from the city of Atlanta.\nThe money will pay for a $22 million renovation of the Alliance Theatre, a $25 million endowment of 11 new positions at the symphony, greater access to free programming at all three Woodruff facilities and an endowment to make sure those programs keep happening.\nIt’s the second bit of sunshine in a week for the Woodruff, which is Atlanta’s largest arts organization and one of the largest in the country. Late last week, the ASO reported the completion of the musicians endowment campaign, also ahead of schedule.\n“It’s stunningly good that we were able to do both of these in two years,” said Hepner, who planned to celebrate the milestone at a gathering for donors on Wednesday evening at the Woodruff.\nThe campaign was capped with a “multimillion-dollar” donation from the Coca-Cola Co. toward the renovation of the Alliance. In honor of that gift, the stage at the theater will be renamed the Coca-Cola Stage at the Alliance Theatre.\nAtlanta Mayor Kasim Reed said supporting the center was a “privilege” and a responsibility.\n“The leading cities of the world invest significantly in arts and culture, and Atlanta should be no different,” Reed said in a statement. “We’re fortunate to have the Woodruff Arts Center, which has been bringing world-class art and arts education to Atlanta for nearly 50 years, as a centerpiece of our thriving arts community.”\nHere’s how the money will be used:\nThe Alliance Theatre: A $22 million renovation at the Alliance Theatre will first rip the old theater down to the studs, and build it back again, with better sound, better sight lines and more communion between the orchestra and balcony seats. While the Alliance is being disassembled, from May 2017 through the following year, the theater company will mount its productions in 12 different venues around the metro area.\nThe Woodruff endowment: A total of $65 million (including the musicians endowment) will go to endow existing programs at the Woodruff, freeing up operating expenses and making programming less dependent on ticket sales. “A lot of programs don’t pay their way,” Hepner said. “We earn a little under half of what we spend.”\nOutreach: In January, Hepner spoke to a meeting of Buckhead business executives, saying that the center needed to do a better job of “taking art to the people.” A $6.6 million grant from the Lettie Pate Evans Foundation has helped, allowing the center to offer free programming to families and students. Every Sunday since June 2015, the Woodruff has given away tickets either to the High Museum, the symphony or the Alliance, or hosted other free activities.\nIn that time, 83,000 people have taken advantage of the programs. How does Hepner feel about that? “Fantastic!” One quarter of those enjoying free Sunday activities were first-time visitors to the center, which helps fulfill its goal of spreading culture.\nHepner said a requirement for proceeding with the fundraising campaign was “getting our arts partners in a positive financial position.” That was a reference to the ASO, which lost money for more than a decade. After salary concessions and other agreements, the symphony posted a positive cash flow for the last two seasons.\nLeading donors to the campaign included the Robert W. Woodruff Foundation (with a matching grant of $38 million), the Lettie Pate Evans Foundation, Anne Cox Chambers, the James M. Cox Foundation, the Coca-Cola Co. and Delta Air Lines Foundation.","url":"https://www.ajc.com/entertainment/arts--theater/woodruff-arts-center-succeeds-early-100-million-fund-drive/D3AtMY9gRl9dPy2r8qsrOM/"}
