{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-22 21:20:10","date_modify":"2018-10-22 21:20:10","date_publish":"2017-04-26 01:39:33","description":"Religious groups have been left outraged by a thanksgiving service blessing asparagus in Worcester calling it an 'absurd pantomime making a mockery of Christian worship'.","filename":"data/vaneerConsumption/Worcestercathedralisblastedforinfantilepantomime.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B55C500000578-0-image-a-4_1493167073291.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446046_Worcester-cathedral-blasted-infantile-pantomime_1540243210.html","title":"Worcester cathedral is blasted for 'infantile pantomime'","title_page":"Worcester cathedral is blasted for 'infantile pantomime' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Religious groups have been left outraged by a thanksgiving service blessing asparagus - calling it an 'absurd pantomime-type scene making a mockery of Christian worship'.\nAn annual festival celebrating the vegetable in Worcester kicked off on St George's Day - traditionally the start of the English Asparagus Growing season.\nHowever the service has been dubbed silly and 'an infantile pantomime' by some groups who claim it brought the Church of England into disrepute.\nGus the Asparagus Man' joining a host of other characters including St George on a procession through Worcester Cathedral\nThe service has been dubbed silly and 'an infantile pantomime' by some groups who claim it brought the Church of England into disrepute\nThe British Asparagus Festival runs throughout May and early June around the Vale of Evesham - one of the biggest producers of the vegetable in the UK.\nThe Sunday service saw 'Gus the Asparagus Man' joining a host of other characters including St George leading a procession through Worcester Cathedral.\nThe crop was then blessed by the Reverend Canon Dr Michael Brierley.\nBut the service was criticised on the Church of England blog Archbishop Cranmer.\nThe blog is run by conservative academic, theologian, author and educationalist Adrian Hitlon, who is currently based at the Department of Education at the University of Oxford.\nThe blog asks: 'Did the Dean of Worcester Cathedral not pause to think for just one second how utterly, utterly absurd this would look?\n'A sacred procession down the Cathedral nave becomes an infantile pantomime as a block of asparagus is elevated and adored like the Blessed Host, and two men dressed up like Monty Python pay some sort of vacuous obsequious homage.'\nCritics asked: 'Did the Dean of Worcester Cathedral not pause to think for just one second how utterly, utterly absurd this would look?\nThe British Asparagus Festival runs throughout May and early June around the Vale of Evesham - one of the biggest producers of the vegetable in the UK\nThe blog likened the procession to a 'Telletubby-fest, adding the cathedral could have found a more fitting way of thanking 'God for asparagus without bringing the Church of England into disrepute'\nIt likened the procession to a 'Telletubby-fest, adding the cathedral could have found a more fitting way of thanking 'God for asparagus without bringing the Church of England into disrepute.'\nIt adds: 'Would the Church of England permit a man dressed up as a baked bean to process behind a Heinz tin of the things, and sanctify the mummery with a facade of thanksgiving?\n'And why only adoration of asparagus? Where’s the sprout liturgy, or equality for mushrooms? Would the Dean really permit a walking fungus to participate in an act of divine worship?'","url":"https://www.dailymail.co.uk/news/article-4446046/Worcester-cathedral-blasted-infantile-pantomime.html"}
