{"authors":[],"date_download":"2018-10-30 14:25:21","date_modify":"2018-10-30 14:25:21","date_publish":"2018-08-08 14:54:00","description":"A worker who was injured during construction of Mercedes-Benz Stadium in Atlanta has died, a family...","filename":"data/vaneerConsumption/WorkerhurtduringconstructionofFalconsstadiumdiesbrothersays.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/08/Images/photos.medleyphoto.7547178.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_worker-injured-d_123562efaeff42a95c1e8e1f1751c8ef__1540909521.html","title":"Worker hurt during construction of Falcons stadium dies, brother says","title_page":"Worker hurt during construction of Falcons stadium dies, brother says","title_rss":"NULL","source_domain":"ajc.com","text":"A worker who was injured during construction of Mercedes-Benz Stadium in Atlanta has died, a family member said.\nSonny Rogers, who suffered a severe head injury in July 2015 when scaffolding fell on him, died July 18 at a hospital in Chattanooga, Tenn., brother Abie Rogers told AJC.com on Wednesday.\nRogers, who was 31, had been in a care facility in northwest Georgia before he was moved to the hospital in Tennessee due to complications, his brother said.\nThe construction incident happened near the intersection of Mangum and Mitchell streets, under a concrete structure on the east side of the new stadium site, AJC.com previously reported.\nSonny Rogers, from his Celebration of Life program. (Photo: Abie Rogers)\nSonny Rogers was taken to Grady Memorial Hospital for treatment, according to his brother, and later underwent treatment at Shepherd Spinal Center.\nHe later was transferred to Safehaven, a facility in Rock Spring in northwest Georgia that specializes in caring for victims of brain injuries.\nMORE: Scaffolding falls on worker at new Atlanta Falcons stadium site\nAbie Rogers said he had worked in construction at the new stadium for about a year when he helped his brother, who was working in the food industry, join the building crew.\n“He was a Falcons fan,” Abie Rogers said of his brother. “It was an opportunity to help build the stadium.”\nHowever, Abie Rogers remembers getting a call from a friend, who told him, “‘Hey, man, I think a scaffold fell on your brother.’”\nBy the time Abie Rogers got to the scene, the scaffold had been removed.\n“(Sonny Rogers) was laying right there on ground level,” he recalled.\nSoon after, project director Pete Pemantell released a statement on behalf of the Holder, Hunt, HJ Russell and CD Moody construction companies, who worked on the stadium. He said Rogers was injured during “scaffold removal.”\nGround was broken in 2015 for the stadium, which opened for the 2017 football season.\nIn other news:","url":"https://www.ajc.com/news/local/worker-injured-during-construction-mercedes-benz-stadium-dies-brother-says/1G5g1Db000odjRcbdO7MrO/"}
