{"authors":["Patti Neighmond"],"date_download":"2018-10-23 05:45:16","date_modify":"2018-10-23 05:45:16","date_publish":"2015-03-17 00:00:00","description":"Overall, men were more likely to take their lives than women on the job. And workers between the ages of 65 and 74 were more likely to commit suicide at work than their younger counterparts.","filename":"data/vaneerConsumption/WorkplaceSuicideRatesRiseSharply.json","image_url":"https://media.npr.org/assets/img/2015/03/17/doctor-night_wide-d09a6ba503ad7aabeff306be965a9940bc2f14de.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2015_03_17_393627215_workplace-suicide-rates-rise-sharply_1540273516.html","title":"Workplace Suicide Rates Rise Sharply","title_page":"Workplace Suicide Rates Rise Sharply  : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Workplace Suicide Rates Rise Sharply\nEnlarge this image toggle caption 13/Image Source/Ocean/Corbis 13/Image Source/Ocean/Corbis\nSuicide rates in the U.S. have gone up considerably in recent years, claiming an average of 36,000 lives annually.\nMost people take their lives in or near home. But suicide on the job is also increasing and, according to federal researchers, suicide risk changes depending on the type of work people do.\nResearchers from the National Institute for Occupational Safety and Health analyzed census data and compared suicide rates among different occupations.\nThey found that, between 2003 and 2010, a total of 1,719 people died by suicide in the workplace. Rates of suicide on the job declined from 1.5 per million workers in 2003 to 1.2 per million in 2007. Then the rate climbed to 1.8 per million in 2010.\nOverall, men were more likely to take their lives than women. And older workers, those between the ages of 65 and 74, were more likely to commit suicide than their younger counterparts.\nThe study findings are being published by the American Journal of Preventive Medicine.\nWhy do some people choose the workplace to take their lives? Researchers don't know for sure but suggest that it could be an effort by some to protect family and friends from discovering their deceased body.\nJobs with greatest risk include law enforcement, firefighting and protective services, such as private detectives and security guards. The suicide rate for the group was 1.5 per million workers per year over the study period. The vast majority of these suicides (84 percent) involved firearms. Easy access to guns for some and the high stress in these jobs may both play roles in the workers' decisions about suicide.\nResearchers say financial woes and social isolation may be to blame for an increased suicide risk among workers in farming, fishing and forestry. This occupational group had the second-highest rate of workplace suicide at 5.1 per million.\nWorkers at car repair shops also face an elevated risk, due in part to chronic long-term exposure to toxic chemicals and solvents that could result in memory impairment, irritability, depressive symptoms, emotional instability and brain damage, all risk factors for suicide.\nMedical doctors are also at risk. And again, it's suspected that easy access to the means of suicide plays a role. In the case of doctors, the culprit is lethal medications.\nIn this analysis, suicide within the military was excluded since those deaths are tracked differently by the Department of Defense and the Veterans Affairs.\nResearchers say the findings of the analysis underscores the need for greater understanding of occupation specific risk factors in order to develop evidence based programs to fight suicide risk on the job.","url":"https://www.npr.org/sections/health-shots/2015/03/17/393627215/workplace-suicide-rates-rise-sharply"}
