{"authors":[],"date_download":"2018-10-22 21:45:04","date_modify":"2018-10-22 21:45:04","date_publish":"2016-11-16 00:00:00","description":"An estimated 4.2 million workers will become eligible to earn OT as a result of the new rule. But it's not clear for how long. President-elect Trump hasn't said what he'll do with the new regulations.","filename":"data/vaneerConsumption/WorkersWaitToSeeIfTrumpWhiteHouseReversesOvertimePayRule.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=502274797_1540244704.html","title":"Workers Wait To See If Trump White House Reverses Overtime Pay Rule","title_page":"Workers Wait To See If Trump White House Reverses Overtime Pay Rule : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nThe rules that govern who gets paid overtime are about to change. On December 1, an additional 4 million workers become eligible to earn overtime, although it is not clear for how long. The incoming administration of Donald Trump has not said what it will do with the new regulations. NPR's Yuki Noguchi reports on employees and employers in limbo.\nYUKI NOGUCHI, BYLINE: Human Resources Director Blair Boyer finally has Dion's Pizza in Albuquerque compliant with the new overtime rules.\nBLAIR BOYER: We've gotten in a good spot, but, man, it has been a lot of work.\nNOGUCHI: The complication - under the new rules, workers have to make more than $47,476 a year in order to be considered salaried and thus ineligible for overtime. But some Dion's store managers made less than that. To avoid paying overtime, Dion's had to boost their salaries by shifting away from the bonus system it had been using.\nBOYER: We're going to have to rob Peter to pay Paul. So we're going to have to move money out of a pay-for-performance segment into more guaranteed-type salary. And that just presents a lot of challenges in a competitive pay-for-performance organization because what you're effectively doing is shrinking the size of the carrot.\nNOGUCHI: In any presidential transition, previous policies are subject to review. Trump has pledged to undo President Obama's executive orders, dismantle the Affordable Care Act, reverse policies on clean air, immigration and on Dodd-Frank financial reform. This week, the Congressional Budget Office said canceling the overtime rule would reduce employers' compliance costs and boost profits, a point advocates refute. This leaves businesses wondering how they should proceed on rules that might be unwound. Josh King is chief legal officer for Avvo, an online legal services company.\nJOSH KING: Well, geez, you know, we're going to go down this path, and then things might really shift under us. And that's probably what the banks and financial institutions are thinking right now with respect to Dodd-Frank.\nNOGUCHI: King notes most laws cannot be undone right away. In most cases, regulations would have to be repealed by Congress, or an agency must undergo the lengthy process of vetting new proposals.\nKING: It won't happen overnight, at least with some agencies. But, I mean, you're going to see such a shift in approach and philosophy from the agencies. Some businesses and institutions, you know, might feel a little whipsawed by that.\nNOGUCHI: So it goes with the ultimate future of the overtime rules. Making matters more complex, today a group of 21 state attorneys general will ask a federal district court to block the rules from taking effect. Rachel Gebaide, an Orlando employment attorney, says she believes an injunction is unlikely, but says it raises questions.\nRACHEL GEBAIDE: Americans know about this. Well, what's going to happen? Am I going to get a raise, or am I going to be reclassified as a non-exempt employee so that I get overtime if I work more than 40 hours in a week?\nNOGUCHI: Gebaide notes President Obama expanded sick leave and increases to the minimum wage for federal contractors by executive orders. It will be hard to undo that even if the orders are reversed.\nGEBAIDE: Oh, we all have been earning sick leave, and we're taking that away now. That doesn't go over well.\nNOGUCHI: Blair Boyer at Dion's Pizza says he'll stick to the new rules regardless.\nBOYER: We may move forward with the plan that we have currently in place 'cause we want the end result being ease and simplicity of use on our employees and to not have such a dramatic shakeup. Oh, we were just kidding. You know, we're going to go back to where we were. That wouldn't be good for our culture.\nNOGUCHI: Who knows? Maybe the new administration won't reverse course. Yuki Noguchi, NPR News.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=502274797"}
iption process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2016/11/16/502274797/workers-wait-to-see-if-trump-reverses-overtime-pay-rule"}
