{"authors":[],"date_download":"2018-10-22 23:31:33","date_modify":"2018-10-22 23:31:33","date_publish":"2017-03-10 03:08:09","description":"South Korean President Park Geun-Hye is one of a long list of world leaders to have gone through an impeachment process or forced to resign following legal...","filename":"data/vaneerConsumption/Worldleadersoustedforlegalreasons.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/03/wire-193703-1489115292-55_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4299840_World-leaders-ousted-legal-reasons_1540251093.html","title":"World leaders ousted for legal reasons","title_page":"World leaders ousted for legal reasons | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Anti-government activists celebrate the dismissal of South Korean President Park Geun-Hye, March 10, 2017\nSouth Korean President Park Geun-Hye is one of a long list of world leaders to have gone through an impeachment process or forced to resign following legal proceedings against them.\nNot all impeachment proceedings are successful: The best-known survivor is probably former US president Bill Clinton, who remained in office despite an attempt to remove him owing to a sex scandal in 1999.\n- Impeached by parliament -\n- VENEZUELA: Then-president Carlos Andres Perez, accused of embezzlement and illegal enrichment, was suspended in May 1993 and his dismissal was confirmed by the Congress on August 31, 1993.\nPresident Nicolas Maduro is now battling opposition demands for a referendum on whether he should remain in office.\nFormer US president Bill Clinton is probably the best known survivor of impeachment proceedings after a sex scandal involving Monica Lewinsky (R)\n- ECUADOR: Abdala Bucaram, accused of siphoning off public funds, was dismissed on February 6, 1997 for \"physical and mental incapacity\", six months after his inauguration as president.\nIn April 2005, Lucio Gutierrez was accused of packing the supreme court with associates in the midst of a popular uprising and also dismissed from the presidency.\n- PERU: Alberto Fujimori on November 21, 2000 resigned from the presidency by fax from Tokyo, claiming Japanese nationality through his parents.\nCongress refused to accept the resignation and instead voted to sack Fujimori and ban him from public office for 10 years. Extradited, he was jailed for 25 years for having ordered massacres of civilians and for corruption.\n- INDONESIA: Abdurrahman Wahid, accused of incompetence and corruption, was dismissed from the presidency on July 23, 2001.\n- LITHUANIA: On April 6, 2004, president Rolandas Paksas was ousted by impeachment after being charged with granting Lithuanian citizenship to a Russian businessman in exchange for a payout. He was banned from standing for office in Lithuania, but was elected to the European Parliament in 2009.\n- PARAGUAY: Fernando Lugo was forced from the presidency on June 22, 2012 for dereliction of duty following his handling of a land dispute that left 17 people dead.\n- BRAZIL: Dilma Rousseff was ousted after the Senate voted on August 31, 2016 to impeach her for illegally manipulating the national budget.\n- Forced to resign -\n- UNITED STATES: President Richard Nixon resigned in August 1974 to avoid almost certain impeachment over the Watergate scandal.\n- BRAZIL: Fernando Collor de Mello, accused of corruption, resigned from the presidency on December 29, 1992 at the beginning of his impeachment hearing before the Senate.\n- ISRAEL: Following a tax fraud and corruption scandal president Ezer Weizman resigned in July 2000, preferring to throw in the towel rather than face possible impeachment proceedings.\nIn June 2007 president Moshe Katsav resigned as part of a plea bargain after being accused of rape and other sexual offences. In 2011 he was handed a seven-year prison term, before being freed in December 2016.\n- GERMANY: Christian Wulff resigned from the federal presidency in February 2012 after being stripped of his immunity following an accusation of influence peddling. He was later cleared.\n- GUATEMALA: Otto Perez, accused of being part of a ring of officials who took bribes to allow companies to import goods without paying import taxes, was stripped of his presidential immunity by parliament on September 1, 2015. Facing impeachment he stood down two days later, before being remanded in custody.\n- Procedures that failed -\nOther heads of state have been subject to impeachment procedures which did not succeed.\nThey include Russia's Boris Yeltsin in 1999, Luis Gonzalez Macchi in Paraguay in 2003, Roh Moo-Hyun in South Korea in 2004 and Hery Rajaonarimampianina in Madagascar in 2015.\nOn two occasions the US House of Representatives launched impeachment proceedings against the president, the first against Andrew Johnson in 1868 and then against Clinton in 1999. Both were later cleared by the Senate.","url":"https://www.dailymail.co.uk/wires/afp/article-4299840/World-leaders-ousted-legal-reasons.html"}
