{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:14:33","date_modify":"2018-10-30 20:14:33","date_publish":"2017-01-02 13:21:20","description":"Contents: Istanbul Turkey New Year's terror attack compared to Paris and Orlando attacks; Terror attacks expose deep divisions in Turkey's society | National Security","filename":"data/vaneerConsumption/WorldViewIstanbulTurkeyNewYearsTerrorAttackComparedtoParisandOrlandoAttacks.json","image_url":"https://media.breitbart.com/media/2017/01/turkey_nighclub_attack.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_01_02__1540930473.html","title":"World View: Istanbul Turkey New Year's Terror Attack Compared to Paris and Orlando Attacks","title_page":"World View: Istanbul Turkey New Year's Terror Attack Compared to Paris and Orlando Attacks | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nIstanbul Turkey New Year’s terror attack compared to Paris and Orlando attacks\nTerror attacks expose deep divisions in Turkey’s society\nIstanbul Turkey New Year’s terror attack compared to Paris and Orlando attacks\nReina nightclub in Istanbul on Sunday morning, several hours after the attack (EPA)\nThe people of Turkey were once again traumatized by a new terror attack, this time on a well-known Reina night club in Istanbul, where crowds of 700 people, both Turks and foreigners, were celebrating the New Year. At around 1:15 am on January 1, a gunman opened fire on people in the packed nightclub, killing at 39 people and injuring 65 others. The gunman fled and is still at large.\nNo one has claimed responsibility for the attack, but it’s believed to be the work of the so-called Islamic State (IS or ISIS or ISIL or Daesh), because of the similarity to attacks in Paris and Orlando, where attackers killed civilians indiscriminately in entertainment venues.\nIn Paris on November 13, 2015, three suicide bombers detonated themselves at a football (soccer) game. Then terrorists targeted three cafes and restaurants with gunfire, and then attacked the Bataclan theatre, where three gunmen opened fire on a large crowd. In all, 130 people were killed. These attacks were planned and carried out by an ISIS terror cell in Brussels.\nIn Orlando on June 12, 2016, 49 people were killed by a gunman at a local gay nightclub. The assailant had sworn allegiance to ISIS, but no concrete links were found.\nTurkey has suffered dozens of terrorist attacks in the past 18 months, killing hundreds of people. The perpetrators have been both ISIS and Kurdistan Workers’ Party (PKK), including the PKK offshoot Kurdistan Freedom Falcons (TAK). There have been four previous terrorist attacks in just the five weeks:\nNovember 24: Car bomb targeting a government building in Adana kills two people and injures 33.\nDecember 10 – TAK terrorist car bombing in Istanbul killed 44 people, wounding 155.\nDecember 17 – Suicide car bombing of a public bus in the central Anatolian city of Kayseri, killing 14 soldiers and wounding 55 others.\nDecember 19 — Assassination of Andrey Karlov, Russia’s ambassador to Turkey, in Ankara by an officer in Turkey’s security forces.\nThe Turkish people have been traumatized not only by the endless stream of terrorist attacks, but also by the July 15 failed coup attempt. Hurriyet (Ankara) and Daily Sabah (Ankara) and AP\nRelated Articles\nTerror attacks expose deep divisions in Turkey’s society\nEver since the July 15 coup attempt, Turkey’s president Recep Tayyip Erdogan has been fired or jailed well over 100,000 people. Erdogan has particularly targeted journalists that write dissenting articles, but the targeted people also include members of parliament and other politicians, judges, police, and teachers.\nSince many of the people targeted are from the political opposition or are dissenters from Erdogan’s policies, many people believe that Erdogan is using the coup attempt to eliminate his political enemies by force, including violence. This view is supported by the fact that Erdogan had already begun targeting the political opposition when he shut down the opposition newspaper Zaman several months before the coup attempt. These attacks have enormously polarized the Turkish people, with about half supporting Erdogan, and half despising him.\nOne analyst, Soner Cagaptay of the Turkish Research Program at the Washington Institute says that Turkey’s population is sharply divided into two approximately equal groups:\nAbout one-half of the country’s population comprise leftists, liberals, social democrats, Alevis (who are liberal Muslims), secularists and Kurds. Since taking office in 2003, Erdogan demonized, targeted, and brutally cracked down on these people, many of whom loathe him.\nThe other half is a loyal, right wing constituency, including Turkish nationalists, conservatives and Islamists. These people adore him.\nAnother analyst, Simon Waldman, notes that Erdogan’s reaction to the New Year’s attack was different from his reaction to other attacks in that, unlike other times, Erdogan did not refer to the people who were killed as “martyrs.” This word is almost always used by Erdogan with the death of a Turkish citizen in a terrorist attack or from military combat. But in this case, Erdogan said, “I offer my condolences to our citizens’, to our foreign guests’ and to our security officer’s families.”\nWaldman speculates that the reason is that the attack was on a nightclub where alcohol was served, and the people were celebrating not only the New Year but also Christmas, as these two holidays are often conflated by Muslims. These are secular things that are strongly condemned by hardcore conservative Muslim clerics, and indeed it’s suspected that the terrorist attack was inspired by opposition to Christmas and New Year’s parties. Indeed, the attacker was wearing a Santa Claus hat.\nIn fact, Hurriyet columnist Murat Yetkin suggests that the “poisonous” atmosphere in Turkey is because by “rising nationalist and religious chauvinism”:\n“Another question surrounds the political atmosphere in Turkey, which is getting more poisonous every day with rising nationalist and religious chauvinism. Religious Affairs Directorate head Mehmet Görmez was quick to make a statement after the attack, saying there was “no difference” between terror attacks targeting places of worship and attacks targeting entertainment sites, and they should be equally condemned. That statement followed cheering after the attack among certain social media users who believe that celebrating the New Year is un-Islamic and something to be despised. Görmez’s statement was welcome. But just two days before, the Friday sermon prepared by Görmez’s Diyanet and read in more than 80,000 mosques across Turkey harshly criticized New Year celebrations as illegitimate and having no place in Islam or Turkey’s cultural traditions. Only a few days ago, members of an ultranationalist group made headlines by performing street theater in the Western province of Aydin by pointing a pistol at the forehead of another militant dressed in a Santa Claus costume. Unlike the cases frequently opened against critical media in Turkey, the police and the courts took no action against them for “praising crime” or “stirring hatred among the people.””\nIn fact, many commentators are pointing out that Turks are now fighting each other as much as they’re fighting ISIS and the PKK. CNN and Globe and Mail (Canada) and Hurriyet (Ankara)\nRelated Articles\nKEYS: Generational Dynamics, Turkey, Istanbul, Reina nightclub, Recep Tayyip Erdogan, Paris, Bataclan, Orlando, Russia, Andrey Karlov, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh, Kurdistan Workers’ Party, PKK, Kurdistan Freedom Falcons, TAK, Soner Cagaptay, Simon Waldman, Murat Yetkin\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2017/01/02/2-jan-17-world-view-istanbul-turkey-new-years-terror-attack-compared-paris-orlando-attacks/"}
