{"authors":["Erica Tempesta For Dailymail.Com"],"date_download":"2018-10-23 00:56:49","date_modify":"2018-10-23 00:56:49","date_publish":"2016-01-29 14:36:03","description":"Jeweler George Pragnell has created a stunning infographic featuring the most iconic engagement rings through time, from Kate Middleton to Elizabeth Taylor and Audrey Hepburn.","filename":"data/vaneerConsumption/WorldsmosticonicengagementringsfromJackieKennedytoGraceKelly.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B2581900000578-0-image-a-38_1454073452818.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3421708_Forget-Mariah-Carey-s-new-bling-Jackie-Kennedy-Grace-Kelly-infographic-details-dazzling-history-world-s-iconic-engagement-rings_1540256209.html","title":"World's most iconic engagement rings from Jackie Kennedy to Grace Kelly","title_page":"World's most iconic engagement rings from Jackie Kennedy to Grace Kelly | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"With Valentine's Day around the corner, there will be sure to be plenty of romantic proposals, and while all engagement rings are supposed to last a lifetime, only a certain few have been deemed unforgettable.\nJeweler George Pragnell has created a stunning infographic featuring the most iconic engagement rings through time, including details about the legendary proposals in which they were presented. And while singer Mariah Carey's new bling from fiance James Packer might be dominating the media currently, the infographic details those timeless engagement rings that will likely be treasured forever - just like the women who have worn them.\nFrom Jacqueline Kennedy's breathtaking diamond and emerald design to Kate Middleton's sapphire originally worn by Princess Diana, these rings are as unique as the women who have worn them.\nAmerican royalty: John F. Kennedy is pictured walking alongside his bride Jacqueline Kennedy née Bouvier at their 1953 outdoor wedding reception in Newport, Rhode Island\nThe proposal: According to the infographic, there is some debate over how JFK actually proposed, with some believing that he popped the question over the phone, while others think it took place in person\nUnique design: JFK picked out this stunning ring featuring a 2.88 carat diamond and a 2.84 carat emerald for Jackie with the help of his father Joseph\nUnforgettable jewels: The beautiful ring, which also features round brilliant and marquise cut diamonds in addition to its two main stones, has an estimated value of $1.39 million\nJacqueline Kennedy née Bouvier\nJohn F. Kennedy kept Jacqueline Bouvier's known love of emeralds in mind when he picked out her yellow gold engagement ring with the help of his father Joseph. The extravagant ring boasts a 2.88 carat diamond and a 2.84 emerald that are flanked by tapered baguettes.\nJFK, who met his bride at a dinner hosted by mutual friends in Washington D.C. in 1951, proposed to her two years later on June 24, 1953.\nHowever, the details behind the mysterious proposal are unclear. While some claim he proposed over the phone, others say the engagement took place at a tavern in Georgetown. Meanwhile, other stories allege that he asked for her hand in marriage at the Boston hotel where he made his first public speech when he was six years old.\nThe couple got married on September 12, 1953 at St. Mary's Church in Newport, Rhode Island, and celebrated their wedding with a reception at her stepfather's Hammersmith Farm estate.\nAfter the wedding, the ring was remounted to replace the baguettes with round brilliant and marquise cut diamonds, totaling 2.12 carats. The ring's estimated value is now $1.39 million.\nAmerica's princess: Prince Rainier III of Monaco is posed with Grace Kelly on their wedding day on April 19, 1956 in Monaco\n'The Wedding of the Century': Grace and Ranier actually had two ceremonies, a civil service and then a Catholic Mass\nDazzling: Princess Grace's engagement ring features a stunning 10.47 carat emerald cut diamond, and now has an estimated value of $4.3 millon\nMade for a star: Prince Rainier first proposed to the actress with a more modest ring, but he upgraded to this stunning design after he realized other actresses were boasting much larger diamonds\nGrace Kelly\nGrace Kelly's whopping 10.47 carat emerald cut diamond engagement ring from Prince Rainier III of Monaco is undoubtedly stunning, however, the Prince had originally popped the question with a much more modest ring.\nOnce he realized that other actresses of her caliber were sporting more sizable rings, he opted to upgrade to a design that would never go unnoticed.\nThe American actress started a correspondence with the Prince after they first met in Cannes. When she went to visit him over the Christmas holiday in 1955, he asked her to marry him only three days later.\nThe engagement was announced in January 1956, and the two wed on the 18th and 19th of April that year with two separate ceremonies. The had a civil ceremony in the Palace of Monaco the day before they said 'I do' during a Catholic mass in Monaco's Cathedral.\nThe breathtaking ring, which now has an estimated value of $4.3 million, was later became the her character's engagement ring in the film High Society specifically because she was never supposed to take it off.\nHistory event: Queen Elizabeth and Prince Philip, Duke of Edinburgh pose together at Buckingham Palace after their wedding ceremony at Westminster Abbey in London on 20th November 1947\nLong-time friends: The Queen met Philip when she was just 13-years-old, at the wedding of his cousin, Princess Marina of Greece\nThroughtful touch: Prince Philip has the platinum and diamond engagement ring using diamonds that were taken from a tiara worn by his mother, Princess Andrew of Greece and Denmark\nElegant design: Queen Elizabeth's ring features a three carat brilliant cut diamond as the center stone set in an eight claw coronet setting\nQueen Elizabeth\nBefore Prince Philip proposed to Queen Elizabeth in 1946, he commissioned Philip Antrobus to design and manufacture her platinum and diamond engagement ring using diamonds that were taken from a tiara worn by his mother, Princess Andrew of Greece and Denmark.\nThe exquisite design features a three carat brilliant cut diamond as the center stone set in an eight claw coronet setting. The ring, which now has an estimated value of $144,000, also has four brilliant cut diamonds on each shoulder.\nPhilip, who met Elizabeth when she was just 13 years old, at the wedding of his cousin Princess Marina of Greece, propose to her during a walk around the family estate in Balmoral during the summer of 1946. And while Elizabeth immediately said yes, her father later insisted that she kept their engagement a secret until she turned 21 the following year.\nThe couple married on November 20, 1947 at Westminster Abbey in London with 2,000 guests invited to their royal wedding.\nClassic beauty: Audrey Hepburn and Mel Ferrer are pictured on their wedding day on September 24, 1954\nTrue romance: The infographic details the romantic moment that Mel proposed to Audrey, while the pair were enjoying a getaway in Switzerland\nNon-traditional: When proposing to Audrey, Mel gave her a stackable diamond eternity band and two wedding bands, so she could mix and match the designs\nFashion icons: Audrey can be seen wearing one of the bands on her finger while she and her husband celebrated costume designer Edith Head's birthday in 1955\nAudrey Hepburn\nMel Ferrer considered Audrey Hepburn's iconic style before he chose a non-traditional stacked set of bezel rings, thinking she could mix and match the rings to correlate for her moods and outfits.\nAudrey's diamond baguette white gold eternity ring featuring a total of 1.5 carats was paired with two wedding bands, one in yellow gold and the other in rose gold.\nMel, who met Audrey at a film party in London in December 1953 after they were introduced by actor Gregory Peck, proposed to her in August 1954 while holding her in his arms in a garden overlooking Lake Lucerne in Switzerland.\nInstead of just accepting his proposal, Audrey sent him a platinum watch engraved with the phrase 'Mad About The Boy' from the Noel Coward song of the same name.\nThe couple wed on September 24, 1954 during a private ceremony attended by close family and friends in the same area where their engagement had taken place.\nMore than 60 years later the stackable rings are now worth an estimated $10,000.\nLove story: Elizabeth Taylor and Richard Burton are pictured at their first wedding on March 15, 1964. The legendary couple married twice, but both marriages ended in divorce\nLow-key: While the proposal, and the ring itself, may have been decadent, Elizabeth and Richard's wedding was a much more quiet affair, with just nine people in attendance\nLarger than life: Richard proposed to Elizabeth with a massive platinum and 33.19 carat diamond ring\nNamesake: The massive diamond, which was formerly known as 'The Krupp Diamond' was later renamed 'The Elizabeth Taylor Diamond'\nElizabeth Taylor\nOf all the iconic engagement rings featured in this list, Elizabeth Taylor's diamond is by far the largest.\nAfter meeting on the set of Cleopatra in 1963, Richard Burton proposed to her with a diamond and platinum ring featuring a jaw-dropping 33.19 carat center stone and two tapered baguette cut diamonds on their yacht while it was docked on the River Thames in London.\nOnly nine people witnessed Richard and Elizabeth say 'I do' during a casual ceremony in Montreal on March 15, 1964. However, the couple would go on to get married and divorced twice during their tumultuous relationship.\nThe massive diamond in Elizabeth's engagement ring, which was formerly known as 'The Krupp Diamond' was later renamed 'The Elizabeth Taylor Diamond'.\nIt is now worth an estimated $8.2 million.\nStunning newlyweds: Kate Middleton and Prince William are pictured on the balcony at Buckingham Palace following their wedding at Westminster Abbey on April 29, 2011\nTradition: The Prince asked his future bride's father for permission before proposing to her\nFamily heirloom: Prince William proposed to Kate with a beautiful 12 carat blue Ceylon sapphire ring that belonged to his mother, Princess Diana\nWorth the price: While the ring was purchased for $40,000 in 1981, it is now estimated to be worth $430,000\nKate Middleton\nWhen Prince William proposed to Kate Middleton in 2010 he opted to pop the question with a precious family heirloom that belonged to his late mother Princess Diana.\nThe beautiful 18 karat white gold ring featuring a 12 carat oval blue Ceylon sapphire stone surrounded by 14 solitaire diamonds was handpicked by Diana herself. When Prince Charles proposed to Diana, he presented her with a selection of rings to choose from, and she opted for the now-legendary sapphire stunner.\nThe Duke and Duchess of Cambridge met at St. Andrews University in Scotland, and legend has it that he first laid on his future wife when she walked down the runway at a charity fashion show held at the university. After asking Kate's father for permission, William proposed to her during a private holiday in Kenya.\nWhen the engagement was announced, Prince William said the the ring was 'very special' to him, explaining that giving it to Kate was his way of making sure his mother 'didn't miss out'.\nThe couple's wedding, which was broadcast on television and online in more than 180 countries, was held at Westminster Abbey in London on April 29, 2011.","url":"https://www.dailymail.co.uk/femail/article-3421708/Forget-Mariah-Carey-s-new-bling-Jackie-Kennedy-Grace-Kelly-infographic-details-dazzling-history-world-s-iconic-engagement-rings.html"}
