{"authors":["John J. Xenakis"],"date_download":"2018-10-30 19:02:30","date_modify":"2018-10-30 19:02:30","date_publish":"2015-04-08 11:00:53","description":"Bashar al-Assad's Syria army showing signs of collapse; Why do Awakening era civil wars always fizzle?; US speeds up weapons deliveries to militias in Yemen |","filename":"data/vaneerConsumption/WorldViewBasharalAssadsSyriaArmyShowingSignsofCollapse.json","image_url":"https://media.breitbart.com/media/2015/02/Assad-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_08__1540926150.html","title":"World View: Bashar al-Assad's Syria Army Showing Signs of Collapse","title_page":"World View: Bashar al-Assad's Syria Army Showing Signs of Collapse | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nBashar al-Assad’s Syria army showing signs of collapse\nWhy do Awakening era civil wars always fizzle?\nUS speeds up weapons deliveries to militias in Yemen\nBashar al-Assad’s Syria army showing signs of collapse\nAl-Assad’s warplanes bomb the town of Kasab in Latakia province, after the army loses the town to opposition forces (Anadolu)\nIt was just last year that Syria’s president Bashar al-Assad was claiming that, in 2015, his army would defeat all terrorists and their supporters in Syria, blaming the terrorism on Israel and its allies.\nBlaming Israel for the rise of Islamic State (IS, ISIS, ISIL, Daesh) and Jabhat al-Nusra (al-Nusra Front) in Syria would have to be considered at best a fantasy and at worst a delusion. But the promise of victory in 2015 is perhaps the biggest self-delusion of all, and appears less and less likely each week.\nA major turning point in the international perception of al-Assad’s army occurred a couple of weeks ago, when the regime’s army suffered a major military setback and was defeated by Jabhat al-Nusra, which captured Idlib. That was in northern Syria. Al-Assad’s army is faring no better in southern Syria, where ISIS captured Syria’s Yarmouk refugee camp, putting ISIS within a few miles of al-Assad’s seat of power in Damascus.\nAl-Assad’s reaction to those defeats is to bomb both Idlib and Yarmouk. Bombing these cities will be very effective in killing innocent women and children, but will do very little to stop the advance of al-Nusra and ISIS.\nNew reports indicate that these two defeats are not flukes, and that al-Assad’s army is badly fracturing.\nAl-Assad is a member of the Shia Alawite race, which broke away from mainstream Shia Islam in the ninth century. Since many of the forces that al-Assad’s army is fighting are Sunnis, al-Assad does not trust Sunnis in his own army, for fear that they will defect to the other side.\nThe result is that Alawites form the bulk of al-Assad’s army, and are suffering the bulk of casualties, even though they are only a tenth of Syria’s population.\nThe figures are staggering. There were about two million Alawites at the start of the war, with perhaps 250,000 men of fighting age. Today, as many as one-third of these are dead. Over 22,000 al-Assad soldiers and militiamen were killed in 2014 alone, the bulk of them Alawites.\nWhen ordinary Alawite soldiers die in al-Assad’s army, their corpses are returned to their homes piled up in plain pickup trucks. They are followed by the “press gangs”: military recruiters raid Alawite houses to find replacements, and force them into the army.\nThe result is that the Alawites are trapped — hated by the Sunnis for joining the army and killing Sunnis, but unable to escape the clutches of the press gangs.\nThis explains why al-Assad’s army appears to be collapsing. At the beginning, al-Assad promised the Alawites quick victories and rich rewards. Those promises have gone the way of “you can keep your doctor.” Today, the Alawites do not wish to be in the army, and probably couldn’t care less who’s in control of Idlib or Yarmouk. Telegraph (London) and Joshua Landis and Guardian (London)\nWhy do Awakening era civil wars always fizzle?\nI’ve been criticized for writing in 2011, and repeating several times, that a crisis civil war cannot continue for long in a generational Awakening era, and so Syria’s civil war would soon fizzle. The criticism was that this prediction allegedly turned out to be false.\nActually, from the point of view of Generational Dynamics, the civil war in Syria fizzled some time ago, and so the prediction turned out to be true. Certainly what’s going on today cannot seriously be called a civil war, certainly not in the sense of generational theory. On the one hand, you have Bashar al-Assad’s fracturing army of Alawites, as described in the story above, surviving only because of massive supplies of weapons from Russia, and troops from Hezbollah and Iran. On the other hand, you have the Islamic State (IS or ISIS or ISIL or Daesh) depending on thousands of jihadists from countries around the world, and a weak Free Syrian Army.\nBut let’s dig deeper into this. Why is this not a real civil war, and why did it have to fizzle?\nLet’s start with what a real civil war would look like from the point of view of generational theory. You would have the Alawites full of hatred for the Sunnis and the Sunnis full of hatred for the Alawites, with each side wishing to exterminate the other. That’s what a crisis civil war would look like. The last one occurred in the 1970s and early 1980s, and the previous one occurred roughly 70 years earlier during World War I and the collapse of the Ottoman Empire.\nEvery generational crisis war ends in what I like to call an “explosive climax,” something so horrible that both winners and losers are traumatized by it. In World War II, America and the allies firebombed Dresden and Tokyo, and nuked two Japanese cities. Today, these acts are generally accepted as necessary to have protected American lives, but in the decades after the war, these acts were widely condemned by armchair critics.\nHowever, the “explosive climax” need not be an actual explosion, because it refers to a political explosion. Actually, there were two such explosive climaxes in the region in 1982. The Palestinian refugee camps at Sabra and Shatila in Lebanon were the site of a massacre of Palestinian refugees in camps 1982. And Syria’s last extremely bloody civil war climaxed in the 1982 slaughter of tens of thousands of Syrians in Homs.\nLike the actions that ended World War II, these mass slaughters still weigh heavily on the psyches of the survivors of the Syrian and Lebanese civil wars, respectively, of the 1980s. I discussed this fear several times with regard to Lebanon in the 2006 war between Israel and Hizbollah. I quoted Lebanese President Émile Geamil Lahoud as saying:\nBelieve me, what we get from [Israeli bombers] is nothing compared to [what would happen] if there is an internal conflict [a new civil war] in Lebanon. So our thanks comes when we are united, and we are really united, and the national army is doing its work according to the government, and the resistance [Hizbollah] is respected in the whole Arab world from the population point of view. And very highly respected in Lebanon as well.\nThe Lebanese feared, above all else, a repeat of something like the 1982 massacre at Sabra and Shatila, and considered that to be a worse possibility than Israeli bombers.\nSo now returning to today’s situation in Syria, we have a population of Syrians with no desire for a civil war, who are being propelled by forces beyond their control. The Alawites vividly recall the horrors of what happened in 1982, and have no desire to repeat them. The Sunnis, whose women and children are being bombed every day by al-Assad’s warplanes, with bombs supplied by Russia, have responded by creating ISIS and al-Nusra, and recruited jihadists from around the world to fight al-Assad, his Russian weapons, and his Hezbollah and Iranian allies. AP\nUS speeds up weapons deliveries to militias in Yemen\nThe war in Yemen escalated by one more step on Tuesday, when the US announced that it was setting up an American coordination center in Saudi Arabia, and would speed up weapons deliveries to anti-Houthi militias in Aden, in south Yemen. According to US Deputy Secretary of State Antony Blinken in Riyadh:\nSaudi Arabia is sending a strong message to the Houthis and their allies that they cannot overrun Yemen by force. As part of that effort, we have expedited weapons deliveries, we have increased our intelligence sharing, and we have established a joint coordination planning cell in the Saudi operation centre.\nSaudi airstrikes so far have failed to stop the Houthis, and officials hope that expedited weapons deliveries will help. Reuters\nKEYS: Generational Dynamics, Syria, Bashar al-Assad, Idlib, Alawites, Shias, Sunnis, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh, Jabhat al-Nusra, al-Nusra Front, Yarmouk refugee camp, Lebanon, Sabra, Shatila, Homa, Dresden, Tokyo, Émile Geamil Lahoud, Russia, Yemen, Saudi Arabia, Houthis, Aden, Antony Blinken\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/04/08/world-view-bashar-al-assads-syria-army-showing-signs-of-collapse/"}
