{"authors":["John J. Xenakis"],"date_download":"2018-10-30 19:05:53","date_modify":"2018-10-30 19:05:53","date_publish":"2017-01-10 14:33:28","description":"Contents: Thousands of migrants risk freezing to death as deep freeze spreads across Europe; Migrants in eastern Europe trapped in deep freeze temperatures; European Commission resettlement plan appears to be a disaster | National Security","filename":"data/vaneerConsumption/WorldViewThousandsofMigrantsTrappedinDeepFreezeTemperaturesinGreece.json","image_url":"https://media.breitbart.com/media/2017/01/wi/ap/09/14nb72o-e1484058802658.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_01_10__1540926353.html","title":"World View: Thousands of Migrants Trapped in Deep Freeze Temperatures in Greece","title_page":"World View: Thousands of Migrants Trapped in Deep Freeze Temperatures in Greece | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nThousands of migrants risk freezing to death as deep freeze spreads across Europe\nMigrants in eastern Europe trapped in deep freeze temperatures\nEuropean Commission resettlement plan appears to be a disaster\nThousands of migrants risk freezing to death as deep freeze spreads across Europe\nScreen grab from viral video showing migrant tents on Lesvos island\nEurope’s migrant crisis has been mostly out of news since March 18 of last year, when the EU and Turkey signed their migrant deal, in which Turkey agreed to police the flow of migrants from Turkey across the Aegean Sea to Greece.\nEven though it has been out of the news, severe problems still remain. There are about 60,000 migrants still in Greece. When migrants travel from Turkey across the Aegean Sea, they usually stop at Greece’s Lesvos Island, because it is close to Turkey, and because they have been welcomed by the Lesvians in the past. There are over 6,000 migrants at the Moria refugee camp on Lesvos Island, far over its capacity of 3,500, and the number is still increasing by a few dozen every day, since the Turkey blockade isn’t completely effective. About 1,000 are living in tents covered with snow.\nThere are 15,600 migrants on all the Greek islands put together. Last week, Greece’s Migration Minister Yiannis Mouzalas said:\nThere are no refugees or migrants living in the cold anymore. We successfully completed the procedures for overwintering.\nSo a volunteer worker posted a video showing migrants on Lesvos living in extremely harsh conditions, with no heat and their tents buckling under the heavy snow.\nEuropean Commission spokeswoman Natasha Bertaud called the situation “untenable,” but that the Commission was ready to help:\nWe can no more dictate policy in Greece than we can in any other member state. I have to be quite clear here, the commission is aware that the situation is untenable but we also have to be clear as I was saying that ensuring adequate reception conditions in Greece is a responsibility of Greek authorities. … We are pursuing a dual strategy of political pressure and financial and technical support to the Greek authorities to improve the situation.\nShe explained that by “political pressure,” she meant a continued series of recommendations by the EC in its reports to Greece. Greek Reporter and EU Observer and EurActiv\nRelated Articles\nMigrants in eastern Europe trapped in deep freeze temperatures\nWhen the so-called “Balkan route” was closed to migrants last year, it left thousands of them stranded. More than 7,500 people are currently stranded in Serbia, living in overcrowded camps and informal settlements. In Belgrade, around 2,000 young people, mainly from Afghanistan, Pakistan, Iraq and Syria are currently sleeping in abandoned buildings in the city center, while temperatures plummet to as low as -20°C (-4°F). Médecins Sans Frontières (MSF) and Deutsche Welle and Reuters\nRelated Articles\nEuropean Commission resettlement plan appears to be a disaster\nDuring the first week of 2017, 373 refugees and migrants crossed the sea from Turkey to Greece, an average of 53 per day. Most arrivals were from Syria, Afghanistan and Iraq. Most arrived on the islands Chios and Lesvos.\nDuring the same week, 1,080 people arrived by sea to Italy, mostly as a result of Italian and European search and rescue operations in the Mediterranean Sea. Most arrivals were from Nigeria, Eritrea, Guinea, Côte d’Ivoire, and Gambia, with lesser numbers from . Senegal, Mali, Sudan, Somalia and Bangladesh.\nIn September 2015, the European Commission adopted an “emergency relocation scheme,” whereby 160,000 refugees, mostly in Greece and Italy, were supposed to be relocated to other EU countries.\nHowever, the program has been something of a disaster. Out of the 160,000, only 8162 people were relocated since the beginning of the scheme. Austria, Denmark, Hungary and Poland have refused to take any migrants at all. The Czech Republic has taken 12, and Slovakia has taken 9.\nWith the rise of far-right, anti-migrant and even anti-EU populism growing in Europe, it seems unlikely that any of these problems will be resolved soon. UN High Commissioner for Refugees (UNHCR) and European Commission (PDF) and Daily Sabah (Turkey)\nRelated Articles\nKEYS: Generational Dynamics, Greece, Turkey, Lesvos Island, Aegean Sea, Yiannis Mouzalas, Natasha Bertaud, Balkan route, Serbia, Belgrade, Hungary, European Commission, Syria, Afghanistan, Iraq, Nigeria, Eritrea, Guinea, Côte d’Ivoire, The Gambia, Senegal, Mali, Sudan, Somalia, Bangladesh, emergency relocation scheme\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2017/01/10/10-jan-17-world-view-thousands-migrants-trapped-deep-freeze-temperatures-greece-balkans/"}
