{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:46:41","date_modify":"2018-10-30 20:46:41","date_publish":"2015-02-21 12:00:46","description":"U.N. may release list of Syrian war criminals; Greece apparently caves in on bailout crisis |","filename":"data/vaneerConsumption/WorldViewUNMayReleaseListofSyrianWarCriminals.json","image_url":"https://media.breitbart.com/media/2015/02/M_Id_387513_Bashar_al-Assad.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_21__1540932401.html","title":"World View: U.N. May Release List of Syrian War Criminals","title_page":"World View: U.N. May Release List of Syrian War Criminals | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nU.N. may release list of Syrian war criminals\nGreece apparently caves in on bailout crisis\nU.N. may release list of Syrian war criminals\nBashar al-Assad is thought to be on the United Nations list of Syrian war criminals\nThe investigators at the U.N. Commission for Inquiry on Syria announced on Friday that there has been an ‘exponential rise” in atrocities killed in Syria, and that, because Russia’s veto prevents the Security Council from taking any action, they may go around the Security Council and reveal a list of alleged war criminals in Syria. The list is thought likely to contain the name of Syria’s president Bashar al-Assad.\nThe Commission would have liked to refer the case to the International Criminal Court (ICC), but that requires a vote of the Security Council, which Russia always blocks with a veto. The Commission is therefore recommending a special court without Security Council approval.\nUnited Nations investigators found a way to go around the Security Council once before. After Bashar al-Assad used Sarin gas to kill hundreds of people in 2013, a U.N. chemical weapons team was authorized to investigate the incident. However, thanks to a threatened Russian veto, the U.N. team was forbidden from assigning blame for the Sarin attack. But the team found a clever way of assigning blame without having to say it. In their scientific analysis of the evidence, they included calculations of the trajectories of the rockets that delivered the Sarin gas. They drew no conclusions about where the rockets were launched, but they provided enough scientific information within the report so that experts studying the report could analyze the trajectories to prove that the rockets must have been launched from a Syrian Republican Guard unit.\nBashar al-Assad has been a modern day Hitler. He has flattened entire Sunni villages with Russia’s heavy weapons, he has killed children by sending missiles into exam rooms and bedrooms, he has killed dozens with sarin gas, and he has killed countless more with barrel bombs loaded with explosives, metals, and chlorine gas. In addition, he has used electrocution, eye-gouging, strangulation, starvation, and beating on tens of thousands of prisoners on a massive “industrial strength” scale, and does with complete impunity, and in fact with encouragement and support from Russia and Iran. Russia in particular has been providing weapons to al-Assad to support his genocide, making Vladimir Putin a war criminal as well.\nIf the war criminal list is made public, then it will be done at the meeting of the UN Human Rights Council on March 17th. United Nations and BBC and VOA\nGreece apparently caves in on bailout crisis\nThe Eurogroup of eurozone financial ministers meeting in Brussels on Friday announced a new deal with Greece that extends the bailout loan agreement for four months. The agreement was an almost total cave-in by the Greeks; however, there was one important concession: the Greeks will not be required to have a higher government surplus in 2015 than in 2014, which means that there will be no further austerity measures imposed this year. Other than that, the terms of the agreement were similar to those of Greece’s previous government, and an abandonment of the promises that the new prime minister, Alexis Tsipras, made during his recent election campaign.\nThe terms of the agreement are as follows:\nAs a concession to Greece, the government surplus will this year will not have to be higher than last year.\n“The Greek authorities reiterate their unequivocal commitment to honor their financial obligations to all their creditors fully and timely.”\n“The Greek authorities commit to refrain from any rollback of measures and unilateral changes to the policies and structural reforms that would negatively impact fiscal targets, economic recovery or financial stability, as assessed by the institutions.”\nThe Greeks must submit an Action Plan on Monday, February 23, based on the previously committed bailout agreement. The Action Plan will be reviewed at another emergency Eurogroup meeting to be held on Tuesday.\nThe action plan must specify how Greece will implement the austerity requirements that they’ve previously committed to. This is a complete reversal of the promises that the Tsipras government made in order to get elected.\nThe action plan must be approved by the Eurogroup.\nThe action plan must be approved by Greece’s parliament. There are concerns that there will be a political backlash among the Greek people, and in the worst case scenario his government may fall, and be replaced by something even worse.\nThe action plan must be approved by the governments or parliaments of all 19 eurozone countries. That’s going to take a lot of time.\nTherefore, Greece doesn’t get money until April. However, the nation will run out of money in March, so some additional change will be needed — either to provide an early loan, or to allow Greece’s banks once again to borrow from the European Central Bank (ECB).\nRemember when we used to talk about “kicking the can down the road”? Amazingly enough, the Europeans have done it again.\nIf anything goes wrong with all of these steps, then the plan will collapse, and Greece will go bankrupt, and probably be forced to leave the eurozone, to return to its old drachma currency.\nBut if all goes well, then by April the crisis will be resolved. Until June, when a new 3.5 billion euro debt payment comes due, and the whole crisis starts all over again.\nIt is worth repeating what I have been saying for several years: There is NO solution to this crisis. And by that I don’t mean that no one has been clever enough to figure out a solution. I mean that no solution exists. So the only thing the Europeans can do is to keep postponing the problem — kicking the can down the road, allowing the crisis tow orsen each time. Greek Reporter and Kathimerini\nKEYS: Generational Dynamics, Syria, Bashar al-Assad, Sarin gas, Hitler, U.N. Commission for Inquiry on Syria, Russia, Vladimir Putin, UN Human Rights Council, International Criminal Court, Greece, eurozone, Eurogroup, Alexis Tsipras\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/02/21/world-view-u-n-may-release-list-of-syrian-war-criminals/"}
