{"authors":["Will Martin"],"date_download":"2018-10-31 00:31:39","date_modify":"2018-10-31 00:31:39","date_publish":"2018-07-09 00:00:00","description":"Prior to the tournament, Goldman used machine learning to simulate 1 million variations and pick a winner. It initially forecast a final between Brazil and Germany, with Brazil expected to ultimately triumph. The bank has changed that prediction several times.","filename":"data/vaneerConsumption/WorldCuppredictionsGoldmanSachsAImodelBelgiumandEnglandfinal.json","image_url":"https://amp.businessinsider.com/images/5b434bdbc05c09a42f8b48a0-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_world-cup-predictions-goldman-sachs-ai-model-belgium-england-final_1540945899.html","title":"World Cup predictions: Goldman Sachs AI model, Belgium and England final","title_page":"    World Cup predictions: Goldman Sachs AI model, Belgium and England final - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"England's Harry Kane will face off against Belgium's Romelu Lukaku in the World Cup final, according to Goldman Sachs. Reuters; Reuters\nGoldman Sachs has changed it's mind about the World Cup final — again.\n\"With Brazil now out of the World Cup, Belgium is at the top of our probability table,\" Goldman's analysts wrote.\nBelgium beat Brazil 2-1 in Sochi on Friday night, and are now the most likely team to take home the trophy, with a 32.6% chance of winning, according to Goldman.\nBefore this year, Belgium's best ever World Cup performance was a fourth place finish in 1986. It is now guaranteed to at least match that, but Goldman expects the country to do much better.\nGoldman has good news for England fans, forecasting the team will be victorious in its semifinal against Croatia on Wednesday, reaching only its second final, and the first since 1966 — the only time England won the World Cup. Previously, it had forecast that England would lose the Croatia game.\nDespite Goldman's forecast that England will make the final, it is actually only the third favorite to win, behind Belgium's semifinal opponent France, which has a 29.8% chance of overall victory.\nFrance comfortably defeated Uruguay 2-0 in the quarter finals, but is likely to fall short against its neighbor, Goldman said.\nPrior to the tournament, Goldman used machine learning to simulate 1 million variations and pick a winner. It initially forecast a final between Brazil and Germany, with Brazil expected to ultimately triumph.\nAs the group stage neared its conclusion, Goldman changed its mind to forecast that it would be England facing off against the Brazilians in the final, although Brazil would still triumph. Then last week, it predicted a Brazilian victory, only this time against Croatia.\nYou can see Goldman's full updated bracket below:","url":"https://www.businessinsider.com/world-cup-predictions-goldman-sachs-ai-model-belgium-england-final"}
