{"authors":["John J. Xenakis"],"date_download":"2018-10-30 19:03:18","date_modify":"2018-10-30 19:03:18","date_publish":"2015-02-18 12:00:29","description":"Taliban claims responsibility for bombing in Lahore, Pakistan; Russians ignore Ukraine 'ceasefire' as 5,000 Ukrainian troops are trapped; New Zealand debating military help for Iraq against ISIS |","filename":"data/vaneerConsumption/WorldViewRussiansIgnoreCeasefireWith5000UkrainianTroopsTrapped.json","image_url":"https://media.breitbart.com/media/2015/01/russia-seperatists-ukraine-REuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_18__1540926198.html","title":"World View: Russians Ignore 'Ceasefire' With 5,000 Ukrainian Troops Trapped","title_page":"World View: Russians Ignore 'Ceasefire' With 5,000 Ukrainian Troops Trapped | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nTaliban claims responsibility for bombing in Lahore, Pakistan\nRussians ignore Ukraine ‘ceasefire’ as 5,000 Ukrainian troops are trapped\nNew Zealand debating military help for Iraq against ISIS\nTaliban claims responsibility for bombing in Lahore, Pakistan\nPolice rush an injured man to hospital after suicide bombing in Lahore on Tuesday (AP)\nA suicide bomber detonated his bomb early afternoon Tuesday in the large east Pakistan city of Lahore, in Punjab province, killing as many as 11 people and injuring dozens more. The target was a police station. The carnage could have been much worse, but heavy security stopped the suicide bomber before entering the building.\nJamaatul Ahrar, a breakaway faction of the Pakistani Taliban (Tehrik-e-Taliban – TTP), has claimed responsibility. According to the Jamaatul Ahrar spokesman, the attack was revenge for the anti-Taliban military operations being conducted in Pakistan’s tribal areas, and for hangings of several convicted terrorists. A massive terrorist attack on the Jinnah International Airport in Karachi last year in June triggered the military action. The hangings began after the horrific Taliban attack on a Peshawar army school, killing over 130 schoolchildren in December of last year.\nLast Friday, Taliban militants stormed a Shia commemoration service, killing as many as 21 Shia worshippers. Before that was a service in Shikarpur, killing more than 60 people.\nAs we dwell on atrocities committed in the Mideast by terror groups linked to the Islamic State (IS or ISIS or ISIL or Daesh), it would be worthwhile to give an occasional thought to Pakistan, where Taliban atrocities are almost a daily way of life. Dawn (Pakistan) and Daily Times (Pakistan)\nRussians ignore Ukraine ‘ceasefire’ as 5,000 Ukrainian troops are trapped\nA ceasefire agreement was signed in Minsk, Belarus, last week, but it is being openly ignored by anti-government Russians who are advancing on the central city of Debaltseve, where 5,000 Ukrainian troops are trapped. The Russians are simply saying that the ceasefire does not apply to them, and they are continuing warfare.\nWilliam Taylor, a former American ambassador to Ukraine, provided a good summary of the situation in an interview on the BBC on Tuesday. He was asked whether the new Minsk ceasefire agreement is going to hold (my transcription):\nIt doesn’t look good at the moment. All is not lost, it’s still possible for the Minsk II agreement to be put into effect, but it has to be put into effect by both sides. The weapons were supposed to have been pulled back by now, well out of range of each other’s. This is a tragedy for the people in the cities, tragedy for people who are living there, but it can be resolved by adhering to this agreement. [[Question: Would you point the finger of blame equally at the rebels and the Ukrainian troops]] I wouldn’t. I would point the blame at the Russian troops who are in eastern Ukraine. There may be rebels there, maybe Ukrainian rebels are there, but there are Russian troops, and Russian soldiers, and Russian units who are there, who are the principal cause of this overall problem. [[Question: When you look at what’s happening, it looks as if those troops have not even paid lip service to what was agreed in Minsk. Did that take the West by surprise do you think?]] I think it has. The rebels and the Russians who are there in the Debaltseve have said that the Minsk agreement doesn’t apply to Debaltseve. Now, what does that mean? They’re clearly in the zone that both sides are supposed to pull back from. Of course the Minsk agreement applies to Debaltseve, and of course they should be pulling back, and the ceasefire should have gone into effect.”\nIt is worth repeating again that anything said by Russian officials or Russian media is pretty much worthless. Last year, Russia claimed they were not invading Crimea, just as Russian troops were invading Crimea. Russia claimed that they would not annex Crimea, just before they annexed Crimea, a clear violation of international law. Russia claimed that there were no Russian troops in east Ukraine at a time when Russian troops were entering east Ukraine. On September 5, Russia signed an international peace agreement (the “Minsk protocols”) in which they committed to a political compromise in east Ukraine, and then repeatedly violated their own agreement. Now they have signed a new Minsk agreement on February 11, and are simply ignoring it. Basically, anything that comes from Russian state media or Russia’s government should be considered to be a lie, and should be discarded as worthless.\nThe concern now is that the ceasefire will unravel completely and lead to increased violence, including a full-scale invasion by Russia. Washington Post and Russia Today (12-Feb)\nNew Zealand debating military help for Iraq against ISIS\nAfter an in-person invitation by Iraq’s foreign minister Dr Ibrahim al-Jaafari in a visit to Auckland, New Zealand, foreign minister Murray McCully said that plans were being discussed to send about 150 New Zealand troops to Iraq to help train Iraq’s army. The suggestion is controversial, with some politicians questioning whether the Iraq army can protect the NZ troops, while others wonder if NZ is getting into “another Vietnam.” TV New Zealand and Stuff (New Zealand)\nKEYS: Generational Dynamics, Pakistan, Punjab, Lahore, Tehrik-e-Taliban, TTP, Pakistan Taliban, Karachi, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh, Russia, Ukraine, Debaltseve, Minsk, Belarus, William Taylor, Crimea, New Zealand, Iraq, Ibrahim al-Jaafari, Murray McCully, Vietnam\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/02/18/world-view-russians-ignore-ceasefire-with-5000-ukrainian-troops-trapped/"}
