{"authors":["Associated Press"],"date_download":"2018-10-22 20:40:35","date_modify":"2018-10-22 20:40:35","date_publish":"2016-01-28 02:43:36","description":"KANOYA, Japan (AP) — One of Mitsubishi's legendary World War II fighter planes took to the skies over Japan on Wednesday. The restored \"Zero\" fighter made a ...","filename":"data/vaneerConsumption/WorldWarIIZerofighterfliesoverJapan.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:84f26ca44626478bb1aec830b286404b-2vdWmEltwXfba0ce28e6322f2401-709_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3418681_Zero-fighter-flies-Japan-1st-time-WWII_1540240835.html","title":"World War II Zero fighter flies over Japan","title_page":"World War II Zero fighter flies over Japan | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"World War II Zero fighter flies over Japan\nKANOYA, Japan (AP) — One of Mitsubishi's legendary World War II fighter planes took to the skies over Japan on Wednesday.\nThe restored \"Zero\" fighter made a brief flight to and from a naval base in southern Japan. Decorated former U.S. Air Force pilot Skip Holm flew the aircraft.\nZero fighters were considered one of the most capable fighter planes in World War II, rivaling the British Spitfire. Their long range allowed them to play a prominent role in the 1941 attack on Pearl Harbor. Only a few are still in operating condition.\nCORRECTS THAT FLIGHT WAS NOT FIRST OVER JAPAN SINCE WORLD WAR II - Mitsubishi¿s legendary Zero fighter flies during its test flight at an air station in Kanoya, Kagoshima prefecture, southern Japan, Wednesday, Jan. 27, 2016. One of Mitsubishi's legendary World War II fighter planes took to the skies over Japan on Wednesday. (Hiroko Harima/Kyodo News via AP) JAPAN OUT, MANDATORY CREDIT\nWhile rented Zeroes have flown in Japan on occasion in the past, this was the first for the widely used Model 22 of Mitsubishi's A6M fighter with its round wingtips.\nThis particular plane was found decaying in Papua New Guinea in the 1970s. It was owned by an American until Japanese businessman Masahiro Ishizuka purchased it and brought it to Japan last September.\n\"I wanted for the people of Japan and especially young people to know about this Zero airplane, as well as those who are old who remember the past,\" Ishizuka said. \"Each of them should have different thoughts and perspectives on this, but I just want people to know how Japan has developed its technology.\"\nJapanese see the aircraft both as a symbol of their country's technological advance and a reminder of the harrowing history of the war. In the last phase of the fighting, they were used for \"kamikaze\" attacks.\nKamikaze pilots took off from the same airfield as Wednesday's flight, Kanoya Naval Air Base on the island of Kyushu.\nUnder its previous American owner, the plane made an appearance in the Hollywood movie \"Pearl Harbor\" and at various events in the United States.\n___\nThis story corrects that it was not the first Zero flight over Japan since World War II.\nThis image made from Associated Press Television News video shows Mitsubishi's legendary Zero fighter, piloted by Skip Holm, a former U.S. Air Force pilot, prepares to take off at an air station in Kanoya, Kagoshima prefecture, southern Japan, Wednesday, Jan. 27, 2016. The restored Zero fighter plane took to the skies over Japan on Wednesday for the first time since World War II. (Associated Press Television News via AP)\nCORRECTS THAT FLIGHT WAS NOT FIRST OVER JAPAN SINCE WORLD WAR II - In this image made from Associated Press Television News video, Skip Holm, a former U.S. Air Force pilot, gets inside the cockpit of a zero fighter to take off at an air station in Kanoya, Kagoshima prefecture, southern Japan, Wednesday, Jan. 27, 2016. One of Mitsubishi's legendary Zero fighter planes, piloted by Holm, took to the skies over Japan on Wednesday. (Associated Press Television News via AP)\nCORRECTS THAT FLIGHT WAS NOT FIRST OVER JAPAN SINCE WORLD WAR II - This image made from Associated Press Television News video shows Skip Holm, a former U.S. Air Force pilot, during an interview at an air station in Kanoya, Kagoshima prefecture, southern Japan, Wednesday, Jan. 27, 2016. One of Mitsubishi's legendary Zero fighter planes took to the skies over Japan, piloted by Holm, on Wednesday. (Associated Press Television News via AP)\nCORRECTS THAT FLIGHT WAS NOT FIRST OVER JAPAN SINCE WORLD WAR II - Mitsubishi¿s legendary Zero fighter flies during its test flight in Kanoya, Kagoshima prefecture, southern Japan, Wednesday, Jan. 27, 2016. One of Mitsubishi's legendary World War II fighter planes took to the skies over Japan on Wednesday. (Ryosuke Uematsu/Kyodo News via AP) JAPAN OUT, MANDATORY CREDIT\nCORRECTS THAT FLIGHT WAS NOT FIRST OVER JAPAN SINCE WORLD WAR II - Mitsubishi¿s legendary Zero fighter is prepared for a test flight at an air station in Kanoya, Kagoshima prefecture, southern Japan, Wednesday, Jan. 27, 2016. One of Mitsubishi's legendary World War II fighter planes took to the skies over Japan on Wednesday. (Hiroko Harima/Kyodo News via AP) JAPAN OUT, MANDATORY CREDIT\nCORRECTS THAT FLIGHT WAS NOT FIRST OVER JAPAN SINCE WORLD WAR II - Mitsubishi¿s legendary Zero fighter takes off for a test flight at an air station in Kanoya, Kagoshima prefecture, southern Japan, Wednesday, Jan. 27, 2016. One of Mitsubishi's legendary World War II fighter planes took to the skies over Japan on Wednesday. (Hiroko Harima/Kyodo News via AP) JAPAN OUT, MANDATORY CREDIT","url":"https://www.dailymail.co.uk/wires/ap/article-3418681/Zero-fighter-flies-Japan-1st-time-WWII.html"}
