{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:31:54","date_modify":"2018-10-30 20:31:54","date_publish":"2015-01-31 14:59:15","description":"Hezbollah backs down from war with Israel; Clashes between Nusra front and Free Syrian Army spreading in Syria; Jundallah takes credit for massive mosque attack in Pakistan; Egypt's military begins 'wide military offensives' in North Sinai; Greece clashes with eurogroup 'No more bailout, no more troika!'; In Denmark you are now paid to take out a mortgage |","filename":"data/vaneerConsumption/WorldViewHezbollahBacksDownfromWarwithIsrael.json","image_url":"https://media.breitbart.com/media/2015/01/AP111206192931-e1373902413807.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_31__1540931514.html","title":"World View: Hezbollah Backs Down from War with Israel","title_page":"World View: Hezbollah Backs Down from War with Israel | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nHezbollah backs down from war with Israel\nClashes between Nusra front and Free Syrian Army spreading in Syria\nJundallah takes credit for massive mosque attack in Pakistan\nEgypt’s military begins ‘wide military offensives’ in North Sinai\nGreece clashes with eurogroup ‘No more bailout, no more troika!’\nIn Denmark you are now paid to take out a mortgage\nHezbollah backs down from war with Israel\nHezbollah chief Sayyed Hassan Nasrallah giving televised speech on Friday\nHezbollah chief Sayyed Hassan Nasrallah gave a televised speech on Wednesday gloating about Wednesday’s attack on an Israeli convoy that killed two soldiers. According to Nasrallah:\nIf Israel thinks the resistance is deterred and is scared of a conflict, I tell you now after the attack in Qunetra, we are not afraid of war. We will not think twice about confronting the enemy and we will do so if he forces us. We don’t want war but we don’t fear it. The resistance in Lebanon is not concerned with rules of engagement. It is our legitimate and legal right to fight aggression, wherever and whenever it may occur.\nIt was a retaliation attack for Israel’s January 18 airstrike at a convoy in Syria that killed two of Hezbollah’s top commands, as well as five Iranians and a senior officer in Iran’s élite Islamic Revolution Guards Corps (IRGC). It was feared that Hezbollah would demand additional revenge beyond the killing of two Israeli soldiers, or that Israel would strike back. Either way, the fear was that something would spiral into a larger war, as had happened in 2006.\nBut, in fact, there had already been several reports that Hezbollah was signaling to Israel that it was backing down and did not want a war.\nThat Nasrallah wanted to back down is completely believable. As we explained two days ago, the Lebanese people are unified in being opposed to another war between Israel and Hezbollah, since the 2006 war accomplished nothing but to make life miserable in Lebanon.\nIn addition, Hezbollah is completely tied down in Syria. It is undoubtedly true that Nasrallah would like to be responsible for killing a few Jews, but his behavior indicates that he’s much more excited by the possibility of massacring and slaughtering thousands of Muslims in Syria.\nAs I’ve been reporting for a few weeks, the real war going on in the Mideast today is not Muslims versus Westerners, but Muslims versus Muslims. The same is true in South Asia and North Africa. We have major terror attacks in Egypt and Pakistan (see below), as well as news that Chad is bombing Boko Haram positions in Cameroon. This large war of Muslims versus Muslims is growing in many countries, including Pakistan, Afghanistan, Iraq, Syria, Yemen, Somalia, Libya, Nigeria, Mali, and others to a greater or lesser extent. Daily Star (Beirut) and Times of Israel\nClashes between Nusra front and Free Syrian Army spreading in Syria\nAlthough the Islamic State of Iraq and Syria (IS or ISIS or ISIL) gets most of the press these days, thanks to their beheadings and other publicity stunts, there are still other groups fighting in Syria, and one those fights is said to be spreading. The al-Qaeda linked Jabhat al-Nusra (al-Nusra Front) and Western-backed Free Syrian Army (FSA) are both supposed to be fighting against the army of Syria’s Bashar al-Assad regime but, instead, they’re fighting each other. The clashes began on Thursday, just west of Aleppo, and on Friday spread into Idlib province.\nHowever, Ahrar al-Sham, another Islamist militia in Syria, has worked with both groups in the past, and is calling for an end to the clashes, and said the disagreement should be settled in an independent Shariah court. Daily Star (Beirut)\nJundallah takes credit for massive mosque attack in Pakistan\nA powerful explosion leveled a crowded Shia mosque during Friday prayers in Shikarpur, a city 200 miles north of Karachi in southern Pakistan. At least 56 people were killed. Jundullah, a splinter group of Tehrik-e-Taliban (TTP – Pakistan Taliban) claimed credit: “Our target was the Shia mosque … They are our enemies.”\nTTP and its various splinter groups have in the past attacked both Sunni and Shia targets, but Jundullah has specialized in sectarian attacks against Shias. Some of these targets have been on Iranian soil, though most have been in Pakistan. Some analysts are warning that sectarian attacks are increasing in Pakistan, at a time when Muslim versus Muslim attacks of all kinds are increasing throughout the region. Daily Times (Pakistan) and AFP\nEgypt’s military begins ‘wide military offensives’ in North Sinai\nAfter Thursday’s sophisticated multi-location North Sinai terrorist attack by the ISIS-linked terror group Ansar Bayt al-Maqdis (ABM – Ansar Jerusalem – Champions of Jerusalem) killing 31 people and injuring dozens, Egypt’s president Abdel al-Fattah al-Sisi is under heavy criticism. There was a similar terrorist attack by the same group last October, leading al-Sisi to declare a state of emergency in the Sinai, and to build a one kilometer wide buffer zone along the Gaza border, and yet ABM apparently defeated the security measures with ease.\nAl-Sisi has cut short his participation in the African Union summit in Ethiopia to deal with the aftermath of the terror attack, and Egypt’s army is starting wide military offensives throughout North Sinai, targeting terrorist hideouts using Apache helicopters and un-manned planes.\nThere is a feeling in Egypt that the harsh security measures that were taken after the October attacks have backfired, in the sense that the Bedouins living in Sinai have become even more estranged from Cairo. Al Ahram (Cairo)\nGreece clashes with eurogroup ‘No more bailout, no more troika!’\nGreece’s new Finance Minister Yanis Varoufakis met with the Eurogroup of eurozone finance managers, and quickly announced that the meeting was over. Varoufakis said that Greece did not want an extension to meet the bailout conditions, and he said that he wanted to meet with European leaders, not with technicians of the “Troika” of organizations that have been bailing out Greece — the European Commission (EC), the European Central Bank (ECB) and the International Monetary Fund (IMF).\nGreece is supposed to receive an additional seven billion euro loan at the end of February in order to made debt payments that will come due in March. Greece needs to make those payments or else declare bankruptcy and leave the eurozone. However, that money is dependent upon a review by the Troika, and Varoufakis said he would not negotiate with the Troika. Varoufakis says that Greece doesn’t want the money, because it would be used to pay for things they don’t care about — namely their debts. Instead, Varoufakis wants to negotiate directly with European heads of state and negotiate staying the eurozone without going bankrupt and without leaving the eurozone.\nAfter the meeting, eurogroup chief Jeroen Dijsselbloem said, “Taking unilateral steps or ignoring previous arrangements is not the way forward.” Greek Reporter and Kathimerini\nIn Denmark you are now paid to take out a mortgage\nAs we’ve been reporting for some time, Europe is in a deflationary spiral which will end in a major financial panic and crisis. Now we have a new sign: Nordea Kredit, a Danish bank, is offering a mortgage with a negative interest rate — which means that the bank lends you the money, and then pays you interest. Actually, the interest rate can vary from +0.03% to -0.03%, so not everyone will qualify for negative interest rates, but a mortgage rate of +0.03% is not that much anyway.\nIn a deflationary spiral, most people and businesses postpone purchases and hoard cash. Hoarding cash is socially acceptable for a residential family, but not for a bank, which is expected to lend money for business loans and mortgages. And now, with the European Central Bank planning a massive quantitative easing program, which will “print” a lot of money and pump it into banks and the stock market, banks are expected to get rid of that cash any way they can, and now we’re seeing the first negative rate mortgage.\nThe deflationary spiral in the U.S. is not advanced as far as it is in Europe, but it’s coming. Zero Hedge\nKEYS: Generational Dynamics, Hezbollah, Sayyed Hassan Nasrallah, Lebanon, Israel, Syria, Bashar al-Assad, Iran, Islamic Revolution Guards Corps, IRGC, al-Quds, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Aleppo, Idlib, Ahrar al-Sham, Free Syrian Army, FSA, Jabhat al-Nusra, al-Nusra Front, Tehrik-e-Taliban, TTP, Pakistan Taliban, Jundullah, Karachi, Egypt, North Sinai, Abdel al-Fattah al-Sisi, Gaza, Ansar Jerusalem, Ansar Bayt al Maqdis, ABM, Champions of Jerusalem, African Union, Ethiopia, Bedouins, Greece, Yanis Varoufakis, Troika, European Commission, European Central Bank, International Monetary Fund, IMF, ECB, eurogroup, Jeroen Dijsselbloem, Denmark, Nordea Kredit\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/01/31/world-view-hezbollah-backs-down-from-war-with-israel/"}
