{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:40:40","date_modify":"2018-10-30 20:40:40","date_publish":"2015-04-28 11:00:24","description":"US reaffirms defense of Japan's Senkaku Islands; Japan-U.S. military guidelines will include 'collective self-defense' |","filename":"data/vaneerConsumption/WorldViewUSReaffirmsDefenseofJapansSenkakuIslands.json","image_url":"https://media.breitbart.com/media/2015/04/ap_barack-obama-shinzo-abe_ap-photo3-1024x695.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_28__1540932040.html","title":"World View: US Reaffirms Defense of Japan's Senkaku Islands","title_page":"World View: US Reaffirms Defense of Japan's Senkaku Islands | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nUS reaffirms defense of Japan’s Senkaku Islands\nJapan-U.S. military guidelines will include ‘collective self-defense’\nUS reaffirms defense of Japan’s Senkaku Islands\nJohn Kerry and Shinzo Abe in Boston on Sunday\nA day before Japan’s prime minister Shinzo Abe visits president Barack Obama in the White House, Secretary of State John Kerry reaffirmed that a treaty that the United States and Japan signed in 1960 requires the United States to defend the Senkaku Islands from an attack by China.\nAccording to Kerry, “Commitment to Japan’s security remains ironclad and covers all territories under Japan’s administration, including the Senkaku islands.”\nThere has been some concern in Asia about whether the Obama administration would honor America’s defense treaties. This concern increased substantially after Obama’s flip-flop on Syria, declaring that use of chemical weapons would be a “game changer,” and then backing off once Syria’s president Bashar al-Assad killed hundreds of people with Sarin gas.\nAfter World War II, America signed a large number of mutual defense treaties with other countries. These include agreements with Japan, South Korea, Israel, Taiwan, the Philippines, the ANZUS agreement with Australia and New Zealand, a special treaty with Iceland, and the NATO agreement with all of Europe.\nMany people have questioned whether the administration would honor these mutual defense treaties during an actual attack. Kerry’s statement was meant to reassure the Japanese.\nChina has been claiming huge territories in the South China Sea and East China Sea that have historically belonged to other countries. Almost no one outside of China believes that China’s claims are valid, and China is refusing to submit the claims to the United Nations for adjudication, knowing that it would lose.\nIn the South China Sea, China is in the midst of a massive military buildup, as we recently described. However, China has moved more cautiously with the Senkakus (called Diaoyu by the Chinese), knowing that a military assault on the Senkakus could provoke a direct military confrontation with the United States. AFP\nJapan-U.S. military guidelines will include ‘collective self-defense’\nSince the end of World War II, Japan and the United States have had mutual defense treaties. However, Japan’s constitution after WW II has been a “pacifist” constitution, prohibiting any military action except in response to a direct attack on Japan itself. This meant that the mutual defense treaty was pretty much a one-way affair, in that the U.S. was committed to defending Japan, but Japan could not defend the U.S.\nPrime minister Shinzo Abe has stated that he wants to remove this restriction from the constitution, but amending the constitution would be a difficult process, and there are many people in Japan who would strongly oppose the change.\nSo in 2014, Abe made a unilateral political decision to “reinterpret” the self-defense clause of the constitution to allow for what is called “collective self-defense.” I discussed this issue in detail in “5-May-14 World View — Japan debates ‘collective self-defense’ to protect America and Japan”.\nUnder international law, if a nation’s ally is attacked by another country, then the nation may use its armed forces in defense of its ally. This is known as “collective self-defense,” and it particularly can be invoked by either of two countries that have a mutual defense agreement, such as the mutual defense agreement signed by Japan and the United States. However, many people in Japan interpret the constitution’s self-defense restriction to mean that collective self-defense is prohibited in Japan’s constitution. Abe’s reinterpretation makes collective self-defense possible.\nThe new guidelines between Japan and the U.S. will explicitly state that collective self-defense is allowed for both countries. Kyodo News (Japan) and Japan News\nKEYS: Generational Dynamics, Japan, Shinzo Abe, John Kerry, Senkaku Islands, collective self-defense, China, Diaoyu, South Korea, Israel, Taiwan, Philippines, ANZUS agreement, Australia, New Zealand, Iceland, NATO\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/04/28/world-view-us-reaffirms-defense-of-japans-senkaku-islands/"}
