{"authors":["John J. Xenakis"],"date_download":"2018-10-30 22:07:56","date_modify":"2018-10-30 22:07:56","date_publish":"2015-02-09 14:18:23","description":"30 dead in Cairo Egypt as soccer fans clash with police; Greece's Alexis Tsipras approaches Wednesday confrontation with Europe |","filename":"data/vaneerConsumption/WorldView30DeadinCairoasSoccerFansClashwithPolice.json","image_url":"https://media.breitbart.com/media/2015/01/4976f9c0-a4b4-11e4-9f2e-ff6af65999d0_AP923931297509_5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_09__1540937276.html","title":"World View: 30 Dead in Cairo as Soccer Fans Clash with Police","title_page":"World View: 30 Dead in Cairo as Soccer Fans Clash with Police | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\n30 dead in Cairo Egypt as soccer fans clash with police\nGreece’s Alexis Tsipras approaches Wednesday confrontation with Europe\n30 dead in Cairo Egypt as soccer fans clash with police\nPickup truck in flames during Sunday’s clashes between football fans and police (AP)\nAuthorities are concerned about widespread riots and demonstrations after 30 people died and dozens were injured in clashes with police at a football (soccer) game in Cairo on Sunday, when hundreds of football fans tried to enter the stadium without buying tickets. Police fired teargas and birdshot to disperse the crowd. Most of the deaths were due to suffocation, while other were killed in a stampede after the police fired teargas.\nYoung football fans in Cairo, known as Ultras, have become highly politicized. Football fan clubs joined together in Tahrir Square in 2011 to bring about the ouster of long-time dictator Hosni Mubarak. When the army took over, the Ultras demonstrated against the army. Then they demonstrated against the Muslim Brotherhood, during the days of president Mohamed Morsi. Now the fear is of major demonstrations and riots against the former general and current president Abdel al-Fattah al-Sisi.\nSunday’s incident is certainly going to renew the widespread criticism of the police in an incident that occurred on February 2, 2012, at a football match in Port Said, when fans of two opposing football clubs were killed in clashes with each other.\nThe attackers were mostly fans of the home team, the al-Masry football club, while the victims were Cairo Ultras, fans of the visiting team, Cairo’s Al-Ahly football club, a group that had actively taken part in the Tahrir Square protests during 2011, and the suspicion is widespread that police were responsible for the violence, in order to get revenge against the Ultras. There were plenty of riot police present at the game, but video shows that they allowed the violence to continue without interference, and they may even have aided the violence by blocking the escape route of the victims.\nHowever, fans were furious a year later when an Egyptian court sentenced 21 football fans to death for participating in the riot, while the police were completely exonerated. This particularly infuriated the ultras, who believed that the police were responsible. ( “27-Jan-13 World View — Egypt in crisis after two days of violent clashes”)\nAfter the 2012 incident, Egyptian football matches were closed to spectators, a ban which was only just recently lifted. Egypt’s cabinet has now decided to suspend all football games indefinitely.\nThere are hundreds of thousands of politically active Ultras, and it is now thought that it is almost certain that they will be returning to Tahrir Square for anti-government and anti-police demonstrations. How far these demonstrations will probably depends mostly on how skillfully and transparently they handle the investigation of Sunday’s incident. Al-Ahram (Cairo) and Al-Jazeera\nGreece’s Alexis Tsipras approaches Wednesday confrontation with Europe\nGreece’s new radical left-wing prime minister Alexis Tsipras appears to be approaching a head-on clash with the Eurogroup, the eurozone finance ministers, when they all meet on Wednesday.\nOn Sunday, Tsipras gave his maiden speech to Greece’s parliament. He repeated his plan to increase government spending, and he repeated his demand that Europe continue to fund Greece’s increased spending by billions of dollars. In particular, he is asking Europe to provide a “bridge loan” to support the increased spending through June, to give Greece and the Europeans time to negotiate revised bailout terms that will allow the increased spending to continue into the future.\nHe is also demanding World War II reparations from Germany for the damages brought by the Nazis. He called it, “A moral obligation to our people, to history, to all Europeans who fought and gave their blood against Nazism.” Germany has already firmly refused to consider reparations.\nIn his speech, Tsipras announced the following new and revived spending programs:\nHumanitarian measures will include free food, electricity, shelter and medicine for families that have been hurt by the economic crisis.\nThe Greek radio and television network (ERT) will be recreated after it was shut down by the previous government. Laid off government employees, including school guards and cleaners, will have their jobs restored.\nThere will be a return to employees’ rights, including restoration of collective bargaining and protection from layoffs. The minimum wage will be increased.\nPrevious increases in retirement age and reductions in pensions will be reversed.\nOffsetting these spending increases, Tsipras promised to reduce corruption and tax evasion, and also to sell off half of all government limousines. Greek Reporter and Kathimerini\nKEYS: Generational Dynamics, Egypt, Cairo, Ultras, Hosni Mubarak, Muslim Brotherhood, Mohamed Morsi, Abdel al-Fattah al-Sisi, Port Said, Al-Ahly, Al-Masry, Tahrir Square, Greece, Alexis Tsipras, Syriza, Germany, reparations\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/02/09/world-view-30-dead-in-cairo-as-soccer-fans-clash-with-police/"}
