{"authors":["John J. Xenakis"],"date_download":"2018-10-30 22:00:13","date_modify":"2018-10-30 22:00:13","date_publish":"2015-05-11 12:57:12","description":"22 die in Macedonian police gun battles with Albanian militants; Very brief generational history of Albanian - Macedonian conflict; Former Libya leader Muammar Gaddafi's son offers to make me rich |","filename":"data/vaneerConsumption/WorldView22DieinMacedonianPoliceGunBattleswithAlbanianMilitants.json","image_url":"https://media.breitbart.com/media/2015/05/ap_ap-photo637-1024x696.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_11__1540936813.html","title":"World View: 22 Die in Macedonian Police Gun Battles with Albanian Militants","title_page":"World View: 22 Die in Macedonian Police Gun Battles with Albanian Militants | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\n22 die in Macedonian police gun battles with Albanian militants\nVery brief generational history of Albanian – Macedonian conflict\nFormer Libya leader Muammar Gaddafi’s son offers to make me rich\n22 die in Macedonian police gun battles with Albanian militants\nMacedonian special units take cover near battle zone in Kumanovo (AP)\nA militia group of more than 40 armed men, thought to be ethnic Albanians from the disbanded Albanian/Kosovo Liberation Army (KLA), fought Macedonian police in Kumanovo, near the border with Kosovo. Eight policemen were killed and 37 injured in the gun battle that lasted all day on Saturday, and which led to the death of 14 members of the attackers.\nIn a nationally televised address on Sunday, Macedonia’s president George Ivanov said that the group had been planning terrorist acts across the whole country:\nPolice have prevented co-ordinated terrorist attacks at different locations in the country that would cause serious destabilization, chaos and fear. The members of the group are extremists and criminals with remarkable military training and skills. That’s why we have paid such a high price with the loss of lives.\nPro-separatist Muslim Albanian terrorists have conducted numerous attacks on Orthodox Slav targets since the breakup of the former Yugoslavia in the early 1990s, making Macedonia an independent state. About a quarter of Macedonia’s two million population are ethnic Albanians.\nThe bloody, genocidal Bosnian War of the mid-1990s was a generational crisis war for the entire region. It was followed by two minor conflicts, an Orthodox Serb invasion of Kosovo in 1999, and an Albanian insurgency in Macedonia in 2001.\nA number of subsequent incidents, including Saturday’s gunfight, have led to concerns that there could be a major new war engulfing the region, as happened in the mid-1990s. But that’s impossible because the region is in a generational Awakening era, just 20 years past the Bosnian war, and so brief outbreaks of violence are possible, but not a full-scale generational crisis war. BBC and Deutsche Welle and AP\nVery brief generational history of Albanian – Macedonian conflict\nThe ethnic Albanians and the Macedonian Slavs were all mostly Orthodox Christian, but still had many wars during the Middle Ages. When the Ottoman Empire (Turkey) conquered the Balkans, the Albanians converted to Islam, mainly in the 16th and 17th centuries. Under the Ottomans, the Orthodox Slavs were in poverty, subordinated to the Turks and the Albanians. However, the situation reversed after World War I, which was a generational crisis war for the Balkans. When the Ottoman Empire was split up, Orthodox Slavs had the upper hand for a while, while the Albanians were the second class citizens.\nDuring World War II, the Albanians, Turks, and Italians were all on the side of Nazi Germany. They attempted to create a “Greater Albania,” which would include not only Albanians, but also Greece, Yugoslavia, and other Orthodox Slav territories.\nAfter World War II, the attempts at “Greater Albania” served to create strong nationalist feelings among both Albanians and Macedonians. They had repeated minor conflicts, culminating in the Bosnian War that engulfed Balkans in the mid-1990s. There have been additional minor conflicts since then, including the gunfight on Saturday.\nToday, there is a small population of Albanians in Macedonia, and the dreams of a “Greater Albania” are still alive, so it is likely that spurts of violence between Albanians and Macedonians will continue well into the future.\nAs Yugoslavia disintegrated, Macedonia declared its independence in September, 1991, and immediately became embroiled in a bizarre disagreement with Greece. Greece believes that the name “Macedonia” can refer only to the Greek region of Macedonia, and nothing more. They fear that a new Macedonia nation on the Greek border would attempt to annex Greece’s Macedonia region. The dispute was resolved with an uneasy compromise in 1993, when the country was admitted to the United Nations as the “Former Yugoslav Republic of Macedonia” or “FYR Macedonia.”\nFYR Macedonia is not a member of the European Union, but has applied to be a member. The “Macedonia” name continues to be a problem, and is one of the issues holding up EU membership. There have been calls to change the country’s name to the simpler “Republic of Macedonia” as a compromise. EU Observer and New Balkan Politics (2002) and Global Security (2013) and BBC (Sep-2014)\nFormer Libya leader Muammar Gaddafi’s son offers to make me rich\nLike everyone, I receive plenty of spam e-mail messages. One that I received on Sunday is so special that I wanted to share it with my readers:\nI am Mohammad Gaddafi, son of the killed Libyan leader Muamar Gaddafi. My family has been in Algeria until we were recently granted political asylum in Oman. For your personal consumption and information, my family has a huge sum of money somewhere for investment for the benefit of my family. I am open to investment in any part of the world provided the investments are lucrative and not directly linked to my family and high returns guaranteed on investment. You will be given freedom to invest in any aspect of your countries economy. Once I receive your email response and confirm that you are capable of investing/managing the funds for us, I will then give you information on how to access the funds and how much it is. You will be entitled to 30% for all your services. Keep this proposal confidential, please reply me via my private email for further discussion. Regards, Mohammad\nHey, Mohammad! I loved your brother Saif’s vow to “fight until the last bullet.” How are you and the family doing? How about just investing directly in Generational Dynamics? That would be your best investment of all! — Regards, John\nKEYS: Generational Dynamics, Macedonia, Albania, Kumanovo, Kosovo, Albanian/Kosovo Liberation Army, KLA, George Ivanov, Slavs, Balkans, Ottoman Empire, Libya, Muammar Gaddafi\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/05/11/world-view-22-die-in-macedonian-police-gun-battles-with-albanian-militants/"}
