{"authors":[],"date_download":"2018-10-22 21:14:03","date_modify":"2018-10-22 21:14:03","date_publish":"2014-05-06 16:44:33","description":"Three base-jumpers leaped from the top of America's tallest building in September.","filename":"data/vaneerConsumption/WorldTradeCenterJumpersPleadNotGuiltytoTrespassingBurglary.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_world-trade-center-jumpers-plead-not-guilty-trespassing-burglary-n98296_1540242843.html","title":"World Trade Center Jumpers Plead Not Guilty to Trespassing, Burglary","title_page":"World Trade Center Jumpers Plead Not Guilty to Trespassing, Burglary","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBy NBC New York\nNew helmet-cam video from one of the extreme-skydiving enthusiasts accused of parachuting off the World Trade Center was posted online, just before their arraignment.\nVideo from the leap off the 1,776-foot tower was posted to YouTube on Monday and is the second such clip released since the three daredevils were arrested in the Sept. 30 jump.\nThe video shows one parachutist, Marko Markovich, coasting over the Hudson River before he lands in a lower Manhattan park near the West Side Highway.\nMarkovich and co-jumpers James Brady and Andrew Rossig pleaded not guilty Tuesday to the charges, including trespassing and felony burglary.\nThe jumpers don't deny the stunt, but their lawyers argued in court that they should not be facing felony charges, particularly burglary. The attorneys contend that the prosecutors are claiming the men unlawfully entered the World Trade Center with the intent of committing a crime inside.\n\"Just from a legal standpoint,\" said lawyer Timothy Parlatore, \"base jumping is, by its very nature, is committed outside of a building.\"\nLawyers said Tuesday they are seeking a plea deal to lesser counts.\nMeanwhile one of the jumpers said Tuesday he had no regrets.\n\"It's just a beautiful experience to have, to experience life from that perspective,\" Rossig said.\nThe jump, along with the arrest of a teenage boy who climbed to the top of the tower in March, has raised questions about the security of the Financial District site, which is supposed to be one of the most tightly protected areas in the country.","url":"https://www.nbcnews.com/news/crime-courts/world-trade-center-jumpers-plead-not-guilty-trespassing-burglary-n98296"}
