{"authors":["John J. Xenakis"],"date_download":"2018-10-30 18:43:56","date_modify":"2018-10-30 18:43:56","date_publish":"2015-04-02 11:00:08","description":"ISIS captures Yarmouk refugee camp, closes in on Damascus; Hezbollah trapped by a sense of collapse in al-Assad's army; Turkmenistan fears jihadist invasion from Afghanistan; Palestinian Authority joins International Criminal Court |","filename":"data/vaneerConsumption/WorldViewISISCapturesYarmoukRefugeeCampClosesinonCollapsingalAssad.json","image_url":"https://media.breitbart.com/media/2015/03/ap_ap-photo1415.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_02__1540925036.html","title":"World View: ISIS Captures Yarmouk Refugee Camp, Closes in on Collapsing al-Assad","title_page":"World View: ISIS Captures Yarmouk Refugee Camp, Closes in on Collapsing al-Assad | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nISIS captures Yarmouk refugee camp, closes in on Damascus\nHezbollah trapped by a sense of collapse in al-Assad’s army\nTurkmenistan fears jihadist invasion from Afghanistan\nPalestinian Authority joins International Criminal Court\nISIS captures Yarmouk refugee camp, closes in on Damascus\nYarmouk refugee camp, 31-Jan-2014, showing residents queuing up to receive food supplies (AP)\nThe Islamic State (IS or ISIS or ISIL or Daesh) captured the Yarmouk refugee camp in Syria on Wednesday, inflicting another defeat on the army of Syria’s Bashar al-Assad regime. This comes just as the al-Assad regime suffered a major military setback in Idlib, as I reported a few days ago. According to some reports, ISIS received some help from the rival jihadist gang, the al-Qaeda linked Jabhat al-Nusra (al-Nusra Front).\nPrior to the start of the Syrian conflict in 2011, the Yarmouk refugee camp was home to half a million Palestinian refugees. However, many Palestinians have fled the camp, mainly driven out by a siege from the the army of al-Assad, who accused the Palestinians of joining the militias opposing him. The current population is estimated to be around 18,000.\nThe capture of Yarmouk gives ISIS a strong foothold on southern Damascus, which is al-Assad’s seat of power. Daily Star (Lebanon) and Reuters and AP\nHezbollah trapped by a sense of collapse in al-Assad’s army\nThe Shia Iran-backed, Lebanon-based Hezbollah terrorist group is increasingly in a quagmire because of the changing Mideast dynamics.\nHezbollah leader Sayyed Hasan Nasrallah condemned the Saudi-led intervention in Yemen against the Houthis, and expressed displeasure at political elements within Lebanon’s own government that supported the intervention. But there is little that Hezbollah can do, since it is stretched to the limits in Syria, where it is supposed to be supporting the regime of Syria’s president Bashar al-Assad, but the latter is facing a growing perception of collapse following the last week’s fall of Idlib, and Wednesday’s loss of Yarmouk. With the military effectiveness of al-Assad’s army possibly near an end, Hezbollah has to select its battles very carefully.\nHezbollah appears to be facing the bitter reality that it is a Shia militia living in a mostly Sunni Mideast, including the country of Lebanon, where it shares power with Sunni politicians. In the past, the mantra was that everyone had to get along with everyone, and so Hezbollah could flourish by repeatedly talking about the “resistance,” referring to the conflict with Israel. But the war in Syria, and now the war in Yemen, have caused the Sunni-Shia fault line to sharpen considerably, and there is a lot less patience among Sunni governments to put up with an Iran-backed Shia militia (Hezbollah), which they see as an ally of Iran and a threat to their own stability. Daily Star (Lebanon)\nTurkmenistan fears jihadist invasion from Afghanistan\nThere have been fears throughout Central Asia that the withdrawal of American troops from Afghanistan will create a vacuum that will be filled by jihadists.\nThis has been especially true in Turkmenistan, which shares a 744 km border with Afghanistan, and is particularly vulnerable to jihadists attacking from Afghanistan. In fact, Turkmenistan’s government seems genuinely frightened by the prospect of an invasion, so much so that it is violating its own rules of neutrality and asking Russia to provide troops for protection. And this comes as Turkmenistan has already asked Uzbekistan to provide border guards to protect Turkmenistan’s border.\nMoscow has been strengthening its military presence in Tajikistan, so doing so in Turkmenistan is consistent with Russia’s policies, even if it is inconsistent with Turkmenistan’s policies. Turkmenistan, like the rest of the world, has been watching Russia’s actions in Ukraine and Crimea, and learned that once Russian forces gain a foothold in a country, it is impossible to get them to leave. So Turkmenistan’s government must be really scared to make that request of Russia.\nWhat concerns everyone most is the threatened rise of terrorist groups linked to the Islamic State (IS or ISIS or ISIL or Daesh) in Central Asia. ISIS has been recruiting in north Afghanistan, and an ISIS invasion into Turkmenistan could create a large refugee problem that would be destabilizing in Central Asia, and would increase xenophobic ethnic violence in Russia itself. Jamestown/Paul Goble\nPalestinian Authority joins International Criminal Court\nThe Palestinian Authority (PA) became a full member of the International Criminal Court (ICC) on Wednesday, with the stated intention of bringing war crimes charges against Israel for actions taken during last summer’s Gaza war. The PA joined last year with observer status, and is now a full member.\nThe Palestinians will have to overcome a number of legal hurdles. First, they must convince the ICC that they have jurisdiction. Second, they would have to prove that Israel’s targets during the Gaza war were not legitimate military targets, and that the intention was to cause indiscriminate or disproportionate harm to civilians. This would be difficult to prove, since armed Palestinian militias were launching rockets from within the civilian population.\nOn the other hand, Israel could make a much more straightforward case that Hamas’s firing of rockets and missiles at Israeli communities had the intention of causing indiscriminate or disproportionate harm to civilians, especially since Palestinian military leaders have stated on numerous occasions that they consider Israeli civilians to be legitimate military targets. Arab News and Media Line\nKEYS: Generational Dynamics, Syria, Damascus, Bashar al-Assad, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh, Jabhat al-Nusra, al-Nusra Front, Yarmouk refugee camp, Hezbollah, Sayyed Hasan Nasrallah, Iran, Idlib, Palestinian Authority, PA, International Criminal Court, ICC, Israel, Turkmenistan, Russia, Afghanistan, Uzbekistan, Tajikistan\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/04/02/world-view-isis-captures-yarmouk-refugee-camp-closes-in-on-collapsing-al-assad/"}
