{"authors":["John J. Xenakis"],"date_download":"2018-10-30 21:55:18","date_modify":"2018-10-30 21:55:18","date_publish":"2015-01-19 15:03:37","description":"Miss Lebanon may lose her title over selfie with Miss Israel; Lebanon on edge after Israeli air strike kills Hezbollah commanders; Europe, under intense financial pressure, expected to start quantitative easing |","filename":"data/vaneerConsumption/WorldViewLebanononEdgeAfterIsraeliAirstrikeKillsHezbollahCommanders.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_19__1540936518.html","title":"World View: Lebanon on Edge After Israeli Airstrike Kills Hezbollah Commanders","title_page":"World View: Lebanon on Edge After Israeli Airstrike Kills Hezbollah Commanders | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nMiss Lebanon may lose her title over selfie with Miss Israel\nLebanon on edge after Israeli air strike kills Hezbollah commanders\nEurope, under intense financial pressure, expected to start quantitative easing\nMiss Lebanon may lose her title over selfie with Miss Israel\nFrom left to right: Miss Israel, Miss Lebanon, Miss Slovakia, and Miss Japan\nA selfie of four girls, in which Miss Lebanon Saly Greige is posing next to Miss Israel Doron Matalon, with wide smiles on their faces, may get Greige kicked out of the Miss Universe contest. Miss Slovenia and Miss Japan also appear in the selfie. Social media in Lebanon is being harshly critical:\nYou could have avoided mingling with the Israeli contestant like previous Lebanese contestants have done throughout the years. And if you were harassed like you say, you could have at least avoided the huge smile [we see] on your face.\nGreige could be stripped of her Miss Lebanon title, and kicked out of the Miss Universe contest, but Greige said it wasn’t her fault:\nFrom the first day I arrived at the Miss Universe pageant I was very careful not to take any pictures with Miss Israel, who tried repeatedly to take pictures with me. While I was preparing with Miss Slovenia and Miss Japan to get our photograph taken, Miss Israel jumped in and took a selfie with her phone and posted it on social media. This is what happened. I hope you continue supporting me.\nIn 1993, Miss Lebanon Huda al-Turk was stripped of her title for posing with a picture with Miss Israel at the time.\nLebanon’s government will launch a full-scale investigation on Monday. Daily Star (Beirut)\nLebanon on edge after Israeli air strike kills Hezbollah commanders\nLebanon and Israel are both on edge after an Israeli air strike in Syria killed two Hezbollah commanders. Hezbollah leader Sayyed Hassan Nasrallah is promising revenge, and there are fears that tit for tat retaliation might spiral out of control.\nAn Israeli helicopter struck a convoy of Hezbollah operatives, killing 12. One of the dead is field commander Jihad Mughniyeh, 25, the son of top commander Imad Mughniyeh. Imad was on the United States’ most wanted list for terrorism when he was killed in Damascus by a car bomb in 2008, allegedly from the Israelis. Imad’s son Jihad had been taking a more prominent role since his father’s death, and was overseeing operations in the Golan Heights.\nAlso killed was field commander Mohamad Issa, chief of Hezbollah operations in Syria, making this strike a major blow against Hezbollah, according to reports.\nA Hezbollah statement confirmed the names of six Hezbollah fighters that had been killed, but omitted the names of six fighters from the Islamic Revolution Guards Corps (IRGC) that are fighting alongside their Hezbollah counterparts. Iran has been supplying IRGC troops to Syria’s president Bashar al-Assad and to Hezbollah, as well as to Iraq’s army, but has denied doing so. YNet (Israel) and Daily Star (Beirut) and Ya Libnan (Lebanon)\nEurope, under intense financial pressure, expected to start quantitative easing\nMany analysts expect the European Central Bank (ECB) to announce on Thursday a quantitative easing (QE) program, in which it will purchase hundreds of billions of euros of bonds issued by the various eurozone countries. Effective, the ECB will be “printing money,” and giving it to the individual countries.\nSeveral countries, including the U.S. and Japan, have been aggressively pushing QE for years, but the ECB has resisted it because of fears of harming the euro currency and because the Germans have been opposed.\nBut pressure on the ECB to start QE has been increasing, along with numerous eurozone financial problems:\nThe eurozone has been in a deflationary spiral for years, and in December the eurozone fell into actual deflation, with a negative inflation rate.\nOn Friday, the Swiss National Bank (SNB) announced that it was ending its own “money printing” program for Swiss francs, which it had used to purchase hundreds of billions of euros since 2011. The result was that the Swiss franc gained 20% against the euro, causing further eurozone deflation, and possibly triggering a chain reaction of bankruptcies.\nGreece will have an election on January 25, and the winner is expected to be the radical far left Syriza party, led by Alexis Tsipras, who has promised to renege on Greece’s austerity commitments that it made in return for its 240 billion euro bailout paid so far. This may cause Greece to leave the eurozone, or if Europe agrees to allow Greece to renege, then other eurozone countries may demand the same treatment.\nBritain will hold an election in April or May, and the euro-skeptic UK Independence Party (UKIP), which advocates taking the UK out of the European Union, has been gaining strength.\nThe markets are widely expecting QE to be announced this week, and as the US QE situation has shown, that money just goes into the stock market, so that the top 1% make even more money. So if there’s no QE announcement this week, then disappointed investors may sell off, causing the stock market to fall.\nSome analysts are concerned that whatever the ECB tries, it will be too little too late. Pressure from Germany may keep the ECB program from being too aggressive. Furthermore, other countries started QE years ago, and it may be too late to catch up. Forbes and Bloomberg and Brisbane Times (Australia)\nKEYS: Generational Dynamics, Lebanon, Saly Greige, Israel, Doron Matalon, Slovenia, Japan, Miss Lebanon, Miss Universe, Huda al-Turk, Hezbollah, Syria, Bashar al-Assad, Sayyed Hassan Nasrallah, Jihad Mughniyeh, Imad Mughniyeh, Mohamad Issa, Iran, Islamic Revolution Guards Corps, IRGC, European Central Bank, ECB, Swiss National Bank, SNB, quantitative easing, QE, Greece, Syriza, Alexis Tspiras, Britain, UK Independence Party, UKIP\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/01/19/world-view-lebanon-on-edge-after-israeli-airstrike-kills-hezbollah-commanders/"}
