{"authors":["Associated Press"],"date_download":"2018-10-23 02:53:31","date_modify":"2018-10-23 02:53:31","date_publish":"2017-03-16 13:34:16","description":"TOP STORY:SOC--AFRICAN ELECTIONADDIS ABABA, Ethiopia + Issa Hayatou was voted out as president of the African soccer confederation on Thursday after 29 years...","filename":"data/vaneerConsumption/WORLDSPORTSat1330GMT.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320278_WORLD-SPORTS-1330-GMT_1540263211.html","title":"WORLD SPORTS at 1330 GMT","title_page":"WORLD SPORTS at 1330 GMT | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TOP STORY:\nSOC--AFRICAN ELECTION\nADDIS ABABA, Ethiopia + Issa Hayatou was voted out as president of the African soccer confederation on Thursday after 29 years in charge, losing to challenger Ahmad of Madagascar in a major shakeup for the sport on the continent. By Elias Meseret. SENT: 440 words, photos.\nNEW/DEVELOPING:\nSOC--MAN CITY WOMEN-LLOYD\nMANCHESTER, England - Carli Lloyd, the captain of the U.S. women's team and current FIFA player of the year, tells The Associated Press about her hopes and expectations heading into her three-month stint at English club Manchester City. By Steve Douglas. UPCOMING: 700 words by 1800 GMT, photos.\nOLY--IOC-RUSSIAN DOPING\nGENEVA - Russia doping investigator Richard McLaren has been invited for talks with IOC President Thomas Bach amid ongoing tension between Olympic sports bodies and anti-doping officials. By Graham Dunbar. SENT: 530 words, photos.\nOLY--IOC-KASPER APOLOGY\nPYEONGCHANG, South Korea - IOC board member Gian Franco Kasper apologized Thursday for comparing a ban on Russia from the 2018 Olympics to persecution of Jews in Nazi Germany. SENT: 250 words, photos.\nSOC--EUROPA LEAGUE ROUNDUP\nMANCHESTER, England - Manchester United is tied 1-1 with Rostov heading into their second leg of the Europa League's last 16. In another standout match, Lyon holds a 4-2 lead over Roma. By Steve Douglas. UPCOMING: 600 words by 2200 GMT, photos.\nFOOTBALL:\nSOC--EUROPEAN SOCCER WEEKEND\nUNDATED- What to watch out for in the leading soccer leagues in Europe this weekend. UPCOMING: 700 words by 1500 GMT, photos.\nSOC--ENGLISH SPOTLIGHT-MAN CITY\nLONDON - Pep Guardiola was hired to take Manchester City to another level. Instead they have regressed under Guardiola, not only in the Champions League but also in the Premier League. By Rob Harris. UPCOMING: 700 words by 1600 GMT, photos.\nSOC--FRANCE SPOTLIGHT-MAGICAL MONACO\nMONACO - Led by the irrepressible form of teen forward Kylian Mbappe, Monaco is winning widespread admiration for a scintillating brand of attacking football that has produced 126 goals so far this season. By Jerome Pugmire. SENT: 800 words, photos.\nSOC--GERMANY SPOTLIGHT-HERTHA-DARDAI\nBERLIN - Hertha Berlin is hoping birthday wishes for coach Pal Dardai bring some extra luck in its unlikely push for Champions League football. By Ciaran Fahey. SENT: 670 words.\nSOC--SPAIN SPOTLIGHT-ATLETICO MADRID\nMADRID - Atletico Madrid made it through to the quarterfinals of the Champions League this year, and now it has a chance to close in on ensuring a spot in next season's tournament. By Tales Azzoni. SENT: 430 words.\nSOC--ITALY SPOTLIGHT-INTER MILAN\nMILAN - Inter Milan's freescoring forwards are preparing to fire it into the Champions League. By Daniella Matar. UPCOMING: 500 words by 1700 GMT, photos.\nSOC--MIDDLESBROUGH-KARANKA OUT\nMIDDLESBROUGH, England - Aitor Karanka left Middlesbrough on Thursday after more than three years in charge with the club fighting relegation from the Premier League. SENT: 240 words, photos.\nSOC--PORTUGAL SQUAD\nLISBON, Portugal - Nani will miss Portugal's World Cup qualifier against Hungary because of injury. SENT: 200 words.\nRUGBY UNION:\nRGU--FRANCE-WALES\nPARIS - France coach Guy Noves made just one change Thursday to his starting line-up to face Wales in their final Six nations match. SENT: 300 words.\nCRICKET:\nCRI--SRI LANKA-BANGLADESH\nCOLOMBO, Sri Lanka - Bangladesh stuttered and lost three wickets close to stumps Thursday after Saumya Sarkar's fluent half-century gave them a dominant start to their first innings on the second day of the second cricket test. By Krishan Francis. SENT: 370 words, photos.\nCRI--NEW ZEALAND-SOUTH AFRICA\nWELLINGTON, New Zealand - Henry Nicholls chose an opportune moment to reach his maiden test century as he led a concerted New Zealand fightback Thursday on the first day of the second test against South Africa. SENT: 570 words, photos.\nCRI--INDIA-AUSTRALIA\nRANCHI, India - Steve Smith scored his 19th hundred as Australia reached 299-4 at stumps on day one of the third test against India here on Thursday. By Chetan Narula. SENT: 560 words, photos.\nBASKETBALL:\nBKN--LAKERS-ROCKETS\nHOUSTON - Lou Williams scored 30 points against his former team and James Harden had his 17th triple-double of the season to lead the Houston Rockets over the Los Angeles Lakers 139-100 on Wednesday night. SENT: 380 words, photos.\nBKN--HEAT-SPOELSTRA\nMIAMI - Ron Rothstein still speaks with nothing but reverence for his longtime friend Chuck Daly, who won two NBA titles with Detroit on his way to enshrinement in the Basketball Hall of Fame. By Tim Reynolds. SENT: 570 words, photos.\nBKN--WARRIORS-REGAINING MOMENTUM\nOAKLAND, California - Sure, it's a little strange for Steve Kerr to be talking about how his Golden State Warriors must regain momentum in March. By Janie McCauley. SENT: 900 words, photos.\nHOCKEY:\nHKN--WIDEMAN-SUSPENSION\nNEW YORK - A U.S. district court ruled against the NHL in the league's effort to overturn the reduction of Dennis Wideman's suspension by a neutral arbitrator last season. SENT: 280 words.\nHKO--CHINA-KEENAN\nMOSCOW - Mike Keenan is taking charge of a Chinese hockey team. The longtime NHL coach has been hired to lead Chinese club Kunlun Red Star. By Will Graves. SENT: 230 words, photos.\nBASEBALL\nBBI--RAMIREZ IN JAPAN\nTOKYO - Manny Ramirez is set to begin the next chapter of his baseball odyssey by playing for the Kochi Fighting Dogs of Japan's independent Shikoku Island League. By Jim Armstrong. SENT: 650 words, photos.\nBBO--SPRING TRAINING\nUNDATED - Kansas City expects All-Star catcher Salvador Perez to be ready for its opener at Minnesota on April 3 after tests showed inflammation but no structural damage in his injured left knee. SENT: 1180 words, photos.\nYOUR QUERIES: Questions and story requests are welcome. Contact your local AP bureau or the AP International Sports Desk in London by telephone at 44-2074274105 or email lonsports@ap.org.","url":"https://www.dailymail.co.uk/wires/ap/article-4320278/WORLD-SPORTS-1330-GMT.html"}
