{"authors":["Richard Gray For Mailonline"],"date_download":"2018-10-23 00:54:48","date_modify":"2018-10-23 00:54:48","date_publish":"2016-01-11 11:06:42","description":"Archaeologists discovered the huge stash of tea in the tomb of Emperor Jing, the fourth emperor of the Western Han Dynasty, while excavating in Xi'an, Sha'anxi Province, China.","filename":"data/vaneerConsumption/WorldsoldestteafoundinancientChineseemperorstomb.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/300824E600000578-0-image-a-2_1452512235806.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3393715_That-s-brewing-long-time-2-150-year-old-tea-leaves-treasures-buried-Chinese-emperor-provide-earliest-evidence-Silk-Road-trade-route_1540256088.html","title":"World's oldest tea found in ancient Chinese emperor's tomb","title_page":"World's oldest tea found in ancient Chinese emperor's tomb | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The world's oldest tea leaves have been discovered buried with royal treasures in the tomb of an ancient Chinese emperor who ruled more than 2,150 years ago.\nUnearthed in the tomb of Jing Emperor Liu Qi, the tea provides some of the earliest evidence for the ancient Silk Road trade route that grew to stretch across Asia from China to Europe.\nIt appears Emperor Jing, who was the fourth emperor of the Western Han Dynasty, enjoyed the drink so much he wanted to be buried with a large supply of tea leaves so he could drink it in the afterlife.\nArchaeologists have discovered a huge stash of the oldest tea in the world buried in the tomb of an ancient Chinese emperor. The tea (pictured right) was badly decomposed, but analysis showed only the finest tips (bottom left) had been picked and buried with the emperor. Similar tea was found in a tomb in Tibet (top left)\nArchaeologists discovered the huge stash of tea buds – or tips - in one of the burial pits that surrounded the mausoleum built for the emperor and his wife in Xi'an, Sha'anxi Province, China.\nAlthough the plant material had decomposed, analysis revealed it had been some of the finest quality tea buds from the tea bush Camellia sinensis.\nWHO WAS EMPEROR JING? Emperor Jing was a key figure in Chinese history, crushing a rebellion and setting the scene for the rule of his son, Emperor Wu. He ruled from 157BC until his death in 141BC, when he was buried in the Han Yangling Mausoleum in Xi'an, Sha'anxi Province. More than 50,000 terracotta figurines and animals were buried in his tomb complex along with silks, weapons and chariots. The tea 'buds' unearthed in his tomb provides some of the earliest evidence for the ancient Silk Road trade route that grew to stretch across Asia from China to Europe. It appears Emperor Jing, who was the fourth emperor of the Western Han Dynasty, enjoyed the drink so much he wanted to be buried with a large supply of tea leaves so he could drink it in the afterlife.\nWriting in the journal Scientific Reports, Dr Houyuan Lu, an archaeologist with the Chinese Academy of Sciences in Beijing, and his colleagues described also finding similar tea remains in a tomb in Tibet.\nThey said this also dates to around 200AD, which is the earliest indication tea was being transported along, and traded on, what later became known as the Silk Road.\nIn particular, they said it appears tea was grown 2,150 years ago to 'cater for the drinking habits of the Western Han Dynasty' before spreading towards central Asia.\n'Our study reveals that tea was drunk by Han Dynasty emperors as early as 2,100 years before present and had been introduced into the Tibetan Plateau by 1,800 years before present,' the researchers explained.\n'This indicates that one branch of the Silk Road passed through western Tibet at that time.'\nBefore the discovery of the tea in Emperor Jing's tomb, the oldest record of the beverage is in a 2,000-year-old text that mentions the drink.\nEmperor Jing (illustrated left) was the fourth ruler in the Western Han Dynasty and played a key role in Chinese history. Archaeologists excavating a pit in his tomb (pictured right) found decomposed plant material spread over an area 42 feet wide and up to eight inches thick. Analysis has shown this was tea\nThe researchers said the tea suggests the Silk Road opened earlier than thought. In particular, the tea was drunk by Han Dynasty emperors 2,100 years ago and was introduced into the Tibetan Plateau 1,800 years ago. This indicates one branch passed through western Tibet at that time\nWHAT WAS THE SILK ROAD? The Silk Road is the collective name given to ancient trade routes between China and Central Asia. It was named because it was predominantly used to transport silk, which was made in China in the 7th century, to the west. Other goods that travelled along these trade routes included cucumbers, figs and pomegranates. Tea was thought to have been introduced to Tibet between 625AD and 680AD when the Tan Princess Wencheng as part of her dory to the Songtsen Gambo. However, the researchers believe tea was introduced more than 400 years earlier than that during the Zhang Zhung kingdom. They said: 'This was at least four to five hundred years earlier than the Southwest Silk Road through Yunnan, which opened in the seventh century. 'Our data indicate that the plant residues unearthed at both the Han Yangling Mausoleum and Gurgyam Cemetery are the earliest physical evidence of tea in the world.'\nEmperor Jing himself was a key figure in Chinese history, crushing a rebellion and setting the scene for the long rule of his son, Emperor Wu.\nHe ruled from 157BC until his death in 141BC, when he was buried in the Han Yangling Mausoleum in Xi'an, Sha'anxi Province.\nMore than 50,000 terracotta figurines and animals were buried with Emperor Jing in his tomb complex along with silks, weapons and chariots.\nDuring the recent excavation, archaeologists found decomposed plant material spread up to 3-inches (8cm) deep over an area more than 42ft (13 metres) wide in one area of the mausoleum.\nThe site was originally excavated in the 1990s, but researchers have only now been able to analyse the plant material found in one of the pits.\nThe researchers used electron microscopes and mass spectrometry to help them identify the decomposed plant material found in the tombs.\nThe mass spectrometry showed the samples matched those of modern green tea and contained high levels of caffeine.\nThey also examined plant material found in a tomb in the Gurgyam Cemetery in Nigari, western Tibet, which also turned out to be tea.\nTea was thought to have been introduced to Tibet between 625AD and 680AD when the Tan Princess Wencheng as part of her dory to the Songtsen Gambo.\nThe tea samples studied in the research were discovered in a pit in the Han Yangling Mausoleum in Xi'an and in Gurgyam Cemetery in Ngari, western Tibet (illustrated). They are the oldest samples of tea to be found\nMore than 50,000 terracotta figurines (pictured) and animals were buried with Emperor Jing in his tomb complex along with silks, weapons and chariots. During the recent excavation, archaeologists found decomposed plant material spread up to 3-inches (8cm) deep over an area more than 42ft (13 metres) wide\nHowever, the researchers believe tea was introduced more than 400 years earlier than that during the Zhang Zhung kingdom.\nThey said: 'This was at least four to five hundred years earlier than the Southwest Silk Road through Yunnan, which opened in the seventh century.\n'Our data indicate that the plant residues unearthed at both the Han Yangling Mausoleum and Gurgyam Cemetery are the earliest physical evidence of tea in the world.","url":"https://www.dailymail.co.uk/sciencetech/article-3393715/That-s-brewing-long-time-2-150-year-old-tea-leaves-treasures-buried-Chinese-emperor-provide-earliest-evidence-Silk-Road-trade-route.html"}
