{"authors":["Andrew Meola"],"date_download":"2018-10-30 22:06:03","date_modify":"2018-10-30 22:06:03","date_publish":"2016-12-15 00:00:00","description":"New fintech companies are springing up around the world and disrupting the financial services sector. See where the worlds top fintech providers are from and how they help make the globe a little smaller.","filename":"data/vaneerConsumption/Worldwidefinancialservicesandglobalfintech.json","image_url":"https://amp.businessinsider.com/images/58505d00ca7f0ce9478b5081-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_worldwide-financial-services-and-global-fintech-2016-12_1540937163.html","title":"Worldwide financial services and global fintech","title_page":"    Worldwide financial services and global fintech - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"New fintech companies are springing up around the world and disrupting the financial services sector.\nEach of these companies brings a unique and useful service to the fintech ecosystem, which has swelled in the past couple of years. After it hit $19 billion in total in 2015, worldwide fintech funding hit $15 billion by mid-August 2016.\nThe U.S., Europe, and the Asia-Pacific (APAC) region led the way in attracting the most fintech investment, but fintech companies are laying down roots all over the globe.\nBelow, we've compiled a list of fintech companies to know, sorted by location.\nUSA Fintech\nEurope Fintech\nAsian Fintech\nSouth American Fintech\nMore to Learn\nThis extensive list of global fintech companies is just the beginning for the fintech industry, which is growing in entirely new ways.\nThat's why BI Intelligence spent months compiling the best and most comprehensive guide on the world of fintech entitled The Fintech Ecosystem Report: The Emerging Technologies and Firms Driving Change in Financial Services and How Legacy Players Can Navigate The Disruption.\nTo get your copy of this invaluable guide to the payments industry, choose one of these options:\nSubscribe to an ALL-ACCESS Membership with BI Intelligence and gain immediate access to this report AND over 100 other expertly researched deep-dive reports, subscriptions to all of our daily newsletters, and much more. >> START A MEMBERSHIP Purchase the report and download it immediately from our research store. >> BUY THE REPORT\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of the fast-moving world of financial technology.","url":"https://www.businessinsider.com/worldwide-financial-services-and-global-fintech-2016-12"}
