{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 21:31:25","date_modify":"2018-10-30 21:31:25","date_publish":"2016-02-23 16:09:58","description":"The InterContinental Hotels Group has announced that it is eliminating all on-demand porn from the guest rooms in its 4,900 properties in 100 countries.","filename":"data/vaneerConsumption/WorldsBiggestHotelChaintoRemoveAllOnDemandPorninGuestRooms.json","image_url":"https://media.breitbart.com/media/2015/08/Online-Porn-Internet-640-x--e1513277239266.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_23__1540935085.html","title":"World’s Biggest Hotel Chain to Remove All On-Demand Porn in Guest Rooms","title_page":"World’s Biggest Hotel Chain to Remove All On-Demand Porn in Guest Rooms","title_rss":"NULL","source_domain":"breitbart.com","text":"The InterContinental Hotels Group (IHG) has announced that it is eliminating all on-demand pornography from the guest rooms in its 4,900 properties in 100 countries.\nInterContinental, which owns such well-known brands as Holiday Inn and Crowne Plaza, has thereby allied itself with a trend among large hotel chains to clean up their act, especially in the face of public pressure from anti-pornography activists.\nWith 727,000 rooms in 100 countries, InterContinental is the world’s biggest hotel company, though Marriott International Inc. will reportedly overtake the firm later this year when it completes its acquisition of Starwood Hotels and Resorts Worldwide Inc.\nIn 2015, both Hilton Worldwide and Hyatt Hotels Corporation made similar announcements, pledging to remove all on-demand pornography from their hotels by summer 2016.\nIn an email to Breitbart News, an IHG spokesperson said that the new policy dovetails with the company’s commitment to “a range of initiatives designed to safeguard human dignity—from supply chain protocols and human rights to sexual exploitation.”\nDawn Hawkins, Executive Director of the National Center on Sexual Exploitation (NCOSE), applauded IHG for pledging to “reinforce its existing brand standard that prioritizes the dignity and safety of its guests.”\n“This commitment by IHG comes about as a new normal expands across the hotel industry,” Hawkins said in an email, “where increasingly hoteliers are recognizing that pornography is an exploitive means of profit, partly due to pornography’s link to prostitution, sex trafficking, and sexual violence.”\nThough IHG’s Spokesperson said that the company has had a standard in place for years obliging franchisees not to broadcast adult content, this standard has not always been followed. Now, hotels who continue to sell pornography “will face strict penalties for noncompliance,” he said.\n“IHG’s announcement continues a growing trend among major hotel chains of commitments to no longer profit from pornography,” Hawkins continued.\nHilton Worldwide made a similar policy change in 2015 after being shamed into removing its porn offerings. The hotel chain had been listed for a short time on the NCOSE’s “Dirty Dozen” list, which names twelve mainstream contributors to sexual exploitation.\nThe list comprises the 12 primary “contributors to sexual exploitation,” and has included such organizations as American Apparel, American Library Association, backpage.com, CKE Restaurants, Cosmopolitan magazine, Department of Justice, Facebook, Fifty Shades of Grey, Sex Week, Verizon, and YouTube.\nOn February 25, NCOSE will announce its Dirty Dozen list for 2016.\nOmni Hotels and Resorts also stopped selling pornography in 1998, and Marriot has said it is “phasing out” pornography sales, while the Hilton chain had previously defended its continued sales.\nIn 2013, Nordic Hotels – a major Scandinavian hotel chain – announced that it was eliminating pay-per-view pornography channels from its 171 hotels.\nRevenue from video-on-demand services has reportedly fallen in recent years as guests bring their own movies or stream content via hotel-provided Wi-Fi.\nRobert Mandelbaum, director of research information services at PKF Hospitality research, said that the decline in revenues in past years has been “really dramatic,” with profits from on-demand services dropping “by half” since 2007.\n“Between 2013 and 2014 demand for pay-per-view services fell by 12 per cent, and that’s while the hotel industry is achieving record profitability,” he said.\n“It’s not like we’re in the middle of a recession. The hotels themselves are full, people just aren’t paying to use these services anymore,” he said.\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/politics/2016/02/23/worlds-biggest-hotel-chain-to-remove-all-on-demand-porn-in-guest-rooms/"}
