{"authors":[],"date_download":"2018-10-30 18:51:23","date_modify":"2018-10-30 18:51:23","date_publish":"2015-06-18 13:26:11","description":"Wednesday’s murders at Charleston’s Emanuel African Methodist Episcopal Church mark the nation’s deadliest attack at a house of worship.","filename":"data/vaneerConsumption/WorstmassslayingsatUSchurches.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/06/18/Images/photos.medleyphoto.7457288.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_worst-mass-slayings-churches__1540925483.html","title":"Worst mass slayings at U.S. churches","title_page":"Worst mass slayings at U.S. churches","title_rss":"NULL","source_domain":"ajc.com","text":"Wednesday’s murders at Charleston’s Emanuel African Methodist Episcopal Church mark the nation’s deadliest attack at a house of worship. Nine people attending a Bible study class at the historic African-American church died after a white gunman opened fire. These are the worst previous attacks:\nAug. 5, 2012: White supremacist Wade Michael Page murdered six people during an attack on a Sikh temple in Wisconsin. He committed suicide after he was shot by a responding police officer.\nJuly 27, 2008: Jim David Adkisson fired at members of the Tennessee Valley Unitarian Universalist Church in Knoxville, Tennessee, killing two people and wounding seven others. He said he was motivated by hatred of Democrats, liberals, African Americans and gays.\nMay 21, 2006: Four people were killed at Ministry of Jesus Christ Church in Baton Rouge by a man who also attacked and kidnapped his wife from the church and later killed her at another location. All the victims were members of the extended family of the shooter, Anthony Bell.\nMarch 12, 2005: Seven people were killed at Living Church of God in Brookfield, Wisconsin by Terry Ratzmann, a parishioner who later committed suicide. Upset by a sermon, he left the service and came back shooting.\nSept. 5, 1999: Larry Gene Ashbrook fired over 100 rounds and exploded a pipe bomb at Wedgwood Baptist Church in Fort Worth, killing seven young people and wounding seven others before killing himself. He was spouting anti-Baptist rhetoric but was said to be severely mentally ill.\nJune 20, 1980: Alvin Lee King III killed five people and wounded 10 others during morning worship at First Baptist Church in Daingerfield, Texas. At the time, he was facing charges for raping his daughter.\nSept. 15, 1963: Four members of the Ku Klux Klan bombed the 16th Street Baptist Church in Birmingham, Alabama, killing four girls and injuring 22 others.","url":"https://www.ajc.com/news/crime--law/worst-mass-slayings-churches/7MNcHZO99fn9SE3n2uJtVL/"}
