{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 17:56:11","date_modify":"2018-10-30 17:56:11","date_publish":"2015-06-25 17:59:52","description":"In the Obamacare case, the Court pretended to know what was really in the minds of legislators in spite of their explicit words (and evidence of their actual intent). In Texas Housing, the Court has ruled that the federal government can decide what is really in the minds of ordinary people, whether they intend to discriminate or not. |","filename":"data/vaneerConsumption/WorsethanObamacareHousingCaseLetsFedsTargetUnconsciousRacism.json","image_url":"https://media.breitbart.com/media/2015/06/Anthony-Kennedy-Win-McNamee-Getty-1024x768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_25__1540922171.html","title":"Worse than Obamacare: Housing Case Lets Feds Target 'Unconscious' Racism","title_page":"Worse than Obamacare: Housing Case Lets Feds Target 'Unconscious' Racism | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"As bad as the Supreme Court’s ruling in Obamacare was, the other decision it handed down on Thursday, in Texas Housing v. Inclusive Communities, is even worse.\nLike the opinion in King v. Burwell, in which the Court effectively rewrote the plain language of the so-called Affordable Care Act, in Texas Housing the 5-4 majority decided that Congress had allowed claims of housing discrimination to be brought based on population statistics, when in fact it has never done so.\nNow, plaintiffs do not need to show there was actual racial discrimination, or an intent to discriminate. Instead, they can just point to the racial makeup of a neighborhood and infer that discrimination must have happened in order to bring a lawsuit and force communities to re-engineer themselves.\nThe Court comforts itself by claiming that racial quotas still cannot be used to integrate communities. In fact, it has weaponized racial quotas in the hands of the federal government.\nIt is perhaps just a coincidence that the Texas Housing decision comes as the Department of Housing and Urban Development has announced a policy designed to pressure wealthy communities to build “affordable” housing in their midst.\nThe goal in Texas Housing, however, is not just to diversify neighborhoods, but to uncover what Justice Anthony Kennedy, writing for the majority, calls “unconscious prejudice.”\nThe dissent, written by Justice Samuel Alito, points out the absurdity of using “disparate impact” as a measure of racial discrimination. By the same logic, he writes, minimum wage laws must be racist, because they can be shown to have a disproportionately negative effect on young black males, who are priced out of the labor market. Alito also notes that neither the 1968 Fair Housing Act, nor its 1988 amendments, allowed “disparate impact” to be evidence of racial discrimination.\nYet that is how the Court has interpreted the statutes, on the argument that disparate impacts might be evidence of racial discrimination.\nThat may be reasonable in cases where money is not a main factor–like college admissions, for instance, where the fact that Ivy League universities admit Asian-American students at a lower rate than other schools makes for a possible case of discrimination. It is not reasonable, however, to use such statistics when the underlying factor is money–when there are some neighborhoods that are simply more expensive than others.\nThe courts cannot be expected to rearrange the socioeconomic structure of society–except, perhaps in the fevered imagination of a young radical named Barack Obama, circa 2001.\nHow bad is this decision? The federal government expected to lose–so much so, in fact, that it spent years settling cases on “disparate impact” before they could reach the Supreme Court, lest that tool of intimidation be taken away.\nThe Court has now affirmed one of the federal government’s most abusive tactics: the threat of racial discrimination lawsuits. And the biggest losers, Alito points out, are the poor, because now local efforts to improve poor neighborhoods can be blocked by lawsuits alleging racial discrimination when the rent is raised.\nIn the Obamacare case, the Court pretended to know what was really in the minds of legislators in spite of their explicit words (and evidence of their actual intent). In Texas Housing, the Court has ruled that the federal government can decide what is really in the minds of ordinary people, whether they intend to discriminate or not.\nYou may not know you are a racist–but you are, now.","url":"https://www.breitbart.com/politics/2015/06/25/worse-than-obamacare-housing-case-lets-feds-target-unconscious-racism/"}
