{"authors":["Pauline Bartolone","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:53:44","date_modify":"2018-10-30 22:53:44","date_publish":"2016-04-10 08:00:00","description":"When Californians go to the polls this November, they’ll weigh-in on a contentious health care topic amplified by presidential campaigns: prescription","filename":"data/vaneerConsumption/WouldaCaliforniaballotmeasurecutdrugcostsNobodyknows.json","image_url":"https://calmatters.org/wp-content/uploads/AP_449434798681.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940024.html","title":"Would a California ballot measure cut drug costs? Nobody knows","title_page":"Would a California ballot measure cut drug costs? Nobody knows | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"When Californians go to the polls this November, they’ll weigh-in on a contentious health care topic amplified by presidential campaigns: prescription drug prices.\nA state ballot initiative, Proposition 61, would restrict California health programs from paying more for a prescription drug than what’s paid by the U.S. Department of Veterans Affairs, which is widely cited as paying the lowest prices in the nation.\nThe initiative’s proponents, Los-Angeles based AIDS Healthcare Foundation, say the measure is a remedy to “excessively priced” drugs that make it harder for patients to “get the drugs that they need.”\nBut what looks like a straightforward framework to protect California’s budget from escalating drug costs has policy experts perplexed, and potential allies on the sidelines. Critics and consumer advocates alike say the initiative’s language is flawed, and may lead to higher drug prices and access problems for patients.\nA small army of pharmaceutical companies have raised more than $52 million to defeat the measure, more than 12 times what the AIDS Healthcare Foundation spent to put it on the ballot. But one need not go farther than the AIDS advocacy community itself to find criticism of the proposal.\n“We are incredibly supportive of the intent,” said Anne Donnelly, director of health care policy for Project Inform, a San Francisco-based organization that advocates for HIV and hepatitis C patients, and is part of the ad-hoc Fair Pricing Coalition to bring down prescription costs.\nThe details of the measure “are so obscure and unclear,” Donnelly said, “there is a possibility for some unintended, very harmful consequences.”\nThe initiative says it applies to any health program where the state is “the ultimate payer,” but Donnelly says it’s not clear to her which agencies that would involve. California’s AIDS Drugs Assistance Program, for instance, is funded with federal money. The proposition does list the AIDS program.\nDonnelly also wonders what options state agencies have if the V.A. price could not be obtained.\nDrugmakers could raise the initial sticker price, said Donnelly, or stop giving discounts to the V.A.\n“It’s kind of like the whack-a-mole thing, right? When you try to push one thing down are you really sure that something else isn’t going to pop up?” Donnelly said.\nProponents say any questions about the measure, including decisions about which agencies would be subject to the law, can be ironed out by state officials carrying out the law.\n“We’re not going to be in the business of micromanaging the administration and telling them how they need to implement this program,” said Rand Martin, a lobbyist with MVM Strategy Group and a spokesman for the AIDS Healthcare Foundation.\n“Whatever the challenges to getting this initiative implemented are going to be because the pharmaceutical industry wants it that way,” he said.\nProject Inform, as well as another consumer advocacy group, San Francisco AIDS Foundation, say their concerns about the measure don’t amount to opposition. Both groups accept money from drugmakers but say their advocacy priorities are independent from their funding.\nGroups who don’t have a stake in the drug pricing issue also say the impact of such a law is impossible to forecast.\nA drug’s sticker price is almost always negotiated down, and the final price paid by the state or an insurer is generally sealed by law or through private contracts.\nThat lack of transparency makes it hard to assess how much money, if any, the state would save from the measure, says the Legislative Analyst’s Office.\n“We rarely are not able to complete the analysis,” said Amber Didier, an LAO fiscal and policy analyst who wasn’t able to perform a write-up for the signature gathering on the ballot, but is working on language for the November voter guide.\nDidier said even if she knew the final drug discounts state agencies receive, it would still be hard to predict how the pharmaceutical industry might change pricing if the measure became law.\n“There are potentially different ways that pharmaceutical companies could react to this that would then influence the fiscal impact,” Didier said.\nProponents argue the measure would create “significant savings to California taxpayers.” They point to a 2005 Congressional Budget Office report suggesting that, on average, the V.A. pays 42 percent of a brand name drug’s sticker price, whereas state Medicaid programs pay 51 percent.\nMedi-Cal officials say while they don’t know what the VA ultimately pays for drugs, if you include the additional discounts the California agency secures from drugmakers, its payments may already be close to or “do better” than what the V.A. pays.\n“We negotiate hard,” said Mike Wofford, chief of pharmacy policy at the California Department of Health Care Services, which oversees Medi-Cal.\nThe drugmaker-funded opposition campaign says patients should be concerned about the measure. Pharmaceutical manufacturers could choose not to give state-negotiated discounts because of the law. Under Medi-Cal rules, when a deeper discount is not obtained for a drug, doctors have to get approval before the medication can be dispensed. That could result in delays for patients, according to the “no” campaign.\n“There’s a million questions you could raise about this initiative,” said Kathy Fairbanks, spokesperson for the “no” campaign. “It’s not going to work. It’s a hot mess.”\nMeantime, there is evidence that the state is seeing a rise in drug spending despite new policies to control costs.\nA CALmatters analysis found that state prisons, the California public pension system, and a subset of the Medi-Cal program spent $600 million more on pharmaceuticals in 2014 than in 2012. That does not include the Medi-Cal population in a health plan, nor does it account for discounts the state may have received from drugmakers.\nA new law allows state lawmakers to hold a hearing on the measure by June 30, the same date by which proponents can take the initiative off the November ballot.\nOther health consumer groups and lawmakers are already pursuing price transparency-related measures in the Legislature.\n“It really does fall to the states to try to move the ball on … prescription drug costs,” said Anthony Wright of Health Access, forecasting political gridlock in Washington, D.C.\nWright’s group hasn’t yet taken a position on the drug price ballot initiative. Regardless of its merit, he said, “it’s important to have the conversation.”\nCALmatters is a nonprofit journalism venture dedicated to explaining state policies and politics. Pauline Bartolone wrote this article while participating in the California Data Fellowship, a program of the Center for Health Journalism at USC’s Annenberg School of Journalism.","url":"https://calmatters.org/articles/would-a-california-ballot-measure-reduce-drug-spending-nobody-knows/"}
