{"authors":["Daily Mail Reporter"],"date_download":"2018-10-22 21:18:21","date_modify":"2018-10-22 21:18:21","date_publish":"2016-01-29 06:32:23","description":"A would-be thief received what some would call instant karma after he was filmed screaming in pain claiming to have broken his ankle during an attempted robbery.","filename":"data/vaneerConsumption/Wouldbethiefbreaksankleduringrobberyandbegsvictimformercy.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30B0125C00000578-0-image-a-73_1454049150119.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422260_Would-thief-breaks-ankle-robbery-begs-victim-mercy_1540243101.html","title":"Would-be thief breaks ankle during robbery and begs victim for mercy","title_page":"Would-be thief breaks ankle during robbery and begs victim for mercy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A would-be thief received what some would call instant karma after he was filmed screaming in pain claiming to have broken his ankle during an attempted robbery.\nVideo captured of the man first shows him crouching over in pain as he leans on a railing screaming 'my ankle, my ankle.'\nThe person filming the video can be heard demanding for the unidentified thief to throw over a knife that the thief reportedly had in his possession.\n'On my mother's grave I threw it,' he replied while breathing heavily. The man recording the video can be heard telling another person who is out of the camera's view that the injured man tried to 'rob' him for his phone and pulled a knife out to threaten him.\nThe victim then asks if he should call the police, as the thief begs for mercy claiming that his ankle is broken in the 38 second long video.\nIt's unclear when or where the video was recorded, but since being uploaded to vid.me it's been viewed more than 148,000 times.\nOuch: A would-be thief received what some would call instant karma after he was filmed screaming in pain claiming to have broken his ankle during an attempted robbery. He can be heard screaming in pain in the video","url":"https://www.dailymail.co.uk/news/article-3422260/Would-thief-breaks-ankle-robbery-begs-victim-mercy.html"}
