{"authors":["Abc News"],"date_download":"2018-10-30 00:56:23","date_modify":"2018-10-30 00:56:23","date_publish":"2018-10-29 13:46:24","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.","filename":"data/vaneerConsumption/WRDeVanteParkerexpectedtoremainwithDolphins.json","image_url":"http://media.video-cdn.espn.com/motion/2018/1029/dm_181029_kershaw_machado_future/dm_181029_kershaw_machado_future_default.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Sports_wr-devante-parker-expected-remain-dolphins_story_id=58831495_1540860983.html","title":"WR DeVante Parker expected to remain with Dolphins","title_page":"WR DeVante Parker expected to remain with Dolphins - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"DAVIE, Fla. -- Despite a largely frustrating year, DeVante Parker is expected to remain with the Miami Dolphins for the rest of the 2018 season.\nParker, Miami's talented but oft-injured 2015 first-round pick, has been the subject of trade talks dating back to training camp. But Dolphins coach Adam Gase didn't hesitate when asked whether he feels confident that Parker will remain in Miami past the trade deadline: \"Yeah. I do.\"\nParker missed five of the first seven games this season for various reasons, including a broken middle finger, a bad quad and a coach's decision. On Oct. 21, Parker's agent, Jimmy Gould, escalated an already sticky situation by calling Gase \"incompetent\" in a statement to ESPN that questioned the coach's honesty in how he has handled his client.\nParker was adamant that Gould did not speak for him, and that it was \"his own opinion.\" The following Thursday night, he had six catches for a career-high 134 yards in a loss to the Texans.\nThe Dolphins need Parker to contribute now that Albert Wilson has been placed on injured reserve with a hip injury and Kenny Stills continues to battle a groin injury that kept him out Thursday.\nGase didn't anticipate the Dolphins being sellers at the trade deadline, expressing confidence that his team can still make a playoff push after a 4-4 start.\n\"I like where we're at right now. I like this group,\" Gase said. \"I'd like to stay healthy from here on out. I don't think we have much more room for losing guys for the year. I think we've maxed out on that.\"\nThe NFL trade deadline is Tuesday at 4 p.m. ET.\nGase also said quarterback Ryan Tannehill is \"slowly progressing\" from the right shoulder injury that has kept him out for the past three games. Tannehill has begun light throwing, Gase said, but he's not ready to throw at the level he needs to be to play yet.\n\"He can throw a . It's about how much power he can put behind,\" Gase said.\nIndications are that Brock Osweiler is in line to make his fourth start of the season Sunday vs. the New York Jets.\nGase said Tannehill threw tennis balls last week, and has done some light throwing with a . The Dolphins' coaching staff will watch Tannehill closely this week.\nGase said he would ideally like to identify this week's starting quarterback by Wednesday.\n\"He's in position where he can throw a football. We're gaining strength in that area,\" Gase said of Tannehill. \"We'll see more in the next few days of how he feels the next day after he gets a chance to throw -- how sore he is the next day or how much power he has.\"\nGase has repeatedly called Tannehill's injury \"unusual,\" saying there is \"a lot of gray\" in how trainers evaluate his recovery. There is fear of a \"huge setback\" if they push him too fast.\nOsweiler has received positive reviews from Gase and the Dolphins' coaching staff as Tannehill's replacement. Yet Gase has repeatedly said that Tannehill will be the starter once he is ready.","url":"https://abcnews.go.com/Sports/wr-devante-parker-expected-remain-dolphins/story?id=58831495"}
