{"authors":[],"date_download":"2018-10-30 17:55:08","date_modify":"2018-10-30 17:55:08","date_publish":"2018-09-10 22:40:00","description":"ATLANTA FORECAST \nTuesday: High: 88\nTuesday night: Low: 73\nWednesday: High: 88\n&...","filename":"data/vaneerConsumption/Wreckscongestionincreaseasrainmovessouth.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/09/11/Videos/4480967.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/weather_tuesday-weather-tra_38a4b04575d030d54d9a6a75dacc1590__1540922108.html","title":"Wrecks, congestion increase as rain moves south","title_page":"WEATHER-TRAFFIC: Wrecks, congestion increase as rain moves south","title_rss":"NULL","source_domain":"ajc.com","text":"ATLANTA FORECAST\nTuesday: High: 88\nTuesday night: Low: 73\nWednesday: High: 88\n» For a detailed forecast, visit The Atlanta Journal-Constitution weather page.\nTraffic is building on metro Atlanta’s interstates as most of the rain continues to move south of the city, according to Channel 2 Action News.\nI-20 West is gridlocked near Lee Street because a vehicle fire is blocking all lanes, according to the WSB 24-hour Traffic Center.\n#REDALERT Downtown: I-20/wb at Lee St (exit 55B); vehicle fire blocking all lanes; use MLK as an alternate https://t.co/2hvjWkI3bV #ATLtraffic pic.twitter.com/pgOQ8UUyeH — AJC WSB Traffic (@ajcwsbtraffic) September 11, 2018\nAn earlier I-20 West wreck at Panola Road in DeKalb County has been cleared, but delays continue to linger, the Traffic Center reported.\nThat’s not all the problems on I-20 this evening as an eastbound wreck near Wesley Chapel Road is blocking three lanes in DeKalb, causing delays, according to the Traffic Center.\nDeKalb Co: I-20/eb at Wesley Chapel Rd (exit 68); crash blcoking 3 right lanes; delays https://t.co/2hvjWkI3bV #ATLtraffic pic.twitter.com/3oeVBXLWX1 — AJC WSB Traffic (@ajcwsbtraffic) September 11, 2018\nWhile the Carolina coast braces for impact from Hurricane Florence later this week, Georgia should see the last of its wet weather Tuesday and Wednesday.\nAccording to Channel 2, a 60 percent chance of showers and storms Tuesday can’t be attributed to Florence, now a Category 4 hurricane. Instead, a stationary cold front draped across North Georgia will fuel the storm activity, Channel 2 meteorologist Karen Minton said.\n“It’s really not going anywhere,” she said. “It will be a focus for showers and some storms throughout the day. We could see them pop up just about everywhere. Slow-moving, heavy rain. Lightning (is) also going to be part of the scenario.”\nFor us -- scattered showers and storms across north Georgia today and tomorrow -- before our pattern gets much drier on the western side of #Florence later this week. — Brian Monahan, WSB (@BMonahanWSB) September 11, 2018\nIt will stay hot, with temperatures in the upper 80s. It’s currently 81 degrees in Atlanta.\nShowers should diminish by 10 p.m.\nOn Wednesday, North Georgia will do it all over again with another 60 percent chance of scattered afternoon showers and storms.\nThe latest models have the center of Florence hitting Wilmington, N.C., early Friday morning, Minton said.\nHURRICANE FLORENCE COVERAGE:\nFlorence upgraded to Category 4; mandatory evacuations issued\nGeorgians prepare for Florence\nWhere is Florence now?\nIf the storm stays to the north of its projected path, Georgia should benefit from the sinking air on the backside of the system, according to Channel 2. But if the path shifts, it’s possible eastern Georgia could get wet, Minton said.\n“The models do indicate that it might bring a little bit of moisture into the eastern part of Georgia,” she said. “For the most part, we are going to end up with drier weather here.”\n(Channel 2 Action News)\n» For updated traffic information, listen to News 95.5 and AM 750 WSB and follow @ajcwsbtraffic on Twitter.\n» Download The Atlanta Journal-Constitution app for weather alerts on-the-go.","url":"https://www.ajc.com/weather/tuesday-weather-traffic-rain-returns-for-tuesday-morning-commute/YVMzVeh9cxI9G6XlJBLOeO/"}
