{"authors":["Jasmine Hauser"],"date_download":"2018-10-30 21:26:53","date_modify":"2018-10-30 21:26:53","date_publish":"2015-04-01 17:20:29","description":"Despite delays, construction, rumors, MLB wanting Cubs at US Cellular, Ricketts says Opening Night at Wrigley Field with Cardinals is a go.","filename":"data/vaneerConsumption/WRIGLEYREADYFORCARDINALS.json","image_url":"https://media.breitbart.com/media/2015/03/Wrigley-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_01__1540934813.html","title":"WRIGLEY READY FOR CARDINALS","title_page":"CUBS: WRIGLEY READY FOR CARDINALS","title_rss":"NULL","source_domain":"breitbart.com","text":"CHICAGO—Despite rumors that Major League Baseball wants the Chicago Cubs to play Opening Night at White Sox US Cellular Field because of unfinished reconstruction at 100-year old Wrigley Field, the Cubbies will indeed open the regular season at home against their legendary rivals, the St. Louis Cardinals, on Easter Sunday.\nDuring and after a 40-minute luncheon presentation at Maggiano’s Restaurant sponsored by the City Club of Chicago, Cubs baseball owner and chairman Tom Ricketts told an overflow crowd last Wednesday that the projected four-phase, $575-million renovation of the ballpark will take longer than originally planned by up to one year. Yet, while much of the ballpark will still be under construction Opening Night, fans will get to see their team play ball at “the friendly confines,” with local Chicago band Fall Out Boy kicking off festivities on the field with three songs.\nIn an interview today with Chicago talk radio WIND-560AM, Ricketts’ brother, Todd, confirmed that “Cub fans would prefer to pardon our dust and stay at Wrigley. It will be a typical opening day, except this year, we’re putting the Cardinals on notice.” Since installation of new bleachers has been delayed, fans who are season ticket holders with bleacher seats have been accommodated. (Todd Ricketts also confirmed that his older brother Tom does indeed resemble Republican Presidential candidate and Texas Sen. Ted Cruz. “It’s uncanny,” said the younger brother.)\nTom Ricketts opened his presentation with a feel-good “Let’s Go” video filled with heart-warming photography of classic spring training shots, uplifting music, and cool slow-motion edits that would pump up even a White Sox fan. Using a visual “Blueprint to Success: On the Field and in the Ballpark,” Ricketts highlighted the parallels between building the baseball organization and building the ballpark: define goals; find the right people; de-construct; build the foundation; strengthen the foundation; add to the foundation.\nIn preparing to win a World Series, the goal for the Cubs is to scout the best talent and develop players. During the question and answer period after his presentation, an audience member asked how the Cubs will address the growing international baseball talent and how they are evaluated. Ricketts noted that 20% of MLB players are from Latin American (Dominican Republic, Venezuela, Panama, etc.).\n“It’s a really interesting process. When a good, young player is 12 or 13, and he lives in the Dominican Republic, he gets found by a ‘buscon’–which is a derivative of the verb ‘buscar,’ to find—he gets a finder. And that person signs him to a contract when he is 12 or 13 years old, works out with him, makes him part of his group of players, and when he turns 16, the ‘buscon’ takes that player around to tryout for all 30 teams–or as many teams that will give him a tryout–and when that player signs, the buscon gets a cut of the fee. So what we do–one of the first things we did was–we rebuilt our Dominican training facility. We had probably the worst or tied for worst facility in all of baseball. We bought 50 acres in the Dominican Republic and built the best Dominican training facility so we can more effectively compete for those players.”\nBut the dollars spent overseas are capped by MLB, with rules, and the Cubs had to be strategic about which players they signed and when. Two seasons ago, they overspent in the international draft to get the top young players in the Dominican Republic, Venezuela, and Taiwan. They picked those spots, and now that relations with Cuba are changing, it remains one country where they will have to be “nimble and thoughtful” when scouting for talent internationally.\nWhen it came to “de-constructing” the team, Ricketts made clear they had to reconfigure what didn’t work, and that meant restocking the farm system through trades and letting go of veterans for young, controllable talent.\n“What (Cubs President) Theo (Epstein) and (General Manager) Jed (Hoyer) have been doing all these years is taking players that have a lot of current value, but very short time left with the Cubs and trading them for players that have a lot of future value and a very long period where the Cubs control those players. So effectively restocking the farm system through the trades.”\nThe result: the average age of ballplayers used to be 30.7 years old; now the average age is 22.5 years old. “We de-constructed the old roster and re-built a new, younger one.”\nWith the physical ballpark, de-construction was more literal: they ripped up every floor, tore down every wall and replaced all the beams and bleachers. “It was a de-constructed, do-over, rehab. So you have to deconstruct a bit, and tear down what you were doing wrong and then build the foundation.”\nWhen it came to building the foundation of the team, the Cubs created a core of young, talented, “potentially impact players” who are under the control of the team for years. “Theo’s goal is not to win in 2015, but to have sustained success.”\nWhen it came to building the foundation of the ballpark, Rickets rattled off an impressive list of construction details: 50 million pounds of concrete, 10 miles of plumbing, 2 miles of handrails, 2000 tons of steel. “This isn’t a paint job. It’s a heck of a project.”\nOne part of strengthening the foundation included spending money on pitching. “We went out and signed what we believe by far is the best free agent available in John Lester.” The audience applauded and Ricketts followed with: “It’s more than just ‘What were his stats last year.’ You really have to dig deep. Theo came to me and said, look this is the guy we want, this is the guy we are going after. He didn’t say ‘He’s got a great ERA or he’s won a bunch of games.’ He said this guy is the highest character guy, he takes care of himself, he goes home at night, he’s healthy, he cares about winning as much as any player around. And even though he’s not the kind of guy that will go screaming through the clubhouse, he’s the kind of guy that leads by example, and the kind of guy we need on a young team. He shares our vision for success and shares the turnaround of the Chicago Cubs and he wants to be here when we start to win.”\nAs the Cubs add to the foundation of the ballpark, Ricketts showed diagrams of the future of the plaza and clubhouse. The current clubhouse is half the size of the average MLB clubhouse, so when a player wants to get loose, to go into the game in the 7th or 8th inning to pinch-hit, he doesn’t go to the batting tunnel as he would at 29 other parks. Instead, he uses a batting tee. In the future, players will have a proper clubhouse with batting tunnels.\nMeanwhile, Wrigley neighbors will have a new plaza to use on non-game days for a farmers market or ice rink. Fans will have access to 10 more elevators, 40% more washrooms, 40 more “points of sale that are strategically located,” more kitchens, and a variety of better food and concessions on the upper deck.\nRicketts fielded a few questions from the audience after his presentation. One popular query was whether third basemen Kris Bryant will be in the starting lineup on opening day. Answer: Ricketts will leave it to the “baseball brain trust.” That brain trust subsequently made the controversial decision to demote him to the minors.\nThe Ricketts family bought the team October 27, 2009 from the Chicago Tribune. While Tom keeps his politics close to the vest, the rest of the family is quite different. His father, Joe Ricketts, is the founder and former CEO of TD Ameritrade, but often is known for his Super Pac called Ending Spending, Inc., a 501(c)4 organization which supports fiscal conservative candidates. Its Director is Todd Ricketts. Not to be outdone in conservative politics, brother Pete Ricketts was just elected Governor of Nebraska as a Republican. Their sister, Laura Ricketts, is on the other end of the spectrum as a significant supporter of Barack Obama. However, Tom was spotted at the victory party the night Illinois Republican Governor Bruce Rauner won the election in 2014. All four siblings are members of the Chicago Cubs Board of Directors.\nMark Weyermuller contributed to this report.","url":"https://www.breitbart.com/politics/2015/04/01/chicago-cubs-wrigley-ready-for-cardinals-despite-construction-delays/"}
