{"authors":["John Nolte"],"date_download":"2018-10-30 18:28:32","date_modify":"2018-10-30 18:28:32","date_publish":"2018-08-03 15:48:06","description":"The Washington Post smeared Sarah Sanders as a liar Thursday because \"wringing\" her neck is different from \"choking\" her.","filename":"data/vaneerConsumption/WringingSarahSandersNeckDifferentFromChokingHer.json","image_url":"https://media.breitbart.com/media/2018/08/GettyImages-978134234.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2018_08_03__1540924112.html","title":"'Wringing' Sarah Sanders Neck Different From 'Choking' Her","title_page":"WashPost Fact Check: 'Wringing' Sarah Sanders Neck Different From 'Choking' Her","title_rss":"NULL","source_domain":"breitbart.com","text":"The far-left Washington Post fact checked White House Press Secretary Sarah Sanders and smeared her as a liar because “wringing” her neck is different from “choking” her.\nIn a reaction piece, WaPo’s Aaron Blake, a left-wing columnist who considers the harassment of Trump supporters “understandable,” blasted away at Sanders Thursday after she calmly listed the horrors she and other Trump officials have dealt with due to an increasingly rabid establishment media.\nIn last 2 days, Sarah Huckabee Sanders has said media: -ruined bin Laden surveillance\n-called for her to be \"harassed\"\n-called for her to be \"choked\"\n-tasked Michelle Wolf with ridiculing her All of these are exaggerations or inventions.https://t.co/UhtyRT2Mcj — Aaron Blake (@AaronBlake) August 3, 2018\nAfter CNN’s Jim Acosta, who remains bitter after being heckled by the same Trump supporters CNN and Acosta have spent years smearing as Nazis and racists, repeatedly whined at Thursday’s White House press briefing over the way President Trump treats the media, Sanders said:\nIt’s ironic, Jim, that not only you and the media attack the President for his rhetoric when they frequently lower the level of conversation in this country. Repeatedly — repeatedly — the media resorts to personal attacks without any content other than to incite anger. The media has attacked me personally on a number of occasions, including your own network; said I should be harassed as a life sentence; that I should be choked. ICE officials are not welcome in their place of worship, and personal information is shared on the Internet. When I was hosted by the Correspondents’ Association, of which almost all of you are members of, you brought a comedian up to attack my appearance and called me a traitor to my own gender. In fact, as I know — as far as I know, I’m the first Press Secretary in the history of the United States that’s required Secret Service protection.\nIn response to this, Blake, who has a troubling history of downplaying the menacing of female Trump staffers, desperately tried to mislead his readers and pick apart Sanders’ statement with an audacious amount of fake news and dishonest hair splitting.\nAmong other furious acts of parsing, Blake scolded Sanders by explaining that “choking” Sander Sanders is not the same as “wringing” her neck.\n“MSNBC’s Nicolle Wallace … didn’t call for choking Sanders,” WaPo writes, “but instead asked a reporter if she ever want to ‘wring’ Sanders’s neck out of frustration.”\nBlake also falsely asserts that Wallace’s words were “hardly a call for action,” when the exact opposite is true. Implicit in Wallace’s comment is that Sanders deserves to be choked, that she has it coming, that this should be the normal reaction to Sanders. I.e., that she should be choked.\nWaPo also castigated Sanders over her claim that the media “said I should be harassed as a life sentence.”\nSanders is referring to WaPo’s own anti-Trump blogger Jennifer Rubin, who called for exactly that during a television appearance just last month. Here is the transcript:\nWe’re not going to let these people go through life unscathed. Sarah Huckabee has no right to live a life of no fuss, no muss, after lying to the press, after inciting against the press. These people should be made uncomfortable, and I think that’s a life sentence, frankly.\nAccording to Blake, though, Sanders is a liar because “Rubin said nothing directly about people ‘harassing’ Sanders.\nYou see, according to WaPo, Sanders is a liar because Rubin didn’t use the word “harass” when she said, “Sarah Huckabee has no right to live a life of no fuss, no muss… These people should be made uncomfortable, and I think that’s a life sentence, frankly”\nSanders is also a liar for pointing out that at this year’s White House Correspondents Dinner, “you brought a comedian up to attack my appearance and call me a traitor to my own gender.”\nThis, as we all know, is 100 percent true.\nBut, even though the White House Press Corps invited a left-wing comedian who is openly hostile to the Trump administration, and even though the White House Press Corps laughed hysterically at the venomous attacks against Sanders, who was treated as an object of ridicule seated on the stage just a few feet from this horrible comedienne, WaPo claims this is another lie because “Sanders makes it sound as though the press tasked Wolf with ridiculing her.”\nBlake, a virulent Trump hater, is yet another example of the establishment looking to normalize racism, hate, and violence against Trump staffers and supporters.\nOn the same day WaPo published these lies about Sanders, five acts of violence against Trump supporters were added to a list that now tops 540.\nFollow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.","url":"https://www.breitbart.com/the-media/2018/08/03/washpost-fact-check-wringing-sarah-sanders-neck-different-from-choking-her/"}
