{"authors":["Associated Press"],"date_download":"2018-10-23 05:01:20","date_modify":"2018-10-23 05:01:20","date_publish":"2016-01-28 21:05:32","description":"LOS ANGELES (AP) — The stepchildren of a woman killed in a car crash caused by Caitlyn Jenner have dismissed their civil lawsuit against the Olympic gold med...","filename":"data/vaneerConsumption/WrongfuldeathlawsuitagainstCaitlynJennerdismissed.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:841bf1cc1b0a413090b78b91621084ec-2vdWmEltwXfba0ce28e632ca3587-181_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421664_Wrongful-death-lawsuit-against-Caitlyn-Jenner-dismissed_1540270880.html","title":"Wrongful death lawsuit against Caitlyn Jenner dismissed","title_page":"Wrongful death lawsuit against Caitlyn Jenner dismissed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Wrongful death lawsuit against Caitlyn Jenner dismissed\nLOS ANGELES (AP) — The stepchildren of a woman killed in a car crash caused by Caitlyn Jenner have dismissed their civil lawsuit against the Olympic gold medalist.\nJenner's attorney, Philip Boesch Jr., confirmed Thursday that the wrongful death suit has been dismissed. No additional details were immediately available from court records, which show the dismissal was requested Tuesday.\nJenner's sport utility vehicle rear-ended two cars on Pacific Coast Highway in February, pushing Kim Howe's Lexus into oncoming traffic, where it was struck by a Hummer. The 69-year-old woman died.\nFILE - In this Jan. 14, 2016 file photo, Caitlyn Jenner participates in E!'s \"I Am Cait\" panel at the NBCUniversal Winter TCA in Pasadena, Calif. Jenner's attorney said Thursday, Jan. 28, 2015, that a wrongful lawsuit filed by the stepchildren killed during a collision caused by the Olympic gold medalist in February 2015 has been dismissed. (Photo by Richard Shotwell/Invision/AP, File)\nHowe's stepchildren, Dana Redmond and William Howe, sued Jenner in May. Their attorney did not immediately return a phone message.\nSheriff's investigators determined Jenner was traveling at an unsafe speed for the conditions at the time. Prosecutors, citing unlikelihood to prove negligence in court, declined to file a vehicular manslaughter charge against Jenner, who won a 1976 Olympic gold medal in decathlon as Bruce Jenner. She later came out as transgender, transitioning to a woman.","url":"https://www.dailymail.co.uk/wires/ap/article-3421664/Wrongful-death-lawsuit-against-Caitlyn-Jenner-dismissed.html"}
