{"authors":[],"date_download":"2018-10-30 14:19:42","date_modify":"2018-10-30 14:19:42","date_publish":"2016-08-16 00:00:00","description":null,"filename":"data/vaneerConsumption/WSJandTrump.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_08_wsj_and_trump_1540909182.html","title":"WSJ and Trump","title_page":"WSJ and Trump","title_rss":"NULL","source_domain":"americanthinker.com","text":"WSJ and Trump\nInstead of trashing Trump and complaining that he has alienated some Republicans, why doesn’t the WSJ question why Hillary gets almost universal support among Democrats, the media and Hollywood no matter what she says or does? Isn’t supporting a scandal-ridden congenital liar more troubling than alienating some Republicans? We are constantly told by Democrats and the media that Hillary is so smart and the most qualified person to run for president, but what they never do is list actual accomplishments because they have trouble thinking of any.\nWhen Trump says something, Republicans and Democrats alike are asked to comment. Yet when Hillary says or does anything, the media does not trot out its microphones for comments. Why the discrepancy? For example, when Hillary called Gold Star Mom Patricia Smith a liar, no one went to Reid, Obama, Durbin, Pelosi, Schumer, et al. and asked: what do you think of Hillary treating a Gold Star Mom like that? The media obviously doesn’t really care about all Gold Star Families. Does the WSJ or the politically entrenched Republicans in D.C. actually believe that if Trump changed his verbiage, the media would love him? The Clinton team called Mike Pence the most extreme V.P. candidate in the last century, so would he be treated respectfully? The media loved McCain until he was the presidential candidate, and then they trashed him. They also trashed Romney and Bush. They are for the Democrat no matter what they do. Facts do not matter. Hillary’s economic policy could be summed up in one sentence. The government should tax more, spend more, and regulate more because the fair share for the government vs. the governed is never enough. Hillary supports continuing Obama’s economic policies, which have resulted in a 38-year low on the labor participation rate, the slowest economic recovery in almost 70 years, a 50-year low on homeownership, and a 40-year low on productivity. Why would anyone think continuing and expanding those policies would yield better results? We know what Hillary has said and done. Could Trump be worse? It is a shame the WSJ climbed on the bandwagon.","url":"https://www.americanthinker.com/blog/2016/08/wsj_and_trump.html"}
