{"authors":["Breitbart News"],"date_download":"2018-10-30 17:54:45","date_modify":"2018-10-30 17:54:45","date_publish":"2015-08-24 14:48:29","description":"From the Wall Street Journal Opinion section. We repost below: Americans saving the day in Europe is a familiar story, and on Friday evening it happened |","filename":"data/vaneerConsumption/WSJGaryCooperInEurope.json","image_url":"https://media.breitbart.com/media/2015/08/upi_HEROES-HONORED.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_08_24__1540922085.html","title":"WSJ: Gary Cooper In Europe","title_page":"WSJ: Gary Cooper In Europe | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"From the Wall Street Journal Opinion section. We repost below:\nAmericans saving the day in Europe is a familiar story, and on Friday evening it happened again on a train from Amsterdam to Paris. Three young American friends on vacation, two of them off-duty soldiers, charged and disarmed a suspected jihadist who appeared bent on another murderous Islamist rampage.\nAirman First Class Spencer Stone, 23 years old, ran some 10 meters down the aisle of the train and tackled the gunman. Anthony Sadler and Alek Skarlatos, a Member of the Oregon National Guard who had been deployed in Afghanistan, then joined and helped subdue him. Media reports of eyewitness accounts aren’t consistent, but some say the gunman’s pistol didn’t fire when he pulled the trigger. Airman Stone could easily have been killed, and while grabbing the gunman by the neck he was slashed multiple times with a box cutter that nearly severed his left thumb.\nFrench authorities have praised the American trio as well as Chris Norman, a British consultant who joined the rush and bound the gunman’s hands with a tie. The three Americans were childhood friends who attended the Freedom Christian School in Fair Oaks, Calif., near Sacramento. “All three made a show of courage—full of bravery—that everyone recognizes,” French Interior Minister Bernard Cazeneuve said.\nFrench officials identified the gunman as Ayoub El-Khazzani, a 26-year-old Moroccan national who had been flagged by intelligence services for Islamist sympathies. On Sunday a lawyer said Mr. El-Khazzani claimed he intended merely to rob the passengers, though why he would need a rifle, nine magazines of ammunition and a pistol for that isn’t obvious. Police suspect he may have traveled to Syria but that wasn’t confirmed.\nThe men who subdued El-Khazzani represent an admirable strain in American culture that doesn’t shrink from individual acts of heroism for the larger good. The world saw it on display in the Flight 93 passengers who charged the cockpit to foil the 9/11 attack on the U.S. Capitol. And it is revealed every day in acts of courage by the U.S. military.\nThat heroism used to be celebrated in Hollywood, though it rarely is in these cynical days. But it still exists in much of American society that knows the difference between good and evil and is willing to make sacrifices to defend a free society. The heroes on the French train showed the world the kind of men that America is still made of.","url":"https://www.breitbart.com/national-security/2015/08/24/wsj-gary-cooper-in-europe/"}
