{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:56:03","date_modify":"2018-10-30 19:56:03","date_publish":"2015-03-20 19:51:04","description":"WV Gov. Stands With Moms Demand Action: Vetoes Repeal of Concealed Carry Permit Requirement","filename":"data/vaneerConsumption/WVGovStandsWithMomsDemandActionVetoesRepealOfConcealedPermitRequirement.json","image_url":"https://media.breitbart.com/media/2015/03/Earl-Ray-Tomblin-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_20__1540929363.html","title":"WV Gov. Stands With Moms Demand Action: Vetoes Repeal Of Concealed Permit Requirement","title_page":"WV Gov. Stands With Moms Demand Action: Vetoes Repeal Of Concealed Permit Requirement | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On March 20 West Virginia Governor Earl Ray Tomblin (D) vetoed SB 347–the bill to repeal the concealed carry permit requirement in that state.\nBreitbart News previously reported that pro-gun West Virginia Senators passed the measure on February 27–against the wishes of Moms Demand Action for Gun Sense in America–arguing that the 2nd Amendment was a sufficient concealed carry license. On March 12 the Saturday Gazette-Mail reported that West Virginia House followed suit, passing the repeal of the concealed carry permit requirement by a vote of 71-29.\nYet, while the West Virginia house and senate rose above the pleas of Moms Demand Action, it appears Gov. Tomblin could not follow suit.\n800 WVHU reported that Tomblin vetoed the bill, saying:\nThroughout my career, I have strongly supported the Second Amendment, as demonstrated by my repeated endorsements and high grades from the National Rifle Association. However, I must also be responsive to the apprehension of law enforcement officers across the state, who have concerns about the bill as it relates to the safety of their fellow officers. It would also eliminate the required gun safety training courses for those applying for a concealed carry permit. In light of these concerns and in the interest of public safety for all West Virginians, I have vetoed Senate Bill 347.\nThis win for Moms Demand Action and Senator Joe Manchin (D-WV) is a loss for the people of West Virginia.\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/03/20/wv-gov-stands-with-moms-demand-action-vetoes-repeal-of-concealed-permit-requirement/"}
