{"authors":["Rebecca Patton"],"date_download":"2018-10-31 01:39:50","date_modify":"2018-10-31 01:39:50","date_publish":"2018-09-01 02:00:53","description":"Spoilers ahead for Wynonna Earp Season 3, Episode 7, \"I Fall to Pieces.\" Just when audiences thought that Doc (Tim Rozon) and Wynonna (Melanie Scrofano) were finally going to get it together, the gunslinger's long-lost wife came along and turned him…","filename":"data/vaneerConsumption/WynonnaFoundOutAboutDocOnWynonnaEarpTheirRelationshipWillNeverBetheSame.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/30/0422dd0a-e544-4891-be4f-0f45102f51e6-nup_183782_0005.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_wynonna-found-out-about-doc-on-wynonna-earp-their-relationship-will-never-be-the-same-11457289_1540949990.html","title":"Wynonna Found Out About Doc On ‘Wynonna Earp’ & Their Relationship Will Never Be the Same","title_page":"Wynonna Found Out About Doc On ‘Wynonna Earp’ & Their Relationship Will Never Be the Same","title_rss":"NULL","source_domain":"bustle.com","text":"Spoilers ahead for Wynonna Earp Season 3, Episode 7, \"I Fall to Pieces.\" Just when audiences thought that Doc (Tim Rozon) and Wynonna (Melanie Scrofano) were finally going to get it together, the gunslinger's long-lost wife came along and turned him into a vampire. While Doc's motive was self-preservation, his choice doesn't exactly endear him to his baby mamma. Wynonna discovers that Doc is a vampire, and as a result, she kicked him to the curb.\nThis whole blood-sucking thing seems like a very rash, ill-advised choice on Doc's part. After all, he and Wynonna were finally on good terms again, and everyone was in the holiday spirit. Enter Kate (Chantel Riley) — Doc's long-lost, blood-sucking wife, who promised her spouse immortality in exchange for his soul. Audiences will recall that Doc became mortal again at the tail-end of Season 2 when he rose from the dead (as you do). And while the gunslinger's already survived tuberculosis and hell itself, it remains to be seen how he'll survive without Wynonna.\nHowever, Doc isn't just rejected by the Earp heir. Earlier in the episode, he wakes up alongside Kate, and his ring begins to sizzle. \"What have I done?\" he asks, realizing the ramifications of his decision. \"Bulshar's ring is rejecting you now that you're compromised,\" his wife explains — perhaps a bit too calmly.\nMichelle Faye/Wynonna Earp Productions, Inc./Syfy\nDoc has always been a bit melodramatic, but vampire Holliday is brooding and animalistic. He growls more and smiles less. And as he turns to look in the mirror, his visage begins to fade. It's clear that this is not what he wanted. That being said, it's crystal clear why Kate turned her husband. She's jealous of his relationship with Wynonna and thinks that siring him will keep them apart. And she's not wrong. \"Go — tell the Earp heir,\" she teases him. \"See if she welcomes you back into her bed.\" And audiences know how that turns out.\nWhat's more, Michelle (Megan Follows) is going through her own personal crisis. While Doc's rummaging around in the Earp barn for a place to hide Bulshar's ring, Mama Earp enters and puts a rifle to his head. The pair go on an odd adventure, where they wade through the snow to Willa's grave and then just lean on Doc's car and swig tequila. When Michelle begins talking about Julian, who she later leaves Purgatory to find, Doc asks her, \"What was it like, being with an angel?\" She retorts, \"What's it like being with a demon?\"\nMichelle Faye/Wynonna Earp Season 3, Inc./SYFY\nAudiences also discover what Michelle learned off-screen from Bobo Del Rey: that Ward Earp forced Julian out of the Ghost River Triangle. When Doc realizes that she set the Revenant free, he explodes. \"Bulshar's risen, sweet cheeks,\" Michelle says in response. \"These are end times. It's going to take monsters to fight a monster.\" Hmmm...could Doc's newfound status actually come in handy for Wynonna and co.?\nAt the end of Episode 7, Waverly and Wynonna's mom leaves, but not before slyly telling Doc she knows what he is. Michelle also leaves behind a note, which the heir reads aloud to the newly minted vampire: \"Dear Wynonna. Don't trust Doc Holliday. He's not what he says he is.\" And although he denies there's anything different about him, she slaps the gunslinger until he snaps. It dawns on Wynonna as he growls, and his eyes turn orange. She begins to cry and asks, \"What about us? What about Alice? What would our daughter say if she knew her father sold his soul?\" He responds, \"You of all people should understand the sacrifices that have been made.\"\nMichelle Faye/Wynonna Earp Productions, Inc./Syfy\nWhile this scene is incredibly heartbreaking, it does provide the saddest pun delivery of all times as Wynonna whispers, \"Bite me.\" And just like Kate predicted, the heir begins to back slowly away from him. \"You know, there are some advantages to you being a vampire,\" Wynonna says. \"John Henry Holliday, you're not welcome in my home anymore.\"","url":"https://www.bustle.com/p/wynonna-found-out-about-doc-on-wynonna-earp-their-relationship-will-never-be-the-same-11457289"}
