{"authors":["John Pudner"],"date_download":"2018-10-30 18:49:29","date_modify":"2018-10-30 18:49:29","date_publish":"2015-08-17 07:10:38","description":"With a nickname like the Cowboys, Wyoming fittingly offers a rodeo performer as the top student-athlete in the state. The Eastern Wyoming team also produced a couple of rodeo stars that cracked the top 20. |","filename":"data/vaneerConsumption/WyomingCowboyStudentAthletesfromRodeotoSoccer.json","image_url":"https://media.breitbart.com/media/2015/08/wyoming-university-of-wyoming-cropped.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_08_17__1540925369.html","title":"Wyoming: Cowboy Student-Athletes from Rodeo to Soccer","title_page":"Wyoming: Cowboy Student-Athletes from Rodeo to Soccer | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"With a nickname like the Cowboys, Wyoming fittingly offers a rodeo performer as the top student-athlete in the state. The Eastern Wyoming team also produced a couple of rodeo stars that cracked the top 20.\nJosh Adams is the one returning leader from the Cowboys team that won the Mountain West title and their first NCAA tournament in 14 years. The program had the most important breakthrough in baseball when Kenny Sailors invented the jump shot to do away with scores like 22-18 and take the Cowboys to the 1943 title over Georgetown.\nQuarterback Cameron Coffman will lead the football team, which may face some uphill battles this year.\nSophomore Kaitlyn Lomsnes would be a superstar even if she were in the Pac-12. Lomsnes was one of only four freshman to make the All-Pacific soccer team and the only one not from the Pac-12. She scored 10 goals to give Wyoming a record 11 wins.\nStudent-Athletes usually make their biggest jump from freshman to sophomore year, so if she gets any better and keeper Georgia Rowntree can play as well as the main keeper as she did in seven starts (1.20 Goals Against and save percentage were even better than last year’s senior Alex Boehm), then the Cowboys could fight for a winning season.\nWe ran the Value Add Sports calculations on all returning athletes in the state and emailed sports writers and other experts in the state to help rank the 20 players to watch on a list.","url":"https://www.breitbart.com/sports/2015/08/17/wyoming-cowboy-student-athletes-from-rodeo-to-soccer/"}
