{"authors":["Associated Press"],"date_download":"2018-10-23 01:14:40","date_modify":"2018-10-23 01:14:40","date_publish":"2016-01-29 15:02:31","description":"NEW YORK (AP) — Xerox is separating into two independent publicly traded companies. The planned breakup follows pressure from activist investor Carl Icahn. S...","filename":"data/vaneerConsumption/Xeroxseparatinginto2independentpubliclytradedcos.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:fdc40d06ede4426f978773baefdecf67-3bmscybNe842cce83474b5704a75-992_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422710_Xerox-separating-2-independent-publicly-traded-cos_1540257280.html","title":"Xerox separating into 2 independent publicly traded cos.","title_page":"Xerox separating into 2 independent publicly traded cos. | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Xerox separating into 2 independent publicly traded cos.\nNEW YORK (AP) — Xerox is separating into two independent publicly traded companies. The planned breakup follows pressure from activist investor Carl Icahn.\nShares of the Norwalk, Connecticut-based company edged up in Friday premarket trading.\nXerox announced in October that it planned to conduct a review of its operations in the hopes of boosting shareholder value.\nFILE - In this March 16, 2010, file photo, financier Carl Icahn poses for photos upon arriving for the 32nd annual New York City Police Foundation Gala in New York. Xerox announced Friday, Jan. 29, 2016, it is separating into two independent publicly traded companies. The planned breakup follows pressure from Icahn. (AP Photo/Henny Ray Abrams, File)\nThe separation calls for a document technology company and a business process outsourcing company. The document technology company will handle document management and document outsourcing, while the business process outsourcing business will help companies with automating and simplifying business processes.\nThe names of the two companies and their leadership teams have yet to be determined.\nXerox and Icahn reached a deal on the governance of the business process outsourcing company. Under the breakup, Icahn will get to name three of the nine directors on that company's board. A search is also going to be started for an external candidate to serve as CEO of the business. Icahn will be allowed to choose an individual to observe and advise the committee that is performing the search.\nIcahn said in a written statement that he believes the independent business process outsourcing company will enhance shareholder value.\nXerox Corp. also announced a three-year plan to save $2.4 billion across all segments. It anticipates $700 million in annual savings in 2016.\nXerox said its goal is to complete the separation by the end of the year.","url":"https://www.dailymail.co.uk/wires/ap/article-3422710/Xerox-separating-2-independent-publicly-traded-cos.html"}
