{"authors":["Sarah Barns For Mailonline"],"date_download":"2018-10-23 00:56:16","date_modify":"2018-10-23 00:56:16","date_publish":"2016-01-29 14:27:35","description":"Ben Haenow, 31, from Croydon, has become the latest reality show casualty after being dropped by Simon Cowell's record label, a mere 13 months after beating Fleur East to the winner's title.","filename":"data/vaneerConsumption/XFactorwinnerBenHaenowisdroppedbySimonCowellsSycolabel.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B2FA8300000578-0-image-a-57_1454078136936.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422581_The-curse-male-X-Factor-winner-Ben-Haenow-dropped-Simon-Cowell_1540256176.html","title":"X Factor winner Ben Haenow is dropped by Simon Cowell's Syco label","title_page":"X Factor winner Ben Haenow is dropped by Simon Cowell's Syco label | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Move over Steve Brookstein, there's another X Factor champion heading for the bargain bin.\nBen Haenow has become the latest reality show casualty after being dropped by Simon Cowell's record label, a mere 13 months after beating Fleur East to the winner's title.\nAxing the the 31-year-old Croydon van driver from his roster of artists at Syco reportedly proved a tough call for the music mogul.\nA source told The Sun: 'Simon made the decision with a heavy heart. He was a big supporter of Ben but it’s simply down to business - Fleur East, who came second, has done much better.'\nBen Haenow has become the latest reality show casualty after being dropped by Simon Cowell's record label, a mere 13 months after beating Fleur East to the winner's title\nA source told The Sun: 'Simon made the decision with a heavy heart. He was a big supporter of Ben but it’s simply down to business - Fleur East, who came second, has done much better'\nThe insider continued: 'And at the end of the day our winners, especially the blokes, never have the same success as the likes of One Direction and Olly Murs.'\nDespite his cheeky charm and boyish good looks, Ben failed to set the charts alight. His duet with Kelly Clarkson failed to crack the top 20 and his follow-up was a flop.\nBut Ben, who has become the fastest winner to be dropped by Simon Cowell since the first series, isn't the only male failure. Here, FEMAIL charts the other champions flailing (and downright disastrous) music careers.\nSteve Brookstein enjoyed brief success following his reality show stint and saw his debut album, Heart And Soul, enter the charts at number one\n2004: STEVE BROOKSTEIN\nSteve Brookstein wasted no time in having his say on the Ben Haenow saga.\nTaking to Twitter the controversial crooner, who won the first series of the singing contest in 2004, wrote: 'No surprise Cowell dumps Ben Haenow before his tour. SYCO Cowell will want him to fail.'\nThe 47-year-old from London enjoyed brief success following his reality show stint and saw his debut album, Heart And Soul, enter the charts at number one.\nHowever, after becoming embroiled in a feud with mentor Simon, Steve was dropped by SonyBMG just eight months into his contract.\nAfter becoming embroiled in a feud with mentor Simon Cowell, Steve was dropped by SonyBMG just eight months into his contract\nIn a cliched fall from grace, by 2007 he was performing on the Portsmouth to Bilbao P&O cruise ferry and in Costa Coffee shops.\nIn 2014 Steve signed a new music deal, releasing his third album, Forgotten Man, in March that year but it failed to chart.\nAfter putting his experiences in a book called Getting Over The X, he is still recording and touring but to intimate audiences in clubs rather than in big arenas.\nSteve has clung on to the limelight with his blunt opinions, causing many to slam him for being 'bitter' about his flailing career.\nShayne Ward was given a million pound contract with Syco, who released his debut self-titled album in 2006\n2005: SHAYNE WARD\nShayne Ward bagged The X Factor's first Christmas number one with the original song, That's My Goal in 2005.\nSelling 313,000 copies on its first day, the single became the fourth fastest selling track of all time - behind Will Young's Evergreen, Gareth Gates's Unchained Melody and Elton John's Candle In The Wind.\nThanks to his success, the 30-year-old Tameside-born singer was given a million pound contract with Syco, who released his debut self-titled album in 2006.\nAfter reaching the top of the charts, it was certified four times platinum in Ireland and platinum in the UK.\nShayne Ward bagged The X Factor's first Christmas number one with the original song, That's My Goal in 2005\nShayne's follow-up album, Breathless also sold well and reached number two but he was dropped by the record label following poor sales of his third album in 2010.\nRoguishly good-looking heartthrob Shayne decided to put his music career on hold in 2011 when he turned his hand to acting.\nHe starred in the 1980s-themed musical Rock Of Ages in London's West and in 2014 joined ITV soap Coronation Street as Aidan Connor.\nShayne managed to finally shed his X Factor tag earlier this month when he was awarded Best Newcomer at The National Television Awards.\nAccepting the accolade, he said: ‘This is an incredible moment for me. Who’d have thought a singer from The X Factor could now be on one of the most amazing shows like Coronation Street?’\n2007: LEON JACKSON\nPint-sized Scottish pop star Leon Jackson, 27, from West Lothian, won over the nation with his trendy asymmetric haircut and sharp suits back in 2007.\nPint-sized Scottish pop star Leon Jackson, 26, from West Lothian, won over the nation with his trendy asymmetric haircut and sharp suits back in 2007\nAn unexpected winner, his champion's single - an arrangement of Mariah Carey and Whitney Houston's duet When You Believe - bagged the Christmas number one spot that year.\nReports claim it sold 40 copies a minute in Woolworths at its peak.\nBut poor Leon slowly fell out of the limelight. His follow-up track Don't Call This Love peaked at number three and debut album Right Now only made it to number four.\nHe was dropped by Syco in 2009.\nFormer champion Leon Jackson sobs on the shoulder of X Factor presenter Dermot O'Leary\nAccording to his Twitter profile, Leon appears to have relocated to Los Angeles and continues to perform.\nHe has also undergone somewhat of an image overhaul, ditching his spiky hairdo for a One Direction-inspired quiff.\n2009: JOE MCELDERRY\nFollowing his win in 2009, Geordie Joe McElderry was caught up in one of the X Factor's biggest controversies.\nThe 24-year-old's winner's single, a cover of Miley Cyrus's The Climb, was the first to be beaten to the Christmas top spot for four years.\nFollowing his win in 2009, Geordie Joe McElderry was caught up in one of the X Factor's biggest controversies\nIt was pipped to the post by Rage Against The Machine's Killing In The Name, following a social media campaign in protest against the programme's grip on the Christmas number one tradition.\nJoe's debut album, Wide Awake, peaked at a respectable number three but dropped out of the top 40 within three weeks. In total, it had sold just over 100,000 copies by December 2010.\nJoe's contract with Syco expired in 2011 and wasn't renewed. He has spoken of his unhappiness about his time with the label but said the split was 'amicable'.\nHowever, he went on to sign with Decca, with his album Classic reaching No.2 in the UK album charts in 2011, selling over 250,000 copies.\nJoe recently hit back about the criticism he received regarding his weight while posing for Gay Times. Speaking to Loose Women, he said: ‘This whole body shaming thing is just ridiculous it’s gone beyond a joke now.\nJoe McElderry shares his elation on bagging The X Factor winner's title with mentor Cheryl Fernandez-Versini\n'I can take it, it’s part of my job to get scrutinised about what you’re doing. For me it’s not a big deal but for people reading these things it’s not a good message to send.’\nJoe has a knack of winning reality shows - he bagged the top prize on Popstar to Opera in 2011 and won skiing contest The Jump in 2014.\nHe is currently starring in the West End production of Joseph And The Amazing Technicolour Dreamcoat.\n2010: MATT CARDLE\nFormer painter and decorator Matt Cardle, 32, triumphed in the 2010 series after winning over the voters of Britain with his down-to-earth demeanour and collection of flat caps.\nThe Essex stud's winner's single - a cover of Biffy Clyro's only ballad, Many of Horror (retitled When We Collide) - regained Syco's grip on the festive top spot, where it stayed for three weeks.\nIt sold an impressive 170,000 copies in its first two days on sale.\nFormer painter and decorator Matt Cardle triumphed in the 2010 series after winning over the voters of Britain with his down-to-earth demeanour and collection of flat caps\nMatt's debut album, Letters, received a warm reception and stayed on the chart for 16 weeks, peaking at number two.\nUnfortunately, the former handy-man's follow-up singles fared less well and he parted ways with Syco and Columbia records in 2012.\nSince then he's released a couple of albums, collaborated with former Spice Girl Mel C and continues to tour, but he has not seen the same success as the act that came third in 2010 - One Direction.\nMatt has also had to deal with personal struggles. He was admitted to The Priory on Boxing Day 2013 to be treated for addiction to prescription drugs and alcohol.\nHost Dermot O'Leary congratulations 2010 winner Matt Cardle and his mentor Dannii Minogue\nHe said at the time, 'I was so out of it - I was like a zombie.'\nMatt is on the path to recovery and is set to release his fourth album later this year. He also played Huey Calhoun in Memphis The Musical, his first acting role.\n2012: JAMES ARTHUR\nScruffy, soft-toned singer James Arthur, 27, from Middlesbrough, won series nine of the hit talent show in 2012.\nHis cover of Shontelle's 2010 song Impossible became the fast-selling X Factor winner's single ever.\nThings started off really well for northern lad James as his self-titled debut album went in at number two and sold more than 1.25 million copies in the UK.\nJames became involved in a number of scandals, most notably about the use of homophobic lyrics in a song\nBut outspoken James became involved in a number of scandals, most notably about the use of homophobic lyrics in a song, which led to high profile Twitter rows with celebrities including Frankie Boyle and Matt Lucas.\nHe began bad-mouthing musical peers and iTunes offered refunds on his album due to public outcry.\nHe had a 'mutual parting' with Syco in June 2014.\nJames is now said to be working on his second album and is 'close' to signing a record deal with a different label.","url":"https://www.dailymail.co.uk/femail/article-3422581/The-curse-male-X-Factor-winner-Ben-Haenow-dropped-Simon-Cowell.html"}
