{"authors":["Naomi Ackerman For Mailonline"],"date_download":"2018-10-23 02:19:45","date_modify":"2018-10-23 02:19:45","date_publish":"2017-03-10 11:26:11","description":"Essex-born vocal diva and X Factor winner Louisa Johnson has unleashed a 'flirty, fun and quite electronic' new single - Best Behaviour - from her debut album","filename":"data/vaneerConsumption/XFactorwinnerLouisaJohnsonreleasesnewsingle.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/22/3E1E90E200000578-0-image-a-49_1489100294065.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299100_X-Factor-winner-Louisa-Johnson-releases-new-single_1540261185.html","title":"X Factor winner Louisa Johnson releases new single","title_page":"X Factor winner Louisa Johnson releases new single | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Louisa Johnson made history when she won the X Factor at the tender age of 17 back in 2015.\nAnd today the Essex-born vocal diva has unleashed a 'flirty, fun and quite electronic' new single - Best Behaviour - from her debut album.\nSpeaking ahead of the anticipated release, the 19-year-old talked to MailOnline about her big dreams and handling fame by wearing and doing only what makes her happy.\nScroll down for video\nCandid confidence: Essex-born vocal diva and X Factor winner Louisa Johnson has unleashed a 'flirty, fun and quite electronic' new single - Best Behaviour - from her debut album\nLouisa - who was called the best singer ever to appear on the ITV reality series by judge Simon Cowell - is adamant that, unlike many of her competition-winning predecessors, she is in the music-making business 'for the long run'.\nAnd remaining in the public eye, especially from such a young age, brings a lot of pressure to look fantastic the entire time.\nBut the rising British star is not fazed and puts this down to her 'easygoing' nature.\nLouisa told MailOnline: 'Dealing with [fame] is one of those things that comes with time, but you do just get used to it, you have to get used to it pretty quickly.\n'I'm quite an easygoing person. It doesn't really get to me that much, I just wear whatever I like and what I feel comfortable in and as long as I'm happy I don't really care.\n'It's just how I am, I like feeling comfortable and if you're not happy then there's not really much point.'\n'In it for the long run': Louisa - who was called the best singer ever to appear on the ITV reality series by judge Simon Cowell - told MailOnline she dreams of playing Madison Square Gardens\n'I like feeling comfortable and if you're not happy then there's not really much point': The star said she will only wear and do things she is comfortable with - whatever the pressures\nThe star revealed that her ideal thing to wear on a night out would 'probably be a nice minidress'.\nAnd in her recent appearances, including at the BRITs, Louisa has opted for her favourite comfort choice.\nHer mature attitude to herself and fame come perhaps from her drive to succeed.\nLouisa said: 'You have to have fun, but when it comes to your job and your career you have to [take things seriously].'\nBig aims: Though she has already achieved so much at a young age, the teenager is dreaming of heading from Essex to Madison Square Gardens within the next five years\nMy style: The star revealed that her ideal thing to wear on a night out would 'probably be a nice minidress' - such as the one the 19-year-old sported at the BRITs\nThough she has already achieved so much at a young age, the teenager is dreaming of heading from Essex to Madison Square Gardens within the next five years.\nLouisa said: 'In five years I'd love to be doing arena tours and stuff like that, that's my main goal. I'm nowhere near where I want to be yet.\n'I know I've done a lot - it sounds quite strange to say - but I wasn't in this for the short game, I'm in it for the long run.\n'I think the dream would be Madison Sq Gardens, one day maybe.'\nRole models: Advice Louisa has received from stars including Helen Mirren and Cheryl Fernandez-Versini have reassured the young star that she is approaching fame the right way\nRising star: The stunning blonde - who died her hair multicoloured for adverts - hung out with superstar role models during her appearances as a L'Oreal ambassador this year\nAnd advice received from stars including Helen Mirren and Cheryl Fernandez-Versini has reassured Louisa that she is approaching her fame the right way.\nThe stunning blonde, who hung out with the superstars during her appearances as a L'Oreal ambassador this year, said: 'Seeing the likes of Cheryl and Helen Mirren and a few other people - that's been so much fun.\n'It's been amazing to spend time with them, learn from them and get to know them.\n'The main advice I have been given is just to stick to what you believe in and just be yourself.'\nLooking forward: Louisa told MailOnline that the main advice she had been given by her new star pals was 'just to stick to what you believe in and just be yourself'\nThe X Factor winner's new track, released on Friday, is written by Danny Parker and TMS - the latter of which recently wrote Little Mix's smash hit Touch - and has a edgier feel than fans may have expected.\nLouisa explained: 'Best Behaviour kind of felt right, it got pitched to us after So Good.\n'It felt a bit more fun and cheeky - a bit more flirtatious.\n'I took a step back and thought about how I wanted to portray myself.'\nThe album, which does not yet have a release date, will feature collaborations with big artists - but Louisa would not be drawn on their names.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299100/X-Factor-winner-Louisa-Johnson-releases-new-single.html"}
