{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 20:37:24","date_modify":"2018-10-30 20:37:24","date_publish":"2016-12-29 00:00:00","description":null,"filename":"data/vaneerConsumption/Xiaomiislaunchinganonlinebank.json","image_url":"https://amp.businessinsider.com/images/5865512df10a9acc1c8b598d-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_xiaomi-is-launching-an-online-bank-2016-12_1540931844.html","title":"Xiaomi is launching an online bank","title_page":"    Xiaomi is launching an online bank - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII This story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nYet another Chinese tech firm has expanded into financial services, with electronics firm Xiaomi announcing that it will back the launch of an online bank, according to Reuters.\nThe new bank will be called Sichuan XW Bank and plans to start offering services \"in the near future,\" according to one of the venture's investors, quoted by Reuters. Best known for its smartphones, Xiaomi will own around 30% of the new bank.\nThe Chinese regulator is encouraging the launch of new banks. In 2014, the China Banking Regulatory Commission (CBRC) started handing out licenses to more private banks as part of a bid to diversify the country's financial system, which is comprised almost entirely of state-owned financial institutions. It hopes the new banks will improve the availability of credit for small, privately owned firms that are underserved by the country's state-owned incumbents, as these institutions typically only lend to state-owned enterprises.\nOther technology giants have already taken advantage of the CBRC's initiative to launch online banks. Tencent-backed WeBank and Ant Financial affiliate MYBank both launched in summer 2015. These banks, along with Sichuan XW, likely have an advantage over other new banks not affiliated with tech firms due to their backers' vast stores of customer data. That data, obtained via the tech firms' other consumer-facing services, can likely be used by the new banks to offer customers more personalized products and services, which may well give them an edge.\nThe U.S. payments ecosystem is in the midst of a shift toward mobile, and countless new and old stakeholders are attempting to accelerate this migration, which is moving at a glacial pace relative to other markets globally. But mobile payments can rise to the mainstream. For companies seeking to build out a robust mobile payments product, China's thriving mobile payments ecosystem offers some insight — and some lessons.\nTotal mobile payments volume in China will reach $6.3 trillion by 2020, according to our estimates based on iResearch data. This marks a healthy 33% five-year compound annual growth rate (CAGR). In comparison, the U.S. will generate $154 billion in mobile payments volume this year by our estimates, which amounts to just 6.5% of China's mobile payments volume.\nEven accounting for population discrepancies, China will generate over $1,700 in mobile payments volume per capita in 2016, compared with $475 in the U.S., based on forecasts from BI Intelligence and eMarketer. China's advantage will eventually diminish, but it will still produce around twice as much volume per capita in 2020.\nChina has unique factors buoying the industry, like the dominance of mobile phones, a lack of legacy infrastructure, and the surging popularity of digital retail marketplaces. Some of the characteristics behind the country's success can be mimicked, or even replicated to some extent, in other markets like the U.S. However, one fundamental barrier in the U.S. is that it's being forced to layer mobile payments on top of an existing payments system, and the ecosystem is very fragmented.\nBI Intelligence, Business Insider's premium research service, has compiled a detailed report on mobile payments in China that takes a deep dive into China's mobile payments ecosystem and deciphers which growth drivers can be exported to the U.S. to help spark its relatively lackluster market.\nHere are some of the key takeaways:\nChina claims the world's largest mobile payments market and serves as the global benchmark for other markets to pursue. China will process a whopping $6.3 trillion in total mobile payments by 2020, according to our estimates based on iResearch data. This marks a healthy 33% five-year compound annual growth rate (CAGR).\nIt dwarfs the U.S.' mobile payments industry. The US will generate $154 billion in mobile payments volume this year by our estimates, which equates to just 6.5% of China's mobile payments volume. Meanwhile, China will generate over $1,700 in mobile payments volume per capita in 2016, compared with $475 in the U.S., based on forecasts from BI Intelligence and eMarketer.\nMobile commerce, a lack of legacy infrastructure, and marketplaces have fueled China's enormous success. Consumers in China are much more comfortable shopping on their mobile phones compared with their counterparts in the U.S., and the devices face less resistance from other legacy payments methods like credit cards. The open approach to mobile shopping has been fortified by Alibaba, a Goliath-sized marketplace, and WeChat, a go-to messaging platform, which support Alipay and Tenpay, respectively.","url":"https://www.businessinsider.com/xiaomi-is-launching-an-online-bank-2016-12"}
