{"authors":["Associated Press"],"date_download":"2018-10-31 00:36:11","date_modify":"2018-10-31 00:36:11","date_publish":"2018-07-08 00:00:00","description":"Chinese smartphone maker Xiaomi priced its initial public offering at 17 Hong Kong dollars a share. Shares settled at $16.80 on Monday after falling about 4%.","filename":"data/vaneerConsumption/XiaomiIPOSharesslipintradingdebut.json","image_url":"https://amp.businessinsider.com/images/5b433e76c05c0932008b4c75-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ap-phone-maker-xiaomi-shares-slip-in-trading-debut-in-hong-kong-2018-7_1540946171.html","title":"Xiaomi IPO: Shares slip in trading debut","title_page":"    Xiaomi IPO: Shares slip in trading debut - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Xiaomi's Founder, Chairman and CEO Lei Jun, center, hits the gong during the listing ceremony at the Hong Kong Stock Exchange in Hong Kong. AP/Vincent Yu\n(AP) Xiaomi Corp. shares slipped and then rebounded Monday in the Chinese smartphone maker's first trading day in Hong Kong following a multibillion-dollar initial public offering.\nTrading opened at 16.60 Hong Kong dollars ($2.11) per share, below Xiaomi's offering price of 17 Hong Kong dollars ($2.17). Shares lost about 4 percent in early trading but rebounded to end the day 16.80 Hong Kong dollars ($1.98).\nXiaomi, which helped to pioneer the trend for ultra-low-priced smartphones, says it plans to become an equipment-and-hardware brand alongside Apple Inc. The 8-year-old company has yet to give details of how that business model will work outside China.\nSpeaking at the ceremonial opening of trading, chairman Jun Lei noted the IPO comes at a time when financial markets have been roiled by U.S.-Chinese trade tensions.\n\"Although the macro-economic conditions are far from ideal, we believe a great company can still rise to the challenge and distinguish itself,\" he said.","url":"https://www.businessinsider.com/ap-phone-maker-xiaomi-shares-slip-in-trading-debut-in-hong-kong-2018-7"}
