{"authors":["Benjamin Zhang"],"date_download":"2018-10-31 00:16:26","date_modify":"2018-10-31 00:16:26","date_publish":"2016-12-02 00:00:00","description":"French low-cost carrier XL Airways has merged with boutique business-class airline La Compagnie.","filename":"data/vaneerConsumption/XLAirwaysandLaCompagniehavemerged.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_xl-airways-la-compagnie-airline-merger-2016-12_1540944986.html","title":"XL Airways and La Compagnie have merged","title_page":"    XL Airways and La Compagnie have merged - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"La Compagnie Boeing 757-200. La Compagnie On Friday, French low-cost carrier XL Airways announced that it had merged with boutique business-class upstart La Compagnie.\nThe two Paris-based airlines will form the new XL Airways-La Compagnie Group and will continue to specialize in low-cost, international, long-haul service.\nThe newly merged company will be led by XL Airways CEO Laurent Magnin while La Compagnie founder Frantz Yvelin has resigned from his post and will not participate in the newly merged venture.\nThe financial terms of the deal were not released.\nThe new XL Airways-La Compagnie Group will be better-positioned to capitalize on the cost advantages of a larger operation. This is especially the case for La Compagnie, which operates only two aircraft.\nThe combined company is expected to boast 800 employees and €400 million ($425 million) in annual revenue.\n\"It was inspiring to see how favorably the two airlines' employees received the news and underscores the shared spirit and mission,\"Magnin said in a statement.\n\"Our companies will join forces under our French flag, in the premiere tourist destination in the world.\"\nXL Airways France Airbus A330-200. Flickr/Eric Salard In the same statement, the departing Yvelin added, \"I am very proud and grateful to have created and run La Compagnie and to have successfully contributed to this new group. Most importantly, I would like to thank my wonderful teams, on the ground and in the air, for their outstanding dedication and hard work.\"\nThis is the second airline the serial-aviation entrepreneur has launched and sold an airline. In 2008, Yvelin sold L'Avion to British Airways for £54 million. L'Avion now operates under BA's OpenSkies brand.\nXL Airways is expected to continue to focus on budget economy-class travel with its fleet of Airbus A330 aircraft, while La Compagnie's pair of Boeing 757s will remain business-class-only. (Business Insider sampled La Compagnie this past spring and found the service to be worth the $1,800 for a Paris-to-New York, round-trip excursion — if only to enjoy the business-class experience when you aren't a frequent customer for that level of pampering.)\nBoth Parisian brands will compete with Air France in the traditionally lucrative, but currently struggling trans-Atlantic market. In a bid to lower costs and become more competitive, Air France announced in November that it will launch an experimental airline called Boost.","url":"https://www.businessinsider.com/xl-airways-la-compagnie-airline-merger-2016-12"}
