{"authors":[],"date_download":"2018-10-22 20:58:42","date_modify":"2018-10-22 20:58:42","date_publish":"2014-06-03 19:45:35","description":"A spiral galaxy like our own glitters in a glorious new picture from NASA's Chandra X-Ray Observatory.","filename":"data/vaneerConsumption/XRayVisionMakesOurSisterGalaxyLookPrettyinPurple.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/485151/140603-chandra_9aaa7a5866618f5f351f02ce3a265300.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_x-ray-vision-makes-our-sister-galaxy-look-pretty-purple-n121601_1540241922.html","title":"X-Ray Vision Makes Our Sister Galaxy Look Pretty in Purple","title_page":"X-Ray Vision Makes Our Sister Galaxy Look Pretty in Purple ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA spiral galaxy like our own glitters in a glorious new picture from NASA's Chandra X-Ray Observatory.\nThe Whirlpool Galaxy — also known as M51 or NGC 5194 — swirls 30 million light-years away in the constellation Canes Venatici, and it's a popular photo op for astronomers. This picture combines data from more than 232 hours' worth of Chandra observations, gathered over the course of 12 years, and highlights hundreds of previously undetected X-ray sources. X-ray readings are shown in purple, while optical observations from the Hubble Space Telescope are shown in red, green and blue.\nUnlike our own Milky Way galaxy, M51 is in the process of merging with a smaller companion galaxy, seen here at upper right. But just you wait: The Milky Way and the relatively nearby Andromeda Galaxy are heading toward a huge merger in 5 billion years or so.\nThe Chandra observations were presented by Wesleyan University's Roy Kilgard at this week's meeting of the American Astronomical Society in Boston.","url":"https://www.nbcnews.com/science/space/x-ray-vision-makes-our-sister-galaxy-look-pretty-purple-n121601"}
