{"authors":["Breitbart Tech"],"date_download":"2018-10-30 18:20:44","date_modify":"2018-10-30 18:20:44","date_publish":"2016-09-22 18:49:38","description":"Yahoo said hackers stole personal information from 500 million of its user accounts, a security breakdown it attributed to a \"state sponsored actor.\"","filename":"data/vaneerConsumption/YahooConfirmsHugeDataBreachAffecting500MillionAccounts.json","image_url":"https://media.breitbart.com/media/2016/07/wi/afp_91f5f9fef806cb390023618a1407688e1e1a31db-e1474570167163.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_09_22__1540923644.html","title":"Yahoo Confirms Huge Data Breach Affecting 500 Million Accounts","title_page":"Yahoo Confirms Huge Data Breach Affecting 500 Million Accounts | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"SAN FRANCISCO (AP) — Yahoo said hackers stole personal information from 500 million of its user accounts, a massive security breakdown it attributed to a “state sponsored actor.” The breach disclosed Thursday, the latest setback for the beleaguered internet company, dates back to late 2014.\nThat’s when high-tech thieves hacked into Yahoo’s data centers, the company said. But Yahoo only recently discovered the break-in as part of an ongoing internal investigation.\nThe stolen data includes users’ names, email addresses, telephone numbers, birth dates, hashed passwords, and the security questions – and answers – used to verify an accountholder’s identity.\nLast month, the tech site Motherboard reported that a hacker who uses the name “Peace” boasted that he had account information belonging to 200 million Yahoo users and was trying to sell the data on the web.\nYahoo recommends that users change their passwords if they haven’t done so since 2014. The Sunnyvale, California, company said its investigation so far hasn’t found any evidence that information about users’ bank accounts or credit and debit cards were swiped in the hacking attack. It said it has “no evidence” that the attacker is still in Yahoo’s network.\nNews of the security lapse could cause some people to have second thoughts about relying on Yahoo’s services, raising a prickly issue for the company as it tries to sell its digital operations to Verizon Communications for $4.8 billion.\nThat deal, announced two months ago, isn’t supposed to close until early next year. That leaves Verizon with wiggle room to renegotiate the purchase price or even back out if it believes the security breach will harm Yahoo’s business. That could happen if users shun Yahoo or file lawsuits because they’re incensed by the theft of their personal information.\nVerizon said it still doesn’t know enough about the Yahoo break-in to assess the potential consequences. “We will evaluate as the investigation continues through the lens of overall Verizon interests, including consumers, customers, shareholders and related communities,” the company said in a statement.","url":"https://www.breitbart.com/tech/2016/09/22/yahoo-confirms-huge-data-breach-affecting-500-million-accounts/"}
