{"authors":["Chriss W. Street"],"date_download":"2018-10-30 18:17:51","date_modify":"2018-10-30 18:17:51","date_publish":"2016-01-31 17:48:15","description":"Yahoo! CEO Marissa Mayer faces a showdown with activist investors on Feb. 2 that could create another Twitter-style disaster.","filename":"data/vaneerConsumption/YahooActivistInvestorsCouldRepeatTwitterDisaster.json","image_url":"https://media.breitbart.com/media/2015/10/marissa-mayer-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_01_31__1540923471.html","title":"Yahoo! Activist Investors Could Repeat Twitter Disaster","title_page":"Yahoo! Activist Investors Could Repeat Twitter Disaster | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Yahoo! CEO Marissa Mayer faces a showdown with activist investors on the company’s February 2 earnings call that could create another Twitter-style disaster.\nYahoo went through 3 CEOs in quick succession before Marissa Mayer joined the company from Google in 2012. She quickly rehabilitated morale and brought a sense of stability to the company. Yahoo’s stock price tripled in the first two years of her turnaround plan, but peaked in November 2014 at about $52 share a share, and has been on a steep downhill bobsled run to $29 a share over the last 14 months.\nThe tumble has unleashed activist hedge funds trying to extract value by forcing the company to sell its legacy Internet search business for “big bucks,” despite no one being sure there is a buyer.\nBecause of Mayer, Yahoo now has two lines of profitable operating businesses that make up its roughly $5 billion in annual revenue. About $3.6 billion is associated with its weak Yahoo Internet search legacy business, and $1.7 billion is associated with its high-growth “MaVeNS” business that includes mobile, video, native advertising, and social.\nRevenue for the last quarter was $1.226 billion, up about 7 percent from the June quarter. The MaVeNS revenue versus the prior year jumped by 60 percent in the June quarter and 43 percent in the September quarter, to $422 million. But the Internet two-thirds of Yahoo will report a third consecutive quarter of down revenues on February 2.\nOn a stand-alone basis, “MaVeNS” would be viewed as a 50 percent growth company valued at $8 to $15 billion, similar to hot stocks like Tableau (NYSE: DATA) or FireEye (NASDAQ: FEYE), according to Brian Nichols at Premium Research. That explains why two-thirds of Wall Street analysts have a buy recommendation on Yahoo as a deep-value play and no one has an under-perform or sell recommendation.\nBut activist hedge fund investor Eric Jackson at SpringOwl Asset Management LLC wants the instant gratification of a huge pop in the stock. He complains that Mayer has already failed since she took the helm at Yahoo in 2012 “because adjusted earnings before interest, taxes, amortization and depreciation for Yahoo’s core business have been in decline.”\nJackson claims that the sale of Yahoo’s core Internet business search business and real estate could net proceeds of $6 billion to $8 billion. He is being supported by technology analyst Robert Peck at SunTrust Robinson Humphrey, who agrees that “It would be the quickest way to maximize shareholder value.” But no search engine company has said they are willing to buy a business that is already in slow decline.\nJackson’s complaining about Mayer’s incompetence at Yahoo is the same “shtick” he used against Viacom CEO Philippe Dauman when he said last week: “Viacom made sense to own because even though we’ve got strong criticism over C.E.O., it’s so lowly valued, in our view, there could be a number of things that become catalysts.”\nBut if Yahoo bowed to Jackson’s hell-raising and Mayer was fired or quit, the company could be at risk of imploding in the same way that private equity fund manager and Obama bundler Chris Sacca’s June Board of Directors’ coup to dump popular CEO Dick Costolo imploded Twitter.\nActivist Sacca claimed that because Twitter’s growth had slowed to 14 percent, Costolo had to go. But in the seven months since Sacca’s move, Twitter’s growth has gone negative, the stock price is down by $13 billion, and four of Twitter’s top managers quit last week.\nJackson claims he will be watching Yahoo’s Feb. 2 earnings report for one of three things to happen: putting the company up for sale, entering into a strategic partnership with another search engine company, or replacing Mayer.\n“Just doing some [job] cuts, whether it’s 10 percent or 25 percent or 35 percent, still doesn’t solve the problem that you still have Marissa Mayer running the company with the existing board,” Jackson said, according to the San Francisco Chronicle.","url":"https://www.breitbart.com/local/2016/01/31/yahoo-activist-investors-could-achieve-twitter-disaster/"}
