{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 18:50:33","date_modify":"2018-10-30 18:50:33","date_publish":"2016-10-28 20:20:23","description":"According to a report by the Yale Daily News, a recent survey revealed that conservative views are \"unwelcome\" on the Ivy League school's campus.","filename":"data/vaneerConsumption/YaleStudentSurveyRevealsConservativeViewsUnwelcomeonCampus.json","image_url":"https://media.breitbart.com/media/2016/03/Screen-Shot-2016-03-03-at-15.15.57.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_10_28__1540925433.html","title":"Yale Student Survey Reveals Conservative Views 'Unwelcome' on Campus","title_page":"Yale Student Survey Reveals Conservative Views 'Unwelcome' on Campus | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"According to a report by the Yale Daily News, a recent survey revealed that conservative views are “unwelcome” on the Ivy League school’s campus.\nOf the over 2,000 students from across the political spectrum who participated in the survey, over 75 percent agreed that Yale “does not provide a welcoming environment for conservative students to share their opinions on political issues.”\n“Anybody who supports Donald Trump or is a Republican is just hated,” said one survey respondent, who asked to remain anonymous for fear of backlash from liberal students. “I just get the general vibe that Republicans aren’t respected for their beliefs as much as maybe the liberal people are.”\nOf the Yale students that support Donald Trump, more than 60 percent revealed that they feel uncomfortable discussing their political beliefs publicly.\nMore than 60 percent of the 103 Yale students supporting Republican presidential candidate Donald Trump said they are “uncomfortable” or “very uncomfortable” discussing their political beliefs at Yale. …\nBy contrast, more than 98 percent of respondents said Yale is welcoming to students with liberal beliefs. And among students who described themselves as “liberal” or “very liberal,” 85 percent said they are “comfortable” or “very comfortable” sharing their political views in campus discussions. … Claire Williamson ’17 said it became harder to express conservative viewpoints during the controversies surrounding Calhoun College and the title“master” last fall. Students who did not hold the “popular vocal opinion” of renaming the college and changing the title were seen not only as wrong, she said, but as bad people. “I would say it’s a frustrating Catch-22 to be a conservative-leaning moderate or conservative on campus,” Williamson said. “You’re sort of airing your own political views and trying to talk about them with the risk that someone disagrees with you to the point of assuming you’re an immoral person because of them. You either stay silent or you risk alienating some of your friends and groups around you.”\nYale isn’t the only Ivy League institution where conservative students have felt that they are unwelcome. In September, Columbia University sophomore Brian Min claimed that he would be “physically assaulted” if he wore conservative clothing or voiced conservative opinions on campus.\nTom Ciccotta is a libertarian who writes about Free Speech and Intellectual Diversity for Breitbart. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart.com","url":"https://www.breitbart.com/tech/2016/10/28/yale-student-survey-reveals-conservative-views-unwelcome-campus/"}
