{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 18:51:12","date_modify":"2018-10-30 18:51:12","date_publish":"2016-05-26 10:15:16","description":"Nicholas Christakis has announced his resignation from his role as the Head of Silliman College at Yale University.","filename":"data/vaneerConsumption/YaleAdministratorTargetedoverHalloweenCostumeEmailAnnouncesResignation.json","image_url":"https://media.breitbart.com/media/2015/11/ap_ap-photo1645-wi-e1464257699734.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_05_26__1540925472.html","title":"Yale Administrator Targeted over Halloween Costume Email Announces Resignation","title_page":"Yale Administrator Targeted over Halloween Costume Email Announces Resignation | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Christakis announced his resignation on Twitter, mentioning that he has great respect for every member of the Yale community, “friend and critic alike.”\nLast week, I gave my resignation to President Salovey and will be stepping down from my role as Head of Silliman College, effective July, 2016. Erika and I have devoted our professional lives to advocating for all young people. We have great respect for every member of our community, friend and critic alike. We remain hopeful that students at Yale can express themselves and engage complex ideas within an intellectually plural community.\nChristakis initially came under fire after defending an email sent by his wife, who is also on the Yale faculty, that argued that the university shouldn’t restrict students from wearing potentially offensive costumes. According to Erika Christakis, “American universities were once a safe space not only for maturation but also for a certain regressive, or even transgressive, experience; increasingly, it seems, they have become places of censure and prohibition.”\nNicholas Christakis discussed the issue and his wife’s email in a confrontation with students that occurred on November 6, 2015. A video of Christakis being berated by Yale student Jerelyn Luther, who demanded that he step down, went viral on social media.\nAccording to a statement by Yale University, Christakis will remain at the university in a professional capacity.\nBelow is the full text of Erika’s email.\nDear Sillimanders:\nNicholas and I have heard from a number of students who were frustrated by the mass email sent to the student body about appropriate Halloween-wear. I’ve always found Halloween an interesting embodiment of more general adult worries about young people. As some of you may be aware, I teach a class on “The Concept of the Problem Child,” and I was speaking with some of my students yesterday about the ways in which Halloween – traditionally a day of subversion for children and young people – is also an occasion for adults to exert their control.\nWhen I was young, adults were freaked out by the specter of Halloween candy poisoned by lunatics, or spiked with razor blades (despite the absence of a single recorded case of such an event). Now, we’ve grown to fear the sugary candy itself. And this year, we seem afraid that college students are unable to decide how to dress themselves on Halloween.\nI don’t wish to trivialize genuine concerns about cultural and personal representation, and other challenges to our lived experience in a plural community. I know that many decent people have proposed guidelines on Halloween costumes from a spirit of avoiding hurt and offense. I laud those goals, in theory, as most of us do. But in practice, I wonder if we should reflect more transparently, as a community, on the consequences of an institutional (which is to say: bureaucratic and administrative) exercise of implied control over college students.\nIt seems to me that we can have this discussion of costumes on many levels: we can talk about complex issues of identify, free speech, cultural appropriation, and virtue “signaling.” But I wanted to share my thoughts with you from a totally different angle, as an educator concerned with the developmental stages of childhood and young adulthood.\nAs a former preschool teacher, for example, it is hard for me to give credence to a claim that there is something objectionably “appropriative” about a blonde-haired child’s wanting to be Mulan for a day. Pretend play is the foundation of most cognitive tasks, and it seems to me that we want to be in the business of encouraging the exercise of imagination, not constraining it. I suppose we could agree that there is a difference between fantasizing about an individual character vs. appropriating a culture, wholesale, the latter of which could be seen as (tacky)(offensive)(jejeune)(hurtful), take your pick. But, then, I wonder what is the statute of limitations on dreaming of dressing as Tiana the Frog Princess if you aren’t a black girl from New Orleans? Is it okay if you are eight, but not 18? I don’t know the answer to these questions; they seem unanswerable. Or at the least, they put us on slippery terrain that I, for one, prefer not to cross.\nWhich is my point. I don’t, actually, trust myself to foist my Halloweenish standards and motives on others. I can’t defend them anymore than you could defend yours. Why do we dress up on Halloween, anyway? Should we start explaining that too? I’ve always been a good mimic and I enjoy accents. I love to travel, too, and have been to every continent but Antarctica. When I lived in Bangladesh, I bought a sari because it was beautiful, even though I looked stupid in it and never wore it once. Am I fetishizing and appropriating others’ cultural experiences? Probably. But I really, really like them too.\nEven if we could agree on how to avoid offense – and I’ll note that no one around campus seems overly concerned about the offense taken by religiously conservative folks to skin-revealing costumes – I wonder, and I am not trying to be provocative: Is there no room anymore for a child or young person to be a little bit obnoxious… a little bit inappropriate or provocative or, yes, offensive? American universities were once a safe space not only for maturation but also for a certain regressive, or even transgressive, experience; increasingly, it seems, they have become places of censure and prohibition. And the censure and prohibition come from above, not from yourselves! Are we all okay with this transfer of power? Have we lost faith in young people’s capacity – in your capacity – to exercise self-censure, through social norming, and also in your capacity to ignore or reject things that trouble you? We tend to view this shift from individual to institutional agency as a trade off between libertarian vs. liberal values (“liberal” in the American, not European sense of the word).\nNicholas says, if you don’t like a costume someone is wearing, look away, or tell them you are offended. Talk to each other. Free speech and the ability to tolerate offense are the hallmarks of a free and open society.\nBut – again, speaking as a child development specialist – I think there might be something missing in our discourse about the exercise of free speech (including how we dress ourselves) on campus, and it is this: What does this debate about Halloween costumes say about our view of young adults, of their strength and judgment?\nIn other words: Whose business is it to control the forms of costumes of young people? It’s not mine, I know that.\nHappy Halloween.\nYours sincerely,\nErika","url":"https://www.breitbart.com/tech/2016/05/26/yale-professor-incited-tension-halloween-costume-email-announces-resignation/"}
