{"authors":[],"date_download":"2018-10-30 00:50:25","date_modify":"2018-10-30 00:50:25","date_publish":"2018-09-10 00:05:13","description":"In a major boost for American tennis in the year’s last Grand Slam, it was Yankee Doodle Dandy in the three doubles draws.Mike Bryan won in the men’s doubles, ably aided by Jack Sock standing in for injured brother Bob. This makes it two Slams in a row for the team that also won at Wimbledon last July.","filename":"data/vaneerConsumption/YanksSweepDoublesatUSOpen.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/960px-Naomi_Osaka_42669657062.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860625.html","title":"Yanks Sweep Doubles at U.S. Open","title_page":"Yanks Sweep Doubles at U.S. OpenThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"In a major boost for American tennis in the year’s last Grand Slam, it was Yankee Doodle Dandy in the three doubles draws.\nMike Bryan won in the men’s doubles, ably aided by Jack Sock standing in for injured brother Bob. This makes it two Slams in a row for the team that also won at Wimbledon last July.\nOn Saturday the unstoppable Bethanie Mattek-Sands, coming back from a knee-shattering injury that even her husband at first thought would force her to retire from the sport, won in mixed doubles with the Scot prodigy Jamie Murray (Andy’s older brother), who sang happy birthday to his mother when he received the trophy.\nAnd on Sunday, Coco Vandeweghe came from behind to win two thrilling tiebreaks and, with Australia’s Ashley Barty, take the trophy in the women’s doubles.\nYou could call it a three-peat for the Anglosphere, notwithstanding the men’s draw ended Sunday night with a two-peat as Wimbledon winner Novak Djokovic beat Juan-Martin del Potro in straight sets, but you have to be careful about what you say these days around Flushing Meadows. Umpire Carlos Ramos got called a thief and a liar for saying “penalty” once too often in a women’s singles final that saw some of the best play of the tournament.\nSome say the unfortunate incident at Arthur Ashe Stadium would not have happened had Serena Williams not lost the first set to Naomi Osaka.\nMiss Williams, six-time winner at Flushing Meadows and the best player on the women’s tour in her time, was doing very well, hitting clean hard ground strokes and moving around the court and using her excellent serve as needed.\nBut her opponent, playing her first Grand Slam final, was doing even better. She met Miss Williams on her own terms, hitting deep and hard groundstrokes, pushing the pace, aiming for the lines. In the third game of the first set, with Miss Williams serving at 30-15, Miss Osaka stood her ground to even the score. A hard return of serve gave her the first break point of the game and the more experienced player converted it for her by double faulting.\nIt can happen. Miss Williams has been broken early in a set many times; indeed, she not infrequently drops a first set only to come back and take the next two. But there was little question who was dictating the match from then on. Miss Osaka held at 15 on her next serve, closing with a Serena-like ace wide, 3-1. She then broke Miss Williams again, using speed and power through a long baseline rally for the last point.\nThis sort of point, a test of nerves when two excellent players get into it because neither has any inherent reason to miss, was all the more remarkable because by then the crowd’s partisanship had got beyond the normal support you give to the home favorite. Miss Osaka was playing a tennis so unflappable that you had to think she had a Zen master on her team.\nActually, what she had was one of Miss Williams former hitting coaches. They say imitation is the highest form of flattery, and Miss Osaka, who said she wrote a little book in third grade in which she said she wanted to be Serena Williams when she grew up, is the most Williams-like of the many promising athletes who have been touted over the years as the next Serena (or Venus) Williams.\nShe beat one of the next-Serenas, Madison Keyes, in the semis in two sets. She never flinches. She counter-punches when the punch comes, but then winds up her own, delivers it in on the line. She won 6-2.\nThe question then was, would a girl just turning twenty wilt under the pressure? The answer came early in the second set. Miss Williams broke her in the fourth game, needing four break points to do it.\nThe 24,000 spectators were not all yelling their heads off. A few, mainly Japanese, were sitting quietly and clapping modestly — the ones I saw — when their girl won a point, their approval out-noised by sighs than sounded very much like boos. Though tennis has been popular in Japan since the 1920s, no Japanese had yet won the U.S. Open or its predecessor U.S. Nationals.\nMiss Osaka praised both her parents in interviews. Her father is Haitian. She said he gave her corny and inspirational advice, but could not offer an example. She is a teenager.\nThe advice, however, took: Miss Osaka broke back. As for pressure, it was Miss Williams who double faulted — twice.\nMiss Osaka then held at love. But, and not everyone realized this immediately, she had a 15-0 start because Miss Williams was assessed a penalty for a coaching violation. The coaching rule is that it is not allowed. Miss Williams’ coach, the Frenchman Patrick Mouratouglou, was sending her signals. He was seen on TV. He did not deny it when asked later. He blamed the system, said everybody does it. He said anyway his player did not see the signals, which is quite possible. It is also irrelevant to the rule.\nMiss O., with her 15-0, went on to hold at love, closing with a ferocious ace, this one on the T. She then broke Miss Williams again, blasting a backhanded return of serve at 30-all for a downtheline winner and converting the break point with a forehand passing shot as Miss Williams moved forward. Mouratouglou’s signals, he said, were to move forward.\nDown 3-4, Miss Williams smashed her racquet. The rule is clear here: equipment abuse, not permitted.\nNow, at three penalties, you forfeit a game. The thing is to either do what Marcos Baghdatis did at the Australian Open some years back, go to the bench, take out the rackets in your bag and systematically trash them one by one, accept the penalties, and get back into the match, feeling much better (he lost to Stan Wawrinka); or find a way to calm yourself down and play the next point.\nMiss Williams launched into a tirade against the ump, evoked “sexism” and motherhood and how-dare-you. She called him a liar for calling her a cheater and said she never cheated.\nActually, it is not clear Mr. Ramos called her anything. The rule is no coaching, regardless of whether she knew she was being coached. If you are driving and your passenger does not wear a seat belt, you get the ticket. It is the same principle.\nIt ended with two big-foot officials explaining elementary rules of professional conduct to the best player of her generation, who was by then in tears of rage or grief. But over what exactly? She felt robbed — by whom? It would be only too human if in the end she could not say.\nMany an athlete will tell you that, when losing, there is sometimes an urge to find a distraction that will either demoralize of confuse the opponent, or if that fails, at least provide a reason for the loss that does not quite give credit to the winner.\nIt was Miss Osaka’s serve, but she was given the game by forfeit (verbal abuse against an ump, third penalty). So it was 5-3. Miss Williams then held at love, closing with an ace. You had to wonder.\nMiss Osaka often had difficulty with Miss Williams’ serve; everyone has. In several games, she missed her first return of serve, but then figured out how to be ready for the next one. Move faster as the toss goes up. Or move to this side or that as you try to read what she is sending you (Miss Williams’ serves are notoriously hard to read because her toss does not vary). Or step further back, which creates other problems. At any rate, she was doing this well, or she would not have been breaking. But this time she only once put the ball in play.\nDid she figure her father would have told her to give back the game that the ump had given her? You can win only by playing better.\nAfter all, she wanted to be Serena when she was three.\nAt 5-4, she served for the match. An ace took her to 40-15. A gorgeous Serena-backhand downtheline saved match point for Miss Williams.\n40-30, match point number two.\nLater, at the trophy ceremony, Katrina Adams, who is the president of the USTA (owner of the U.S. Open), made a statement. She mentioned that despite being frustrated with “how the match played out,” Serena “stepped up after the final” to give credit to her opponent “for a match well played,” and this “speaks volumes about who she is.” The statement said nothing about how the USTA tops and the rest of the bigs at the trophy ceremony let the crowd boo the winner, who was in tears.\nIt looked like they were apologizing for the outcome.\nMaybe this speaks volumes about how we, as a society, treat reality these days. It is rather twisted, because meanwhile the USTA invites a Marine color guard to open the final matches and display the flag, the USAF sends a squadron to fly over the grounds, the police and firemen are recognized and cheered. Then there is a ceremony in which it appears all these uniforms stand for is stood on its head: yell unfair and get your wish.\nBut on that match point, as summer turned to fall, Naomi Osaka hit a ball to the service line, and that was that.","url":"https://spectator.org/yanks-sweep-doubles-at-u-s-open/"}
