{"authors":["Frances Martel"],"date_download":"2018-10-30 20:42:48","date_modify":"2018-10-30 20:42:48","date_publish":"2015-03-18 15:37:47","description":"In Nicaragua this week on an official visit, Venezuelan President Nicolás Maduro urged Latin Americans to send \"millions of letters to Obama\" denouncing a new round of sanctions on Venezuela over the Maduro regime's many human rights violations. This, according to official correspondence obtained by Latin media, will include letters teachers are to force schoolchildren to write and send to the U.S. President. |","filename":"data/vaneerConsumption/YanquiGoHomeVenezuelanSchoolchildrenForcedtoSendObamaHateMail.json","image_url":"https://media.breitbart.com/media/2015/02/obama-under-pressure-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_18__1540932168.html","title":"'Yanqui Go Home': Venezuelan Schoolchildren Forced to Send Obama Hate Mail","title_page":"'Yanqui Go Home': Venezuelan Schoolchildren Forced to Send Obama Hate Mail | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In Nicaragua this week on an official visit, Venezuelan President Nicolás Maduro urged Latin Americans to send “millions of letters to Obama” denouncing a new round of sanctions on Venezuela over the Maduro regime’s many human rights violations. This, according to official correspondence obtained by Latin media, will include letters teachers are to force schoolchildren to write and send to the U.S. President.\nArgentine news outlet Infobae has obtained a letter written to the head of a private school in northern Monagas state in which the Ministry of Education demands the school require children to write letters to President Obama urging him to drop sanctions against the nation. “Please ask of your circuit directors that students write a message to the Preisdent of the United States to respect Venezuela,” the letter reads, “they should collect and save the letters, which will be requested.”\n“Students may also submit drawings against Obama,” the letter adds.\nAccording to sources within the school who spoke to Infobae, the principal has already issued the request to teachers, and added his own rhetorical flourish: the theme of all the letters should be “yanqui go home.”\nIn Nicaragua this week, President Maduro urged Latin American leftists to join in a letter-writing campaign against President Obama. “Let’s send Obama millions of letters so he repeals the decree,” Maduro urged, CNN reports. He extended this request to Nicaraguans as well as Venezuelans; leftist President Daniel Ortega has supported Maduro in light of the sanctions.\nThe first such “letter” to America appears to be a full-page ad in the New York Times, published this week, titled “Letter to the People of the United States: Venezuela is Not a Threat,” and allegedly written by Maduro himself (full text here). “Never before in the history of our nations, has a president of the United States attempted to govern Venezuelans by decree,” the advertisement reads (worth noting that President Maduro has been governing Venezuelans by decree since November 2013). The letter openly denies that freedom of expression is in danger in the country: “We have freedom of press and we are enthusiastic users of social media.” It also cites the relations between American founding fathers and Venezuelan revolutionary Francisco de Miranda as proof of the good will of the Venezuelan government. The letter does not mention that Maduro preceded President Obama’s sanctions with unilateral executive sanctions on President George W. Bush and Vice President Dick Cheney, for unsubstantiated allegations of “terrorism.”\nThe New York Times itself has dutifully issued President Obama a wag of the finger on the sanctions issued via executive order against socialist Venezuelan leaders implicated in state violence.","url":"https://www.breitbart.com/national-security/2015/03/18/yanqui-go-home-venezuelan-schoolchildren-forced-to-send-obama-hate-mail/"}
