{"authors":[],"date_download":"2018-10-23 02:50:23","date_modify":"2018-10-23 02:50:23","date_publish":"2016-01-29 17:35:38","description":"Retired Chinese NBA icon Yao Ming will be among the instructors at a Basketball Without Borders camp for top global teen players to be staged over the NBA Al...","filename":"data/vaneerConsumption/YaoamongteachersatNBAAllStarGamesglobalcamp.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i3vb-4PuZeKVXE7cd9005b2c876cb33e9-731_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423189_Yao-teachers-NBA-All-Star-Games-global-camp_1540263023.html","title":"Yao among teachers at NBA All-Star Game's global camp","title_page":"Yao among teachers at NBA All-Star Game's global camp | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Yao among teachers at NBA All-Star Game's global camp\nRetired Chinese NBA icon Yao Ming will be among the instructors at a Basketball Without Borders camp for top global teen players to be staged over the NBA All-Star Game weekend.\nThe league announced Friday that 43 boys and 10 girls representing 27 nations would travel to Toronto for the February 12-14 camp at Mattamy Athletic Centre.\nElite players from the Eastern and Western conferences will meet February 14 in the 65th NBA All-Star Game, the first to be staged outside the United States.\nYao Ming, a 7-foot-6 center, was the first pick of the 2002 NBA Draft by the Houston Rockets after playing five seasons in China ©Toshifumi Kitamura (AFP/File)\nIn conjunction with the game will be a teaching session for top high school players from Asia, Australia, Africa, Europe and the Americas.\nYao, a 7-foot-6 (2.29m) center, was the first pick of the 2002 NBA Draft by the Houston Rockets after playing five seasons in China. He became the NBA's first major Asian star with eight NBA All-Star nods in as many seasons.\nYao averaged 19.0 points, 9.2 rebounds, 1.9 blocked shots and 1.6 assists a game for Houston over his 486-game NBA career.\nHe missed the entire 2009-10 season with a broken left ankle and played only five games into the following campaign before a stress fracture in the same ankle ended his season and led to his retirement in July of 2011.\nOther instructors at the clinic will include Venezuelan guard Greivis Vasquez of the Milwaukee Bucks, Italian forward Danilo Gallinari of the Denver Nuggets and Democratic Republic of Congo center Bismack Biyombo of the Toronto Raptors.\n\"The BWB Global Camp is a great opportunity for these boys and girls to learn directly from players and coaches,\" said NBA vice president of international basketball operations Brooks Meek.\n\"The BWB program continues to teach values like leadership, teamwork and respect that have application on and off the court.\"\nTeen players will be shown how to improve movement efficiency, positional skills and shooting, play games and attend seminars on health, leadership and communication.","url":"https://www.dailymail.co.uk/wires/afp/article-3423189/Yao-teachers-NBA-All-Star-Games-global-camp.html"}
