{"authors":["Sara Malm For Mailonline"],"date_download":"2018-10-23 02:04:22","date_modify":"2018-10-23 02:04:22","date_publish":"2016-01-29 16:18:41","description":"Hundreds of Yazidi women and teenage girls , were subjected to the degrading and invasive procedure by Kurdish officials after they managed to escape the clutches of ISIS.","filename":"data/vaneerConsumption/YazidisexslavesfreedfromISIScaptorshavebeenforcedtohavevirginitytests.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/095176B900000514-0-image-a-16_1454084309449.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423045_Yazidi-sex-slaves-freed-ISIS-captors-forced-undergo-degrading-virginity-tests-Kurdistan-officials-human-rights-group-reveals_1540260262.html","title":"Yazidi sex slaves freed from ISIS captors have been forced to have 'virginity tests'","title_page":"Yazidi sex slaves freed from ISIS captors have been forced to have 'virginity tests' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hundreds of Yazidi women and children who had been captured and kept as sex slaves by ISIS have been forced to undergo 'virginity tests' - after they managed to escape.\nFreed former sex slaves were subjected to the degrading and invasive procedure by Kurdish officials as part of a 'post-rape examination', a human rights group has revealed.\nWitnesses say the 'virginity tests' had been carried out on the young women and girls who had been unmarried when they were kidnapped by ISIS in 2014.\nHorrors: Yazidi women and teenage girls were subjected to degrading and invasive 'virginity tests' by Kurdish officials after they managed to escape the clutches of ISIS (stock image)\nMore than 5,000 Yazidi women and teenage girls were captured and enslaved by ISIS forces when the militant Islamist terrorists attacked the city of Sinjar, northern Iraq in August 2014.\nThe women, some just teenagers, were forced to watch ISIS militants murder their families before they were sold into sexual slavery.\nWhile many remain in the evil clutches of ISIS, some have managed to escape to relay horrific tales of abuse, rape, slavery and brutal torture.\nMany have sought refuge in Kurdish Iraq, where some claim to have been subjected to 'virginity tests', a procedure which has been found time and time again to have no scientific validity.\nAccording to Judge Ayman Bamerny, who heads a committee gathering evidence of ISIS crimes, these tests were seen as evidence of rape by Iraqi courts, Human Rights Watch reports.\nMore than 5,000 Yazidi women were captured and enslaved by ISIS forces when the militant Islamist terrorists attacked the city of Sinjar, northern Iraq in August 2014 (stock image)\nThe World Health Organization has stated definitively that 'virginity tests' have no scientific validity, based on a commonly held - but inaccurate - belief that all women and girls who are virgins have intact hymens that bleed on first intercourse.\n'As officials work toward proper forensic examinations of rape survivors, they should ensure that all women and girls in Iraq who were subject to sexual violence are treated with dignity and respect,' Human Rights Watch adds.\nThis follows a UN report which said an estimated 3,500 people, mainly women and children, are still believed to be held as slaves by ISIS.\nThe U.N. Assistance Mission for Iraq and U.N. human rights office estimated that 3,500 people were 'currently being held in slavery by ISIS numbers'.","url":"https://www.dailymail.co.uk/news/article-3423045/Yazidi-sex-slaves-freed-ISIS-captors-forced-undergo-degrading-virginity-tests-Kurdistan-officials-human-rights-group-reveals.html"}
