{"authors":[],"date_download":"2018-10-30 14:27:47","date_modify":"2018-10-30 14:27:47","date_publish":"2016-11-02 20:53:00","description":"Twelve people were arrested in a year-long cocaine trafficking sting in Hall County and three other...","filename":"data/vaneerConsumption/Yearlongcocaineinvestigationnets12arrests3ontherun.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/02/Images/newsEngin.16677469_hallcofugitives.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_year-long-c_22e19f0248c84eb48f5f7fcd6b6e6e0a__1540909667.html","title":"Year-long cocaine investigation nets 12 arrests; 3 on the run","title_page":"Year-long cocaine investigation nets 12 arrests; 3 on the run","title_rss":"NULL","source_domain":"ajc.com","text":"Twelve people were arrested in a year-long cocaine trafficking sting in Hall County and three other suspects are being sought, officials said in a news release Wednesday.\nKameca Dukes, Kecole Dukes, Ricky Bledson and Rassie Littlejohn face federal trafficking cocaine charges. Both Dukes were charged with selling cocaine, according to the release.\nLittlejohn, Marquis Bonds, Ashton Holmes and Denson Porter also face federal weapons charges.\nXavier Johnson, Spencer Porter, Quincy Sanders, Jerenda Wheeler and Benjamin Wills were charged with selling cocaine.\nAccording to the release, when authorities arrived at Bledson’s house to arrest him, they found 15 grams of crack cocaine, about one ounce of synthetic marijuana and more than $10,000 cash.\nOfficials arrested 12 people in connection with a drug investigation in Hall County. Three more are being sought. (Credit: Hall County Sheriff’s Office) (The Atlanta Journal-Constitution)\nIn addition to Bledson’s cocaine charges, authorities charged him with intent to distribute and possession of synthetic marijuana.\nOfficials also found three growing marijuana plants and a shotgun at Holmes’ home, according to the release. He was also charged with manufacturing marijuana.\nAuthorities are searching for three more people — Travon Bonds, Willie Randolph and Dashad Turner — believed to be connected to the investigation.\nHall County's Multi Agency Narcotics Squad, ATF, Felony Probation, Hall County Sheriff’s Office Uniformed Patrol Division and the Gainesville Police Department assisted with the arrests.","url":"https://www.ajc.com/news/crime--law/year-long-cocaine-investigation-nets-arrests-the-run/S7QxslfjkoPMTUZ4TZGshI/"}
