{"authors":["Associated Press"],"date_download":"2018-10-23 02:37:27","date_modify":"2018-10-23 02:37:27","date_publish":"2016-01-28 17:37:47","description":"SANAA, Yemen (AP) — The Islamic State affiliate in Yemen has claimed responsibility for a suicide bombing on Thursday that killed seven people and targeted t...","filename":"data/vaneerConsumption/YemensuicidebombersaidtobeDutchISfighter.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420494_Al-Jazeera-journalists-released-abduction-Yemen_1540262247.html","title":"Yemen suicide bomber said to be Dutch IS fighter","title_page":"Yemen suicide bomber said to be Dutch IS fighter | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Yemen suicide bomber said to be Dutch IS fighter\nSANAA, Yemen (AP) — The Islamic State affiliate in Yemen has claimed responsibility for a suicide bombing on Thursday that killed seven people and targeted the presidential palace in Aden, where the internationally-recognized president and his cabinet are based.\nIn an online statement posted on Twitter by the group's supporters, IS identified the attacker as Abu Hanifa al-Hollandi, an Arabic nom de guerre that suggests he was Dutch. The last name in militants' pseudonyms usually indicates their nationality or place of origin. His real name was not immediately known.\nIt was not possible to verify the claim. The group posted pictures that appeared to show the car bomb speeding toward cement barricades manned by presidential guards.\nEarlier on Thursday, three Al-Jazeera journalists who were kidnapped in the war-ravaged Yemeni city of Taiz were released, the news network said in a statement. Journalists have been frequently targeted during Yemen's conflict, which pits southern Shiite rebels, known as Houthis, against government forces backed by a Saudi-led military campaign.\nThe Houthis seized control of the Yemeni capital, Sanaa, in September 2014 and in November that year the president fled to Aden.\nThe bombing took place around one kilometer away from his palace, which is heavily guarded by Emirati and Saudi special forces, officials said. They said that both President Abed Rabbo Mansour Hadi and Prime Minister Khaled Bahah were inside the palace at the time of the explosion. Witnesses said that the bombing was heard across the city and demolished several nearby houses.\nIS has claimed a series of large attacks in Aden including the assassination of a city governor last year and the bombing of a building that formerly housed the cabinet. Both the current governor and the city's security chief have survived several assassination attempts.\nThe attack came days after top government officials held a meeting to discuss badly-needed security measures in Aden, officials said, adding that the new security plan involved the deployment of heavy weaponry to the city. They said that a first dispatch that included dozens of armored vehicles and rockets had already arrived, and that units of newly-trained civilians had joined the pro-government army in Aden.\nThey spoke on condition of anonymity because they were not authorized to speak to the press.\nSince the beginning of the Saudi-led military campaign in Yemen in March, al-Qaida and Yemen's Islamic State affiliate have set up training camps in Aden and consolidated their presence in many of the city's districts. Officials have said that al-Qaida specifically is moving its fighters in the outskirts of Aden in preparation for a major attack.\nMeanwhile, Al-Jazeera confirmed that its reporter Hamdi al-Bokari and crew members Abdulaziz al-Sabri and Moneer al-Sabai had been freed in the western city of Taiz.\nAl-Bokari wrote on his Facebook page that he was abducted by Houthis and that they were subjected to \"terrible mental torture.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3420494/Al-Jazeera-journalists-released-abduction-Yemen.html"}
