{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:39:08","date_modify":"2018-10-30 20:39:08","date_publish":"2016-04-12 04:08:25","description":"The Saudi-led military intervention in Yemen has helped al-Qaeda in the Arabian Peninsula grow stronger than ever, reveals Reuters.","filename":"data/vaneerConsumption/YemenCivilWarIsHelpingAlQaedaBecomeStrongerThanEver.json","image_url":"https://media.breitbart.com/media/2015/10/syrian-al-nusra-front-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_04_11__1540931948.html","title":"Yemen Civil War Is Helping Al-Qaeda ‘Become Stronger’ Than Ever","title_page":"Yemen Civil War Is Helping Al-Qaeda ‘Become Stronger’ Than Ever","title_rss":"NULL","source_domain":"breitbart.com","text":"The Saudi-led military intervention in Yemen, backed by the United States, has helped al-Qaeda in the Arabian Peninsula (AQAP) grow stronger than ever, reveals a recent investigation by Reuters.\n“Once driven to near irrelevance by the rise of Islamic State [ISIS/ISIL] abroad and security crackdowns at home, al Qaeda in Yemen now openly rules a mini-state with a war chest swollen by an estimated $100 million in looted bank deposits and revenue from running the country’s third largest port,” reports Reuters.\n“If Islamic State’s capital is the Syrian city of Raqqa, then al Qaeda’s is Mukalla, a southeastern Yemeni port city of 500,000 people,” it adds. “Al Qaeda fighters there have abolished taxes for local residents, operate speedboats manned by RPG-wielding fighters who impose fees on ship traffic, and make propaganda videos in which they boast about paving local roads and stocking hospitals.”\nThe Yemen-based AQAP, considered the most dangerous branch of the jihadist group, has benefited from the political and security chaos in Yemen. A Saudi-led coalition that launched a military intervention in Yemen in March 2015 has been primarily focused on defeating the Iran-allied Shiite rebels known as the Houthis, who also control territory in the country.\nHowever, AQAP has emerged as the strongest jihadist group in Yemen, which is also home to ISIS terrorists. In late February, The Fiscal Times indicated that the al-Qaeda branch controlled more territory in Yemen than the Houthis and ISIS.\nCiting various diplomats, Yemeni security officials, tribal leaders, and Mukalla residents, Reuters notes that AQAP’s “emergence is the most striking unintended consequence of the Saudi-led military intervention in Yemen.”\n“The campaign, backed by the United States, has helped Al Qaeda in the Arabian Peninsula (AQAP) to become stronger than at any time since it first emerged almost 20 years ago,” it adds.\nCapturing Mukalla, Yemen’s fifth largest city and the capital of the country’s largest province, in April 2015 was a major gain for AQAP, noted The Fiscal Times.\n“The militants released 300 inmates from the city’s prison, including top al Qaeda’s commanders. They also captured several army camps with dozens of tanks, a military airfield, a presidential palace, an oil facility and the branch of Yemen’s central bank that held millions of U.S. dollars,” it reported.\n“Yemeni government officials and local traders estimated the group, as well as seizing the bank deposits, has extorted $1.4 million from the national oil company and earns up to $2 million every day in taxes on goods and fuel coming into the port,” adds Reuters.\nAQAP reportedly claims it has 1,000 fighters in Mukalla and controls 373 miles of coastline.\n“By adopting many of the tactics Islamic State uses to control its territory in Syria and Iraq, AQAP has expanded its own fiefdom,” reports Reuters. “The danger is that the group, which organised the Charlie Hebdo magazine attack in Paris last year and has repeatedly tried to down U.S. airliners, may slowly indoctrinate the local population with its hardline ideology.”\n“Despite thousands of aerial bombings, the Saudis and their Gulf allies have failed to push the Houthis from the capital Sanaa,” it adds. “An estimated 6,000 people, half of them civilians, have been killed.”\nA temporary truce between the internationally-recognized Yemeni government, led by President Abd-Rabbu Mansour Hadi, and the Houthis has already begun.\nThe United Nations-brokered ceasefire is “mostly holding,” reports the Associated Press (AP), adding that both sides are accusing the other of violations.\n“The cease-fire is a precursor to peace talks, scheduled to begin next week in Kuwait, aimed at ending a brutal humanitarian crisis in one of the world’s poorest countries,” notes USA Today.","url":"https://www.breitbart.com/national-security/2016/04/11/war-helped-al-qaeda-yemen-become-stronger-ever/"}
