{"authors":[],"date_download":"2018-10-23 03:25:25","date_modify":"2018-10-23 03:25:25","date_publish":"2016-01-28 19:00:25","description":"A suicide car bombing claimed by the Islamic State jihadist group killed at least eight people Thursday outside Yemen's presidential palace in the city of Ad...","filename":"data/vaneerConsumption/YemenblastkillseightnearpresidentialpalaceinAden.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g9yu-2vdWmEltwXfba0ce28e632bd0232-112_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421074_Yemen-blast-kills-eight-near-presidential-palace-Aden_1540265125.html","title":"Yemen blast 'kills eight' near presidential palace in Aden","title_page":"Yemen blast 'kills eight' near presidential palace in Aden | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Yemen blast 'kills eight' near presidential palace in Aden\nA suicide car bombing claimed by the Islamic State jihadist group killed at least eight people Thursday outside Yemen's presidential palace in the city of Aden, security and medical officials said.\nIS said that one of its militants, apparently a Dutch national, carried out the attack on a checkpoint outside the palace in the main city of southern Yemen.\nBoth soldiers and civilians were among those killed, while at least 17 others were wounded, a medical source said.\nPeople gather at the site of a suicide car bombing outside Yemen's presidential palace in the city of Aden, on January 28, 2016 ©Saleh al-Obeidi (AFP)\nA security source said the attack appeared to target the convoy of a local businessman who was entering the presidential complex.\nSources had initially said the convoy was carrying Aden's governor, Aidarus al-Zubaidi, but he later told AFP he was not in the area at the time of the attack.\nZubaidi survived a car bombing earlier this month, after being appointed in December following the murder of his predecessor, Jaafar Saad, in an Aden bombing claimed by IS.\nWitnesses said the blast damaged at least six vehicles and a nearby mosque.\nIn statement posted on Twitter, IS said \"martyrdom-seeker Abu Hanifa al-Hollandi... detonated his explosives-laden vehicle at the presidential palace\".\nThe name used for the assailant implied he was from the Netherlands.\nPresident Abedrabbo Mansour Hadi was in the palace at the time of the attack but unharmed, a government official said.\nMilitary vehicles from the Saudi-led coalition which supports Hadi's government were deployed around the complex after the attack, security sources said.\nAden has become the temporary headquarters of Hadi's government as it battles to retake large parts of Yemen from Shiite Huthi rebels.\nThe port city has also seen a growing jihadist presence, with Al-Qaeda in the Arabian Peninsula, long active in Yemen, and IS apparently vying for influence.\nHadi fled to Aden after escaping house arrest in the capital Sanaa, which was overran by the Huthis in September 2014.\nBut he also had to flee the southern port city in March to Riyadh when the rebels advanced on the south, prompting Saudi Arabia to intervene with air strikes.","url":"https://www.dailymail.co.uk/wires/afp/article-3421074/Yemen-blast-kills-eight-near-presidential-palace-Aden.html"}
