{"authors":["Matt Hunter For Mailonline"],"date_download":"2018-10-22 22:55:48","date_modify":"2018-10-22 22:55:48","date_publish":"2016-01-28 11:29:30","description":"The period thatched-roofed property near Yeovil, is at the foot of Gold Hill, Shaftsbury - the idyllic village near Yeovil featured in the Hovis campaign more than 40 years ago.","filename":"data/vaneerConsumption/Yeovilhomemadefamousby1970sHovisadvertonsalefor350000.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9DC7900000578-0-image-a-39_1453980260088.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420662_The-house-wi-nowt-taken-Home-hill-famous-1970s-Hovis-advert-goes-sale-350-000_1540248948.html","title":"Yeovil home made famous by 1970s Hovis advert on sale for £350,000","title_page":"Yeovil home made famous by 1970s Hovis advert on sale for £350,000 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"You can own a slice of history with this £350,000 cottage made famous by a much loved 1970s advert.\nThe period thatched-roofed property in north Dorset, is at the foot of Gold Hill, Shaftesbury - the idyllic village featured in the Hovis campaign more than 40 years ago.\nGrade II-listed, the end of terrace home features two bedrooms with ensuite bathrooms, a kitchen/dining room, reception space and garden.\nThe Hovis advert from 1973, which tells the story of a baker's boy finishing after a long day, is still remembered fondly today.\nScroll down for video\nCharming home: The two bedroom cottage up for sale featured in the 1970s Hovis advert famous for a boy riding his bike down Gold Hill, Shaftesbury\nBack in the day: Scenes from the famous advert with the 'boy on a bike' - here he is pushing his bicycle up the hill and joyfully riding down\nHomely: The Grade-II listed property is up for £350,000 in Dorset and includes two ensuite bathrooms as well as kitchen/dining room, reception space and garden\nEstate agents Strutt & Parker are no doubt hoping prospective buyers will be enticed with the home and its place in television history.\nThe chocolate-box home's location means in a short walk the owner can take in the stunning views from the top of the hill without a daily uphill trudge to get home.\nIn the advert, the boy struggles to push his bike up the cobbled street with a basket full of bread to the last house on his round.\nIn it he is heard to say that delivering bread to the house on top of the hill 't'was like taking bread to the top of the world.'\nThe commercial, directed by Alien and Gladiator film-maker Ridley Scott, was voted Britain's all-time favourite TV advert in 2006.\nIt was meant to depict a northern industrial town but was actually shot in the quaint southern market town.\nFor this reason it is still known to many as 'Hovis Hill' and is still a popular spot for tourists to visit.\nThis cottage is an end of terrace two-bedroom property full of charm and period features, including exposed beams and flagstone flooring throughout.\nBut modern comforts have been provided too - there is underfloor heating and both bedrooms have ensuites.\nThe living room has a large inglenook fireplace and window seats and there is a garden room that opens onto the terrace and pretty back garden.\nUpdated: The period home in Shaftesbury has been tastefully modernised over the years and includes underfloor heating in the property\nElegant spaces: The property, number five in St James Street, is situated on a quiet road close to the centre of the historic Saxon hilltop town of Shaftesbury\nBeams and a bed: The house features exposed beams and flagstone flooring throughout the ground floor with a large inglenook fireplace in the living room\nGet cooking: The home's kitchen area - the property sits at the foot of Gold Hill, made famous for the 'boy on a bike' 1973 Hovis advert\nFiona Pengelly from Strutt & Parker said: 'Shaftesbury is a pretty hilltop town and it has the famous Gold Hill, which featured in the Hovis advert.\n'You have incredible views across the Blackmore Vale from the top. This property falls at the bottom of that iconic hill.\n'St James is an address that is like a community within the town. People really like the street, it's got very pretty houses and this one is a very chocolate box cottage.\n'The couple who own it just re-did the thatch before putting it on the market and they rented it out for holiday rentals so it is immaculate inside.\n'They wouldn't be getting rid of it if they didn't absolutely have to.\n'It's a perfect place to base yourself in the centre of the Dorset countryside and properties like this don't come up very often.","url":"https://www.dailymail.co.uk/news/article-3420662/The-house-wi-nowt-taken-Home-hill-famous-1970s-Hovis-advert-goes-sale-350-000.html"}
