{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:28:41","date_modify":"2018-10-30 19:28:41","date_publish":"2016-09-01 04:19:35","description":"Republican presidential nominee Donald Trump made two quick stops in California on Tuesday for campaign fundraisers.","filename":"data/vaneerConsumption/YesDonaldTrumpCampaignedinCalifornia.json","image_url":"https://media.breitbart.com/media/2016/06/GettyImages-537766520.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_08_31__1540927721.html","title":"Yes, Donald Trump Campaigned in … California","title_page":"Yes, Donald Trump Campaigned in ... California | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Republican presidential nominee Donald Trump made two quick stops in California on Tuesday for campaign fundraisers, speaking on issues of particular importance to Californians ahead of a Wednesday meeting in Mexico with the President of Mexico, and Trump’s much-anticipated immigration speech in Arizona.\nOn Monday, Trump made a fundraising stop in the Bay Area town of Woodside, where some 20 Hillary Clinton for President signs were erected, and one woman walked her Clinton-sign wearing horse in protest, according to the Mercury News. The local news outlet reported that during Trump’s last “high profile” trip to the region, protesters outside his June 2 San Jose campaign rally violently attacked Trump supporters.\nTrump visited Tulare on Tuesday for a fundraiser that hosted many locals who are involved in agriculture, at a cost of $2,700 to $25,000 to those in attendance, according to the Fresno Bee. Rep. Devin Nunes (R-CA), who helped facilitate the event, lauded Trump’s comprehension of the Central Valley water issues that have plagued the region’s agricultural industry. Nunes told the Bee that the 250-person event is expected to rake in a record $1.3 million at minimum, when final tallies are made.\nFormer New York Mayor Rudy Giuliani and Republican National Committee chairman Reince Priebus were also in attendance, according to the Bee. Nunes told the local news outlet that he was invited to spend extra time with Trump, during which he discussed issues of water and illegal immigration, noting their importance to farmers in the region.\nDuring a May campaign rally in Fresno, Trump spoke of government regulations that flush large volumes of water out to sea, when that water could be used to quench the thirsty farmlands of the world’s breadbasket. Just before that rally, according to Trump, he met with farmers from the region and spoke of the “three-inch fish,” referring to the Delta Smelt, which is the target of federal policies and environmentalists.\nTim Clark, California State Director for the Trump Campaign, told Breitbart News of Trump’s California stops, “Mr. Trump made fundraising stops in the Bay Area and Central Valley. Both were hugely successful. In the Central Valley, he assured farmers that fixing the state’s water problems will be a top priority.”\nClark tweeted on Wednesday:\nClark remarked that the campaign has held several other “packed house” volunteer training sessions, and that enthusiasm is high.\nMidday Wednesday Trump met with and held a joint press conference with Mexican President Peña Nieto, during which they discussed working together for the benefit of both countries on the issues of illegal immigration, dismantling drug cartels, improving NAFTA and protecting manufacturing wealth in the hemisphere.\nPhoto: file\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2016/08/31/trumps-quick-california-fundraising-trip/"}
