{"authors":["Chris Tognotti"],"date_download":"2018-10-30 23:57:24","date_modify":"2018-10-30 23:57:24","date_publish":"2014-08-12 20:44:43","description":"If there's anything that's been proven in recent years, it's just how much the Supreme Court matters (cough, Hobby Lobby). And not just the court itself, but the legal philosophies and opinions of its justices, which have recently broken down along…","filename":"data/vaneerConsumption/YesObamaRuthBaderGinsburgsRetirementCouldHelpDemocratsButThatsUpToHer.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/69abb545-e051-4ab6-919f-20d7e9d88408.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35499-yes-obama-ruth-bader-ginsburgs-retirement-could-help-democrats-but-thats-up-to-her_1540943844.html","title":"Yes, Obama, Ruth Bader Ginsburg's Retirement Could Help Democrats - But That's Up To Her","title_page":"Yes, Obama, Ruth Bader Ginsburg's Retirement Could Help Democrats - But That's Up To Her","title_rss":"NULL","source_domain":"bustle.com","text":"If there's anything that's been proven in recent years, it's just how much the Supreme Court matters (cough, Hobby Lobby). And not just the court itself, but the legal philosophies and opinions of its justices, which have recently broken down along a very familiar split: 5 to 4, with the court's conservative bloc (Roberts, Scalia, Alito, Thomas, and Kennedy) trumping the more liberal four (Ginsburg, Kagan, Sotomayor, and Breyer). That's why President Obama talked about upcoming Supreme Court vacancies at a fund-raiser in Martha's Vineyard Monday — because it's incredibly important, and without Democratic control of the Senate and White House, that conservative bloc is likely to grow stronger still.\nSpeaking to a group of donors, Obama expressed his need for the 2014 midterms to be friendly to Democrats in the Senate — at least friendly enough to maintain their majority, which is no sure thing. In the context of a fund-raising effort, with those fateful midterms looming just a few months away, it's easy to see why he'd bring the Supreme Court into the conversation. This is an \"all hands on deck\" sort of situation, and you can bet Democrats will be talking up any potential consequence of a Republican-controlled Senate, a new generation of Antonin Scalias included.\nSaid Obama:\nWhat’s preventing us from getting things done right now is you’ve got a faction within the Republican Party that thinks solely in terms of their own ideological purposes and solely in terms of how do they hang on to power. And that’s a problem. And that’s why I need a Democratic Senate. Not to mention the fact that we’re going to have Supreme Court appointments, and there are going to be a whole host of issues that many people here care about that are going to be determined by whether or not Democrats retain the Senate.\nHis words have churned up some speculation about who the next Supreme Court Justice to retire will be, and unsurprisingly, the attention is getting focused on progressive hero Ruth Bader Ginsburg. At 81, Ginsburg is the oldest Justice on the bench, though not by too much — conservatives Scalia and Kennedy are both 78. An appointment to the Supreme Court is a lifetime affair, so whether to stay or retire is up to nobody but the Justices themselves.\nAnd to hear Ginsburg tell it, she's not planning on going anywhere too quickly. Last month she told Katie Couric she was \"likely to remain for a while,\" and though there's no telling how long \"a while\" will be, the timeline in which Obama can select her hopeful successor is set in stone.\nAnd it really is an all-or-nothing deal — if Obama has a Republican-controlled Senate to deal with, you can't really expect anyone who would survive that confirmation hearing to have a Democratic-leaning legal outlook.\nComplicating matters, of course, is that the Justices themselves are aware of this dynamic. In the months before the defeat of the Romney/Ryan presidential ticket in 2012, Scalia told Fox News Sunday that he would \"not like to be replaced by somebody who sets out immediately to undo\" the things he'd spent so much of his life working on. It was speculated at the time that a Romney win could've meant early retirement (in relative terms) for Scalia — Jeffrey Toobin suggested this weeks before the election in a Q&A with Business Insider.\nMark Wilson/Getty Images News/Getty Images\nThere have similarly been calls for Ginsburg to step down before Obama's term is up, so to prevent her from departing under a Republican administration. While the reasons to think that way are compelling, it's also undeniably true that Ginsburg is one of the sharpest minds on the Court and she's got as much right to stay aboard as anyone — her former colleague John Paul Stevens stayed on until age 90.\nSo unless Obama's got a behind-the-scenes understanding worked out with her that's different from what she seems to be indicating publicly, you can expect to see Notorious RBG on the bench for a while yet.\nImages: Getty Images (2)","url":"https://www.bustle.com/articles/35499-yes-obama-ruth-bader-ginsburgs-retirement-could-help-democrats-but-thats-up-to-her"}
