{"authors":[],"date_download":"2018-10-30 00:59:49","date_modify":"2018-10-30 00:59:49","date_publish":"2016-01-10 00:00:00","description":null,"filename":"data/vaneerConsumption/YesTedCruzisaNaturalbornCitizen.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_01_yes_ted_cruz_is_a_natural_born_citizen_comments_1540861189.html","title":"Yes, Ted Cruz is a Natural born Citizen","title_page":"Articles: Yes, Ted Cruz is a Natural born Citizen","title_rss":"NULL","source_domain":"americanthinker.com","text":"Even Donald Trump thought so, at least before Ted Cruz slipped past him to top the Iowa polls. As recently as last August Trump was saying all the legal people he talked to vouched for Ted Cruz’s eligibility to be president. As ABC News reported The Donald’s flip-flop: Republican presidential candidate Donald Trump has reversed his position on Ted Cruz’s eligibility to run for president, now saying his Canadian birthplace shouldn’t disqualify him. “I hear it was checked out by every attorney and every which way and I understand Ted is in fine shape,” Trump told ABC News just before speaking at a Capitol Hill rally blasting the Iran nuclear deal. But that was then and this is now. Now Trump says he has “heard” that Cruz might not be eligible. Trump hears a lot of things and no doubt probably heard that Ted Cruz has stopped beating his wife. So should we believe what he heard in August or what he hears now with a defeat in the... (Read Full Article)","url":"https://www.americanthinker.com/articles/2016/01/yes_ted_cruz_is_a_natural_born_citizen_comments.html"}
he brings up a subject he once said was a non-issue. As the Daily Caller reports:\n“Republicans are going to have to ask themselves the question: ‘Do we want a candidate who could be tied up in court for two years?’ That’d be a big problem,” Trump told The Washington Post Tuesday. “It’d be a very precarious one for Republicans because he’d be running and the courts may take a long time to make decision. You don’t want to be running and have that kind of thing over your head.” I’d hate to see something like that get in his way,” he added. “But a lot of people are talking about it and I know that even some states are looking at it very strongly, the fact that he was born in Canada and he has had a double passport.”\nRight. Donald Trump would hate to see Ted Cruz’s campaign derailed before the Iowa caucuses by the bogus claim he has raised. So is Trump saying that a baby born in Paris to a vacationing American family is not eligible to run for president and must be “naturalized” like some illegal alien from Guadalajara?\nSome noted legal scholars would beg to differ from Trump’s concern that Cruz is not in fact a “natural born” citizen.\nJonathan Adler, who teaches courses in constitutional, administrative, and environmental law at Case Western University School of Law, writes in the Washington Post:\nTed Cruz was born in Canada. His mother was a U.S. citizen. His father, a Cuban, was not. Under U.S. law, the fact that Cruz was born to a U.S. citizen mother makes him a citizen from birth. In other words, he is a “natural born citizen” (as opposed to a naturalized citizen) and is constitutionally eligible.\nAdler cites in his piece an article by Neal Katyal and Paul Clement, “On The Meaning of Natural Born Citizen,” in the Harvard Law Review Forum, which states:\nAll the sources routinely used to interpret the Constitution confirm that the phrase “natural born Citizen” has a specific meaning: namely, someone who was a U.S. citizen at birth with no need to go through a naturalization proceeding at some later time. And Congress has made equally clear from the time of the framing of the Constitution to the current day that, subject to certain residency requirements on the parents, someone born to a U.S. citizen parent generally becomes a U.S. citizen without regard to whether the birth takes place in Canada, the Canal Zone, or the continental United States. While some constitutional issues are truly difficult, with framing-era sources either nonexistent or contradictory, here, the relevant materials clearly indicate that a “natural born Citizen” means a citizen from birth with no need to go through naturalization proceedings. . .\nRandy Barnett, Carmack Waterhouse Professor of Legal Theory at the Georgetown University School of Law, makes the point in National Review that “natural born citizen” means just that and is based on the British concept of “natural born subject” of the British Crown:\nThe term “natural born citizen” had no existence or independent original meaning prior to the moment it was included in the Constitution the United States was founded. It was adapted by the framers [of the Constitution] from the well-known British concept of the “natural born subject” of the sovereign monarch. England had numerous and changing legal rules governing exactly who was and who was not a “natural born subject,” which can be used to muddy the waters. But one consistently applied rule is particularly germane: The offspring of the King were natural born subjects of the King regardless of where they were born, whether on English territory or not.\nIn America the people are sovereign but the point remains the same. “Natural born” means born to a U.S. citizen anywhere in the world, whether on a plane flying over the Atlantic or in a caravan on the road to Morocco. The claim by Trump is what Ross Perot, whose third party candidacy in 1992 put Hillary Clinton’s husband in the White House, once referred to as “gorilla dust,” something thrown into the air to confuse and obstruct one’s opponent.\nThe question has been asked and answered. Ted Cruz is a natural born American citizen and is eligible to be President of the United States.\nDaniel John Sobieski is a free lance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/articles/2016/01/yes_ted_cruz_is_a_natural_born_citizen.html"}
