{"authors":[],"date_download":"2018-10-22 21:38:17","date_modify":"2018-10-22 21:38:17","date_publish":"2014-05-07 20:02:10","description":"Candy-flavored cigars, snuff and e-cigarettes seem to be flavored with ingredients used in Kool-Aid and Jolly Ranchers, a new study finds.","filename":"data/vaneerConsumption/YesThoseCandyFlavoredSmokesDoTasteLikeCandy.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_14/301851/2014-04-03t183944z_1_cbrea321fug00_rtroptp_3_usa-ecigarettes_70a85d3530e65ca15cf79e8594db5a54.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_kids-health_yes-those-candy-flavored-smokes-do-taste-candy-n99671_1540244297.html","title":"Yes, Those Candy-Flavored Smokes Do Taste Like Candy","title_page":"Yes, Those Candy-Flavored Smokes Do Taste Like Candy","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCandy-flavored cigars, snuff and e-cigarettes really do taste like candy, and they seem to be flavored with the same ingredients used in Kool-Aid, Jolly Ranchers and other kid-oriented treats, researchers reported on Wednesday.\nThe Food and Drug Administration has outlawed the use of candy and other flavorings, except menthol, in cigarettes, but hasn’t extended this ban to other tobacco products, not even in its decision last month to regulate cigars, hookah tobacco and e-cigarettes.\nThis outraged anti-tobacco campaigners, who accuse makers of these products of trying to hook teenagers on nicotine. But makers of e-cigarettes said even flavors such as bubble gum are aimed at adults, not kids.\nJames Pankow of Portland State University and colleagues decided to test whether the flavors were even close to products legally aimed at kids, such as Zotz candy.\nThey found many of the same chemical combinations in candy products and in the tobacco products, including benzaldehyde and benzyl alcohol.\n“What we are seeing is truly candy-flavored tobacco,” they wrote in a letter published in the New England Journal of Medicine. “The same familiar, chemical-specific flavor sensory cues that are associated with fruit flavors in popular candy and drink products are being exploited in the engineered designs of flavored tobacco products.”\nThis means the FDA needs to regulate these flavorings in cigars and e-cigarettes, said the American Cancer Society’s Cancer Action Network.\n“Candy flavorings are currently banned in cigarettes, but that ban does not extend to cigarillos, large cigars, roll-your-own tobacco, hookah tobacco and e-cigarettes, all of which are growing in popularity among youth,” said Chris Hansen, president of lobbying arm of the American Cancer Society.\n“In fact, a recent study by the Centers for Disease Control and Prevention found that more than 40 percent of current middle and high school students who smoke use flavored smoking products such as small cigars or menthol flavored cigarettes,\" Hansen added.\n\"There is growing concern that flavorings such as grape and cherry, and others with appealing names including ‘brownie’ and ‘gummy bear’, now found in many small cigars, hookah tobacco and e-cigarettes, can entice youth to try these products and potentially lead to a life-long, deadly addiction.\"","url":"https://www.nbcnews.com/health/kids-health/yes-those-candy-flavored-smokes-do-taste-candy-n99671"}
