{"authors":["John J. Xenakis"],"date_download":"2018-10-30 17:54:23","date_modify":"2018-10-30 17:54:23","date_publish":"2016-03-14 13:26:16","description":"Contents: Yet another terrorist bombing in Ankara Turkey kills 34; AQIM takes credit for armed terror attack on Ivory Coast beach resort |","filename":"data/vaneerConsumption/YetAnotherTerroristBombinginAnkaraTurkeyKills34.json","image_url":"https://media.breitbart.com/media/2016/03/afp_7f063516d8715a3144b0073da6b1f0b655b1e52a-e1457961968689.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_14__1540922063.html","title":"Yet Another Terrorist Bombing in Ankara Turkey Kills 34","title_page":"Yet Another Terrorist Bombing in Ankara Turkey Kills 34","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nYet another terrorist bombing in Ankara Turkey kills 34\nAQIM takes credit for armed terror attack on Ivory Coast beach resort\nYet another terrorist bombing in Ankara Turkey kills 34\nFootage from central Ankara just before and just after the bomb went off\nA suicide car bomb exploded in central Ankara in Turkey on Sunday, killing at least 34 people and wounding 125.\nTurkey has been reeling from a series of suicide bombing attacks in the last five months. On February 17, 29 were killed in a car bombing targeting the Turkish military in Ankara. A branch of the Kurdish separatist terror party, PKK, took credit. On January 12, a suicide attack blamed on the so-called Islamic State (IS or ISIS or ISIL or Daesh) killed eleven German tourists in Istanbul. On October 10, 103 people were killed in twin suicide bombings targeting a pro-Kurdish peace rally in Ankara.\nAfter a massive terror attack in July of last year in the town of Suruç on the border with Syria, Turkey declared war on PKK, ending a ceasefire agreement that had been in effect since 2012. Turkish troops began attacking PKK strongholds in southeast Turkey and northern Iraq, and Turkey’s president Recep Tayyip Erdogan promised to defeat the PKK. Now, after several further massive terror attacks on an almost monthly basis, Erdogan is becoming increasingly belligerent.\nTwo weeks ago, Turkey shut down the main opposition newspaper. ( “6-Mar-16 World View — Turkey’s ‘shameful day for free press’ as government seizes Zaman media”)\nThat act obviously did nothing to prevent Sunday’s terror attack on central Ankara, although it does make it more difficult anyone to know what’s going on in Turkey. That was all the more clear on Sunday when the government shut down access to social media, including Facebook and Twitter.\nEither the PKK or ISIS is the likely perpetrator. Nobody has claimed credit yet for Sunday’s attack, but Turkish officials are suggesting that the bomb was similar to the bomb used in the February 17 attack, for which a branch of the PKK claimed credit. Erdogan issued this statement:\nOur state will never give up its right to self-defense against all kinds of terror threats. Terror organizations and their pawns are targeting our innocent citizens in the most immoral and heartless way as they lose the fight against our security forces. Terror attacks – which intend to target the integrity of Turkey, unity and solidarity of our people – do not diminish our will to fight against terror, but further boost it. [The country’s fight against terrorism will] successfully conclude by bringing down terror to its heel.\nI doubt that anyone seriously believes that. Hurriyet (Ankara) and Anadolu (Turkey) and Reuters\nAQIM takes credit for armed terror attack on Ivory Coast beach resort\nAl-Qaeda on the Islamic Maghreb (AQIM), the North African branch of al-Qaeda, claimed credit for an attack by armed gunmen at a beach resort in the town of Grand-Bassam in Côte d’Ivoire (Ivory Coast) on Sunday. There were 14 civilians, two special forces, and six assailants killed in the assault and subsequent gunfight when security forces arrived.\nTourists are increasingly under attack by jihadists in Africa. ISIS was responsible for several terrorist attacks in Tunisia last year. AQIM, whose roots are in Algeria, has been focusing on tourist sites in former French colonies. It attacked a hotel in Mali in November, and then a hotel and cafe in Burkina Faso in January. Côte d’Ivoire borders both of those countries, and it was feared that AQIM would strike there next, as happened on Sunday.\nAQIM had been slowing down its activities until recent months. The escalation of AQIM’s operations coincides with the rise of ISIS in Libya, and it’s thought that AQIM and ISIS are in competition. CNN and AP\nKEYS: Generational Dynamics, Turkey, Ankara, Recep Tayyip Erdogan, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh, Kurdistan Workers’ Party, PKK, Ivory Coast, Côte d’Ivoire, Al-Qaeda on the Islamic Maghreb, AQIM, Algeria, Mali, Burkina Faso, Tunisia\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2016/03/14/14-mar-16-world-view-yet-another-terrorist-bombing-in-ankara-turkey-kills-34/"}
