{"authors":["Pa Reporter"],"date_download":"2018-10-23 03:00:56","date_modify":"2018-10-23 03:00:56","date_publish":"2017-03-16 13:44:33","description":"Yorkhill held off a late charge from Top Notch to win the JLT Novices Chase at Cheltenham, handing trainer Willie Mullins his first victory of the festival.","filename":"data/vaneerConsumption/YorkhillwinstheJLTNovicesChaseatCheltenham.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E5485C500000578-0-image-a-129_1489671797054.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_racing_article-4320362_Yorkhill-wins-JLT-Novices-Chase-Cheltenham_1540263656.html","title":"Yorkhill wins the JLT Novices Chase at Cheltenham","title_page":"Yorkhill wins the JLT Novices Chase at Cheltenham | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Yorkhill gave trainer Willie Mullins and jockey Ruby Walsh a belated first winner of this year's Cheltenham Festival when winning a dramatic race for the JLT Novices' Chase.\nWalsh had Graham Wylie's seven-year-old switched off at the back of the field as Balko Des Flos made the running.\nBaily Cloud fell six out and badly hampered Flying Angel, and the complexion of the race changed even more when Balko Des Flos came down at the fourth-last with Yorkhill doing well to avoid him.\nYorkhill, ridden by Ruby Walsh, won the JLT Novices Chase at Cheltenham on Thursday\nWalsh did well to avoid two fallers during the race before sealing victory on the 6-4 favourite\nHis exit saw Disko go on but Top Notch, Kilcrea Vale and Yorkhill were also bang there and it was the latter who showed his class.\nLeading before the final fence, the 6-4 favourite had to be driven out to hold Top Notch by a length, with Disko three lengths away in third.\nWalsh said: 'There's been a lot of toing and froing about whether to go chasing or stay hurdling, but he's got Gold Cup horse written all over him and always had.\n'People crab him because of his jumping, but he has a huge kink in him - people never realised the job Paul Nicholls did with Denman, because he was the same.\n'Both are chestnuts by Presenting, the best ones all have a kink, he has a massive engine. He's brilliant.\n'He slipped taking off at the first down the back and when he landed I thought 'your luck could be in today'.\nRuby Walsh (second left) poses with Yorkhill and trainer Willie Mullins (third right)\n'Everything can't go your way all the time and you have to prepare for that.'\nMullins said: 'To get on the board is huge. To get on the board in a Grade One is better. It's good for Ruby and the whole team.\n'We've had a hard few days, but that's the way it is and we take what we can get.'","url":"https://www.dailymail.co.uk/sport/racing/article-4320362/Yorkhill-wins-JLT-Novices-Chase-Cheltenham.html"}
