{"authors":[],"date_download":"2018-10-22 20:57:57","date_modify":"2018-10-22 20:57:57","date_publish":"2014-05-05 14:02:47","description":"Sorry, drones: You're no longer welcome in Yosemite National Park, which wants tall trees and soaring birds to be the only items occupying the air.","filename":"data/vaneerConsumption/YosemiteBansDronesOfAllShapesAndSizesFromPark.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/330831/140417-drone-privacy-1455_8429d9ee2ba39bdee431ab2b73279942.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_innovation_yosemite-bans-drones-all-shapes-sizes-park-n97211_1540241877.html","title":"Yosemite Bans Drones 'Of All Shapes And Sizes' From Park","title_page":"Yosemite Bans Drones 'Of All Shapes And Sizes' From Park","title_rss":"NULL","source_domain":"nbcnews.com","text":"But the service is choosing to enforce that law now, in Yosemite, because more park visitors have begun using drones within the last few years -- particularly to film aerial footage of the park and people who are climbing.\nThat's a problem for Yosemite for several reasons, the Park Service said. Drones can be noisy, they can ruin the experience for other visitors and they don't exactly blend in with the great outdoors. The aircraft can also harm wildlife in Yosemite, and interfere with emergency services, the Park Service added.\nThe Yosemite ban is just a small part of the growing debate over drones as the unmanned vehicles have become more mainstream.\nGoogle and Facebook each bought drone companies recently, and Amazon is pushing its concept for delivering packages to customers via unmanned vehicles.\nThe Federal Aviation Administration, which regulates American airspace, is expected to finalize commercial drone regulations in 2015. Rules for drones under 55 pounds could come before the end of 2014. The agency announced last month that North Dakota will be the first of six sites chosen for drone research.\nBut until the new rules come down, the current drone landscape remains confusing. In March an administrative law judge threw out a ruling against a man fined for operating a drone, saying the FAA doesn't have authority in the space -- because it hasn't written rules specific to governing drones.","url":"https://www.nbcnews.com/tech/innovation/yosemite-bans-drones-all-shapes-sizes-park-n97211"}
