{"authors":["Allum Bokhari"],"date_download":"2018-10-30 21:13:05","date_modify":"2018-10-30 21:13:05","date_publish":"2016-01-21 23:05:46","description":"A new browser-based game, \"Stump The Trump\" allows you to kill Republican frontrunner Donald Trump by dropping a large tree stump on him. His death is |","filename":"data/vaneerConsumption/YouCanBrutallyKillDonaldTrumpInANewVideoGameProgressiveOutrageNowhereToBeFound.json","image_url":"https://media.breitbart.com/media/2016/01/Un343435d.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_01_21__1540933985.html","title":"You Can Brutally Kill Donald Trump In A New Video Game. Progressive Outrage Nowhere To Be Found.","title_page":"You Can Brutally Kill Donald Trump In A New Video Game. Progressive Outrage Nowhere To Be Found. | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A new browser-based game, “Stump The Trump” allows you to kill Republican frontrunner Donald Trump by dropping a large tree stump on him.\nHis death is depicted in bloody, gory, detail. Progressives, liberals, and feminists, who have previously been enraged by video games depicting violence against their own political icons, have so far said nothing.\nIf you’re unfortunate enough to have followed progressive-feminist outrage over video games over the past few years, you are likely to have encountered the “Beat Up Anita Sarkeesian” game. The amateur video game allows players to punch a picture of feminist provocateur Anita Sarkeesian until she’s blue in the face.\nIt was held up as a prime example of society’s deep-rooted misogyny, with thousands of column inches spent condemning the game and the people who made it. Feminist activists plotted a vast, online public shaming campaign to ruin the life of the young game developer who created it.\nYet “Stump The Trump” depicts equally, if not more gruesome violence against the presidential frontrunner. The browser-based game is a bloody, side-scrolling whack-a-mole. Players have to stop an army of Trumps from crossing the screen by dropping large tree stumps on them.\nIf you’re particularly skilled, you can even hit multiple Trumps with a single stump. The more Trumps you stop, the higher your score – although if you let one through, it’s game over.\nThe game depicts Trump’s death in cartoonishly gory detail. Once hit, Trump is immediately squashed into a pool of blood, and the candidate’s limbs go flying everywhere.\nThe game, which can be played at www.stumpthetrump2016.com, is clearly not a serious threat of violence. But then again, neither was “Beat Up Anita Sarkeesian.” As always, there’s very little consistency to the outrage of social justice warriors.\nFollow Allum Bokhari @LibertarianBlue on Twitter, and download Milo Alert! for Android to be kept up to date on his latest articles.","url":"https://www.breitbart.com/tech/2016/01/21/video-game-allows-you-to-brutally-murder-donald-trump-progressive-outrage-not-forthcoming/"}
