{"authors":["Associated Press"],"date_download":"2018-10-22 21:36:51","date_modify":"2018-10-22 21:36:51","date_publish":"2016-01-28 08:25:51","description":"PHILADELPHIA (AP) — Nellie Fitzpatrick raised the Philadelphia Flyers jersey presented to her as the team's \"community teammate\" of the night, turned her hea...","filename":"data/vaneerConsumption/YouCanPlaycallsonNHLplayersfanstofighthomophobia.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420477_You-Can-Play-calls-NHL-players-fans-fight-homophobia_1540244211.html","title":"You Can Play calls on NHL players, fans to fight homophobia","title_page":"You Can Play calls on NHL players, fans to fight homophobia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"You Can Play calls on NHL players, fans to fight homophobia\nPHILADELPHIA (AP) — Nellie Fitzpatrick raised the Philadelphia Flyers jersey presented to her as the team's \"community teammate\" of the night, turned her head to her left and smooched her wife right on the lips.\nMuch like salutes to veterans, youth hockey players and other celebrated guests, Fitzpatrick's kiss was shown for everyone in the arena to see on the overhead videoboard.\nThe reaction from nearly 20,000 fans for two women that shared a brief kiss was, well, silence.\nBoos were saved for the Boston Bruins, jeers for the referees.\n\"It was funny, a lot of community members started texting me, 'I'm sitting in the stands around presumably straight people and nobody said anything,'\" Fitzpatrick said afterward with a laugh. \"It was just another married couple, I guess, kissing on the Jumbotron.\"\nFitzpatrick, director of the mayor's Office of LGBT Affairs, was honored during the Flyers' first You Can Play night event. The Flyers celebrated the You Can Play Project, which aims to ensure equality, respect and safety for all athletes, without regard to sexual orientation. Fitzpatrick was part of a group that included Flyers representatives and about 30 LGBT members — 120 tickets were sold — who met for drinks and food before the game.\n\"You have certain stereotypes in mind, certain concerns as a member of the LBGT community, whether you're someone who wants to play the sport or wants to go see the sport, about how you may be treated or perceived,\" she said. \"I have to say, it's a pretty empowering and awesome message that, not just the Flyers, but the entire NHL is stepping up and making sure to absolutely everyone that all that matters is that you love hockey.\"\nThat's the basic message You Can Play has tried to spread since its inception four years ago. The advocacy group has partnered with all 30 NHL teams and had hockey Olympians, All-Stars and team captains voice acceptance of the LBGT community and take a stand to fight homophobia.\nRick Nash, Claude Giroux and Henrik Lundqvist are among the stars who have taped public service announcements.\n\"It was about starting the conversation about LBGT inclusion in sports,\" YCP co-founder Patrick Burke said. \"Now we're almost four years in, it's no longer starting the conversation, it's about what's the next level of conversation. It's engaging with fans, letting them know, hey, you shouldn't be yelling out homophobic or sexist stuff. Just because you've got a ticket, it doesn't give you a right to yell that.\"\nBurke founded the You Can Play project along with Brian Kitts and Glenn Witman, who run a Denver-based gay hockey team called GForce. Burke's brother, Brendan, made headlines when he came out in November 2009 while serving as the manager of Miami of Ohio's college hockey team. He was killed in a February 2010 car crash at age 21.\nPatrick Burke, who also works in the NHL's player safety office, has championed the LBGT cause and You Can Play has the full support of the NHL in a time of changing attitudes toward the community, particularly gay marriage.\n\"We're hearing from our stakeholders in the hockey community that they want us to be doing more,\" NHL executive Jessica Berman said. \"It goes to two core pieces: education and raising awareness. We're working with You Can Play on educational programs across the board.\"\nThe NHL has never had an openly gay player. NBA player Jason Collins played only a handful of games and his career ended not long after he came out as gay. Michael Sam, out of Missouri, was the first publicly gay player to be drafted in the NFL. He never got beyond the practice squad. Major League Baseball has never had an openly gay player.\nBurke, who said he has met gay NHL players through the years, believes YCP would help should a player feel ready to come out.\n\"I think the league is ready,\" he said. \"I think when a player does choose to come out, he's going to be met with overwhelming support. I think he's going to be surprised and touched by the amount of support he gets. But until that player is personally ready, it's really just a waiting game for us.\"\nAn openly gay player is not the barometer for You Can Play's success, rather the encouragement of creating fairness in the locker room.\nNashville and the New York Islanders will host You Can Play nights on Feb. 2. The Florida Panthers, Los Angeles Kings, Minnesota Wild and San Jose Sharks also have YCP games on the agenda this season.\n\"You don't know when you're going to get to somebody when they need it most,\" YCP vice president Jillian Svensson said.\nThe New York Giants in October became the first NFL team to film a You Can Play video. Major League Soccer also has a partnership with You Can Play. The Edmonton Oilers supported the cause and wrapped their sticks in rainbow colored Pride Tape during their annual skills competition Sunday at Rexall Place.\n\"This conversation wouldn't have been had when I started playing hockey, especially telling guys to go into a room and put rainbow tape on a stick,\" Oilers defenseman Andrew Ference said. \"It just speaks to the progress that's been made, how amazing that You Can Play has done it in kind of bringing guys around to the conversation.\"\n___\nOnline:\nYou Can Play: http://youcanplayproject.org/","url":"https://www.dailymail.co.uk/wires/ap/article-3420477/You-Can-Play-calls-NHL-players-fans-fight-homophobia.html"}
