{"authors":[],"date_download":"2018-10-30 01:05:16","date_modify":"2018-10-30 01:05:16","date_publish":"2018-09-16 00:01:58","description":"What is a racist? There was a time when the answer to that question was pretty clear-cut. A racist was someone who joined a group like the Ku Klux Klan, spewed racial slurs, or supported segregation. A racist was someone who thought that people of other races were inherently inferior.","filename":"data/vaneerConsumption/YouDontHaveToBeaBigotToBeaRacistAnymore.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/1024px-David_Horowitz_5450881229.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861516.html","title":"You Don’t Have To Be a Bigot To Be a Racist Anymore","title_page":"You Don’t Have To Be a Bigot To Be a Racist AnymoreThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Washington\nWhat is a racist? There was a time when the answer to that question was pretty clear-cut. A racist was someone who joined a group like the Ku Klux Klan, spewed racial slurs, or supported segregation. A racist was someone who thought that people of other races were inherently inferior.\nIn the last decade or so, that’s changed. In a time of expanding definitions, you don’t have to be a bigot to be a racist anymore. You just have to have the wrong politics to be branded a racist, or race-baiter or race warrior. Or you can just be associated with someone who has the wrong politics.\nThe Southern Poverty Law Center has listed David Horowitz, 79, a former 1960s radical turned conservative, as an extremist and “driving force” in the “anti-black” movement.\nOn Monday, the Washington Post ran a front-page story that reported that Ron DeSantis, the GOP candidate for governor in Florida, “spoke at racially-charged events” — that is, he spoke at four conferences put on by the David Horowitz Freedom Center.\nWhat makes Horowitz anti-black? He is “a vocal opponent of reparations for slavery,” the Southern Poverty Law Center wrote.\nHe also makes provocative statements. Like this one: “Unfortunately, as a nation we have become so trapped in the melodrama of black victimization and white oppression that we are in danger of losing all sense of proportion. If blacks are oppressed in America, why isn’t there a black exodus?”\nHorowitz’s tone can be insensitive. I think he’s dead wrong to dismiss black grievances as melodramatic and I believe he overstates white grievances. He has written things that make me cringe, but I’ve known him for years and he is no white supremacist. In fact, Horowitz was collaborating with the Black Panthers on a learning center in 1974, when a colleague was murdered; he blamed the group for her death and began to move away from the left.\nOnce the SPLC labeled Horowitz as an extremist, he was supposed to become so radioactive that others would associate with him at their own peril. As DeSantis learned. According to the Washington Post, you see, DeSantis not only spoke at Horowitz events, he also “recently was accused of using racially tinged language.”\nAfter he won the GOP primary, DeSantis called his African-American Democratic opponent, Tallahassee Mayor Andrew Gillum “articulate.” The Republican also told Fox News that the last thing Floridians need is “to monkey this up by trying to embrace a socialist agenda.”\n“Monkey,” critics argued, is a racist dog whistle.\n“Articulate” is racist because it can be condescending — as Sen. Joe Biden, D-Del., learned in 2007 after he praised colleague Barack Obama as the “first mainstream African-American who is articulate and bright and clean and a nice-looking guy.” Biden apologized. Obama later picked Biden to be his running mate in 2008.\nDeSantis said his “monkey” remark had nothing to do with race. Without proof, one would expect DeSantis to enjoy the benefit of the doubt. Instead he got a front-page story that implied he’s a race-baiter because he spoke at conservative confabs.\nMark Krikorian is executive director of the Center for Immigration Studies, a pro-enforcement group branded a “hate group” by the SPLC. He sees the SPLC as a left-wing political organization now dedicated to marginalizing ideas that used to be mainstream.\nPoliticians like former President Bill Clinton, Sen. Dianne Feinstein, D-Calif., and the late Rep. Barbara Jordan, D-Texas, used to support enforcing immigration laws. Today, Krikorian said, their positions would be “branded as hate speech” by the SPLC.\nThe SPLC also charged Horowitz with hating Muslims because of his harsh criticism of radical Islamic terrorism and Palestinian groups opposed to Israel.\nAs a proof, the SPLC includes this statement, which really is a political argument: “The difference between Islamic fanatics, or Jew haters, and Hitler is that Hitler hid the Final Solution, and the Iranians and Hezbollah shout it from the rooftops. And the whole Muslim world accepts it.”\nAnd here’s how you know the SPLC’s labeling is highly partisan. In 2016, Richard Cohen, the group’s president, wrote a piece titled, “Black Lives Matter is not a hate group.”\n“There’s no doubt that some protesters who claim the mantle of Black Lives Matter have said offensive things, like the chant, ‘pigs in a blanket, fry ’em like bacon’ that was heard at one rally,” Cohen wrote. “But before we condemn the entire movement for the words of a few, we should ask ourselves whether we would also condemn the entire Republican Party for the racist words of its presumptive nominee — or for the racist rhetoric of many other politicians in the party over the course of years.”\nNo, the SPLC would never condemn the entire GOP as racist because of Donald Trump. Better to cook the frog slowly. Start by isolating David Horowitz. Then let the r-word hang over anyone who associates with him. And then see where that goes.\nContact Debra J. Saunders at dsaunders@reviewjournal.com or 202-662-7391. Follow @DebraJSaunders on Twitter.\nCOPYRIGHT 2018 CREATORS.COM","url":"https://spectator.org/you-dont-have-to-be-a-bigot-to-be-a-racist-anymore/"}
