{"authors":["William Bigelow"],"date_download":"2018-10-30 18:25:21","date_modify":"2018-10-30 18:25:21","date_publish":"2016-01-20 18:23:38","description":"As Barack Obama starts his last year in office, the terrible financial position of young Americans under the Obama Administration was delineated in a new report from Young America’s Foundation. |","filename":"data/vaneerConsumption/YoungAmericasFoundationYouthMiseryIndexSkyHigh.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_20__1540923921.html","title":"Young America’s Foundation: Youth Misery Index Sky-High","title_page":"Young America’s Foundation: Youth Misery Index Sky-High | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"As Barack Obama starts his last year in office, the terrible financial position of young Americans under the Obama Administration was delineated in a new report from Young America’s Foundation.\nThe Youth Misery Index (YMI), a sum totaled from youth unemployment, student loan debt, and national debt (per capita) soared to its highest level during Obama’s tenure.\nThe YMI reached 109.9 this year; one year ago it was 106.5. When Obama took over from George W. Bush the score was 83.5. That means the YMI has skyrocketed 32% during Obama’s terms as president.\nThe youth unemployment rate presently exceeds 16 percent; the average student loan debt of a 2015 college graduate reached a record level of $35,000; national debt per capita, as YMI states, is “a remarkable burden that will fall squarely on the shoulders of millennials,” has almost reached $59,000.\nYoung America’s Foundation recently polled college students and found that their top three issues of concern were (1) education, (2) student loan debt, and (3) jobs. The same poll discovered college students, in a 2 to 1 ratio, believe the government should stay out of people’s lives; 35% prefer free markets to government regulations, while only 16% want government regulations. Forty-eight percent thought a “strong free market” handles economic problems better than a “strong/active government;” 39% disagreed.\nRon Robinson, president of Young America’s Foundation, asserted, “President Obama’s tenure has been disastrous for young Americans. They’re ready for change, and conservative ideas offer substantive solutions to the serious challenges they face.”\nThe youth of America have suffered for years under Obama; in August 2014, the Department of Labor (DOL) reported that the youth unemployment rate for the 16-19 age group was a paltry 29.9%, for those aged 20-24, 65%, meaning at least one third of normal college graduates could not find work. The DOL reported in July 2015, “Unemployment among youth rose by 654,000 from April to July 2015, compared with an increase of 913,000 for the same period in 2014.”","url":"https://www.breitbart.com/politics/2016/01/20/young-americas-foundation/"}
