{"authors":[],"date_download":"2018-10-22 21:26:44","date_modify":"2018-10-22 21:26:44","date_publish":"2014-05-07 12:09:21","description":"As Latinos leave the Catholic Church virtually all of the net change among Hispanics 18-29 years old has been toward no religious affiliation.","filename":"data/vaneerConsumption/YoungLatinosLeaveCatholicismforNoReligiousAffiliation.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/425561/140507-latinos-catholics-mn-805_ef007a555161ad7089a97a3b95b103d3.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_young-latinos-leave-catholicism-no-religious-affiliation-n99041_1540243604.html","title":"Young Latinos Leave Catholicism for No Religious Affiliation","title_page":"Young Latinos Leave Catholicism for No Religious Affiliation","title_rss":"NULL","source_domain":"nbcnews.com","text":"When you start talking about religion with a Latino, increasingly that Latino may not be Catholic, but that non-Catholic Latino is almost as likely to be Protestant as to have no affiliation with organized religion.\nHow old that Latino is might change the odds, although whether the Latino is born in the U.S. or outside the country won’t be as much of an influencing factor.\nThe latest Pew Research Center religion report finds that more than half, 55 percent, of Latinos nationally are Catholic, down from 67 percent in 2010. In fact, nearly one-in-four Hispanic adults (24 percent) are now former Catholics.\nBut Latinos aren’t flocking to Protestant religions as they leave Catholicism. About 22 percent of Latinos today are Protestant and about 18 percent consider themselves religiously unaffiliated.\nThat’s a striking difference from the broader general population, where a growing share are religiously unaffiliated, but there is not similar growth overall in the share that is Protestant, said Jessica Martinez, an author of the Pew study released Tuesday.\n“If you are looking at the overall religious profile for the general public, close to half identify as Protestant and one in five identify as Catholic,” Martinez said. “For Hispanics, more than half are Catholic and one in five is Protestant.”\nOver time, there is more change in religious affiliation among Latinos under age 50, Martinez said. Latinos who are 18-29 years old are overwhelmingly becoming unaffiliated with a religion, she said.\nLatinos who are 18-29 years old are overwhelmingly becoming unaffiliated with a religion, the Pew poll found.\nAmong those ages 30-49, there is a similar decline in the share of Catholics, but a corresponding growth in the share of those who are religiously unaffiliated and those who are Protestant. There’s no statistically significant change in Latinos 50 and older.\nMartinez said the trend certainly is influenced by changes in U.S. society, but she said the departure from the church is being seen in both U.S.-born and foreign-born Latinos.\n“Among the foreign born, if you ask if the change occurred here in the U.S. or before, half say here but almost as many say the change came before coming to the U.S.,” Martinez said.\nA recent survey by a Chile-released pollster found that despite the popularity of Pope Francis, Latin Americans’ affiliation with the Roman Catholic Church has been dropping. Meanwhile there has been a rise in evangelism in Latin America.\nAlthough Pew did not connect its research to immigration reform because it does not take political positions, evangelical and Protestant churches increasingly are weighing in on the immigration reform debate and pressing Republicans for movement on legislation. The Catholic Church has long been a supporter of and activist on immigration reform.","url":"https://www.nbcnews.com/news/latino/young-latinos-leave-catholicism-no-religious-affiliation-n99041"}
