{"authors":["Julia Hahn"],"date_download":"2018-10-30 18:48:43","date_modify":"2018-10-30 18:48:43","date_publish":"2017-01-05 23:09:43","description":"Young conservative activists staged an intervention in New York City for attendees at the roughly $700-a-ticket Hamilton musical on Broadway, whose hip-hop mash-up of real history with far-left propaganda lets wealthy Democrats reimagine the nation’s founding father through a progressive lens—rather than the real Hamilton, who was a nationalist and whose views on immigration, assimilation, and national identity more closely align with the President-elect and figures like Pat Buchanan. | Politics","filename":"data/vaneerConsumption/YoungConservativesEducateHamiltonAttendeesonFoundingFathersTrueViewsonImmigration.json","image_url":"https://media.breitbart.com/media/2017/01/Conservatives-at-Hamilton.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_01_05__1540925323.html","title":"Young Conservatives Educate 'Hamilton' Attendees on Founding Father's True Views on Immigration","title_page":"Young Conservatives Educate 'Hamilton' Attendees on Founding Father's True Views on Immigration | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Young conservative activists staged an intervention in New York City for attendees at the roughly $700-a-ticket Hamilton musical on Broadway, whose hip-hop mash-up of real history with far-left propaganda lets wealthy Democrats reimagine the nation’s founding father through a progressive lens—rather than the real Hamilton, who was a nationalist and whose views on immigration, assimilation, and national identity more closely align with the President-elect and figures like Pat Buchanan.\n“It was shocking to see people’s reaction when we educated them about Hamilton’s true feelings [about immigration] as they left the theatre,” said Turning Point USA founder Charlie Kirk, whose group distributed pamphlets to attendees which included real quotes about immigration from Alexander Hamilton. “The reaction was mostly shock and disbelief as they read the playbill we made,” he said.\n“A lady from California who was there to see the play with her family was absolutely stunned when she saw our pamphlets and materials,” Thomas Hern, the Deputy National Field Director of Turning Point USA, told Breitbart. “This project opened up so many eyes.”\nKirk staged the intervention after the Broadway cast bullied Vice President-elect Mike Pence during the curtain call of a November performance, in which the cast lectured Pence to “hear us out” after the Vice President-elect had just spent over two hours listening to them.\nAs attendees stood in line for the hit musical over the holidays, the young conservatives distributed their own “playbills” to elucidate Hamilton’s true views on the seminal issue of immigration— an issue on which, the young conservatives argue, Hamilton’s views align more closely with those held by the President-elect than those held by the Broadway actors who dress up like founding fathers.\n“We did this project as a way to educate the people going to see “Hamilton” about the truth about Alexander Hamilton,” said Kirk. “The way the play is written, Hamilton comes across a lot differently than his actual feelings on subjects like immigration and the electoral college. This project is aimed at educating people about how Hamilton really felt about today’s most controversial political issues.”\nHamilton was “very skeptical” about large influxes of foreign migration to the United States and “spoke strongly about the chances of America losing its culture,” Kirk said.\nThe conservative’s “playbill” points specifically to Hamilton’s writings in The Examination Number VIII, in which he addressed “the consequences that must result from a too unqualified admission of foreigners, to an equal participation in our civil, and political rights.”\nIn 1802, Hamilton wrote:\nThe safety of a republic depends essentially on the energy of a common National sentiment; on a uniformity of principles and habits; on the exemption of the citizens from foreign bias, and prejudice; and on that love of country which will almost invariably be found to be closely connected with birth, education and family… foreigners will generally be apt to bring with them attachments to the persons they have left behind; to the country of their nativity, and to its particular customs and manners. They will also entertain opinions on government congenial with those under which they have lived, or if they should be led hither from a preference to ours, how extremely unlikely is it that they will bring with them that temperate love of liberty, so essential to real republicanism?\nHamilton continued:\nThe influx of foreigners must, therefore, tend to produce a heterogeneous compound; to change and corrupt the national spirit; to complicate and confound public opinion; to introduce foreign propensities. In the composition of society, the harmony of the ingredients is all important, and whatever tends to a discordant intermixture must have an injurious tendency. The United States have already felt the evils of incorporating a large number of foreigners into their national mass; it has served very much to divide the community and to distract our councils, by promoting in different classes different predilections in favor of particular foreign nations, and antipathies against others. It has been often likely to compromit the interests of our own country in favor of another. In times of great public danger there is always a numerous body of men, of whom there may be just grounds of distrust; the suspicion alone weakens the strength of the nation, but their force may be actually employed in assisting an invader.\n“To admit foreigners indiscriminately to the rights of citizens, the moment they put foot in our country… would be nothing less, than to admit the Grecian Horse into the Citadel of our Liberty and Sovereignty,” Hamilton concluded.\nHamilton Handbill_tri Fold-2 by Breitbart News on Scribd\nThe activists additionally created a website that highlights Hamilton’s true views on these political issues.\nThe students’ frustrations about the musical’s distortion of the views of one of the nation’s founding fathers has been echoed by other prominent conservatives.\n“Do you know that Alexander Hamilton was an immigration hawk?” Rush Limbaugh told his audience after the Broadway cast hectored Pence in November. “I wonder if the people in this cast have any idea who they are lionizing and celebrating. This guy’s Donald Trump,” Limbaugh said.\nSimilarly, on trade — the President-elect’s other signature campaign issue — Trump’s America First trade policy is in keeping with Alexander Hamilton’s more protectionist economic system that the nation was founded upon and whose greatest defenders would become Abraham Lincoln’s Republican Party.\nClyde Prestowtiz, the counselor to the Secretary of Commerce under President Reagan, has explained in his 1791 Report on Manufactures: Hamilton, our nation’s first Secretary of Treasury, laid out a proposal that followed the “English mercantilist model closely” by calling for high tariffs to protect nascent American industry, supporting agriculture to encourage more exports, promoting “Buy American” policies, and allocating federal funds for transit systems to facilitate commerce such as roads, bridges, and harbors.\nRobert Lighthizer, who on Tuesday was tapped by President-elect Trump to serve as his U.S. Trade Representative, has previously written about how Trump’s views on trade align with those of Hamilton, whom Lighthizer has argued “could be considered the founder of American conservatism.” In a 2011 op-ed titled, “Donald Trump is no liberal on trade,” Lighthizer wrote:\nAt the beginning of this nation, Alexander Hamilton and his followers were staunch conservatives who helped found American capitalism – and avowed protectionists… During the first half of the 19th century, pro-business politicians like Henry Clay were ardent supporters of an “American system” that would use tariffs to promote American industry. Clay’s political descendents – such as Abraham Lincoln – went on to form the Republican Party. Every Republican president starting with Lincoln – and for almost 100 years thereafter – generally supported tariffs.\nIronically, polling data seems to suggest that black and Hispanic voters, for whom the Broadway actors claim to speak, similarly support more restrictionist immigration policies championed by Trump rather than the expansionist policies that the actors seem to support.","url":"https://www.breitbart.com/politics/2017/01/05/young-conservatives-educate-hamilton-attendees-founding-fathers-true-views-immigration-politics/"}
