{"authors":["George Odling For The Daily Mail"],"date_download":"2018-10-23 00:22:50","date_modify":"2018-10-23 00:22:50","date_publish":"2017-03-16 09:42:19","description":"Concerns about body image, ageing and nudity have become so pressing that the performers’ union Equity proposed a motion calling for specialist mental health support.","filename":"data/vaneerConsumption/Youngactressespressuredtoperformnudescenes.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E53285400000578-0-image-a-5_1489657333201.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319420_Young-actresses-pressured-perform-nude-scenes_1540254170.html","title":"Young actresses pressured to perform nude scenes","title_page":"Young actresses pressured to perform nude scenes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Actresses need special mental health support to help them cope with the pressure to stay thin and attractive, according to the performers’ union.\nConcerns about body image, ageing and nudity have become so pressing that the Equity committee proposed a motion calling for specialist mental health support.\nYoung actresses are expected to do more nude scenes than ever before, and women in their 30s are considered too old to star alongside men almost twice their age, Equity members said.\nActresses need special mental health support to help them cope with the pressure to stay thin and attractive, according to the performers’ union (stock image)\n‘Young women in particular are pressured to have “the right look” or to be “the right size” and to blend in with a body image that is deemed acceptable and that supposedly will help them succeed in their career,’ the motion said.\n‘Alongside the financial worries of getting a job, finding an agent and just coping with living, it’s no wonder some cannot cope.’\nRada graduate Rosie Hilal, who acted alongside Olivia Colman in 2015’s London Road, told the Trade Union Congress Women’s Conference that auditions and acting jobs themselves were often depressing experiences for young actresses.\nShe said: ‘The body and beauty ideals they are expected to live up to, while hiding any trace of their actual intelligence and capabilities as a human being, are very often demeaning, even in the supposedly high end of movie making.\n‘In our job, actresses of 23 are asked to play mothers, while actresses who are mothers are considered too old to play mothers.\n‘Actresses of 33 are considered too old to play opposite male actors in their fifties. The list of outrageous practices goes on.’\nFormer The Bill and Grange Hill actress Sue McGoun said in the past it was often simply a case of writing to a director in order to secure an audition.\nConcerns about body image, ageing and nudity have become so pressing that the Equity committee proposed a motion calling for specialist mental health support (stock image)\n‘Nowadays you have to have an agent, you have to go through a casting director, so just trying to have a career and make the right decisions is tough. It is so difficult now,’ she told the Telegraph.\n‘On top of that is all the business of appearance.\n‘Only yesterday I heard of a casting director for a musical who had said, “We’ve seen people for the role but they were all a bit too plump. We really want somebody slim.”\n‘And now there is more and more nudity.\n‘A lot of people say they are going to auditions now and there is a lot of nudity, or you get the job and then you find you’re expected to do it.’\nThe motion called for the provision of somewhere actresses could go to discuss their experiences.","url":"https://www.dailymail.co.uk/news/article-4319420/Young-actresses-pressured-perform-nude-scenes.html"}
