{"authors":["Luke Augustus For Mailonline"],"date_download":"2018-10-23 02:37:07","date_modify":"2018-10-23 02:37:07","date_publish":"2016-01-28 17:34:03","description":"Becoming a professional footballer is the dream of most young boys, but for one fan it appears covering the beautiful game is his passion instead.","filename":"data/vaneerConsumption/YoungfaninterviewsMarkNobleforWestHamTVdanceswithAlexSongandshakesSergioAgueroshandduringManchesterCityvisittoUptonPark.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACC30700000578-0-image-a-5_1454004434972.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421336_Young-fan-interviews-Mark-Noble-West-Ham-TV-takeover-Junior-Journo-Manchester-City-draw-Upton-Park_1540262227.html","title":"Young fan interviews Mark Noble for West Ham TV, dances with Alex Song and shakes Sergio Aguero's hand during Manchester City visit to Upton Park","title_page":"Young fan interviews Mark Noble for West Ham TV, dances with Alex Song and shakes Sergio Aguero's hand during Manchester City visit to Upton Park | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Becoming a professional footballer is the dream of most young boys, but for one fan it appears covering the beautiful game is his passion instead.\nLewis Barr took control of West Ham TV during last Saturday's 2-2 draw against Manchester City as their new junior journalist.\nIn a new feature on the club's website, the happy Hammer lived out a fantasy many could only wish for as he reported on the match - meeting many of his heroes in the process too.\nYoung West Ham supporter Lewis Barr was their 'Junior Journo' against Manchester City last Saturday\nBarr received an autograph from West Ham playmaker Dimitri Payet before the Premier League encounter\nCity star striker Sergio Aguero shook the hand of the starstruck 10-year-old too ahead of the match\nOne of those was Dimitri Payet, who signed an autograph for the 10-year-old before the match. City's two-goal hero Sergio Aguero also greeted the youngster as he shook his hand on arrival to Upton Park.\nAfter the match, Barr shared a selfie with former West Ham midfielder Jack Collison before strutting his stuff with Alex Song too in a playful dance.\nHowever, the highlight for Barr was clearly speaking to captain Mark Noble in a post-match interview.\nBarr makes notes in the press area as the action unfolds during the match at Upton Park\nThe 10-year-old celebrates with his dad as Enner Valencia scores one of his two goals against City\nBarr's passion for the east London outfit is plain to see as he celebrates wildly with his father\nSitting next to Noble, Barr asked him his plans post-retirement as well as his views on the club's imminent move to the Olympic Stadium.\n'I just wanted to say thank you to West Ham as Saturday was the best day of my life and I couldn't wipe the smile off my face if I tried!' the young Barr reflected afterwards.\n'The day will be remembered forever. When I saw the players come in I was gobsmacked, I got to walk up to Sergio Aguero and say hello, I got to talk to and dance with Alex Song.\n'I really enjoyed walking pitch side before the game and watching the players train as well as having the camera by my side and giving my thoughts on the game.\n'I loved meeting Jack Collison who had a special honour at the game but my favourite part was when I met Mark Noble he was so kind and funny we had loads of jokes but this wouldn't have been possible without Sophie, Matt and James my cameraman and my dad who took me.'","url":"https://www.dailymail.co.uk/sport/football/article-3421336/Young-fan-interviews-Mark-Noble-West-Ham-TV-takeover-Junior-Journo-Manchester-City-draw-Upton-Park.html"}
