{"authors":[],"date_download":"2018-10-30 17:50:46","date_modify":"2018-10-30 17:50:46","date_publish":"2018-10-30 15:25:00","description":"- Playoff rankings debut Tuesday, where will Georgia start?","filename":"data/vaneerConsumption/Youngplayerscontinuetoemergestepintolargerroles.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Videos/4518932.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_uga-young-pl_1e897d153ea9a3e215725a67fe15b610__1540921846.html","title":"Young players continue to emerge, step into larger roles","title_page":"UGA football: Young players continue to emerge, step into larger roles","title_rss":"NULL","source_domain":"ajc.com","text":"- Playoff rankings debut Tuesday, where will Georgia start?\nYouth was served in Georgia’s 36-17 win over Florida, and Kirby Smart is looking for more growth the final five games of the regular season.\nFreshman nose guard Jordan Davis and sophomore receiver Jeremiah Holloman made their first career starts against the Gators in Jacksonville.\nBoth players had performances that justified Smart’s decision.\nHolloman had two touchdown catches for the Bulldogs, while Davis is part of a defensive front that’s trying to grow up fast entering into Saturday’s pivotal game at Kentucky.\nThe winner of the Bulldogs-Wildcats matchup at 3:30 p.m. at Kroger Field in Lexington clinches the SEC East Division and will play in the SEC Championship Game on Dec. 1.\n“It’s tough in the midst of a season to just magically get better, we try to do it through fundamentals, technique, individual block destruction, demeanor, and attitude,” Smart said. “But you can’t go out and replace players. We have what we have. We’d love to have some more depth at those positions, but we don’t.”\n- Georgia is not surprised that Kentucky is playing for division title\nSmart said on Monday he wasn’t sure if defensive end David Marshall would be ready to return from the foot injury that’s sidelined him the past two games.\nThe Bulldogs are starting to get younger players more snaps as the season progresses and the players grow.\n“I was sitting in a meeting last night and I’m sitting there thinking Mel (Tucker) is going to call out three guys in what we call signal callers,” Smart said after the Florida win.\n“We go over notes of the game and make them present them to the team. Jordan Davis stands up and goes over short yardage goal line. (Outside linebacker) Brenton Cox stands up and goes over the pass rush plan. (Cornerback) Tyson Campbell stands up and goes over the tricks and gimmicks and I’m about to have a heart attack back there with these three guys.”\nAll three players are freshmen.\n“You’re used to your older guys being able to do those and those three true freshmen played a lot of snaps,” Smart said. “Youth is a good thing because they listen and they learn, but they also grow up and get better.”\nGeorgia’s top two tacklers against Florida were sophomores, linebacker Monty Rice (11) and safety Richard LeCounte (7).\nCampbell (5), Cox (1) and Davis (1) were also in on tackles against the Gators.\n- Legend of Rodrigo born two years ago vs. Kentucky","url":"https://www.ajc.com/sports/college/uga-young-players-continue-emerge-step-into-larger-roles/lt0XMElTLgGlSvSycRw4YO/"}
