{"authors":["Press Association"],"date_download":"2018-10-23 00:30:42","date_modify":"2018-10-23 00:30:42","date_publish":"2016-01-11 10:00:19","description":"Tom Youngs says it is \"fantastic\" to see his fellow Leicester star and England international Manu Tuilagi back in action. The powerful Tigers centre, who has...","filename":"data/vaneerConsumption/Youngssalutesreturnofworldclasstuilagi.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-79129c53-2095-4d12-be65-97b568c77902-48qEJGFphM8d437f0aaf923363ef-927_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393048_Youngs-salutes-return-world-class-Tuilagi_1540254642.html","title":"Youngs salutes return of 'world-class' tuilagi","title_page":"Youngs salutes return of 'world-class' tuilagi | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Youngs salutes return of 'world-class' Tuilagi\nTom Youngs says it is \"fantastic\" to see his fellow Leicester star and England international Manu Tuilagi back in action.\nThe powerful Tigers centre, who has won 25 caps, ended 15 months of injury misery by making a second-half return off the bench during Leicester's thrilling 30-27 Aviva Premiership victory over east midlands rivals Northampton.\nWhile Leicester rugby director Richard Cockerill believes it is unrealistic for Tuilagi to be part of England's early games in the RBS 6 Nations Championship this season - they kick off their campaign against Scotland at Murrayfield on February 6 - he is at least back on the pitch following a serious groin problem.\nEngland centre Manu Tuilagi made his comeback from injury in Leicester's Aviva Premiership victory over Northampton\nNew England head coach Eddie Jones watched from the stands at Welford Road as Tuilagi made a couple of characteristic all-action contributions in attack and defence.\nAnd it now remains to be seen whether the 24-year-old, who has not played for England since June 2014, will be named in Jones' first elite player squad next Wednesday.\n\"It is great to see a guy who has gone through some hard times in the last 15 months trying to get back on the pitch after a very serious injury,\" Leicester and England hooker Youngs said.\n\"He is enjoying himself in training and it is fantastic having him back the last few weeks.\n\"He went through a bad period, but he then realised it was getting better and he was not getting knocked back, which is pretty disheartening when you think there is light at the end of the tunnel and you go back to the beginning again.\n\"He was straight into it (against Northampton) and that was the best thing for him.\n\"When you are injured you can do all the training in the world, but he was nervous before the game as he was putting pressure on himself - 'can I still do it' - and he will be a lot better for getting through that 25 minutes.\n\"I did not have to put my arm around him. He is an experienced guy and he knows we are all behind him. I cannot say whether he will be in the England squad. He has got through today (Saturday) and we will see how he gets through next week.\n\"He is a world-class player, but when someone has been out for a long time we forget how good they are until they come back.\"\nCockerill has urged caution about any prospect of Tuilagi being rushed back into the Test arena.\n\"He played 25 or so minutes, and he is remembering how to play rugby again,\" Cockerill said. \"Hopefully, there will be no reaction to that.\n\"He will play next week (against European Champions Cup opponents Treviso) and we will build his fitness up gradually. At this point, I am not sure he is ready to play Test match rugby.\n\"He has played 25 minutes in 15 months and it is a bit premature to be discussing Manu playing for England. He needs to play for Leicester, we need to get him fit and make sure he is 100 per cent right before he starts playing Test matches.\n\"I will speak to Eddie in the next few days. Manu will keep improving, but the start of the Six Nations is unrealistic because we need to make sure he is 100 per cent right.\"\nNorthampton hooker Dylan Hartley, meanwhile, missed the Leicester game due to a rib injury, although Saints rugby director Jim Mallinder suggested it will not be a long-term problem.\n\"He got a bang to his ribs last week,\" said Mallinder, of Hartley, who had been due to be on Saints' bench against Leicester and has been touted as a possible England captaincy successor to World Cup leader Chris Robshaw.\n\"He trained a little bit in the week, but at the last minute he was just too sore to play.","url":"https://www.dailymail.co.uk/wires/pa/article-3393048/Youngs-salutes-return-world-class-Tuilagi.html"}
