{"authors":[],"date_download":"2018-10-30 01:06:00","date_modify":"2018-10-30 01:06:00","date_publish":"2018-09-02 00:05:14","description":null,"filename":"data/vaneerConsumption/YourSearchHasNoResultsConservativesTrumpandGoogle.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Censored_section_of_Green_Illusions_by_Ozzie_Zehner.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861560.html","title":"Your Search Has No Results: Conservatives, Trump, and Google","title_page":"Your Search Has No Results: Conservatives, Trump, and GoogleThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Donald Trump whipped up another fake news tirade this past week, lambasting tech media giants, particularly Google Inc., for “suppressing voices of Conservatives and hiding information and news that is good.” In conjunction with Trump, head economic adviser Larry Kudlow issued a statement Tuesday demonstrating the administration’s possible interest in search engine regulation.\nTrump’s tweets give weight to a common complaint among conservatives. Just this summer, PragerU, a conservative educational video producer, saw multiple of its videos banned on Facebook. Twitter’s refusal to “verify” high profile conservative accounts has long been a conservative frustration. Twitter has also faced the accusation of “shadow banning” conservative pundits, which is the intentional limiting of high profile figures. Jack Dorsey, CEO of Twitter, continues to deny the existence of such practices.\nAnd now Google.\nThe censorship claim is nothing new. Google has been accused of using its ubiquity for evil, blocking access to information on a subjective basis. In fact, Google pulled the lights on the entire internet in 2009 (it was an accident… or test?). The European Union has fined Google twice in the last year in relation to search engine manipulation.\nYet Trump’s tweets point to something more disturbing — political manipulation. When a term is searched on Google, prior criteria such as past searches and geographic location set the parameters for the search through a process called Search Engine Optimization (SEO). If Google engineers set the parameters for the algorithm, what’s stopping them from a little politically motivated tinkering? It’s not like Google is located in liberal Mecca San Francisco, right?\nIf these claims are true, what avenues are open? Kudlow’s crew is leaning towards regulation. His remarks, however, received criticism from both sides of the aisle. Indeed, they are almost laughable. Search engine algorithms and practices are private property. Attempts to “moderate” Google are far too Orwellian. But what about free speech?\nThis summer, Alex Jones “Info Wars” was banned across multiple platforms. Jones infamous program is known for stirring up brutish conspiracy theories such as 2016’s “Pizzagate.” The blocking of Jones’ show sent shock waves through conservative circles — it’s about the implications. Big tech companies can be and are becoming Big Brother. In big tech’s eyes, purposeful misinformation has no place on social media platforms. Conservatives can cry foul, but what are the alternatives? Yes, the government is mandated with protecting freedom of speech, but only in the public sphere.\nWhen fighting Titans, it’s hard to be optimistic.\nFacebook, Twitter, and Google, among others, are prime market movers. While not necessarily the first, MySpace before Facebook or Mosaic before Google, they outpace their opponents and captured the largest market share. Google controls ninety percent of online searches. Facebook has 2.23 billion users. Five hundred million tweets are sent per day. Conservatives, or anyone who disagrees with the geeky coders in Silicon Valley, have a Sisyphean battle.\nWhen free speech crosses property rights, the latter typically wins. But the situation is not hopeless and does not necessarily demand political action. Social media giants, as big as they are, are subject to the laws of supply and demand. If they fail to please their consumers, they will lose them.\nFor every Google, there’s a Bing. Market alternatives do exist. Mastodon, for example, is an open-source Twitter alternative, boasting some 1.5 million users who fled the restrictiveness and subjectivity of Twitter. While these websites may never mushroom into social media giants, they present meaningful alternatives to consumers. New digital platforms, furthermore, such as Brave, have ingrained ad blocking features that strip away profits from big tech. The more these features are adopted, the more Google and Co.’s pocketbooks are squeezed. For conservatives left on the sidelines, then, it shouldn’t be about universal adoption of friendly platforms, but about market competition.\nThe nature of politics makes this question difficult to stomach. News aggregating services like Google News or Facebook’s “Trending” section have powerful political sway. Spain saw this played out in 2014 when Google yanked its news service. Yet, political expedients are often more dangerous than useful and consumers adjust to new information. Just look at CNN’s ratings.","url":"https://spectator.org/your-search-has-no-results-conservative-voices-trump-and-google/"}
