{"authors":["Mecca Woods"],"date_download":"2018-10-31 01:51:25","date_modify":"2018-10-31 01:51:25","date_publish":"2018-08-27 16:51:24","description":"We’re constantly fascinated by what our zodiac sign says about our lives, whether it's which signs are most compatible or how each sign handles conflict in relationships. That's why Bustle has enlisted Mecca Woods, a New York City-based astrologer…","filename":"data/vaneerConsumption/YourDailyHoroscopeForAugust272018.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/d5b27cc0-e8ac-4ff2-a377-b11d0a461fce-fotolia_207295580_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_your-daily-horoscope-for-august-27-2018-10245529_1540950685.html","title":"Your Daily Horoscope For August 27, 2018","title_page":"Your Daily Horoscope For August 27, 2018","title_rss":"NULL","source_domain":"bustle.com","text":"We’re constantly fascinated by what our zodiac sign says about our lives, whether it's which signs are most compatible or how each sign handles conflict in relationships. That's why Bustle has enlisted Mecca Woods, a New York City-based astrologer of MyLifeCreated.com, to tell us all about how astrology is affecting our lives each day. Today's topic: your daily horoscope for August 27, 2018.\nEven though the Moon is in dreamy and relaxing Pisces, Mars (the planet of action) begins moving forward again today after being retrograde for the last two months. With Mars direct in ambitious Capricorn, we should find it a lot easier to get things done and put our energy into the right things. Meanwhile the Pisces Moon teams up with dreamy Neptune in Pisces, growth-oriented Jupiter in Scorpio, and powerful Pluto in Capricorn before the day is out. Under this cosmic combination, we should not only find ourselves dreaming of a master plan, we should also find ourselves with the motivation to fulfill it.\nRead below to see what the stars mean for your sign today, and check out your August 2018 monthly horoscope.\nAries (March 21 - April 19)\nTina Gong/Bustle\nThough things may have felt like you were fighting an uphill battle, especially in terms of your goals and career, the obstacles that were once in your way begin to clear out. Move forward with confidence as you plan and execute your next move. Someone behind the scenes may help you.\nTaurus (April 20 - May 20)\nTina Gong/Bustle\nIf you've been afraid to branch out and try something different, you may feel like you're ready to take a plunge now. Look to your partner or your friends to help you with stepping outside of your comfort zone and embarking on a new adventure. Meanwhile an old belief system must die.\nGemini (May 21 - June 20)\nTina Gong/Bustle\nIf you've been waiting on a job offer or a financial matter to clear up, you could receive some good news today. Meanwhile, when it comes to something or someone that you've been giving too much of your power to, you'll find yourself ready to establish the appropriate boundaries.\nCancer (June 21 - July 22)\nTina Gong/Bustle\nNow that you learned some valuable lessons around boundaries and speaking up for yourself, it's time to put those lessons into action. At the same time, if you and someone close to you hit a stalemate of some sort, you may be able to come to an agreement now. Work with folks that fuel you.\nLeo (July 23 - Aug. 22)\nTina Gong/Bustle\nYou may find that you'll have the motivation you need to get back on board when it comes to taking care of your health. Just try not to beat yourself up about it. Sometimes it's necessary to start from scratch.\nVirgo (Aug. 23 - Sept. 22)\nTina Gong/Bustle\nIf things have been wonky with your love life, you should start to see a change for the better as of today. Meanwhile when it comes to your creative energy, you should find yourself having a breakthrough now if you've been feeling blocked or stuck. Remember to have fun too.\nLibra (Sept. 23 - Oct. 22)\nTina Gong/Bustle\nIf a home- or family-related matter has gotten under your skin and been fraught with delays, you could find a break in the clouds today as things begin moving forward again. Meanwhile, if you haven't already, this is the perfect time for tossing out old junk to make way for something new.\nScorpio (Oct. 23 - Nov. 21)\nTina Gong/Bustle\nIf you've felt unfocused, overwhelmed, or as though you've been focused on all the wrong things and being hyper-reactive, then you get a reprieve today. At the very least, you should find clarity on something you've been obsessing over while so you can finally move forward and take action.\nSagittarius (Nov. 22 - Dec. 21)\nTina Gong/Bustle\nYour finances may have been a bit stop-and-go as of late, but things start to even out now. Meanwhile, when it comes to a home related matter, you should see some progress now. On a different note, if something has been triggering your insecurities, it's time for you to come back to your center.\nCapricorn (Dec. 22 - Jan. 19)\nTina Gong/Bustle\nIf your confidence has felt a bit shaky, you should start to feel like you're back in control again. Celebrate by doing something that feels validating and self-affirming. And should you need a reminder about how boss you are, your friends and siblings would be more than happy to oblige.\nAquarius (Jan. 20 - Feb. 18)\nTina Gong/Bustle\nThat pent up frustration you've been feeling finally starts to dissipate, but you may need to help things along. Look to ways that you can blow off steam with exercise or some other form of physical movement. On a separate note, trust your instincts when it comes to a career decision.\nPisces (Feb. 19 - March 20)\nTina Gong/Bustle\nNow that your clearer about who you want on Team Pisces and who you don't, you should find yourself moving forward with few regrets. That's a good thing because it means that you've freed up space in your life to invite in people that you can really depend on or build with.","url":"https://www.bustle.com/p/your-daily-horoscope-for-august-27-2018-10245529"}
