{"authors":[],"date_download":"2018-10-30 21:48:50","date_modify":"2018-10-30 21:48:50","date_publish":"2017-01-24 17:23:19","description":"Here are seven ways to have active and artsy fun on the Atlanta Beltline.","filename":"data/vaneerConsumption/YourguidetotheAtlantaBeltline.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/06/23/Videos/4117179.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_arts--wheater_your-guide-the-atlanta-beltline__1540936130.html","title":"Your guide to the Atlanta Beltline","title_page":"7 things to do on the Atlanta Beltline","title_rss":"NULL","source_domain":"ajc.com","text":"On any given day, the Atlanta Beltline trail welcomes runners, walkers, bikers, skateboarders and spectators.\nThe route is one of the most comprehensive urban renewal efforts in the United States, repurposing 22 miles of unused railroad corridors into a network of parks and trails circling the core of the city's intown neighborhoods.\nIt's become part of Atlanta history thanks to Ryan Gravel's innovative vision and the city's willingness to make it a reality.\nFor details on the various trails and the Atlanta Beltline map, click here.\nIf you’ve been wondering just how to take in Atlanta’s outdoor hot spot, this list offers the 7 best ways to experience our Atlanta Beltline:\nThe Fence, an international photography project along the Atlanta Beltline. Presented by Atlanta Celebrates Photography. Contributed by Atlanta Celebrates Photography\nArt stroll\nStroll past murals, tiny doors and official and unofficial installations while cruising the Beltline. Art is found throughout the entirety of the Beltline. A chunk of that art you'll find throughout the 2.5 miles of the Eastside Trail - basically a walkable, outdoor museum. The trail showcases the work of hundreds of performers, visual artists and musicians. By yourself or with company, experience the vibrancy and diversity coming from the artist's work. Materials you'll most likely see range from metals, kinetic cubes, photography displays and movable puppetry.\nDon't let cool weather keep you away from the art pieces. Warm up with a scarf and jacket and take in the culture.\nA morning walking tour of the Atlanta Beltline’s Eastside Trail. Organized by Trees Atlanta, it introduces people to the Arboretum of native trees and plants that is being built right along with the Beltline. Photo by (Jill Vejnoska) jvejnoska@ajc.com (Jill Vejnoska)\nArboretum walking tour:\nDon't just walk the Beltline, walk it with an expert docent from Trees Atlanta. Learn firsthand about the trail's horticultural collections and interesting facts about the Beltline. A plant-based narrative of our city at last. Tour groups meet Fridays and Saturdays (registration required) and last almost two hours. Bring some sunscreen and water and prepare for a journey like none other before.\nAtlanta Beltline map\nBicycle\nLooking for something more fast-paced? The Beltline is accessible by more than just foot; grab a bicycle and go. If you don't own a bike, you can purchase or rent one from Atlanta Bicycle Barn.\nOnce you grab your bike, pedal faster to the bar or farther away from town; the choice is yours. If you're one of those who would rather get to the bar in a jiffy, the Eastside Trail (Piedmont Park to Irwin Street/Krog Street Market) is the most developed.\nIf you're looking for a change of city scenery, try The Northside Trail. It offers less crowded paths with a rougher terrain.\nBeware on the weekends however, as the path tends to fill up and you might just end up walking - with bike in tow.\n“The Highball Artist” is a mural created by Hadley Breckenridge on the tunnel that runs under Lucille Street on the Westside Trail of the Beltline. The path is now paved, has lighting and security cameras and is officially open to the public. The art piece’s title is a reference to railroad slang for an engineer known for running trains fast. CONTRIBUTED BY JENNI GIRTMAN / ATLANTA EVENT PHOTOGRAPHY (For the AJC)\nCurrently and probably for a while, the most recent section of Beltine is the Westside Trail. It runs from near Atlanta’s Washington Park to near Adair Park. If you think of it in terms of MARTA stations that’s Ashby to West End. New and old-is-new amenities are springing up quickly and pretty soon we’ll need traffic choppers to keep us informed on the pedestrian ebb and flow around town. Just kidding guys, please stay away from the Beltline in your nosy, noisy whirlybirds.\nParis on Ponce celebrates Bastille Day with a parade from Piedmont Park to Paris on Ponce and begins the three-day celebration which included a mac and cheese contest, dog costume contest, a scavenger hunt and multiple live shows. ((Jenni Girtman)/ info@atlantaeventphotography.com) (Jenni Girtman)\nVisit Paris on Ponce\nAn art gallery with an eclectic mix of 30-plus curators, collectors and designers. Gain entry right off the Beltline across the Ponce bridge from Ponce City Market and make way to purchase your new favorite item. The building sprawls over 46,000 square feet showcasing oddities, antiques, furnishings and art. Room after room you're sure to be delighted in the warehouse of dreams.\nGet your grub on\nEnjoy the Beltline's walk-up patios from lunch, dinner and all the way to those late night cocktails. The view only gets better while noshing on great food and drinks.\nYou can never go wrong with Park Tavern's menu and view of Piedmont Park but if you're wanting a more artisan approach, try Krog Street Market. It offers a variety of Southern-grown restaurants with West Coast style right in the heart of Inman Park.\nFront of Ladybird Grove & Mess Hall (Michael Lennox)\nFind your new favorite cocktail\nFan of Jack Daniel's? A Jack and Coke slushie at Victory Sandwich Bar might become your favorite. Victory has two locations but you'll find their Inman Park location most accessible from the Beltline since the other one’s in Decatur.\nLadybird Grove & Mess Hall is another fantastic spot off the trail. It’s an urban explorer favorite; often hitting a two hour wait time on summer nights. Ladybird has a traditional bar inside and also offers an outdoor-oriented bar that takes place in a camper. Late night is especially pretty with the camping themed-chairs and twinkly strung lights - drink in hand.\nOne of the most popular pieces in an earlier version of Art on the Atlanta Beltline, this is “A 24/7 Timestar Lives,” by Charles Smith, installed by the skatepark on the Atlanta Beltline’s Eastside Trail. AJC photo by Jill Vejnoska\nGet a unique view of Atlanta's skyline\nIf you know where the gigantic \"A 24/7 Timestar Lives,\" by Charlie Smith, is located, you'll know that's just one of the best views of the city you can get. The rising 24-feet-tall art piece is located on the Eastside Trail right next to the Historic Fourth Ward Skatepark. A beautiful art piece with a stunning view of the city as its back-drop.\nAtlanta Beltline map: How to access the Atlanta Beltline\nThere are many, many walkable and bike-friendly access points including the Eastside Trail, Northside Trail, Southwest Connector Trail, West End Trail and Westside Trail.\nHere’s a nifty map of the entire Atlanta Beltline. For more on how to access the Atlanta Beltline, visit beltline.org.\nHere are a few more places for foodies to explore along the Beltline.\nRECOMMENDED VIDEO: AJC's Jill Vejnoska takes us on a bike ride on the BeltLine","url":"https://www.ajc.com/entertainment/arts--wheater/your-guide-the-atlanta-beltline/BV5ZEmXyWmsdwWcqUyou9M/"}
