{"authors":["Mecca Woods"],"date_download":"2018-10-31 01:42:01","date_modify":"2018-10-31 01:42:01","date_publish":"2018-09-14 18:04:03","description":"We’re constantly fascinated by what our zodiac sign says about our lives, whether it's which signs are most compatible or how each sign handles conflict in relationships. That's why Bustle has enlisted Mecca Woods, a New York City-based astrologer…","filename":"data/vaneerConsumption/YourDailyHoroscopeForSeptember142018.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/0dbb10c8-9d9d-4fe8-ae84-6da7d81468e8-fotolia_221243614_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_your-daily-horoscope-for-september-14-2018-11920265_1540950121.html","title":"Your Daily Horoscope For September 14, 2018","title_page":"Your Daily Horoscope For September 14, 2018","title_rss":"NULL","source_domain":"bustle.com","text":"We’re constantly fascinated by what our zodiac sign says about our lives, whether it's which signs are most compatible or how each sign handles conflict in relationships. That's why Bustle has enlisted Mecca Woods, a New York City-based astrologer of MyLifeCreated.com, to tell us all about how astrology is affecting our lives each day. Today's topic: your daily horoscope for September 14, 2018.\nThe Moon completes its stay in Scorpio today, meeting up with Jupiter in Scorpio and the Sun in Virgo early this morning. However, the Moon goes Void-of-Course (the period of time when the Moon is transitioning between signs) shortly afterward, where it will stay until late this evening when the Moon enters happy-go-lucky Sagittarius. Under a VOC Moon it's best not to start anything new or anything that may be of significance, as it may not turn out the way we want. Instead, it's a good time to tie up loose ends and take care of things that are already on our plates.\nLater tonight, when the Moon enters Sagittarius, we'll find ourselves ready to shake off our melancholy and ready to shake a tail feather on the dance floor. Under a Sagittarius Moon, it's all about having a good time and fresh experiences that feed the mind and the spirit. With the Moon teaming up with healing Chiron in Aries and Mars in unconventional Aquarius by the end of the night, we shouldn't have too much trouble finding those experiences.\nRead below to see what the stars mean for your sign today, and check out your September 2018 monthly horoscopes.\nAries (March 21 - April 19)\nTina Gong/Bustle\nAfter being in your feels for the last few days you're ready for an escape. An impromptu weekend getaway could do the trick for you, as could time spent having fun with friends. Either way, look towards doing something for yourself today that boosts your spirits and your confidence.\nTaurus (April 20 - May 20)\nTina Gong/Bustle\nYou and your partner may be making some decisions today regarding your financial future, which could have you looking into ways that you can better save and manage your shared resources. Meanwhile, if single, being upfront about your needs could help you to get just what you want.\nGemini (May 21 - June 20)\nTina Gong/Bustle\nAfter working as hard as you have lately, now it's time for you to get a little TLC from someone you love. No matter if you have a partner or if you're single, spending some time in the company of someone you love, doing something fun together will recharge you. Be wary of needy types.\nCancer (June 21 - July 22)\nTina Gong/Bustle\nYou're all about your business today, which could find you putting in some extra hours at the office. Know that the extra time and effort that you put into your work today won't go unnoticed. On another note, it's time for a reset. Look to ways you can detoxify your mind and soul.\nLeo (July 23 - Aug. 22)\nTina Gong/Bustle\nYou're in the mood for love today, and you could end up finding just what you're craving. You could meet someone new while out and about having fun or pursuing a creative passion. If you have a partner, it's time for the two of you to get out together and do something you haven't done before.\nVirgo (Aug. 23 - Sept. 22)\nTina Gong/Bustle\nYou might find yourself occupied with family or home related matters today. If you've been too busy to organize or clean your living space, today would be a good day to do so. You might also find that time spent with family is just the thing you need to refuel your engine. Draw inward.\nLibra (Sept. 23 - Oct. 22)\nTina Gong/Bustle\nYou might find yourself feeling a bit restless today, which means that it's usually a sign that you need to do something that stimulates your mind and gives you a sense of freedom. As such, today's a great day for getting out and getting into something that inspires and energizes you. Have fun!\nScorpio (Oct. 23 - Nov. 21)\nTina Gong/Bustle\nYou might be in the mood to splurge today, so treat yourself. If you've been thinking about upgrading your living space, this could be a good time to purchase some items to do so. On a similar note, you could receive some good news today if you've been house or apartment hunting.\nSagittarius (Nov. 22 - Dec. 21)\nTina Gong/Bustle\nIt will be hard for you to not wear your heart on your sleeve today, which isn't necessarily a bad thing. As you become more honest with yourself about what you need, it will push you to be honest with others about what you need too, even if you have to be a bit vulnerable to do so.\nCapricorn (Dec. 22 - Jan. 19)\nTina Gong/Bustle\nIt's time for you to pull back a little and focus on your emotional needs. If you're feeling cranky, tired, drained, or a combination of all three, then it's a sign that you need to chill. Meanwhile, you could manifest a dream job opportunity if you've been hunting for one. Honor your needs.\nAquarius (Jan. 20 - Feb. 18)\nTina Gong/Bustle\nYou've got the eye of the tiger now, which means that there's very little that you're willing to let get in your way when it comes to makes your wishes come true. Also, if you find it hard to sit still today, attending a social event or hanging with friends is a good way to spend your energy.\nPisces (Feb. 19 - March 20)\nTina Gong/Bustle\nYou've got your mind on your goals and ambitions today and if it's been unclear about which way you should go when it comes to pursuing your goals, you could have a breakthrough now. You get where you need to be today by trusting your instincts, so don't second guess yourself.","url":"https://www.bustle.com/p/your-daily-horoscope-for-september-14-2018-11920265"}
