{"authors":["Penny Starr"],"date_download":"2018-10-30 18:45:49","date_modify":"2018-10-30 18:45:49","date_publish":"2018-07-24 15:31:01","description":"U.S. Ambassador to the U.N. Nikki Haley gave high schoolers a mixed message on Monday, telling them not to mock the left but to stand strong.","filename":"data/vaneerConsumption/YouShouldntOwntheLibs.json","image_url":"https://media.breitbart.com/media/2018/07/Nikki-Haley-high-school-Turning-Point-USA-facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_07_24__1540925149.html","title":"You Shouldn't 'Own the Libs'","title_page":"Nikki Haley Scolds Students: You Shouldn't 'Own the Libs'","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON, DC – U.S. Ambassador to the United Nations Nikki Haley gave high school students a mixed message on Monday about how to advance their conservative agenda, telling them not to mock the left but stand up to liberals if they are demonized.\n“It’s easier than ever to make snarky remarks or take joy in opponents’ mistakes or misfortunes,” Haley said at Turning Point USA’s 2018 High School Leadership Summit in Washington, DC.\n“Raise your hand if you have ever posted anything online to quote-unquote ‘own the libs,’” Haley said.\n“I know it’s fun and that it can feel good, but step back and think about what you are accomplishing when you do this,” Haley said.\n“Are you persuading anyone? Who are you persuading? We’ve all been guilty of it at some point or another,” Haley said.\n“But this kind of speech isn’t leadership,” Haley argued.\nHaley warned that making fun of the left would continue the political divides in the country today.\nAt the same time, Haley confirmed the hypocritical double standards that lead to discrimination against young conservatives.\n“If you speak out on behalf of free markets or traditional values or even free speech, the other side won’t just call you wrong and have a debate,” Haley said. “They’ll call you evil and unworthy of even being heard.”\n“You’ve probably encountered this at your own schools,” Haley said. “I know that I’ve dealt with this at the United Nations.”\nHaley told the young audience they should persuade people not by “shouting them down, but by showing them that it is in their best interest to see things the way you do.”\nThe only political issue Haley spoke about was praising the decision to withdraw the United States’ membership from the United Nations’ Human Rights Council, citing the council’s support for dictators and tyrants around the world.\nDespite warning the young crowd not to be mean to the left, Haley concluded her remarks by telling them not to back down from their conservative stance.\n“If I could leave you with one message today … have the courage to stand up to the mob,” Haley said.\nFollow @PennyStarrDC on Twitter.","url":"https://www.breitbart.com/national-security/2018/07/24/haleys-mixed-message-high-schoolers-dont-own-libs-stand-up-mob/"}
