{"authors":["Charlie Nash"],"date_download":"2018-10-30 22:09:20","date_modify":"2018-10-30 22:09:20","date_publish":"2017-04-07 18:33:12","description":"YouTube videos will now have to reach at least 10,000 views before the creators earn any advertisement revenue.","filename":"data/vaneerConsumption/YouTubeChannelsMustNowReach10000ViewsBeforeEarningAdRevenue.json","image_url":"https://media.breitbart.com/media/2017/03/youtube-sorry-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2017_04_07__1540937360.html","title":"YouTube Channels Must Now Reach 10,000 Views Before Earning Ad Revenue","title_page":"YouTube Channels Must Now Reach 10,000 Views Before Earning Ad Revenue | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"YouTube channels will now be required to reach 10,000 views before the creator’s videos will be able to include advertisements and earn money, according to a new blog post from the company.\n“For millions of creators, making videos on YouTube isn’t just a creative outlet, it’s a source of income… Today, more creators are making a living on YouTube than ever before,” declared YouTube in the official blog post. “However, with this growth we’ve started seeing cases of abuse where great, original content is re-uploaded by others who try to earn revenue from it.”\n“Starting today, we will no longer serve ads on YPP [YouTube Partner Program] videos until the channel reaches 10k lifetime views,” they continued. “This new threshold gives us enough information to determine the validity of a channel. It also allows us to confirm if a channel is following our community guidelines and advertiser policies. By keeping the threshold to 10k views, we also ensure that there will be minimal impact on our aspiring creators. And, of course, any revenue earned on channels with under 10k views up until today will not be impacted.”\n“In a few weeks, we’ll also be adding a review process for new creators who apply to be in the YouTube Partner Program. After a creator hits 10k lifetime views on their channel, we’ll review their activity against our policies,” the company concluded. “If everything looks good, we’ll bring this channel into YPP and begin serving ads against their content. Together these new thresholds will help ensure revenue only flows to creators who are playing by the rules.”\nThe move appears to be a part of YouTube’s response to mass-advertiser withdrawal from the site and an attempt to bring companies back to the platform.\nSeveral large companies pulled their advertising from Google and its sites, including YouTube, last month, citing their adverts appearing on “extremist” and “offensive” content.\nThe companies included AT&T, Verizon, Johnson & Johnson, The BBC, The Guardian, Channel 4, Toyota, McDonald’s, and even the British Government, prompting Google to pledge a stand against offensive content.\n“We take this as seriously as we’ve ever taken a problem,” said Google’s Chief Business Officer, Philipp Schindler. “We’ve been in emergency mode.”\nIn a blog post announcement, Google pledged to tackle “hateful” videos on YouTube, as well as provide advertisers with new tools to limit their reach.\nHowever, despite their pledge to crack down on extreme content, a large number of YouTube’s top content creators and personalities claim to have been unfairly affected by the changes, which have caused many of them to lose substantial amounts of advertisement revenue.\nDespite YouTube only announcing the new “10k” advertisement rule this week, the company claimed in an email to Ars Technica that this policy has been in place since November.\n“A YouTube spokesperson told Ars that ‘the changes to the YouTube Partner Program announced today were put into motion back in November of last year, with the goal first and foremost to protect creators.'” Ars Technica reported, raising questions as to why the company has only just announced the change.\nCharlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.","url":"https://www.breitbart.com/tech/2017/04/07/youtube-videos-now-reach-10k-views-earning-ad-revenue/"}
