{"authors":["Erica Tempesta For Dailymail.Com"],"date_download":"2018-10-23 05:55:47","date_modify":"2018-10-23 05:55:47","date_publish":"2016-01-11 18:44:27","description":"YouTube star Joey Salads, 22, teamed up with his friend Mike for the offensive social experiment that sees him swooping in and 'saving' women from his pal's aggressive behavior.","filename":"data/vaneerConsumption/YouTubesJoeySaladsasksfriendtoharasswomensohecanswoopininvideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/19/300DF7B000000578-0-image-a-3_1452541599755.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3394121_Man-asks-friend-harass-women-vulgar-pick-lines-swoop-prove-playing-hero-gets-date-100-time_1540274147.html","title":"YouTube's Joey Salads asks friend to harass women so he can swoop in in video","title_page":"YouTube's Joey Salads asks friend to harass women so he can swoop in in video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"All of the women featured in the YouTube video agree to go out with Joey except for one person who actually likes Mike's aggressive behavior\nA hidden camera shows Mike using sexually explicit come-ons to hit on women he sees on the street before Joey intervenes\nA YouTube prankster is adamant that all women are looking for a knight in shining armor – and is therefore convinced that scaring away an unwanted male pursuer is a foolproof way to pick up girls.\nIn his latest social experiment, YouTube star Joey Salads, 22, teamed up with his friend Mike to demonstrate how ‘rescuing’ a woman who is being sexually harassed in is an easy way to score a date.\n'We are going to show you how to get a girl 100 per cent,' he explains.\nScroll down for video\nSocial experiment: YouTube prankster Joey Salads (right) asked his friend Mike to harass girls on the street as he tries to prove that rescuing women from unwanted pursuers is a surefire way to score a date\nSlick move: After Mike refused to leave a woman he saw on the street (left), Joey intervened and threatened him until he walked away (right). The woman eventually agreed to go out with Joey because he 'saved her life'\nAt the start of the video, Joey's friend Mike can be seen approaching a woman on the street who is working at a temporary tattoo stand.\n'God damn you are f***ing gorgeous aren't you?' Mike says as he walks up to her.\nWhen she asks if he has any questions about the temporary tattoos that she is selling, he noted: 'I've got one question. I want to get up in that a**' - which isn't actually a question at all.\nThe woman immediately calls him out for being 'rude', but he continues to aggressively pursue her.\n'We can make a little trouble tonight,' he says, prompting her to ask him to leave.\n'I'm working,' she says with irritation before Joey intervenes.\n'I hear you talking to this girl. You can't talk to her like that,' Joey says, slipping into the role of white knight with ease. 'Listen if you are going to talk to her like that I am going to beat the s**t out of you, so you better take a hike.'\nAfter the woman pretends that Joey is her boyfriend, Mike walks away in a huff and the YouTube star swoops in.\n'I am so sorry about him. He makes all the guys look bad,' he says. 'Do you mind if I take you out to dinner sometime to show you that there are some good guys out there?'\nThe woman is hesitant at first, but she says 'maybe' because he 'saved her life'.\n'Just because of this,' she adds, as she agrees to give him her number.\nIn the next setup, Mike approaches a woman who is eating by herself at a bar.\nAre you serious? Mike pulled out all the stops when he walked up to this woman and started eating her food\nGet outta here: After Mike made numerous sexually suggestive comments about her body, Joey came over and told him to back off\nSneaky maneuver: As soon as Mike walked away, Joey asked the woman if he could take her out to dinner, so he could prove that not all guys are bad\n'Did I just find the sweetest thing I have ever seen in my life,' he says as he takes some of her food.\n'Are you f***ing serious?' she asks as he licks his fingers.\nMike goes on to ask her out while talking about how she has a 'nice f***ing a**’. But before she really loses her cool, Joey comes over and taps Mike on the shoulder.\n'Hey, you can't talk to her like that,' he says. You are going to have to leave or I am going to make you leave.'\n'I am so sorry about him,' he apologizes. ‘Disgusting. He makes all us guys look bad you know.'\n'We need more guys like you around,' the woman responds. And she readily agrees to go out to dinner with Joey later that night.\nHowever, not all of the women were appalled by Mike's outrageous behavior.\nReal-life snake: Mike walked up to this woman and showed her how he can move his tongue like a 'serpent'\nBad taste in men: Mike was stunned when the woman responded to his offensive pick-up lines by agreeing to go out with him. She can be seen giving him her phone number\nWhen Mike approaches one woman who is sitting by a fountain, he tells her she is 'f***ing sexy', and she responds by introducing herself as Yasmin.\nMike steps up his game and becomes even more vulgar as he suggestively demonstrates how he can move his tongue like a serpent.\nHowever, instead of being outraged, the woman laughs and says, 'Wow!'\nMike is visibly shocked as Yasmin agrees to hang out. He tries to creep her out one last time before they exchange phone numbers with him. But when he talks about 'plowing' her, she only replies by saying she is looking forward to it.\n'I think it f***ing worked,' he mouths to the hidden camera. Since Yasmin has no issue with Mike's behavior, Joey never ends up coming to her rescue.\nIn the final scene from the clip, Mike stops a woman on the street by putting his hand in front of her waist.\nNot so fast: Mike stopped this woman who was texting in the street by putting his hand in front of her\nStep back: Joey rushed over to confront Mike after he followed her when she tried to walk away\nSmooth operator: Joey then asked her to go out on a date with him, so he can show her 'how nice guys are'\nWhile she quickly walks away from him, Mike starts to follow until Joey comes out and confronts him.\n'Buddy get away from her,' Joey tells Mike. 'You are disrespectful. Get out of here before I beat you up.'\n'Thank you so much for helping me out,' the woman tells Joey gratefully. Once again, Joey notes that Mike makes all guys look bad, and she agrees.\nWhen Joey asks to take her out, so he can show her 'how nice guys are', she admits that he did prove his point by saving her. At the end of the video, she texts him her number, so they can go on a date.\nMany people commented on the clip, which has been viewed more than 180,000 since it was posted last Monday. And some guys agreed that having a friend harass girls, so they can save the day is a brilliant idea.\n'At first I was cringing and then I realized this genius technique,' Jake Lucky wrote. However, not everyone was a fan.","url":"https://www.dailymail.co.uk/femail/article-3394121/Man-asks-friend-harass-women-vulgar-pick-lines-swoop-prove-playing-hero-gets-date-100-time.html"}
