{"authors":["Ashley Pratte"],"date_download":"2018-10-30 18:25:22","date_modify":"2018-10-30 18:25:22","date_publish":"2015-01-06 13:01:03","description":"Young America’s Foundation has released its Youth Misery Index (YMI) numbers for 2014, and it’s a record high of 106.5.","filename":"data/vaneerConsumption/YouthMiseryIndexGrowsMorethan50UnderObamaAdministration.json","image_url":"https://media.breitbart.com/media/2015/01/AP1110060111103.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_06__1540923922.html","title":"Youth Misery Index Grows More than 50% Under Obama Administration","title_page":"Youth Misery Index Grows More than 50% Under Obama Administration | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Young America’s Foundation has released its Youth Misery Index (YMI) numbers for 2014, and it’s a record high of 106.5. The Youth Misery Index (YMI) is calculated by adding youth unemployment, student loan debt, and national debt (per capita) numbers.\nYoung people are experiencing hardships like never before under the Obama administration, and this generation is especially suffering the consequences of this administration’s leftist policies.\nYouth unemployment in 2014 was 18.1 percent (18.1 on YMI), with almost six million young people between the ages of 16 and 24 not in school or work. Many young people are simply giving up on finding employment.\nStudent loan debt for 2014 rings in at a record-breaking $30,000 (30.0 on YMI). Student debt has risen at an average of six percent per year since 2008, and today, 70% of college seniors graduate with student loan debt. In addition, the job market still hasn’t recovered, leaving many recent graduates with little or no income to pay back their loans.\nNational debt per capita for 2014 is the highest it’s ever been at $58,437 (58.4 on YMI). Young people will be stuck paying for government debt they had no part in creating, and they’ll have to do it with less discretionary income than ever before because of record-high levels of student loan debt.\nAdd it all up, and the YMI comes out to an astonishing 106.5 up from 98.6 in 2013.\nAs government continues to expand under President Obama’s leadership, so does the Youth Misery Index. Since 2008, the YMI has increased by 53.7 percent, the highest increase under any President, making Obama the worst President for youth economic opportunity.\nAshley Pratte is the Spokeswoman for Young America’s Foundation. Follow her on Twitter @ashpratte.","url":"https://www.breitbart.com/politics/2015/01/06/youth-misery-index-grows-more-than-50-under-obama-administration/"}
