{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 04:59:07","date_modify":"2018-10-23 04:59:07","date_publish":"2017-03-10 15:03:36","description":"The parents of an 8-year-old YouTube star have been accused of child endangerment after they drove him and a young woman around in the back of a pick-up truck full of gel-like beads (pictured).","filename":"data/vaneerConsumption/YouTubestarsparentsdrivehimaroundinbedofOrbeez.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E238E8600000578-0-image-a-3_1489158763681.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301442_You-Tube-star-s-parents-accused-child-endangerment_1540270747.html","title":"YouTube star's parents drive him around in bed of Orbeez","title_page":"YouTube star's parents drive him around in bed of Orbeez | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The parents of an eight-year-old YouTube star have been accused of child endangerment after they drove him and a young woman around in the back of a pick-up truck full of gel-like beads.\nCorona Police reviewed two videos posted to a YouTube channel that has more than one million followers and cited Holly Piazza, 45, the boy's mother, and Brian Chase, 37, for child endangerment of Piazza's son.\nIn their latest stunt for the channel, the family filled the bed of their white Dodge pick-up truck with Orbeez, which are a gel type material that absorbs water and swells 100- 300 times its original volume.\nScroll down for video\nThe parents of an eight-year-old YouTube star (pictured) have been accused of child endangerment after they drove him and a young woman around in the back of a pick-up truck full of gel-like beads. The pair are seen swishing very close to the edge of the truck\nCorona Police reviewed two videos posted to a YouTube channel that has more than one million followers and cited Holly Piazza (left), 45, the boy's mother, and Brian Chase (right), 37, the boy's stepfather, for child endangerment of Piazza's son\nIn their latest stunt for the channel, the family filled the bed of their white Dodge pick-up truck (pictured) with Orbeez, which are a gel type material that absorbs water and swells 100- 300 times its original volume\nOne video showed the family lining the truck bed with plastic sheeting as they opened bags of the Orbeez and threw them in the water.\nAfter the beads swelled, the boy and the young woman, who is jumped in the back of the truck as his parents backed out of their driveway and drove to a main street not far from their home.\nThe boy and the young woman were were lying in the bed of the Dodge as it was driven through heavy traffic on roadways throughout Corona.\nAt one point the pair swished close to the edge of the truck as it was driven from their home.\nThe Corona Police Department said in a statement that they received information through social media avenues that there were two uploaded YouTube videos that depicted 'dangerous driving behavior involving children'.\nPolice said they were in the back of the truck without any type of safety equipment while the driver slowed down and sped up as they drove through heavy traffic.\nAfter the beads (pictured) swelled, the boy and the young woman, who is jumped in the back of the truck as his parents backed out of their driveway and drove to a main street not far from their home\nThe boy and the young woman were were lying in the bed of the Dodge as it was driven through heavy traffic on roadways throughout Corona\nThe Corona Police Department received information through social media avenues that there were two YouTube videos that depicted 'dangerous driving behavior involving children'. At one point the pair (pictured) swish close to the edge of the truck as it's driven down the road\n'Additionally, after the family was done with the Orbeez material, they dumped all of it on Rimpau Avenue near Erick Street, creating a dangerous roadway condition for motorists,' police said.\nThe Department of Water and Power was notified after the Orbeez material spilled into the sewer drains.\nPiazza and Chase were both cited for illegally dumping materials on the roadways and were ordered to pay for the cost of road cleanup.\nPiazza was also issued a traffic citation for illegally dumping materials upon the roadway.","url":"https://www.dailymail.co.uk/news/article-4301442/You-Tube-star-s-parents-accused-child-endangerment.html"}
