{"authors":["Ana Santos"],"date_download":"2018-10-30 18:42:35","date_modify":"2018-10-30 18:42:35","date_publish":"2016-11-17 07:58:57","description":"Traveling this Thanksgiving? When it comes to Atlanta traffic, a little planning goes a long way.","filename":"data/vaneerConsumption/YouvebeenwarnedTheworsttimestodriveinAtlantathisThanksgiving.json","image_url":"https://www.myajc.com/rf/image/PortalConfig/np-one/assets/myajc/images/myAJC200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/myajc.com/blog_commuting_you-been-war_dbdb9adebb7c23f1fc706e26207152bc__1540924955.html","title":"You've been warned: The worst times to drive in Atlanta this Thanksgiving","title_page":"You've been warned: The worst times to drive in Atlanta this Thanksgiving","title_rss":"NULL","source_domain":"ajc.com","text":"+ × Traffic will just as bad during the weekend as it is during the week. HYOSUB SHIN /HSHIN@AJC.COM\nTraveling this Thanksgiving? When it comes to Atlanta traffic, a little planning goes a long way.\nThe auto club AAA forecasts that 48.7 million Americans will travel during the Thanksgiving holiday, according to a report. Most of these travelers will be hitting the road in their cars.\nWant to avoid a traffic nightmare? Please plan you travels accordingly.\nGoogle Maps used data to highlight the best and worst times to drive during Thanksgiving in Atlanta.\nThe best day to leave Atlanta is the Sunday before Thanksgiving. Google Maps recommends leaving the Sunday before Thanksgiving at 6 a.m. and to avoid traveling around 3 p.m.\nThe worst day to leave Atlanta is the day before Thanksgiving (Wednesday). No other option but to leave Wednesday? It's best to start heading out at 5 a.m. when there are fewer cars on the road, Google Maps says. Avoid driving around 3 p.m. when traffic will be at its worst.\nThe best day to return to Atlanta is the day after Thanksgiving (Friday). Google Maps advises traveling at 6 a.m. and not traveling at around 4 p.m. Avoid areas around outlet malls to escape Black Friday madness.\nThe worst day to return to Atlanta is the Saturday after Thanksgiving. If you have to return on Saturday, leave by 6 a.m. and avoid traveling around 4 p.m. when traffic is at its worst.\nDriving or taking MARTA to Atlanta Airport for Thanksgiving? Here's what you need to know\nWhen traveling for the holidays, state officials warn drivers to always stay alert. “We typically see an increase in roadway fatalities during heavy travel holidays, and with traffic fatalities up again this year, drivers should slow down, drive alert and take every precaution to protect themselves and their passengers,” Georgia DOT State Construction Engineer John D. Hancock said in a press release.\nRead more:","url":"https://www.myajc.com/blog/commuting/you-been-warned-the-worst-times-drive-atlanta-this-thanksgiving/DjQuV52f5PvukMXLsVOkOP/"}
