{"authors":["Candice Jackson","Erin Van Der Meer For Daily Mail Australia"],"date_download":"2018-10-23 01:26:23","date_modify":"2018-10-23 01:26:23","date_publish":"2017-04-26 11:49:39","description":"The Australian actress is currently making a name for herself in Hollywood. And Yvonne Strahovski was spotted at the premiere of Hulu's The Handmaid's Tale in Hollywood on Tuesday.","filename":"data/vaneerConsumption/YvonneStrahovskistunsinnavyfrockinHollywood.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9EE4EE00000578-0-image-a-62_1493203097435.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447204_Yvonne-Strahovski-stuns-navy-frock-Hollywood_1540257983.html","title":"Yvonne Strahovski stuns in navy frock in Hollywood","title_page":"Yvonne Strahovski stuns in navy frock in Hollywood | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Australian actress is currently making a name for herself in Hollywood.\nAnd Yvonne Strahovski was spotted at the premiere of Hulu's The Handmaid's Tale in Hollywood on Tuesday.\nThe 33-year-old couldn't contain her gleaming smile as she posed on the red carpet in a delicate lace and silk frock.\nScroll down for video\nBeauty in blue! Australian actress Yvonne Strahovski stuns in navy frock at Hulu's The Handmaid's Tale red carpet premiere in Hollywood on Tuesday\nYvonne - who plays Serena Joy in the series – showcased her slim figure in the navy dress.\nThe blonde beauty showed a glimpse of her cleavage in the v-cut and spaghetti strap design.\nThe gown's bodice fit snug around her svelte waistline as its lace and corset features clung to her frame.\nGlam! The blonde beauty showed a glimpse of her cleavage in the v-cut and spaghetti strap design\nStunning! The gown's bodice fit snug around the actress' svelte waistline as its lace and corset features clung to her frame\nThe frock's tight pencil skirt fell just above her calves in a slight flattering frill.\nYvonne elongated her frame by pairing the garment with black strappy heels, choosing only to wear ear rings as other accessories.\nThe wind appeared to pick up at the front of the Cinerama Dome theatre as the star's curled locks swayed in the breeze.\nThe film and TV actress had a flawlessly applied face of makeup, with a simple lashing of mascara and a pink pout.\nWindswept beauty! The wind appeared to pick up at the front of the Cinerama Dome theatre as the star's curled locks swayed in the breeze\nThe star has previously spoken out about why she chose to avoid swapping her mouthful of a surname for something that rolls of the tongue more easily in Hollywood.\nShe has said she didn't give in to the pressure when she was advised to do so upon arriving in LA nearly a decade ago.\nThe Sydney-born beauty, best known for roles in 24: Live Another Day, Dexter and Chuck, told GQ magazine it was suggested that she change her name from Strzechowski to Stryker.\nNatural beauty! The film and TV actress had a flawlessly applied face of makeup, with a simple lashing of mascara and a pink pout\n'Look, at the end of the day it was my call, and I understood the reasoning behind it – the spelling of my name is a mouthful of letters.\n'So I have the same last name – but now it’s spelled phonetically, so people know how to pronounce it,' she explained.\nThe uncommon surname is Polish, after Yvonne's parents moved from Europe to Western Sydney before she was born.\n'Look, at the end of the day it was my call': Yvonne previously told GQ she chose not to give in to the pressure when she was advised to ditch her long surname Strzechowski to Stryker when arriving in LA in hopes of a Hollywood career nearly a decade ago\nNightmares do come true! Yvonne Strahovski has landed the lead role in new suspense thriller, He’s Out There","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447204/Yvonne-Strahovski-stuns-navy-frock-Hollywood.html"}
