{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 23:52:18","date_modify":"2018-10-30 23:52:18","date_publish":"2014-08-12 21:56:08","description":"I gotta say, Zac Efron just keeps getting cooler and cooler with every passing day. Every time I read something new about him, even Michelle Rodriguez-related, I almost feel myself regarding him even more highly than before. Remember when he…","filename":"data/vaneerConsumption/ZacEfronsNewCharityEventHastheBestPrizeItsForaGreatCause.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/09622a90-56ab-4fe8-a7d4-3a1996be266d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35521-zac-efrons-new-charity-event-has-the-best-prize-its-for-a-great-cause_1540943538.html","title":"Zac Efron's New Charity Event Has the Best Prize & It's For a Great Cause","title_page":"Zac Efron's New Charity Event Has the Best Prize & It's For a Great Cause","title_rss":"NULL","source_domain":"bustle.com","text":"I gotta say, Zac Efron just keeps getting cooler and cooler with every passing day. Every time I read something new about him, even Michelle Rodriguez-related, I almost feel myself regarding him even more highly than before. Remember when he rappelled down a cliff on Running Wild With Bear Grylls ? Or when he majestically rode a horse on the beach? Yeah. Those were good days. This one is too: Apparently, Zac Efron has teamed up with Prizeo to support the Make-a-Wish foundation, and is participating in a charity event that will raise money for the organization as well as gift one lucky fan with his first car.\nAs Efron explained in a video for the event, fans can donate just $10 to have their name entered in the raffle, and whoever wins, no matter where in the world they are, they'll be flown to L.A., put up in a hotel room by Efron himself, and get a chance to \"check out the car, take it for a test drive and hang out with me, too!\" NOT a bad deal.\nYou can check out the video announcement for the event below, as well as Efron's Instagram post to promote it. If you want to enter (and I know I do!), head on over here to donate and support the cause. Every bit counts!\nPrizeo on YouTube\nImage: zacefron/Instagram","url":"https://www.bustle.com/articles/35521-zac-efrons-new-charity-event-has-the-best-prize-its-for-a-great-cause"}
