{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-22 20:18:33","date_modify":"2018-10-22 20:18:33","date_publish":"2016-01-28 00:50:03","description":"A couple that deltoid raise together, stays together. The pair were spotted on Wednesday heading in for a workout together at his local gym in Los Angeles. with the 28-year old actor dressed for the occasion","filename":"data/vaneerConsumption/ZacEfronandgirlfriendSamiMirohitthegymtogetherinLosAngeles.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/23/30A5BB9100000578-0-image-a-4_1453938291323.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420196_Zac-Efron-girlfriend-Sami-Miro-spotted-heading-workout-Los-Angeles_1540239513.html","title":"Zac Efron and girlfriend Sami Miro hit the gym together in Los Angeles","title_page":"Zac Efron and girlfriend Sami Miro hit the gym together in Los Angeles | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A couple that deltoid raise together, stays together.\nZac Efron and Sami Miro aren't just incredibly good looking - they're gym buddies too.\nThe pair were spotted on Wednesday heading for a workout together at his local gym in Los Angeles.\nScroll down for video\nGym buddies: Zac Efron and girlfriend Sami Miro were spotted heading in for a workout together in Los Angeles on Wednesday\nThe 28-year-old certainly looked dressed for the occasion in neon yellow sports shorts, a matching pair of Under Armour trainers and a black Nike workout top with a matching yellow stripe.\nCarrying his backpack over one shoulder and a salad snack in his hands, the Dirty Grandpa star finished his very LA look with a backwards facing snap-back and a pair of aviator shades.\nHis 28-year-old girlfriend meanwhile didn't look quite as 'in the zone' as he did, completely engrossed in her phone as they made their way in.\nShe wore white Nike trainers with black leggings, and a stripey T-shirt under a cropped black hoodie.\nSuited up: The 28-year-old certainly looked dressed for the occasion in neon yellow sports shorts, a matching pair of Under Armour trainers and a black Nike workout top with a matching yellow stripe\nFit: Carrying his backpack over one shoulder and a salad snack in his hands, the Dirty Grandpa star finished his very LA look with a backwards facing snap-back and a pair of aviator shades\nHer hair she kept tied back in cute little buns, while over her arm she carried not your typical gym bag, but a tiny red leather purse.\nZack and Sami have been dating for more than a year now, first stepping out as a couple in September of 2014.\nThe actor recently told Jimmy Kimmel about the month long vacation the pair took around Asia, where they even got to meet legendary sushi chef Jiro Ono.\nDistracted: His 28-year-old girlfriend meanwhile didn't look quite as 'in the zone' as he did, completely engrossed in her phone as they made their way in\n'My girlfriend and I are really into food,' said Efron, who got to pose for pictures with the famed Japanese chef and star of acclaimed documentary Jiro Dreams Of Sushi.\nDespite its obvious upfront talent Zac's own most recent screen outing Dirty Grandpa - opposite Robert DeNiro - has failed to win critics over.\nComing up he has Neighbors 2: Sorority Rising with Chloe Grace Moretz and the Franco brothers' The Disaster Artist, while he also filming the Baywatch reboot alongside Dwayne The Rock Johnson.\nDreaming of sushi: The actor recently told Jimmy Kimmel about the month long vacation the pair took around Asia, where they even got to meet legendary sushi chef Jiro Ono","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420196/Zac-Efron-girlfriend-Sami-Miro-spotted-heading-workout-Los-Angeles.html"}
