{"authors":[],"date_download":"2018-10-30 18:27:09","date_modify":"2018-10-30 18:27:09","date_publish":"2018-10-30 18:20:00","description":"Review: Artist Zanele Muholi embodies complexity of Africa in photographs in show at Spelman College Museum of Fine Art","filename":"data/vaneerConsumption/ZaneleMuholisexhibitatSpelmanmuseum.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/newsEngin.22579089_Bayephi-III,-Constitution-Hill,-Johannesburg,-2017-%26-169--Zanele-Muho-U5VX81IFHOE-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_arts--theater_f1cad3dd5b0074047977f7af237548e4__1540924029.html","title":"Zanele Muholi's exhibit at Spelman museum","title_page":"Art review: Zanele Muholi's exhibit at Spelman museum","title_rss":"NULL","source_domain":"ajc.com","text":"With an intense stare, androgynous beauty and skin often deepened in postproduction to an inky, painterly black, Johannesburg-based artist Zanele Muholi compels you to look. As the subject of an ongoing series of self-portraits, Muholi offers complicated commentaries on Africa, sexual identity, race, injustice and environmental pollution.\n>> RELATED: Zanele Muholi pays homage to black women in Spelman exhibit\nMuholi’s photographs are both visually arresting and a form of activism dedicated to changing patterns of representation. In fact, Muholi prefers the term “visual activist” instead of artist for what they do (Muholi uses the pronouns they, their and them). They have often photographed other South Africans in series that focus on marginalized and stigmatized groups like the gay, lesbian and transgender people who face systemic discrimination in the country. Muholi has documented trans beauty contestants, South African drag queens and members of South Africa’s persecuted gay and lesbian community.\n“Julile I. Parktown, Johannesburg” by Zanele Muholi is featured at the Spelman College Museum of Fine Art. Contributed by Stevenson, Cape Town / Johannesburg and Yancey Richardson, New York (For the AJC)\nIn the process, the artist has documented a side of Africa rarely seen. Within a complex web of ideas, if Muholi’s work could be said to have an overarching theme, it might be a desire to erase invisibility, to force us to contend with the diversity of this region and its people.\nBut in a solo exhibition organized by Autograph London and curated by Renee Mussai, “Zanele Muholi: Somnyama Ngonyama, Hail the Dark Lioness” at Spelman College Museum of Fine Art, Muholi turns the camera on themself. In this new body of work created between 2014 and 2017, Muholi assumes an array of guises in self-portraits made in cities around the world (including an image shot in Atlanta of the artist in a fake lock and chain — sourced from a local’s Halloween decorations — encircling the photographer’s neck like a slaveholder’s shackles).\n>> RELATED: Review: Political protest the focus of High Museum’s ‘With Drawn Arms’\nArtist Zanele Muholi’s “Sibusiso, Cagliari, Sardinia, Italy.” Contributed by Stevenson, Cape Town / Johannesburg and Yancey Richardson, New York (For the AJC)\nThe 70 photographs in “Hail the Dark Lioness” hang like family portraits, up high, at eye level, but also blown up to poster size. But the family represented here is Africa and a multiplicity of experiences and ideas embodied by just one subject, the artist. In these portraits, their expressive face changes like the weather, conjuring up a multiplicity of personalities and ideas.\nMuholi’s images allow the artist to assume multiple identities to record the complexity of African history and identity. Adopting endless costumes and guises, Muholi has said of their gesture of standing in for their people, “This is to say, ‘I am one of us.’”\n“Somnyama Ngonyama II, Oslo” by Zanele Muholi. Contributed by Stevenson, Cape Town / Johannesburg and Yancey Richardson, New York (For the AJC)\nMuholi jumps from apartheid to the present day, from anonymous people to representatives of South Africa’s violent past like the striking miners in Marikana killed by police in a notorious 2012 incident. Wearing a crown of Brillo pads or necklaces of clothespins, Muholi conjures up legions of maids and housekeepers, including their own mother who worked as a domestic. In another image, “Basizeni XI, Cassilhaus, North Carolina,” a headdress and necklace of bicycle tires reference the nightmarish act of “necklacing”: wrapping people in rubber and setting them on fire in apartheid-era South Africa.\nThe portraits in “Hail the Dark Lioness” are drawn from direct experience and news stories and from Africa’s current environmental plight, with plastic tubing and tattered plastic and trash worn as costume, to underscore Africa’s status as a dumping ground, a battered, disrespected place where global greed, waste and neglect wash up.\nMuholi embodies tragedy and fierce pride and occasionally, a glimmer of humor too. There is also, in Muholi’s work, an incredible creativity, the kind of resourcefulness when it comes to materials and a free-form imagination that can recall the similarly revelatory 2017 High Museum exhibition “Making Africa” (which included Muholi’s work), about political protest and imagination and the power of creativity to change the world.\nART REVIEW\n“Zanele Muholi: Somnyama Ngonyama, Hail the Dark Lioness”\nThrough Dec. 8. 10 a.m.-4 p.m. Tuesdays-Fridays; noon-4 p.m. Saturdays. $3 suggested donation. Spelman College Museum of Fine Art, 440 Westview Drive SW, Atlanta. 404-270-5607, museum.spelman.edu.\nBottom line: A glimpse into another world and another reality, South African visual activist Zanele Muholi makes Africa and its people the artist’s muse.","url":"https://www.ajc.com/entertainment/arts--theater/review-artist-zanele-muholi-embodies-complexity-africa-photos/sIdV71RqCWdo3ERvkgW3uK/"}
