{"authors":["Helen Turnbull And Kayleigh Giles For Mailonline"],"date_download":"2018-10-23 04:37:59","date_modify":"2018-10-23 04:37:59","date_publish":"2016-01-29 20:22:06","description":"The track, entitled Pillowtalk, was trending worldwide within minutes of the former One Direction singer releasing it on his official Twitter page in the early hours of Friday morning.","filename":"data/vaneerConsumption/ZaynMaliksdebutsolotrackPillowtalkno1in60countriesafterjustoneday.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/20/30B21AB400000578-0-image-a-18_1454098921938.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423349_Zayn-Malik-s-debut-solo-track-Pillowtalk-no-1-60-countries-just-one-day_1540269479.html","title":"Zayn Malik's debut solo track Pillowtalk no.1 in 60 countries after just one day","title_page":"Zayn Malik's debut solo track Pillowtalk no.1 in 60 countries after just one day | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Friday saw Zayn Malik unveil his debut solo single and accompanying video, starring his model-of-the-moment girlfriend, Gigi Hadid, to the world.\nThe track, entitled Pillowtalk, was trending worldwide within minutes of the former One Direction singer releasing it on his official Twitter page in the early hours of the morning.\nAnd although he received slack for leaving the 1D boys - Harry Styles, Louis Tomlinson, Niall Horan and Liam Payne - in the middle of a world tour last March, all seems to be forgiven as the song reached no.1 in no less than 60 countries on iTunes on the day it was released.\nScroll down for video\n'This is crazy, I can't believe it': Zayn Malik's debut solo track Pillowtalk reached no.1 in 60 countries on Friday... as he publicly gloated about girlfriend Gigi Hadid's video appearance\nZayn, 23, was evidently overwhelmed with the outpouring of support the song accumulated over the day and expressed his gratitude on Twitter, before boasting about 20-year-old Gigi's super-sexy appearance in the video.\nIn a series of tweets, he wrote: 'Crazy love today :). This s**t is crazy ... I can't believe it. Blown away... Love you all.'\nThe Bradford-born solo artist then directly asked Gigi: '@GiGiHadid you seen the video babe? Someone's looking,' alongside a perfect-hand-gesture and a tongue-out Emoji.\nShe responded in an equally gushing manner, writing: 'Nah musta missed it. Jokes.. I wasn't looking at myself, trust me,' accompanied by love-heart-eyes and many flame Emojis.\nSee Zayn Malik updates as his new single Pillowtalk reaches no.1 in 60 countries\nSealed with a kiss: Zayn, 23, smooches Gigi, 20, in the music video for his first solo single, despite having never confirmed the pair are dating themselves\n'Blown away': The former One Direction star admitted he was overwhelmed by the wildly positive reception his track had received\nGoing public: After months of keeping coy about their relationship, the duo were all too happy to compliment each other on Twitter\n'Have you seen the video babe?': Zayn outrightly asked Gigi on Twitter, hours after its release\n'Someone's looking...': The Bradford-born singer boasted about how hot his model-of-the-moment girlfriend looks in the video\nThey can't get enough: The clip largely consists of the pair gearing up to kiss, before sporadically locking lips\nThe tweets would've understandably hit a nerve with the singer's ex-fiancée Perrie Edwards whom he dumped last summer.\nRubbing salt in the wound, he has hinted the track is based on the couple's doomed relationship which didn't come to an amicable end.\nZayn sparked speculation the song - which is all about being intimate in the bedroom - is a nod to the Little Mix singer after telling Apple Music's Beats 1 host Zane Lowe that he started writing and recording his upcoming album, Mind of Mine, two months after his split from One Direction, when he was still engaged to Perrie.\nThanks for the inspo: Zayn sparked speculation the song - which is all about being intimate in the bedroom - is a nod to his ex Perrie Edwards after telling Apple Music's Beats 1 host Zane Lowe that he started writing and recording his upcoming album, Mind of Mine, two months after his split from One Direction, when he was still engaged to Perrie\nHis latest track features some particularly raunchy lyrics, including: 'F**king you and fighting on, it's our paradise and it's our war zone. In your bed all day, bed all day, bed all day.'\nAnd it's believed Perrie, 22, could have inspired more than just one song on the album as many have also claimed that Wrong, which Zayn - who still has a tattoo of his ex on his arm - says is 'all about looking in the wrong place for love', is also about the Geordie popstar.\nMeanwhile, Gigi and Zayn let their actions speak louder than words in the racy new music video for his highly-anticipated first solo single.\nOnly the best will do: The video was directed by filmmaker Bouha Kazmi, who was also behind Jay Z's Onto The Next One\nIt must be love: Things certainly appear to have been heating up quickly for the gorgeous celebrity duo\nThe pair leave no doubt about their relationship status as the video sees them get up close and personal before passionately kissing each other on the lips at various points.\nThe video was directed by filmmaker Bouha Kazmi, who was also behind Jay Z's Onto The Next One.\nZayn recently told FADER of his new single: 'Once they hear it, I feel like they will understand me a little bit more.\n'For 10 years, this album has been in my brain, and it's just been there, sat with me, needing to be out.'\nShe's not shy: Gigi shows off her stunning model figure in various skimpy outfits in the clip\nLocking lips: Gigi exhales smoke into Zayn's mouth as they get up close and personal in the Pillowtalk video\nReflections: Zayn and Gigi get close as their image waves across the screen\nZayn candidly told The Sunday Times the song is all about sex - a subject clearly close to his heart as he explained: ‘I think I’m pretty black and white about what it’s about. Everybody has sex, and it’s something people want hear about.\n'It’s part of everybody’s life, a very BIG part of life! And you don’t want to sweep it under the carpet. It has to be talked about.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423349/Zayn-Malik-s-debut-solo-track-Pillowtalk-no-1-60-countries-just-one-day.html"}
