{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 04:17:54","date_modify":"2018-10-23 04:17:54","date_publish":"2016-01-28 20:09:16","description":"The 23-year-old singer has finally confessed his debut solo album will be called Mind Of Mine and admits he's got a new arm tattoo to celebrate its imminent release.","filename":"data/vaneerConsumption/ZaynMalikrevealsdebutsoloalbumwillbecalledMindOfMine.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD385300000578-0-image-a-4_1454012040357.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421633_Zayn-Malik-reveals-debut-solo-album-called-Mind-Mine_1540268274.html","title":"Zayn Malik reveals debut solo album will be called Mind Of Mine","title_page":"Zayn Malik reveals debut solo album will be called Mind Of Mine | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His first single, Pillowtalk, is set to drop this week.\nAnd after months of keeping the details of his debut solo album under wraps, Zayn Malik has finally admitted his pet project will be called Mind Of Mine.\nThe 23-year-old singer, who left One Direction fans heartbroken in March 2015 when he quit the band, made the confession during an interview on Apple Music's Beats 1 radio.\nScroll down for video\nIt's got a name! Former One Direction star Zayn Malik has finally admitted his first solo album will be called Mind Of Mine, confessing he's written around 47 tracks so far\nAsked if there was a name yet, Zayn replied: 'There is… it’s Mind of Mine.'\nHe also revealed he has written a staggering '46 or 47' tracks for the album, but added he only expects around '15 to 18' of them to make it onto the final version.\nIn a separate interview with Dave Berry for Capital London Breakfast Show, set to air Friday morning from 6am, Zayn made the admission he'd got a tattoo on his arm to celebrate recording music without his former bandmates Harry Styles, Liam Payne, Louis Tomlinson and Niall Horan.\nHe explained: 'I just got a tattoo on my leg and my arm, I did them both in the same session.\n'I got a tattoo for the album: the name of the album, and something on my leg, it’s kind of weird, its an outline of a dude smoking which is pretty mega.'\nSee Zayn Malik updates as he reveals debut solo album will be called Mind Of Mine\nSuch a tease! Earlier this week, Zayn shared a topless picture of himself in what appears to be the cover of his first solo single, entitled Pillowtalk - due out on Friday\nThis comes after the British heartthrob shared a topless picture of himself in what appears to be the cover of his first solo single, titled Pillowtalk, due for release this Friday.\nAlthough he hasn’t revealed any additional information about his other material, Zayn told The Sunday Times that the first track is all about sex.\n‘I think I’m pretty black and white about what it’s about,’ he said. ‘Everybody has sex, and it’s something people want hear about.\n'There's no beef': The singer has let slip that he is ‘not fussed’ about staying friends with his former One Direction bandmates Niall Horan, Harry Styles, Louis Tomlinson and Liam Payne\n'Of course, he's great': Liam, 22, recently insisted he would welcome Zayn back to 1D with open arms\n‘It’s part of everybody’s life, a very BIG part of life! And you don’t want to sweep it under the carpet. It has to be talked about.’\nZayn went on to talk about his relationship with his former One Direction bandmates, letting slip that he is ‘not fussed’ about staying friends with them even though there’s ‘no beef’.\nBut the Bradford native did confess he recently received an email from one of his ex-bandmates - Harry Styles, Liam Payne, Niall Horan and Louis Tomlinson.\nHe said: ‘I got an email. I don't even wanna say names.’ [sic]\nThis revelation comes after Liam was quizzed about the possibility of Zayn returning to the chart-topping pop group.\nThe past: The boys at a Who We Are autobiography book signing in London in October 2014\n'Who knows?' The former X Factor contestant also teased the possibility of the ex-band member rejoining the group. Here they are pictured attending a photocall in Madrid, Spain, in December 2014 - three months before the 23-year-old quit\nLast week, he simply explained: 'Who knows? He's just doing his thing, he's fine.'\nHe added that he would welcome him back with open arms, saying: 'Of course, I love Zayn he's great.'\nAdditionally, he reiterated that the boys have no plans to find someone to fill Zayn shoes, saying: 'There's enough people, we don't need more people.'\nEarlier in the month 1D were said to be splitting for good because the four remaining band members had not renewed their contracts.\nAccording to Us Weekly, the band has finally run its course following the departure of fifth member Zayn in March 2015 and their subsequent decision to take time off that August.\nThe close source claimed the boys decided 'not to renew their recording contract' when their On The Road Again tour came to a close on October 31, 2015.\n'The 1D thing just ran its course,' the source explained. 'They'll remain friends, but they are exhausted and want solo careers.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421633/Zayn-Malik-reveals-debut-solo-album-called-Mind-Mine.html"}
