{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 21:11:04","date_modify":"2018-10-22 21:11:04","date_publish":"2016-01-29 05:51:10","description":"The former One Direction member released the track and its accompanying video on Thursday evening - and left no doubt about his relationship status with the model.","filename":"data/vaneerConsumption/ZaynMaliksPillowtalkmusicvideoseeshimandGigiHadidkissforfirsttime.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/07/30B00D6800000578-0-image-a-98_1454051372186.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422214_Gigi-Hadid-Zayn-Malik-t-hands-lips-seen-kissing-time-steamy-video-new-single-Pillowtalk_1540242664.html","title":"Zayn Malik’s Pillowtalk music video sees him and Gigi Hadid kiss for first time","title_page":"Zayn Malik’s Pillowtalk music video sees him and Gigi Hadid kiss for first time | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Zayn Malik and Gigi Hadid have been keeping coy about their romance.\nBut the couple let their actions speak louder than words in the racy new music video for Zayn's highly-anticipated first solo single Pillowtalk.\nThe former One Direction member, 23, released the track and its accompanying steamy video on Thursday evening - and left no doubt about his relationship status with the 20-year-old model.\nScroll down for video\nSealed with a kiss: Zayn Malik smooches Gigi Hadid in the music video for his first solo single Pillowtalk\nWhen they don't have their hands all over each other, Gigi and Zayn exchange a series of kisses in the sexy video.\nGigi is seen beaming up at her boyfriend of two months as she wraps her arms around his neck and he places his hands on her waist.\nThe daughter of Yolanda Foster leans in for a kiss several times, but they are only shown locking lips towards the end.\nThe single is Zayn's first solo track after leaving British boy band One Direction last March. He has since been open about his dislike of their music and his plans to pursue a 'cooler' sound as a solo artist.\nSee Zayn Malik updates as he and Gigi Hadid seen kissing in video for new single Pillowtalk\nLeaving no doubt about their relationship status: The couple have remained coy about their romance until now\nThey can't get enough: The clip largely consists of the pair gearing up to kiss, and then locking lips for the last 30 seconds\nLovely lingerie: Gigi wowed in a chic bra by label Bordelle in the video with her boyfriend of two months\nThroughout the Pillowtalk video, model Gigi and Zayn are shown kissing in various scenarios.\nThe video was directed by filmmaker Bouha Kazmi, who was also behind Jay Z's Onto The Next One.\nThe singer also revealed this week that his new album is called Mind of Mine.\nZayn recently told FADER of his new single: 'Once they hear it, I feel like they will understand me a little bit more.\nOnly the best will do: The video was directed by filmmaker Bouha Kazmi, who was also behind Jay Z's Onto The Next One\nIt must be love: Things certainly appear to have been heating up quickly for the gorgeous celebrity duo\nJoined at the lips: Gigi and Zayn are shown kissing in various different scenarios\nShe's not shy: Gigi shows off her stunning model figure in various skimpy outfits in the clip\n'We're good friends': Earlier in the day, Zayn had remained tight-lipped when asked if he is dating Gigi\nLocking lips: Gigi exhales smoke into Zayn's mouth as they get up close and personal in the Pillowtalk video\n'For 10 years, this album has been in my brain, and it's just been there, sat with me, needing to be out.'\nThe video release comes just hours after the pop star remained tight-lipped when asked if he is dating Gigi, who he has been linked to since November.\n'Yeah, we're good friends,' Zayn told Apple Music's Beats 1 Zane Lowe when asked about his relationship with the runway star.\nReflections: Zayn and Gigi get close as their image waves across the screen\nSolo career: Zayn recently said he had never really wanted to be in One Direction, calling their music 'not my cup of tea'\nBlood tears: Red liquid oozes from Gigi's eyes as she gives somber look into the camera\nPainful: The runway star tilts her head toward the ceiling as the red 'blood' runs down her face\nDistorted: The video stretches and blends different images of Gigi and Zayn\nVideo star: Gigi stares at the camera and then closes her eyes as her image is manipulated\nSmash hit: The 20-year-old is also seen slamming a black guitar into the ground\nIn addition to being all over Zayn in the Pillowtalk video, Gigi is seen smashing a guitar in front of a swirling black-and-white background.\nThe video takes a strange turn when the model's image appears distorted in several scenes, with it appearing as if her eyes are crying blood.\nMeanwhile, Bradford-born Zayn's tears appear to be made of a strange black substance in the surreal clip.\nMoody: Zayn is also seen with black 'tears' running down his face\nAll directions: The singer's image is put through the ringer in the video\nNew single: The former 1D star has finally released his highly-anticipated new single and music video\nThe real Zayn: The former boy band member is also seen in a kaleidesopic image in the video\nSeeing red: Zayn croons about love as a paradise and a war zone in his new single Pillowtalk\nLook of love? Gigi gazes up at her boyfriend with a hand on his lips\nThe video also includes a number of striking images of women, including a woman's face with studs that later turn into spikes as she screams.\nThe clip shows one woman plucking strings on her stomach along with the song's notes, while another is seen opening her legs to reveal a pink flower, with black hearts on her breast.\nAnd two apparently naked women covered in black grease and wearing heels are seen boxing in front of a black and white backdrop.\nFighting fit: The video also shows two naked women boxing in heels\nNot subtle: The image of a woman opening her legs to reveal a pink flower is repeated\nRacy: The video also shows a naked woman resting on top of a man\nEmotional: The studs on one woman's face turn into spikes later in the clip\nBold look: A woman is also seen plucking the strings on her dress in time to the music\nZayn candidly told The Sunday Times that the song is all about sex.\nHe said: ‘I think I’m pretty black and white about what it’s about. Everybody has sex, and it’s something people want hear about.'\n'It’s part of everybody’s life, a very BIG part of life! And you don’t want to sweep it under the carpet. It has to be talked about,' he explained.\nBranching out: Zayn's first solo single features a more R&B, adult sound\nMaking it official: The former 1D star and Gigi have refused to confirm their relationship until now\nThe outspoken singer also told Beats 1's Zane Lowe on Wednesday that he never really wanted to be in One Direction. He said their music wasn't his 'cup of tea'.\n'I always wanted to go, from the first year really,' he admitted. 'I never really wanted to be in the band. I just gave it a go because it was there at the time.'\nThe 23-year-old explained that he became unhappy early on, once he began to feel his songwriting and musical ideas didn't count.\nNew album: Pillowtalk is the first single from Zayn's first solo album Mind of Mine\nLetting it out: A woman is seen grabbing her hands and screaming silently\n'I realized I couldn’t put any input in. I couldn’t give my opinion on this or that because it didn’t fit the grain of what we were or what we represented,' he said.\nZayn also recently pulled out of a planned solo performance on Graham Norton, blaming scheduling conflicts.\nGigi is no stranger to mixing business and pleasure, having previously teamed up with pop star exes Joe Jonas and Cody Simpson on their music videos.\nShe's back! Gigi was seen touching down in Los Angeles on Thursday after a lengthy stint in Paris for Haute Couture Fashion Week\nMissing her loved ones: Clad in a loud neon jumper and a white trench coat, the catwalk pin-up was no doubt excited to be reunited with her family and singer beau\nIn late 2014, Gigi starred in Australian boyfriend Cody's video for his single Surfboard, which saw her in various skimpy outfits and in numerous embraces with her then-boyfriend.\nThe young couple dated on and off for two years before splitting in May 2015, blaming their busy careers for their parting.\nWithin days of ending her romance with Cody, she then went on to date former Jonas Brothers bandmember Joe, before they parted ways two months ago, blaming their 'busy schedules'.\nDuring her six month relationship with Joe, Gigi co-directed the video for his band DNCE's single Cake By The Ocean.\nMixing business with pleasure: Gigi previously starred alongside ex-boyfriend, Australian singer Cody Simpson in his 2014 video Surfboard","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422214/Gigi-Hadid-Zayn-Malik-t-hands-lips-seen-kissing-time-steamy-video-new-single-Pillowtalk.html"}
