{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 03:46:44","date_modify":"2018-10-23 03:46:44","date_publish":"2016-01-28 19:28:55","description":"The 23-year-old singer admitted that he wishes his former One Direction bandmate 'the best of luck' in spite of them not having spoken since last year.","filename":"data/vaneerConsumption/ZaynMalikfavourited1DsLouisTomlinsonbabypicturedespitefeud.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30ACF13900000578-0-image-a-58_1454008618508.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421565_Zayn-Malik-favourited-1D-s-Louis-Tomlinson-baby-picture-despite-feud_1540266404.html","title":"Zayn Malik favourited 1D's Louis Tomlinson baby picture despite feud","title_page":"Zayn Malik favourited 1D's Louis Tomlinson baby picture despite feud | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He previously admitted he's not spoken to the One Direction boys with the exception of Liam Payne since leaving the band.\nBut Zayn Malik revealed he attempted to make amends with former bandmate Louis Tomlinson by showing his support on social media after he became a father for the first time last week, welcoming a child with former flame Briana Jungwirth.\nThe 23-year-old singer favourited Louis' Twitter post when he shared a heartwarming picture of himself cradling his newborn son Freddie Reign, admitting that he wishes his former friend 'the best of luck' in spite of everything.\nScroll down for video\nExtending the olive branch: Former One Direction star Zayn Malik has revealed that he favourited new dad Louis Tomlinson's Twitter picture of him cradling his baby son, explaining 'that’s as far as I can go' since they're no longer on speaking terms\nSpeaking on the Capital London Breakfast Show with Dave Berry, Zayn explained: 'We’ll see if I get an invite [to visit the baby].\n'Obviously I wish him the best of luck. His kid is cute as f**k so obviously I favourited it.\n'We’re not talking on friend terms obviously, so that’s as far as I can go, by favouriting his picture.'\nSee more news on Zayn Malik as he admits he favourited Louis Tomlinson's baby picture\n'I wish him the best of luck': Zayn showed his support for Louis on social media after he welcomed little Freddie Reign with former flame Briana Jungwirth last week\nZayn's virtual attempt to congratulate Louis is all the more surprising since he's only ever favourited 14 things on Twitter.\nRadio host Dave also quizzed the former X Factor star about his decision to leave the band last March in order to live life as a 'normal 22-year-old', jokingly asking how that was working out for world famous star.\n'It worked out for about 2 weeks and I got bored of it. I don’t think I could ever go back to being completely normal', Zayn said.\n'I got bored of it': In spite of quitting 1D (pictured L-R Liam Payne, Louis Tomlinson, Harry Styles and Niall Horan) to live life as a 'normal' guy, Zayn said he soon changed his mind\n'I guess that’s something I accepted, that this is as normal as it gets for me. I just want to make music that I believe in and music that I stand for.'\nThe singer is working on his first solo album, which he has just revealed will be called Mind Of Mine.\nHowever, in spite of slamming One Direction's brand of upbeat pop music in recent interviews, Zayn admits he wouldn't rule out the possibility of collaborating with Justin Bieber - but not just yet.\nHe said: 'It’s not something I’d say no to. I might think about it at some point, I’m not really trying to do that on this record, its not something I’m trying to sway towards.\n'I’m just trying to put my sounds out there and let people see that. I don’t just want to start featuring on everyone else’s tracks.\nTune in to hear the full interview with Zayn Malik on Dave Berry’s Capital London Breakfast Show, Friday morning from 6am.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421565/Zayn-Malik-favourited-1D-s-Louis-Tomlinson-baby-picture-despite-feud.html"}
