{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-23 00:06:19","date_modify":"2018-10-23 00:06:19","date_publish":"2017-03-10 05:49:55","description":"The 20-year-old took control of Lyft's account on Wednesday night to deliver a powerful message of support to her fellow females.","filename":"data/vaneerConsumption/ZendayaurgesfemalestocontinuethefightonIWD2017.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/05/3E1FCC2300000578-0-image-a-48_1489124931169.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300038_Zendaya-urges-fellow-females-continue-fight_1540253179.html","title":"Zendaya urges females to continue the fight on IWD 2017","title_page":"Zendaya urges females to continue the fight on IWD 2017 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is an outspoken champion for women's rights.\nSo who better than Zendaya to do a Snapchat take-over for International Women's Day?\nThe 20-year-old took control of Lyft's account on Wednesday night to deliver a powerful message of support to her fellow females.\nScroll down for video\nGirl power: Zendaya took control of Lyft's account on Wednesday night to deliver a powerful message of support to her fellow females\n'Hey what's up its Zendaya here, taking over Lyft's account to say Happy International Women's Day!' she beamed. 'I hope everyone is having an incredible empowering day!'\nThe actress then listed the ladies who have had the biggest impact on her life so far.\n'In honour of International Women's Day, three of the biggest powerful female influences for me are definitely the women in my family; so my mom and my older sister. Oprah for sure. And Michelle Obama for sure. The list goes on and on,' she mused.\n'Hey what's up its Zendaya here, taking over Lyft's account to say Happy International Women's Day!' she beamed. 'I hope everyone is having an incredible empowering day!'\n'In honour of International Women's Day, three of the biggest powerful female influences for me are definitely the women in my family; so my mom and my older sister. Oprah for sure. And Michelle Obama for sure. The list goes on and on,' she mused.\nShe declared her participation in IWD consisted of celebrating other women, empowering them, lifting them up…. and wearing red lipstick.\n'So shout out to all my beautiful strong women out there, and make sure you continue to bust and break through that glass ceiling and keep moving forward,' she said.\n'Cause that is the only way we are going to make the changes that we want to see and make the progress that we want to make… so stay strong.'\nShe declared her participation in IWD consisted of celebrating other women, empowering them, lifting them up…. and wearing red lipstick.\nThe Disney star was one of the many young female celebrities to take to the streets in force in January to take part in the mass womens' marches that occurred all over the United States, and indeed the world.\nZendaya, who is proving herself to be a real social media guerrilla, had taken over Vogue's Snapchat account that day, too.\n'We don't even know where we're going , we're just following the crowd,' she gleefully admitted as she marched. 'We're just following the fabulousness.'\nShe joined in the chats of 'They go low, we go high' and 'Yes we can', and shared pics of her favourite placards, including 'A woman's worth is not determined by her appearance', and 'Putin in the White House'.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300038/Zendaya-urges-fellow-females-continue-fight.html"}
