{"authors":["Nkayla Afshariyan For Daily Mail Australia"],"date_download":"2018-10-22 23:53:03","date_modify":"2018-10-22 23:53:03","date_publish":"2017-04-26 08:42:53","description":"Linsday Miles, 35, began her zero waste lifestyle journey in 2012. Lindsay started with the Plastic free July challenge. She shared her tips to a less wasteful life with FEMAIL.","filename":"data/vaneerConsumption/Zerowastebloggersharestipsonlesswastefullifestyles.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F9D364900000578-0-image-a-141_1493192434218.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4446306_Zero-waste-blogger-shares-tips-wasteful-lifestyles_1540252383.html","title":"Zero-waste blogger shares tips on less wasteful lifestyles","title_page":"Zero-waste blogger shares tips on less wasteful lifestyles | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lindsay Miles, from Western Australia, didn't think that she would be a zero waste blogger and speaker when she first tried to ditch plastic from her daily life.\nBut in 2012 when she embraced the concept of a 'Plastic-free July' challenge, it was the start of a lifestyle change.\nFast forward five years and 35-year-old Lindsay now runs her own workshops on living a less wasteful life, is a writer with two eGuides, and spoke at the TedX Perth conference in October last year.\nLindsay Miles, from Western Australia, is a zero waste lifestyle blogger and author\nShe first embraced the concept of a 'Plastic-free July' challenge, and before she knew it she was hooked on the lifestyle (pictured)\nLindsay's tips for zero waste No plastic Try and reuse glass and paper packaging Take reusable shopping bags to the supermarket Ask your local butcher, deli and supermarket if they will let you use your own containers or jars for loose items, such as nuts\n'I didn't start out as zero waste, I started out as plastic free for a plastic-free July,' Lindsay told Daily Mail Australia.\n'I thought I was pretty sustainable and eco-minded and thought that it would be easy.\n'But I went home and realised how much plastic was in my life!'\nEmbarking on her challenge, at first Lindsay found herself weighed down with glass and paper items.\n'I realised how easy it would be to just stop buying packaged things, so I started buying things in glass and paper instead and it was really heavy.'\nSo from then on, she started to re-use items she already had.\n'People think the zero waste project is about beautiful pictures on Pinterest with beautiful pantries of glass jars and it's not like that for me,' she explained.\nLindsay's handbag essentials: Stainless steel drink bottle, a keep-cup, lunch container, reusable cutlery and cloth bags\n'My pantry is filled with random, assorted glass jars because it didn't make sense to me to go and buy glass jars, when I had so many just sitting there.'\nHaving always been conscious of her impact on the environment, Lindsay said at first her goals seemed too far away.\n'I always thought sustainability was about rainwater tanks and growing your own food but it was all unattainable to me, I couldn't go and save the rain forests,' she said.\nBut she added it's 'a lot more empowering to make a change than worry about the stuff you can't change'.\n'People think the zero waste project is about beautiful pictures on Pinterest with beautiful pantries of glass jars and it's not like that for me,' Lindsay said\nShe said it's not difficult to take a reuseable shopping bag when you do the grocery shop.\n'A great place to start is to look in your recycle bin or in the landfill for items you can use again,' she explained.\n'Try and buy things in glass or paper, not plastic, in the supermarket.'\nLindsay's pantry is 'filled with random, assorted glass jars' that she has reused for storage\nAs well as taking produce bags, ask if your local deli, butcher or supermarket will allow you to take your own containers or cloths for loose products like nuts and meats.\n'Most bulk stores are happy to tare scales but cloth bags can get around this if the store isn't willing or is too busy,' Lindsay said.\nTo tare scales refers to the process of weighing something with the weight of the container removed.\nLike all good things, changing your lifestyle to be zero waste takes time.\n'You've just got to give yourself time to find alternatives, no one changes everything on the first day,' Lindsay said.\nThe family garden: Lindsay and her husband have a luscious green garden at their home\n'Some things will be easy and others you'll struggle with until you find a suitable solution.'\n'Think of all the things you can buy that are reusable or that you can make yourself - there's reusable solutions for almost everything.'\nThe zero waste lifestyle doesn't end with food packaging either.\n'I had this wardrobe of stuff that I didn't really wear or didn't really like, but I guess I felt that if I gave it away I'd be wasting money and being wasteful,' Lindsay said.\nLindsay's minimalist wardrobe used to have over 200 items, and now boasts a modest 40\n'It kind of occurred to me later down the track that if I wasn't wearing it that would be wasteful any way?'\n'I would've had about 200 items of clothing so I told myself once I got down to 100 I'd be okay. So I reduced it down to 100 and realised I still had a lot of stuff.\nLindsay has since whittled her wardobe down to about 40 items of clothing and said that's probably still too much for her.\n'I think the thing with minimalism is not about trying to make do with as little as possible, it's about realising what's enough,' she said.","url":"https://www.dailymail.co.uk/femail/article-4446306/Zero-waste-blogger-shares-tips-wasteful-lifestyles.html"}
