{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:17:50","date_modify":"2018-10-30 21:17:50","date_publish":"2015-11-14 16:07:28","description":"Public school zero tolerance policies may result in a nine-year-0ld Florida boy facing sexual harassment charges for writing a love note to a girl in his fourth grade class. |","filename":"data/vaneerConsumption/ZeroTolerance4thGradeBoyFacesSexualHarassmentChargesforLoveNote.json","image_url":"https://media.breitbart.com/media/2015/11/Love-Note.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_14__1540934270.html","title":"Zero Tolerance: 4th Grade Boy Faces Sexual Harassment Charges for Love Note","title_page":"Zero Tolerance: 4th Grade Boy Faces Sexual Harassment Charges for Love Note","title_rss":"NULL","source_domain":"breitbart.com","text":"Public school zero tolerance policies may result in a nine-year-0ld Florida boy facing sexual harassment charges for writing a love note to a girl in his fourth grade class.\n“He’s nine,” the stunned unidentified mother of the boy told WFTS 13 Tampa Bay. “What little kid doesn’t write love notes?” she asked, commenting that her son had a crush on a girl and thought her eyes “sparkled like diamonds.”\nThe intercepted note displayed a pencil drawn heart. Inside it, it read: “I like you.” He also wrote: “I like your eyes because they sparkle like diamonds.”\nThe mother said when the other students caught wind of her son’s crush, they teased him, claiming he wanted to see the little girl naked. Next, the Hillsborough County school district principal got involved, calling the boy into her office. That very sweet note which likened her eyes to priceless gems may not constitute a jewel heist but the school district said, it could be grounds for level three offenses.\n“That’s when the principal proceeded to tell me that it wasn’t appropriate,” that he wrote the note, the mother explained. “That he was writing the note, and if he writes another note they’re going to file sexual harassment charges on my nine-year-old.”\nThe boy’s mother pointed out her son “doesn’t even know what sexual harassment means.” Does not matter either that school officials acknowledged the notes were not explicit, but they insisted they were “unwanted” by the girl which made them a form of harassment.\nThe Hillsborough County Student Code of Conduct defines formerly age-old lovestruck schoolboy behavior as unacceptable. The district seeks “compliance” to a civility statement intended to foster a safe, harassment free educational community that is also free from disruptions, bullying, and aggressive actions.”\nHarassment is prohibited and falls under Hillsborough County Public Schools Policy 5517 which states “all of its students and school employes have an educational and workplace setting that is safe, secure, and free from harassment and bullying of any kind.” The consequences listed for sexual harassment include up to five days of discretionary in-school or out-of-school suspension, possible further disciplinary action, even a recommendation for expulsion or change of placement, and psychological counseling.\nThe Student Code of Conduct also states that harassment does not refer to occasional compliments or welcomed interactions of a socially acceptable nature, it means bothering another person using written or verbal sexual words, pictures, gestures or conduct that the other person would find offensive, unwanted and unwelcomed.\nQuestion is, does this include hearts drawn on a sheet of lined looseleaf paper by a smitten nine-year-old boy?\nLicensed psychologist Valerie McClain did not believe the youngster’s note with a heart drawn on it was sexual harassment, although she encouraged parents to talk to their children about what boundaries look like and what is considered appropriate behavior. McClain suggested this is where education needs to provide a lesson to this young boy on “how-to” relate to the young girl “or how-to stay away from her, if that’s the goal.”\nHillsborough officials said they tell teachers to discourage all students from passing notes to prevent these types of classroom disruptions. School officials maintained “notes like that can be distracting.”\nLocal news outlets shielded the family’s identity to preserve the minor’s privacy.\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/politics/2015/11/14/zero-tolerance-4th-grade-boy-faces-sexual-harassment-charges-love-note/"}
