{"authors":["Sylvia Longmire"],"date_download":"2018-10-30 19:32:03","date_modify":"2018-10-30 19:32:03","date_publish":"2015-12-03 18:42:13","description":"One of the biggest blows to the Los Zetas drug cartel was dealt when a money laundering empire involving horse racing in Texas was dismantled in 2012.","filename":"data/vaneerConsumption/ZetasSmugglerHorseRacinginMexicoSouthTexasPartofNarcoCulture.json","image_url":"https://media.breitbart.com/media/2015/12/AP_949533658557.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_12_03__1540927923.html","title":"Zetas Smuggler: Horse Racing in Mexico, South Texas ‘Part of Narco Culture’","title_page":"Zetas Smuggler: Horse Racing in Mexico, South Texas ‘Part of Narco Culture’","title_rss":"NULL","source_domain":"breitbart.com","text":"One of the biggest blows to the Los Zetas drug cartel was dealt when a money laundering empire involving horse racing in Texas was dismantled in 2012. A drug smuggler now testifying in that case in San Antonio told the jury that horse racing was part of the trafficking culture, and Los Zetas leaders had been heavily involved in the sport well before the laundering scheme’s ringleaders were arrested.\nAccording to the San Antonio Express-News, Mario Alfonso Cuellar was testifying in the case of Francisco Colorado Cessa, a Mexican businessman accused of helping the Zetas drug cartel launder money. Cuellar said he owned more than 20 horses when he started working for the cartel in 2008.\nTwo former top Zetas leaders, Miguel Treviño Morales and his younger brother Omar, were heavily involved in horse racing prior to Cuellar’s association with the cartel. Miguel, also known as “Z-40” was the Zetas commander until his arrest in July 2013. Omar took over Zetas leadership, until his own arrest in March 2015. Their brother José ran the money laundering operation in Texas.\nCuellar is a US citizen and owned horses on both sides of the border. Through the Treviño brothers, he met Carlos Miguel Nayen Borbolla, a horse buyer for Los Zetas who hung around Retama Park north of San Antonio. Cuellar told the jury that Nayen would arrange for the purchase of horses, then funnel drug money through the Zetas’ straw buyers.\nWhen a horse performed well, the Zetas would arrange a sham sale to [Jose]. One of the first horses the Treviños sent to their brother, First Down Dash, started winning in 2009, so the brothers had their straw buyer pretend to sell it to Jose for $30,000, Cuellar said. “Jose could show $30,000 when the IRS would look at it,” Cuellar said. “The horse had won half a million dollars, so it looked clean.”\nColorado is accused of being in business with Los Zetas, and faces up to twenty years in prison. Cuellar testified that he witnessed Colorado in the company of Z-40 at a private race in the Mexican state of Coahuila. He also said he had turned himself in to authorities in the US because he had crossed Los Zetas, and as a result he feared for his life.\nSylvia Longmire is a border security expert and Contributing Editor for Breitbart Texas. You can read more about cross-border issues in her latest book, Border Insecurity: Why Big Money, Fences, and Drones Aren’t Making Us Safer.","url":"https://www.breitbart.com/border/2015/12/03/zetas-smuggler-horse-racing-mexico-south-texas-part-narco-culture/"}
