{"authors":["Sara Malm For Mailonline","Associated Press"],"date_download":"2018-10-22 21:11:23","date_modify":"2018-10-22 21:11:23","date_publish":"2016-01-29 05:56:36","description":"When Juan Pedro Campos dos Santos from Recife, Brazil, came into the world in December, the circumference of his head was just ten inches, about 20 per cent smaller than normal.","filename":"data/vaneerConsumption/ZikavirusandhowthousandsofBrazilspooresthavebeenaffected.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/08/30B06F1500000578-0-image-a-31_1454056215371.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422221_Life-Zika-epicenter-struggle-afflicted-family_1540242683.html","title":"Zika virus and how thousands of Brazil's poorest have been affected","title_page":"Zika virus and how thousands of Brazil's poorest have been affected | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Around the fifth month of her pregnancy, Daniele Ferreira dos Santos fell ill with a high fever and angry red splotches on her skin. She soon recovered. But weeks later, when she went to the hospital for a prenatal exam, the news was horrific: The baby she was carrying likely had a severe brain injury.\nWhen Juan Pedro Campos dos Santos came into the world in December, the circumference of his head was just ten inches, about 20 per cent smaller than normal.\nMs Santos was never diagnosed with Zika, but she blames the virus for her son's defect and for the terrible toll it has taken on her life. Living in Recife in the northeastern state of Pernambuco, she is at the epicenter of the Zika outbreak, and Pedro is among 4,000 suspected cases of microcephaly that may be connected to the virus, although no link has yet been proven.\nScroll down for video\nEpicenter; Daniele Ferreira dos Santos holds her son Juan Pedro as he undergoes visual exams at the Altino Ventura foundation in Recife, Pernambuco state, an area where hundreds of cases of microcephaly has been found\nMs Santos, pictured holding Juan Pedro, who was born with microcephaly in December, outside her house in Recife, was never diagnosed with Zika, but she blames the virus for her son's defect and for the terrible toll it has taken on her life\nMs Santos, pictured with Juan Pedro and her older daughter Jennipher Karine fell ill with high fever and angry red splotches on her skin in the fifth month of her pregnancy. She soon recovered. But weeks later, a prenatal exam found that the baby had a severe brain injury\nAna Beatriz is held by her father Alipio Martin during a medical appointment at the Altino Ventura Foundation in Recife, Brazil\nAlmost from birth, Pedro cried ceaselessly, as do many babies with microcephaly. He stops only the few hours when he's asleep. During those precious hours, Santos keeps her fingers close to his chest so he has something of her to grab onto. Without that, he pinches himself awake with his tiny fingers.\nHer husband was annoyed by the baby's constant fussing, which distracted him from his television show, she said. He was also deeply chagrined to have a son born imperfectly.\nSo a few weeks after Pedro came home, his father left. He took with him the flat-screen TV that was the centerpiece of their tiny home.\nOriginally from Africa, Zika spread to Asia and was first registered in Brazil in the middle of last year, believed to have been brought to the country by tourists during the World Cup 2014.\nThe virus has since been spreading like wildfire through the northeast thanks in part to the region's widespread poverty, equatorial heat and chronic infestations of the Aedes aegypti mosquito, which also spreads dengue fever and chikungunya.\nDespite the World Health Organisation saying they are 'very, very unlikely' to advise against travelling to Brazil in the next year, officials now fear the rapid spread of the Zika virus may deter sports fans and athletes from attending the Olympic Games next year.\nGleyse Kelly da Silva holds her daughter Maria Giovanna, who was born with microcephaly, as she undergoes visual exams at the Altino Ventura foundation in Recife, Brazil\nMs Santos holds her Juan Pedro as he also undergoes visual exams at the Altino Ventura foundation. Juan Pedro is among 3,400 suspected cases of microcephaly that may be connected to the virus, though no link has yet been proven\nHomes are lit by the setting sun in Ibura, one of the neighborhoods with the highest numbers of suspected cases of children born with microcephaly in Recife, Pernambuco state\nMs Santos, center right, stands outside her house as her ex-husband holds Juan Pedro. Almost from birth, Pedro cried ceaselessly, as do many babies with microcephaly, and her husband became so annoyed at the baby's cries disrupting his favourite television show, that within weeks of the baby's arrival, he left the house with the family's flat screen TV\n'It's the proverbial perfect storm,' said Dr. Albert Ko, a professor of epidemiology with the Yale School of Public Health, adding the region was likely at least one of the initial points of entry for the disease.\n'It may have been one of many introductions, but this is the one that took off,' said Ko. 'In Brazil, infestation rates (of the mosquito) are highest in the northeast because of climactic reasons and socio-economic reasons, so it makes sense that ... it really took off there.'\nMosquitoes have long been an inescapable part of the lives of the Santos family and their neighbors in a slum in Recife's Apipucos neighborhood, where raw sewage flows in ditches, rain water from the frequent downpours in this equatorial city accumulates in fetid puddles, and the shores of a nearby pond are dotted with trash. Each soda bottle, yoghurt container and margarine tub provides an ideal breeding ground for Aedes.\n'The mosquito is in all Recife. If I didn't get it here, I got it at the place I work,' said Santos, a receptionist. 'We all know that the risk (of contracting a mosquito-borne illness) is high.'\nBut it wasn't always this way. Brazil once succeeded in eliminating the Aedes, which is well adapted to humans, lives within people's homes and can breed in just a bottle cap of stagnant water.\nMassive eradication efforts in the 1940s and 1950s allowed the country to be declared free of the mosquito in 1958, but over the decades the insect returned, slowly encroaching from neighboring countries and finding fertile breeding ground in Brazil's sprawling, unplanned cities, with their limited potable water systems and garbage collection.\nDr Valeria Barros treats a six-week old baby born with microcephaly at the Lessa de Andrade polyclinic in Recife, Pernambuco state, Brazil\nJuan Pedro's older sister Jennipher Karine looks inside a room as her brother undergoes exams at the Altino Ventura foundation in Recife\nGleyse Kelly da Silva, 27, holds her daughter Maria Giovanna, who was born with microcephaly, outside their house in Recife\nGabriel plays next to a tank used to collect water, a potential Aedes aegypti mosquito breeding site, outside his house in Recife, Pernambuco state, Brazil. The mosquito is a vector for the proliferation of the Zika virus currently spreading throughout Latin America\n'Because of irregular water distribution, many people, especially in poorer areas collect water in tanks... creating ideal breeding grounds for the mosquitoes,' said Dr. Ceuci Nunes, an infectologist at the Couto Maia Hospital in the northeastern city of Salvador. 'The same goes with trash, which often goes uncollected.'\nNunes also said regional officials' laissez-faire attitude toward eradication also helped fan the mosquito's proliferation, which also resulted in as record numbers of dengue cases in recent years.\n'There has been a lot of carelessness combating the mosquito,' she said, adding that many municipalities simply 'failed to adopt adequate mosquito-fighting measures.'\nIn the face of the spiraling public health crisis, President Dilma Rousseff has declared war on Aedes, with the government promising to deploy some 220,000 members of the Armed Forces to go door-to-door to help educate the population about how to prevent the mosquito's spread.\nStill, officials on the ground in the epicenter of the crisis worry Rousseff's declaration might be hollow.\nRecife's health secretary, Jailson Correia, an infectologist, said the city asked the federal government for $7 million for Aedes eradication programs back in November, as the link between Zika and microcephaly was emerging. The payout only came in January, he said, and it was only $300,000.\nJaqueline Vieira, left, watches as her 3-month-old son Daniel, who was born with microcephaly, as he undergoes physical therapy at the Altino Ventura foundation in Recife\nA doctor takes blood from Luana, who was born with microcephaly, at the Oswaldo Cruz Hospital in Recife. In Brazil, there has been mounting evidence linking Zika infection in pregnant women to a rare birth defect called microcephaly\nLediane da Silva, who is eight months pregnant, is seen in the shanty town of Beco do Sururu, Recife, Brazil. The Brazilian government is now pledging to hand out repellent to low-income pregnant women\nExterminate: A municipal worker sprays insecticide to combat the Aedes aegypti mosquitoes that transmit the Zika virus, at the Imbiribeira neighborhood in Recife\nIn the face of the spiraling public health crisis, President Dilma Rousseff has declared war on Aedes, with the government promising to deploy some 220,000 members of the Armed Forces to go door-to-door to help educate the population about how to prevent the spread\nArea researchers are also exploring whether another type of mosquito endemic to Brazil's northeast could also be a Zika carrier, and if so, whether it too may somehow lead to microcephaly.\nThe carrier of West Nile virus, the Culex quinquefasciatus mosquito, is up to 20 times more prevalent in the region than Aedes, which could help explain the intensity of the Zika outbreak there.\nIf the hypothesis proves true, staunching Zika's spread could prove more difficult than previously thought, said Constancia Ayres, a researcher with the Fiocruz Institute in Recife.\n'If that's the case, the problem is more complex. Only a proper sanitation system would help,' she said. 'Culex reproduces in dirty waters, unlike Aedes.'\nFor the moment, the best way to avoid infection remains avoiding mosquito bites — a tall order in Recife, where worry over Zika's effects has sparked widespread runs on mosquito repellents. And in the few spots where it's still available, frenetic demand has helped push the price for what was already a costly product into the stratosphere.\nIn Recife's airport, a small bottle was running for $8 — a fortune in a region where the per capita household income is around $160 per month, according to the IBGE statistics agency.\nThe Brazilian government is now pledging to hand out repellent to low-income pregnant women, but the gesture is too little too late for the mothers of children with microcephaly.","url":"https://www.dailymail.co.uk/news/article-3422221/Life-Zika-epicenter-struggle-afflicted-family.html"}
