{"authors":["Kate Pickles For Mailonline"],"date_download":"2018-10-22 21:54:58","date_modify":"2018-10-22 21:54:58","date_publish":"2016-01-28 09:23:49","description":"Writing in the Journal of the American Medical Association, experts urged the World Health Organisation to convene an emergency committee of disease experts.","filename":"data/vaneerConsumption/ZikaVirushasexplosivepandemicpotentialasWorldHealthOrganisationurgedtoactNOW.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30AD1E8500000578-0-image-a-5_1454010831417.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3420598_Zika-explosive-pandemic-potential-Scientists-urge-World-Health-Organisation-act-prevent-catastrophe-like-Ebola_1540245298.html","title":"Zika Virus has 'explosive pandemic potential' as World Health Organisation urged to act NOW","title_page":"Zika Virus has 'explosive pandemic potential' as World Health Organisation urged to act NOW  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Scientists today warned the Zika virus has 'explosive pandemic potential'.\nThe World Health Organisation said the mosquito-borne disease had gone from a mild threat to one of alarming proportions and admitted up to four million people could be infected.\nThe agency will convene an emergency committee of disease experts on Monday.\nIt comes after US experts claimed WHO was not taking a leadership role in the Zika pandemic.\nThey said the organisation needed to learn lessons from its handling of the Ebola epidemic where the 'agency's failure to act decisively cost thousands of lives'.\nThe WHO says it has set up measures to fight the spread including surveillance, laboratories for testing, clinical care and vector control - killing off the mosquitoes spreading the infection.\nThe mosquito-borne Zika virus - thought to cause a birth defect where the brain does not develop properly - has rampaged through the Caribbean and Latin America. Now, pregnant Britons planning trips to areas affected by the Zika virus are being urged to reconsider their travel plans because of the risk\nToday it said it expects the virus, which is spreading through the Americas, to affect between three million and four million people.\nMarcos Espinal, an infectious disease expert at the WHO's Americas regional office, said: 'We can expect 3 to 4 million cases of Zika virus disease'. He gave no time frame.\nScientists had accused the agency of failing to take 'a leadership role in the Zika pandemic'.\nThey said this is particularly urgent given the forthcoming 2016 Olympics in Rio de Janeiro, the article in the Journal of the American Medical Association said.\nThe virus has recently rampaged through the Caribbean and Latin America.\nIn particular, there is an unprecedented outbreak in Brazil, where in the past 12 months there have been nearly 4,000 cases of babies being born with abnormally small heads.\nWHO Director-General Margaret Chan told WHO executive board members the level of alarm is 'extremely high'.\n'As of today, cases have been reported in 23 countries and territories in the (Americas) region,' she said at a meeting in Geneva.\nBrazilian President, Dilma Roussef, has urged Latin America to pull together to combat the virus.\nSharing knowledge about the disease is the only way it will be beaten, she told a summit in Ecuador.\nA meeting of regional health ministers has been called for next week.\nMeanwhile, pregnant women have already been officially warned to avoid travelling to South America.\nDr Dipti Patel, of Britain’s National Health Network and Travel Centre, said: ‘All travellers, especially pregnant women going to an area with active Zika virus transmission, should ensure they seek travel health advice from their GP or a travel clinic well in advance.\n‘We strongly advise all travellers to avoid mosquito bites and urge pregnant women to consider avoiding travel to areas reporting Zika transmission.’\nThe US and other world leaders have called for swift action in developing a vaccine for the virus but warned it could take up to a decade.\nScientists Daniel R Lucey and Lawrence O Gostin said an emergency committee should be convened 'immediately' to decide whether to declare a Public Health Emergency of International Concern.\nZika virus is common in parts of Africa and South East Asia, but since 2007 there have been various outbreaks outside of the disease's comfort zone. It spread to South America in 2014, before reaching Mexico and the Caribbean last year. The first US case was reported in Texas at the start of January\nThe Zika virus has been blamed for causing severe brain damage to newborn babies. Gleyse Kelly da Silva holds her daughter Maria Giovanna as she sleeps in their house in Recife, Pernambuco state, Brazil,\n'A national declaration of a public health emergency can focus political attention, while financing a surge in resources,' they wrote.\nThey called on WHO to heed lessons from the Ebola outbreak - in which the organisation was widely criticised for its failure to act decisively.\n'The World Health Organization (WHO) Ebola Panel in July 2015 said that urgent warnings 'either did not reach senior leaders or senior leaders did not recognise their significance.'\n'By many accounts the agency's failure to act decisively cost thousands of lives.'\nBy many accounts the agency's failure to act decisively cost thousands of lives Scientists Daniel R Lucey and Lawrence O Gostin\nThere is currently no vaccine or treatment for Zika, which is a close cousin of dengue and chikungunya, two viruses that cause mild fever and rash.\nApproximately 80 per cent of people who are infected with Zika have no symptoms.\nThe other 20 per cent experience 'mild' symptoms, such as fever, rash, joint pain, and red eyes.\nDr Amesh Adalja, senior associate at the University of Pittsburgh Medical Center, told Daily Mail Online that officials shouldn't expect any fast results.\nDr Adalja told Daily Mail Online: 'There wasn't any vaccine development being undertaken prior to this outbreak in Brazil.\n'It will be quite a while – and this is on the scale of about a decade for a vaccine to be developed usually.'\nThe WHO has warned it will soon spread to all countries across the Americas, except for Canada and Chile.\nThe disease is carried by mosquitos, pictured here in a laboratory of control of epidemiological vectors in San Salvador, El Salvador\nThe Zika virus has been blamed for causing severe brain damage to newborn babies. Pictured is Alice Vitoria Gomes Bezerra, 3 months, who has microcephaly, is held by her father Joao Batista Bezerra in Recife, Brazil\nDr Adalja explained that the public incorrectly assumes a vaccine will be available shortly – because of the rapid vaccine that was made available shortly after the Ebola crisis struck.\nHe said: 'A lot of people might be thinking that all of the sudden they had an Ebola vaccine.\n'This is different from Ebola – that vaccine had been in development for many years.'\nBut now that Zika has become a public health concern, researchers are going into overdrive.\nFirst off, scientists will have to do 'some basic science' to see if parts of the virus can be presented to the immune system, according to Dr Adalja.\nA lot of people might be thinking that all of the sudden they had an Ebola vaccine. This is different from Ebola – that vaccine had been in development for many years Dr Amesh Adalja, senior associate at the University of Pittsburgh Medical Center\nThat phase of the research may involve animal studies in the laboratory – and will involve investigating different ways that the immune system may react to the virus.\nAnd once the first step is completed, scientists will next have to determine whether the vaccine is safe or if it has a high burden of side effects.\nThey will also have to look into if the vaccine triggers any autoimmune reactions.\nThe virus is spread by the same type of mosquito that spreads dengue fever – which has been reported in Florida since 2009.\nProfessor Laura Rodrigues, a fellow of the Brazilian Academy of Sciences and from the London School of Hygiene and Tropical Medicine, warned the virus could potentially affect areas where dengue fever is present.\nThis again could have implications for pregnant women travelling to tropical and sub-tropical climates.","url":"https://www.dailymail.co.uk/health/article-3420598/Zika-explosive-pandemic-potential-Scientists-urge-World-Health-Organisation-act-prevent-catastrophe-like-Ebola.html"}
