{"authors":["Frances Martel"],"date_download":"2018-10-30 20:58:39","date_modify":"2018-10-30 20:58:39","date_publish":"2016-06-21 15:32:08","description":"The Democratic Republic of Congo has declared a yellow fever epidemic, infecting a suspected thousand residents nationwide.","filename":"data/vaneerConsumption/ZikaCarryingMosquitoBringsYellowFeverEpidemictoCongo.json","image_url":"https://media.breitbart.com/media/2016/06/yellow-fever-mom-child-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_06_21__1540933119.html","title":"Zika-Carrying Mosquito Brings Yellow Fever Epidemic to Congo","title_page":"Zika-Carrying Mosquito Brings Yellow Fever Epidemic to Congo","title_rss":"NULL","source_domain":"breitbart.com","text":"The Democratic Republic of Congo has declared an epidemic of yellow fever, affecting the densely populated capital Kinshasa and infecting a suspected thousand residents nationwide.\nReuters notes that Health Minister Felix Kabange was quick to use the word “epidemic,” which triggers particular safeguards, including testing and vaccinations. Only 67 of the thousand cases known have been confirmed, but the presence of yellow fever in Kinshasa, a city of more than 12 million, means the virus could spread rapidly. DR Congo has a nationwide population of 77 million, now at risk to contract a disease spread rapidly through the mosquito aedes aegypti. The regional newspaper The EastAfrican reports that experts at the World Health Organization (WHO) believe yellow fever has seen a resurgence in the region through “increased viral circulation among monkeys in forests.”\nMost of the confirmed cases were from Angola, where the government is also struggling to contain yellow fever. The prevalence of the virus has led to a growing shortage of vaccines, triggering a warning from the WHO to use a fifth of the standard dose of vaccine typically used on individuals. Those vaccinated with a smaller dose will require a vaccine in the future, while the full vaccine is believed to provide lifetime immunity.\nIn Angola, at least 345 people have died of yellow fever in the past seven months. The WHO estimates 3,000 known cases, according to the BBC. Doctors in Angola also note that many yellow fever sufferers also tested positive for another mosquito-borne illness: malaria.\nAngola has responded to the potential for a larger outbreak with strict travel regulations to keep affected nationals from spreading the virus and visitors from contracting it in Angola and spreading it elsewhere.\nYellow fever can be the most serious illness spread through aedes aegypti in severe cases. According to the U.S. Centers for Disease Control (CDC), yellow fever causes “sudden onset of fever, chills, severe headache, back pain, general body aches, nausea, and vomiting, fatigue, and weakness.” It can escalate to triggering symptoms like “high fever, jaundice, bleeding, and eventually shock and failure of multiple organs.” Up to 50 percent of those whose yellow fever progresses may die.\nAedes aegypti is also responsible for spreading dengue fever, chikungunya, and zika virus. In Latin America, populations of aedes aegypti have caused a regional outbreak of Zika virus, leading experts to call for officials to either postpone or relocate the 2016 Summer Olympics, which will be held in Rio de Janeiro. Brazil is the epicenter of the current outbreak.\n“An unnecessary risk is posed when 500,000 foreign tourists from all countries attend the Games, potentially acquire that strain, and return home to places where it can become endemic,” reads a letter signed by more than 150 medical experts sent to the International Olympic Commission (IOC), calling for the event to be relocated or postponed.\nWhile tourists attending the Olympics can carry Zika with them to a previously unaffected area, it is similarly possible that a tourist carrying yellow fever into an area like Rio de Janeiro, known to have high numbers of carrier mosquitos, can introduce that virus into an already vulnerable population.\nThe Brazilian government and the IOC have been adamant that the show will go on, and tourists will be safe from disease. “We estimate that fewer than one in 500,000 visitors to Rio will contract the Zika virus,” Brazilian Health Minister Ricardo Barros said in response to critics. Rio de Janeiro Mayor Eduardo Paes has called concern over the spread of Zika “completely crazy,” accusing those warning that the virus could spread globally of engaging in “a lot of exaggeration.”","url":"https://www.breitbart.com/national-security/2016/06/21/zika-carrying-mosquito-brings-yellow-fever-epidemic-congo/"}
