{"authors":["Derek Gatherer For The Conversation"],"date_download":"2018-10-23 03:31:26","date_modify":"2018-10-23 03:31:26","date_publish":"2016-01-11 16:10:19","description":"Derek Gatherer, a lecturer at Lancaster University warns the virus, which can cause temporary paralysis and has been linked to microcephaly where babies are born with small brains, could cross the Rio Grande in the near future.","filename":"data/vaneerConsumption/Zikaviruslinkedtoincompletebraindevelopmentinnewbornsisspreadingfast.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300BA6D500000578-0-image-a-8_1452528217110.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3394152_Will-Zika-virus-reach-Disease-linked-incomplete-brain-development-newborns-rife-South-America-s-spreading-fast_1540265486.html","title":"Zika virus 'linked to incomplete brain development in newborns is spreading fast'","title_page":"Zika virus 'linked to incomplete brain development in newborns is spreading fast' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Virologists have been expressing concern about Zika virus for a couple of years now.\nBut it’s only with its arrival in Puerto Rico during the holiday season that it has really started to make the news.\nSome of the headlines have focused on the apparent association between Zika infection in pregnant women and the birth of babies with small brains – a condition known as microcephaly.\nThis association is still largely circumstantial, but if true would be extremely alarming.\nZika has also apparently changed its behaviour in other ways, spreading faster, spreading sexually, and also lumbering some survivors with the nasty post-viral Guillain-Barré Syndrome (GBS).\nAlthough GBS can be fatal, the worst GBS manifestation in recovered Zika patients so far has been a partial temporary paralysis.\nThe Zika virus is spread to humans by infected mosquitoes. The most common symptoms are fever, rash, joint pain and conjunctivits. But, health experts in Brazil have become increasingly concerned about a link between the virus and the birth defect, microcephaly, where babies are born with smaller than usual heads\nBased on previous experience, Zika would have seemed an unlikely candidate for the next big global virus scare.\nDiscovered in macaque monkeys in 1947 in Uganda’s Zika forest, it was nearly a decade later that the first human case was detected.\nSpread by mosquito bite, Zika was mild compared to other members of the flavivirus family, which includes the feared yellow fever, dengue fever and West Nile virus.\nNobody was known to have died as a result of Zika infection, and clinical interest was so low that scarcely more than a dozen confirmed cases were described in the medical literature.\nA brief high fever, a rash, some joint pain and in the worst cases a bit of headache and nausea – Zika was barely worse than a dose of flu.\nTHE TURNING POINT\nThe warning bells began to sound quietly in 2007.\nAlthough, prior to that date, public health workers running routine diagnostics had detected antibodies against Zika virus in a wide variety of places in tropical Africa and South-East Asia, which indicated that quite a lot of people had encountered Zika at some point in their lives.\nZIKA VIRUS: THE FACTS Zika virus us spread to people via mosquito bites. The most common symptoms of Zika virus disease are fever, rash, joint pain and conjunctivtis. Infected patients are typically ill for a few days to a week. While the illness is generally mild, some experts in Brazil have suggested a possible link between the virus in pregnant women and subsequent birth defects. The CDC said recently it is aware of reports of increased numbers of babies born with microcephaly, or smaller than expected head size, in Brazil. The Ministry of Health in Brazil is concerned about a possible association between the Zika virus and increased numbers of babies born with microcephaly. There is no vaccine to prevent, or medicine to treat Zika virus. Travellers can protect themselves, by taking steps to prevent mosquito bites. Source: CDC\nBut there was no suggestion that the virus was particularly common or going anywhere fast.\nIn 2007, Zika broke out of its established range, appearing first in the isolated Micronesian island of Yap in the Pacific Ocean some 1,800km east of the Philippines.\nThe Yap outbreak had 180 cases and was the first time Zika cases had been seen in any kind of cluster.\nThings went quiet again until 2013.\nDuring the interval, a study of the evolution of Zika virus concluded that it had probably emerged in east Africa in the early 20th century and spread to South-East Asia around the time of World War II.\nThe Micronesian strain was clearly of Asian origin.\nThen, in 2013, a massive outbreak occurred in Polynesia, in the eastern end of the Pacific Ocean.\nWith the arrival of the Zika virus on Easter Island early in 2014 it was only a matter of time before it reached South America.\nThe exact point of entry is unknown – an international canoe racing tournament or the 2014 World Cup have been mooted – but once Zika had gained a foothold in Brazil it exploded in a way that made even the Pacific Island outbreaks look small.\nPotentially upwards of a million cases have arisen, including the first fatalities and the apparent association between Zika and microcephaly.\nThe alarm bells were now at full volume.\nWith the arrival of Zika virus in Brazil in 2014, there have been upwards of a million cases reported, including the first fatalitites. By the end of last year, the virus had reached Mexico and the Caribbean. Now, experts are concerned it could be a matter of time before it crosses the Rio Grande, pictured, reaching the US\nIS IT HEADING FOR THE US?\nWhereas it had taken Zika a century to cover the ground from Central Africa to the Far East and then another eight years to cross the Pacific, it now turned north like a virus in a hurry.\nBy the end of 2015, Zika had reached Mexico and the Caribbean.\nIt can only be a matter of time before the first case is reported north of the Rio Grande.\nZika’s frenetic progress is now becoming mirrored by increasingly intensive research efforts.\nThere are several salient, but as yet unanswered, questions.\nIs the association with microcephaly real, or is the Brazilian microcephaly spike just a parallel epidemic caused by something else?\nWhy was microcephaly not reported in the Pacific island outbreaks?\nIf the microcephaly association is proved, what does this mean for affected communities?\nCan Zika establish a permanent presence in the US, like its relative West Nile virus, or alternatively will Zika stop at the Mexican border like its cousin, dengue?\nWhat does the similar northward expansion in the range of Aedes mosquitoes mean for both Zika and dengue?\nEvents are moving on an almost daily basis. 2016 may turn out to be the year of Zika.","url":"https://www.dailymail.co.uk/health/article-3394152/Will-Zika-virus-reach-Disease-linked-incomplete-brain-development-newborns-rife-South-America-s-spreading-fast.html"}
