{"authors":["Breitbart London"],"date_download":"2018-10-30 20:58:17","date_modify":"2018-10-30 20:58:17","date_publish":"2017-02-19 17:53:11","description":"AFP — Zimbabwean President Robert Mugabe, who turns 93 on Tuesday, has no plans to give up power, saying he has no \"acceptable\" successor in place. \"The | London / Europe","filename":"data/vaneerConsumption/ZimbabweDictatorMugabeRulesOutRetirementAsheApproaches93rdBirthday.json","image_url":"https://media.breitbart.com/media/2017/02/MUGABE.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_02_19__1540933097.html","title":"Zimbabwe Dictator Mugabe Rules Out Retirement As he Approaches 93rd Birthday","title_page":"Zimbabwe Dictator Mugabe Rules Out Retirement As he Approaches 93rd Birthday","title_rss":"NULL","source_domain":"breitbart.com","text":"AFP — Zimbabwean President Robert Mugabe, who turns 93 on Tuesday, has no plans to give up power, saying he has no “acceptable” successor in place.\n“The call to step down must come from my party, my party at congress, my party at central committee,” Mugabe said in excerpts from a radio broadcast that will air this week and that were printed in the state-owned Sunday Mail newspaper.\n“But then what do you see? It’s the opposite. They want me to stand for elections.”\n“The majority of the people feel that there is no replacement, a successor who to them is acceptable, as acceptable as I am,” he added.\nMugabe, who has kept an iron grip on power since Zimbabwe declared independence in 1980, has repeatedly denied reports of health problems, fuelled in part by frequent trips to Dubai and Singapore.\nHe once quipped that he would rule until he turned 100.\n“Of course if I feel that I can´t do it any more, I will say so to my party so that they relieve me. But for now, I think I can´t say so,” he said.\nBut Mugabe, long known for his fiery speeches, has appeared unusually subdued in recent public appearances, speaking slowly and keeping his addresses short.\nIn September, he read a speech to parliament, apparently unaware that he had delivered the same address a month earlier.\nZimbabwe’s economy has crumbled during Mugabe’s rule, and opponents of his regime are brutally repressed by security forces.\nInflation is rampant, and in recent months the country has experienced cash shortages, with the government struggling to pay civil servants.\nIn December, however, Mugabe’s ZANU-PF party endorsed him once again as its candidate for 2018 elections, but rival factions in the party are already jostling to succeed him.\nHe surprised many in the party in 2014 by naming his wife, Grace, head of its influential women’s wing, spurring rumours that she could be nursing her own presidential ambitions.\nAnd last week, Grace Mugabe, 51, appeared to dash any opponent’s hopes for succeeding him, saying voters would continue to back Mugabe even when he is dead.\n“One day when God decides that Mugabe dies, we will have his corpse appear as a candidate on the ballot paper,” she said.\n“You will see people voting for Mugabe as a corpse.”\nIn the broadcast, Mugabe applauded US President Donald Trump for promoting nationalist policies that he said echoed his “Zimbabwe for Zimbabweans” stance.\n“But he is a radical. I don’t know whether the construction of the wall between America and Mexico is feasible, a feasible proposal. It appears quite nasty.”","url":"https://www.breitbart.com/europe/2017/02/19/zimbabwe-dictator-mugabe-rules-retirement-approaches-93rd-birthday/"}
