{"authors":["John Hayward"],"date_download":"2018-10-30 20:55:49","date_modify":"2018-10-30 20:55:49","date_publish":"2018-08-02 18:04:19","description":"The government of interim president Emmerson Mnangagwa cracks down on protests as Zimbabwe awaits the result of the presidential election.","filename":"data/vaneerConsumption/ZimbabweCracksDownonProtestsHarareBecomesaGhostTown.json","image_url":"https://media.breitbart.com/media/2018/08/zimbabwe-protests.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_08_02__1540932949.html","title":"Zimbabwe Cracks Down on Protests, Harare Becomes a ‘Ghost Town’","title_page":"Zimbabwe Cracks Down on Protests, Harare Becomes a ‘Ghost Town’","title_rss":"NULL","source_domain":"breitbart.com","text":"The government of interim President Emmerson Mnangagwa cleared the streets of Harare with troops and police on Thursday, turning the capital city into a “ghost town,” as several foreign media outlets described it.\nThe Zimbabwean Election Commission still has not announced the results of the hotly-contested presidential election or given a firm indication of when such an announcement might be forthcoming.\nQhubani Moyo, head of the ZEC, would only say that his organization hopes it will “soon be able to give the results of the presidential elections.”\nThe latest indications from the ZEC are that the results could be announced late Thursday afternoon, although in theory Zimbabwean election laws allow the commission to take up to three more days. Foreign observers expressed “grave concern” over election violence on Thursday and encouraged the ZEC to publish the results as “expeditiously” as possible.\n“The commission urges the candidates to call for peace and withdraw supporters from any violence. We need peace as we finalize the process and verify the results,” Moyo pleaded.\nProtests turned violent in Harare on Wednesday after the results of the parliamentary election were announced, giving Mnangagwa’s ZANU-PF party a two-thirds majority. The opposition MDC party claimed ZANU-PF rigged the vote and Mnangagwa was trying to steal the election.\n“We have collated results from the 80% of the polling stations that we’re allowed to do so and we’re very clear that we’re going to win. There is no way with the 20% they are going to win. If the result is such that if we didn’t win then certainly it’s not the reflection of what the people of Zimbabwe did on the 30th,” an MDC spokesman confidently declared on Thursday.\nSuch pronouncements indicate more protests will be coming if Mnangagwa declares victory over MDC challenger Nelson Chamisa. Mnangagwa blamed Chamisa for stoking unrest with his claims of election tampering and promised an independent investigation of the clashes that killed three people on Wednesday.\nThe BBC reported Harare was on lockdown Thursday. A government truck was spotted rolling through the deserted streets, filled with police and soldiers who shouted, “Behave yourself, people of Zimbabwe!” at the populace. A squad of riot police surrounded the MDC headquarters.\nA search warrant was issued against Chamisa and other opposition leaders on Wednesday, charging them with “possession of dangerous weapons” and inciting “public violence.”\n“We have unarmed civilians being attacked. Is that normal even in a banana republic?” Chamisa responded.\n“We have won the election,” he insisted at a press conference on Thursday. “What they have been trying to do of late is play around—that is rigging, that is manipulation, trying to bastardize the result, and that we will not allow.”\nChamisa said he has received no communication from Mnangagwa since the Wednesday riot, contradicting Mnangagwa’s claim to be working with the opposition leader to minimize violence.\nBritain’s ambassador to Zimbabwe, Catriona Laing, condemned the “excessive use of force” by government troops during the riots and demanded soldiers be removed from the streets.\nInternational observers have expressed reservations about voter suppression and other irregularities, but have thus far refrained from calling the election hopelessly tainted or invalid. The Chinese Foreign Ministry said on Thursday that its observers described the Zimbabwean election as “generally peaceful and orderly.”","url":"https://www.breitbart.com/national-security/2018/08/02/zimbabwe-cracks-down-protests-harare-ghost-town/"}
