{"authors":["Jack Bezants For Mailonline"],"date_download":"2018-10-22 20:53:21","date_modify":"2018-10-22 20:53:21","date_publish":"2016-01-29 04:49:10","description":"Zlatan Ibrahimovic is renowned for an unprecedented level of self-confidence, but Derby manager Paul Clement thinks the striker's career in football is owed to his attitude towards the game.","filename":"data/vaneerConsumption/ZlatanIbrahimovicissoarroganthesactuallylikeablesaysDerbymanagerandformerPSGcoachPaulClement.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/04/3080EBEA00000578-0-image-a-193_1454042909644.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422184_Zlatan-Ibrahimovic-arrogant-s-actually-likeable-says-Derby-manager-former-PSG-coach-Paul-Clement_1540241601.html","title":"Zlatan Ibrahimovic is 'so arrogant he's actually likeable' says Derby manager and former PSG coach Paul Clement","title_page":"Zlatan Ibrahimovic is 'so arrogant he's actually likeable' says Derby manager and former PSG coach Paul Clement | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Zlatan Ibrahimovic is renowned for an unprecedented level of self-confidence, but Derby manager Paul Clement thinks the striker's career in football is owed to his attitude towards the game.\nThe 43-year-old Clement worked with the Sweden striker at Paris Saint-Germain and, on the eve of Derby's FA Cup fourth round clash with Manchester United, delivered a fascinating insight into how Ibrahimovic approaches football.\n'Zlatan Ibrahimovic has tremendous leadership qualities,' Clement told The Times. 'He was the hardest I'd ever seen on his own team-mates about standards, whether the kind of ball, the effort, off-the-field stuff.\nDerby manager Paul Clement says that Zlatan Ibrahimovic (left) 'has tremendous leadership qualities'\nClement also praised Paris Saint-Germain striker Ibrahimovic for the standard he expects from his team\nDerby manager Clement is preparing his team to play Manchester United in the FA Cup fourth round\n'Some of them just crumbled. That's a big part of why he's got to where he is. He's so arrogant he's actually likeable.'\nClement worked with Ibrahimovic from 2012 until 2013 but laments the fact the Swede has never been in England to ply his trade in the Premier League.\n'It is really sad he never played in England. He would have been brilliant for the game,' Clement said.\n'He's bright, he's got unbelievable charisma, he's a gentleman and unbelievable talent.'\nClement (second left) worked with Ibrahimovic during his time as an assistant to Carlo Ancelotti at PSG\nClement acknowledged Ibrahimovic's condfience, saying he is 'so arrogant he's actually likeable'\nClement believes that Sweden striker Ibrahimovic would have excelled if he had played in England\nAs well as working at PSG as a coach alongside Carlo Ancelotti, Clement also worked with the Italian at Chelsea and Real Madrid.","url":"https://www.dailymail.co.uk/sport/football/article-3422184/Zlatan-Ibrahimovic-arrogant-s-actually-likeable-says-Derby-manager-former-PSG-coach-Paul-Clement.html"}
