{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 23:25:07","date_modify":"2018-10-22 23:25:07","date_publish":"2017-03-16 06:37:51","description":"She is the daughter of two leading showbusiness stars. So no wonder Zoe Kravitz was looking to the red carpet born as she posed up a storm at a gala in New York on Wednesday","filename":"data/vaneerConsumption/ZoeKravitzstunstrousersuitgoldentopartmuseumgala.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E51E1FD00000578-0-image-a-20_1489642932827.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318904_Zoe-Kravitz-stuns-trouser-suit-golden-art-museum-gala_1540250707.html","title":"Zoe Kravitz stuns trouser suit golden top art museum gala","title_page":"Zoe Kravitz stuns trouser suit golden top art museum gala | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is the daughter of two leading showbusiness stars.\nSo no wonder Zoe Kravitz was looking to the red carpet born as she posed up a storm wearing Oscar de la Renta at a gala in New York on Wednesday.\nThe blonde beauty looked like she was having a great time as she showcased her fabulous figure before mingling with some fellow celebrities at the Whitney Biennial at The Whitney Museum of American Art.\nGolden girl: Zoe Kravitz stole the show in Oscar de la Renta at the Whitney Biennial at The Whitney Museum of American Art in New York on Wednesday\nThe 28-year-old fine filly looked in good form indeed in her black Oscar de la Renta trouser suit, which she combined with a golden top by the designer, high heels and black French calf TRO bag with 24 kt gardenia. She accessorized with Tiffany & Co. jewelry.\nIndeed she managed to outshine such beauties as overrated guitarist St. Vincent, who was famously once Kristen Stewart's lover, and Girls star Zosia Mamet.\nZoe is the daughter of self-styled rock star Lenny Kravitz and his former Cosby Show star wife Lisa Bonet.\nAnd her decision to follow in her mother's footsteps seems wise, as she has been getting reasonable reviews for her most recent role in hit TV series Big Little Lies.\nA Bonet lass: The daughter of Cosby Show star Lisa was looking in fine form donning Tiffany & Co. jewelry\nTrousering all the attention: She certainly wore her Oscar de la Renta trouser suit with confidence\nMy Girl: She looked thrilled to be posing up with Zosia Mamet\nThe HBO drama, which features a star-studded cast of Nicole Kidman, Reese Witherspoon, Alexander Skarsgard and Laura Dern, tells the tale of three mothers whose apparently perfect lives unravel to the point of murder.\nHowever, it seems she will soon land an even larger Potter gold after it emegred she will be having a larger role in the second Fantastic Beasts movie.\nSpeaking about her return, director David Yates said: 'Yes. Leta Lestrange comes into the second movie.'\n'She’s quite complicated and damaged and confused, and Newt (Eddie Redmayne) is absolutely still in love with her.'\nA blonde moment: She took great delight in flaunting her unique hairstyle","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318904/Zoe-Kravitz-stuns-trouser-suit-golden-art-museum-gala.html"}
