{"authors":["Anam Syed"],"date_download":"2018-10-30 23:16:07","date_modify":"2018-10-30 23:16:07","date_publish":"2014-08-13 21:01:17","description":"Between your Spawn of Jaws: The Birth and Shark of Darkness: Wrath of the Submarine, there's no lack of sensational titles to make you wanna tune into Discovery Channel's Shark Week. But while those shows are pretty self-explanatory content wise,…","filename":"data/vaneerConsumption/ZombieSharksAretheStuffOfNightmaresSoThanksForTheSleepDeprivationSharkWeek.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/8/3df48d20-5e9b-4e21-9017-886b77d7da9e-getty-507387982.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35490-zombie-sharks-are-the-stuff-of-nightmares-so-thanks-for-the-sleep-deprivation-shark-week_1540941367.html","title":"Zombie Sharks Are the Stuff Of Nightmares - So Thanks For The Sleep Deprivation, Shark Week","title_page":"Zombie Sharks Are the Stuff Of Nightmares — So Thanks For The Sleep Deprivation, Shark Week","title_rss":"NULL","source_domain":"bustle.com","text":"Between your Spawn of Jaws: The Birth and Shark of Darkness: Wrath of the Submarine, there's no lack of sensational titles to make you wanna tune into Discovery Channel's Shark Week. But while those shows are pretty self-explanatory content wise, some aren't as clear. For example, what exactly is the show Zombie Shark going to cover, and do you have to be afraid of some lurching undead sea monster the next time you hit the waves?\nIf the titles have you reeling back with a \"that can't possibly be real\" you're not totally wrong, even if each program is meticulously curated with the help of researchers. Entertainment Weekly reports on the curious case of how Discovery Channel picks their show names. As you might have guessed, many a time, they create the title through a mix of what's trending and what sounds cool, and then the geniuses at Discovery build some kind of factual show around it.\nMashups are a popular starting point, says Discovery's development and production VP Michael Sorenson, so if someone comes into the room with a Sharkcano, the next step becomes finding out if sharks swim around volcanoes, and if they do you've got a show. Sometimes the real world throws them a bone, like the punny-named, but totally real \"Joan of Shark\" that's been hanging around Aussie shores and getting some news and research coverage.\nDiscovery on YouTube\nThe EW piece notes Zombie Sharks was no different. They knew they definitely wanted the words \"shark\" and \"zombie\" together, and then built a show around that. It's not all lies though, Discovery is careful to match their ideas with real research, and according to Sorensen frame it in a way audiences can \"understand what it is.\" Which is a great move, because I'm more likely to tune into Zombie Sharks than I am Tonic Immobility in Great Whites which is what the show is actually about.\nSo what the heck is Tonic Immobility? While the name conjures up a big toothy thing that's going after our braaaiins underwater, it's actually sharks that are the victims. Think of tonic immobility as basically \"playing dead.\" Basically, someone noticed that orcas were attacking great white sharks, so diver Eli Martinez hit the ocean to see if he could lull sharks into a temporary sleep state, which would make them vulnerable. In 1997, researchers observed a female orca inducing the state by holding a shark upside down for 15 minutes, an act that — if intentional — definitely puts the \"killer\" in killer whale.\nWhile playing dead is generally a defense tactic to deter a predator, it works against the sharks here (the jury is still out, but some hypothesize sharks somehow utilize the practice in mating, which is why it can be induced sort of willy nilly). It's not the first time this phenomenon has been covered. National Geographic delved into the topic with the less awesomely titled The Whale That Ate Jaws , about orcas predatory behavior toward great whites (which covers the incident with the female orca).\nSo, it's not really an undead shark we're talking about here, but it's definitely a catatonic shark, which definitely does earn the zombie moniker. Bonus: the next time you feel guilty about vegging out with a Netflix marathon, just remember you technically are still crushing it by living like it's Shark Week (as long as you dedicate yourself to remaining completely still).\nImage: filmtvgifs/Tumblr","url":"https://www.bustle.com/articles/35490-zombie-sharks-are-the-stuff-of-nightmares-so-thanks-for-the-sleep-deprivation-shark-week"}
