{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-22 23:50:03","date_modify":"2018-10-22 23:50:03","date_publish":"2016-01-11 07:38:10","description":"The serrated knives, up to two-foot long, are sold by online retailers and shops as a collectors item, supposedly to be used to exterminate the undead but are being used by gangs as status symbols.","filename":"data/vaneerConsumption/ZombiekillerknivessettobebannedafterbeingusedbygangsinUK.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/07/3005B5B200000578-0-image-a-48_1452497428939.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393506_Sale-Zombie-killer-knives-set-banned-Serrated-weapons-inspired-horror-movies-available-online-just-8-increasingly-used-gangs_1540252203.html","title":"'Zombie killer' knives set to be banned after being used by gangs in UK","title_page":"'Zombie killer' knives set to be banned after being used by gangs in UK | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Police want to ban lethal 'zombie killer' knives which are sold as collectors items but are now being used as status symbols by gangs.\nThe serrated knives, up to two-foot long, are sold by online retailers and shops as a collectors item, supposedly to be used to exterminate the undead, for as little as £8.\nPolice forces have called for an outright ban on the knives, which officers say have so many edges and points that the internal damage from an attack would be fatal.\nThe serrated knives, up to two-foot long, are sold by online retailers and shops as a collectors item, supposedly to be used to exterminate the undead, for as little as £8.\nIt comes as Scotland Yard warns that they are being used by teenage gang members to pose in videos to intimidate gang rivals.\nThe news comes after a 16-year-old was stabbed to death at a party in London on Saturday.\nPolice say the knives are becoming more common and officers found a two-foot 'apocalypse head decapitator' in an alley way in east London last year.\nCalls for the ban come amid concerns over a seven-year knife crime high, with 19 people killed by knives last year - the highest since 2008.\nIt is believed that police bosses and home office officials decided to make a move to ban the weapons at a meeting last month, reports The Independent.\nWhile the sales are relatively low, there are concerns over the number of points and edges on the knives, which would mean that an attack could be lethal.\nAnd with more young people acquiring them as a status symbol, attacks become increasingly likely.\nPolice found a two-foot 'apocalypse head decapitator' in an alley way in east London last year\nAlf Hitchcock, chief constable of the Ministry of Defence Police and lead on knife crime for the National Police Chiefs' Council, said: 'These are absolutely horrific weapons for which there can be no legitimate use,' reports The Independent.\nHe added: 'You only have to look at the combination of the pointed and serrated edges to see that any injury would be fatal. The serrations would cause such serious internal damage to anyone that it would be fatal.'\nPolice launched a crackdown on knife crime last year, introducing tougher laws after a spate of stabbings in London.\nThe new two-strike rule means that repeat offenders will get a mandatory six month prison sentence for carrying a knife.\nTalk of the ban comes as 16-year-old Charlie Kutuyampowas stabbed to death at a party with around 100 other young people at a social club on the Ashton playing fields in Woodford.\nHe got into a confrontation with four male youths outside the club before one stabbed him, police said. They then fled towards nearby Chigwell Road.\nFriends at the party tried to save him before police and paramedics arrived at around 9.40pm, but he died just over an hour later at Whipps Cross University Hospital.\nIt is the first murder of a teenager in the capital this year. Nineteen were murdered in 2015, of whom 15 were stabbed.\nForensics officers recovered two knives from near the scene today, one a silver kitchen knife and the other a black-handled knife, but it is not yet clear whether either was involved in the stabbing.","url":"https://www.dailymail.co.uk/news/article-3393506/Sale-Zombie-killer-knives-set-banned-Serrated-weapons-inspired-horror-movies-available-online-just-8-increasingly-used-gangs.html"}
