{"authors":["Associated Press"],"date_download":"2018-10-23 02:34:02","date_modify":"2018-10-23 02:34:02","date_publish":"2017-03-16 13:04:40","description":"COLUMBUS, Ohio (AP) - An Ohio zoo says necropsy results for the world's first gorilla born in a zoo indicate she probably died of a heart attack.The...","filename":"data/vaneerConsumption/ZooCountrysoldestgorillaprobablydiedofheartattack.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/15/wire-229171-1489677570-42_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320206_Zoo-Countrys-oldest-gorilla-probably-died-heart-attack_1540262042.html","title":"Zoo: Country's oldest gorilla probably died of heart attack","title_page":"Zoo: Country's oldest gorilla probably died of heart attack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"COLUMBUS, Ohio (AP) - An Ohio zoo says necropsy results for the world's first gorilla born in a zoo indicate she probably died of a heart attack.\nThe 60-year-old Colo had been the country's oldest known living gorilla, having surpassed captive gorillas' usual life expectancy by two decades. She died in her sleep at the Columbus Zoo and Aquarium in mid-January.\nThe zoo's vice president of animal health tells The Columbus Dispatch that age takes its toll on gorillas as it does with humans. Veterinarians had removed a malignant tumor from Colo, but the necropsy found no indication that the problem returned.\nFILE - In this Dec. 22, 2016, file photo, Colo, the world's first gorilla born in a zoo, sits inside her enclosure during her 60th birthday party at the Columbus Zoo and Aquarium in Powell, Ohio. The January 2017 death of the gorilla, then the oldest known gorilla in the U.S., was probably due to a heart attack, according to necropsy results the zoo received Wednesday, March 15, 2017. (AP Photo/Ty Wright, File)\nColo was born at the zoo in 1956. She eventually became a mother of three, grandmother of 16, great-grandmother of 12 and great-great-grandmother of three.","url":"https://www.dailymail.co.uk/wires/ap/article-4320206/Zoo-Countrys-oldest-gorilla-probably-died-heart-attack.html"}
