{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 01:20:01","date_modify":"2018-10-23 01:20:01","date_publish":"2016-01-29 15:05:22","description":"Ben Stiller, busy promoting fashion-loving film Zoolander 2, was embracing all things Paris on Friday as he filmed another promo during Paris Haute Couture Fashion Week.","filename":"data/vaneerConsumption/Zoolander2sBenStillergivesitsomeBlueSteelduringParispromoshoot.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B2D74200000578-0-image-a-55_1454079724136.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422852_Ben-Stiller-gives-Blue-Steel-gets-Parisian-spirit-Zoolander-2-promo-shoot_1540257601.html","title":"Zoolander 2's Ben Stiller gives it some Blue Steel during Paris promo shoot","title_page":"Zoolander 2's Ben Stiller gives it some Blue Steel during Paris promo shoot  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's widely regarded as one of the style capitals of the world.\nAnd so Ben Stiller, busy promoting fashion-loving film Zoolander 2, was embracing all things Paris on Friday as he filmed another promo during Paris Haute Couture Fashion Week.\nRocking a Breton stripe top and wielding French baguettes, Derek Zoolander was not without his signature Blue Steel pout as he filmed on a barge.\nScroll down for video\nNo pain, no gain: Ben Stiller got back to his character Derek Zoolander for a promo for Zoolander 2 on Friday in Paris\nThe character, known for his eccentricities as a world-leading yet dimwitted fashion model, threw himself into the outdoor shoot, striking a pose in top-to-toe leather.\nHe was animated and jumped about the barge, using his outstretched limbs and bold facial expression to capture the perfect image like a true pro.\nDerek had his hair spiked up and his designer shades tipped on the end of his nose to complete an edgy look.\nGet a loaf of him: The star used all of the French stereotypes to prove that he was in Paris for the shoot\nShooting: The star reprised his role 15 years after the original film and is now promoting the sequel\nIn 2016, Derek Zoolander modelled for Vogue magazine, Zoolander No. 2 perfume and the new Fiat 500 commercial.\nActor Ben has by now mastered the characteristics of his alter-ego, after revisiting the role 15 years on from the original film.\nPromo for the film continues after it premiered in Australia, where he declared Derek 'the father of the duckface' or modern-day selfie pout.\nPout at the BREAD-y! He wore a Breton stripe top and weilded some French loaves\nJump for joy: He used his bold facial expressions to try to get the right shot\n'Hello Frants': The actor jumped for joy, holding a souvenir, as the cast were photographed\n'This is in-seine': Justin Theroux comically captioned this selfie snapshot of him and Ben by the River Seine\nShooting til late: The shoot seemed to run until late, but that didn't stop Derek\nComeback: The star recently hinted that there could be a third part - but not for another 15 years\nHe said: 'It sort of feels like the social media was beckoning Derek out of the shadows. I had to educate the younger generation where it comes from, their roots. They don't even know.'\nFollowing the success and fashion-backing of the second part, the actor went on to tease a third installment.\nHe added to Australian press 'Zoolander 3? In another 15 years, maybe. We’ll see.'\nTheir comeback was announced last March when they made a surprise appearance at the Valentino Paris Fashion Week show.\nSelfie king: He recently said that he is the king of the selfie, he just didn't know if before social media\nTaking a bite: The actor was playful as they captured some more comical shots\nWhen in Paris: He made the best of being in France and snapped himself with the Eiffel Tower\nPromo trail is in full swing; Following the photo shoot, Will Ferrell, Stiller and Wilson took part in a press conference ahead of the film's Paris an screening\nHaving his say: Justin Theroux - who has co-written the sequel to the popular comedy - also put in an appearance\nNo one has the Blue Steel nailed like Zoolander himself: The actor inadvertently pulled his signature expression as the cast answered questions from the media","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422852/Ben-Stiller-gives-Blue-Steel-gets-Parisian-spirit-Zoolander-2-promo-shoot.html"}
