{"authors":[],"date_download":"2018-10-22 22:21:11","date_modify":"2018-10-22 22:21:11","date_publish":"2014-06-09 21:14:10","description":"Mark Zuckerberg and other members of Facebook's board have been sued by a shareholder who claimed a stock award policy is unreasonably generous.","filename":"data/vaneerConsumption/ZuckerbergOtherFacebookDirectorsSuedOverPayPlan.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/442466/140514-zuckerberg-facebook-f8-mms-1403_6617733aea46792c65b632062b834d7e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_zuckerberg-other-facebook-directors-sued-over-pay-plan-n126716_1540246871.html","title":"Zuckerberg, Other Facebook Directors Sued Over Pay Plan","title_page":"Zuckerberg, Other Facebook Directors Sued Over Pay Plan","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMark Zuckerberg and other members of Facebook's board have been sued by a shareholder who claimed a policy letting them annually award directors more than $150 million of stock each if they choose is unreasonably generous.\nIn a complaint filed Friday night in Delaware Chancery Court, Ernesto Espinoza said the board was \"essentially free to grant itself whatever amount of compensation it chooses\" under the social media company's 2012 equity incentive plan, which also covers employees, officers and consultants.\nHe said the plan annually caps total awards at 25 million shares and individual awards at 2.5 million, and in theory lets the board annually award directors $156 million in stock each, based on Friday's closing price of $62.50. The lawsuit does not contend that such large sums will be awarded.\nEspinoza also said last year's average $461,000 payout to non-employee directors was too high, being 43 percent larger than typical payouts at \"peer\" companies such as Amazon.com and Walt Disney Co. that on average generated twice as much revenue and three times more profit.\nFacebook spokeswoman Genevieve Grdina said in an email: \"The lawsuit is without merit and we will defend ourselves vigorously.\"\nA spokeswoman for Robbins Arroyo, a law firm representing the plaintiff, had no immediate comment.\nThe lawsuit alleges breach of fiduciary duty, waste of corporate assets and unjust enrichment.\nIt seeks to force directors to repay Facebook for alleged damages sustained by the Menlo Park, California-based company, and to impose \"meaningful limits\" subject to shareholder approval about how much stock the board can award itself.\nAmong the other defendants is Facebook Chief Operating Officer Sheryl Sandberg, a director whose compensation was $16.15 million in 2013, according to a regulatory filing. She is worth $999 million, Forbes magazine said on Monday.\nZuckerberg made $653,165 last year, a regulatory filing shows, and Forbes said his net worth is $27.7 billion.\nEspinoza was also a plaintiff in a 2010 shareholder case in Delaware against Hewlett-Packard concerning its handling of the resignation of Chief Executive Mark Hurd over his relationship with a former contractor.\n-Reuters","url":"https://www.nbcnews.com/business/business-news/zuckerberg-other-facebook-directors-sued-over-pay-plan-n126716"}
