{"authors":["Julia Hahn"],"date_download":"2018-10-30 19:12:08","date_modify":"2018-10-30 19:12:08","date_publish":"2016-07-19 03:04:54","description":"Mark Zuckerberg's pro-amnesty lobbying group, FWD.us, launched a new website attacking Donald Trump’s plan to enforce U.S. immigration law.","filename":"data/vaneerConsumption/ZuckerbergsFWDusRampsUpAttackonTrump.json","image_url":"https://media.breitbart.com/media/2015/08/donald-trump-mark-zuckerberg-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_18__1540926728.html","title":"Zuckerberg's FWD.us Ramps Up Attack on Trump","title_page":"Project Fear 2.0: Zuckerberg's FWD.us Ramps Up Attack on Trump","title_rss":"NULL","source_domain":"breitbart.com","text":"Mark Zuckerberg’s pro-amnesty lobbying group, FWD.us, has launched a new website attacking Donald Trump’s plan to enforce U.S. immigration law.\nAs Recode reports: “Mark Zuckerberg-backed FWD.us is escalating its attacks on Donald Trump’s immigration policies as the candidate prepares to accept the Republican party’s presidential nomination in Cleveland. The immigration reform group launched a website, Trump365, that explores the human and economic toll of deporting an estimated 11 million people.”\nFWD.us is comprised of CEOs from Microsoft, Google, and other tech companies that stand to gain enormously from the large-scale importation of low-wage foreign labor.\nIn 2013, FWD.us lobbied for Marco Rubio’s border-opening amnesty and immigration expansion bill. In 2015, Zuckerberg threw his support behind a bill to increase the controversial H-1B program, which would have allowed for a virtually unlimited expansion of Muslim migration.\nFWD.us’s push for more foreign labor comes at a time when 94 million Americans are currently outside the workforce and as skilled American workers around the country are being axed and replaced with low-wage, untrained foreign labor.\nThe new FWD.us anti-Trump website offers grave predictions about the calamity that would occur if the U.S. were to enforce its immigration laws.\nThe website warns that enforcing laws would “deface our communities,” “crush small businesses,” “crush the economy,” “depress local vibrancy,” “enable big government,” and even “spur food shortages.”\n“Crops would rot in the field and farms would go bankrupt without the hands needed to help with the harvest,” the website writes. “Prices of produce, meat, and dairy would skyrocket.”\nDonald Trump has previously urged the American electorate to “reject” the “campaign of fear” pushed by powerful corporations and Hillary Clinton donors, who want America’s borders to remain open.\n“If we’re going to deliver real change, we’re going to have to reject the campaign of fear and intimidation being pushed by powerful corporations, media elites, and political dynasties,” Trump has said. “The people who rigged the system for their benefit will do anything — and say anything — to keep things exactly as they are… [They] want to scare America into thinking small — and they want to scare the American people out of voting for a better future.”\nTrump’s declaration seemed to echo the sentiment of Brexit advocates, who successfully encouraged U.K. voters to ignore what was dubbed Project Fear, in which the Remain campaign recruited establishment politicians and executives from multinational firms to offer dire warnings about the ramifications of a possible Brexit. Project Fear seemed designed to convince the victims of globalization that they had to remain in their current economic structure.\nZuckerberg’s pro-amnesty lobbying group seems to be relying on this same fear tactic.\nIn the website’s background, there’s a running loop featuring black-and-white images of helicopters flying overhead, razor wires, and military troops marching down streets.\n“Mass deportation would turn the U.S. into a police state, requiring a huge increase in government size,” the website writes.\nThe website does not mention that more than 2 million of the 11 million — or nearly 1 in 5 — illegal immigrants are criminal aliens, as the Senate Immigration Subcommittee has noted.\nIn the corner of the anti-Trump website, there’s a clock marking the days of Trump’s administration and how many deportations are underway. As one scrolls down the website’s page, the clock begins to count days and deportations.\nZuckerberg’s group writes:\nIf put into effect, mass deportation would cost our country from $735 billion to $935 billion over the next 20 years—an outrageous price that would be passed on to American taxpayers. Trump’s “plan” would also deliver a devastating blow to government programs that are supported by undocumented taxpayers living in the U.S. who pay $11.64 billion in state and local taxes every year.\nHowever, studies have shown that repatriating the illegal immigrant population would actually save U.S. taxpayers money.\nA 2010 report from the Federation for American Immigration Reform found that illegal immigration costs U.S. taxpayers a net total of nearly $100 billion annually.\nThe report found that illegal immigration cost U.S. taxpayers a total of $113 billion a year — this includes the cost of education, subsidized housing, food stamps, tax credits, medical expenses. The report then “accounts for taxes paid by illegal aliens [which is] about $13 billion a year, resulting in a net cost to taxpayers of about $100 billion.”\nContrary to the website’s suggestions, the Heritage Foundation’s Robert Rector has explained that “unlawful immigrants, on average, are always tax consumers… They never once generate a ‘fiscal surplus’ that can be used to pay for government benefits elsewhere in society.”\nData from a 2010 report conducted by Rector shows that for every illegal immigrant household that leaves the U.S. under Trump’s plan, Americans would recoup nearly three-quarters of a million dollars ($719,350).\nThe website’s fear mongering seems reminiscent of recent statements made by Republican House Speaker Paul Ryan. During a CNN town hall event in which he articulated his opposition to the signature immigration policy of his Party’s presumptive nominee, Ryan said that the American people wouldn’t want to “see what we’d have to do to the country” to enforce immigration laws.\n“I don’t think rounding up 11 million people (A) is the right thing to do, (B) would work,” Ryan said. “And I don’t think you’d like to see what we’d have to do to the country to do that.”\nZuckerberg’s pro-amnesty lobbying group has been a big booster of Paul Ryan’s in the past.\nIn 2013, the pro-amnesty group spent $350,000 on an ad-buy designed to convince conservative voters that Ryan does not support amnesty — even though Ryan supports giving citizenship to illegal immigrants.\nJust last week, Ryan announced that, immediately after his primary election, he plans to bring up legislation on so-called “criminal sentencing” reform that could release thousands of criminal illegal aliens from prison onto the streets.","url":"https://www.breitbart.com/politics/2016/07/18/project-fear-zuckerberg-pro-amnesty-lobbying-firm-ramps-attack-trump/"}
